[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "history", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Even in America, you had people praising the socialist model of the Soviet Union, holding it up to be a valid alternative for the United States&amp;#39; capitalism and free markets that they perceived to have failed the working class. In debates however, all that ever came up were the failures of planned policy through collectivisation and agricultural reform (e.g. USSR in the 20&amp;#39;s and 30&amp;#39;s, Mao&amp;#39;s five year plans, etc.) but what never came up was the existence of gulags and death camps for political prisoners. People who had different thoughts exposed, or simply went against party directives and so on.&lt;/p&gt;\n\n&lt;p&gt;My question is - did they not know about them at all, or did they simply say &amp;quot;Well, that&amp;#39;s not true socialism.&amp;quot; as they tend to do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Even in America, you had people praising the socialist model of the Soviet Union, holding it up to be a valid alternative for the United States' capitalism and free markets that they perceived to have failed the working class. In debates however, all that ever came up were the failures of planned policy through collectivisation and agricultural reform (e.g. USSR in the 20's and 30's, Mao's five year plans, etc.) but what never came up was the existence of gulags and death camps for political prisoners. People who had different thoughts exposed, or simply went against party directives and so on.\n\nMy question is - did they not know about them at all, or did they simply say \"Well, that's not true socialism.\" as they tend to do?", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64xfeq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "Heavily_Implied", "saved": false, "mod_reports": [], "name": "t3_64xfeq", "subreddit_name_prefixed": "r/history", "approved_by": null, "over_18": false, "domain": "self.history", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh53", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/history/comments/64xfeq/did_day_to_day_americans_or_simply_regular/", "num_reports": null, "locked": false, "stickied": false, "created": 1492023477.0, "url": "https://www.reddit.com/r/history/comments/64xfeq/did_day_to_day_americans_or_simply_regular/", "author_flair_text": null, "quarantine": false, "title": "Did day to day Americans - or simply regular citizens from outside the Iron Curtain or other socialist nations - know about Soviet or other nations' gulags?", "created_utc": 1491994677.0, "distinguished": null, "media": null, "upvote_ratio": 0.71, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64xfeq", "likes": null, "replies": "", "user_reports": [], "id": "dg5sava", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "dutchbob1", "parent_id": "t3_64xfeq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "yes, it was general knowledge\n\nEspecially since the publication of this book in 1973\n\nhttps://en.wikipedia.org/wiki/The_Gulag_Archipelago", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yes, it was general knowledge&lt;/p&gt;\n\n&lt;p&gt;Especially since the publication of this book in 1973&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/The_Gulag_Archipelago\"&gt;https://en.wikipedia.org/wiki/The_Gulag_Archipelago&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5sava", "score_hidden": false, "stickied": false, "created": 1492028598.0, "created_utc": 1491999798.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64xfeq", "likes": null, "replies": "", "user_reports": [], "id": "dg61x76", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Vorengard", "parent_id": "t3_64xfeq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "In the 60s and 70s, the Soviet Union invested a great deal of time and money into convincing the world that there were no more Gulags, and they were very successful in doing so. Their efforts were greatly aided by a sympathetic American press, who reported the Soviets crafted series of events unerringly, but several KGB defectors confirm that there were still Gulags holding millions of people well into the 70s.\n\nI'd highly recommend watching the interview \"Deception Was My Job\" by Yuri Bezmenov. He was a Soviet defector who spent years manipulating the press while working for the KGB. You can find the entire thing on YouTube.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the 60s and 70s, the Soviet Union invested a great deal of time and money into convincing the world that there were no more Gulags, and they were very successful in doing so. Their efforts were greatly aided by a sympathetic American press, who reported the Soviets crafted series of events unerringly, but several KGB defectors confirm that there were still Gulags holding millions of people well into the 70s.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d highly recommend watching the interview &amp;quot;Deception Was My Job&amp;quot; by Yuri Bezmenov. He was a Soviet defector who spent years manipulating the press while working for the KGB. You can find the entire thing on YouTube.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg61x76", "score_hidden": false, "stickied": false, "created": 1492041004.0, "created_utc": 1492012204.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64xfeq", "likes": null, "replies": "", "user_reports": [], "id": "dg6160i", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SwampFox1775", "parent_id": "t3_64xfeq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "from getting into many discussions I think most people are attributing their favorability of socialism to that of capitalist countries with high taxes and lots of government services like in Scandinavia.  using \"government ownership of the means of production\" as the line, most \"socialists\" I know don't want the government to \"run\" the businesses, just heavily tax and regulate them.\n\nHopefully I'm not stepping on Rule #2, but when I sarcastically reference Pol Pot's 100% employment \"jobs program\" the socialists I talk to usually say he wasn't a socialist, but a dictator.\n\nI think Winston Churchill put it best.\n&gt;“No Socialist Government conducting the entire life and industry of the country could afford to allow free, sharp, or violently-worded expressions of public discontent. They would have to fall back on some form of Gestapo, no doubt very humanely directed in the first instance. And this would nip opinion in the bud; it would stop criticism as it reared its head, and it would gather all the power to the supreme party and the party leaders, rising like stately pinnacles above their vast bureaucracies of Civil servants, no longer servants and no longer civil.”\n&gt;\n&gt;--Winston Churchill, 4th June 1945", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;from getting into many discussions I think most people are attributing their favorability of socialism to that of capitalist countries with high taxes and lots of government services like in Scandinavia.  using &amp;quot;government ownership of the means of production&amp;quot; as the line, most &amp;quot;socialists&amp;quot; I know don&amp;#39;t want the government to &amp;quot;run&amp;quot; the businesses, just heavily tax and regulate them.&lt;/p&gt;\n\n&lt;p&gt;Hopefully I&amp;#39;m not stepping on Rule #2, but when I sarcastically reference Pol Pot&amp;#39;s 100% employment &amp;quot;jobs program&amp;quot; the socialists I talk to usually say he wasn&amp;#39;t a socialist, but a dictator.&lt;/p&gt;\n\n&lt;p&gt;I think Winston Churchill put it best.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“No Socialist Government conducting the entire life and industry of the country could afford to allow free, sharp, or violently-worded expressions of public discontent. They would have to fall back on some form of Gestapo, no doubt very humanely directed in the first instance. And this would nip opinion in the bud; it would stop criticism as it reared its head, and it would gather all the power to the supreme party and the party leaders, rising like stately pinnacles above their vast bureaucracies of Civil servants, no longer servants and no longer civil.”&lt;/p&gt;\n\n&lt;p&gt;--Winston Churchill, 4th June 1945&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg6160i", "score_hidden": false, "stickied": false, "created": 1492040172.0, "created_utc": 1492011372.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64xfeq", "likes": null, "replies": "", "user_reports": [], "id": "dg5tzxe", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "kenspiracy66", "parent_id": "t3_64xfeq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "People are still ignoring the obvious to this day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People are still ignoring the obvious to this day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5tzxe", "score_hidden": false, "stickied": false, "created": 1492031391.0, "created_utc": 1492002591.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64xfeq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64xfeq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64xfeq", "likes": null, "replies": "", "user_reports": [], "id": "dg6wvsw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoelTrotsky", "parent_id": "t1_dg6tino", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "The list of atrocities the Soviets did is long. I was personally very touched standing at the Neva gates in St. Petersburg, imagining all the people who passed through the gates, were loaded onto a boat and dumped in the ocean. Much more powerful when you are standing at the gate thinking about it. However the words 'death camps' has a specific meaning since WWII. It doesn't include terribly hard work places, it doesn't include forced marches until you die, it doesn't include not being given enough food to survive.  It means a facility solely designed to kill people efficiently. I haven't heard of such a facility in Soviet history.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The list of atrocities the Soviets did is long. I was personally very touched standing at the Neva gates in St. Petersburg, imagining all the people who passed through the gates, were loaded onto a boat and dumped in the ocean. Much more powerful when you are standing at the gate thinking about it. However the words &amp;#39;death camps&amp;#39; has a specific meaning since WWII. It doesn&amp;#39;t include terribly hard work places, it doesn&amp;#39;t include forced marches until you die, it doesn&amp;#39;t include not being given enough food to survive.  It means a facility solely designed to kill people efficiently. I haven&amp;#39;t heard of such a facility in Soviet history.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg6wvsw", "score_hidden": false, "stickied": false, "created": 1492075372.0, "created_utc": 1492046572.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6tino", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kjoygray75", "parent_id": "t1_dg5z3je", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "The Soviets certainly did run death camps.\n\nThis is from the Nazino affair. 4000 of 6000 people \"deported\" to the island died. They were dumped onto a small island with no food except for flour, which they mixed with river water to eat. The Soviets knew that these people were going to die. \n\n\"On the island there was a guard named Kostia Venikov, a young fellow. He was courting a pretty girl who had been sent there. He protected her. One day he had to be away for a while, and he told one of his comrades, \"Take care of her,\" but with all the people there the comrade couldn't do much.... People caught the girl, tied her to a poplar tree, cut off her breasts, her muscles, everything they could eat, everything, everything.... They were hungry, they had to eat. When Kostia came back, she was still alive. He tried to save her, but she had lost too much blood.\"\n\nDuring dekulakization, a portion of the \"outdated elements\" were separated to be shot outright, while many of the others died from famine after being relocated. Holdomor was also the Soviet's responsibility and widely considered an intentional genocide. Granted that's straying off topic a but because it was indirect and not in a \"death-camp\" style setting, but if you think they never rounded up civilians for the purpose of killing them then that's a bit naive. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Soviets certainly did run death camps.&lt;/p&gt;\n\n&lt;p&gt;This is from the Nazino affair. 4000 of 6000 people &amp;quot;deported&amp;quot; to the island died. They were dumped onto a small island with no food except for flour, which they mixed with river water to eat. The Soviets knew that these people were going to die. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;On the island there was a guard named Kostia Venikov, a young fellow. He was courting a pretty girl who had been sent there. He protected her. One day he had to be away for a while, and he told one of his comrades, &amp;quot;Take care of her,&amp;quot; but with all the people there the comrade couldn&amp;#39;t do much.... People caught the girl, tied her to a poplar tree, cut off her breasts, her muscles, everything they could eat, everything, everything.... They were hungry, they had to eat. When Kostia came back, she was still alive. He tried to save her, but she had lost too much blood.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;During dekulakization, a portion of the &amp;quot;outdated elements&amp;quot; were separated to be shot outright, while many of the others died from famine after being relocated. Holdomor was also the Soviet&amp;#39;s responsibility and widely considered an intentional genocide. Granted that&amp;#39;s straying off topic a but because it was indirect and not in a &amp;quot;death-camp&amp;quot; style setting, but if you think they never rounded up civilians for the purpose of killing them then that&amp;#39;s a bit naive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg6tino", "score_hidden": false, "stickied": false, "created": 1492071311.0, "created_utc": 1492042511.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5z3je", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NoelTrotsky", "parent_id": "t3_64xfeq", "subreddit_name_prefixed": "r/history", "controversiality": 1, "body": "I think you're blurring together the way the economy is run with the way dissent is handled. They really are separate and should be considered carefully.\n\n'failures of planned policy' I would argue is in fact incorrect in many situations people claim it failed. Soviet industrialization between WWI and WWII was a great success and likely the main reason the Soviets defeated Germany in WWII. Agricultural reform experienced many problems however it was a huge sector of the economy and much more difficult to modernize. The theories used in the Soviet agricultural reforms are what eventually happened in the West when machinery improved enough to displace most labor. Small farming has been all but eliminated in the Industrial world now. The Soviets were ahead of the curve.\n\nThe Soviets never ran 'death' camps. Not many countries have. Gulags were a place of extremely hard work and poor conditions, absolutely. However many people survived them and were released after their time was served. \n\nI would argue the Soviets had a much larger challenge than most new 'governments' in educating citizens on the new 'rules'. Russia was practically a Feudal society prior to the October Revolution. That revolution brought about one of the largest changes in society structure in the history of mankind. Akin to the French revolution which also changed many ways society operated.  Obviously such a large change is going to be difficult for people and 're-education' will be needed. Sadly a proper system to do such was taken over by an authoritarian leader and abused terribly. Used to cement his rule over everyone...standard dictator stuff really.\n\nAnyway, to answer your question. Everyone knew about the Gulags. Everyone knew that ideological dissent was being punished. Hell even the US was going to go through McCarthyism and a high profile Communist witchhunt through it's upper political class falsely branding many as traitors. At that time period ideological 'limits' were more accepted. We live in a 'free'er' society now where those limits being applied seems terrible. It was common world wide to include ideological 'crimes' in real world punishment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re blurring together the way the economy is run with the way dissent is handled. They really are separate and should be considered carefully.&lt;/p&gt;\n\n&lt;p&gt;&amp;#39;failures of planned policy&amp;#39; I would argue is in fact incorrect in many situations people claim it failed. Soviet industrialization between WWI and WWII was a great success and likely the main reason the Soviets defeated Germany in WWII. Agricultural reform experienced many problems however it was a huge sector of the economy and much more difficult to modernize. The theories used in the Soviet agricultural reforms are what eventually happened in the West when machinery improved enough to displace most labor. Small farming has been all but eliminated in the Industrial world now. The Soviets were ahead of the curve.&lt;/p&gt;\n\n&lt;p&gt;The Soviets never ran &amp;#39;death&amp;#39; camps. Not many countries have. Gulags were a place of extremely hard work and poor conditions, absolutely. However many people survived them and were released after their time was served. &lt;/p&gt;\n\n&lt;p&gt;I would argue the Soviets had a much larger challenge than most new &amp;#39;governments&amp;#39; in educating citizens on the new &amp;#39;rules&amp;#39;. Russia was practically a Feudal society prior to the October Revolution. That revolution brought about one of the largest changes in society structure in the history of mankind. Akin to the French revolution which also changed many ways society operated.  Obviously such a large change is going to be difficult for people and &amp;#39;re-education&amp;#39; will be needed. Sadly a proper system to do such was taken over by an authoritarian leader and abused terribly. Used to cement his rule over everyone...standard dictator stuff really.&lt;/p&gt;\n\n&lt;p&gt;Anyway, to answer your question. Everyone knew about the Gulags. Everyone knew that ideological dissent was being punished. Hell even the US was going to go through McCarthyism and a high profile Communist witchhunt through it&amp;#39;s upper political class falsely branding many as traitors. At that time period ideological &amp;#39;limits&amp;#39; were more accepted. We live in a &amp;#39;free&amp;#39;er&amp;#39; society now where those limits being applied seems terrible. It was common world wide to include ideological &amp;#39;crimes&amp;#39; in real world punishment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg5z3je", "score_hidden": false, "stickied": false, "created": 1492037875.0, "created_utc": 1492009075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_64xfeq", "likes": null, "replies": "", "user_reports": [], "id": "dg63pyr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AgoraiosBum", "parent_id": "t3_64xfeq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "You're rather vague as to time here, but in general, the USSR was heavily involved in both censorship and propaganda, and even during the famines of the 1930s, would take people on tours of Ukraine to show how 'good' things are. They were fake tours, but designed to fool people, and it often worked. \n\nThe gulags were in remote areas, and before the major use of satellite reconnaissance, it was difficult to know what was going on. \n\nFor some time, some people didn't know about them, others were told but didn't believe it. When people get evidence that conflicts with what they want to believe, they often reject it as false - because it doesn't fit with what they \"know\" to be true. \n\nThe publication of the Gulag Archipelago was a watershed moment in this, though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re rather vague as to time here, but in general, the USSR was heavily involved in both censorship and propaganda, and even during the famines of the 1930s, would take people on tours of Ukraine to show how &amp;#39;good&amp;#39; things are. They were fake tours, but designed to fool people, and it often worked. &lt;/p&gt;\n\n&lt;p&gt;The gulags were in remote areas, and before the major use of satellite reconnaissance, it was difficult to know what was going on. &lt;/p&gt;\n\n&lt;p&gt;For some time, some people didn&amp;#39;t know about them, others were told but didn&amp;#39;t believe it. When people get evidence that conflicts with what they want to believe, they often reject it as false - because it doesn&amp;#39;t fit with what they &amp;quot;know&amp;quot; to be true. &lt;/p&gt;\n\n&lt;p&gt;The publication of the Gulag Archipelago was a watershed moment in this, though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dg63pyr", "score_hidden": false, "stickied": false, "created": 1492042936.0, "created_utc": 1492014136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]