[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "history", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Was the &amp;quot;stiff upper lip,&amp;quot; &amp;quot;Keep Calm and Carry On&amp;quot; etc. attitude toward hardships and inconvenience always a part of British culture, or was it something that came into being in WWll? If it did originate earlier, when, and why, did it?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m asking because it strikes me that I&amp;#39;ve seen a LOT of films/TV about the British and they all use this national trait as a lynch pin in one way or other, no matter, it seems, what time period is being dealt with. However, to me, it seems uniquely WW ll era, very Churchill-esque. Just keeping in the groove or an invention born of circumstance?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Was the \"stiff upper lip,\" \"Keep Calm and Carry On\" etc. attitude toward hardships and inconvenience always a part of British culture, or was it something that came into being in WWll? If it did originate earlier, when, and why, did it?\n\n I'm asking because it strikes me that I've seen a LOT of films/TV about the British and they all use this national trait as a lynch pin in one way or other, no matter, it seems, what time period is being dealt with. However, to me, it seems uniquely WW ll era, very Churchill-esque. Just keeping in the groove or an invention born of circumstance?", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hhpy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "HelenGon", "saved": false, "mod_reports": [], "name": "t3_65hhpy", "subreddit_name_prefixed": "r/history", "approved_by": null, "over_18": false, "domain": "self.history", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh53", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/history/comments/65hhpy/stiff_upper_lip_always_a_part_of_british_culture/", "num_reports": null, "locked": false, "stickied": false, "created": 1492261863.0, "url": "https://www.reddit.com/r/history/comments/65hhpy/stiff_upper_lip_always_a_part_of_british_culture/", "author_flair_text": null, "quarantine": false, "title": "\"Stiff Upper Lip\" always a part of British Culture?", "created_utc": 1492233063.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": "", "user_reports": [], "id": "dgar66i", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "kevlarbuns", "parent_id": "t3_65hhpy", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I think that's a cool issue worth exploring.  The British have a reputation as being exceptionally tough, which was obviously exemplified in WWII, but also extends to just about every war they've taken part in.\n\nTheir contribution in WWI was incredible as well.  Despite having such a small professional army at the start of the war, they were incredibly effective.  The amount of pressure they withstood in Belgium and The Somme could have easily broken most armies.\n\nEven during the Spring Offensive of 1918 when the Germans threw half a million troops at the British in one area, their lines never broke.  They lost a whole lot of ground and hung on by the skin of their teeth, but never broke.", "edited": 1492282541.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s a cool issue worth exploring.  The British have a reputation as being exceptionally tough, which was obviously exemplified in WWII, but also extends to just about every war they&amp;#39;ve taken part in.&lt;/p&gt;\n\n&lt;p&gt;Their contribution in WWI was incredible as well.  Despite having such a small professional army at the start of the war, they were incredibly effective.  The amount of pressure they withstood in Belgium and The Somme could have easily broken most armies.&lt;/p&gt;\n\n&lt;p&gt;Even during the Spring Offensive of 1918 when the Germans threw half a million troops at the British in one area, their lines never broke.  They lost a whole lot of ground and hung on by the skin of their teeth, but never broke.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgar66i", "score_hidden": false, "stickied": false, "created": 1492298388.0, "created_utc": 1492269588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": "", "user_reports": [], "id": "dgdphfi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HelenGon", "parent_id": "t1_dgdk8ci", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "&gt;continued defiance was arguably more cunning and long-sighted than plucky and brave.\n\nWell, it seems like apples and oranges to me. Like I said, I'm not trying to romanticize anything, but the facts remain. Not only during that war, but during the Irish terrorism of the post-war period. Despite bombings, Britons still went to work and took the tube and maintained themselves with a bit of dignity, as I recall. Which is what I expected from my own country when we got our dose, but must say pretty disappointed in that regard.\n\nAnyway, cheers to you for your thorough and interesting answers! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;continued defiance was arguably more cunning and long-sighted than plucky and brave.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, it seems like apples and oranges to me. Like I said, I&amp;#39;m not trying to romanticize anything, but the facts remain. Not only during that war, but during the Irish terrorism of the post-war period. Despite bombings, Britons still went to work and took the tube and maintained themselves with a bit of dignity, as I recall. Which is what I expected from my own country when we got our dose, but must say pretty disappointed in that regard.&lt;/p&gt;\n\n&lt;p&gt;Anyway, cheers to you for your thorough and interesting answers! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgdphfi", "score_hidden": false, "stickied": false, "created": 1492475221.0, "created_utc": 1492446421.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk8ci", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shindigero", "parent_id": "t1_dgckfhr", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "My point that I'm making is that the idea of a national temperament (such as the British stiff upper lip) is just inherently false. It is true that after Dunkirk Britain stood alone against Germany but at the time the people of Britain would not unanimously have been in favour of carrying on the war. Many politicians were in favour of a negotiated surrender with Germany and it was a sensible position. Britain had lost badly in France but had managed to save its army from destruction. It was only really Churchill and his unexpected rise to power that kept the country at war. His personality has since been applied to the nation as a whole and is probably the source of how many imagine Britain to be as a nation. He was very determined and certainly brave but I think its easy to overplay how dire the country's position was after Dunkirk. We were alone but we were also the largest empire on earth. Germany was trying to sink our shipping but even at their most efficient the U-Boats only managed to sink less than 1% of British tonnage. The Luftwaffe was beginning the Blitz but, while for several months Londoners and others in Coventry and elsewhere suffered terribly, the Germans couldnt keep it up. The RAF didnt fold like the other airforces they'd faced and it wasnt a fight the Luftwaffe could ultimately win without the allocation of significant resources that Hitler couldnt afford. Its true that if Britain had surrendered Germany would have much more likely to succeed in the long run. But Britain was pretty safe and their (Churchill's) continued defiance was arguably more cunning and long-sighted than plucky and brave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My point that I&amp;#39;m making is that the idea of a national temperament (such as the British stiff upper lip) is just inherently false. It is true that after Dunkirk Britain stood alone against Germany but at the time the people of Britain would not unanimously have been in favour of carrying on the war. Many politicians were in favour of a negotiated surrender with Germany and it was a sensible position. Britain had lost badly in France but had managed to save its army from destruction. It was only really Churchill and his unexpected rise to power that kept the country at war. His personality has since been applied to the nation as a whole and is probably the source of how many imagine Britain to be as a nation. He was very determined and certainly brave but I think its easy to overplay how dire the country&amp;#39;s position was after Dunkirk. We were alone but we were also the largest empire on earth. Germany was trying to sink our shipping but even at their most efficient the U-Boats only managed to sink less than 1% of British tonnage. The Luftwaffe was beginning the Blitz but, while for several months Londoners and others in Coventry and elsewhere suffered terribly, the Germans couldnt keep it up. The RAF didnt fold like the other airforces they&amp;#39;d faced and it wasnt a fight the Luftwaffe could ultimately win without the allocation of significant resources that Hitler couldnt afford. Its true that if Britain had surrendered Germany would have much more likely to succeed in the long run. But Britain was pretty safe and their (Churchill&amp;#39;s) continued defiance was arguably more cunning and long-sighted than plucky and brave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgdk8ci", "score_hidden": false, "stickied": false, "created": 1492469035.0, "created_utc": 1492440235.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckfhr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HelenGon", "parent_id": "t1_dgbw4tt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "&gt; Britain was and always has been full of opportunistic criminals, pacifists, deserters, communists, fascists, all sorts of people who did not fit with the government's myth of a nation completely united.\n\nHm! Don't worry, I don't let Downton Abbey persuade me that it's all garden parties and upstairs intrigue over there, either :) A TV show I watched that very much speaks to your point is Foyle's War, about police work being done during the war, dealing with the black market, etc. Very well done, I thought. \n\nI'm certainly not romanticizing \"S.U.L.\" I was just curious how it all got started, btw.\n\nYou seem to be saying, and I'm very interested in your POV as a Brit and a native Londoner, that it's somewhere between a myth and an aspiration, or that it was always just propaganda? and never really existed at all? I don't think anybody assumed you weren't scared shitless during the Blitz, or were unaffected by the deaths and destruction. But it was straight up bravery, was it not, that kept you from crying \"Uncle!\" to the Germans and surrendering? Churchill's convictions aside, it was, in the end, the British people who would not give in, which allowed the Allies to use England as a staging ground for bombing missions deep into Germany, and, most significantly, the launching point of D-Day. Without plucky England, I'm unaware of alternatives, at least anything as potentially successful, which is not propaganda, but fact. Justifiable fear, underground criminality, and diverse politics aside, the world owes Britain a debt, in that regard, imo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Britain was and always has been full of opportunistic criminals, pacifists, deserters, communists, fascists, all sorts of people who did not fit with the government&amp;#39;s myth of a nation completely united.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hm! Don&amp;#39;t worry, I don&amp;#39;t let Downton Abbey persuade me that it&amp;#39;s all garden parties and upstairs intrigue over there, either :) A TV show I watched that very much speaks to your point is Foyle&amp;#39;s War, about police work being done during the war, dealing with the black market, etc. Very well done, I thought. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m certainly not romanticizing &amp;quot;S.U.L.&amp;quot; I was just curious how it all got started, btw.&lt;/p&gt;\n\n&lt;p&gt;You seem to be saying, and I&amp;#39;m very interested in your POV as a Brit and a native Londoner, that it&amp;#39;s somewhere between a myth and an aspiration, or that it was always just propaganda? and never really existed at all? I don&amp;#39;t think anybody assumed you weren&amp;#39;t scared shitless during the Blitz, or were unaffected by the deaths and destruction. But it was straight up bravery, was it not, that kept you from crying &amp;quot;Uncle!&amp;quot; to the Germans and surrendering? Churchill&amp;#39;s convictions aside, it was, in the end, the British people who would not give in, which allowed the Allies to use England as a staging ground for bombing missions deep into Germany, and, most significantly, the launching point of D-Day. Without plucky England, I&amp;#39;m unaware of alternatives, at least anything as potentially successful, which is not propaganda, but fact. Justifiable fear, underground criminality, and diverse politics aside, the world owes Britain a debt, in that regard, imo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgckfhr", "score_hidden": false, "stickied": false, "created": 1492405159.0, "created_utc": 1492376359.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbw4tt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "shindigero", "parent_id": "t3_65hhpy", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "What must be remembered about Britain is that while it remained on the side of democracy during the wars of the 20th century that does not mean its government was any less involved in the production of propaganda than its fascist or communist counterparts. It is certainly the case that the stereotype of the Briton at war as a grimly determined bulldog character was in part due to its unusually professional army. The British regular had probably seen more hardship and campaigning in his time than a German  or french conscript or later American GI so he probably would seem to have quite a stuff  a upper lip by comparison. But on the home front the mythic idea of the British population keeping calm and carrying on is simply false or at best disingenuous. For many parts of the country this wasn't particularly hard. Britain was never invaded and apart from rationing there weren't many hardships placed on civilians. It was fairly easy for britain to give the impression of remaining calm when panzers and jackbooted stormtroopers weren't streaming through the countryside as they were elsewhere in Europe. The areas of the country most under pressure were those subjected to aerial bombardment by the Luftwaffe. I'll take London as an example as it's where I've grown up and where my family is from. There is a collective delusional remembering of the London Blitz in this country as being a bit of (what Londoners would call) a knees up. Every night the Jerries would come over and all the cockneys would convene in the tunnels of the London Underground for a good old sing-song then back upstairs to work in the morning waving Fritz goodbye. There is nothing special about Britain. When you have to spend your nights in a damp tunnel listening to incendiary bombs fall overhead it's hard to keep calm and carry on. When you wake up in the morning to find that Mrs Brown from down the street got hit by a V2 last night your upper lip won't be too stiff. The government publicised and pushed an image of resilience, milkmen making the rounds through bombed out streets, but there was another side to London which really flourished during the war. Criminality. That was the true winner in 1940. Hundreds of gangsters and petty criminals let out early found a city with a police force diminished by the loss of many of its men to the armed forces. Armed robberies, black market profiteering and looting of bombed buildings were all rife and aided by the enforced Blackout. This was the London that was supposedly a shining example of Britain's unflappable stoicism in the face of adversity. Don't believe propaganda. The stiff upper lip is a fallacy. Britain was and always has been full of opportunistic criminals, pacifists, deserters, communists, fascists, all sorts of people who did not fit with the government's myth of a nation completely united.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What must be remembered about Britain is that while it remained on the side of democracy during the wars of the 20th century that does not mean its government was any less involved in the production of propaganda than its fascist or communist counterparts. It is certainly the case that the stereotype of the Briton at war as a grimly determined bulldog character was in part due to its unusually professional army. The British regular had probably seen more hardship and campaigning in his time than a German  or french conscript or later American GI so he probably would seem to have quite a stuff  a upper lip by comparison. But on the home front the mythic idea of the British population keeping calm and carrying on is simply false or at best disingenuous. For many parts of the country this wasn&amp;#39;t particularly hard. Britain was never invaded and apart from rationing there weren&amp;#39;t many hardships placed on civilians. It was fairly easy for britain to give the impression of remaining calm when panzers and jackbooted stormtroopers weren&amp;#39;t streaming through the countryside as they were elsewhere in Europe. The areas of the country most under pressure were those subjected to aerial bombardment by the Luftwaffe. I&amp;#39;ll take London as an example as it&amp;#39;s where I&amp;#39;ve grown up and where my family is from. There is a collective delusional remembering of the London Blitz in this country as being a bit of (what Londoners would call) a knees up. Every night the Jerries would come over and all the cockneys would convene in the tunnels of the London Underground for a good old sing-song then back upstairs to work in the morning waving Fritz goodbye. There is nothing special about Britain. When you have to spend your nights in a damp tunnel listening to incendiary bombs fall overhead it&amp;#39;s hard to keep calm and carry on. When you wake up in the morning to find that Mrs Brown from down the street got hit by a V2 last night your upper lip won&amp;#39;t be too stiff. The government publicised and pushed an image of resilience, milkmen making the rounds through bombed out streets, but there was another side to London which really flourished during the war. Criminality. That was the true winner in 1940. Hundreds of gangsters and petty criminals let out early found a city with a police force diminished by the loss of many of its men to the armed forces. Armed robberies, black market profiteering and looting of bombed buildings were all rife and aided by the enforced Blackout. This was the London that was supposedly a shining example of Britain&amp;#39;s unflappable stoicism in the face of adversity. Don&amp;#39;t believe propaganda. The stiff upper lip is a fallacy. Britain was and always has been full of opportunistic criminals, pacifists, deserters, communists, fascists, all sorts of people who did not fit with the government&amp;#39;s myth of a nation completely united.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgbw4tt", "score_hidden": false, "stickied": false, "created": 1492365125.0, "created_utc": 1492336325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": "", "user_reports": [], "id": "dgb96yc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HelenGon", "parent_id": "t1_dgar4h8", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Thanks! This was pretty much exactly what I was looking for. I'd be interested to watch the show as well, naturally. The blog posts delved even more deeply than I thought to ask, i.e., the general lack of emotionalism (or abject terror of the same) of the British. \n\nTo go a little \"free style\" with what I know of British history, possibly a combination of their Roman lineage (hard asses, to be sure) and their ancient German ancestors (ditto hard asses) established the attitude early on, later codified by a reaction against all things European, and moving into their role as rulers of the world. \n\nThanks again!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! This was pretty much exactly what I was looking for. I&amp;#39;d be interested to watch the show as well, naturally. The blog posts delved even more deeply than I thought to ask, i.e., the general lack of emotionalism (or abject terror of the same) of the British. &lt;/p&gt;\n\n&lt;p&gt;To go a little &amp;quot;free style&amp;quot; with what I know of British history, possibly a combination of their Roman lineage (hard asses, to be sure) and their ancient German ancestors (ditto hard asses) established the attitude early on, later codified by a reaction against all things European, and moving into their role as rulers of the world. &lt;/p&gt;\n\n&lt;p&gt;Thanks again!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgb96yc", "score_hidden": false, "stickied": false, "created": 1492323136.0, "created_utc": 1492294336.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgar4h8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Waitingforadragon", "parent_id": "t3_65hhpy", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "This series of blog posts gets to the heart of the issue. \n\nhttps://emotionsblog.history.qmul.ac.uk/2012/10/the-history-of-the-stiff-upper-lip-part-1/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This series of blog posts gets to the heart of the issue. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://emotionsblog.history.qmul.ac.uk/2012/10/the-history-of-the-stiff-upper-lip-part-1/\"&gt;https://emotionsblog.history.qmul.ac.uk/2012/10/the-history-of-the-stiff-upper-lip-part-1/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgar4h8", "score_hidden": false, "stickied": false, "created": 1492298321.0, "created_utc": 1492269521.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": "", "user_reports": [], "id": "dgb62x0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "christorino", "parent_id": "t3_65hhpy", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Propaganda a bit helped in ww2 to emphasise it more.  Britain was under immense pressure, France had been lost and Germany was conquering all around it.  Under attack from the Luftwaffe daily was tough and they held on in the battle of Britain as they rallied to save troops at Dunkirk where Churchill famously called all ships to go, this meant a lot were actually civilian fishing boats or even pleasure yachts.  \n\nI always see it as \"get on with your duty\" as we see Britain's success in conquering and maintaining her colonies which required huge administration capabilities, which helps with military capabilities.  You have to remember Britain had never been successfully invaded since William the Conqueror and it's questionable whether he was an invader or the true heir according to Edward the confessor lack of a proper heir\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Propaganda a bit helped in ww2 to emphasise it more.  Britain was under immense pressure, France had been lost and Germany was conquering all around it.  Under attack from the Luftwaffe daily was tough and they held on in the battle of Britain as they rallied to save troops at Dunkirk where Churchill famously called all ships to go, this meant a lot were actually civilian fishing boats or even pleasure yachts.  &lt;/p&gt;\n\n&lt;p&gt;I always see it as &amp;quot;get on with your duty&amp;quot; as we see Britain&amp;#39;s success in conquering and maintaining her colonies which required huge administration capabilities, which helps with military capabilities.  You have to remember Britain had never been successfully invaded since William the Conqueror and it&amp;#39;s questionable whether he was an invader or the true heir according to Edward the confessor lack of a proper heir&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgb62x0", "score_hidden": false, "stickied": false, "created": 1492318818.0, "created_utc": 1492290018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": "", "user_reports": [], "id": "dgb9yf9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rurikton", "parent_id": "t3_65hhpy", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I can't remember where I read it but I remember reading it began during the Napoleonic wars. Up until Nelson people were more openly emotional, but Wellington changed that with his attitude and personality. I think it was in Bernard Cornwell's Waterloo book.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t remember where I read it but I remember reading it began during the Napoleonic wars. Up until Nelson people were more openly emotional, but Wellington changed that with his attitude and personality. I think it was in Bernard Cornwell&amp;#39;s Waterloo book.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgb9yf9", "score_hidden": false, "stickied": false, "created": 1492324230.0, "created_utc": 1492295430.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65hhpy", "likes": null, "replies": "", "user_reports": [], "id": "dgbdsof", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MBAMBA0", "parent_id": "t3_65hhpy", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I think for most of European history, England was thought of as kind of a coarse, somewhat vicious backwater, but somewhere in more modern history, this self-myth about the 'stiff upper lip' developed and Brits themselves began to conform to the myth - sort of a self-fulfilling prophesy if you will.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think for most of European history, England was thought of as kind of a coarse, somewhat vicious backwater, but somewhere in more modern history, this self-myth about the &amp;#39;stiff upper lip&amp;#39; developed and Brits themselves began to conform to the myth - sort of a self-fulfilling prophesy if you will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgbdsof", "score_hidden": false, "stickied": false, "created": 1492329727.0, "created_utc": 1492300927.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]