[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "history", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Were WWI commanders more ineffective compared to other wars&amp;#39; generals who had to command against and with brand new and much more deadly equipment? Were they really that terrible compared to other generals in light of this consideration? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Were WWI commanders more ineffective compared to other wars' generals who had to command against and with brand new and much more deadly equipment? Were they really that terrible compared to other generals in light of this consideration? ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65kvqt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "HandySoap", "saved": false, "mod_reports": [], "name": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "approved_by": null, "over_18": false, "domain": "self.history", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh53", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/history/comments/65kvqt/on_the_ineffectiveness_of_wwi_commanders/", "num_reports": null, "locked": false, "stickied": false, "created": 1492312749.0, "url": "https://www.reddit.com/r/history/comments/65kvqt/on_the_ineffectiveness_of_wwi_commanders/", "author_flair_text": null, "quarantine": false, "title": "On the ineffectiveness of WWI commanders", "created_utc": 1492283949.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgbggmc", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "shindigero", "parent_id": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "This is a very complicated question. The depiction of the British Tommies and other  troops as 'donkeys led by lions' is a common one and clearly some generals were simply appallingly incompetent. As an example, the British commander at Gallipoli, Sir Ian Hamilton, managed his troops incredibly poorly. He missed all early opportunities to move inland from his initial beachhead and when the Turks had taken up strong defensive positions he spent months and thousands of men's lives bombarding them and assaulting them ineffectually whilst refusing to accept that victory was impossible until after he was dismissed and ordered home. Now arguably there was not much chance of him succeeding from the offset with the men and logistics at his disposal but his refusal to see the bigger picture and admit defeat early on was a mistake paid for in the blood of his men. But while some generals were incompetent others were brilliant. German general August Von Mackensen stands out as a general who spent the war creating breakthroughs and conducting a war of manoeuvre in a conflict many imagine as purely static. Generals of the great war are often accused of being tactically inflexible and indeed many were. French troops wore bright red and blue and British soldier were ordered to walk in line towards machineguns. But others were also incredibly imaginative championing the use of aircraft, tanks and shocktroop tactics in a world that only years before had thought that cavalry was the unit that would ultimately win the war. My point is that the generals were just people. Some were flawed and some were exceptional as with all people. The European armies of 1914 had not fought major conventional continental wars since the Crimean and Franco-Prussian wars. There had been very few opportunities for trial by fire and inevitably many generals were not up to the task. Arguably they had only kept their positions due to political and social influence but I'm sure that could be said of some of the generals who are now considered to have been successful. Military high command was inherently political, especially so in peace time. And ultimately when the war got going they did make some very bold changes and displayed great ingenuity. They could see how devastating conventional approaches were in terms of casualties and they took genuine steps to avoid them. Even Gallipoli and the associated Salonica front were, however flawed their enactment, attempts to create new battlegrounds to avoid the continuing meatgrinder of the Western Front. It is often said that the generals disregarded the losses that their offensives caused but i think this view fails to account for the strategic view of the war that the generals had. As I've said, they knew that industrial trench warfare was a bloodbath. They weren't blind. But the war had started. Noone was going to just put down their arms and go home. Ultimately they all knew that the only way to end the war was a breakthrough. It took 4 years and millions of lives but that's what eventually happened. Any of the offensives that took place before 1918 by both sides could have been the last one. They were planned to be the last and if they had been it would all have been over. Even the push for Paris in 1914 could have decided it. But for a variety of reasons they mostly failed or succeeded but fell short of total victory. Relatedly many of the Western Front's most bloody offensives were also carried out to relieve the Russians when the Germans looked close to victory in the East. The loss of life was horrendous but it wasn't as completely meaningless as it has been portrayed (which is to say how it would have often been seen by the men in the trenches). Though that doesn't make it particularly meaningful either. I think really my view ultimately boils down to the idea that once the war had started it was only going to end one way, through victory, and the generals did their best to achieve that but the circumstances made that cost almost intolerably high. There, for me, lies their real crime. Their willingness for war. The role of the generals in urging and encouraging their kings and prime ministers to push on and take the plunge into bloody conflict was really unforgivable. They weren't solely to blame but they were undeniably complicit.", "edited": 1492305100.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a very complicated question. The depiction of the British Tommies and other  troops as &amp;#39;donkeys led by lions&amp;#39; is a common one and clearly some generals were simply appallingly incompetent. As an example, the British commander at Gallipoli, Sir Ian Hamilton, managed his troops incredibly poorly. He missed all early opportunities to move inland from his initial beachhead and when the Turks had taken up strong defensive positions he spent months and thousands of men&amp;#39;s lives bombarding them and assaulting them ineffectually whilst refusing to accept that victory was impossible until after he was dismissed and ordered home. Now arguably there was not much chance of him succeeding from the offset with the men and logistics at his disposal but his refusal to see the bigger picture and admit defeat early on was a mistake paid for in the blood of his men. But while some generals were incompetent others were brilliant. German general August Von Mackensen stands out as a general who spent the war creating breakthroughs and conducting a war of manoeuvre in a conflict many imagine as purely static. Generals of the great war are often accused of being tactically inflexible and indeed many were. French troops wore bright red and blue and British soldier were ordered to walk in line towards machineguns. But others were also incredibly imaginative championing the use of aircraft, tanks and shocktroop tactics in a world that only years before had thought that cavalry was the unit that would ultimately win the war. My point is that the generals were just people. Some were flawed and some were exceptional as with all people. The European armies of 1914 had not fought major conventional continental wars since the Crimean and Franco-Prussian wars. There had been very few opportunities for trial by fire and inevitably many generals were not up to the task. Arguably they had only kept their positions due to political and social influence but I&amp;#39;m sure that could be said of some of the generals who are now considered to have been successful. Military high command was inherently political, especially so in peace time. And ultimately when the war got going they did make some very bold changes and displayed great ingenuity. They could see how devastating conventional approaches were in terms of casualties and they took genuine steps to avoid them. Even Gallipoli and the associated Salonica front were, however flawed their enactment, attempts to create new battlegrounds to avoid the continuing meatgrinder of the Western Front. It is often said that the generals disregarded the losses that their offensives caused but i think this view fails to account for the strategic view of the war that the generals had. As I&amp;#39;ve said, they knew that industrial trench warfare was a bloodbath. They weren&amp;#39;t blind. But the war had started. Noone was going to just put down their arms and go home. Ultimately they all knew that the only way to end the war was a breakthrough. It took 4 years and millions of lives but that&amp;#39;s what eventually happened. Any of the offensives that took place before 1918 by both sides could have been the last one. They were planned to be the last and if they had been it would all have been over. Even the push for Paris in 1914 could have decided it. But for a variety of reasons they mostly failed or succeeded but fell short of total victory. Relatedly many of the Western Front&amp;#39;s most bloody offensives were also carried out to relieve the Russians when the Germans looked close to victory in the East. The loss of life was horrendous but it wasn&amp;#39;t as completely meaningless as it has been portrayed (which is to say how it would have often been seen by the men in the trenches). Though that doesn&amp;#39;t make it particularly meaningful either. I think really my view ultimately boils down to the idea that once the war had started it was only going to end one way, through victory, and the generals did their best to achieve that but the circumstances made that cost almost intolerably high. There, for me, lies their real crime. Their willingness for war. The role of the generals in urging and encouraging their kings and prime ministers to push on and take the plunge into bloody conflict was really unforgivable. They weren&amp;#39;t solely to blame but they were undeniably complicit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgbggmc", "score_hidden": false, "stickied": false, "created": 1492333533.0, "created_utc": 1492304733.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgd89am", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hollowpoint38", "parent_id": "t1_dgcdeji", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "There were some civil war commanders who really had some issues.  Burnside was one of them.  He had quite a few absolute blunders and then he actually became the first president of an organization known as the National Rifle Association.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There were some civil war commanders who really had some issues.  Burnside was one of them.  He had quite a few absolute blunders and then he actually became the first president of an organization known as the National Rifle Association.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgd89am", "score_hidden": false, "stickied": false, "created": 1492441137.0, "created_utc": 1492412337.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdeji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HandySoap", "parent_id": "t1_dgbf8vq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Right thats what I was thinking. No one really gets in civil war commanders (except custer.) But is that just because they actually adapted relatively quickly?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right thats what I was thinking. No one really gets in civil war commanders (except custer.) But is that just because they actually adapted relatively quickly?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgcdeji", "score_hidden": false, "stickied": false, "created": 1492395946.0, "created_utc": 1492367146.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgd89u7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hollowpoint38", "parent_id": "t1_dgbf8vq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "The guns were more accurate but without smokeless powder it was hard to see anything at a reasonable with a lot of firing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The guns were more accurate but without smokeless powder it was hard to see anything at a reasonable with a lot of firing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgd89u7", "score_hidden": false, "stickied": false, "created": 1492441172.0, "created_utc": 1492412372.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbf8vq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Robjr83", "parent_id": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Cival war commanders faced the same challenges a few decades before ww1 general's did.  Guns were far more accurate at greater distances then Napoleons time.  The Cival war started with lines of infantry attacking each other and by the siege of Petersburg resembled ww1 trenches stretching miles.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cival war commanders faced the same challenges a few decades before ww1 general&amp;#39;s did.  Guns were far more accurate at greater distances then Napoleons time.  The Cival war started with lines of infantry attacking each other and by the siege of Petersburg resembled ww1 trenches stretching miles.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgbf8vq", "score_hidden": false, "stickied": false, "created": 1492331832.0, "created_utc": 1492303032.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgbr3aj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thewalkingfred", "parent_id": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "It's not really that they were \"worse\" commanders, as there were quite a few very skilled commanders (Hindenburg, Ludendorf, Brusilov, and many of the later British commanders)\n\nThere had never been a conflict on the scale of WWI and, tho the technology that would be used was not exactly cutting edge, it hadn't seen large scale use. The amount of artillery used, was absolutely unprecedented and it very quickly morphed from a direct fire weapon to almost entirely indirect fire. Machine guns were issued in large quantities, soldiers had more accurate guns that could kill from farther distances more consistently and they had more access to ammo. \n\nMilitary tactics were constantly evolving but when the war started, the general idea was still rooted in quasi-napoleonic tactics of geometric pitched battle where we'll ordered units would be ordered around individually to outflank and \"break\" the enemies morale, causing them to flee and be easily run down by a killing unit like cavalry.\n\nThe problem was, units just didn't \"break\" anymore. Not in the traditional sense at least. Armies had nearly perfected the art of motivating soldiers to stand and fight to an almost suicidal level. And when they did break discipline and retreat, you couldn't just order a cavalry charge to mop them because they would simply turn around and kill the cavalry. You couldn't kill or capture them with infantry either for the same reason plus they were slower.\n\nAll this came together to basically mean commanders were feeling around in the dark. But instead of just stubbing their toe, they were managing armies millions of men strong, commanding battle's with hundreds of thousands of men fighting at once. \n\nAt first many thought the early disasters were simply costly flukes. I mean, the numbers of the dead were incredible, but it was terrible for the enemy too. They couldnt keep this up for long right? The next battle we will break their lines, envelope the enemy, deliver a huge tactical defeat, and march on the capitol. Right? There's no way they will keep throwing men into the meat grinder for the sake of Serbia.\n\nSo early on there was a lot of resistance to change because they thought the horrible casualties would mean a short war, and why risk completely changing battlefield tactics for a war that will probably be won any day now? But once it became obvious that no one would be the first to blink every side started to attempt to innovate and the old guard commanders who refused to change began to be shuffled out.\n\nSo anyway, don't think of them as poor commanders necessarily. Most were likely just as skilled as any other generation of military men. But they were thrown into a conflict that had very little precedent and was so large scale and deadly that it forced innovation on all sides. When generals who would have been perfectly capable in one of the previous conflicts failed to innovate, 100's of thousands died in a horrifyingly short time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not really that they were &amp;quot;worse&amp;quot; commanders, as there were quite a few very skilled commanders (Hindenburg, Ludendorf, Brusilov, and many of the later British commanders)&lt;/p&gt;\n\n&lt;p&gt;There had never been a conflict on the scale of WWI and, tho the technology that would be used was not exactly cutting edge, it hadn&amp;#39;t seen large scale use. The amount of artillery used, was absolutely unprecedented and it very quickly morphed from a direct fire weapon to almost entirely indirect fire. Machine guns were issued in large quantities, soldiers had more accurate guns that could kill from farther distances more consistently and they had more access to ammo. &lt;/p&gt;\n\n&lt;p&gt;Military tactics were constantly evolving but when the war started, the general idea was still rooted in quasi-napoleonic tactics of geometric pitched battle where we&amp;#39;ll ordered units would be ordered around individually to outflank and &amp;quot;break&amp;quot; the enemies morale, causing them to flee and be easily run down by a killing unit like cavalry.&lt;/p&gt;\n\n&lt;p&gt;The problem was, units just didn&amp;#39;t &amp;quot;break&amp;quot; anymore. Not in the traditional sense at least. Armies had nearly perfected the art of motivating soldiers to stand and fight to an almost suicidal level. And when they did break discipline and retreat, you couldn&amp;#39;t just order a cavalry charge to mop them because they would simply turn around and kill the cavalry. You couldn&amp;#39;t kill or capture them with infantry either for the same reason plus they were slower.&lt;/p&gt;\n\n&lt;p&gt;All this came together to basically mean commanders were feeling around in the dark. But instead of just stubbing their toe, they were managing armies millions of men strong, commanding battle&amp;#39;s with hundreds of thousands of men fighting at once. &lt;/p&gt;\n\n&lt;p&gt;At first many thought the early disasters were simply costly flukes. I mean, the numbers of the dead were incredible, but it was terrible for the enemy too. They couldnt keep this up for long right? The next battle we will break their lines, envelope the enemy, deliver a huge tactical defeat, and march on the capitol. Right? There&amp;#39;s no way they will keep throwing men into the meat grinder for the sake of Serbia.&lt;/p&gt;\n\n&lt;p&gt;So early on there was a lot of resistance to change because they thought the horrible casualties would mean a short war, and why risk completely changing battlefield tactics for a war that will probably be won any day now? But once it became obvious that no one would be the first to blink every side started to attempt to innovate and the old guard commanders who refused to change began to be shuffled out.&lt;/p&gt;\n\n&lt;p&gt;So anyway, don&amp;#39;t think of them as poor commanders necessarily. Most were likely just as skilled as any other generation of military men. But they were thrown into a conflict that had very little precedent and was so large scale and deadly that it forced innovation on all sides. When generals who would have been perfectly capable in one of the previous conflicts failed to innovate, 100&amp;#39;s of thousands died in a horrifyingly short time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgbr3aj", "score_hidden": false, "stickied": false, "created": 1492350621.0, "created_utc": 1492321821.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgb48pn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mikeber55", "parent_id": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Army brass were an integral part of their societies. Like the societies they came from, generals were very conservative, basically still living in the 19th century. Unlike today, they were always ready to waste thousands of lives for very little gain. Some of them referred to the average soldier in the trenches as inferior. They didn't consider improving conditions, food and supplies for their troops. \nBut technologically the world didn't stay behind. The destruction and horrible results on all sides exceeded generals expectations. It was a terrible time. \nThe 20th century really began only after WW1. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Army brass were an integral part of their societies. Like the societies they came from, generals were very conservative, basically still living in the 19th century. Unlike today, they were always ready to waste thousands of lives for very little gain. Some of them referred to the average soldier in the trenches as inferior. They didn&amp;#39;t consider improving conditions, food and supplies for their troops. \nBut technologically the world didn&amp;#39;t stay behind. The destruction and horrible results on all sides exceeded generals expectations. It was a terrible time. \nThe 20th century really began only after WW1. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgb48pn", "score_hidden": false, "stickied": false, "created": 1492316311.0, "created_utc": 1492287511.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgbo18x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ShogunOfDarkness", "parent_id": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Many generals were excellent in command and understood the new machinery and tactics very well. However, there are some generals who are just not so effective.\n\nSir Douglas Haige, British commander in Western Front, was one such general. He relied heavily on cavalry and didn't think much of the new machinery. He believed that cavalry was the decisive factor on the battlefield. His plans for Somme were not very effective.\n\nAnother such general was the Italian chief of staff, Luigi Cardorna. He fought battles after battles in the same location of Isanzo river, with little or no gains.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many generals were excellent in command and understood the new machinery and tactics very well. However, there are some generals who are just not so effective.&lt;/p&gt;\n\n&lt;p&gt;Sir Douglas Haige, British commander in Western Front, was one such general. He relied heavily on cavalry and didn&amp;#39;t think much of the new machinery. He believed that cavalry was the decisive factor on the battlefield. His plans for Somme were not very effective.&lt;/p&gt;\n\n&lt;p&gt;Another such general was the Italian chief of staff, Luigi Cardorna. He fought battles after battles in the same location of Isanzo river, with little or no gains.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgbo18x", "score_hidden": false, "stickied": false, "created": 1492344927.0, "created_utc": 1492316127.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgbwk7q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eastory", "parent_id": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I would present a more positive view on the generals' skills. The main task of the generals was to find a way how to make defensive trenches ineffective. In order to achieve this goal they developed new tactics and weapons. The  military systems of European Empires attempted to analyze the problem and then solve it with military innovations (infiltration tactics, tanks, air support and reconnisance). So how did they do? Well, trench warfare never occurred again on a large scale and that is the main proof of efectivness of these methods. The generals did send a lot of their men to useless attacks, but on the other had they were responsible for one of the fastest (if not the fastest) development of military technology and tactics in human history. WWI arguably changed warfare even more than WWII. Therefore, despite the fact that many generals were put in situations for which they were not trained for, and that resulted in huge casualties, the generals staffs of European countries managed to analyze and solve the problem with skill. However this only became apparent after the end of WWI.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would present a more positive view on the generals&amp;#39; skills. The main task of the generals was to find a way how to make defensive trenches ineffective. In order to achieve this goal they developed new tactics and weapons. The  military systems of European Empires attempted to analyze the problem and then solve it with military innovations (infiltration tactics, tanks, air support and reconnisance). So how did they do? Well, trench warfare never occurred again on a large scale and that is the main proof of efectivness of these methods. The generals did send a lot of their men to useless attacks, but on the other had they were responsible for one of the fastest (if not the fastest) development of military technology and tactics in human history. WWI arguably changed warfare even more than WWII. Therefore, despite the fact that many generals were put in situations for which they were not trained for, and that resulted in huge casualties, the generals staffs of European countries managed to analyze and solve the problem with skill. However this only became apparent after the end of WWI.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgbwk7q", "score_hidden": false, "stickied": false, "created": 1492366624.0, "created_utc": 1492337824.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgd1dnf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bloodsquirrel", "parent_id": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I'd suggest that a lot of the problem was that the political aims (achieve a big breakthrough to end the war quickly, get the Germans out of France, etc) were misaligned with the reality of WWI battlefield dynamics. Lots of advances in tactics, artillery, logistics, and other fields were made, but none of them were quite enough to break the stalemate on the western front. The governments of France and Britain wanted generals who were going to try, however, since none of them wanted to turn around to the electorate and say \"Okay, turns out that we've basically just got to fight a war of attrition, so this is gonna take a while and kill a lot of our young men.\"\n\nThe allies tried just about everything you can imagine them trying, but it was an environment where one small miscalculation could turn your offensive into a bloodbath. I don't think the generals of any other war would have, on average, done any better\n\nOf course, there was also a lot of straight-up incompetence, often because there had been a lot period of relative peace where military appointments had gone to aristocrats for political reasons. Austria-Hungary and the Ottomon Empire made Britain and France's worst generals look downright cunning. Both of those empires were highly dysfunctional at that point, and their political systems foisted some really awful generals upon their armies. But that's not uncommon; plenty of other wars have had terrible generals in them too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d suggest that a lot of the problem was that the political aims (achieve a big breakthrough to end the war quickly, get the Germans out of France, etc) were misaligned with the reality of WWI battlefield dynamics. Lots of advances in tactics, artillery, logistics, and other fields were made, but none of them were quite enough to break the stalemate on the western front. The governments of France and Britain wanted generals who were going to try, however, since none of them wanted to turn around to the electorate and say &amp;quot;Okay, turns out that we&amp;#39;ve basically just got to fight a war of attrition, so this is gonna take a while and kill a lot of our young men.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The allies tried just about everything you can imagine them trying, but it was an environment where one small miscalculation could turn your offensive into a bloodbath. I don&amp;#39;t think the generals of any other war would have, on average, done any better&lt;/p&gt;\n\n&lt;p&gt;Of course, there was also a lot of straight-up incompetence, often because there had been a lot period of relative peace where military appointments had gone to aristocrats for political reasons. Austria-Hungary and the Ottomon Empire made Britain and France&amp;#39;s worst generals look downright cunning. Both of those empires were highly dysfunctional at that point, and their political systems foisted some really awful generals upon their armies. But that&amp;#39;s not uncommon; plenty of other wars have had terrible generals in them too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgd1dnf", "score_hidden": false, "stickied": false, "created": 1492428124.0, "created_utc": 1492399324.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65kvqt", "likes": null, "replies": "", "user_reports": [], "id": "dgb3yky", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GuyFawkes_fieri", "parent_id": "t3_65kvqt", "subreddit_name_prefixed": "r/history", "controversiality": 1, "body": "For the most part, yes, the \"love lions led by lambs\" analogy was used by the English during the war. Most of the generals were just unfamiliar with the new technology, however, generals like Hindenburg were effective and innovative, but there were very few like this, and I would say most were Germans ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For the most part, yes, the &amp;quot;love lions led by lambs&amp;quot; analogy was used by the English during the war. Most of the generals were just unfamiliar with the new technology, however, generals like Hindenburg were effective and innovative, but there were very few like this, and I would say most were Germans &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgb3yky", "score_hidden": false, "stickied": false, "created": 1492315930.0, "created_utc": 1492287130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]