[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "history", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last week I started playing AC: Black Flag and watching Black Sails which I know is just fictional stuff but it&amp;#39;s gotten me fascinated over the real history on that time period.&lt;/p&gt;\n\n&lt;p&gt;While reading up on the likes of Ben Hornigold, Charles Vane and Stede Bonnet I have discovered their downfalls that all seemed to happen after Woods Rodgers strutted into town with the Kings pardon. &lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m struggling to get by head around is how this action began to draw the golden age of piracy to a close. Sure I get that a lot of people took the pardon because the alternative was a visit to the gallow&amp;#39;s but now they&amp;#39;re all poor and jobless, so what would prevent them from returning to piracy a few weeks later? Or if they didn&amp;#39;t want to accept the pardon in the first place, why wouldn&amp;#39;t you take it to get in the clear and then carry on as you were?&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t seem to find anything that explains how this bizarre plan was successful. If you was to provide a full pardon to a paedophile, would he go after some kids again? More than bloody likely. I&amp;#39;m sorry for the crude example but I just don&amp;#39;t get it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Last week I started playing AC: Black Flag and watching Black Sails which I know is just fictional stuff but it's gotten me fascinated over the real history on that time period.\n\nWhile reading up on the likes of Ben Hornigold, Charles Vane and Stede Bonnet I have discovered their downfalls that all seemed to happen after Woods Rodgers strutted into town with the Kings pardon. \n\nWhat I'm struggling to get by head around is how this action began to draw the golden age of piracy to a close. Sure I get that a lot of people took the pardon because the alternative was a visit to the gallow's but now they're all poor and jobless, so what would prevent them from returning to piracy a few weeks later? Or if they didn't want to accept the pardon in the first place, why wouldn't you take it to get in the clear and then carry on as you were?\n\nI can't seem to find anything that explains how this bizarre plan was successful. If you was to provide a full pardon to a paedophile, would he go after some kids again? More than bloody likely. I'm sorry for the crude example but I just don't get it.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65s9px", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "Maxjax95", "saved": false, "mod_reports": [], "name": "t3_65s9px", "subreddit_name_prefixed": "r/history", "approved_by": null, "over_18": false, "domain": "self.history", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh53", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/history/comments/65s9px/how_did_the_kings_pardon_in_1718_bring_an_end_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492415852.0, "url": "https://www.reddit.com/r/history/comments/65s9px/how_did_the_kings_pardon_in_1718_bring_an_end_to/", "author_flair_text": null, "quarantine": false, "title": "How did the Kings pardon in 1718 bring an end to the golden age of pirates?", "created_utc": 1492387052.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65s9px", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65s9px", "likes": null, "replies": "", "user_reports": [], "id": "dgdjgnx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tolerantgravity", "parent_id": "t1_dgcxu17", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Your description of the perfect storm made me think \"huh, exactly like Firefly.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your description of the perfect storm made me think &amp;quot;huh, exactly like Firefly.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgdjgnx", "score_hidden": false, "stickied": false, "created": 1492468017.0, "created_utc": 1492439217.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65s9px", "likes": null, "replies": "", "user_reports": [], "id": "dgdvriy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Maxjax95", "parent_id": "t1_dgcxu17", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Thank you, that actually makes whole lot of sense. I guess it's a get out while the going is good type of thing, there's no point going down with a sinking ship so to speak.\n\n I'll make sure I keep an eye out for a copy of that book as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, that actually makes whole lot of sense. I guess it&amp;#39;s a get out while the going is good type of thing, there&amp;#39;s no point going down with a sinking ship so to speak.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll make sure I keep an eye out for a copy of that book as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgdvriy", "score_hidden": true, "stickied": false, "created": 1492482181.0, "created_utc": 1492453381.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxu17", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Allthenamesareregone", "parent_id": "t3_65s9px", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "I've been studying Golden Age pirates for 12 years. Why they ended isn't clear-cut, but here are some ideas:\n\nFirst, why did they become pirates? During the Golden Age (@1690-@1725) many were motivated by the just-plain-terrible working conditions of the time. When the end of the War of Spanish Succession (called by some the first \"world\" war) ended, thousands of men were looking for work as sailors, and since the war had gone on for some 15 years, many of them knew only sailing and fighting (the skills of a pirate)\n\nBy 1718, the these men has had a taste of the good life. Some may have taken their \"pirate money\" and left the life. Several of the real revolutionaries were dead. (Sam Bellamy, who preached out-and-out revolution, had died in a storm) \n\nBen Hornigold, a leader of pirate society, advised the pirates to \"take the pardon\" because they could always go back to pirating. This broke up some of the large pirate crews. (Contrary to movies, pirates operates best in crews larger than 50.)\n\nSomething also changed in the way pirates sold their goods. \"Law abiding\" merchants had been fencing pirate goods for decades. Some of this may have become more difficult. Without the free-and-easy atmosphere that allowed this kind of illegal trade, being a pirate become more difficult. \n\nAnd the War of the Quadruple Alliance started in 1717, and this offered employment to warrior sailors.\n\nAll in all, it was a perfect storm of low waged, terrible working conditions, available money, and easy sale of stolen goods that made the pirates. It was another perfect storm that unmade them.\n\n(You might enjoy Pirates of the Golden Age by TS Rhodes.) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been studying Golden Age pirates for 12 years. Why they ended isn&amp;#39;t clear-cut, but here are some ideas:&lt;/p&gt;\n\n&lt;p&gt;First, why did they become pirates? During the Golden Age (@1690-@1725) many were motivated by the just-plain-terrible working conditions of the time. When the end of the War of Spanish Succession (called by some the first &amp;quot;world&amp;quot; war) ended, thousands of men were looking for work as sailors, and since the war had gone on for some 15 years, many of them knew only sailing and fighting (the skills of a pirate)&lt;/p&gt;\n\n&lt;p&gt;By 1718, the these men has had a taste of the good life. Some may have taken their &amp;quot;pirate money&amp;quot; and left the life. Several of the real revolutionaries were dead. (Sam Bellamy, who preached out-and-out revolution, had died in a storm) &lt;/p&gt;\n\n&lt;p&gt;Ben Hornigold, a leader of pirate society, advised the pirates to &amp;quot;take the pardon&amp;quot; because they could always go back to pirating. This broke up some of the large pirate crews. (Contrary to movies, pirates operates best in crews larger than 50.)&lt;/p&gt;\n\n&lt;p&gt;Something also changed in the way pirates sold their goods. &amp;quot;Law abiding&amp;quot; merchants had been fencing pirate goods for decades. Some of this may have become more difficult. Without the free-and-easy atmosphere that allowed this kind of illegal trade, being a pirate become more difficult. &lt;/p&gt;\n\n&lt;p&gt;And the War of the Quadruple Alliance started in 1717, and this offered employment to warrior sailors.&lt;/p&gt;\n\n&lt;p&gt;All in all, it was a perfect storm of low waged, terrible working conditions, available money, and easy sale of stolen goods that made the pirates. It was another perfect storm that unmade them.&lt;/p&gt;\n\n&lt;p&gt;(You might enjoy Pirates of the Golden Age by TS Rhodes.) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgcxu17", "score_hidden": false, "stickied": false, "created": 1492423138.0, "created_utc": 1492394338.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65s9px", "likes": null, "replies": "", "user_reports": [], "id": "dgcuv8e", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "lilfutnug", "parent_id": "t3_65s9px", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Port Royal being swallowed by the sea in a historic earthquake really put a damper on privateering also.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Port Royal being swallowed by the sea in a historic earthquake really put a damper on privateering also.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgcuv8e", "score_hidden": false, "stickied": false, "created": 1492419210.0, "created_utc": 1492390410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65s9px", "likes": null, "replies": "", "user_reports": [], "id": "dgcuih5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "vidivicivini", "parent_id": "t3_65s9px", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Pirates were living on the edges of the world, raiding to make a living.  Partly because it was good living at times, but partly because you knew that you could never go home again.  Once you made that choice it was for life.  \n\nThen you see the world changing around you (wars that forced empires to tolerate pirates are ending, etc) and this guy comes in and says ok, here's your chance to go home again, no questions asked, so long as you give up the pirate life.  So a bunch of you do.  \n\nThen you find out that a pirates life really was for you (yo ho!), and you want to go back to it. Except now there are so few pirates left that you can be hunted down mercilessly.  Travelling across the Atlantic took months back then, and it would take some people longer than others to get bored of life as a civilian again.  In that time a fleet would be remaining on station in the Caribbean hunting down anyone who didn't take the pardon, and any islands where pirates were known to haunt would be watched with eagle vision.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pirates were living on the edges of the world, raiding to make a living.  Partly because it was good living at times, but partly because you knew that you could never go home again.  Once you made that choice it was for life.  &lt;/p&gt;\n\n&lt;p&gt;Then you see the world changing around you (wars that forced empires to tolerate pirates are ending, etc) and this guy comes in and says ok, here&amp;#39;s your chance to go home again, no questions asked, so long as you give up the pirate life.  So a bunch of you do.  &lt;/p&gt;\n\n&lt;p&gt;Then you find out that a pirates life really was for you (yo ho!), and you want to go back to it. Except now there are so few pirates left that you can be hunted down mercilessly.  Travelling across the Atlantic took months back then, and it would take some people longer than others to get bored of life as a civilian again.  In that time a fleet would be remaining on station in the Caribbean hunting down anyone who didn&amp;#39;t take the pardon, and any islands where pirates were known to haunt would be watched with eagle vision.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgcuih5", "score_hidden": false, "stickied": false, "created": 1492418733.0, "created_utc": 1492389933.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]