[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/NXjfwdGCVio?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 600, "scrolling": false, "height": 338}, "subreddit": "history", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "UWaterloo Grimm Lecture: Timothy Snyder on the Holocaust as History and Warning", "author_name": "ArtsFaculty", "height": 338, "width": 600, "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/NXjfwdGCVio?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "thumbnail_width": 480, "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/NXjfwdGCVio/hqdefault.jpg", "type": "video", "provider_name": "YouTube", "author_url": "https://www.youtube.com/user/ArtsFaculty"}, "type": "youtube.com"}, "link_flair_text": "Video", "id": "65vjxq", "gilded": 0, "secure_media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/NXjfwdGCVio?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 600, "scrolling": false, "height": 338}, "clicked": false, "score": 10, "report_reasons": null, "author": "fraktarn", "saved": false, "mod_reports": [], "name": "t3_65vjxq", "subreddit_name_prefixed": "r/history", "approved_by": null, "over_18": false, "domain": "youtu.be", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh53", "edited": false, "link_flair_css_class": "e", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/history/comments/65vjxq/the_holocaust_as_history_and_warning_timothy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492464672.0, "url": "https://youtu.be/NXjfwdGCVio", "author_flair_text": null, "quarantine": false, "title": "The Holocaust as History and Warning - Timothy Snyder. University of Waterloo Grimm Lecture February 6, 2017", "created_utc": 1492435872.0, "distinguished": null, "media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "UWaterloo Grimm Lecture: Timothy Snyder on the Holocaust as History and Warning", "author_name": "ArtsFaculty", "height": 338, "width": 600, "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/NXjfwdGCVio?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "thumbnail_width": 480, "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/NXjfwdGCVio/hqdefault.jpg", "type": "video", "provider_name": "YouTube", "author_url": "https://www.youtube.com/user/ArtsFaculty"}, "type": "youtube.com"}, "upvote_ratio": 0.68, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65vjxq", "likes": null, "replies": "", "user_reports": [], "id": "dgdh6hh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65vjxq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "Hi!  \nAs we hope you can appreciate, the Holocaust can be a fraught subject to deal with. While don't want to curtail discussion, we also remain very conscious that threads of this nature can attract the very wrong kind of responses, and it is an unfortunate truth that on reddit, outright Holocaust denial can often rear its ugly head. As such, the /r/History mods have created this brief overview that addresses common questions, and included a short list of introductory reading. It is not intended to stifle further discussion, but simply lay out the basic, incontrovertible truths to get them out of the way.\n\n##What Was the Holocaust?\nThe Holocaust refers the genocidal deaths of 5-6 million European Jews carried out systematically by Nazi Germany as part of targeted policies of persecution and extermination during World War II. Some historians will also include the deaths of the Roma, Communists, Mentally Disabled, and other groups targeted by Nazi policies, which brings the total number of deaths to ~11 million. Debates about whether or not the Holocaust includes these deaths or not is a matter of definitions, but in no way a reflection on dispute that they occurred.\n\n##But This Guy Says Otherwise!\nUnfortunately, there is a small, but at times vocal, minority of persons who fall into the category of Holocaust Denial, attempting to minimize the deaths by orders of magnitude, impugn well proven facts, or even claim that the Holocaust is entirely a fabrication and never happened. Although they often self-style themselves as \"Revisionists\", they are not correctly described by the title. While revisionism is not inherently a dirty word, actual revision, to quote Michael Shermer, *\"entails refinement of detailed knowledge about events, rarely complete denial of the events themselves, and certainly not denial of the cumulation of events known as the Holocaust.\"*\n\nIt is absolutely true that were you to read a book written in 1950 or so, you would find information which any decent scholar today might reject, and that is the result of good revisionism. But these changes, which even can be quite large, such as the reassessment of deaths at Auschwitz from ~4 million to ~1 million, are done within the bounds of respected, academic study, and reflect decades of work that builds upon the work of previous scholars, and certainly does not willfully disregard documented evidence and recollections. There are still plenty of questions within Holocaust Studies that are debated by scholars, and there may still be more out there for us to discover, and revise, but when it comes to the basic facts, there is simply no valid argument against them.\n\n##So What Are the Basics?\nBeginning with their rise to power in the 1930s, the Nazi Party, headed by Adolf Hitler, implemented a series of anti-Jewish policies within Germany, marginalizing Jews within society more and more, stripping them of their wealth, livelihoods, and their dignity. With the invasion of Poland in 1939, the number of Jews under Nazi control reached into the millions, and this number would again increase with the invasion of the Soviet Union in 1941. Shortly after the invasion of Poland, the Germans started to confine the Jewish population into squalid ghettos. After several plans on how to rid Europe of the Jews that all proved unfeasible, by the time of the invasion of the Soviet Union in 1941, ideological (Antisemitism) and pragmatic (Resources) considerations lead to mass-killings becoming the only viable option in the minds of the Nazi leadership.\nFirst only practiced in the USSR, it was influential groups such as the SS and the administration of the General Government that pushed to expand the killing operations to all of Europe and sometime at the end of 1941 met with Hitler’s approval.\n\nThe early killings were carried out foremost by the *Einsatzgruppen*, paramilitary groups organized under the aegis of the SS and tasked with carrying out the mass killings of Jews, Communists, and other 'undesirable elements' in the wake of the German military's advance. In what is often termed the 'Holocaust by Bullet', the *Einsatzgruppen*, with the assistance of the Wehrmacht, the SD, the Security Police, as well as local collaborators, would kill roughly two million persons, over half of them Jews. Most killings were carried out with mass shootings, but other methods such as gas vans - intended to spare the killers the trauma of shooting so many persons day after day - were utilized too. \n\nBy early 1942, the \"Final Solution\" to the so-called \"Jewish Question\" was essentially finalized at the Wannsee Conference under the direction of Reinhard Heydrich, where the plan to eliminate the Jewish population of Europe using a series of extermination camps set up in occupied Poland was presented and met with approval.\n\nConstruction of extermination camps had already begun the previous fall, and mass extermination, mostly as part of 'Operation Reinhard', had began operation by spring of 1942. Roughly 2 million persons, nearly all Jewish men, women, and children, were immediately gassed upon arrival at Bełżec, Sobibór, and Treblinka over the next two years, when these  \"Reinhard\" camps were closed and razed. More victims would meet their fate in additional extermination camps such as Chełmno, but most infamously at Auschwitz-Birkenau, where slightly over 1 million persons, mostly Jews, died. Under the plan set forth at Wannsee, exterminations were hardly limited to the Jews of Poland, but rather Jews from all over Europe were rounded up and sent east by rail like cattle to the slaughter. Although the victims of the Reinhard Camps were originally buried, they would later be exhumed and cremated, and cremation of the victims was normal procedure at later camps such as Auschwitz.\n\n##The Camps\nThere were two main types of camps run by Nazi Germany, which is sometimes a source of confusion. Concentration Camps were well known means of extrajudicial control implemented by the Nazis shortly after taking power, beginning with the construction of Dachau in 1933. Political opponents of all type, not just Jews, could find themselves imprisoned in these camps during the pre-war years, and while conditions were often brutal and squalid, and numerous deaths did occur from mistreatment, they were not usually a death sentence and the population fluctuated greatly. Although Concentration Camps *were* later made part of the 'Final Solution', their purpose was not as immediate extermination centers. Some were 'way stations', and others were work camps, where Germany intended to eke out every last bit of productivity from them through what was known as \"extermination through labor\". Jews and other undesirable elements, if deemed healthy enough to work, could find themselves spared for a time and \"allowed\" to toil away like slaves until their usefulness was at an end.\n\nAlthough some Concentration Camps, such as Mauthausen, did include small gas chambers, mass gassing was not the primary purpose of the camp. Many camps, becoming extremely overcrowded, nevertheless resulted in the deaths of tens of thousands of inhabitants due to the outbreak of diseases such as typhus, or starvation, all of which the camp administrations did little to prevent. Bergen-Belsen, which was not a work camp but rather served as something of a way station for prisoners of the camp systems being moved about, is perhaps one of the most infamous of camps on this count, saw some 50,000 deaths caused by the conditions. Often located in the Reich, camps liberated by the Western forces were exclusively Concentration Camps, and many survivor testimonies come from these camps.\n\nThe Concentration Camps are contrasted with the Extermination Camps, which were purpose built for mass killing, with large gas chambers and later on, crematoria, but little or no facilities for inmates. Often they were disguised with false facades to lull the new arrivals into a false sense of security, even though rumors were of course rife for the fate that awaited the deportees. Almost all arrivals were killed upon arrival at these camps, and in many cases the number of survivors numbered in the single digits, such as at Bełżec, where only seven Jews, forced to assist in operation of the camp, were alive after the war.\n\nSeveral camps, however, were 'Hybrids' of both types, the most famous being Auschwitz, which was vast a complex of subcamps. The infamous 'selection' of prisoners, conducted by SS doctors upon arrival, meant life or death, with those deemed unsuited for labor immediately gassed and the more healthy and robust given at least temporary reprieve. The death count at Auschwitz numbered around 1 million, but it is also the source of many survivor testimonies.\n\n##How Do We Know?\nRunning through the evidence piece by piece would take more space than we have here, but suffice to say, there is a lot of evidence, and not just the (mountains of) survivor testimony. We have testimonies and writings from many who participated, as well German documentation of the programs. [This site](http://holocaustcontroversies.blogspot.de/2012/10/index-of-published-evidence-on.html) catalogs some of the evidence we have for mass extermination as it relates to Auschwitz. I'll close this out with a short list of excellent works that should help to introduce you to various aspects of Holocaust study.  \n\n##Further Reading\n* \"[Third Reich Trilogy](https://books.google.com/books?id=HZmXOPGTGjIC)\" by Richard Evans\n* \"[Hitler, the Germans, and the Final Solution](https://books.google.com/books?id=Z7FiPwAACAAJ)\" by Ian Kershaw\n* \"[Auschwitz: A New History](https://books.google.com/books?id=bx-dZEV228QC)\" by Laurence Rees\n* \"[Ordinary Men](https://books.google.com/books?id=HFB-dkuZzSwC)\" by Christopher Browning\n* \"[Denying History](https://books.google.com/books?id=Q-0B9-D5Vz4C)\" by Michael Shermer and Alex Grobman\n* [The Minutes from the Wannsee Conference](http://www.holocaustresearchp", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi!&lt;br/&gt;\nAs we hope you can appreciate, the Holocaust can be a fraught subject to deal with. While don&amp;#39;t want to curtail discussion, we also remain very conscious that threads of this nature can attract the very wrong kind of responses, and it is an unfortunate truth that on reddit, outright Holocaust denial can often rear its ugly head. As such, the &lt;a href=\"/r/History\"&gt;/r/History&lt;/a&gt; mods have created this brief overview that addresses common questions, and included a short list of introductory reading. It is not intended to stifle further discussion, but simply lay out the basic, incontrovertible truths to get them out of the way.&lt;/p&gt;\n\n&lt;h2&gt;What Was the Holocaust?&lt;/h2&gt;\n\n&lt;p&gt;The Holocaust refers the genocidal deaths of 5-6 million European Jews carried out systematically by Nazi Germany as part of targeted policies of persecution and extermination during World War II. Some historians will also include the deaths of the Roma, Communists, Mentally Disabled, and other groups targeted by Nazi policies, which brings the total number of deaths to ~11 million. Debates about whether or not the Holocaust includes these deaths or not is a matter of definitions, but in no way a reflection on dispute that they occurred.&lt;/p&gt;\n\n&lt;h2&gt;But This Guy Says Otherwise!&lt;/h2&gt;\n\n&lt;p&gt;Unfortunately, there is a small, but at times vocal, minority of persons who fall into the category of Holocaust Denial, attempting to minimize the deaths by orders of magnitude, impugn well proven facts, or even claim that the Holocaust is entirely a fabrication and never happened. Although they often self-style themselves as &amp;quot;Revisionists&amp;quot;, they are not correctly described by the title. While revisionism is not inherently a dirty word, actual revision, to quote Michael Shermer, &lt;em&gt;&amp;quot;entails refinement of detailed knowledge about events, rarely complete denial of the events themselves, and certainly not denial of the cumulation of events known as the Holocaust.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;It is absolutely true that were you to read a book written in 1950 or so, you would find information which any decent scholar today might reject, and that is the result of good revisionism. But these changes, which even can be quite large, such as the reassessment of deaths at Auschwitz from ~4 million to ~1 million, are done within the bounds of respected, academic study, and reflect decades of work that builds upon the work of previous scholars, and certainly does not willfully disregard documented evidence and recollections. There are still plenty of questions within Holocaust Studies that are debated by scholars, and there may still be more out there for us to discover, and revise, but when it comes to the basic facts, there is simply no valid argument against them.&lt;/p&gt;\n\n&lt;h2&gt;So What Are the Basics?&lt;/h2&gt;\n\n&lt;p&gt;Beginning with their rise to power in the 1930s, the Nazi Party, headed by Adolf Hitler, implemented a series of anti-Jewish policies within Germany, marginalizing Jews within society more and more, stripping them of their wealth, livelihoods, and their dignity. With the invasion of Poland in 1939, the number of Jews under Nazi control reached into the millions, and this number would again increase with the invasion of the Soviet Union in 1941. Shortly after the invasion of Poland, the Germans started to confine the Jewish population into squalid ghettos. After several plans on how to rid Europe of the Jews that all proved unfeasible, by the time of the invasion of the Soviet Union in 1941, ideological (Antisemitism) and pragmatic (Resources) considerations lead to mass-killings becoming the only viable option in the minds of the Nazi leadership.\nFirst only practiced in the USSR, it was influential groups such as the SS and the administration of the General Government that pushed to expand the killing operations to all of Europe and sometime at the end of 1941 met with Hitler’s approval.&lt;/p&gt;\n\n&lt;p&gt;The early killings were carried out foremost by the &lt;em&gt;Einsatzgruppen&lt;/em&gt;, paramilitary groups organized under the aegis of the SS and tasked with carrying out the mass killings of Jews, Communists, and other &amp;#39;undesirable elements&amp;#39; in the wake of the German military&amp;#39;s advance. In what is often termed the &amp;#39;Holocaust by Bullet&amp;#39;, the &lt;em&gt;Einsatzgruppen&lt;/em&gt;, with the assistance of the Wehrmacht, the SD, the Security Police, as well as local collaborators, would kill roughly two million persons, over half of them Jews. Most killings were carried out with mass shootings, but other methods such as gas vans - intended to spare the killers the trauma of shooting so many persons day after day - were utilized too. &lt;/p&gt;\n\n&lt;p&gt;By early 1942, the &amp;quot;Final Solution&amp;quot; to the so-called &amp;quot;Jewish Question&amp;quot; was essentially finalized at the Wannsee Conference under the direction of Reinhard Heydrich, where the plan to eliminate the Jewish population of Europe using a series of extermination camps set up in occupied Poland was presented and met with approval.&lt;/p&gt;\n\n&lt;p&gt;Construction of extermination camps had already begun the previous fall, and mass extermination, mostly as part of &amp;#39;Operation Reinhard&amp;#39;, had began operation by spring of 1942. Roughly 2 million persons, nearly all Jewish men, women, and children, were immediately gassed upon arrival at Bełżec, Sobibór, and Treblinka over the next two years, when these  &amp;quot;Reinhard&amp;quot; camps were closed and razed. More victims would meet their fate in additional extermination camps such as Chełmno, but most infamously at Auschwitz-Birkenau, where slightly over 1 million persons, mostly Jews, died. Under the plan set forth at Wannsee, exterminations were hardly limited to the Jews of Poland, but rather Jews from all over Europe were rounded up and sent east by rail like cattle to the slaughter. Although the victims of the Reinhard Camps were originally buried, they would later be exhumed and cremated, and cremation of the victims was normal procedure at later camps such as Auschwitz.&lt;/p&gt;\n\n&lt;h2&gt;The Camps&lt;/h2&gt;\n\n&lt;p&gt;There were two main types of camps run by Nazi Germany, which is sometimes a source of confusion. Concentration Camps were well known means of extrajudicial control implemented by the Nazis shortly after taking power, beginning with the construction of Dachau in 1933. Political opponents of all type, not just Jews, could find themselves imprisoned in these camps during the pre-war years, and while conditions were often brutal and squalid, and numerous deaths did occur from mistreatment, they were not usually a death sentence and the population fluctuated greatly. Although Concentration Camps &lt;em&gt;were&lt;/em&gt; later made part of the &amp;#39;Final Solution&amp;#39;, their purpose was not as immediate extermination centers. Some were &amp;#39;way stations&amp;#39;, and others were work camps, where Germany intended to eke out every last bit of productivity from them through what was known as &amp;quot;extermination through labor&amp;quot;. Jews and other undesirable elements, if deemed healthy enough to work, could find themselves spared for a time and &amp;quot;allowed&amp;quot; to toil away like slaves until their usefulness was at an end.&lt;/p&gt;\n\n&lt;p&gt;Although some Concentration Camps, such as Mauthausen, did include small gas chambers, mass gassing was not the primary purpose of the camp. Many camps, becoming extremely overcrowded, nevertheless resulted in the deaths of tens of thousands of inhabitants due to the outbreak of diseases such as typhus, or starvation, all of which the camp administrations did little to prevent. Bergen-Belsen, which was not a work camp but rather served as something of a way station for prisoners of the camp systems being moved about, is perhaps one of the most infamous of camps on this count, saw some 50,000 deaths caused by the conditions. Often located in the Reich, camps liberated by the Western forces were exclusively Concentration Camps, and many survivor testimonies come from these camps.&lt;/p&gt;\n\n&lt;p&gt;The Concentration Camps are contrasted with the Extermination Camps, which were purpose built for mass killing, with large gas chambers and later on, crematoria, but little or no facilities for inmates. Often they were disguised with false facades to lull the new arrivals into a false sense of security, even though rumors were of course rife for the fate that awaited the deportees. Almost all arrivals were killed upon arrival at these camps, and in many cases the number of survivors numbered in the single digits, such as at Bełżec, where only seven Jews, forced to assist in operation of the camp, were alive after the war.&lt;/p&gt;\n\n&lt;p&gt;Several camps, however, were &amp;#39;Hybrids&amp;#39; of both types, the most famous being Auschwitz, which was vast a complex of subcamps. The infamous &amp;#39;selection&amp;#39; of prisoners, conducted by SS doctors upon arrival, meant life or death, with those deemed unsuited for labor immediately gassed and the more healthy and robust given at least temporary reprieve. The death count at Auschwitz numbered around 1 million, but it is also the source of many survivor testimonies.&lt;/p&gt;\n\n&lt;h2&gt;How Do We Know?&lt;/h2&gt;\n\n&lt;p&gt;Running through the evidence piece by piece would take more space than we have here, but suffice to say, there is a lot of evidence, and not just the (mountains of) survivor testimony. We have testimonies and writings from many who participated, as well German documentation of the programs. &lt;a href=\"http://holocaustcontroversies.blogspot.de/2012/10/index-of-published-evidence-on.html\"&gt;This site&lt;/a&gt; catalogs some of the evidence we have for mass extermination as it relates to Auschwitz. I&amp;#39;ll close this out with a short list of excellent works that should help to introduce you to various aspects of Holocaust study.  &lt;/p&gt;\n\n&lt;h2&gt;Further Reading&lt;/h2&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&amp;quot;&lt;a href=\"https://books.google.com/books?id=HZmXOPGTGjIC\"&gt;Third Reich Trilogy&lt;/a&gt;&amp;quot; by Richard Evans&lt;/li&gt;\n&lt;li&gt;&amp;quot;&lt;a href=\"https://books.google.com/books?id=Z7FiPwAACAAJ\"&gt;Hitler, the Germans, and the Final Solution&lt;/a&gt;&amp;quot; by Ian Kershaw&lt;/li&gt;\n&lt;li&gt;&amp;quot;&lt;a href=\"https://books.google.com/books?id=bx-dZEV228QC\"&gt;Auschwitz: A New History&lt;/a&gt;&amp;quot; by Laurence Rees&lt;/li&gt;\n&lt;li&gt;&amp;quot;&lt;a href=\"https://books.google.com/books?id=HFB-dkuZzSwC\"&gt;Ordinary Men&lt;/a&gt;&amp;quot; by Christopher Browning&lt;/li&gt;\n&lt;li&gt;&amp;quot;&lt;a href=\"https://books.google.com/books?id=Q-0B9-D5Vz4C\"&gt;Denying History&lt;/a&gt;&amp;quot; by Michael Shermer and Alex Grobman&lt;/li&gt;\n&lt;li&gt;[The Minutes from the Wannsee Conference](&lt;a href=\"http://www.holocaustresearchp\"&gt;http://www.holocaustresearchp&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgdh6hh", "score_hidden": false, "stickied": false, "created": 1492464672.0, "created_utc": 1492435872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh53", "removal_reason": null, "link_id": "t3_65vjxq", "likes": null, "replies": "", "user_reports": [], "id": "dgdltz5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fraktarn", "parent_id": "t3_65vjxq", "subreddit_name_prefixed": "r/history", "controversiality": 0, "body": "In this lecture [Timothy D. Snyder](https://en.wikipedia.org/wiki/Timothy_D._Snyder?wprov=sfsi1) presents arguments from his book \"[Black Earth: The Holocaust as History and Warning](https://en.wikipedia.org/wiki/Black_Earth:_The_Holocaust_as_History_and_Warning?wprov=sfsi1)\" (2015). \n\nIn this book \"... Mr. Snyder aims to offer a radically new explanation of the Nazi genocide grounded in Hitler's belief in a global ecological crisis caused by the Jews, while also sounding an alarm about how our own era of environmental disruption could lead to similar orgies of violence\" \n\n\"Mr. Snyder's central claim [is] that the Holocaust depended crucially not on Hitler's creation of an all-powerful German state but in his determination to create zones of statelessness in the territories he conquered.\"\n\nBoth quotes from the New York Times article on Snyder: \"[Timothy Snyder’s ‘Black Earth’ Puts Holocaust, and Himself, in Spotlight\"](https://mobile.nytimes.com/2015/09/08/books/timothy-snyders-black-earth-puts-holocaust-and-himself-in-spotlight.html?referer=)\", September 7, 2015. \n\nTimothy D. Snyder is an American historian and professor at Yale University. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In this lecture &lt;a href=\"https://en.wikipedia.org/wiki/Timothy_D._Snyder?wprov=sfsi1\"&gt;Timothy D. Snyder&lt;/a&gt; presents arguments from his book &amp;quot;&lt;a href=\"https://en.wikipedia.org/wiki/Black_Earth:_The_Holocaust_as_History_and_Warning?wprov=sfsi1\"&gt;Black Earth: The Holocaust as History and Warning&lt;/a&gt;&amp;quot; (2015). &lt;/p&gt;\n\n&lt;p&gt;In this book &amp;quot;... Mr. Snyder aims to offer a radically new explanation of the Nazi genocide grounded in Hitler&amp;#39;s belief in a global ecological crisis caused by the Jews, while also sounding an alarm about how our own era of environmental disruption could lead to similar orgies of violence&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Mr. Snyder&amp;#39;s central claim [is] that the Holocaust depended crucially not on Hitler&amp;#39;s creation of an all-powerful German state but in his determination to create zones of statelessness in the territories he conquered.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Both quotes from the New York Times article on Snyder: &amp;quot;&lt;a href=\"https://mobile.nytimes.com/2015/09/08/books/timothy-snyders-black-earth-puts-holocaust-and-himself-in-spotlight.html?referer=\"&gt;Timothy Snyder’s ‘Black Earth’ Puts Holocaust, and Himself, in Spotlight&amp;quot;&lt;/a&gt;&amp;quot;, September 7, 2015. &lt;/p&gt;\n\n&lt;p&gt;Timothy D. Snyder is an American historian and professor at Yale University. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "history", "name": "t1_dgdltz5", "score_hidden": false, "stickied": false, "created": 1492471033.0, "created_utc": 1492442233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]