[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "metalgearsolid", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s such an extravagant story that&amp;#39;s like an anime. While the plot is complicated, it&amp;#39;s a fun story that isn&amp;#39;t supposed to be the most realistic thing, which leaves room for the ridiculous characters and plot. My favorite game series, Uncharted, is amazing and I love it for what it is, but the story is very grounded. The reason I love metal gear so much is because it&amp;#39;s a breath of fresh air from the somewhat serious Uncharted or Last of us. What are you&amp;#39;re thoughts and why do you guys love metal gear?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's such an extravagant story that's like an anime. While the plot is complicated, it's a fun story that isn't supposed to be the most realistic thing, which leaves room for the ridiculous characters and plot. My favorite game series, Uncharted, is amazing and I love it for what it is, but the story is very grounded. The reason I love metal gear so much is because it's a breath of fresh air from the somewhat serious Uncharted or Last of us. What are you're thoughts and why do you guys love metal gear?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ng3f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "LordDumblecrumb", "saved": false, "mod_reports": [], "name": "t3_65ng3f", "subreddit_name_prefixed": "r/metalgearsolid", "approved_by": null, "over_18": false, "domain": "self.metalgearsolid", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s4hr", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/metalgearsolid/comments/65ng3f/why_i_love_metal_gear/", "num_reports": null, "locked": false, "stickied": false, "created": 1492345863.0, "url": "https://www.reddit.com/r/metalgearsolid/comments/65ng3f/why_i_love_metal_gear/", "author_flair_text": null, "quarantine": false, "title": "Why I love Metal Gear", "created_utc": 1492317063.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 26, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": "", "user_reports": [], "id": "dgc6o6f", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "LordDumblecrumb", "parent_id": "t1_dgbvkee", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Yeah like 5 was definitely darker and more gritty but it still was amazing and definitely a Kojima game. When I say things like \"it's a breath of fresh air\", I'm referring to the feeling of being caught up in the extreme dialogue and characters. All in all, I think we can agree that the series is one of the best ever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah like 5 was definitely darker and more gritty but it still was amazing and definitely a Kojima game. When I say things like &amp;quot;it&amp;#39;s a breath of fresh air&amp;quot;, I&amp;#39;m referring to the feeling of being caught up in the extreme dialogue and characters. All in all, I think we can agree that the series is one of the best ever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgc6o6f", "score_hidden": false, "stickied": false, "created": 1492387049.0, "created_utc": 1492358249.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvkee", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "gsingh1895", "parent_id": "t1_dgbq5fo", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Yeah I like the realistic gritty tone of mgsv, yet it still managed to incorporate our favorite things from the series. That juxtaposition has always been there but it's especially ridiculous and silly in this one where you're allowed to send people flying with balloons and run around in a chicken hat while simultaneously doing serious soldier stuff.\n\nOn the other hand the rest of the series, like you said, is just like one of my Japanese animes...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I like the realistic gritty tone of mgsv, yet it still managed to incorporate our favorite things from the series. That juxtaposition has always been there but it&amp;#39;s especially ridiculous and silly in this one where you&amp;#39;re allowed to send people flying with balloons and run around in a chicken hat while simultaneously doing serious soldier stuff.&lt;/p&gt;\n\n&lt;p&gt;On the other hand the rest of the series, like you said, is just like one of my Japanese animes...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgbvkee", "score_hidden": false, "stickied": false, "created": 1492363152.0, "created_utc": 1492334352.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": "", "user_reports": [], "id": "dgc2yil", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "theonewhoknack", "parent_id": "t1_dgbq5fo", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "PW was like a kids cartoon from the 80s like gi joe while V was the gritty PG 13 movie adaption of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PW was like a kids cartoon from the 80s like gi joe while V was the gritty PG 13 movie adaption of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgc2yil", "score_hidden": false, "stickied": false, "created": 1492381699.0, "created_utc": 1492352899.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": "", "user_reports": [], "id": "dgcaz3l", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "thanatos388", "parent_id": "t1_dgcaoqz", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Yea people who think V is well written are somewhat delusional I suppose.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea people who think V is well written are somewhat delusional I suppose.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcaz3l", "score_hidden": false, "stickied": false, "created": 1492392729.0, "created_utc": 1492363929.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcf017", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "thanatos388", "parent_id": "t1_dgcef2f", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Oh please explain to me just how deep Kaz is in V.  It would be helpful for you to actually say something on the games instead of lazily dismissing everything I say.  What is this amazing character work you speak of?  What is this \"everything\" I'm ignoring in TPP?  \n\nChicio goes nowhere?  He goes from being a kid without direction to a kid who decides too early to be a soldier.  Which is more I can say for literally every character in TPP.  No really, please actually say something of substance because you are just coming off as a blind fanboy at this point with nothing but marketing quotes to defend TPP.  You wont convince anyone with \"No its good because shut up I say so!\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh please explain to me just how deep Kaz is in V.  It would be helpful for you to actually say something on the games instead of lazily dismissing everything I say.  What is this amazing character work you speak of?  What is this &amp;quot;everything&amp;quot; I&amp;#39;m ignoring in TPP?  &lt;/p&gt;\n\n&lt;p&gt;Chicio goes nowhere?  He goes from being a kid without direction to a kid who decides too early to be a soldier.  Which is more I can say for literally every character in TPP.  No really, please actually say something of substance because you are just coming off as a blind fanboy at this point with nothing but marketing quotes to defend TPP.  You wont convince anyone with &amp;quot;No its good because shut up I say so!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcf017", "score_hidden": false, "stickied": false, "created": 1492398101.0, "created_utc": 1492369301.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcef2f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OcelotSilver", "parent_id": "t1_dgceawq", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "&gt;Kaz who is the most one dimensional character ever often paired with the most one dimensional and boring Ocelot ever. \n\n*Praises an actual one-note character\n\n*Tries to argue other characters are one-note while ignoring all the character-work in the game based on close-minded delivery method\n\n*Talks about character-arc, but ignores pretty much everything in TPP\n\n*Claims for Chico to have a character-arc, that goes nowhere, to be something of significant\n\nYea you literally seem to have no clue as to what you are talking about. \n\nAlso, nobody cares. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Kaz who is the most one dimensional character ever often paired with the most one dimensional and boring Ocelot ever. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;*Praises an actual one-note character&lt;/p&gt;\n\n&lt;p&gt;*Tries to argue other characters are one-note while ignoring all the character-work in the game based on close-minded delivery method&lt;/p&gt;\n\n&lt;p&gt;*Talks about character-arc, but ignores pretty much everything in TPP&lt;/p&gt;\n\n&lt;p&gt;*Claims for Chico to have a character-arc, that goes nowhere, to be something of significant&lt;/p&gt;\n\n&lt;p&gt;Yea you literally seem to have no clue as to what you are talking about. &lt;/p&gt;\n\n&lt;p&gt;Also, nobody cares. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcef2f", "score_hidden": false, "stickied": false, "created": 1492397314.0, "created_utc": 1492368514.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgceawq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thanatos388", "parent_id": "t1_dgcdy1y", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Eli hates Snake because he does and will surpass him.  We know this because he gives Snake the stink eye all the time.  The point of Chico having dreams is that he eventually leaves them behind to fight for Snake.  This is something called a character arc.  Something nobody in the Phantom Pain actually had.  Except Kaz.  Oh fuck you wanna talk about delivery and execution?  Kaz who is the most one dimensional character ever often paired with the most one dimensional and boring Ocelot ever.  Eventually he tells you he realizes revenge was wrong as a disembodied voice in your helicopter for no actually reason after Huey is let go.  Doesn't make any sense but there was probably just some cut content in this masterpiece game.\n\nBut lets get to fucking Eli.  What do we learn with this superior and smarter way of storytelling?  Because apparently exposition is always bad.  Did the Nostalgia Critic teach you that?  Lack of words is always better than no words and anyone who disagrees just isn't using their BRAIN right?  Thats just peachy.  So from Elis dislogue and the exposition that Ocelot gives us we learn that Eli hates he's a clone and wants to surpass Snake while having control over the other children.  What does the cinematography and interactions with Eli teach us?  That Eli hates Snake, has control of the children, and wants to surpass Snake.  This is accomplished by Eli having permanent stink eye for the entire game.  Deep shit right?  This Eli character totally doesn't have the depth of a bully in a shitty 90s film.\n\nLets talk more about execution.  Since you didn't read my comment the first time I'll just reiterate that Chico was also well handled because he is just so casually dropped into your list of employees to be given a job to do as a soldier in your army.  Its so casual and subtle that most didn't think anything of it and thought that Snake was mostly a good guy by the end of Peace Walker.  V deals with a character that tries his best to be an angel and falls into the cult of Big Boss off screen at the last second with no explanation.  He just punches a mirror to show that he and Big Boss are now the same after an entire game of him being the opposite of Big Boss because the game ended and we have to show that now even if it makes no sense.  Brilliant.  I guess if I use my brain more I'll realize that we don't need a reason for Venom to fall under the influence of the real Big Boss or to not even give a shit that his life was stolen.  What matters is that there were fewer words.  And I'm so much smarter than everyone else for liking a story with less words.  Thats why Kojima loves 2001 right?  The lack of words?", "edited": 1492368887.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eli hates Snake because he does and will surpass him.  We know this because he gives Snake the stink eye all the time.  The point of Chico having dreams is that he eventually leaves them behind to fight for Snake.  This is something called a character arc.  Something nobody in the Phantom Pain actually had.  Except Kaz.  Oh fuck you wanna talk about delivery and execution?  Kaz who is the most one dimensional character ever often paired with the most one dimensional and boring Ocelot ever.  Eventually he tells you he realizes revenge was wrong as a disembodied voice in your helicopter for no actually reason after Huey is let go.  Doesn&amp;#39;t make any sense but there was probably just some cut content in this masterpiece game.&lt;/p&gt;\n\n&lt;p&gt;But lets get to fucking Eli.  What do we learn with this superior and smarter way of storytelling?  Because apparently exposition is always bad.  Did the Nostalgia Critic teach you that?  Lack of words is always better than no words and anyone who disagrees just isn&amp;#39;t using their BRAIN right?  Thats just peachy.  So from Elis dislogue and the exposition that Ocelot gives us we learn that Eli hates he&amp;#39;s a clone and wants to surpass Snake while having control over the other children.  What does the cinematography and interactions with Eli teach us?  That Eli hates Snake, has control of the children, and wants to surpass Snake.  This is accomplished by Eli having permanent stink eye for the entire game.  Deep shit right?  This Eli character totally doesn&amp;#39;t have the depth of a bully in a shitty 90s film.&lt;/p&gt;\n\n&lt;p&gt;Lets talk more about execution.  Since you didn&amp;#39;t read my comment the first time I&amp;#39;ll just reiterate that Chico was also well handled because he is just so casually dropped into your list of employees to be given a job to do as a soldier in your army.  Its so casual and subtle that most didn&amp;#39;t think anything of it and thought that Snake was mostly a good guy by the end of Peace Walker.  V deals with a character that tries his best to be an angel and falls into the cult of Big Boss off screen at the last second with no explanation.  He just punches a mirror to show that he and Big Boss are now the same after an entire game of him being the opposite of Big Boss because the game ended and we have to show that now even if it makes no sense.  Brilliant.  I guess if I use my brain more I&amp;#39;ll realize that we don&amp;#39;t need a reason for Venom to fall under the influence of the real Big Boss or to not even give a shit that his life was stolen.  What matters is that there were fewer words.  And I&amp;#39;m so much smarter than everyone else for liking a story with less words.  Thats why Kojima loves 2001 right?  The lack of words?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgceawq", "score_hidden": false, "stickied": false, "created": 1492397158.0, "created_utc": 1492368358.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdy1y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OcelotSilver", "parent_id": "t1_dgcddz4", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "&gt;Well anyway let me explain myself since liking PW more than V is worth downvotes for whatever reason.\n\nAwwww this kid actually thinks that he has anything of relevance to say about anything. That's just adorable. \n\nAnd yes i don't care about your explanations because your posts have proven that you have problems thinking beyond something if the narrative doesn't shove it in your face. And surprise surprise, in order to discuss MGSV, you need to understand it's methods, and delivery/execution, and most importantly, use your BRAIN, something that you haven't really shown.\n\nBut hey Chico has DREAMS in PW which somehow makes him a good character despite not talking about the delivery method, execution, or anything in between in order to really talk about how well his characterization is implemented in the game rather than what sounds good on paper. \n\nAnd yes Eli's characterization in MGSV is far superior then Chico's. The game may not spend hours trying to hammer you with character-exposition, but it's still manages to convey great deal with Eli's characterization without having to boil it down in expositionary dialogues. Though you might have some problems finding that depth because the game uses a very indirect method, and conveys them using varies gameplay, audio, and visual elements, which as you have proven quite clearly seems impossible for you.", "edited": 1492368235.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Well anyway let me explain myself since liking PW more than V is worth downvotes for whatever reason.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Awwww this kid actually thinks that he has anything of relevance to say about anything. That&amp;#39;s just adorable. &lt;/p&gt;\n\n&lt;p&gt;And yes i don&amp;#39;t care about your explanations because your posts have proven that you have problems thinking beyond something if the narrative doesn&amp;#39;t shove it in your face. And surprise surprise, in order to discuss MGSV, you need to understand it&amp;#39;s methods, and delivery/execution, and most importantly, use your BRAIN, something that you haven&amp;#39;t really shown.&lt;/p&gt;\n\n&lt;p&gt;But hey Chico has DREAMS in PW which somehow makes him a good character despite not talking about the delivery method, execution, or anything in between in order to really talk about how well his characterization is implemented in the game rather than what sounds good on paper. &lt;/p&gt;\n\n&lt;p&gt;And yes Eli&amp;#39;s characterization in MGSV is far superior then Chico&amp;#39;s. The game may not spend hours trying to hammer you with character-exposition, but it&amp;#39;s still manages to convey great deal with Eli&amp;#39;s characterization without having to boil it down in expositionary dialogues. Though you might have some problems finding that depth because the game uses a very indirect method, and conveys them using varies gameplay, audio, and visual elements, which as you have proven quite clearly seems impossible for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcdy1y", "score_hidden": false, "stickied": false, "created": 1492396683.0, "created_utc": 1492367883.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": "", "user_reports": [], "id": "dgcwda8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thanatos388", "parent_id": "t1_dgcu37j", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Kaz: Wear that gas mask.  Intel team says the air should be clean but...\nKaz: Look for the cause of the outbreak Boss.\nVenom: ....You never know\n\nKaz: Bruh you left me hanging so long I started another thought already.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kaz: Wear that gas mask.  Intel team says the air should be clean but...\nKaz: Look for the cause of the outbreak Boss.\nVenom: ....You never know&lt;/p&gt;\n\n&lt;p&gt;Kaz: Bruh you left me hanging so long I started another thought already.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcwda8", "score_hidden": false, "stickied": false, "created": 1492421142.0, "created_utc": 1492392342.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu37j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sketti_Snake", "parent_id": "t1_dgcty19", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "[Once more...](https://www.youtube.com/watch?v=pWdd6_ZxX8c)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=pWdd6_ZxX8c\"&gt;Once more...&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcu37j", "score_hidden": false, "stickied": false, "created": 1492418166.0, "created_utc": 1492389366.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcty19", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thanatos388", "parent_id": "t1_dgctarn", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Youre right I completely forgot about that mission.  But it still doesn't make V gritty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Youre right I completely forgot about that mission.  But it still doesn&amp;#39;t make V gritty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcty19", "score_hidden": false, "stickied": false, "created": 1492417969.0, "created_utc": 1492389169.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctarn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sketti_Snake", "parent_id": "t1_dgcddz4", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "&gt;Who do you mercy kill or who gets mercy killed in V? Nobody? ok.\n\nWhat do you call the events of Mission 43 then?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Who do you mercy kill or who gets mercy killed in V? Nobody? ok.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What do you call the events of Mission 43 then?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgctarn", "score_hidden": false, "stickied": false, "created": 1492417108.0, "created_utc": 1492388308.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcddz4", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "thanatos388", "parent_id": "t1_dgcaoqz", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Well anyway let me explain myself since liking PW more than V is worth downvotes for whatever reason.  \n\nSo first child soldiers.  In V the child soldiers are magical mystical Lost Children that have 0 personality and can't be hurt ever.  They have absolutely no agency and barely count as characters are much as they are set dressing and the main point made by them is that Liquid is a dick (for no reason he just is because he is and maybe his personality was meant to be fanservice?) and that children being soldiers is bad.\n\nLets see what PW did.  Peace Walker gives us this kid Chico.  Chico has this thing, lets call it a personality.  He even has dreams, and hobbies, and interests, and a family.  He becomes a soldiers because his family is already involved in a complicated conflict and he just wants to follow them.  He eventually gets wrapped up in Snakes cult of personality and decides that he'll fight for what he believes is right which is merely what his sister and Snake tells him are right and that he'll get to his actual wants later.  A later that will never happen because a life of conflict will inevitably take his.  Meanwhile over in the Phantom Pain we have.....the one kid with the afro and the one kid in the hoodie....just sort of never talk....or do anything.......they just sit around.  Excellent stuff.  And its not like they're just super traumatized or anything they talk off screen, negotiate with Kaz when Snake isn't there.  Joke around with Eli in one scene that was just designed to show him being a dick and we are told about how they act around Mother Base.  Then they just disappear when Eli decides to leave because they aren't allowed a personality.  Chico goes on to gun down american soldiers at the end of Peace Walker and choose a life in Snakes army where he happily becomes a soldier for a mad hypocritical warlord as the player thinks nothing of having a child on your list of employees.  Its a great way to show horrible things without it being super obvious.  Most people thought Big Boss wasn't even that bad a guy at the end of Peace Walker and that Phantom Pain was \"needed\" to show him \"truly\" fall.\n\nMercy killings?  Well you mercy kill the horse which serves as a symbol for Snake letting go of his idealization of the Boss and her will.  Straying from her teachings and carving his own path as Big Boss.  Who do you mercy kill or who gets mercy killed in V?  Nobody?  ok.\n\nThe Hell That War Actually Is.\n\nOk that applies to all Metal Gears because its not like V is more violent or bloody than any other.  The hallway fight with Snake and the hallway scene in MGS1 are more bloody than anything in V.  Even when it does get super violent its only after the stupid attempted rape of Quiet so its \"ok\" and we have no reason to feel bad we're just supposed to cheer for Quiet who survives because of her magic powers and murders them all in an over the top anime action scene.  Just like the hell war actually is right?\n\nKilling an entire language is hardly a grounded concept either.  Peace Walker instead ops for centering its story around the theory of Deterrence and arguments over how peace is achievable.  Problems that actually exist in the real world and the failure of nuclear deterrence is a real one that looms over our heads even today.  Especially today.  Language getting killed?  Not so much.  The final twist?  Not so much.  They serve as metaphors for some real problems like how english takes over other languages and cultures.  I wish they explored that a bit more as Mother Base starts out as mostly english speaking but maybe you learn a bit about the other languages such as Russian and more about their words and meaning like when Code Talker gives that speech about beauty in the Cherokee language.  But we don't really.  Its just another stat.  Mother Base doesn't eventually get so big that english takes over as the necessary lingua franca.  Instead from beginning to end everyone on Mother Base is a dude bro white guy voice.  So it doesn't even feel as culturally diverse as it supposedly is.\n\nLearning about AI, deterrence, the FSLN and their beef with Cubas political history, Strangelove and Big Boss coming to terms with their hero maybe not being a person they should center their whole lives around were far more grounded and gritty themes than what Phantom Pain threw at us.\n\nBut that is just my opinion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well anyway let me explain myself since liking PW more than V is worth downvotes for whatever reason.  &lt;/p&gt;\n\n&lt;p&gt;So first child soldiers.  In V the child soldiers are magical mystical Lost Children that have 0 personality and can&amp;#39;t be hurt ever.  They have absolutely no agency and barely count as characters are much as they are set dressing and the main point made by them is that Liquid is a dick (for no reason he just is because he is and maybe his personality was meant to be fanservice?) and that children being soldiers is bad.&lt;/p&gt;\n\n&lt;p&gt;Lets see what PW did.  Peace Walker gives us this kid Chico.  Chico has this thing, lets call it a personality.  He even has dreams, and hobbies, and interests, and a family.  He becomes a soldiers because his family is already involved in a complicated conflict and he just wants to follow them.  He eventually gets wrapped up in Snakes cult of personality and decides that he&amp;#39;ll fight for what he believes is right which is merely what his sister and Snake tells him are right and that he&amp;#39;ll get to his actual wants later.  A later that will never happen because a life of conflict will inevitably take his.  Meanwhile over in the Phantom Pain we have.....the one kid with the afro and the one kid in the hoodie....just sort of never talk....or do anything.......they just sit around.  Excellent stuff.  And its not like they&amp;#39;re just super traumatized or anything they talk off screen, negotiate with Kaz when Snake isn&amp;#39;t there.  Joke around with Eli in one scene that was just designed to show him being a dick and we are told about how they act around Mother Base.  Then they just disappear when Eli decides to leave because they aren&amp;#39;t allowed a personality.  Chico goes on to gun down american soldiers at the end of Peace Walker and choose a life in Snakes army where he happily becomes a soldier for a mad hypocritical warlord as the player thinks nothing of having a child on your list of employees.  Its a great way to show horrible things without it being super obvious.  Most people thought Big Boss wasn&amp;#39;t even that bad a guy at the end of Peace Walker and that Phantom Pain was &amp;quot;needed&amp;quot; to show him &amp;quot;truly&amp;quot; fall.&lt;/p&gt;\n\n&lt;p&gt;Mercy killings?  Well you mercy kill the horse which serves as a symbol for Snake letting go of his idealization of the Boss and her will.  Straying from her teachings and carving his own path as Big Boss.  Who do you mercy kill or who gets mercy killed in V?  Nobody?  ok.&lt;/p&gt;\n\n&lt;p&gt;The Hell That War Actually Is.&lt;/p&gt;\n\n&lt;p&gt;Ok that applies to all Metal Gears because its not like V is more violent or bloody than any other.  The hallway fight with Snake and the hallway scene in MGS1 are more bloody than anything in V.  Even when it does get super violent its only after the stupid attempted rape of Quiet so its &amp;quot;ok&amp;quot; and we have no reason to feel bad we&amp;#39;re just supposed to cheer for Quiet who survives because of her magic powers and murders them all in an over the top anime action scene.  Just like the hell war actually is right?&lt;/p&gt;\n\n&lt;p&gt;Killing an entire language is hardly a grounded concept either.  Peace Walker instead ops for centering its story around the theory of Deterrence and arguments over how peace is achievable.  Problems that actually exist in the real world and the failure of nuclear deterrence is a real one that looms over our heads even today.  Especially today.  Language getting killed?  Not so much.  The final twist?  Not so much.  They serve as metaphors for some real problems like how english takes over other languages and cultures.  I wish they explored that a bit more as Mother Base starts out as mostly english speaking but maybe you learn a bit about the other languages such as Russian and more about their words and meaning like when Code Talker gives that speech about beauty in the Cherokee language.  But we don&amp;#39;t really.  Its just another stat.  Mother Base doesn&amp;#39;t eventually get so big that english takes over as the necessary lingua franca.  Instead from beginning to end everyone on Mother Base is a dude bro white guy voice.  So it doesn&amp;#39;t even feel as culturally diverse as it supposedly is.&lt;/p&gt;\n\n&lt;p&gt;Learning about AI, deterrence, the FSLN and their beef with Cubas political history, Strangelove and Big Boss coming to terms with their hero maybe not being a person they should center their whole lives around were far more grounded and gritty themes than what Phantom Pain threw at us.&lt;/p&gt;\n\n&lt;p&gt;But that is just my opinion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcddz4", "score_hidden": false, "stickied": false, "created": 1492395926.0, "created_utc": 1492367126.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcaoqz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "OcelotSilver", "parent_id": "t1_dgbvkq2", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "&gt;I actually think PW handled all those topics better and has a far more grounded and gritty story than V does\n\nThat is some high level of delusional.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I actually think PW handled all those topics better and has a far more grounded and gritty story than V does&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is some high level of delusional.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcaoqz", "score_hidden": false, "stickied": false, "created": 1492392346.0, "created_utc": 1492363546.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": "", "user_reports": [], "id": "dgbvkzh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sketti_Snake", "parent_id": "t1_dgbvkq2", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Yeah, well, that's just, like, your opinion, man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, well, that&amp;#39;s just, like, your opinion, man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgbvkzh", "score_hidden": false, "stickied": false, "created": 1492363204.0, "created_utc": 1492334404.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvkq2", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "thanatos388", "parent_id": "t1_dgbvhml", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "I actually think PW handled all those topics better and has a far more grounded and gritty story than V did.", "edited": 1492368922.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually think PW handled all those topics better and has a far more grounded and gritty story than V did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgbvkq2", "score_hidden": false, "stickied": false, "created": 1492363180.0, "created_utc": 1492334380.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvhml", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sketti_Snake", "parent_id": "t1_dgbuy24", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Reality as in it deals with more grounded concepts such as child soldiers, battlefield rape, mercy killings, and the hell that war actually is. Which as I said is a contrast to Peace Walker. Yes, MGSV it's still a MGS game at heart with some weird characters, fuzzy science McGuffins, and hammy dialogue, but I think you knew what I was driving at.", "edited": 1492334356.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reality as in it deals with more grounded concepts such as child soldiers, battlefield rape, mercy killings, and the hell that war actually is. Which as I said is a contrast to Peace Walker. Yes, MGSV it&amp;#39;s still a MGS game at heart with some weird characters, fuzzy science McGuffins, and hammy dialogue, but I think you knew what I was driving at.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgbvhml", "score_hidden": false, "stickied": false, "created": 1492362881.0, "created_utc": 1492334081.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbuy24", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "thanatos388", "parent_id": "t1_dgbq5fo", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Everything about Skull Face.\n\nSkuuuuuuullll Face.\n\n\"Reality\"\n\n\nThe major plot twist.\n\n\"Reality\"\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything about Skull Face.&lt;/p&gt;\n\n&lt;p&gt;Skuuuuuuullll Face.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Reality&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The major plot twist.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Reality&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgbuy24", "score_hidden": false, "stickied": false, "created": 1492361067.0, "created_utc": 1492332267.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbq5fo", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Sketti_Snake", "parent_id": "t3_65ng3f", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "&gt;It's such an extravagant story that's like an anime.\n\nAgreed. If you haven't gotten to Peace Walker yet, it ramps the anime vibe up to 11. But MGSV crashes that back down to reality. It's a very stark contrast and I think it's very well done.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s such an extravagant story that&amp;#39;s like an anime.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agreed. If you haven&amp;#39;t gotten to Peace Walker yet, it ramps the anime vibe up to 11. But MGSV crashes that back down to reality. It&amp;#39;s a very stark contrast and I think it&amp;#39;s very well done.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgbq5fo", "score_hidden": false, "stickied": false, "created": 1492348708.0, "created_utc": 1492319908.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": "", "user_reports": [], "id": "dgbsw2w", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "PM_ME_UR_CUDDLEZ", "parent_id": "t3_65ng3f", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Metal...Gear??", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Metal...Gear??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgbsw2w", "score_hidden": false, "stickied": false, "created": 1492354962.0, "created_utc": 1492326162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": "", "user_reports": [], "id": "dgbw29g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Funkytor", "parent_id": "t3_65ng3f", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "The whole Patriots things, evil memes etc, somethimes i stop to think if my opinion and thought trully are my own or rather something that has just been printed unto my mind by others, and its al thanks to silly video game; which is awsome ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The whole Patriots things, evil memes etc, somethimes i stop to think if my opinion and thought trully are my own or rather something that has just been printed unto my mind by others, and its al thanks to silly video game; which is awsome &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgbw29g", "score_hidden": false, "stickied": false, "created": 1492364878.0, "created_utc": 1492336078.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65ng3f", "likes": null, "replies": "", "user_reports": [], "id": "dgcvqej", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShiveringPug", "parent_id": "t3_65ng3f", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "I just like sneaking around.\n\n\nEverything else is gravy and no other series else quite has the same character.", "edited": 1492392864.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just like sneaking around.&lt;/p&gt;\n\n&lt;p&gt;Everything else is gravy and no other series else quite has the same character.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgcvqej", "score_hidden": false, "stickied": false, "created": 1492420344.0, "created_utc": 1492391544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]