[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "metalgearsolid", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sort of had an epiphany tonight...... anyways... please give me any thoughts you have on this below.&lt;/p&gt;\n\n&lt;p&gt;In the E3 2015 trailer, Skullface gives a very cryptic story about his past:&lt;/p&gt;\n\n&lt;h2&gt;&amp;quot;I was born in a small village. I was still a child when we were raided by soldiers - foreign soldiers. Torn from my elders I was made to speak their language. With each new post my masters changed along with the words they made me speak. With each change - I changed too. My thoughts, personality, How I saw right and wrong... Words Can Kill.&amp;quot;&lt;/h2&gt;\n\n&lt;h2&gt;&amp;quot;Time and again the country was ruled by a foreign tongue. When he was a young boy he lost his native language. The bedrock for any developing child. His country, His family, His face - His identity. Everything was stolen from him.&amp;quot;&lt;/h2&gt;\n\n&lt;h2&gt;&amp;quot;Since ancient times every civilizations ruler has had the same idea. When people unite under one will - they become stronger than the sums of their parts. And what do rulers use to bring people together? Language.&amp;quot;&lt;/h2&gt;\n\n&lt;h2&gt;&amp;quot;This world will become one - I have found the way. Race, Tribal affiliations, National borders. Even our faces will be irrelevant. The world that The Boss envisioned will finally become a reality. And it will make mankind whole again...&amp;quot;&lt;/h2&gt;\n\n&lt;h2&gt;&amp;quot;America is a country of ;liberty. A meeting of immigrants. Instead of simply assimilating its citizens live alongside others. So the major sought a system that used information: Words - To control the subconscious.&amp;quot;&lt;/h2&gt;\n\n&lt;h2&gt;&amp;quot;In his eyes the greatest symbiotic parasite the worlds ever known isn&amp;#39;t microbial - it&amp;#39;s linguistic. Words are what keep civilization, our world - alive. Free the world, Not by taking mens lives. But by taking their tongues.&amp;quot;&lt;/h2&gt;\n\n&lt;h2&gt;&amp;quot;With this i&amp;#39;ll rid the world of infestation. Sans Lingua Franca - The world will be torn asunder, And then it shall be free.&amp;quot;&lt;/h2&gt;\n\n&lt;h2&gt;&amp;quot;The chain of retaliation is what will truly bind this world together as one&amp;quot;&lt;/h2&gt;\n\n&lt;p&gt;So for those of you who don&amp;#39;t know, one of the main themes of MGSV is laungage. In the story, Skullface plans to use the Vocal Cord Parasites to rid the world of language. Namely the English, as it was (and still is) the &amp;quot;Lingua Franca&amp;quot; of the world - the language that is most commonly understood throughout the globe.&lt;/p&gt;\n\n&lt;p&gt;While many people scoff at this idea, claiming that it is the lamest &amp;quot;villain&amp;quot; plot, I for one see it as the most powerful method of worldwide chaos ever conceived in a Metal Gear Game.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Yes, Solidus planned to destory the financial center of the world by detonating a hydrogen bomb - and such an event would prove catastropic to the outside world&lt;/li&gt;\n&lt;li&gt;Yes, Hot Coldman planned to cause nuclear armageddon (as did Liquid to some extent)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;And these are all valid contestants for such a position of infamy. But it seems to me, the dissolution of the English language would seem to be the most catastrophic. And I shall explain why.&lt;/p&gt;\n\n&lt;p&gt;Until recently, I never would&amp;#39;ve supported such a claim. &amp;quot;How can losing the ability to speak english be more impactful than WW3?&amp;quot; I might&amp;#39;ve said, or &amp;quot;Well it doesn&amp;#39;t really matter if english is gone, people will still be able to communicate, right&amp;quot;. Yes, actually they would, and in a way, that sort of invalidates my arguement. But the extermination of the English language would do &lt;em&gt;more&lt;/em&gt; than just simply rid the world of some measly way of breathing to get our ideas to one another.&lt;/p&gt;\n\n&lt;p&gt;The removal of the English language, would not only cause a worldwide microbe-based genocide as a result of sheer deaths, but would also &lt;strong&gt;LITERALLY&lt;/strong&gt; change the course of history into an entirely new direction. I&amp;#39;m not talking about a meer shift from English to Mandarin, or Spanish or Russian. I&amp;#39;m talking about a society-wide that originates at the neurological level. Think about it: 99% of people looking at &lt;em&gt;this point&lt;/em&gt; of the screen &lt;em&gt;right now&lt;/em&gt; understand English. As Skullface said in his monologue, &amp;quot;...with each new post my masters change along with the words they made me speak. With each change - &lt;strong&gt;I changed too. My thoughts, personality, How I saw right and wrong.... Words Can Kill.&amp;quot;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t understand what I&amp;#39;m getting at, Skullface plans to essentially catalyze the extinction of the, what I will call, The &lt;strong&gt;&amp;quot;ENLGISH LANGUAGE OF THOUGHT&amp;quot;&lt;/strong&gt;. And I can attest to this, as I am bilingual. The idea is that the integration of a new language into the brain creates a separate &lt;strong&gt;personality&lt;/strong&gt; based on that language. While speaking my primary language, I am extremely formal, hardly ever aggressive, and generally am your typical shy guy. But when I speak my secondary language, I speak quite differently: I&amp;#39;m much more comical, I enjoy speaking publicly and engaging in conversations. The difference is quite large, and it seems the way I process things generally is much more optimized. In a sense, it seems as though my Spanish \nself&amp;quot; is more in tact that my &amp;quot;English self&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;The removal of my &lt;em&gt;Lingua Franca&lt;/em&gt; would be quite interesting. Rulers of any language communicate to their people. Without language, or any form of communication, we would be meer animals; savages unable to properly express ourselves to each other. But &lt;em&gt;with&lt;/em&gt; language, we can elicit our thoughts to others. According to many estimates, easily 1 Billion people today can speak English. Beyond that, there are even more overall who can understand it. By understanding the language, these people have been converted to the English Language of Thought. This, as Ocelot mentions, &lt;strong&gt;is&lt;/strong&gt; a parasite. These people have already, by default, been surrendered to English custody. From now on, English can occupy their thoughts, can influence their speech (if able), and can contribute to the spread of the &lt;em&gt;meme&lt;/em&gt; of English language. From there, it multiplies, spreads like a virus, and converts entire cultures in mere decades into English-accepting lands.&lt;/p&gt;\n\n&lt;p&gt;In a sense, English occupies, and controls ones mind. The removal of the ability to speak it would create a complete dissolution of reality for many (ignoring the shock from such a ridiculous disease XD). They would be unable to &amp;quot;be&amp;quot; their English selves, and would be compelled quite strongly to learn a new language. From there, the rest would be history. But the point stands: The removal of English would destroy a cornerstone of many&amp;#39;s ability to understand &lt;em&gt;anything&lt;/em&gt;, and would delete a hivemind from existence.&lt;/p&gt;\n\n&lt;p&gt;Realizing this blew my mind - can&amp;#39;t even begin to imagine how living in a new language would fundamentally change me as a person. Poor Skullface.&lt;/p&gt;\n\n&lt;h2&gt;TL:DR - &lt;em&gt;&amp;quot;It is no nation that we inhabit, but a language.&amp;quot; &amp;quot;Make no mistake; our native tongue is our true fatherland.&lt;/em&gt; - Emil Cioran&lt;/h2&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sort of had an epiphany tonight...... anyways... please give me any thoughts you have on this below.\n\nIn the E3 2015 trailer, Skullface gives a very cryptic story about his past:\n\n\"I was born in a small village. I was still a child when we were raided by soldiers - foreign soldiers. Torn from my elders I was made to speak their language. With each new post my masters changed along with the words they made me speak. With each change - I changed too. My thoughts, personality, How I saw right and wrong... Words Can Kill.\"\n----\n\"Time and again the country was ruled by a foreign tongue. When he was a young boy he lost his native language. The bedrock for any developing child. His country, His family, His face - His identity. Everything was stolen from him.\"\n----\n\"Since ancient times every civilizations ruler has had the same idea. When people unite under one will - they become stronger than the sums of their parts. And what do rulers use to bring people together? Language.\"\n-----\n\"This world will become one - I have found the way. Race, Tribal affiliations, National borders. Even our faces will be irrelevant. The world that The Boss envisioned will finally become a reality. And it will make mankind whole again...\"\n----\n\"America is a country of ;liberty. A meeting of immigrants. Instead of simply assimilating its citizens live alongside others. So the major sought a system that used information: Words - To control the subconscious.\"\n---\n\"In his eyes the greatest symbiotic parasite the worlds ever known isn't microbial - it's linguistic. Words are what keep civilization, our world - alive. Free the world, Not by taking mens lives. But by taking their tongues.\"\n----\n\"With this i'll rid the world of infestation. Sans Lingua Franca - The world will be torn asunder, And then it shall be free.\"\n----\n\"The chain of retaliation is what will truly bind this world together as one\"\n---\n\nSo for those of you who don't know, one of the main themes of MGSV is laungage. In the story, Skullface plans to use the Vocal Cord Parasites to rid the world of language. Namely the English, as it was (and still is) the \"Lingua Franca\" of the world - the language that is most commonly understood throughout the globe.\n\nWhile many people scoff at this idea, claiming that it is the lamest \"villain\" plot, I for one see it as the most powerful method of worldwide chaos ever conceived in a Metal Gear Game.\n\n- Yes, Solidus planned to destory the financial center of the world by detonating a hydrogen bomb - and such an event would prove catastropic to the outside world\n- Yes, Hot Coldman planned to cause nuclear armageddon (as did Liquid to some extent)\n\nAnd these are all valid contestants for such a position of infamy. But it seems to me, the dissolution of the English language would seem to be the most catastrophic. And I shall explain why.\n\nUntil recently, I never would've supported such a claim. \"How can losing the ability to speak english be more impactful than WW3?\" I might've said, or \"Well it doesn't really matter if english is gone, people will still be able to communicate, right\". Yes, actually they would, and in a way, that sort of invalidates my arguement. But the extermination of the English language would do *more* than just simply rid the world of some measly way of breathing to get our ideas to one another.\n\nThe removal of the English language, would not only cause a worldwide microbe-based genocide as a result of sheer deaths, but would also **LITERALLY** change the course of history into an entirely new direction. I'm not talking about a meer shift from English to Mandarin, or Spanish or Russian. I'm talking about a society-wide that originates at the neurological level. Think about it: 99% of people looking at *this point* of the screen *right now* understand English. As Skullface said in his monologue, \"...with each new post my masters change along with the words they made me speak. With each change - **I changed too. My thoughts, personality, How I saw right and wrong.... Words Can Kill.\"**\n\nIf you don't understand what I'm getting at, Skullface plans to essentially catalyze the extinction of the, what I will call, The **\"ENLGISH LANGUAGE OF THOUGHT\"**. And I can attest to this, as I am bilingual. The idea is that the integration of a new language into the brain creates a separate **personality** based on that language. While speaking my primary language, I am extremely formal, hardly ever aggressive, and generally am your typical shy guy. But when I speak my secondary language, I speak quite differently: I'm much more comical, I enjoy speaking publicly and engaging in conversations. The difference is quite large, and it seems the way I process things generally is much more optimized. In a sense, it seems as though my Spanish \nself\" is more in tact that my \"English self\".\n\nThe removal of my *Lingua Franca* would be quite interesting. Rulers of any language communicate to their people. Without language, or any form of communication, we would be meer animals; savages unable to properly express ourselves to each other. But *with* language, we can elicit our thoughts to others. According to many estimates, easily 1 Billion people today can speak English. Beyond that, there are even more overall who can understand it. By understanding the language, these people have been converted to the English Language of Thought. This, as Ocelot mentions, **is** a parasite. These people have already, by default, been surrendered to English custody. From now on, English can occupy their thoughts, can influence their speech (if able), and can contribute to the spread of the *meme* of English language. From there, it multiplies, spreads like a virus, and converts entire cultures in mere decades into English-accepting lands.\n\nIn a sense, English occupies, and controls ones mind. The removal of the ability to speak it would create a complete dissolution of reality for many (ignoring the shock from such a ridiculous disease XD). They would be unable to \"be\" their English selves, and would be compelled quite strongly to learn a new language. From there, the rest would be history. But the point stands: The removal of English would destroy a cornerstone of many's ability to understand *anything*, and would delete a hivemind from existence.\n\nRealizing this blew my mind - can't even begin to imagine how living in a new language would fundamentally change me as a person. Poor Skullface.\n\nTL:DR - *\"It is no nation that we inhabit, but a language.\" \"Make no mistake; our native tongue is our true fatherland.* - Emil Cioran\n------", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65topc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "Fistful_of_Crashes", "saved": false, "mod_reports": [], "name": "t3_65topc", "subreddit_name_prefixed": "r/metalgearsolid", "approved_by": null, "over_18": false, "domain": "self.metalgearsolid", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s4hr", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "2sldus", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/metalgearsolid/comments/65topc/words_that_kill/", "num_reports": null, "locked": false, "stickied": false, "created": 1492434246.0, "url": "https://www.reddit.com/r/metalgearsolid/comments/65topc/words_that_kill/", "author_flair_text": "", "quarantine": false, "title": "Words That Kill?", "created_utc": 1492405446.0, "distinguished": null, "media": null, "upvote_ratio": 0.82, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65topc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65topc", "likes": null, "replies": "", "user_reports": [], "id": "dge97sz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fistful_of_Crashes", "parent_id": "t1_dgdh0eb", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "- But what would be the point in thinking in English if speaking it can kill you? You would be forced to learn a new language to avoid that possibility altogether, or at least you should. And eventually after merging with a new culture that speaks the new language, eventually you'd alter your internal monologue to be in that language too, just as Skullface did.\n\n- There's definately more to discuess there, but I'll cede that the nukes + Sahelanthropus fiasco are a bit of a separate subplot within Skullface's plans, and as a result I just left it out. Besides, I was mainly focusing on the content within the trailer itself.\n\n- And sorry for the whole 'meer' thing, I wrote this drunk at 2am last night. I'm just proud I made it coherent XD\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;But what would be the point in thinking in English if speaking it can kill you? You would be forced to learn a new language to avoid that possibility altogether, or at least you should. And eventually after merging with a new culture that speaks the new language, eventually you&amp;#39;d alter your internal monologue to be in that language too, just as Skullface did.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There&amp;#39;s definately more to discuess there, but I&amp;#39;ll cede that the nukes + Sahelanthropus fiasco are a bit of a separate subplot within Skullface&amp;#39;s plans, and as a result I just left it out. Besides, I was mainly focusing on the content within the trailer itself.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;And sorry for the whole &amp;#39;meer&amp;#39; thing, I wrote this drunk at 2am last night. I&amp;#39;m just proud I made it coherent XD&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dge97sz", "score_hidden": false, "stickied": false, "created": 1492497924.0, "created_utc": 1492469124.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdh0eb", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Elohachus", "parent_id": "t3_65topc", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Interesting point. It's clear that language has a very central role in the most fundamental of thought processes. But making you unable to speak English on pain of death would not really prevent you from thinking with it, would it? And to what end was his plan, beyond the eradication? He said he was to replace it with 'a language of nukes'. IS there something behind that, or was it just hyperbole?\n\nAlso you used 'meer' instead of 'mere' 2/3 times in this post. It makes me irrationally angery.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting point. It&amp;#39;s clear that language has a very central role in the most fundamental of thought processes. But making you unable to speak English on pain of death would not really prevent you from thinking with it, would it? And to what end was his plan, beyond the eradication? He said he was to replace it with &amp;#39;a language of nukes&amp;#39;. IS there something behind that, or was it just hyperbole?&lt;/p&gt;\n\n&lt;p&gt;Also you used &amp;#39;meer&amp;#39; instead of &amp;#39;mere&amp;#39; 2/3 times in this post. It makes me irrationally angery.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgdh0eb", "score_hidden": false, "stickied": false, "created": 1492464401.0, "created_utc": 1492435601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65topc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65topc", "likes": null, "replies": "", "user_reports": [], "id": "dge9yo0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fistful_of_Crashes", "parent_id": "t1_dge7dhl", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Well said. Once you realize the shit Skullface went through, its no wonder the man wanted to see the world burn. And he would've gotten away with it too if it weren't for those meddling Diamond Dogs!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well said. Once you realize the shit Skullface went through, its no wonder the man wanted to see the world burn. And he would&amp;#39;ve gotten away with it too if it weren&amp;#39;t for those meddling Diamond Dogs!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dge9yo0", "score_hidden": false, "stickied": false, "created": 1492498904.0, "created_utc": 1492470104.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge7dhl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Paul_Spector", "parent_id": "t3_65topc", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Exactly. It's absurd that people look at me like I'm crazy when I mention Skull Face being my favorite villain of the franchise. His plot would have had the most worldwide impact, compared to any other villain plot in the franchise. That, and all of his dialogue, his tapes, his story, his background, all of it is littered with so much subtext telling you all of this. The more you really digest everything Skull Face believed in, and was motivated by, the more you realized just how catastrophic this man was. Much like Solidus, he's also one of those antagonists who has a pretty fair reasoning for all of this, and isn't so hard to empathize with. Unlike the sociopath, Volgin, and Liquid with his inferiority issues.  Most of all, Skull Face is a forgotten phantom now. Nobody remembers him once he was snuffed out. He got away with it, which in one sense is fascinating, but in another sense you can see it as his claim to fame being tragically ripped away from him. He's forgotten, despite playing a major part in facilitating so many threads that would continue to seam through the rest of the games, such as incapacitating Zero, leading The Patriots AI system to go as screwy as it did, without its true captain behind the wheel, and continuing research on the parasites, that would later on lead to the birth of FOXDIE.\n\nA villain is so much more than their screen time, and Skull Face is a proud example of that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. It&amp;#39;s absurd that people look at me like I&amp;#39;m crazy when I mention Skull Face being my favorite villain of the franchise. His plot would have had the most worldwide impact, compared to any other villain plot in the franchise. That, and all of his dialogue, his tapes, his story, his background, all of it is littered with so much subtext telling you all of this. The more you really digest everything Skull Face believed in, and was motivated by, the more you realized just how catastrophic this man was. Much like Solidus, he&amp;#39;s also one of those antagonists who has a pretty fair reasoning for all of this, and isn&amp;#39;t so hard to empathize with. Unlike the sociopath, Volgin, and Liquid with his inferiority issues.  Most of all, Skull Face is a forgotten phantom now. Nobody remembers him once he was snuffed out. He got away with it, which in one sense is fascinating, but in another sense you can see it as his claim to fame being tragically ripped away from him. He&amp;#39;s forgotten, despite playing a major part in facilitating so many threads that would continue to seam through the rest of the games, such as incapacitating Zero, leading The Patriots AI system to go as screwy as it did, without its true captain behind the wheel, and continuing research on the parasites, that would later on lead to the birth of FOXDIE.&lt;/p&gt;\n\n&lt;p&gt;A villain is so much more than their screen time, and Skull Face is a proud example of that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dge7dhl", "score_hidden": false, "stickied": false, "created": 1492495554.0, "created_utc": 1492466754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65topc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65topc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s4hr", "removal_reason": null, "link_id": "t3_65topc", "likes": null, "replies": "", "user_reports": [], "id": "dgdqm39", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cardboard_Jase", "parent_id": "t1_dgdd1vl", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "LOL I like that video.\n\nBut regarding written communication, I don't think it was mentioned in any of the tapes how writing would affect vocal chord parasites. If it does, it's never explained how the parasites would know. I mean, they're not malevolent, they're not playing a game of \"gotcha!\" with the host by waiting for them to even think about English words/sentences - it's simply the sound that's produced in the vocal chord that causes them to activate or stop being dormant. So either way, it's a huge gaping plot hole.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LOL I like that video.&lt;/p&gt;\n\n&lt;p&gt;But regarding written communication, I don&amp;#39;t think it was mentioned in any of the tapes how writing would affect vocal chord parasites. If it does, it&amp;#39;s never explained how the parasites would know. I mean, they&amp;#39;re not malevolent, they&amp;#39;re not playing a game of &amp;quot;gotcha!&amp;quot; with the host by waiting for them to even think about English words/sentences - it&amp;#39;s simply the sound that&amp;#39;s produced in the vocal chord that causes them to activate or stop being dormant. So either way, it&amp;#39;s a huge gaping plot hole.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgdqm39", "score_hidden": false, "stickied": false, "created": 1492476468.0, "created_utc": 1492447668.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdd1vl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Fistful_of_Crashes", "parent_id": "t1_dgdcrla", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Lmao - https://www.youtube.com/watch?v=YNokUYJlbN4\n\nBut in all seriousness, any form of communication in the specified language activates the parasites. Thats why Quiet didn't write stuff down to communicate with BB or anyone at DD, even when she knew that one guy was harboring parasites.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lmao - &lt;a href=\"https://www.youtube.com/watch?v=YNokUYJlbN4\"&gt;https://www.youtube.com/watch?v=YNokUYJlbN4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;But in all seriousness, any form of communication in the specified language activates the parasites. Thats why Quiet didn&amp;#39;t write stuff down to communicate with BB or anyone at DD, even when she knew that one guy was harboring parasites.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgdd1vl", "score_hidden": false, "stickied": false, "created": 1492456211.0, "created_utc": 1492427411.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcrla", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cardboard_Jase", "parent_id": "t3_65topc", "subreddit_name_prefixed": "r/metalgearsolid", "controversiality": 0, "body": "Nah, we'd all just use Microsoft Sam to communicate with each other. xD ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, we&amp;#39;d all just use Microsoft Sam to communicate with each other. xD &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "metalgearsolid", "name": "t1_dgdcrla", "score_hidden": false, "stickied": false, "created": 1492455385.0, "created_utc": 1492426585.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]