[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Frugal", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 21 years old, just got an apartment with my boyfriend. I bring home roughly $2000 a month, my boyfriend brings home $1600. So a total of $3600 a month! All of our expenses come to $950 total. So $450 each (between the two of us)&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s honestly a cute apartment in the middle of a small town, one bedroom, one bath. It&amp;#39;s tiny! But the location seriously isn&amp;#39;t bad. New kitchen, new bath. It&amp;#39;s $475 a month, I&amp;#39;m thinking it&amp;#39;s cheap because of the location being literally smack dab in the middle of the town. Landlord is my parents landlord now, and the house we have is $500 a month and it&amp;#39;s super nice! It&amp;#39;s a nice town. I could go on, lol. &lt;/p&gt;\n\n&lt;p&gt;Anyways, the only thing I don&amp;#39;t have budgeted is food! We both work right in town, so I&amp;#39;m putting 155 in gas, 70-100 for electric, 80 for water/sewage, 40 for internet, 20 for renters insurance, 475 for rent, ~20 for garbage, I haven&amp;#39;t received the bill for this one yet, my cat 25. I don&amp;#39;t do anything fun, I don&amp;#39;t drink, I don&amp;#39;t smoke. I&amp;#39;m boring honestly. So I want to save every single penny not spent on bills. I&amp;#39;ll save 1150 a month by myself. What my boyfriend spends his half of the rest of his money on is up to him. I&amp;#39;m suggesting he saves it and he says he will! but you just never know lol. He&amp;#39;s paying for the car insurance because it&amp;#39;s his car, I&amp;#39;ll be walking to work!&lt;/p&gt;\n\n&lt;p&gt;Like I said, the only thing I don&amp;#39;t have written down is food. How can I be super cheap with this? Anyone else in a similar situation as I able to tell me what their food budget is? Thank you in advance!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm 21 years old, just got an apartment with my boyfriend. I bring home roughly $2000 a month, my boyfriend brings home $1600. So a total of $3600 a month! All of our expenses come to $950 total. So $450 each (between the two of us)\n\nIt's honestly a cute apartment in the middle of a small town, one bedroom, one bath. It's tiny! But the location seriously isn't bad. New kitchen, new bath. It's $475 a month, I'm thinking it's cheap because of the location being literally smack dab in the middle of the town. Landlord is my parents landlord now, and the house we have is $500 a month and it's super nice! It's a nice town. I could go on, lol. \n\nAnyways, the only thing I don't have budgeted is food! We both work right in town, so I'm putting 155 in gas, 70-100 for electric, 80 for water/sewage, 40 for internet, 20 for renters insurance, 475 for rent, ~20 for garbage, I haven't received the bill for this one yet, my cat 25. I don't do anything fun, I don't drink, I don't smoke. I'm boring honestly. So I want to save every single penny not spent on bills. I'll save 1150 a month by myself. What my boyfriend spends his half of the rest of his money on is up to him. I'm suggesting he saves it and he says he will! but you just never know lol. He's paying for the car insurance because it's his car, I'll be walking to work!\n\nLike I said, the only thing I don't have written down is food. How can I be super cheap with this? Anyone else in a similar situation as I able to tell me what their food budget is? Thank you in advance!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sedj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "Daryyaaann", "saved": false, "mod_reports": [], "name": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "approved_by": null, "over_18": false, "domain": "self.Frugal", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhbe", "edited": 1491933185.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Frugal/comments/64sedj/frugal_redditors_help_me_with_a_food_budget/", "num_reports": null, "locked": false, "stickied": false, "created": 1491961477.0, "url": "https://www.reddit.com/r/Frugal/comments/64sedj/frugal_redditors_help_me_with_a_food_budget/", "author_flair_text": null, "quarantine": false, "title": "Frugal redditors, help me with a food budget!", "created_utc": 1491932677.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg4mdgd", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "AmNotLost", "parent_id": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "10% for food and 1% for alcoholic beverages is a great starting point for a budget.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;10% for food and 1% for alcoholic beverages is a great starting point for a budget.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4mdgd", "score_hidden": false, "stickied": false, "created": 1491961603.0, "created_utc": 1491932803.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg4r428", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Zoso03", "parent_id": "t1_dg4qkoz", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "I was the same way and buying all types of food to cook and eat let alone other things. If you really want to eat even cheaper there are guides. But for people in your or my position we have flexibility to have a little more and I feel I hit that point nicely. I have nice verity and hearty meals and it's cheap enough to not to worry to much about. \n\nDon't be afraid to experiment either and try new things. using the roast chicken, some chicken stock, noodles and frozen veggies i make my own chicken noodle soup. Much better then any canned stuff. The other night I mixed it in with some taco sauce and did chicken tacos and it took me less than 10 minutes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was the same way and buying all types of food to cook and eat let alone other things. If you really want to eat even cheaper there are guides. But for people in your or my position we have flexibility to have a little more and I feel I hit that point nicely. I have nice verity and hearty meals and it&amp;#39;s cheap enough to not to worry to much about. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be afraid to experiment either and try new things. using the roast chicken, some chicken stock, noodles and frozen veggies i make my own chicken noodle soup. Much better then any canned stuff. The other night I mixed it in with some taco sauce and did chicken tacos and it took me less than 10 minutes&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4r428", "score_hidden": false, "stickied": false, "created": 1491966728.0, "created_utc": 1491937928.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg6tph4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Pololocoo", "parent_id": "t1_dg4qkoz", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "Do you have an emergency fund? Start with 1k. Untouchable, except for emergencies. In a separate account.  Then set other savings goals. You'll save more if you have a goal and deadline in mind that you want to beat. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have an emergency fund? Start with 1k. Untouchable, except for emergencies. In a separate account.  Then set other savings goals. You&amp;#39;ll save more if you have a goal and deadline in mind that you want to beat. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg6tph4", "score_hidden": false, "stickied": false, "created": 1492071540.0, "created_utc": 1492042740.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qkoz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Daryyaaann", "parent_id": "t1_dg4p1qn", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "Well, I've worked at this same place for the past year. And while I have a lot of nice clothes jewelry and purses, technology, and a beautiful bedroom set! I have nothing besides material things to show for it. I had no money saved up until two weeks ago. I opened a bank account yesterday. I'm extremely serious about saving now. I've saved every penny I've made so far in these two weeks compared to spending it carelessly and spur of the moment. \n\nYou're right about the soft budget though haha, I'm just trying to save as much as I can, as quickly as I can, so I'm better off in the future while I don't have kids, or an expensive apartment, or a car. So I can have those things in the future :) $50 a week on food is not bad! I've been spoiling myself with food this past year. It'll be a change! But it'll be good to save", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I&amp;#39;ve worked at this same place for the past year. And while I have a lot of nice clothes jewelry and purses, technology, and a beautiful bedroom set! I have nothing besides material things to show for it. I had no money saved up until two weeks ago. I opened a bank account yesterday. I&amp;#39;m extremely serious about saving now. I&amp;#39;ve saved every penny I&amp;#39;ve made so far in these two weeks compared to spending it carelessly and spur of the moment. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right about the soft budget though haha, I&amp;#39;m just trying to save as much as I can, as quickly as I can, so I&amp;#39;m better off in the future while I don&amp;#39;t have kids, or an expensive apartment, or a car. So I can have those things in the future :) $50 a week on food is not bad! I&amp;#39;ve been spoiling myself with food this past year. It&amp;#39;ll be a change! But it&amp;#39;ll be good to save&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4qkoz", "score_hidden": false, "stickied": false, "created": 1491966168.0, "created_utc": 1491937368.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4p1qn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Zoso03", "parent_id": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "some of my previous comments about this :\n\n* 4 pack of boneless skinless chicken breast is $10, ground turkey $5 Whole Roasted Chicken $8. That should be more than what a single person should eat in a week in terms of just meat and that's $23. After a month that's still only half your budget. Now get some rice, beans, potatoes and other basic staples like garlic, onion and spices. Giant bag of frozen veggies is about $10, some fruits and eggs to round out the meals. That is generally what i do. I never budgeted it but estimated off the top of my head.\n\n* Same here, i just tend to look for good deals and average. And this pretty much what i do for myself. I'm a lazy cook and simple eater. I do chilli or a pasta meat sauce with the ground turkey every week. The chicken breast can be cut into cutlets (3 per breast) 2 per meal so that's 6 meals total. Or I cut them up and do curries or saucy food with them. With the roasted chicken, i pull it apart and fry them with other spices, put them in sandwiches or wraps, or even some bbq sauce for \"pulled chicken\". Pork Shoulders are also a very very cheap source of meat. At less than a dollar a pound is some butcher shops, toss it in a slow cooker and let it sit all day long. Snacks is what gets expensive, and the cheapest snacks are the worst for you. If you need sweets get cookie or cake or brownie mix and do it yourself.\n* Also learn local fast food or grocery deals. A local place does $8 roasted chickens every Tuesday and large pizza on Wednesday. Then pizza hut has a different $10 large pizza every day. If we can't cook or need quick food these do in a pinch plus we get left overs. Learning to eat less also helps a lot, my diet saved me quite a bit of money. A food saver is a good investment for keeping meat good in the freezer for along time, but Freezer paper will still work very well.\nIf you like coffee, get a french press don't get a silly coffee maker. For tea get loose leaf.\n\n\nI'm not about to knock having a budget but you are very well off to have a soft budget for food. I eat very well using the above. I do mix it up from time to time when i see good deals on fish or steak. \n\nOff the top of my head. I spend $10 for chicken breast, $8 for a roast chicken, $5 for ground meat. $5 for leafy greens, $5 on veggies. $5-10 on fruits and $5 on juice a week. This takes me to about $50 a week on food. So with a few extras and take/out i spend about $300 max a month on food for myself and my gf. We can probably eat for cheaper but at the same time the extra money won't kill us nor will we tire of eating the same thing all the time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;some of my previous comments about this :&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;4 pack of boneless skinless chicken breast is $10, ground turkey $5 Whole Roasted Chicken $8. That should be more than what a single person should eat in a week in terms of just meat and that&amp;#39;s $23. After a month that&amp;#39;s still only half your budget. Now get some rice, beans, potatoes and other basic staples like garlic, onion and spices. Giant bag of frozen veggies is about $10, some fruits and eggs to round out the meals. That is generally what i do. I never budgeted it but estimated off the top of my head.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Same here, i just tend to look for good deals and average. And this pretty much what i do for myself. I&amp;#39;m a lazy cook and simple eater. I do chilli or a pasta meat sauce with the ground turkey every week. The chicken breast can be cut into cutlets (3 per breast) 2 per meal so that&amp;#39;s 6 meals total. Or I cut them up and do curries or saucy food with them. With the roasted chicken, i pull it apart and fry them with other spices, put them in sandwiches or wraps, or even some bbq sauce for &amp;quot;pulled chicken&amp;quot;. Pork Shoulders are also a very very cheap source of meat. At less than a dollar a pound is some butcher shops, toss it in a slow cooker and let it sit all day long. Snacks is what gets expensive, and the cheapest snacks are the worst for you. If you need sweets get cookie or cake or brownie mix and do it yourself.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Also learn local fast food or grocery deals. A local place does $8 roasted chickens every Tuesday and large pizza on Wednesday. Then pizza hut has a different $10 large pizza every day. If we can&amp;#39;t cook or need quick food these do in a pinch plus we get left overs. Learning to eat less also helps a lot, my diet saved me quite a bit of money. A food saver is a good investment for keeping meat good in the freezer for along time, but Freezer paper will still work very well.\nIf you like coffee, get a french press don&amp;#39;t get a silly coffee maker. For tea get loose leaf.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;m not about to knock having a budget but you are very well off to have a soft budget for food. I eat very well using the above. I do mix it up from time to time when i see good deals on fish or steak. &lt;/p&gt;\n\n&lt;p&gt;Off the top of my head. I spend $10 for chicken breast, $8 for a roast chicken, $5 for ground meat. $5 for leafy greens, $5 on veggies. $5-10 on fruits and $5 on juice a week. This takes me to about $50 a week on food. So with a few extras and take/out i spend about $300 max a month on food for myself and my gf. We can probably eat for cheaper but at the same time the extra money won&amp;#39;t kill us nor will we tire of eating the same thing all the time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4p1qn", "score_hidden": false, "stickied": false, "created": 1491964547.0, "created_utc": 1491935747.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg599in", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JunkyardJesseAK", "parent_id": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "I'm one single guy, and a few days a week I feed my girlfriend or three kids. I get by pretty good on $200/month for groceries. That also usually includes paper/hygiene/etc. products so not just strictly food.\n\nIn general, if you want to be frugal about eating you need to think ahead so you can 1) get the best prices, and 2) avoid waste. \n\nAvoiding waste takes a little planning. I use the freezer a lot. I make things for a big dinner that I know will make good leftovers, or ingredients for a dish the next day. For veggies I mostly buy things that will keep for 2+ weeks like carrots, potatoes, cabbage, etc. It takes a little mental work to stay on top of it. You have to thaw frozen meat in advance, cook it before it spoils, and eat your leftovers before they go bad. But it's worth it. \n\nAs far as getting the best prices...shop the sales. Try not to buy anything full price, and know what a good price is in case you have to, or in case the \"sale\" at one store is still more expensive than the regular price at another. I keep a list in my phone of most things I buy and the good prices, and a lot of them I have at least a vague idea in my head by now.\n\nFor both of those endeavors you need to make a shopping list, preferably with prices. And in order to make a good shopping list you should have a meal plan. I never actually stick to it but I make one anyway. That way I know I can make at least enough meals to get me until next payday, and I know that the food I buy can combine to make actual dishes and I don't end up with \"all this food and nothing to eat.\" \n\nIt's harder when you're first starting out because you have to buy every single little thing, but after a while you'll have your pantry stocked up and can drive the costs down even more and add variety.\n\ntl;dr: plan ahead", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m one single guy, and a few days a week I feed my girlfriend or three kids. I get by pretty good on $200/month for groceries. That also usually includes paper/hygiene/etc. products so not just strictly food.&lt;/p&gt;\n\n&lt;p&gt;In general, if you want to be frugal about eating you need to think ahead so you can 1) get the best prices, and 2) avoid waste. &lt;/p&gt;\n\n&lt;p&gt;Avoiding waste takes a little planning. I use the freezer a lot. I make things for a big dinner that I know will make good leftovers, or ingredients for a dish the next day. For veggies I mostly buy things that will keep for 2+ weeks like carrots, potatoes, cabbage, etc. It takes a little mental work to stay on top of it. You have to thaw frozen meat in advance, cook it before it spoils, and eat your leftovers before they go bad. But it&amp;#39;s worth it. &lt;/p&gt;\n\n&lt;p&gt;As far as getting the best prices...shop the sales. Try not to buy anything full price, and know what a good price is in case you have to, or in case the &amp;quot;sale&amp;quot; at one store is still more expensive than the regular price at another. I keep a list in my phone of most things I buy and the good prices, and a lot of them I have at least a vague idea in my head by now.&lt;/p&gt;\n\n&lt;p&gt;For both of those endeavors you need to make a shopping list, preferably with prices. And in order to make a good shopping list you should have a meal plan. I never actually stick to it but I make one anyway. That way I know I can make at least enough meals to get me until next payday, and I know that the food I buy can combine to make actual dishes and I don&amp;#39;t end up with &amp;quot;all this food and nothing to eat.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s harder when you&amp;#39;re first starting out because you have to buy every single little thing, but after a while you&amp;#39;ll have your pantry stocked up and can drive the costs down even more and add variety.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: plan ahead&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg599in", "score_hidden": false, "stickied": false, "created": 1491989018.0, "created_utc": 1491960218.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg75kff", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mgbk12", "parent_id": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "Rice, beans, lentils, eggs, chicken thighs/legs, pork shoulder, pasta, tomato sauce cans, chick peas, potatoes, onions, bananas are all super cheap and make up the majority of my diet due to that fact! I always buy things that are on sale and if something is a good price, i stock up so I have enough to last 3-6 months depending on how much I use it. I always supplement fresh veggies from a local market but I scour each neighborhood I frequent in order to get the best prices. I never pay for something that I could wait and get it a few dollars cheaper the next day. Bringing your lunch to work and cooking at home save the most money by far!! But learn how to cook using those top foods. Fried rice, lentil soup, potatoes and eggs, omelettes, stew,onion soup. Learn how to make a million things out of onions and your life is set!! Different curry, jerk chicken, french onion soup, caramelized onion grilled cheese. BOSS. Goood luck OP!  Keep reading here as well for tons of amazing tips!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rice, beans, lentils, eggs, chicken thighs/legs, pork shoulder, pasta, tomato sauce cans, chick peas, potatoes, onions, bananas are all super cheap and make up the majority of my diet due to that fact! I always buy things that are on sale and if something is a good price, i stock up so I have enough to last 3-6 months depending on how much I use it. I always supplement fresh veggies from a local market but I scour each neighborhood I frequent in order to get the best prices. I never pay for something that I could wait and get it a few dollars cheaper the next day. Bringing your lunch to work and cooking at home save the most money by far!! But learn how to cook using those top foods. Fried rice, lentil soup, potatoes and eggs, omelettes, stew,onion soup. Learn how to make a million things out of onions and your life is set!! Different curry, jerk chicken, french onion soup, caramelized onion grilled cheese. BOSS. Goood luck OP!  Keep reading here as well for tons of amazing tips!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg75kff", "score_hidden": false, "stickied": false, "created": 1492087193.0, "created_utc": 1492058393.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg5b9ao", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Iamkaiamka", "parent_id": "t1_dg4q302", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "Definitely better to come in under budget, than over. \n\nDo you have a parks pass? Can you eat at work? Years ago when I waited tables, we could order a meal before or after shift, and grabbing crackers or fruit etc was fine too.  If a meal is included, definitely eat it. We could get ours to go, but this was 20 years ago, so YMMV. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely better to come in under budget, than over. &lt;/p&gt;\n\n&lt;p&gt;Do you have a parks pass? Can you eat at work? Years ago when I waited tables, we could order a meal before or after shift, and grabbing crackers or fruit etc was fine too.  If a meal is included, definitely eat it. We could get ours to go, but this was 20 years ago, so YMMV. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg5b9ao", "score_hidden": false, "stickied": false, "created": 1491991644.0, "created_utc": 1491962844.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg4q3kx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ConvertsToMetric", "parent_id": "t1_dg4q302", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "[^(**Mouseover** or **click** to view the metric conversion for this comment)](http://fiddle.jshell.net/ConvertsToMetric/xhk4y5h5/show/light/?110%20lbs%20=%2049.9%20kg%0A \"110 lbs = 49.9 kg\nPost feedback in /r/ToMetric\")", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://fiddle.jshell.net/ConvertsToMetric/xhk4y5h5/show/light/?110%20lbs%20=%2049.9%20kg%0A\" title=\"110 lbs = 49.9 kg\nPost feedback in /r/ToMetric\"&gt;&lt;sup&gt;&lt;strong&gt;Mouseover&lt;/strong&gt; or &lt;strong&gt;click&lt;/strong&gt; to view the metric conversion for this comment&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4q3kx", "score_hidden": false, "stickied": false, "created": 1491965666.0, "created_utc": 1491936866.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4q302", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Daryyaaann", "parent_id": "t1_dg4ppsg", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "I'm a sever, I work 8 hour shifts speed walking six hours of the 8. I'm a tiny petite girl lol 5' 110 lbs. My weight has been the same since I was in 8th grade. Up two pounds down two pounds depending on the day of my cycle. Foods pretty much just energy and calories for me. I do like to eat healthy however, grilled chicken, lots of fruits and veggies. I don't really snack or eat junk honestly. \n\nI'm putting down the 155 just because we like to go to state parks, we go downtown about a 25 minute drive and window shop A LOT lol we're always going to parks and we love being outdoors and doing stuff for free! You're right though, with time I'll probably see how much more or less we're spending on gas and can probably cut that. \n\nEdit: I'm aiming high with the budget for it! Just in case it fluctuates I want to be okay", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a sever, I work 8 hour shifts speed walking six hours of the 8. I&amp;#39;m a tiny petite girl lol 5&amp;#39; 110 lbs. My weight has been the same since I was in 8th grade. Up two pounds down two pounds depending on the day of my cycle. Foods pretty much just energy and calories for me. I do like to eat healthy however, grilled chicken, lots of fruits and veggies. I don&amp;#39;t really snack or eat junk honestly. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m putting down the 155 just because we like to go to state parks, we go downtown about a 25 minute drive and window shop A LOT lol we&amp;#39;re always going to parks and we love being outdoors and doing stuff for free! You&amp;#39;re right though, with time I&amp;#39;ll probably see how much more or less we&amp;#39;re spending on gas and can probably cut that. &lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;m aiming high with the budget for it! Just in case it fluctuates I want to be okay&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4q302", "score_hidden": false, "stickied": false, "created": 1491965648.0, "created_utc": 1491936848.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ppsg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Iamkaiamka", "parent_id": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "Have you thought through any needs or circumstances around food? How active are you aside from walking to work? Preferences? Do you enjoy cooking and food, or is it pretty much just calories and energy for you?\n\nI think it is great to save as much as you can, but even at 21 and likely healthy, you probably don't want to only consider cost.  \n\nAlso, the $155 in gas if you both work in town seems like a place you might be able to cut.  I'm not sure what you're driving vehicle wise, or what gas is a gallon where you are, or if you're factoring in longer trips to visit ppl? \n\nEdited: also curious about your budget for electricity. That seems high for a small apartment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you thought through any needs or circumstances around food? How active are you aside from walking to work? Preferences? Do you enjoy cooking and food, or is it pretty much just calories and energy for you?&lt;/p&gt;\n\n&lt;p&gt;I think it is great to save as much as you can, but even at 21 and likely healthy, you probably don&amp;#39;t want to only consider cost.  &lt;/p&gt;\n\n&lt;p&gt;Also, the $155 in gas if you both work in town seems like a place you might be able to cut.  I&amp;#39;m not sure what you&amp;#39;re driving vehicle wise, or what gas is a gallon where you are, or if you&amp;#39;re factoring in longer trips to visit ppl? &lt;/p&gt;\n\n&lt;p&gt;Edited: also curious about your budget for electricity. That seems high for a small apartment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4ppsg", "score_hidden": false, "stickied": false, "created": 1491965266.0, "created_utc": 1491936466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg5pl71", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "titchard", "parent_id": "t1_dg4r1ui", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "*voila - its French.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;*voila - its French.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg5pl71", "score_hidden": false, "stickied": false, "created": 1492022460.0, "created_utc": 1491993660.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4r1ui", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bhabhijindal", "parent_id": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "Beans and salsa. I cook up about a pound (dry) of beans at a time, and heat up what I want as I go. It's good for a snack or a replacement of a meal. Wa la.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Beans and salsa. I cook up about a pound (dry) of beans at a time, and heat up what I want as I go. It&amp;#39;s good for a snack or a replacement of a meal. Wa la.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4r1ui", "score_hidden": false, "stickied": false, "created": 1491966664.0, "created_utc": 1491937864.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg5v8pm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HiYesThisIsMichael", "parent_id": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "[relevant calorie per dollar list](http://efficiencyiseverything.com/calorie-per-dollar-list/)\n\nThe list is fun, but the article is really useful.\n\nI would aim for 25$/week per person. \n\nWhile I suggest meal planning, start with baby steps. Stop eating out, stop buying canned foods, reduce frozen and boxed foods.\n\nThe more homemade, fresh foods you eat- the more you will save.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://efficiencyiseverything.com/calorie-per-dollar-list/\"&gt;relevant calorie per dollar list&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The list is fun, but the article is really useful.&lt;/p&gt;\n\n&lt;p&gt;I would aim for 25$/week per person. &lt;/p&gt;\n\n&lt;p&gt;While I suggest meal planning, start with baby steps. Stop eating out, stop buying canned foods, reduce frozen and boxed foods.&lt;/p&gt;\n\n&lt;p&gt;The more homemade, fresh foods you eat- the more you will save.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg5v8pm", "score_hidden": false, "stickied": false, "created": 1492033175.0, "created_utc": 1492004375.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhbe", "removal_reason": null, "link_id": "t3_64sedj", "likes": null, "replies": "", "user_reports": [], "id": "dg4p4f9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "franklyfrugal", "parent_id": "t3_64sedj", "subreddit_name_prefixed": "r/Frugal", "controversiality": 0, "body": "The amount you budget for food is going to vary based on where you live and what stores/markets you have access to.  In my area, I would figure $5/day for each person.  If I wanted to eat out, I would budget that under entertainment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The amount you budget for food is going to vary based on where you live and what stores/markets you have access to.  In my area, I would figure $5/day for each person.  If I wanted to eat out, I would budget that under entertainment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Frugal", "name": "t1_dg4p4f9", "score_hidden": false, "stickied": false, "created": 1491964627.0, "created_utc": 1491935827.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]