[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WeAreTheMusicMakers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone. Old geezer here. Average, but versatile musician (bass, guitars, drums). Got started with electronic music with the demoscene, and Fast Tracker 2, without a midi keyboard or even a soundcard for that matter. But I feel like a total N00B @ EDM production today.&lt;/p&gt;\n\n&lt;p&gt;I like Renoise and all, but I feel I&amp;#39;ve moved on from typing my music and inputting codes. Around 15 years ago I fell in love with Sony Acid (Now it&amp;#39;s &amp;quot;MAGIX&amp;quot; Acid) but I feel that its engine is just too old for what I need. And yeah, I was a sample maniac.&lt;/p&gt;\n\n&lt;p&gt;But now... I feel that was also a long time ago and I wanted to play on real keys. Bring back the guitar into the mix, even. So I bought my first MIDI controller keyboard, a Roland A-49.&lt;/p&gt;\n\n&lt;p&gt;The A49 is great for piano, and improv, and all that. But no knobs. No buttons, no faders, no pads. There&amp;#39;s just like, a USELESS D-beam BS thingy and the keyboard, which is good for what it&amp;#39;s meant to be. I feel bamboozled by my own ignorance on the state of modern gear. I regret it, but it&amp;#39;s not that bad. I do like its keys and playability. It just isn&amp;#39;t nearly enough for what I need.&lt;/p&gt;\n\n&lt;p&gt;Now I don&amp;#39;t want go down the path of Mini 25 stuff that I can&amp;#39;t imagine playing with (and I do have tiny hands). But I realize I need a bigger (32? 49?) keybed AND the knobs and pads and faders AND I&amp;#39;d like it to work with something like Acid, or REAPER which is the next best thing from what I&amp;#39;ve tried. Studio One is a a possibility, as are others. But I want to mix samples, guitars, vocals, and what I don&amp;#39;t KNOW is that there is something I can use to control the basics.&lt;/p&gt;\n\n&lt;p&gt;I want to control, at the very least, the plugins. Configure them. Control my DAW. Switch between tracks.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not an Apple dude, not an Ableton live guy (And I used to be a &amp;quot;DJ&amp;quot; at a pretty infamous nightclub in my city around 2003, mixing CDs) and I despise using the mouse for every little thing because I do like to tweak presets. I need to find a MIDI controller or something that might help me overcome these obstacles.&lt;/p&gt;\n\n&lt;p&gt;Any ideas or suggestions are welcome. Please help. My budget will allow around 600 USD for what I need, but I cannot afford to make another &amp;quot;mistake&amp;quot; like the A49.&lt;/p&gt;\n\n&lt;p&gt;TL; DR: I hate using the mouse for everything. I want to control certain things, plugins, channels, tracks, and the DAW through a physical device. Need help finding out what MIDI keyboard or devices would enable me to do that (without tying me to their product, such as Ableton=Novation, NI=Komplete Kontrol or Arturia = Keylab).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello everyone. Old geezer here. Average, but versatile musician (bass, guitars, drums). Got started with electronic music with the demoscene, and Fast Tracker 2, without a midi keyboard or even a soundcard for that matter. But I feel like a total N00B @ EDM production today.\n\nI like Renoise and all, but I feel I've moved on from typing my music and inputting codes. Around 15 years ago I fell in love with Sony Acid (Now it's \"MAGIX\" Acid) but I feel that its engine is just too old for what I need. And yeah, I was a sample maniac.\n\nBut now... I feel that was also a long time ago and I wanted to play on real keys. Bring back the guitar into the mix, even. So I bought my first MIDI controller keyboard, a Roland A-49.\n\nThe A49 is great for piano, and improv, and all that. But no knobs. No buttons, no faders, no pads. There's just like, a USELESS D-beam BS thingy and the keyboard, which is good for what it's meant to be. I feel bamboozled by my own ignorance on the state of modern gear. I regret it, but it's not that bad. I do like its keys and playability. It just isn't nearly enough for what I need.\n\nNow I don't want go down the path of Mini 25 stuff that I can't imagine playing with (and I do have tiny hands). But I realize I need a bigger (32? 49?) keybed AND the knobs and pads and faders AND I'd like it to work with something like Acid, or REAPER which is the next best thing from what I've tried. Studio One is a a possibility, as are others. But I want to mix samples, guitars, vocals, and what I don't KNOW is that there is something I can use to control the basics.\n\nI want to control, at the very least, the plugins. Configure them. Control my DAW. Switch between tracks.\n\nI'm not an Apple dude, not an Ableton live guy (And I used to be a \"DJ\" at a pretty infamous nightclub in my city around 2003, mixing CDs) and I despise using the mouse for every little thing because I do like to tweak presets. I need to find a MIDI controller or something that might help me overcome these obstacles.\n\nAny ideas or suggestions are welcome. Please help. My budget will allow around 600 USD for what I need, but I cannot afford to make another \"mistake\" like the A49.\n\nTL; DR: I hate using the mouse for everything. I want to control certain things, plugins, channels, tracks, and the DAW through a physical device. Need help finding out what MIDI keyboard or devices would enable me to do that (without tying me to their product, such as Ableton=Novation, NI=Komplete Kontrol or Arturia = Keylab).\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "654l6n", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "klxmania", "saved": false, "mod_reports": [], "name": "t3_654l6n", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "approved_by": null, "over_18": false, "domain": "self.WeAreTheMusicMakers", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qmah", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WeAreTheMusicMakers/comments/654l6n/what_would_be_the_best_alternative_midi/", "num_reports": null, "locked": false, "stickied": false, "created": 1492107077.0, "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/654l6n/what_would_be_the_best_alternative_midi/", "author_flair_text": null, "quarantine": false, "title": "What would be the best alternative midi controller/devices for me? From a non-Ableton perspective? Sick and tired of using the mouse to control plugins and my DAW. Budget 600 USD max.", "created_utc": 1492078277.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_654l6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_654l6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7e9j8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "klxmania", "parent_id": "t1_dg7e4k1", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "Thank you! You got it exactly right, maybe I was confusing things. Really helpful comment at this time, since I'm not still completely sold on Reaper yet, it just seems more... intuitive? \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! You got it exactly right, maybe I was confusing things. Really helpful comment at this time, since I&amp;#39;m not still completely sold on Reaper yet, it just seems more... intuitive? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dg7e9j8", "score_hidden": false, "stickied": false, "created": 1492109475.0, "created_utc": 1492080675.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e4k1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "UrinalPooper", "parent_id": "t3_654l6n", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "I think the key is more about the DAW than the MIDI controller, as what you're thinking of as being tied-in is really just 'being preprogrammed to send signals this DAW is waiting for'.  For example, the Nektar Panorama is considered a \"Reason\" MIDI controller but it works just fine in Logic, which is what I use it for.  \n\nSince you're using Reaper you may want to hit up a forum specifically for that to get insight from other Reaper users about what works and what doesn't.  I would *assume* that Reaper works with Automap which would put something like the Novation mkII in your list of possibles but I don't know that for a fact.  I know Reaper is infinitely customizable so I suspect that any controller would work with it but you might have to sit and assign each fader, pad and knob by hand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the key is more about the DAW than the MIDI controller, as what you&amp;#39;re thinking of as being tied-in is really just &amp;#39;being preprogrammed to send signals this DAW is waiting for&amp;#39;.  For example, the Nektar Panorama is considered a &amp;quot;Reason&amp;quot; MIDI controller but it works just fine in Logic, which is what I use it for.  &lt;/p&gt;\n\n&lt;p&gt;Since you&amp;#39;re using Reaper you may want to hit up a forum specifically for that to get insight from other Reaper users about what works and what doesn&amp;#39;t.  I would &lt;em&gt;assume&lt;/em&gt; that Reaper works with Automap which would put something like the Novation mkII in your list of possibles but I don&amp;#39;t know that for a fact.  I know Reaper is infinitely customizable so I suspect that any controller would work with it but you might have to sit and assign each fader, pad and knob by hand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dg7e4k1", "score_hidden": false, "stickied": false, "created": 1492109094.0, "created_utc": 1492080294.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_654l6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7m0oo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "yourantifriend", "parent_id": "t3_654l6n", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "If you're using reaper, check out Klinke's MCU mod for all your controller needs, then decide on which mixer to buy (I use a bcr2k emulating a MCU)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re using reaper, check out Klinke&amp;#39;s MCU mod for all your controller needs, then decide on which mixer to buy (I use a bcr2k emulating a MCU)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dg7m0oo", "score_hidden": false, "stickied": false, "created": 1492122298.0, "created_utc": 1492093498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_654l6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7mpsq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mulgrewup", "parent_id": "t3_654l6n", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "I would definitely look at Nektar specifically because they are pre-mapped/designed to interface with a bunch of DAW's automatically (Ableton, Logic, Cubase). I'm sure there are others, but Nektar does a good job of laying out what you can expect from each of them. I'm picking up the Nektar Impact 61 because of its connectivity w/ Reaper and the fact that it has pads and faders as well as midi-instrument control shortcuts built-in.\n\nhttp://www.nektartech.com/products.html", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would definitely look at Nektar specifically because they are pre-mapped/designed to interface with a bunch of DAW&amp;#39;s automatically (Ableton, Logic, Cubase). I&amp;#39;m sure there are others, but Nektar does a good job of laying out what you can expect from each of them. I&amp;#39;m picking up the Nektar Impact 61 because of its connectivity w/ Reaper and the fact that it has pads and faders as well as midi-instrument control shortcuts built-in.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.nektartech.com/products.html\"&gt;http://www.nektartech.com/products.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dg7mpsq", "score_hidden": false, "stickied": false, "created": 1492123118.0, "created_utc": 1492094318.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_654l6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_654l6n", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_654l6n", "likes": null, "replies": "", "user_reports": [], "id": "dg8j1o3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "camcraka911", "parent_id": "t1_dg8ee0m", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "The bcf2000 is the only one I mentioned that I haven't actually used but from what I've read for a budget option it's a really effective deal. One thing that I'm not sure will bother you but it pissed me off is the scribble strips. The bcf2000 doesn't have the strips which for plugins can be kind of annoying because you have to look up at the screen and tweak until you see something moving (if you use complex plugins this can take awhile because they might have hundreds of functions that you have to scroll through).  If you have scribble strips you know what fader and knob is effecting what because it's labelled. That was a deal breaker for the tascam 1884 for me and so I bought an mcu but that's personal preference. You also have things like the korg nanokontrol studio that's good for mixing on a budget. Or the Samson conspiracy midi controller if you want drum pads. Maschine and push are cool but they are more geared for a different workflow so with them I would recommend watching some vids and reviews before deciding on those, but they have drum pads too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The bcf2000 is the only one I mentioned that I haven&amp;#39;t actually used but from what I&amp;#39;ve read for a budget option it&amp;#39;s a really effective deal. One thing that I&amp;#39;m not sure will bother you but it pissed me off is the scribble strips. The bcf2000 doesn&amp;#39;t have the strips which for plugins can be kind of annoying because you have to look up at the screen and tweak until you see something moving (if you use complex plugins this can take awhile because they might have hundreds of functions that you have to scroll through).  If you have scribble strips you know what fader and knob is effecting what because it&amp;#39;s labelled. That was a deal breaker for the tascam 1884 for me and so I bought an mcu but that&amp;#39;s personal preference. You also have things like the korg nanokontrol studio that&amp;#39;s good for mixing on a budget. Or the Samson conspiracy midi controller if you want drum pads. Maschine and push are cool but they are more geared for a different workflow so with them I would recommend watching some vids and reviews before deciding on those, but they have drum pads too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dg8j1o3", "score_hidden": false, "stickied": false, "created": 1492160671.0, "created_utc": 1492131871.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ee0m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "klxmania", "parent_id": "t1_dg7q1xc", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "Thank you, really appreciate your point of view. I think this might be actually a better road for me. \n\nI'm a beginner at that, though. I've looked at the Mackie MCU and the X-Touch which seem great, but too expensive for me at this point. Would the Behringer bcf2000 be a good buy? Any alternatives?\n\nThe NI Maschine and Ableton Push would be useful (haven't looked into them) if they helped me with drum programming. I don't like to do drums on a keyboard, I was a drummer once. So I need pads.\n\nThanks a lot, this cleared up my priorities. If you have more examples or ideas, feel free to PM me.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, really appreciate your point of view. I think this might be actually a better road for me. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a beginner at that, though. I&amp;#39;ve looked at the Mackie MCU and the X-Touch which seem great, but too expensive for me at this point. Would the Behringer bcf2000 be a good buy? Any alternatives?&lt;/p&gt;\n\n&lt;p&gt;The NI Maschine and Ableton Push would be useful (haven&amp;#39;t looked into them) if they helped me with drum programming. I don&amp;#39;t like to do drums on a keyboard, I was a drummer once. So I need pads.&lt;/p&gt;\n\n&lt;p&gt;Thanks a lot, this cleared up my priorities. If you have more examples or ideas, feel free to PM me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dg8ee0m", "score_hidden": false, "stickied": false, "created": 1492154346.0, "created_utc": 1492125546.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7q1xc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "camcraka911", "parent_id": "t3_654l6n", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "The better question is what type of workflow do you want exactly? Do you want to add a mixer/control surface one like the mackie mcu? That way you could have separate pieces of gear for separate functions. The surfaces would be plug and play with basically everything. The mcu would give you scribble strips so when you're messing with plugins you don't have to look up at the screen. Only thing is they will be on the upper end of your budget even used. You also have surfaces like the Behringer x-touch that's same thing just less expensive and expandable. Also if you need an interface/control surface you could go a little older and get the tascam fw-1884 but that might have compatibility issues for the audio interface on newer computers (the midi control surface will work the same though). On the lower end of this you have stuff like the Behringer bcf2000 if you're going pretty budget. These controllers should integrate into your existing workflow. Also you do have the option of changing your workflow with something like NI maschine and the ableton push. The run plugins and all types of other functions but will do it with a different flow than a typical just mixer surface. If you're looking for specifically a keyboard with all of the faders and knobs and all I'm not the best help (sorry if this comment is pointless) but I just wanted to remind you not to rule control surfaces out. They can be quite a game changer (if you like that type of workflow).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The better question is what type of workflow do you want exactly? Do you want to add a mixer/control surface one like the mackie mcu? That way you could have separate pieces of gear for separate functions. The surfaces would be plug and play with basically everything. The mcu would give you scribble strips so when you&amp;#39;re messing with plugins you don&amp;#39;t have to look up at the screen. Only thing is they will be on the upper end of your budget even used. You also have surfaces like the Behringer x-touch that&amp;#39;s same thing just less expensive and expandable. Also if you need an interface/control surface you could go a little older and get the tascam fw-1884 but that might have compatibility issues for the audio interface on newer computers (the midi control surface will work the same though). On the lower end of this you have stuff like the Behringer bcf2000 if you&amp;#39;re going pretty budget. These controllers should integrate into your existing workflow. Also you do have the option of changing your workflow with something like NI maschine and the ableton push. The run plugins and all types of other functions but will do it with a different flow than a typical just mixer surface. If you&amp;#39;re looking for specifically a keyboard with all of the faders and knobs and all I&amp;#39;m not the best help (sorry if this comment is pointless) but I just wanted to remind you not to rule control surfaces out. They can be quite a game changer (if you like that type of workflow).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dg7q1xc", "score_hidden": false, "stickied": false, "created": 1492126791.0, "created_utc": 1492097991.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_654l6n", "likes": null, "replies": "", "user_reports": [], "id": "dg7r1zr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Octo-puss", "parent_id": "t3_654l6n", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "You gotta use keyboard shortcuts, it's how pro tools, ableton and logic are meant to be used. All the controllers kind of suck in my opinion", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You gotta use keyboard shortcuts, it&amp;#39;s how pro tools, ableton and logic are meant to be used. All the controllers kind of suck in my opinion&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dg7r1zr", "score_hidden": false, "stickied": false, "created": 1492127854.0, "created_utc": 1492099054.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]