[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "WeAreTheMusicMakers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If this is the wrong forum for this, let me know. Still reeling from a rough gig this evening and wanted to vent a bit before trying to sleep to some people who may have experienced similar.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr: we&amp;#39;re absolutely locked as a group, everyone in the band seemingly having the best musical night of our lives with the biggest and most engaged crowd we&amp;#39;ve ever gotten. After about half a show, technical difficulties at all the wrong times send us tumbling down into musical depression.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;some background --&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in a college rock band. We&amp;#39;re all seniors or have graduated by now, playing together for the last four years. Last spring, we released our first album, and we&amp;#39;ve accumulated a pretty solid following for our shows. We&amp;#39;re one of the only really popular bands at my mid-size university (~8k students), so we play a ton of shows. 99% of them are house parties in communities similar to Greek houses, but not frats/sororities. Many, far too many of those shows have been under awful conditions. If you&amp;#39;ve ever played a college house party, you can probably relate. Like clockwork, the houses that ask us to play, even after we tell them what we need (a modest list: a mixer, speakers, and some powerstrips; we&amp;#39;ve got everything else), never seem to listen or care enough to get the equipment. Because we have pretty strange, student schedules, haphazard soundchecks are about as good as we can normally do, and it&amp;#39;s a luxury even to get a monitor sometimes. But of course, it&amp;#39;s pretty much always worth it -- y&amp;#39;all must understand better than anyone why we go through so much shit to play gigs, even when sometimes we don&amp;#39;t get paid. It&amp;#39;s incredible to really move a house full of people.&lt;/p&gt;\n\n&lt;p&gt;setup for today--&lt;/p&gt;\n\n&lt;p&gt;Anyway, to today: Load in at 7:15 for a soundcheck 15 minutes later, we start at 10:30. I get a call at 7:10 from our drummer asking me to pick him up. He&amp;#39;s stuck on the other side of campus (maybe a mile a half away) and someone stole his skateboard so he&amp;#39;s got no way to get back quick. Fine. Get there at 7:20 with our cars full of equipment, start setting up our amps and the drumkit. The party&amp;#39;s coordinator comes up and introduces himself and tells us how excited he is. We&amp;#39;ve played at the house loads of times but I&amp;#39;ve never seen him--he tells us it&amp;#39;s the first party he&amp;#39;s planned. We ask where the speakers and mixer are, and he, &amp;quot;huh?&amp;quot; It was almost expected. We&amp;#39;ve gotta do all our own sound. Fine. So I start making calls to some of the other houses on campus that I know are better equipped to hunt down the gear we need. We know a lot of musicians and can always borrow if they aren&amp;#39;t using their stuff at that exact moment. &lt;/p&gt;\n\n&lt;p&gt;So at about 8:10, we&amp;#39;ve finally got all that we need. The house that we&amp;#39;re playing in is a very strange shape. The main floor where we&amp;#39;re playing is basically one large room, semi-divided into three rooms with walls that cut in a few feet and a ceiling that comes down at the divisions. As though you wanted to make three different rooms, but stopped building the walls and doors and whatnot. So we play in the corner of one of the subdivisions, facing the other two, with all our amps and drumkit and speakers near us, and then extra speakers out in the other &amp;quot;rooms,&amp;quot; behind the walls. The problem, of course, is that this house was built decades ago and not very well wired so there&amp;#39;s almost no space to plug stuff in. He have to plug in speakers with wires running into basically different rooms. Not happy about the outcome. Didn&amp;#39;t have any duct tape either. Was assuming the party would be pretty moderately sized, so worst case scenario I just run out and plug stuff back in. If this sounds like poor planning, well, in retrospect it was. 8:30 we can begin soundcheck. The opening band is very nervous about their sound check at this point, because they were supposed to go on around 9ish. &lt;/p&gt;\n\n&lt;p&gt;I was excited. Given the weird situation, we sounded great in every room. Soundcheck was reassuring. We then left to go grab a bite before we had to play. We got back, and the opener really wants to keep playing. It&amp;#39;s fine by us because we are allowed to go as late as we want, so 10:30 comes and goes and all our friends and fans show up and we&amp;#39;ve got a really decent crowd. People are already yelling for us and the opener is having a great time bantering with them. He finishes about 11pm and people were stoked for us to start. We hadn&amp;#39;t played for about a month and a lot of people are particularly hyped because this is one of the first really big parties of this academic quarter, so it was pretty rowdy. &lt;/p&gt;\n\n&lt;p&gt;the show--&lt;/p&gt;\n\n&lt;p&gt;If I could express to you in words those first thirty minutes -- it was the peak, the best we&amp;#39;d ever played together. I don&amp;#39;t know how to explain it. Not only was member of our group really on, absolutely locked in and laying down fills and solos as if from a greatest hits of our entire careers, but we were vibing with one another in a way that had never happened before. Like we knew musically every next improvised note and were already playing with it. Hope that makes some sense. The crowd was wild, and we loved it. What I thought was a decent sized crowd turned out to be by far the biggest we&amp;#39;d ever had. Every inch of the building was occupied. People were on top of one another. The line to get in went down the street a couple blocks. They weren&amp;#39;t all there for us, definitely not, it&amp;#39;s just a well-advertised party. But they loved us. The energy was incredible. Everything felt electric. They were responding to everything we did, and we feed off them and each other, having the time of our lives. &lt;/p&gt;\n\n&lt;p&gt;Then, about 5 songs into the 12 song set, things start to go wrong. The sound changes -- I could hear one of the speakers in the other room turn off, and then the same thing happened to our monitor. That&amp;#39;s okay, we power through the song slightly quiet but all is well. I ask a friend to investigate while the singer entertains everyone. Easy fix, they just got unplugged accidentally. Fine. We start the next song, which is about 8 minutes long, and the last 3.5 minutes are essentially a really long crescendo. Just as it&amp;#39;s gaining energy, as we&amp;#39;re getting the audience to sing with us, every single speaker shuts off at once. I (on the bass) try my hardest to keep building momentum while our singer/guitarist scrambles to find and fix the problem. No luck. After a couple minutes, we end the song, apologize, announce technical difficulties and try to find the problems. Meanwhile more people are trying to shove themselves as close to us as they can. There&amp;#39;s no stage, just a corner of a room. I&amp;#39;ve got to fend people away from our equipment with one hand and try to fiddle with the mixer with the other. Then, all the sudden, feedback like you wouldn&amp;#39;t believe. I don&amp;#39;t think I did anything, but all the speakers turned back on at once.&lt;/p&gt;\n\n&lt;p&gt;The show, as they say, must go on. We pick back up, finish the song, and launch into the next one. Tension&amp;#39;s pretty high on the stage because none of us really knew what happened. We were at the mercy of fate, and that anxiety manifested itself. The early energy crashed on top of us and we could not get back in the groove with one another, and then, you guessed it, all the goddamned speakers went out again. This time, I had a hunch--I shoved my way through the throng to find that they were all getting kicked out of their outlets by the general drunk audience and plugged back in whenever people noticed it. I do the only thing I can think of on the fly and consolidate -- inner room speakers only, everything plugged into one power strip behind the drummer. Not enough power, so pedal boards had to come unplugged, but Christ, at least we had vocals. I couldn&amp;#39;t get the knots out of my stomach for the rest of the set. We managed to proceed from there without any more technical difficulties, but it was like someone put us in a dense musical fog. We were making mistakes we hadn&amp;#39;t made in years, accidentally skipping bridges / forgetting progressions / losing time with one another. It was crushing. The crowd rallied, in a sense, but we never had them fully back, and we couldn&amp;#39;t click together again musically.   &lt;/p&gt;\n\n&lt;p&gt;But we finished the set at least with no more technical difficulties. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re all about to graduate. This is one of the last shows we&amp;#39;ll ever play together, and hell does it suck to fall so hard when you know that your tries are limited. &lt;/p&gt;\n\n&lt;p&gt;I always get a bit wordier than expected when writing stories. I appreciate you reading, though. I don&amp;#39;t have any sensible concluding statements, honestly. Just felt compelled to share, looking for some kind of understanding. Anyway, hope y&amp;#39;all are playing smoother gigs than we, with real sound technicians and paychecks and all that jazz. Good luck out there, fellow music makers. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit: Thanks for the kind words, dudes. I appreciate getting some perspective, and it&amp;#39;s nice to share. I&amp;#39;ll look in to getting our own sound system, but this band is entering it&amp;#39;s last month and we&amp;#39;re all trying to save up for life after college I think. But again, thanks.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "If this is the wrong forum for this, let me know. Still reeling from a rough gig this evening and wanted to vent a bit before trying to sleep to some people who may have experienced similar.\n\n**tl;dr: we're absolutely locked as a group, everyone in the band seemingly having the best musical night of our lives with the biggest and most engaged crowd we've ever gotten. After about half a show, technical difficulties at all the wrong times send us tumbling down into musical depression.**\n\nsome background --\n\nI'm in a college rock band. We're all seniors or have graduated by now, playing together for the last four years. Last spring, we released our first album, and we've accumulated a pretty solid following for our shows. We're one of the only really popular bands at my mid-size university (~8k students), so we play a ton of shows. 99% of them are house parties in communities similar to Greek houses, but not frats/sororities. Many, far too many of those shows have been under awful conditions. If you've ever played a college house party, you can probably relate. Like clockwork, the houses that ask us to play, even after we tell them what we need (a modest list: a mixer, speakers, and some powerstrips; we've got everything else), never seem to listen or care enough to get the equipment. Because we have pretty strange, student schedules, haphazard soundchecks are about as good as we can normally do, and it's a luxury even to get a monitor sometimes. But of course, it's pretty much always worth it -- y'all must understand better than anyone why we go through so much shit to play gigs, even when sometimes we don't get paid. It's incredible to really move a house full of people.\n\nsetup for today--\n\nAnyway, to today: Load in at 7:15 for a soundcheck 15 minutes later, we start at 10:30. I get a call at 7:10 from our drummer asking me to pick him up. He's stuck on the other side of campus (maybe a mile a half away) and someone stole his skateboard so he's got no way to get back quick. Fine. Get there at 7:20 with our cars full of equipment, start setting up our amps and the drumkit. The party's coordinator comes up and introduces himself and tells us how excited he is. We've played at the house loads of times but I've never seen him--he tells us it's the first party he's planned. We ask where the speakers and mixer are, and he, \"huh?\" It was almost expected. We've gotta do all our own sound. Fine. So I start making calls to some of the other houses on campus that I know are better equipped to hunt down the gear we need. We know a lot of musicians and can always borrow if they aren't using their stuff at that exact moment. \n\nSo at about 8:10, we've finally got all that we need. The house that we're playing in is a very strange shape. The main floor where we're playing is basically one large room, semi-divided into three rooms with walls that cut in a few feet and a ceiling that comes down at the divisions. As though you wanted to make three different rooms, but stopped building the walls and doors and whatnot. So we play in the corner of one of the subdivisions, facing the other two, with all our amps and drumkit and speakers near us, and then extra speakers out in the other \"rooms,\" behind the walls. The problem, of course, is that this house was built decades ago and not very well wired so there's almost no space to plug stuff in. He have to plug in speakers with wires running into basically different rooms. Not happy about the outcome. Didn't have any duct tape either. Was assuming the party would be pretty moderately sized, so worst case scenario I just run out and plug stuff back in. If this sounds like poor planning, well, in retrospect it was. 8:30 we can begin soundcheck. The opening band is very nervous about their sound check at this point, because they were supposed to go on around 9ish. \n\nI was excited. Given the weird situation, we sounded great in every room. Soundcheck was reassuring. We then left to go grab a bite before we had to play. We got back, and the opener really wants to keep playing. It's fine by us because we are allowed to go as late as we want, so 10:30 comes and goes and all our friends and fans show up and we've got a really decent crowd. People are already yelling for us and the opener is having a great time bantering with them. He finishes about 11pm and people were stoked for us to start. We hadn't played for about a month and a lot of people are particularly hyped because this is one of the first really big parties of this academic quarter, so it was pretty rowdy. \n\nthe show--\n\nIf I could express to you in words those first thirty minutes -- it was the peak, the best we'd ever played together. I don't know how to explain it. Not only was member of our group really on, absolutely locked in and laying down fills and solos as if from a greatest hits of our entire careers, but we were vibing with one another in a way that had never happened before. Like we knew musically every next improvised note and were already playing with it. Hope that makes some sense. The crowd was wild, and we loved it. What I thought was a decent sized crowd turned out to be by far the biggest we'd ever had. Every inch of the building was occupied. People were on top of one another. The line to get in went down the street a couple blocks. They weren't all there for us, definitely not, it's just a well-advertised party. But they loved us. The energy was incredible. Everything felt electric. They were responding to everything we did, and we feed off them and each other, having the time of our lives. \n\nThen, about 5 songs into the 12 song set, things start to go wrong. The sound changes -- I could hear one of the speakers in the other room turn off, and then the same thing happened to our monitor. That's okay, we power through the song slightly quiet but all is well. I ask a friend to investigate while the singer entertains everyone. Easy fix, they just got unplugged accidentally. Fine. We start the next song, which is about 8 minutes long, and the last 3.5 minutes are essentially a really long crescendo. Just as it's gaining energy, as we're getting the audience to sing with us, every single speaker shuts off at once. I (on the bass) try my hardest to keep building momentum while our singer/guitarist scrambles to find and fix the problem. No luck. After a couple minutes, we end the song, apologize, announce technical difficulties and try to find the problems. Meanwhile more people are trying to shove themselves as close to us as they can. There's no stage, just a corner of a room. I've got to fend people away from our equipment with one hand and try to fiddle with the mixer with the other. Then, all the sudden, feedback like you wouldn't believe. I don't think I did anything, but all the speakers turned back on at once.\n\nThe show, as they say, must go on. We pick back up, finish the song, and launch into the next one. Tension's pretty high on the stage because none of us really knew what happened. We were at the mercy of fate, and that anxiety manifested itself. The early energy crashed on top of us and we could not get back in the groove with one another, and then, you guessed it, all the goddamned speakers went out again. This time, I had a hunch--I shoved my way through the throng to find that they were all getting kicked out of their outlets by the general drunk audience and plugged back in whenever people noticed it. I do the only thing I can think of on the fly and consolidate -- inner room speakers only, everything plugged into one power strip behind the drummer. Not enough power, so pedal boards had to come unplugged, but Christ, at least we had vocals. I couldn't get the knots out of my stomach for the rest of the set. We managed to proceed from there without any more technical difficulties, but it was like someone put us in a dense musical fog. We were making mistakes we hadn't made in years, accidentally skipping bridges / forgetting progressions / losing time with one another. It was crushing. The crowd rallied, in a sense, but we never had them fully back, and we couldn't click together again musically.   \n\nBut we finished the set at least with no more technical difficulties. \n\n\nWe're all about to graduate. This is one of the last shows we'll ever play together, and hell does it suck to fall so hard when you know that your tries are limited. \n\n\nI always get a bit wordier than expected when writing stories. I appreciate you reading, though. I don't have any sensible concluding statements, honestly. Just felt compelled to share, looking for some kind of understanding. Anyway, hope y'all are playing smoother gigs than we, with real sound technicians and paychecks and all that jazz. Good luck out there, fellow music makers. \n\n**Edit: Thanks for the kind words, dudes. I appreciate getting some perspective, and it's nice to share. I'll look in to getting our own sound system, but this band is entering it's last month and we're all trying to save up for life after college I think. But again, thanks.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65iccy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "Bekcles", "saved": false, "mod_reports": [], "name": "t3_65iccy", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "approved_by": null, "over_18": false, "domain": "self.WeAreTheMusicMakers", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qmah", "edited": 1492288352.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/WeAreTheMusicMakers/comments/65iccy/venting_about_a_gig/", "num_reports": null, "locked": false, "stickied": false, "created": 1492278599.0, "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/65iccy/venting_about_a_gig/", "author_flair_text": null, "quarantine": false, "title": "Venting about a gig", "created_utc": 1492249799.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_65iccy", "likes": null, "replies": "", "user_reports": [], "id": "dgajcmj", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "willynickel", "parent_id": "t3_65iccy", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "You're pissed off now but truth be told you admit there was a real chemistry before the problems started. Thats what you have to focus on. \n\nPerhaps as a band invest in your own PA system and keep it close. You could also become the band that puts up \"Police\" tape to protect the performance area ;-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re pissed off now but truth be told you admit there was a real chemistry before the problems started. Thats what you have to focus on. &lt;/p&gt;\n\n&lt;p&gt;Perhaps as a band invest in your own PA system and keep it close. You could also become the band that puts up &amp;quot;Police&amp;quot; tape to protect the performance area ;-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dgajcmj", "score_hidden": false, "stickied": false, "created": 1492282824.0, "created_utc": 1492254024.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_65iccy", "likes": null, "replies": "", "user_reports": [], "id": "dgav3jw", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SixStringGun", "parent_id": "t3_65iccy", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "Sorry to hear that.\n\nBut, as you go forward, there will be more shows.  There will be really good things that happen and some not-so-good things.  Keep in mind that you've been through a bad one, and remember that you kept your composure and got through it.  In the next band, you may be the seasoned vet that holds it all together and you can share your story of \"one time I played a show where everything went wrong...\"\n\nIt's okay to be pissed off.  Don't let it sour you though.  As others have said, get some equipment.  You can learn from this and take steps to keep it from happening again.  Next time, it'll be something different!  Hang in there!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to hear that.&lt;/p&gt;\n\n&lt;p&gt;But, as you go forward, there will be more shows.  There will be really good things that happen and some not-so-good things.  Keep in mind that you&amp;#39;ve been through a bad one, and remember that you kept your composure and got through it.  In the next band, you may be the seasoned vet that holds it all together and you can share your story of &amp;quot;one time I played a show where everything went wrong...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s okay to be pissed off.  Don&amp;#39;t let it sour you though.  As others have said, get some equipment.  You can learn from this and take steps to keep it from happening again.  Next time, it&amp;#39;ll be something different!  Hang in there!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dgav3jw", "score_hidden": false, "stickied": false, "created": 1492303913.0, "created_utc": 1492275113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_65iccy", "likes": null, "replies": "", "user_reports": [], "id": "dgb2ioi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tomjarvis", "parent_id": "t3_65iccy", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "In a few weeks you'll realise how \"rock and roll\" it was for you guys to push on. Well done! You did great for a terrible situation. Fuck the organiser for not organising the sound.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In a few weeks you&amp;#39;ll realise how &amp;quot;rock and roll&amp;quot; it was for you guys to push on. Well done! You did great for a terrible situation. Fuck the organiser for not organising the sound.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dgb2ioi", "score_hidden": false, "stickied": false, "created": 1492313952.0, "created_utc": 1492285152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmah", "removal_reason": null, "link_id": "t3_65iccy", "likes": null, "replies": "", "user_reports": [], "id": "dgau4ju", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rampant", "parent_id": "t3_65iccy", "subreddit_name_prefixed": "r/WeAreTheMusicMakers", "controversiality": 0, "body": "Technical issue shitting all over a gig is the absolute worst and it definitely kills the vibe pretty damn hard. We have a weird dynamic with our band where we're playing the actual paying sets in our area usually reserved for the vast array of country bands here. For some reason people really dig us, but we're tremendously louder than these country acts, and we're endlessly struggling with taming that volume for these poor venues. \n\nLast night we played some richo private party on a really nice pavilion. But weren't told the specifics so we brought our full set. We had to play our heavy set with clean guitars and glare at the dude who kept asking us to turn down, even with people in the front jamming out with us. \n\nWe made the most of it though. Even though our bassist was basically playing with one hand and adjusting the board with the other. Our drummer was doing Rage Against The Machine with brushes. Me and the guitarist never missed a chance to laugh at each other when a big lead part came up and we have to play it squeaky clean. You can't really help those issues. We just truck on. \n\nDefinitely blows this is one of your last gigs out the door. But at least you had that first 30 minutes. Nothing beats that. Just reading about it sounds awesome. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Technical issue shitting all over a gig is the absolute worst and it definitely kills the vibe pretty damn hard. We have a weird dynamic with our band where we&amp;#39;re playing the actual paying sets in our area usually reserved for the vast array of country bands here. For some reason people really dig us, but we&amp;#39;re tremendously louder than these country acts, and we&amp;#39;re endlessly struggling with taming that volume for these poor venues. &lt;/p&gt;\n\n&lt;p&gt;Last night we played some richo private party on a really nice pavilion. But weren&amp;#39;t told the specifics so we brought our full set. We had to play our heavy set with clean guitars and glare at the dude who kept asking us to turn down, even with people in the front jamming out with us. &lt;/p&gt;\n\n&lt;p&gt;We made the most of it though. Even though our bassist was basically playing with one hand and adjusting the board with the other. Our drummer was doing Rage Against The Machine with brushes. Me and the guitarist never missed a chance to laugh at each other when a big lead part came up and we have to play it squeaky clean. You can&amp;#39;t really help those issues. We just truck on. &lt;/p&gt;\n\n&lt;p&gt;Definitely blows this is one of your last gigs out the door. But at least you had that first 30 minutes. Nothing beats that. Just reading about it sounds awesome. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "WeAreTheMusicMakers", "name": "t1_dgau4ju", "score_hidden": false, "stickied": false, "created": 1492302530.0, "created_utc": 1492273730.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]