[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "SkincareAddiction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never posted before, on just about any sub because I&amp;#39;m a lurker through and through, but today I felt I just had to. Also throwaway, and fair warning this might be gross to some of you, idk. Mods if I&amp;#39;ve messed something up please let me know or just take this down, hopefully I did this right but I&amp;#39;m on mobile.&lt;/p&gt;\n\n&lt;p&gt;Moving on. Thanks to this sub my skin has cleared up wonderfully (olive toned combination but mostly dry) so I haven&amp;#39;t been wearing my usual heavy foundation for a few weeks, and it&amp;#39;s been great! I really love this sub, and for someone who never paid much attention to her skin before, I now actually know what it&amp;#39;s habits are and how to properly care for it. Seriously, thank you. I love makeup, but I&amp;#39;m also lazy, so being able to feel confident enough in my skin to not have to deal with full face makeup every day feels like I&amp;#39;ve hit the jackpot. Anywho, I learned today it&amp;#39;s not all rosy in skincare land...&lt;/p&gt;\n\n&lt;p&gt;So, I&amp;#39;ve always had cystic acne, I assume it&amp;#39;s hormonal, and I&amp;#39;ve had one particular bump on the right side of my face just on the edge of my jaw not far from my ear. It&amp;#39;s annoying, but it was mostly just a bump so was easy to hide with my hair. I try my best not to touch it to avoid irritation, and I&amp;#39;ve mostly just been patiently waiting for it to run its course. Well, I got on my train early, and was bored, so pulled out my mirror to fix my lipstick. It was then that I noticed my long-time friend the bump was more raised than usual, like it finally woke up and decided to be annoying, and it was a bit darker as well. Thinking maybe I accidentally got a smudge of something on my face, I gently rubbed my finger over it (seriously, so gently). DEAR GOD THAT WAS A MISTAKE.&lt;/p&gt;\n\n&lt;p&gt;My old pal the bump EXPLODED with more pus than I have ever seen come out of anywhere on my body, let alone my face. I was astounded, this thing hasn&amp;#39;t even been painful, it was barely noticeable, how in the heck did it get so bad? When?! I panicked for a quick second, then grabbed a makeup remover wipes out of my bag (I literally just bought the pack before boarding so I wouldn&amp;#39;t have to stop later, I&amp;#39;m so glad I did!) And tried to clean myself up as quickly and quietly as possible. I should note that while this was all happening, I had my headphones in and Tchaikovsky&amp;#39;s 1812 Overture was blasting. Of course I was at the end with the cannons and everything blasting off, just like my face. &lt;/p&gt;\n\n&lt;p&gt;So now I&amp;#39;m sitting here, on the train to work with a hole in the side of my face that doesn&amp;#39;t seem to want to stop bleeding, with no makeup or Band-Aids or anything to cover it up with, trying to clandestinely blot it with a wipe occasionally without the chap across from me noticing how much of a disgusting hot mess I am. I&amp;#39;m still a bit in disbelief, I&amp;#39;ve never experienced something like this before, and just my luck it&amp;#39;s while I&amp;#39;m out of the house the whole day. So I guess I&amp;#39;m keeping my hair down today, and lesson learned, I&amp;#39;ll just never touch anything weird on my face again apparently.&lt;/p&gt;\n\n&lt;p&gt;Anywho, I felt like I just had to vent and my husband&amp;#39;s probably still asleep/wouldn&amp;#39;t be amused, so hopefully you guys can join me in laughing at myself​. &lt;/p&gt;\n\n&lt;p&gt;Happy Saturday everyone!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've never posted before, on just about any sub because I'm a lurker through and through, but today I felt I just had to. Also throwaway, and fair warning this might be gross to some of you, idk. Mods if I've messed something up please let me know or just take this down, hopefully I did this right but I'm on mobile.\n\nMoving on. Thanks to this sub my skin has cleared up wonderfully (olive toned combination but mostly dry) so I haven't been wearing my usual heavy foundation for a few weeks, and it's been great! I really love this sub, and for someone who never paid much attention to her skin before, I now actually know what it's habits are and how to properly care for it. Seriously, thank you. I love makeup, but I'm also lazy, so being able to feel confident enough in my skin to not have to deal with full face makeup every day feels like I've hit the jackpot. Anywho, I learned today it's not all rosy in skincare land...\n\nSo, I've always had cystic acne, I assume it's hormonal, and I've had one particular bump on the right side of my face just on the edge of my jaw not far from my ear. It's annoying, but it was mostly just a bump so was easy to hide with my hair. I try my best not to touch it to avoid irritation, and I've mostly just been patiently waiting for it to run its course. Well, I got on my train early, and was bored, so pulled out my mirror to fix my lipstick. It was then that I noticed my long-time friend the bump was more raised than usual, like it finally woke up and decided to be annoying, and it was a bit darker as well. Thinking maybe I accidentally got a smudge of something on my face, I gently rubbed my finger over it (seriously, so gently). DEAR GOD THAT WAS A MISTAKE.\n\nMy old pal the bump EXPLODED with more pus than I have ever seen come out of anywhere on my body, let alone my face. I was astounded, this thing hasn't even been painful, it was barely noticeable, how in the heck did it get so bad? When?! I panicked for a quick second, then grabbed a makeup remover wipes out of my bag (I literally just bought the pack before boarding so I wouldn't have to stop later, I'm so glad I did!) And tried to clean myself up as quickly and quietly as possible. I should note that while this was all happening, I had my headphones in and Tchaikovsky's 1812 Overture was blasting. Of course I was at the end with the cannons and everything blasting off, just like my face. \n\nSo now I'm sitting here, on the train to work with a hole in the side of my face that doesn't seem to want to stop bleeding, with no makeup or Band-Aids or anything to cover it up with, trying to clandestinely blot it with a wipe occasionally without the chap across from me noticing how much of a disgusting hot mess I am. I'm still a bit in disbelief, I've never experienced something like this before, and just my luck it's while I'm out of the house the whole day. So I guess I'm keeping my hair down today, and lesson learned, I'll just never touch anything weird on my face again apparently.\n\nAnywho, I felt like I just had to vent and my husband's probably still asleep/wouldn't be amused, so hopefully you guys can join me in laughing at myself​. \n\nHappy Saturday everyone!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Humor", "id": "65i9a9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 38, "report_reasons": null, "author": "DmL2189", "saved": false, "mod_reports": [], "name": "t3_65i9a9", "subreddit_name_prefixed": "r/SkincareAddiction", "approved_by": null, "over_18": false, "domain": "self.SkincareAddiction", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tbbg", "edited": false, "link_flair_css_class": "Humor", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/SkincareAddiction/comments/65i9a9/humour_jolly_day_for_a_surprise/", "num_reports": null, "locked": false, "stickied": false, "created": 1492276733.0, "url": "https://www.reddit.com/r/SkincareAddiction/comments/65i9a9/humour_jolly_day_for_a_surprise/", "author_flair_text": null, "quarantine": false, "title": "[Humour] Jolly day for a surprise", "created_utc": 1492247933.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 38}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65i9a9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65i9a9", "likes": null, "replies": "", "user_reports": [], "id": "dgaiwr9", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DmL2189", "parent_id": "t1_dgahvui", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "Haha good point, there's always a silver lining!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha good point, there&amp;#39;s always a silver lining!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgaiwr9", "score_hidden": false, "stickied": false, "created": 1492281444.0, "created_utc": 1492252644.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgahvui", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Merelka", "parent_id": "t3_65i9a9", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "It would have just exploded later on its own at work. Then someone would have had to tell you that you were gushing pus and blood. Lol. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would have just exploded later on its own at work. Then someone would have had to tell you that you were gushing pus and blood. Lol. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgahvui", "score_hidden": false, "stickied": false, "created": 1492278146.0, "created_utc": 1492249346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}]