[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "SkincareAddiction", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have yet to order The Ordinary products as I have some questions regarding the effectiveness and quality. A question was posed to me from a friend when discussing as &amp;quot;how can products that are so inexpensive be quality or better than those that are higher priced.&amp;quot; I hesitate using if they don&amp;#39;t work as well as higher priced products. How are they priced so inexpensive and if they are so effective why not price higher? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d love to hear user experience as to how they have worked compared to higher priced similar products. &lt;/p&gt;\n\n&lt;p&gt;The items I am primarily interested from The Ordinary:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Vitamin C 23% suspension + HA sphere 2%&lt;/li&gt;\n&lt;li&gt;Lactic acid 10%&lt;/li&gt;\n&lt;li&gt;AHA 30% + BHA 2%&lt;/li&gt;\n&lt;li&gt;Buffet&lt;/li&gt;\n&lt;li&gt;Alpha Arbutin 2% + HA&lt;/li&gt;\n&lt;li&gt;Alpha Lipoic acid 5%&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;My current skin concerns/issues are aging, skin tone and brightness and wrinkles. &lt;/p&gt;\n\n&lt;p&gt;Any suggestions for regimen or products would be helpful as well. &lt;/p&gt;\n\n&lt;p&gt;Thanks in advance! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have yet to order The Ordinary products as I have some questions regarding the effectiveness and quality. A question was posed to me from a friend when discussing as \"how can products that are so inexpensive be quality or better than those that are higher priced.\" I hesitate using if they don't work as well as higher priced products. How are they priced so inexpensive and if they are so effective why not price higher? \n\nI'd love to hear user experience as to how they have worked compared to higher priced similar products. \n\nThe items I am primarily interested from The Ordinary:\n\n- Vitamin C 23% suspension + HA sphere 2%\n- Lactic acid 10%\n- AHA 30% + BHA 2%\n- Buffet\n- Alpha Arbutin 2% + HA\n- Alpha Lipoic acid 5%\n\nMy current skin concerns/issues are aging, skin tone and brightness and wrinkles. \n\nAny suggestions for regimen or products would be helpful as well. \n\nThanks in advance! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Product Question", "id": "65jq3z", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 71, "report_reasons": null, "author": "Maddyflirt", "saved": false, "mod_reports": [], "name": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "approved_by": null, "over_18": false, "domain": "self.SkincareAddiction", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tbbg", "edited": false, "link_flair_css_class": "PQ", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/SkincareAddiction/comments/65jq3z/product_question_the_ordinary_id_love_to_hear/", "num_reports": null, "locked": false, "stickied": false, "created": 1492300028.0, "url": "https://www.reddit.com/r/SkincareAddiction/comments/65jq3z/product_question_the_ordinary_id_love_to_hear/", "author_flair_text": null, "quarantine": false, "title": "[Product Question] The Ordinary. I'd love to hear comments or product review from people who have used them for an extended period of time.", "created_utc": 1492271228.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 35, "visited": false, "subreddit_type": "public", "ups": 71}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgatroc", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "scumteam14", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I think the pricing comes from marketing - the active ingredients themselves are pretty inexpensive (see DIY vitamin C serum recipes for examples.) But more expensive companies will combine a couple actives along with a lot of other ingredients such as extracts or stability enhancers or ingredients that just make your skin feel good. They're marketed as \"Anti Aging\" creams or what have you, maybe list a few buzz word ingredients, but the marketing is focused on the effects and not the ingredients themselves. Most of the Ordinary line is just a few ingredients used to stabilize one active. A couple of their products combine a few actives (the Buffet) and are priced slightly higher. But for the most part, it's just focused on one active. \n\nAdditionally, other brands are marketed as mid-range or high-end and price their products higher partially to maintain that exclusivity, or because they know that people will buy them (see the Ordinary's other, more expensive lines.) There are also products priced similarly to the Ordinary (generic Stridex pads for a BHA, etc) so the Ordinary isn't totally revolutionary in the pricing aspect, just that they've applied that to a variety of products you can order in one place.\n\nThere is some function over form going on, too - many people report the LAA vitamin C serum as being gritty because it's in an anhydrous mixture instead of a water based serum. This allows more stability without raising cost with more stability promoting ingredients, but you'd have to apply on a damp face to get rid of the grits.\n\nIt'd be cool if we could get one mega thread going for the Ordinary reviews (I think there may have been one a while ago? But it's been a while since I searched for reviews.)\n\nedit // paragraphs are nice to have", "edited": 1492307638.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the pricing comes from marketing - the active ingredients themselves are pretty inexpensive (see DIY vitamin C serum recipes for examples.) But more expensive companies will combine a couple actives along with a lot of other ingredients such as extracts or stability enhancers or ingredients that just make your skin feel good. They&amp;#39;re marketed as &amp;quot;Anti Aging&amp;quot; creams or what have you, maybe list a few buzz word ingredients, but the marketing is focused on the effects and not the ingredients themselves. Most of the Ordinary line is just a few ingredients used to stabilize one active. A couple of their products combine a few actives (the Buffet) and are priced slightly higher. But for the most part, it&amp;#39;s just focused on one active. &lt;/p&gt;\n\n&lt;p&gt;Additionally, other brands are marketed as mid-range or high-end and price their products higher partially to maintain that exclusivity, or because they know that people will buy them (see the Ordinary&amp;#39;s other, more expensive lines.) There are also products priced similarly to the Ordinary (generic Stridex pads for a BHA, etc) so the Ordinary isn&amp;#39;t totally revolutionary in the pricing aspect, just that they&amp;#39;ve applied that to a variety of products you can order in one place.&lt;/p&gt;\n\n&lt;p&gt;There is some function over form going on, too - many people report the LAA vitamin C serum as being gritty because it&amp;#39;s in an anhydrous mixture instead of a water based serum. This allows more stability without raising cost with more stability promoting ingredients, but you&amp;#39;d have to apply on a damp face to get rid of the grits.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;d be cool if we could get one mega thread going for the Ordinary reviews (I think there may have been one a while ago? But it&amp;#39;s been a while since I searched for reviews.)&lt;/p&gt;\n\n&lt;p&gt;edit // paragraphs are nice to have&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgatroc", "score_hidden": false, "stickied": false, "created": 1492302032.0, "created_utc": 1492273232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgb07rr", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "Oslonian", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I have the Lactic Acid 10% and the Alpha Arbutin 2%HA of your list, though I have plenty of other products by The Ordinary.\n\nI've used a glycolic acid mask by REN previously, and it is very nice, but very expensive, and the Lactic Acid by TO is a perfect substitute for me. I think it is important to mention that I am used to AHAs, since this is something that your skin needs to be slowly introduced to. I used the Lactic Acid in two ways: either as a final step after cream when I apply a few drops, or as a 10 minutes mask that I generously lather in and then rinse off. I recomend this method if you don't like the texture of the serum.\nI do not use this every night. But when I do, I wake up with glowing skin.\n\nThe Alpha Arbutin, in my experience, works pretty quickly, and then it slows down a bit, I suppose because it doesn't reach the deeper layers of the skin, where the pigmentation begins. But it keeps things at bay. I also use this in my hands (I'm 45) and it rapidly clears the sun spots if I have forgotten to reapply sunscreen in my hands. I walk the dog three times a day, and sometimes I just go out with my four-legged without sunscreen there. So yes, I love it.\n\nBut what I love more about The Ordinary is the approach that they have: one active ingredient in each bottle that allows you to tailor your skincare the way you want without alcohol, fancy ingredients that do nothing, or, most importantly, fragance. To me, it is a Godsend. I have a very sensitive skin that reacts badly with the smallest amount of fragance and alcohol, and those acne skin treatments for teenagers really have both of them, which amazes me a lot. So now I can get the Buffet for the wrinkles while addressing the pore congestion with Lactic Acid and Niacinamide at once without paying for a fancy extract of a purple orchid only found in some exotic island the seventh sea, if you know what I mean.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have the Lactic Acid 10% and the Alpha Arbutin 2%HA of your list, though I have plenty of other products by The Ordinary.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve used a glycolic acid mask by REN previously, and it is very nice, but very expensive, and the Lactic Acid by TO is a perfect substitute for me. I think it is important to mention that I am used to AHAs, since this is something that your skin needs to be slowly introduced to. I used the Lactic Acid in two ways: either as a final step after cream when I apply a few drops, or as a 10 minutes mask that I generously lather in and then rinse off. I recomend this method if you don&amp;#39;t like the texture of the serum.\nI do not use this every night. But when I do, I wake up with glowing skin.&lt;/p&gt;\n\n&lt;p&gt;The Alpha Arbutin, in my experience, works pretty quickly, and then it slows down a bit, I suppose because it doesn&amp;#39;t reach the deeper layers of the skin, where the pigmentation begins. But it keeps things at bay. I also use this in my hands (I&amp;#39;m 45) and it rapidly clears the sun spots if I have forgotten to reapply sunscreen in my hands. I walk the dog three times a day, and sometimes I just go out with my four-legged without sunscreen there. So yes, I love it.&lt;/p&gt;\n\n&lt;p&gt;But what I love more about The Ordinary is the approach that they have: one active ingredient in each bottle that allows you to tailor your skincare the way you want without alcohol, fancy ingredients that do nothing, or, most importantly, fragance. To me, it is a Godsend. I have a very sensitive skin that reacts badly with the smallest amount of fragance and alcohol, and those acne skin treatments for teenagers really have both of them, which amazes me a lot. So now I can get the Buffet for the wrinkles while addressing the pore congestion with Lactic Acid and Niacinamide at once without paying for a fancy extract of a purple orchid only found in some exotic island the seventh sea, if you know what I mean.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgb07rr", "score_hidden": false, "stickied": false, "created": 1492310894.0, "created_utc": 1492282094.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgazszh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "imprecationstation", "parent_id": "t1_dgaza4v", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "yeah i took a break from it and tried it three separate times and it did it every time. it was a nightmare bc it made my face *feel* so good. but yeah, i extracted a couple (bad, bad) just to see and the tops were literally like blood red. it maybe would have gone away eventually but it was a pretty unforgivable side effect and i couldn't wait it out.   \n  that said, i seem to be the only person this has happened to so who knows!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah i took a break from it and tried it three separate times and it did it every time. it was a nightmare bc it made my face &lt;em&gt;feel&lt;/em&gt; so good. but yeah, i extracted a couple (bad, bad) just to see and the tops were literally like blood red. it maybe would have gone away eventually but it was a pretty unforgivable side effect and i couldn&amp;#39;t wait it out.&lt;br/&gt;\n  that said, i seem to be the only person this has happened to so who knows!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgazszh", "score_hidden": false, "stickied": false, "created": 1492310330.0, "created_utc": 1492281530.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaza4v", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "metalola", "parent_id": "t1_dgayute", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "omg, that actually sounds terrifying!  \n\nI have both the 5% and 10%, and use according to desired effect, so I more regularly use the 5%, but if I say, have a really bad patch of dry skin around my mouth (damn my dry lips) I'll use the 10%.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;omg, that actually sounds terrifying!  &lt;/p&gt;\n\n&lt;p&gt;I have both the 5% and 10%, and use according to desired effect, so I more regularly use the 5%, but if I say, have a really bad patch of dry skin around my mouth (damn my dry lips) I&amp;#39;ll use the 10%.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgaza4v", "score_hidden": false, "stickied": false, "created": 1492309606.0, "created_utc": 1492280806.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgayute", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "imprecationstation", "parent_id": "t1_dgaxc4q", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "do you use the 5 or 10 percent lactic acid? im dying to get one since i read that it's a good dupe for sunday riley's good genes. the vitamin c turned all my SFs dark red overnight it was very weird :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;do you use the 5 or 10 percent lactic acid? im dying to get one since i read that it&amp;#39;s a good dupe for sunday riley&amp;#39;s good genes. the vitamin c turned all my SFs dark red overnight it was very weird :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgayute", "score_hidden": false, "stickied": false, "created": 1492309007.0, "created_utc": 1492280207.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxc4q", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "metalola", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I'm pretty sure The Ordinary is meant to disrupt the skincare market and also introduce people to DECIEM's other brands which are sold alongside The Ordinary that are higher end.  It's actually a genius ploy, why spend tens of thousands of dollars on marketing when you can just release a line for cheap and have the internet practically break over the prices and quality?\n\nOut of your list, I have only tried the Vit C and Lactic Acid, the Vit C is effective but it's really gritty and I dislike the texture on my face... a lot.  I use it on my body, and I still find it irritating!  But I have hyper-sensitive skin, like major eczema issues that I have to be tediously careful about. Their Lactic acid however, is a DREAM for my dry skin. I fucking love it, it's one of my favourite products ever, right up there with Retin-A and COSRX's rice mask, it is a Holy Grail 100%... It's not drying, makes my skin insanely soft and the effects are immediate.  Dead skin is gone and reveals younger looking freshness underneath, noticable in a single application.\n\nEDIT: Lactic Acid does smell a little funny as it's unscented, but I'm sensitive to fragrances so I'd much rather it smell weird than smell like perfume.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m pretty sure The Ordinary is meant to disrupt the skincare market and also introduce people to DECIEM&amp;#39;s other brands which are sold alongside The Ordinary that are higher end.  It&amp;#39;s actually a genius ploy, why spend tens of thousands of dollars on marketing when you can just release a line for cheap and have the internet practically break over the prices and quality?&lt;/p&gt;\n\n&lt;p&gt;Out of your list, I have only tried the Vit C and Lactic Acid, the Vit C is effective but it&amp;#39;s really gritty and I dislike the texture on my face... a lot.  I use it on my body, and I still find it irritating!  But I have hyper-sensitive skin, like major eczema issues that I have to be tediously careful about. Their Lactic acid however, is a DREAM for my dry skin. I fucking love it, it&amp;#39;s one of my favourite products ever, right up there with Retin-A and COSRX&amp;#39;s rice mask, it is a Holy Grail 100%... It&amp;#39;s not drying, makes my skin insanely soft and the effects are immediate.  Dead skin is gone and reveals younger looking freshness underneath, noticable in a single application.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Lactic Acid does smell a little funny as it&amp;#39;s unscented, but I&amp;#39;m sensitive to fragrances so I&amp;#39;d much rather it smell weird than smell like perfume.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgaxc4q", "score_hidden": false, "stickied": false, "created": 1492306958.0, "created_utc": 1492278158.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgazeo3", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "PoroSashimi", "parent_id": "t1_dgawylh", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "Yes, I read that too. They “claim”; I presume some people here don’t buy it. I completely understand why they would feel the need to lie though; “It’s just here to get you through the door” sounds pretty bad honestly loll. Personally I like to believe they are making a lot of money from The Ordinary, less likely for it to be discontinued! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I read that too. They “claim”; I presume some people here don’t buy it. I completely understand why they would feel the need to lie though; “It’s just here to get you through the door” sounds pretty bad honestly loll. Personally I like to believe they are making a lot of money from The Ordinary, less likely for it to be discontinued! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgazeo3", "score_hidden": false, "stickied": false, "created": 1492309781.0, "created_utc": 1492280981.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawylh", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "refur_augu", "parent_id": "t1_dgav83g", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "The founder of the Ordinary claims they make the same margins on that line as the pricier ones. They aren't loss leaders. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The founder of the Ordinary claims they make the same margins on that line as the pricier ones. They aren&amp;#39;t loss leaders. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgawylh", "score_hidden": false, "stickied": false, "created": 1492306445.0, "created_utc": 1492277645.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgb0auq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SavannahAlexis", "parent_id": "t1_dgazn21", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "Personally I don't mind the smell at all! Although I cannot stand the scent of Drunk Elephant's Vitamin serum (smells strongly of hot dogs)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally I don&amp;#39;t mind the smell at all! Although I cannot stand the scent of Drunk Elephant&amp;#39;s Vitamin serum (smells strongly of hot dogs)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgb0auq", "score_hidden": false, "stickied": false, "created": 1492311013.0, "created_utc": 1492282213.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazn21", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "PoroSashimi", "parent_id": "t1_dgayibi", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "Sunday Riley Good Genes Lactic Acid is 5% for your reference. I got the ordinary lactic acid 10%, it smells so bad I have yet used it a second time. The ordinary lactic acid 5% may be a better place for you to start if you don't mind the smell as much (just keep thinking that this is how it's SUPPOSE to smell; all those nice smelling products is just using chemistry to trick your brain!)\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sunday Riley Good Genes Lactic Acid is 5% for your reference. I got the ordinary lactic acid 10%, it smells so bad I have yet used it a second time. The ordinary lactic acid 5% may be a better place for you to start if you don&amp;#39;t mind the smell as much (just keep thinking that this is how it&amp;#39;s SUPPOSE to smell; all those nice smelling products is just using chemistry to trick your brain!)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgazn21", "score_hidden": false, "stickied": false, "created": 1492310105.0, "created_utc": 1492281305.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgayibi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Maddyflirt", "parent_id": "t1_dgav83g", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I have used AHA before as well as the pricey Sunday Riley Good Genes Lactic Acid and Luna Retin A night oil. My skin has done really well with them but I can't justify spending another $200+ for products if I can find similar products/ingredients in less costly brands. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have used AHA before as well as the pricey Sunday Riley Good Genes Lactic Acid and Luna Retin A night oil. My skin has done really well with them but I can&amp;#39;t justify spending another $200+ for products if I can find similar products/ingredients in less costly brands. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgayibi", "score_hidden": false, "stickied": false, "created": 1492308535.0, "created_utc": 1492279735.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgaz2zn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Maddyflirt", "parent_id": "t1_dgav83g", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I can see how they would offer The Ordinary products at a lower price point to in a way to lure you into purchasing the higher price point brands. \n\nIn browsing the Deciem site I was checking out some of the higher priced products in some of the other brands. The NIOD had a product called LBC bio-Lipid concentrate that looked interesting. It's $60.00 and I haven't seen anything like it that increases lip color and volume like it. \n\nIt's all around an interesting concept and point with this brand. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can see how they would offer The Ordinary products at a lower price point to in a way to lure you into purchasing the higher price point brands. &lt;/p&gt;\n\n&lt;p&gt;In browsing the Deciem site I was checking out some of the higher priced products in some of the other brands. The NIOD had a product called LBC bio-Lipid concentrate that looked interesting. It&amp;#39;s $60.00 and I haven&amp;#39;t seen anything like it that increases lip color and volume like it. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s all around an interesting concept and point with this brand. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgaz2zn", "score_hidden": false, "stickied": false, "created": 1492309324.0, "created_utc": 1492280524.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgav83g", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "PoroSashimi", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "One thing, as mentioned already is that skincare ingredients really are not expensive at all. Companies jack up the prices of fancy \"skincare\" all the time, and that is in quotation marks because when you flip the bottle and read the ingredient list it's pretty much just water, alcohol, fragrance and maybe a little bit of glycerin. Occasionally you will see companies boast of all the exotic plant extracts that justify the high price point. I personally feel any self-respecting skincare addict should have two issues with it: 1) There is no clinical research supporting a great majority of these \"elixir extracts\". 2) How the hell are these plants (which unlike chemicals in sterile laboratories, are perceptive to environmental contamination) sourced? \n\nSo the take away here: just because a product is expensive does not mean it is good; it just means there are enough uneducated people that would fall for the jazzed up marketing.\n\nThe Ordinary doesn't do all that marketing bullcrap (Deciem, the parent company do, especially for their higher end stuff but that's another story entirely); their product is pretty much a straight forward \"you get x% of this\". If you think about it, they are really tapping into a niche market. A normal person off the street won't have any idea what 10% niacinamide is, much less what it can do for your skin. Their packaging is simple and generic, making the supply chain easy to scale and mass produce.\n\nThere is also a theory floating around that The Ordinary is really Deciem's \"value menu\"; they are selling this line at cost in order to attract traffic and booster the sale of their other products. Think how a junior chicken is only ~$1; McD is probably not making a lot of money on it (could even be losing a bit of money!), but it's worth having it on the menu because more people visiting for it = more chances that some of these people will purchase other items that have a higher profit margin.\n\nI personally really like their products, though some of them may be a hit or miss, but that is true for all products; what works for you may not work me. I fee to really get the benefit out of The Ordinary, you need to know what you're doing. Like all the products you listed could potentially help the issues you described; have you ever had experience with other AHA before? Did your skin like it? \n\nYou can always buy all of it and slowly integrate/experiment them into your routine. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing, as mentioned already is that skincare ingredients really are not expensive at all. Companies jack up the prices of fancy &amp;quot;skincare&amp;quot; all the time, and that is in quotation marks because when you flip the bottle and read the ingredient list it&amp;#39;s pretty much just water, alcohol, fragrance and maybe a little bit of glycerin. Occasionally you will see companies boast of all the exotic plant extracts that justify the high price point. I personally feel any self-respecting skincare addict should have two issues with it: 1) There is no clinical research supporting a great majority of these &amp;quot;elixir extracts&amp;quot;. 2) How the hell are these plants (which unlike chemicals in sterile laboratories, are perceptive to environmental contamination) sourced? &lt;/p&gt;\n\n&lt;p&gt;So the take away here: just because a product is expensive does not mean it is good; it just means there are enough uneducated people that would fall for the jazzed up marketing.&lt;/p&gt;\n\n&lt;p&gt;The Ordinary doesn&amp;#39;t do all that marketing bullcrap (Deciem, the parent company do, especially for their higher end stuff but that&amp;#39;s another story entirely); their product is pretty much a straight forward &amp;quot;you get x% of this&amp;quot;. If you think about it, they are really tapping into a niche market. A normal person off the street won&amp;#39;t have any idea what 10% niacinamide is, much less what it can do for your skin. Their packaging is simple and generic, making the supply chain easy to scale and mass produce.&lt;/p&gt;\n\n&lt;p&gt;There is also a theory floating around that The Ordinary is really Deciem&amp;#39;s &amp;quot;value menu&amp;quot;; they are selling this line at cost in order to attract traffic and booster the sale of their other products. Think how a junior chicken is only ~$1; McD is probably not making a lot of money on it (could even be losing a bit of money!), but it&amp;#39;s worth having it on the menu because more people visiting for it = more chances that some of these people will purchase other items that have a higher profit margin.&lt;/p&gt;\n\n&lt;p&gt;I personally really like their products, though some of them may be a hit or miss, but that is true for all products; what works for you may not work me. I fee to really get the benefit out of The Ordinary, you need to know what you&amp;#39;re doing. Like all the products you listed could potentially help the issues you described; have you ever had experience with other AHA before? Did your skin like it? &lt;/p&gt;\n\n&lt;p&gt;You can always buy all of it and slowly integrate/experiment them into your routine. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgav83g", "score_hidden": false, "stickied": false, "created": 1492304083.0, "created_utc": 1492275283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgbde6f", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "hapinat", "parent_id": "t1_dgb3ud7", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "Yay! Another fan! I absolutely love this stuff. I had the same results as you along with the same expectations, and I couldn't believe that I started to apply less and less makeup as I continued to use it - I've literally never felt confident with just a little concealer. Niacinamide is bomb.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yay! Another fan! I absolutely love this stuff. I had the same results as you along with the same expectations, and I couldn&amp;#39;t believe that I started to apply less and less makeup as I continued to use it - I&amp;#39;ve literally never felt confident with just a little concealer. Niacinamide is bomb.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbde6f", "score_hidden": false, "stickied": false, "created": 1492329187.0, "created_utc": 1492300387.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3ud7", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "KS09", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I bought their Niacinamide 10% + Zinc 1% with pretty low expectations. However, since using it in my PM routine for the last month I've been shocked by the difference! My skin tone has evened out significantly, my pores have shrunk and my CCs are almost gone. My skin feels smooth and looks great without make up. \n\nBecause of the price point, I think it's definitely worth it to at least give some of their products a try. There isn't much to lose and a LOT to gain if it works out :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I bought their Niacinamide 10% + Zinc 1% with pretty low expectations. However, since using it in my PM routine for the last month I&amp;#39;ve been shocked by the difference! My skin tone has evened out significantly, my pores have shrunk and my CCs are almost gone. My skin feels smooth and looks great without make up. &lt;/p&gt;\n\n&lt;p&gt;Because of the price point, I think it&amp;#39;s definitely worth it to at least give some of their products a try. There isn&amp;#39;t much to lose and a LOT to gain if it works out :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgb3ud7", "score_hidden": false, "stickied": false, "created": 1492315767.0, "created_utc": 1492286967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgcqhk4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NinaV5", "parent_id": "t1_dgaxai0", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "What order do you use there products in?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What order do you use there products in?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgcqhk4", "score_hidden": false, "stickied": false, "created": 1492413290.0, "created_utc": 1492384490.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxai0", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgaxai0", "score_hidden": false, "stickied": false, "created": 1492306897.0, "created_utc": 1492278097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgcaf4x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "raptorladies", "parent_id": "t1_dgc4l8u", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "This helps actually.    Thank you ! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This helps actually.    Thank you ! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgcaf4x", "score_hidden": false, "stickied": false, "created": 1492391995.0, "created_utc": 1492363195.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4l8u", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "pijinglish", "parent_id": "t1_dgbrh4x", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "\"Peptides are fragments of proteins. On their own, peptides are made up of amino acids. When amino acids are combined in certain formations they create specific peptides (and there are hundreds of peptides), and when peptides are formed in a certain way, they make specific proteins.\n\nProteins are the fundamental building blocks of skin. Without peptides, skin doesn’t remain intact and the results is loss of firmness, appearance of wrinkles, texture changes, and skin that doesn’t bounce back as it once did.\n\nWhat’s so fascinating about peptides is that abundant research has clearly shown they can help revitalize those building blocks and, in turn, help revitalize skin.\" \n\n(I'm sure there are better [link](http://www.paulaschoice.com/expert-advice/anti-aging/_/peptides-for-skin#what)s out there, but I'm being lazy)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Peptides are fragments of proteins. On their own, peptides are made up of amino acids. When amino acids are combined in certain formations they create specific peptides (and there are hundreds of peptides), and when peptides are formed in a certain way, they make specific proteins.&lt;/p&gt;\n\n&lt;p&gt;Proteins are the fundamental building blocks of skin. Without peptides, skin doesn’t remain intact and the results is loss of firmness, appearance of wrinkles, texture changes, and skin that doesn’t bounce back as it once did.&lt;/p&gt;\n\n&lt;p&gt;What’s so fascinating about peptides is that abundant research has clearly shown they can help revitalize those building blocks and, in turn, help revitalize skin.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;(I&amp;#39;m sure there are better &lt;a href=\"http://www.paulaschoice.com/expert-advice/anti-aging/_/peptides-for-skin#what\"&gt;link&lt;/a&gt;s out there, but I&amp;#39;m being lazy)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgc4l8u", "score_hidden": false, "stickied": false, "created": 1492384179.0, "created_utc": 1492355379.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrh4x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "raptorladies", "parent_id": "t1_dgbquwj", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "Maybe my problem is just not understanding how peptides work of affect the skin.    With a lot of the other serums like zinc and nainimicide I understand how and why both ingredients affect the skin however with peptides I just don't comprehend.   I guess I've got to do some investigating here haha.  \nThe stickiness is unreal.  I tried washing it off with water in the shower (forgot cleanser due to my clearly way too deep thoughts haha) and my face felt really tacky and my fingers stuck to my skin even after the shower.   I had to wash it again before doing my morning routine.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe my problem is just not understanding how peptides work of affect the skin.    With a lot of the other serums like zinc and nainimicide I understand how and why both ingredients affect the skin however with peptides I just don&amp;#39;t comprehend.   I guess I&amp;#39;ve got to do some investigating here haha.&lt;br/&gt;\nThe stickiness is unreal.  I tried washing it off with water in the shower (forgot cleanser due to my clearly way too deep thoughts haha) and my face felt really tacky and my fingers stuck to my skin even after the shower.   I had to wash it again before doing my morning routine.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbrh4x", "score_hidden": false, "stickied": false, "created": 1492351475.0, "created_utc": 1492322675.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbquwj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pijinglish", "parent_id": "t1_dgbi8gt", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "\"This formula combines a comprehensive array of studied technologies to target multiple signs of ageing at once. The technologies are Matrixyl 3,000 peptide complex (with palmitoyl-pentapeptide 35), Matrixyl Synthe'6 peptide complex (with palmitoyl tripeptide-38), Syn-Ake peptide complex (with dipeptide diaminobutyroyl benzylamide diacetate), Relistase peptide complex (with acetylarginyltryptophyl diphenylglycine), Argirelox peptide complex (with acetyl hexapeptide-8, pentapeptide-18), Probiotic complex (with lactococcus lactis lysate), in a base of 11 skin-friendly amino acids and multiple hyaluronic acid complexes. The total concentration of these technologies in the formula by weight is 25.1%.\"\n\nMy wife thought it was a little too sticky.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;This formula combines a comprehensive array of studied technologies to target multiple signs of ageing at once. The technologies are Matrixyl 3,000 peptide complex (with palmitoyl-pentapeptide 35), Matrixyl Synthe&amp;#39;6 peptide complex (with palmitoyl tripeptide-38), Syn-Ake peptide complex (with dipeptide diaminobutyroyl benzylamide diacetate), Relistase peptide complex (with acetylarginyltryptophyl diphenylglycine), Argirelox peptide complex (with acetyl hexapeptide-8, pentapeptide-18), Probiotic complex (with lactococcus lactis lysate), in a base of 11 skin-friendly amino acids and multiple hyaluronic acid complexes. The total concentration of these technologies in the formula by weight is 25.1%.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My wife thought it was a little too sticky.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbquwj", "score_hidden": false, "stickied": false, "created": 1492350111.0, "created_utc": 1492321311.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbi8gt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "raptorladies", "parent_id": "t1_dgaz1pb", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "Im curious about the Buffet as well.  Can someone smart explain what results it should give ?   I've only noticed it slightly irritating my face so far.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im curious about the Buffet as well.  Can someone smart explain what results it should give ?   I&amp;#39;ve only noticed it slightly irritating my face so far.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbi8gt", "score_hidden": false, "stickied": false, "created": 1492336102.0, "created_utc": 1492307302.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaz1pb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "pumpkinchailatte", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I like the buffet... it's a watery serum that just sinks into your skin and doesn't cause any drying or anything. \n\nThat said, I'm not sure what it does, exactly. I use it twice a day and haven't really noticed any change in my skin, whether it be texture, redness, or fine lines. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like the buffet... it&amp;#39;s a watery serum that just sinks into your skin and doesn&amp;#39;t cause any drying or anything. &lt;/p&gt;\n\n&lt;p&gt;That said, I&amp;#39;m not sure what it does, exactly. I use it twice a day and haven&amp;#39;t really noticed any change in my skin, whether it be texture, redness, or fine lines. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgaz1pb", "score_hidden": false, "stickied": false, "created": 1492309272.0, "created_utc": 1492280472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgb864r", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "jellytin8", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "Check out the [gothamista's review](https://youtu.be/LSEsLLrgHsY) on The Ordinary (it's a two part series).\n\nShe's gorgeous and fantastic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Check out the &lt;a href=\"https://youtu.be/LSEsLLrgHsY\"&gt;gothamista&amp;#39;s review&lt;/a&gt; on The Ordinary (it&amp;#39;s a two part series).&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s gorgeous and fantastic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgb864r", "score_hidden": false, "stickied": false, "created": 1492321712.0, "created_utc": 1492292912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgbqzxu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pijinglish", "parent_id": "t1_dgbmv3b", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I would consider the MAP as a daytime product and the C23 for night since its much heavier and a little gritty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would consider the MAP as a daytime product and the C23 for night since its much heavier and a little gritty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbqzxu", "score_hidden": false, "stickied": false, "created": 1492350416.0, "created_utc": 1492321616.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbmv3b", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "nerisella", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I laid out my routine/did some mini reviews on some The Ordinary products in a previous comment I made in this sub (see [here](https://www.reddit.com/r/SkincareAddiction/comments/63gnm1/hauls_when_you_discover_the_ordinary_after/dfv47qi/)), but from your list I see you're interested in the Alpha Arbutin 2% + HA serum. I gave that product a \"meh\" review just a short while ago, but I've done some more research and refining of my routine (I wasn't paying a lot of attention to some products and was on occasion inadvertently mixing a few ingredients that cancel one another because I'm a dummy, even though I know better) and I never skip it in the AM now! I really, really like it.  I've been using the Alpha Arbutin 2% + HA since Nov. 2016 as well as all of my other The Ordinary products (some others in my routine have shifted since then; the comment I posted recently is the most up to date), and i'm really happy with the results.\n\nFrom November 2016 - January 2017 I was using primarily The Ordinary products and my CC's saw a significant reduction and the overall quality of my skin texture improved a lot. The biggest criticism I see of The Ordinary is that a lot of their products are \"one hit wonders\" so to say, so to get a \"full routine\" you end up layering a lot of product. I actually like this about the skincare line though, because a lot of stuff I find in Sephora/Ulta/Amazon/Online/Asian Skincare/etc have ingredients that I want in my routine, but also include other ingredients that I definitely don't want or ingredients that I know irritate me. I *really* like that The Ordinary products are all very simple, often one ingredient products. This allows me to layer whatever kind of ingredients and actives I know I like without using stuff my skin doesn't like. \n\nI've been interested in Vitamin C 23% suspension + HA sphere 2% as well and might replace the Magnesium Ascorbyl Phosphate 10% in my routine with that product once I run out of my current bottle + backup. For exfoliants, I'm currently using Differin and (just tonight, actually) beginning to reintroduce peels into my routine. I ordered some peels from MUAC a few months ago and never got around to using them since I was allowing my skin to adapt to Differin (January 2017-current) before introducing another. I've had some **suuuuuper** stubborn clogs ever since I didn't use Differin for a week on vacation recently and hope the peel(s) will help that. I plan to work up to using them every other week or so. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I laid out my routine/did some mini reviews on some The Ordinary products in a previous comment I made in this sub (see &lt;a href=\"https://www.reddit.com/r/SkincareAddiction/comments/63gnm1/hauls_when_you_discover_the_ordinary_after/dfv47qi/\"&gt;here&lt;/a&gt;), but from your list I see you&amp;#39;re interested in the Alpha Arbutin 2% + HA serum. I gave that product a &amp;quot;meh&amp;quot; review just a short while ago, but I&amp;#39;ve done some more research and refining of my routine (I wasn&amp;#39;t paying a lot of attention to some products and was on occasion inadvertently mixing a few ingredients that cancel one another because I&amp;#39;m a dummy, even though I know better) and I never skip it in the AM now! I really, really like it.  I&amp;#39;ve been using the Alpha Arbutin 2% + HA since Nov. 2016 as well as all of my other The Ordinary products (some others in my routine have shifted since then; the comment I posted recently is the most up to date), and i&amp;#39;m really happy with the results.&lt;/p&gt;\n\n&lt;p&gt;From November 2016 - January 2017 I was using primarily The Ordinary products and my CC&amp;#39;s saw a significant reduction and the overall quality of my skin texture improved a lot. The biggest criticism I see of The Ordinary is that a lot of their products are &amp;quot;one hit wonders&amp;quot; so to say, so to get a &amp;quot;full routine&amp;quot; you end up layering a lot of product. I actually like this about the skincare line though, because a lot of stuff I find in Sephora/Ulta/Amazon/Online/Asian Skincare/etc have ingredients that I want in my routine, but also include other ingredients that I definitely don&amp;#39;t want or ingredients that I know irritate me. I &lt;em&gt;really&lt;/em&gt; like that The Ordinary products are all very simple, often one ingredient products. This allows me to layer whatever kind of ingredients and actives I know I like without using stuff my skin doesn&amp;#39;t like. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been interested in Vitamin C 23% suspension + HA sphere 2% as well and might replace the Magnesium Ascorbyl Phosphate 10% in my routine with that product once I run out of my current bottle + backup. For exfoliants, I&amp;#39;m currently using Differin and (just tonight, actually) beginning to reintroduce peels into my routine. I ordered some peels from MUAC a few months ago and never got around to using them since I was allowing my skin to adapt to Differin (January 2017-current) before introducing another. I&amp;#39;ve had some &lt;strong&gt;suuuuuper&lt;/strong&gt; stubborn clogs ever since I didn&amp;#39;t use Differin for a week on vacation recently and hope the peel(s) will help that. I plan to work up to using them every other week or so. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbmv3b", "score_hidden": false, "stickied": false, "created": 1492342996.0, "created_utc": 1492314196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgbhfkq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "EmIsTree", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I was super interested in the Alpha Lipoic, but I did some research and it seems kinda iffy in effectiveness as an ingredient, especially on the antioxidant front. [This study](http://www.jidonline.org/article/S0022-202X(15\\)32014-5/fulltext) found that it had no meaningful photoprotection compared to control, whereas vitamin C provided significant protection.  So I'd stick to the proven vitamin C to do what deciem says alpha lipoic acid is supposed to do (antioxidant effects and improving visible skin texture and tone).\n\nStephanie Nicole has a [super detailed review](https://www.youtube.com/watch?v=Jp6_n9IARPY) on the line, and she typically uses very pricey skincare (e.g. drunk elephant, sunday riley) so I think you might enjoy her opinions.  She talks about everything you've listed except the 30% AHA peel.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was super interested in the Alpha Lipoic, but I did some research and it seems kinda iffy in effectiveness as an ingredient, especially on the antioxidant front. &lt;a href=\"http://www.jidonline.org/article/S0022-202X(15)32014-5/fulltext\"&gt;This study&lt;/a&gt; found that it had no meaningful photoprotection compared to control, whereas vitamin C provided significant protection.  So I&amp;#39;d stick to the proven vitamin C to do what deciem says alpha lipoic acid is supposed to do (antioxidant effects and improving visible skin texture and tone).&lt;/p&gt;\n\n&lt;p&gt;Stephanie Nicole has a &lt;a href=\"https://www.youtube.com/watch?v=Jp6_n9IARPY\"&gt;super detailed review&lt;/a&gt; on the line, and she typically uses very pricey skincare (e.g. drunk elephant, sunday riley) so I think you might enjoy her opinions.  She talks about everything you&amp;#39;ve listed except the 30% AHA peel.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbhfkq", "score_hidden": false, "stickied": false, "created": 1492334945.0, "created_utc": 1492306145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgb5nhw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "geobsessed", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I wrote a post about this recently, you can [read it here](https://www.reddit.com/r/SkincareAddiction/comments/5y1z2u/review_my_2_month_review_of_the_ordinarys/).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wrote a post about this recently, you can &lt;a href=\"https://www.reddit.com/r/SkincareAddiction/comments/5y1z2u/review_my_2_month_review_of_the_ordinarys/\"&gt;read it here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgb5nhw", "score_hidden": false, "stickied": false, "created": 1492318223.0, "created_utc": 1492289423.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgavfok", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "becatron7", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "The only thing I have on your list is the 30% aha and so far I'm liking. Im using it once a week and it continues to brighten my face and keep my skin clear from congestion. I've had no negative reactions to it but it does tingle when you apply ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only thing I have on your list is the 30% aha and so far I&amp;#39;m liking. Im using it once a week and it continues to brighten my face and keep my skin clear from congestion. I&amp;#39;ve had no negative reactions to it but it does tingle when you apply &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgavfok", "score_hidden": false, "stickied": false, "created": 1492304370.0, "created_utc": 1492275570.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgbc22a", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ebufflo", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I've been using the LA 10%, Buffet, and Advanced Retinoid for about a month. I like them all and think they work as well as other more expensive stuff I tried. I hate the Vitamin C suspension with the fire of a thousand suns. It burns, it's gritty, it balls up under other products, and it made me break out. Others seem to love it, though, but I'm sticking to my Mad Hippie and may try Timeless in the future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been using the LA 10%, Buffet, and Advanced Retinoid for about a month. I like them all and think they work as well as other more expensive stuff I tried. I hate the Vitamin C suspension with the fire of a thousand suns. It burns, it&amp;#39;s gritty, it balls up under other products, and it made me break out. Others seem to love it, though, but I&amp;#39;m sticking to my Mad Hippie and may try Timeless in the future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbc22a", "score_hidden": false, "stickied": false, "created": 1492327309.0, "created_utc": 1492298509.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgbmils", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "simplegodhead", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I've been using several Ordinary products for about two months now. The niacinamide + zinc serum is probably my favorite product, it evened out my skin texture a lot and helps keep breakouts at bay. Doesn't do a lot for my oil production though, at least not in the t-zone. It seems a little drying when I use it twice a day but once a day is fine.\n\nThe vitamin C 23% suspension had nice effects but didn't feel too great to apply, slightly gritty and it sat on top of my face until I patted it in and put another product on top. I noticed some brightening and skintone evening and my blemishes/PIH marks seemed a little lighter. I was using it every other night and it stung quite a bit at first although that eventually faded.\n\nBuffet feels nice when I pat it on but it's a little sticky and I haven't really seen any results from it. It's supposed to help with fine lines but I don't have much in the way of wrinkles or fine lines yet. It hasn't had much of an effect on the fine lines I DO have but to be fair I use it pretty inconsistently (maybe 1-2 times a week if that). \n\nI've only been using the Alpha Arbutin for a week and a half 2x a day as a spot treatment on my blemishes/PIH and they've lightened quite a bit since I started.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been using several Ordinary products for about two months now. The niacinamide + zinc serum is probably my favorite product, it evened out my skin texture a lot and helps keep breakouts at bay. Doesn&amp;#39;t do a lot for my oil production though, at least not in the t-zone. It seems a little drying when I use it twice a day but once a day is fine.&lt;/p&gt;\n\n&lt;p&gt;The vitamin C 23% suspension had nice effects but didn&amp;#39;t feel too great to apply, slightly gritty and it sat on top of my face until I patted it in and put another product on top. I noticed some brightening and skintone evening and my blemishes/PIH marks seemed a little lighter. I was using it every other night and it stung quite a bit at first although that eventually faded.&lt;/p&gt;\n\n&lt;p&gt;Buffet feels nice when I pat it on but it&amp;#39;s a little sticky and I haven&amp;#39;t really seen any results from it. It&amp;#39;s supposed to help with fine lines but I don&amp;#39;t have much in the way of wrinkles or fine lines yet. It hasn&amp;#39;t had much of an effect on the fine lines I DO have but to be fair I use it pretty inconsistently (maybe 1-2 times a week if that). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve only been using the Alpha Arbutin for a week and a half 2x a day as a spot treatment on my blemishes/PIH and they&amp;#39;ve lightened quite a bit since I started.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbmils", "score_hidden": false, "stickied": false, "created": 1492342487.0, "created_utc": 1492313687.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgbmp7k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "emcoppa", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "From this list I've only used the lactic acid 10% for about 3 months, i had to stop using it because it broke me out so badly. One of the worst breakouts I've ever had i thought i was purging but no...it just kept going and going and getting progressively worse. I dont know how to show u pictures on here but if u want to see the type of breakouts I was having u can check out Stephanie Nicoles video and skip to the part where she talks about this product she shows a picture of her breakouts they look EXACTLY like mine did. However, some people love this stuff it just didnt work for me which bummed me out alot:( definitely patch test this either way!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From this list I&amp;#39;ve only used the lactic acid 10% for about 3 months, i had to stop using it because it broke me out so badly. One of the worst breakouts I&amp;#39;ve ever had i thought i was purging but no...it just kept going and going and getting progressively worse. I dont know how to show u pictures on here but if u want to see the type of breakouts I was having u can check out Stephanie Nicoles video and skip to the part where she talks about this product she shows a picture of her breakouts they look EXACTLY like mine did. However, some people love this stuff it just didnt work for me which bummed me out alot:( definitely patch test this either way!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbmp7k", "score_hidden": false, "stickied": false, "created": 1492342752.0, "created_utc": 1492313952.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgdamvr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CrikeyAphrodite", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I started using TO products in early September 2016. My first order included the VitC 23% suspension, Buffet, Hyaluronic Acid, and the Retinoid 2%. My next order added the Niacinamide and Natural Moisturising Factors, and then in the last month I've purchased the Alpha Arbutin and the Argireline Solution.\n(For reference, I'm 39yo/f who lives in the U.K and has a job that keeps me out of the sun, however I grew up in Australia and have a lot of historical sun damage. I have freckles and spots of larger pigmentation. I have normal/combination skin, with some dryness on my nose and an oily T zone. Only get the occasional hormonal pimple and not many wrinkles yet, but starting to notice some fine lines around my eyes and crepeyness around my mouth).\n\nI LOVE: The Buffet and the Niacinamide.  \nI didn't realise how much of a positive of an effect either of these had on my skin until after I ran out of both of them!  The Buffet takes at least a month of regular use to have a noticeable effect I think. I really do notice a difference in the fine wrinkles around my eyes, and my forehead looks a lot smoother. My skin just looks better when this is a regular part of my routine, and I missed it when I couldn't get hold of it for two months. The texture is nice and absorbs quickly, with no sticky feeling.\nThe Niacinamide is another one that I didn't realise how much it improved my complexion until I ran out. I've never had particularly enlarged pores, but this makes my skin look more refined. I don't get as greasy on my T zone throughout the day and I hardly ever get any pimples when I use this. When I ran out and couldn't repurchase for a few weeks I noticed an increase in oiliness and had a few breakouts. It also seems to make my foundation lay better. Dries down a bit tacky but that disappears once I put my moisturiser on.\n\nI LIKE: The VitC 23% Suspension, Retinoid 2% and the Hyaluronic Acid 2% + B5. \nI love the VitC suspension but like most people I'm less of a fan of the texture. The graininess isn't that much of a problem; you can get past the powdery feeling and the pilling depending on how you put it on and what you layer it with, I'd just prefer to wear it in the morning and it makes my skin too greasy to do that. It does make my skin look glowy, and it has had a significantly noticeable effect on my pigmentation, so I will repurchase, possibly with another of their VitC derivatives to compare.\nI only use the Retinoid 2-3 times a week. My skin looks plump and clear the following morning with a noticeable improvement in texture. I've been using my AHA and BHA a lot less since adding this to my routine as I find my skin doesn't need them as much. I will repurchase.\nI really love their Hyaluronic Acid. It was the first HA serum that I've ever used and out of everything it is definitely the product that had the most immediately positive and noticeable effect. My skin looked plumped and hydrated straight after application. Some people find the texture to be thick and sticky; I guess it is, but I found it disappeared pretty quickly once layered with other products. I've never had any pilling with this. I've repurchased this a few times now, but recently switched to the Hada Labo Gokujyun Premium HA lotion, which I like more and works out cheaper for the volume you get.\n\nUNSURE: Alpha Arbutin 2% and Argirline Solution 10%. \nI've only had these for about 3 weeks so the jury is still out on these. The only thing I have noticed so far is a few cystic pimples in places where these have both been applied, so I might be having a bad reaction to one of them. I never get cystic pimples, and to get three since introducing these two products makes me suspicious. I'll do an elimination test and see if I have any more reactions.\n\nHATE: The Lactic Acid 10%. I will definitely not be repurchasing and I'm reluctant to try any of their other acids. I've been using the Bravura London LA10%, BHA 2% about once a week, and the Pixi Glow Tonic once daily, and have been really happy with that routine. The TO Lactic stinks. It makes me want to heave. It smells like rotting pawpaw and I can't keep it on my face for more than a couple of minutes before I have to wash it off. I couldn't really say how well it works because I don't use it often enough. I won't be repurchasing and it will probably go in the bin.\n\nOverall I'm pretty happy with what I've purchased from The Ordinary. My complexion has definitely improved. I'm looking forward to trying some of their foundations and oils. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started using TO products in early September 2016. My first order included the VitC 23% suspension, Buffet, Hyaluronic Acid, and the Retinoid 2%. My next order added the Niacinamide and Natural Moisturising Factors, and then in the last month I&amp;#39;ve purchased the Alpha Arbutin and the Argireline Solution.\n(For reference, I&amp;#39;m 39yo/f who lives in the U.K and has a job that keeps me out of the sun, however I grew up in Australia and have a lot of historical sun damage. I have freckles and spots of larger pigmentation. I have normal/combination skin, with some dryness on my nose and an oily T zone. Only get the occasional hormonal pimple and not many wrinkles yet, but starting to notice some fine lines around my eyes and crepeyness around my mouth).&lt;/p&gt;\n\n&lt;p&gt;I LOVE: The Buffet and the Niacinamide.&lt;br/&gt;\nI didn&amp;#39;t realise how much of a positive of an effect either of these had on my skin until after I ran out of both of them!  The Buffet takes at least a month of regular use to have a noticeable effect I think. I really do notice a difference in the fine wrinkles around my eyes, and my forehead looks a lot smoother. My skin just looks better when this is a regular part of my routine, and I missed it when I couldn&amp;#39;t get hold of it for two months. The texture is nice and absorbs quickly, with no sticky feeling.\nThe Niacinamide is another one that I didn&amp;#39;t realise how much it improved my complexion until I ran out. I&amp;#39;ve never had particularly enlarged pores, but this makes my skin look more refined. I don&amp;#39;t get as greasy on my T zone throughout the day and I hardly ever get any pimples when I use this. When I ran out and couldn&amp;#39;t repurchase for a few weeks I noticed an increase in oiliness and had a few breakouts. It also seems to make my foundation lay better. Dries down a bit tacky but that disappears once I put my moisturiser on.&lt;/p&gt;\n\n&lt;p&gt;I LIKE: The VitC 23% Suspension, Retinoid 2% and the Hyaluronic Acid 2% + B5. \nI love the VitC suspension but like most people I&amp;#39;m less of a fan of the texture. The graininess isn&amp;#39;t that much of a problem; you can get past the powdery feeling and the pilling depending on how you put it on and what you layer it with, I&amp;#39;d just prefer to wear it in the morning and it makes my skin too greasy to do that. It does make my skin look glowy, and it has had a significantly noticeable effect on my pigmentation, so I will repurchase, possibly with another of their VitC derivatives to compare.\nI only use the Retinoid 2-3 times a week. My skin looks plump and clear the following morning with a noticeable improvement in texture. I&amp;#39;ve been using my AHA and BHA a lot less since adding this to my routine as I find my skin doesn&amp;#39;t need them as much. I will repurchase.\nI really love their Hyaluronic Acid. It was the first HA serum that I&amp;#39;ve ever used and out of everything it is definitely the product that had the most immediately positive and noticeable effect. My skin looked plumped and hydrated straight after application. Some people find the texture to be thick and sticky; I guess it is, but I found it disappeared pretty quickly once layered with other products. I&amp;#39;ve never had any pilling with this. I&amp;#39;ve repurchased this a few times now, but recently switched to the Hada Labo Gokujyun Premium HA lotion, which I like more and works out cheaper for the volume you get.&lt;/p&gt;\n\n&lt;p&gt;UNSURE: Alpha Arbutin 2% and Argirline Solution 10%. \nI&amp;#39;ve only had these for about 3 weeks so the jury is still out on these. The only thing I have noticed so far is a few cystic pimples in places where these have both been applied, so I might be having a bad reaction to one of them. I never get cystic pimples, and to get three since introducing these two products makes me suspicious. I&amp;#39;ll do an elimination test and see if I have any more reactions.&lt;/p&gt;\n\n&lt;p&gt;HATE: The Lactic Acid 10%. I will definitely not be repurchasing and I&amp;#39;m reluctant to try any of their other acids. I&amp;#39;ve been using the Bravura London LA10%, BHA 2% about once a week, and the Pixi Glow Tonic once daily, and have been really happy with that routine. The TO Lactic stinks. It makes me want to heave. It smells like rotting pawpaw and I can&amp;#39;t keep it on my face for more than a couple of minutes before I have to wash it off. I couldn&amp;#39;t really say how well it works because I don&amp;#39;t use it often enough. I won&amp;#39;t be repurchasing and it will probably go in the bin.&lt;/p&gt;\n\n&lt;p&gt;Overall I&amp;#39;m pretty happy with what I&amp;#39;ve purchased from The Ordinary. My complexion has definitely improved. I&amp;#39;m looking forward to trying some of their foundations and oils. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgdamvr", "score_hidden": false, "stickied": false, "created": 1492448306.0, "created_utc": 1492419506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgb67hz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SexyBleuBox", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "My favorite makeup artist actually just did a video review after trying out the products for a few months. https://www.youtube.com/watch?v=A5lYrRH-W-Q\n\nI am planning on buying a few of their products when it comes to replace my current ones based on their pricepoint and her review but I had never heard of them before her mention of them. I currently have a 5 product routine to help adult acne and tight tissue papery dry skin so I'm into pretty into skincare but I'm not willing to pay a premium at high end department stores. The products I currently have either came from target or amazon and they work beautifully. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My favorite makeup artist actually just did a video review after trying out the products for a few months. &lt;a href=\"https://www.youtube.com/watch?v=A5lYrRH-W-Q\"&gt;https://www.youtube.com/watch?v=A5lYrRH-W-Q&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I am planning on buying a few of their products when it comes to replace my current ones based on their pricepoint and her review but I had never heard of them before her mention of them. I currently have a 5 product routine to help adult acne and tight tissue papery dry skin so I&amp;#39;m into pretty into skincare but I&amp;#39;m not willing to pay a premium at high end department stores. The products I currently have either came from target or amazon and they work beautifully. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgb67hz", "score_hidden": false, "stickied": false, "created": 1492318993.0, "created_utc": 1492290193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgbwp0q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MuttonDressedAsGoose", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 0, "body": "I'm a newbie, myself. All I can say is that I have had no ill effects from the two products I've just received this week (Retinoid 2% and Buffet.)\n\nDoes anyone know if the Vitamin C would work as a mask? Like, I take my makeup off after work and there are a few hours before bedtime. Would it be effective to put it on for a couple of hours and then wash it off before  my evening routine (Retinoid and night moisturizer?)\n\nI'm curious about the AHA mask - I'm currently using Nip &amp; Fab Glycolic Extreme pads 2x a day (after cleansing). I'm tolerating that well - Would a couple of times a week using the AHA mask be overkill?\n\nAnd a question about the Niacinamide + zinc... Currently, the only product I have with Niacinamide is an Olay Regenerist serum that I wouldn't mind replacing due to having silicone. Would this layer OK with a vitamin C (non-Ordinary) and Buffet? The Regenerist serum has silicone and I think it's a bit problematic when layered with a ton of other stuff and worn under makeup.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a newbie, myself. All I can say is that I have had no ill effects from the two products I&amp;#39;ve just received this week (Retinoid 2% and Buffet.)&lt;/p&gt;\n\n&lt;p&gt;Does anyone know if the Vitamin C would work as a mask? Like, I take my makeup off after work and there are a few hours before bedtime. Would it be effective to put it on for a couple of hours and then wash it off before  my evening routine (Retinoid and night moisturizer?)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m curious about the AHA mask - I&amp;#39;m currently using Nip &amp;amp; Fab Glycolic Extreme pads 2x a day (after cleansing). I&amp;#39;m tolerating that well - Would a couple of times a week using the AHA mask be overkill?&lt;/p&gt;\n\n&lt;p&gt;And a question about the Niacinamide + zinc... Currently, the only product I have with Niacinamide is an Olay Regenerist serum that I wouldn&amp;#39;t mind replacing due to having silicone. Would this layer OK with a vitamin C (non-Ordinary) and Buffet? The Regenerist serum has silicone and I think it&amp;#39;s a bit problematic when layered with a ton of other stuff and worn under makeup.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgbwp0q", "score_hidden": false, "stickied": false, "created": 1492367080.0, "created_utc": 1492338280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tbbg", "removal_reason": null, "link_id": "t3_65jq3z", "likes": null, "replies": "", "user_reports": [], "id": "dgax5mh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meg0neurotHe11", "parent_id": "t3_65jq3z", "subreddit_name_prefixed": "r/SkincareAddiction", "controversiality": 1, "body": "I tried the Alpha Lipoic 5% and the Lactic Acid 10% but could not use them long because frankly they irritated my skin and i could not get past the texture. The lactic smells awful and was too goopy for me, and sticky, and just did nothing for me. The Alpha Liopic felt awful on the skin, oily, and smelled like petrol or fuel. Not a pleasant experience\n\nAs to your other point, i do think some companies mark up their prices only because they can. Chanel, La mer, Dior, Drunk Elephant etc...they all must have great products but at the end of the day i do think if they can get away with pricing as much as they can, and people are still buying, that is exactly what they do.\n\n People sometimes like the experience of skincare/MU. They like the pretty bottles and the scents and the elegant textures and the (frankly) brand of the product they are using. I do think everything that i have tried from The Ordinary (the AL, Lactic, Caffeine eye, Niacinamide) has been meh or bad texture wise. And i realized that yes, i am one of those people that would pay more for a more elegant texture and experience with something i put on my face everyday. The biggest selling point for The Ordinary IS that it's ordinary. ordinary prices for ordinary, everyday people who want to explore actives and retinols and hydrators that they normally would not due to price so it does work for them and it fills in a nice little niche area because someone thinks well whatever if it doesn't work it was only $5", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tried the Alpha Lipoic 5% and the Lactic Acid 10% but could not use them long because frankly they irritated my skin and i could not get past the texture. The lactic smells awful and was too goopy for me, and sticky, and just did nothing for me. The Alpha Liopic felt awful on the skin, oily, and smelled like petrol or fuel. Not a pleasant experience&lt;/p&gt;\n\n&lt;p&gt;As to your other point, i do think some companies mark up their prices only because they can. Chanel, La mer, Dior, Drunk Elephant etc...they all must have great products but at the end of the day i do think if they can get away with pricing as much as they can, and people are still buying, that is exactly what they do.&lt;/p&gt;\n\n&lt;p&gt;People sometimes like the experience of skincare/MU. They like the pretty bottles and the scents and the elegant textures and the (frankly) brand of the product they are using. I do think everything that i have tried from The Ordinary (the AL, Lactic, Caffeine eye, Niacinamide) has been meh or bad texture wise. And i realized that yes, i am one of those people that would pay more for a more elegant texture and experience with something i put on my face everyday. The biggest selling point for The Ordinary IS that it&amp;#39;s ordinary. ordinary prices for ordinary, everyday people who want to explore actives and retinols and hydrators that they normally would not due to price so it does work for them and it fills in a nice little niche area because someone thinks well whatever if it doesn&amp;#39;t work it was only $5&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SkincareAddiction", "name": "t1_dgax5mh", "score_hidden": false, "stickied": false, "created": 1492306713.0, "created_utc": 1492277913.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]