[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "StrangerThings", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, as the title says, I just finished season 1. I watched it because of recommendation from a close friend and because I saw plenty of people online just loving it. And if I were to sum my feelings about it into one word, it would probably be &amp;quot;Meh&amp;quot;. And I would love to hear why am I wrong.&lt;/p&gt;\n\n&lt;p&gt;To be clear, I don&amp;#39;t think it was bad. But I definitely didn&amp;#39;t enjoy it as much as I expected to. I would like to note why I fell about it this way, but I will need to talk about some plotpoints. I will try to put any major ones into spoiler format, but for sure: WARNING, SPOILERS (FOR WHOLE SEASON 1 I GUESS) AHEAD!&lt;/p&gt;\n\n&lt;p&gt;There are a few things, that can be interesting about a series.&lt;/p&gt;\n\n&lt;p&gt;Firstly, the main idea. Well, that&amp;#39;s what in my opinion was the absolutely least interesting thing about ST. The &amp;quot;overall concept&amp;quot; was just a few clichés (&lt;a href=\"/spoiler\"&gt;otherworld monster; supernatural kid; secret government agency=bad; a bunch of slightly bullied nerds=good&lt;/a&gt;) melded together. Not necesarilly bad, but absolutely not anything I would find interesting.&lt;/p&gt;\n\n&lt;p&gt;Secondly, characters. I don&amp;#39;t say i didn&amp;#39;t find any of the characters interesting. But, thats true just bearly: IMHO, I think just one of them is interesting - the missing kid&amp;#39;s mother (I suck at names). Other then that I find every character one-dimensional and boring. Everybody was clearly and definitely good or bad from the very start, with basically no deviations from the first or second impression I got about them. There were two exceptions - &lt;a href=\"/spoiler\"&gt;the missing kid&amp;#39;s brother, who became kinda creepy&lt;/a&gt;, which I didn&amp;#39;t find good for reasons listed two paragraphs below, and &lt;a href=\"/spoiler\"&gt;the betterment of the douche, that dated the sister of the main kid&lt;/a&gt;, which is one of a few things during ST, that I actually enjoyed.&lt;/p&gt;\n\n&lt;p&gt;Thirdly, the atmosphere. I admit, I might have just &amp;quot;not felt it&amp;quot; simply because of my being eastern-european guy in my early twenties. But yeah, the atmosphere didn&amp;#39;t seem particularly great to me.&lt;/p&gt;\n\n&lt;p&gt;Fourthly (is that a word?), the writing. OMG, there were just so many things I hated. From characters not communicating when they clearly should (&lt;a href=\"/spoiler\"&gt;&amp;quot;We&amp;#39;re going to haunt unknown monster, that nobody believes in except for your mother, who might be the only one who saw it clearly and who is getting crazy, because noone belives her. How about we tell her about it, so she can get less mental and maybe tell us a little bit about what we should expect.&amp;quot; &amp;quot;Well, she might get upset, so how &amp;#39;bout no?&amp;quot;&lt;/a&gt; or &lt;a href=\"/spoiler\"&gt;when kid, who returned from the fucking nightmare dimension doesn&amp;#39;t tell anyone (even though everyone loves and supports him) about him vomiting fucking alien slugs, that might be like super dangerous&lt;/a&gt;), through characters being stupid (like &lt;a href=\"/spoiler\"&gt;kids obviously not mourning, when they&amp;#39;re absolutely supposed to by everyone else&lt;/a&gt; or &lt;a href=\"/spoiler\"&gt;super-secret government agency first not really able to deal with a small town sherrif that&amp;#39;s just too curious and after he &lt;strong&gt;finds out, that they&amp;#39;re fucking experimenting on kids&lt;/strong&gt;, they just put him to sleep and drive him safely home and also they repeatedly forget that you can&amp;#39;t fight telekinetic kid with guns, if she can see you&lt;/a&gt;  to just stupid lazy writing (&lt;a href=\"/spoiler\"&gt;high-school proffesor effortlessly explains exactly the weird-ass part of pseudo-science, that can be used in this exact case, with a fucking bug analogy&lt;/a&gt; or &lt;a href=\"/spoiler\"&gt;missing kid&amp;#39;s brother becoming a creep for like 2.5 episodes, just so he can snap some photos necesarry for the plot, after which his creepiness is never adressed again&lt;/a&gt;). I could go on, but you get the point. To be clear, I didn&amp;#39;t hate all of the writing (for example, I really enjoyed the slow and careful exposition of El&amp;#39;s background), there were just a lot of things that annoyed me.&lt;/p&gt;\n\n&lt;p&gt;Fifthly (I have honestly no idea if this is English), the pace. Okay, I gotta admit, this was good. Stuff kept happening. That&amp;#39;s the main reason why I find ST mediocre, but not bad. But it didn&amp;#39;t really made up for the rest.&lt;/p&gt;\n\n&lt;p&gt;Anyway, where am I wrong? What am I missing? I&amp;#39;d love to hear what you thing about ST and why.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, as the title says, I just finished season 1. I watched it because of recommendation from a close friend and because I saw plenty of people online just loving it. And if I were to sum my feelings about it into one word, it would probably be \"Meh\". And I would love to hear why am I wrong.\n\nTo be clear, I don't think it was bad. But I definitely didn't enjoy it as much as I expected to. I would like to note why I fell about it this way, but I will need to talk about some plotpoints. I will try to put any major ones into spoiler format, but for sure: WARNING, SPOILERS (FOR WHOLE SEASON 1 I GUESS) AHEAD!\n\nThere are a few things, that can be interesting about a series.\n\nFirstly, the main idea. Well, that's what in my opinion was the absolutely least interesting thing about ST. The \"overall concept\" was just a few clichés ([otherworld monster; supernatural kid; secret government agency=bad; a bunch of slightly bullied nerds=good](/spoiler)) melded together. Not necesarilly bad, but absolutely not anything I would find interesting.\n\nSecondly, characters. I don't say i didn't find any of the characters interesting. But, thats true just bearly: IMHO, I think just one of them is interesting - the missing kid's mother (I suck at names). Other then that I find every character one-dimensional and boring. Everybody was clearly and definitely good or bad from the very start, with basically no deviations from the first or second impression I got about them. There were two exceptions - [the missing kid's brother, who became kinda creepy](/spoiler), which I didn't find good for reasons listed two paragraphs below, and [the betterment of the douche, that dated the sister of the main kid](/spoiler), which is one of a few things during ST, that I actually enjoyed.\n\nThirdly, the atmosphere. I admit, I might have just \"not felt it\" simply because of my being eastern-european guy in my early twenties. But yeah, the atmosphere didn't seem particularly great to me.\n\nFourthly (is that a word?), the writing. OMG, there were just so many things I hated. From characters not communicating when they clearly should ([\"We're going to haunt unknown monster, that nobody believes in except for your mother, who might be the only one who saw it clearly and who is getting crazy, because noone belives her. How about we tell her about it, so she can get less mental and maybe tell us a little bit about what we should expect.\" \"Well, she might get upset, so how 'bout no?\"](/spoiler) or [when kid, who returned from the fucking nightmare dimension doesn't tell anyone (even though everyone loves and supports him) about him vomiting fucking alien slugs, that might be like super dangerous](/spoiler)), through characters being stupid (like [kids obviously not mourning, when they're absolutely supposed to by everyone else](/spoiler) or [super-secret government agency first not really able to deal with a small town sherrif that's just too curious and after he **finds out, that they're fucking experimenting on kids**, they just put him to sleep and drive him safely home and also they repeatedly forget that you can't fight telekinetic kid with guns, if she can see you](/spoiler)  to just stupid lazy writing ([high-school proffesor effortlessly explains exactly the weird-ass part of pseudo-science, that can be used in this exact case, with a fucking bug analogy](/spoiler) or [missing kid's brother becoming a creep for like 2.5 episodes, just so he can snap some photos necesarry for the plot, after which his creepiness is never adressed again](/spoiler)). I could go on, but you get the point. To be clear, I didn't hate all of the writing (for example, I really enjoyed the slow and careful exposition of El's background), there were just a lot of things that annoyed me.\n\nFifthly (I have honestly no idea if this is English), the pace. Okay, I gotta admit, this was good. Stuff kept happening. That's the main reason why I find ST mediocre, but not bad. But it didn't really made up for the rest.\n\nAnyway, where am I wrong? What am I missing? I'd love to hear what you thing about ST and why.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "SPOILERS", "id": "64zpcv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "Tohlenejsemja", "saved": false, "mod_reports": [], "name": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "approved_by": null, "over_18": false, "domain": "self.StrangerThings", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_3adlm", "edited": false, "link_flair_css_class": "spoiler", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/StrangerThings/comments/64zpcv/i_just_finished_season_1_and_i_have_no_clue_whats/", "num_reports": null, "locked": false, "stickied": false, "created": 1492047665.0, "url": "https://www.reddit.com/r/StrangerThings/comments/64zpcv/i_just_finished_season_1_and_i_have_no_clue_whats/", "author_flair_text": null, "quarantine": false, "title": "I just finished season 1 and I have no clue what's the hype about. Can you help me?", "created_utc": 1492018865.0, "distinguished": null, "media": null, "upvote_ratio": 0.4, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg69eg1", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "speedy3702", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "&gt; The \"overall concept\" was just a few clichés (otherworld monster; supernatural kid; secret government agency=bad; a bunch of slightly bullied nerds=good) melded together.\n\n*Stranger Things* has always been intended as a hommage to the works of Stephen King, Steven Spielberg, etc. from the 80s. So all these \"clichés\" that you mentioned are pretty much intentional, because part of the appeal of the show is that it is very nostalgia driven.\n\n", "edited": 1492020136.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The &amp;quot;overall concept&amp;quot; was just a few clichés (otherworld monster; supernatural kid; secret government agency=bad; a bunch of slightly bullied nerds=good) melded together.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;Stranger Things&lt;/em&gt; has always been intended as a hommage to the works of Stephen King, Steven Spielberg, etc. from the 80s. So all these &amp;quot;clichés&amp;quot; that you mentioned are pretty much intentional, because part of the appeal of the show is that it is very nostalgia driven.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg69eg1", "score_hidden": false, "stickied": false, "created": 1492048725.0, "created_utc": 1492019925.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg6f6qp", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "yinmnblues", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "It was massively hyped for me. Everyone told me I need to watch this show...for like a year. Well I finally sat down to it this past week, and it exceeded my expectations immeasurably. The cliches and the nostalgia are important.\n\nBut what's more special are the cliches that Stranger Things didn't give in to. The cliches that were avoided. I continually thought \"well this stupid thing is going to happen next, it always happens in these kinds of situations\" and then the opposite would happen and it would be completely refreshing. The story continuously was propelled forward, whereas in a network show, little hiccups for characters might take multiple episodes to resolve. The drama in ST isn't caused by roadblocks like in most shows. And I guess that's the most important thing about the show. The avoidance of the worst kinds of cliches that can milk a show's plot for season upon season.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was massively hyped for me. Everyone told me I need to watch this show...for like a year. Well I finally sat down to it this past week, and it exceeded my expectations immeasurably. The cliches and the nostalgia are important.&lt;/p&gt;\n\n&lt;p&gt;But what&amp;#39;s more special are the cliches that Stranger Things didn&amp;#39;t give in to. The cliches that were avoided. I continually thought &amp;quot;well this stupid thing is going to happen next, it always happens in these kinds of situations&amp;quot; and then the opposite would happen and it would be completely refreshing. The story continuously was propelled forward, whereas in a network show, little hiccups for characters might take multiple episodes to resolve. The drama in ST isn&amp;#39;t caused by roadblocks like in most shows. And I guess that&amp;#39;s the most important thing about the show. The avoidance of the worst kinds of cliches that can milk a show&amp;#39;s plot for season upon season.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg6f6qp", "score_hidden": false, "stickied": false, "created": 1492054681.0, "created_utc": 1492025881.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg6wthq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Arto3", "parent_id": "t1_dg695kf", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "This, the nostalgia was a big factor for what added to the magic for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This, the nostalgia was a big factor for what added to the magic for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg6wthq", "score_hidden": false, "stickied": false, "created": 1492075292.0, "created_utc": 1492046492.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg695kf", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "seeing-eye-bitch", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "For me this show is so great because of nostalgia. It reminds me of my childhood and the films I grew up with. That and I think it's a great adventure story full of mystery.\n\nIt makes sense to me that you wouldn't understand that connection since you grew up in a different culture.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me this show is so great because of nostalgia. It reminds me of my childhood and the films I grew up with. That and I think it&amp;#39;s a great adventure story full of mystery.&lt;/p&gt;\n\n&lt;p&gt;It makes sense to me that you wouldn&amp;#39;t understand that connection since you grew up in a different culture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg695kf", "score_hidden": false, "stickied": false, "created": 1492048476.0, "created_utc": 1492019676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg6jkb0", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Arto3", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "different people like different things..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;different people like different things..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg6jkb0", "score_hidden": false, "stickied": false, "created": 1492059206.0, "created_utc": 1492030406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg68xme", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "AnelloGrande", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "I don't know. I don't think the show is over hyped, but that's just me. I don't think you are wrong. It just sounds like you didn't care for the show as other people did. Doesn't make you wrong. Many people are willing to overlook the things you mention because they enjoy the show, or the nostalgia of the time period it is set in, or they like an actress or actor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know. I don&amp;#39;t think the show is over hyped, but that&amp;#39;s just me. I don&amp;#39;t think you are wrong. It just sounds like you didn&amp;#39;t care for the show as other people did. Doesn&amp;#39;t make you wrong. Many people are willing to overlook the things you mention because they enjoy the show, or the nostalgia of the time period it is set in, or they like an actress or actor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg68xme", "score_hidden": false, "stickied": false, "created": 1492048249.0, "created_utc": 1492019449.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg6br7x", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "sopholopho", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "Just because a show is popular doesn't mean everyone is going to like it. Clearly it isn't your taste. I mean, orange is the new black is crazy popular, and I don't care for it at all. I don't think there's much point  in asking everyone to justify it or explain to you why it's good-either you like it or you don't, and it clearly wasn't for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just because a show is popular doesn&amp;#39;t mean everyone is going to like it. Clearly it isn&amp;#39;t your taste. I mean, orange is the new black is crazy popular, and I don&amp;#39;t care for it at all. I don&amp;#39;t think there&amp;#39;s much point  in asking everyone to justify it or explain to you why it&amp;#39;s good-either you like it or you don&amp;#39;t, and it clearly wasn&amp;#39;t for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg6br7x", "score_hidden": false, "stickied": false, "created": 1492051137.0, "created_utc": 1492022337.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg6vizm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cbeam2112", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "It surprised me in a great way I think the 80's references are what so many people related to and the cast was incredible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It surprised me in a great way I think the 80&amp;#39;s references are what so many people related to and the cast was incredible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg6vizm", "score_hidden": false, "stickied": false, "created": 1492073693.0, "created_utc": 1492044893.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg7uo87", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xxmindtrickxx", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "Because it is really good and basically everything you've mentioned about it being bad is explained or addressed, you just didn't get it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because it is really good and basically everything you&amp;#39;ve mentioned about it being bad is explained or addressed, you just didn&amp;#39;t get it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg7uo87", "score_hidden": false, "stickied": false, "created": 1492131704.0, "created_utc": 1492102904.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg7kwxi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bxrtie", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "There were a few moments when I started liking it, then something stupid would happen. E.g. kids running from government men in vans on bikes and boy jumps into quarry as a dare. Apart from those parts it was good enough for me to return for season 2 I'd say. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There were a few moments when I started liking it, then something stupid would happen. E.g. kids running from government men in vans on bikes and boy jumps into quarry as a dare. Apart from those parts it was good enough for me to return for season 2 I&amp;#39;d say. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg7kwxi", "score_hidden": false, "stickied": false, "created": 1492120959.0, "created_utc": 1492092159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_64zpcv", "likes": null, "replies": "", "user_reports": [], "id": "dg697t1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Turtlefast27", "parent_id": "t3_64zpcv", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "I think it is slightly overhyped because it is a little cliche.  You just gotta look at it without other peoples thoughts and watch it yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it is slightly overhyped because it is a little cliche.  You just gotta look at it without other peoples thoughts and watch it yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dg697t1", "score_hidden": false, "stickied": false, "created": 1492048539.0, "created_utc": 1492019739.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]