[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "StrangerThings", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The way Will is taken by the demogorgan is strange. It unlocks his latched door. From the outside. How could it do this? (Why bother anyway it can appear behind you like it did to get Will in the end?) It would need telekinesis like Eleven to do that. This makes me think that it and Eleven are connected in a way. Maybe it&amp;#39;s an extension of her? Also she recognizes Will from a photo but as far as we know she never saw him in person. So thats more reason to believe Eleven and the Demogorgan are connected. On a final note I also thinks it&amp;#39;s weird that Will survived being taken in the first place. No one else did. So maybe its not even the demogorgan that took him. Feel free to call me out if I&amp;#39;m misremembering anything. Or if you can explain why I&amp;#39;m wrong.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The way Will is taken by the demogorgan is strange. It unlocks his latched door. From the outside. How could it do this? (Why bother anyway it can appear behind you like it did to get Will in the end?) It would need telekinesis like Eleven to do that. This makes me think that it and Eleven are connected in a way. Maybe it's an extension of her? Also she recognizes Will from a photo but as far as we know she never saw him in person. So thats more reason to believe Eleven and the Demogorgan are connected. On a final note I also thinks it's weird that Will survived being taken in the first place. No one else did. So maybe its not even the demogorgan that took him. Feel free to call me out if I'm misremembering anything. Or if you can explain why I'm wrong.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "SPOILERS", "id": "65iibu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 55, "report_reasons": null, "author": "DigitalSchism96", "saved": false, "mod_reports": [], "name": "t3_65iibu", "subreddit_name_prefixed": "r/StrangerThings", "approved_by": null, "over_18": false, "domain": "self.StrangerThings", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_3adlm", "edited": false, "link_flair_css_class": "spoiler", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/StrangerThings/comments/65iibu/something_i_noticed_when_rewatching_spoilers/", "num_reports": null, "locked": false, "stickied": false, "created": 1492281969.0, "url": "https://www.reddit.com/r/StrangerThings/comments/65iibu/something_i_noticed_when_rewatching_spoilers/", "author_flair_text": null, "quarantine": false, "title": "Something I noticed when rewatching. SPOILERS", "created_utc": 1492253169.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 55}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_65iibu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_65iibu", "likes": null, "replies": "", "user_reports": [], "id": "dgayyu5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "speedy3702", "parent_id": "t1_dgaqqom", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "&gt; I do think the Demogorgon has some telekinetic powers though.\n\nI have actually been thinking about an alternative theory that the Demorgorgon's powers were maybe not exactly telekinesis, but more similar to the ones of Magneto from *X-Men*. At least I find it noticeable that the door lock was the only occasion were it explicity used that power and that it didn't used it while fighting in the final episode.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I do think the Demogorgon has some telekinetic powers though.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have actually been thinking about an alternative theory that the Demorgorgon&amp;#39;s powers were maybe not exactly telekinesis, but more similar to the ones of Magneto from &lt;em&gt;X-Men&lt;/em&gt;. At least I find it noticeable that the door lock was the only occasion were it explicity used that power and that it didn&amp;#39;t used it while fighting in the final episode.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dgayyu5", "score_hidden": false, "stickied": false, "created": 1492309161.0, "created_utc": 1492280361.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqqom", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "HidallyDidally123", "parent_id": "t3_65iibu", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "&gt; It would need telekinesis like Eleven to do that. This makes me think that it and Eleven are connected in a way.\n\nThat is a definitely a popular theory going around. I personally don't believe it though. I do think the Demogorgon has some telekinetic powers though.\n\n&gt;Also she recognizes Will from a photo but as far as we know she never saw him in person.\n\nI think that is part of her abilities. In episode 4 Eleven has a flashback to HNL where Dr. Brenner shows her a picture of a man and asks her to find him and listen to him. Again, in episode 5, she has a flashback where Dr. Brenner shows her a picture of the Russian man who she finds when she is in the sensory deprivation tank. Finally, towards the end of the series when she first tries to find Will and Barb at the Byers' house there is a photo of Barb on the table where she attempts to find them. I think that's how she is able to find people she has never seen in person.  \n\nEdit: Words", "edited": 1492270271.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It would need telekinesis like Eleven to do that. This makes me think that it and Eleven are connected in a way.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is a definitely a popular theory going around. I personally don&amp;#39;t believe it though. I do think the Demogorgon has some telekinetic powers though.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Also she recognizes Will from a photo but as far as we know she never saw him in person.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that is part of her abilities. In episode 4 Eleven has a flashback to HNL where Dr. Brenner shows her a picture of a man and asks her to find him and listen to him. Again, in episode 5, she has a flashback where Dr. Brenner shows her a picture of the Russian man who she finds when she is in the sensory deprivation tank. Finally, towards the end of the series when she first tries to find Will and Barb at the Byers&amp;#39; house there is a photo of Barb on the table where she attempts to find them. I think that&amp;#39;s how she is able to find people she has never seen in person.  &lt;/p&gt;\n\n&lt;p&gt;Edit: Words&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dgaqqom", "score_hidden": false, "stickied": false, "created": 1492297780.0, "created_utc": 1492268980.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_65iibu", "likes": null, "replies": "", "user_reports": [], "id": "dgbgg87", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "gildme_11", "parent_id": "t3_65iibu", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "I'm thinking it kept Will alive because he had/was something capable of being an egg or an incubator for the demagorgon's offspring. Will must have gotten away from it in the upside down and hid. He picked the fort behind his house because it was close and familiar and he could contact his mom. (I'm kind of confused as to how he knew  and was able to manipulate the lights in the house.) Im sure the fact that she touched the demagorgon gave it the ability to track her powers but it could already track the smell of  blood. It showed up twice right after she went somewhere. It probably gets a stronger sense of her in the astral plane, which is why when she finds Will hiding, it finds him soon after because she accidentally led it to him. Then it got a big wiff of her when she killed all those people at the school with her powers which left blood everywhere aswell. ", "edited": 1492358215.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m thinking it kept Will alive because he had/was something capable of being an egg or an incubator for the demagorgon&amp;#39;s offspring. Will must have gotten away from it in the upside down and hid. He picked the fort behind his house because it was close and familiar and he could contact his mom. (I&amp;#39;m kind of confused as to how he knew  and was able to manipulate the lights in the house.) Im sure the fact that she touched the demagorgon gave it the ability to track her powers but it could already track the smell of  blood. It showed up twice right after she went somewhere. It probably gets a stronger sense of her in the astral plane, which is why when she finds Will hiding, it finds him soon after because she accidentally led it to him. Then it got a big wiff of her when she killed all those people at the school with her powers which left blood everywhere aswell. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dgbgg87", "score_hidden": false, "stickied": false, "created": 1492333519.0, "created_utc": 1492304719.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_3adlm", "removal_reason": null, "link_id": "t3_65iibu", "likes": null, "replies": "", "user_reports": [], "id": "dgaku0o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "gokyoungwan", "parent_id": "t3_65iibu", "subreddit_name_prefixed": "r/StrangerThings", "controversiality": 0, "body": "I think you're right that the Demogorgen and Eleven are connected somehow, but I don't have any solid theories for in what way. Will hid from the demogorgen for as long as he could so I believe that's how he survived and no one else did. Barb was last seen in Steve's pool and ended up there in the upside down. Will was last seen in the shed behind his house, but when Eleven visits him he's hiding in Castle Byers. Maybe the Demogorgen didn't get Will initially, a portal may have opened and that allowed it to appear behind him and for him to get away so quickly? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re right that the Demogorgen and Eleven are connected somehow, but I don&amp;#39;t have any solid theories for in what way. Will hid from the demogorgen for as long as he could so I believe that&amp;#39;s how he survived and no one else did. Barb was last seen in Steve&amp;#39;s pool and ended up there in the upside down. Will was last seen in the shed behind his house, but when Eleven visits him he&amp;#39;s hiding in Castle Byers. Maybe the Demogorgen didn&amp;#39;t get Will initially, a portal may have opened and that allowed it to appear behind him and for him to get away so quickly? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StrangerThings", "name": "t1_dgaku0o", "score_hidden": false, "stickied": false, "created": 1492286904.0, "created_utc": 1492258104.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]