[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "boardgames", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Note: I wrote this and the &lt;a href=\"http://boardgamefightclub.com/articles/Where-Are-All-The-Legacy-Games/\"&gt;full article can be found here&lt;/a&gt;, but I figured I&amp;#39;d just format here it for you all, since nobody got time for following links.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll spare you a long backstory on who I am: My name is Jaime Barriga, and after 4 years of work, I&amp;#39;m still plugging away on a Legacy game I created called &amp;quot;QuickFight: A Legacy Game.&amp;quot; When I started, there were a handful of us in the whole world doing Legacy game design, and that number has now exploded to like... 15.&lt;/p&gt;\n\n&lt;p&gt;One of the questions I get regularly is &lt;strong&gt;&amp;quot;why aren&amp;#39;t there more Legacy games?&amp;quot;&lt;/strong&gt; And so please allow me to regale you with my own personal take on the matter.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Legacy games are inherently more complicated than their static counterparts&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s look at Chess:&lt;/p&gt;\n\n&lt;p&gt;White goes first and has 20 possible moves to make, creating the potential for 20 possible game states. Then, from each of those initial 20 states, Black has 20 possible moves to make.&lt;/p&gt;\n\n&lt;p&gt;This means there are 400 (20 times 20) potential ways for the board to look after 2 moves.&lt;/p&gt;\n\n&lt;p&gt;Each new move after that balloons that number. Tons of outcomes, lots of room for strategy. This is why you can rank people in Chess. No one can possibly prepare for all the game states.&lt;/p&gt;\n\n&lt;p&gt;But at the end of a chess game you start over from scratch. Back to the initial game state every time.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Legacy games do not do this.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s say you made a chess variant where each time you played, you threw your first piece to be captured into the woodchipper (a common device every gamer keeps in their home).&lt;/p&gt;\n\n&lt;p&gt;Game 2 now has a board with 30 of the original 32 pieces on it. Which means that game 2 &lt;strong&gt;starts&lt;/strong&gt; with the potential for 256 unique layouts. And if White and Black can make the same 20 moves to start, game 2 now has...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;102,400 (256 times 20 times 20) possible game states&lt;/strong&gt;. Compare this to &lt;strong&gt;400 possible game stats&lt;/strong&gt; at the same point in game 1.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s just with one rule adjustment! Imagine how many game states are possible by the start of the final game of Pandemic Legacy or Seafall!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;This inherent complexity means that someone will eventually find a way to break your system.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;For me, this has happened no fewer than 3 times in QuickFight. Some playtester will come along and either&lt;/p&gt;\n\n&lt;p&gt;A.  Get super lucky&lt;/p&gt;\n\n&lt;p&gt;B.  Get super smart&lt;/p&gt;\n\n&lt;p&gt;and bring the game to a state where it is now broken, and no one wants to play anymore. Once this happens, you need to determine if a small patch can fix things, or if the problem you&amp;#39;re seeing in game 6 is aaaaactually related to a flaw in the game design that needs to be addressed in game 1. Which now means you have to &lt;strong&gt;rewrite your whole game again&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;It sucks, and I have done this 3 times.&lt;/p&gt;\n\n&lt;p&gt;I used to think that I couldn&amp;#39;t allow for a situation where the players can break the game. In my head, that&amp;#39;s still my ideal. But the honest truth is that I&amp;#39;m not sure you can account for this in 100% of the cases. The best I can do is playtest with as many people as possible, so I can get a handle on how different groups diverge, and try to account for those situations.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Ok, but why aren&amp;#39;t there more Legacy Games?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;From my standpoint, the answer is this: This natural complexity of a Legacy Game leads to a herculean amount of development and testing time.&lt;/p&gt;\n\n&lt;p&gt;As a reference point, I&amp;#39;ve been working on QuickFight for 4 years. It&amp;#39;s a side project; I&amp;#39;m not a full-time game designer. But when I took some time and converted the game into a non-Legacy version (called Corporate Raiders), I did it in just shy over 1 year. Same basic mechanics to start, but waaaaay faster to design and balance because you start over the same way every time. Here is a timeline of the progress on my 2 games:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://boardgamefightclub.com/img/dev-timeline.png\"&gt;http://boardgamefightclub.com/img/dev-timeline.png&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Any Legacy Game is going to take &lt;strong&gt;at least&lt;/strong&gt; 2 or 3 times longer to design than a standard board game. And you will need a constant stream of playtesters because instead of testing the same game once or twice, the same group needs to playtest like, 10 or more constantly changing games. Most playtesters simply won&amp;#39;t stick through to the end. And honestly, how many game designers are willing to devote way more time and energy into a Legacy game versus designing (and maybe even releasing) 2 to 3 games in the same span of time? The risk is gigantic, for a game that might not even succeed in the market.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;But it doesn&amp;#39;t have to be this way&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When I started this, I had a dream of converting my favorite game at the time into a Legacy Game and just seeing where that journey took me. We&amp;#39;re here now, 4 years later, and I still don&amp;#39;t have a published game, and I&amp;#39;m still a bit of a nobody. But I regularly sit down and work on it, and I&amp;#39;m proud to say that I&amp;#39;ve built like 50% of a full Legacy game from scratch and I&amp;#39;m going to see it through.&lt;/p&gt;\n\n&lt;p&gt;Nobody gets into board game design for the money. And if you do, seriously, what&amp;#39;s wrong with you? You could learn programming in like, half the time and make bank. You goose.&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m trying to say here is that there&amp;#39;s gap in the board game world right now, and I think it&amp;#39;s going to take more people who love playing board games to stand up and say &amp;quot;you know what? I can&amp;#39;t let these 15 people have all the fun so I&amp;#39;m going to make my own Legacy Game!&amp;quot; There are plenty of resources and people to help, and no two people are ever going to design the same game. &lt;/p&gt;\n\n&lt;p&gt;And if you decide to dive in, I&amp;#39;ll be there when you have questions.&lt;/p&gt;\n\n&lt;p&gt;So am I wrong?  Am I right?  I’d love to hear your take on this!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "*Note: I wrote this and the [full article can be found here](http://boardgamefightclub.com/articles/Where-Are-All-The-Legacy-Games/), but I figured I'd just format here it for you all, since nobody got time for following links.*\n\nI'll spare you a long backstory on who I am: My name is Jaime Barriga, and after 4 years of work, I'm still plugging away on a Legacy game I created called \"QuickFight: A Legacy Game.\" When I started, there were a handful of us in the whole world doing Legacy game design, and that number has now exploded to like... 15.\n\nOne of the questions I get regularly is **\"why aren't there more Legacy games?\"** And so please allow me to regale you with my own personal take on the matter.\n\n**Legacy games are inherently more complicated than their static counterparts**\n\nLet's look at Chess:\n\nWhite goes first and has 20 possible moves to make, creating the potential for 20 possible game states. Then, from each of those initial 20 states, Black has 20 possible moves to make.\n\nThis means there are 400 (20 times 20) potential ways for the board to look after 2 moves.\n\nEach new move after that balloons that number. Tons of outcomes, lots of room for strategy. This is why you can rank people in Chess. No one can possibly prepare for all the game states.\n\nBut at the end of a chess game you start over from scratch. Back to the initial game state every time.\n\n**Legacy games do not do this.**\n\nLet's say you made a chess variant where each time you played, you threw your first piece to be captured into the woodchipper (a common device every gamer keeps in their home).\n\nGame 2 now has a board with 30 of the original 32 pieces on it. Which means that game 2 **starts** with the potential for 256 unique layouts. And if White and Black can make the same 20 moves to start, game 2 now has...\n\n**102,400 (256 times 20 times 20) possible game states**. Compare this to **400 possible game stats** at the same point in game 1.\n\nAnd that's just with one rule adjustment! Imagine how many game states are possible by the start of the final game of Pandemic Legacy or Seafall!\n\n**This inherent complexity means that someone will eventually find a way to break your system.**\n\nFor me, this has happened no fewer than 3 times in QuickFight. Some playtester will come along and either\n\nA.  Get super lucky\n\nB.  Get super smart\n\nand bring the game to a state where it is now broken, and no one wants to play anymore. Once this happens, you need to determine if a small patch can fix things, or if the problem you're seeing in game 6 is aaaaactually related to a flaw in the game design that needs to be addressed in game 1. Which now means you have to **rewrite your whole game again**.\n\nIt sucks, and I have done this 3 times.\n\nI used to think that I couldn't allow for a situation where the players can break the game. In my head, that's still my ideal. But the honest truth is that I'm not sure you can account for this in 100% of the cases. The best I can do is playtest with as many people as possible, so I can get a handle on how different groups diverge, and try to account for those situations.\n\n**Ok, but why aren't there more Legacy Games?**\n\nFrom my standpoint, the answer is this: This natural complexity of a Legacy Game leads to a herculean amount of development and testing time.\n\nAs a reference point, I've been working on QuickFight for 4 years. It's a side project; I'm not a full-time game designer. But when I took some time and converted the game into a non-Legacy version (called Corporate Raiders), I did it in just shy over 1 year. Same basic mechanics to start, but waaaaay faster to design and balance because you start over the same way every time. Here is a timeline of the progress on my 2 games:\n\nhttp://boardgamefightclub.com/img/dev-timeline.png\n\nAny Legacy Game is going to take **at least** 2 or 3 times longer to design than a standard board game. And you will need a constant stream of playtesters because instead of testing the same game once or twice, the same group needs to playtest like, 10 or more constantly changing games. Most playtesters simply won't stick through to the end. And honestly, how many game designers are willing to devote way more time and energy into a Legacy game versus designing (and maybe even releasing) 2 to 3 games in the same span of time? The risk is gigantic, for a game that might not even succeed in the market.\n\n**But it doesn't have to be this way**\n\nWhen I started this, I had a dream of converting my favorite game at the time into a Legacy Game and just seeing where that journey took me. We're here now, 4 years later, and I still don't have a published game, and I'm still a bit of a nobody. But I regularly sit down and work on it, and I'm proud to say that I've built like 50% of a full Legacy game from scratch and I'm going to see it through.\n\nNobody gets into board game design for the money. And if you do, seriously, what's wrong with you? You could learn programming in like, half the time and make bank. You goose.\n\nWhat I'm trying to say here is that there's gap in the board game world right now, and I think it's going to take more people who love playing board games to stand up and say \"you know what? I can't let these 15 people have all the fun so I'm going to make my own Legacy Game!\" There are plenty of resources and people to help, and no two people are ever going to design the same game. \n\nAnd if you decide to dive in, I'll be there when you have questions.\n\nSo am I wrong?  Am I right?  I’d love to hear your take on this!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64zbqs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 41, "report_reasons": null, "author": "JB4GDI", "saved": false, "mod_reports": [], "name": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "approved_by": null, "over_18": false, "domain": "self.boardgames", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/8LBSR2O7gKCSOVlYJccT4S6IS_gqFmSsr2dGLwQ8ukk.png?s=9cf3a5aed9b42d442956ac81cfa50940", "width": 1264, "height": 391}, "resolutions": [{"url": "https://i.redditmedia.com/8LBSR2O7gKCSOVlYJccT4S6IS_gqFmSsr2dGLwQ8ukk.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=5ec78ab00a6d0db15385c7fb66317053", "width": 108, "height": 33}, {"url": "https://i.redditmedia.com/8LBSR2O7gKCSOVlYJccT4S6IS_gqFmSsr2dGLwQ8ukk.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=1c0493f09d9ff214c13b0a15ebce100b", "width": 216, "height": 66}, {"url": "https://i.redditmedia.com/8LBSR2O7gKCSOVlYJccT4S6IS_gqFmSsr2dGLwQ8ukk.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=8c08d8e5c3bbc86dbcf44b07b5b92617", "width": 320, "height": 98}, {"url": "https://i.redditmedia.com/8LBSR2O7gKCSOVlYJccT4S6IS_gqFmSsr2dGLwQ8ukk.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=2f9a1f5340bb6219537960539cac4097", "width": 640, "height": 197}, {"url": "https://i.redditmedia.com/8LBSR2O7gKCSOVlYJccT4S6IS_gqFmSsr2dGLwQ8ukk.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=b980ea1358a70ce6c364568cd406edce", "width": 960, "height": 296}, {"url": "https://i.redditmedia.com/8LBSR2O7gKCSOVlYJccT4S6IS_gqFmSsr2dGLwQ8ukk.png?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=a0ba7185b7ac27374bfb6b91ee39c39e", "width": 1080, "height": 334}], "variants": {}, "id": "u1YLElwrI3hiYQYNZC0kKhNjiZFogGkgkNa0opYWc2w"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2qmjp", "edited": 1492016775.0, "link_flair_css_class": null, "author_flair_css_class": "custom", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/boardgames/comments/64zbqs/why_arent_there_more_legacy_games/", "num_reports": null, "locked": false, "stickied": false, "created": 1492044197.0, "url": "https://www.reddit.com/r/boardgames/comments/64zbqs/why_arent_there_more_legacy_games/", "author_flair_text": "Designer - QuickFightGame.com", "quarantine": false, "title": "Why aren't there more Legacy Games?", "created_utc": 1492015397.0, "distinguished": null, "media": null, "upvote_ratio": 0.71, "num_comments": 83, "visited": false, "subreddit_type": "public", "ups": 41}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7ahai", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg6nr18", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "So you're saying that a game being hyped up is not enough for a publisher to sell a ton of them?\n\nThe reasons are definitely more complex than a single issue, but I don't think \"the market being un-proven\" is a big thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you&amp;#39;re saying that a game being hyped up is not enough for a publisher to sell a ton of them?&lt;/p&gt;\n\n&lt;p&gt;The reasons are definitely more complex than a single issue, but I don&amp;#39;t think &amp;quot;the market being un-proven&amp;quot; is a big thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7ahai", "score_hidden": false, "stickied": false, "created": 1492098177.0, "created_utc": 1492069377.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nr18", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "mxzf", "parent_id": "t1_dg6mbrv", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "BGG ratings really aren't a good metric of how much demand there is for a game.  They're more of a metric of how hyped a game is.  It's not much more meaningful than anecdotes when it comes to judging market demand.\n\nAnd the reason why publishers are more willing to print other types of games is that they're a proven market over the last few decades (and they still err on the side of printing too few, which is why we end up with shortages of games inbetween print runs).  \n\nI'm not saying that either one is the entirety of the reason, but it's far more than just development time.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;BGG ratings really aren&amp;#39;t a good metric of how much demand there is for a game.  They&amp;#39;re more of a metric of how hyped a game is.  It&amp;#39;s not much more meaningful than anecdotes when it comes to judging market demand.&lt;/p&gt;\n\n&lt;p&gt;And the reason why publishers are more willing to print other types of games is that they&amp;#39;re a proven market over the last few decades (and they still err on the side of printing too few, which is why we end up with shortages of games inbetween print runs).  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying that either one is the entirety of the reason, but it&amp;#39;s far more than just development time.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6nr18", "score_hidden": false, "stickied": false, "created": 1492064157.0, "created_utc": 1492035357.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7hmcp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "werfmark", "parent_id": "t1_dg79tlk", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "so it's just a campaign game. Take any dungeon crawler campaign game and your characters level over time, new stuff get's unlocked etc. There is no clearcut line between the two, plenty of campaign games use envelops and all the legacy stuff. \n\nThe only somewhat unique legacy thing is the inability to reset, ie using stickers but they can be replaced in most games. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;so it&amp;#39;s just a campaign game. Take any dungeon crawler campaign game and your characters level over time, new stuff get&amp;#39;s unlocked etc. There is no clearcut line between the two, plenty of campaign games use envelops and all the legacy stuff. &lt;/p&gt;\n\n&lt;p&gt;The only somewhat unique legacy thing is the inability to reset, ie using stickers but they can be replaced in most games. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7hmcp", "score_hidden": false, "stickied": false, "created": 1492116366.0, "created_utc": 1492087566.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79tlk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "badlyjester", "parent_id": "t1_dg70rhq", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; I haven't played gloomhaven but iirc the legacy aspect isn't forced. It's primarily a campaign game yes?\n\nIt's decidedly a legacy game in the sense that the campaign takes place in a world that changes according to the party's actions, and that there are plenty of classes as well as envelopes to unlock. However, that legacy aspect isn't \"forced\" in the sense that the designer did everything he could to provide reset instructions and materials (printable tracker sheets on BGG etc.).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I haven&amp;#39;t played gloomhaven but iirc the legacy aspect isn&amp;#39;t forced. It&amp;#39;s primarily a campaign game yes?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s decidedly a legacy game in the sense that the campaign takes place in a world that changes according to the party&amp;#39;s actions, and that there are plenty of classes as well as envelopes to unlock. However, that legacy aspect isn&amp;#39;t &amp;quot;forced&amp;quot; in the sense that the designer did everything he could to provide reset instructions and materials (printable tracker sheets on BGG etc.).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg79tlk", "score_hidden": false, "stickied": false, "created": 1492096350.0, "created_utc": 1492067550.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70rhq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "large__father", "parent_id": "t1_dg6mbrv", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I think it's important to note that Pandemic Legacy is still pandemic, a well regarded game in its own right. Risk Legacy fixed many of the issues gamers had with risk in addition to adding Legacy components. Neither of those successes are surprising to me.\n\nI haven't played gloomhaven but iirc the legacy aspect isn't forced. It's primarily a campaign game yes?\n\n&gt;Let me ask the other way around: do publishers err on the side of \"let's not print too many area control games/war games/tile-laying games/worker placement games\"? In other words: it would be a first for publishers to be all of the same opinion of not jumping on a bandwagon.\n\nThey might. If a publisher had a hugely successful card game they might not want to bite into their own audience with another very similar game directly after. Its probably true that they don't care/know/worry about what other publishers are doing but you can bet they are spacing out their own catalogues. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s important to note that Pandemic Legacy is still pandemic, a well regarded game in its own right. Risk Legacy fixed many of the issues gamers had with risk in addition to adding Legacy components. Neither of those successes are surprising to me.&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t played gloomhaven but iirc the legacy aspect isn&amp;#39;t forced. It&amp;#39;s primarily a campaign game yes?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Let me ask the other way around: do publishers err on the side of &amp;quot;let&amp;#39;s not print too many area control games/war games/tile-laying games/worker placement games&amp;quot;? In other words: it would be a first for publishers to be all of the same opinion of not jumping on a bandwagon.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They might. If a publisher had a hugely successful card game they might not want to bite into their own audience with another very similar game directly after. Its probably true that they don&amp;#39;t care/know/worry about what other publishers are doing but you can bet they are spacing out their own catalogues. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg70rhq", "score_hidden": false, "stickied": false, "created": 1492080211.0, "created_utc": 1492051411.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mbrv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg68hiz", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I would say that the facts that **Pandemic Legacy** game is at #1 on BGG (and has been for some time), **Gloomhaven** is on #8 and **Risk Legacy** is on #171, are ample non-anecdotal evidence for the market demand for legacy games.\n\nLet me ask the other way around: do publishers err on the side of \"let's not print too many area control games/war games/tile-laying games/worker placement games\"? In other words: it would be a first for publishers to be all of the same opinion of not jumping on a bandwagon.\n\nI think the reason is actually much simpler: it takes a lot of time to make a good Legacy game, and we'll see quite a few in the next months and years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say that the facts that &lt;strong&gt;Pandemic Legacy&lt;/strong&gt; game is at #1 on BGG (and has been for some time), &lt;strong&gt;Gloomhaven&lt;/strong&gt; is on #8 and &lt;strong&gt;Risk Legacy&lt;/strong&gt; is on #171, are ample non-anecdotal evidence for the market demand for legacy games.&lt;/p&gt;\n\n&lt;p&gt;Let me ask the other way around: do publishers err on the side of &amp;quot;let&amp;#39;s not print too many area control games/war games/tile-laying games/worker placement games&amp;quot;? In other words: it would be a first for publishers to be all of the same opinion of not jumping on a bandwagon.&lt;/p&gt;\n\n&lt;p&gt;I think the reason is actually much simpler: it takes a lot of time to make a good Legacy game, and we&amp;#39;ll see quite a few in the next months and years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6mbrv", "score_hidden": false, "stickied": false, "created": 1492062408.0, "created_utc": 1492033608.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7o3js", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ikkleste", "parent_id": "t1_dg68hiz", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "It's odd, because while you may be right that the market is limited, the market that's there is crying out for more choice. We've done risk legacy and loved it (even though it kinda broke on us by about game 11.) I'm looking for more legacy action but Pandemic doesn't go down that will with our group, and seafall looks a bit meh and I've not read great things. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s odd, because while you may be right that the market is limited, the market that&amp;#39;s there is crying out for more choice. We&amp;#39;ve done risk legacy and loved it (even though it kinda broke on us by about game 11.) I&amp;#39;m looking for more legacy action but Pandemic doesn&amp;#39;t go down that will with our group, and seafall looks a bit meh and I&amp;#39;ve not read great things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7o3js", "score_hidden": false, "stickied": false, "created": 1492124677.0, "created_utc": 1492095877.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68hiz", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "mxzf", "parent_id": "t1_dg6757a", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; Just because one person does or does not like the Legacy format doesn't mean that demand is or isn't there.\n\nThat's why anecdotes one way or the other don't help much.  On the whole though, it doesn't look like there's significantly more demand than is being filled currently.  If legacy game devs go too heavy in making such games, they'll flood the market and there'll be a *lot* of man-hours of development that go to waste due to saturated demand.  \n\nI think they're wise to err on the side of not flooding the market in that regard.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Just because one person does or does not like the Legacy format doesn&amp;#39;t mean that demand is or isn&amp;#39;t there.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s why anecdotes one way or the other don&amp;#39;t help much.  On the whole though, it doesn&amp;#39;t look like there&amp;#39;s significantly more demand than is being filled currently.  If legacy game devs go too heavy in making such games, they&amp;#39;ll flood the market and there&amp;#39;ll be a &lt;em&gt;lot&lt;/em&gt; of man-hours of development that go to waste due to saturated demand.  &lt;/p&gt;\n\n&lt;p&gt;I think they&amp;#39;re wise to err on the side of not flooding the market in that regard.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg68hiz", "score_hidden": false, "stickied": false, "created": 1492047804.0, "created_utc": 1492019004.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg67qyl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JB4GDI", "parent_id": "t1_dg6757a", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Yeah, there are people on both sides of the fence, and this article is more to address folks like you, who love the Legacy format but are like \"why are there still so few games to choose from?\"\n\nTo /u/Grey-Ferret's 'reset' point, the best option I have is that once you have finished a campaign, you can play your deck against other people who have also finished the campaign.  But I think the definition of the genre itself means you'll never have a 'reset' button.  Part of the Legacy experience is not knowing what the unlock packets are going to do on your first time around.  Once you know that, you'll always have an advantage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, there are people on both sides of the fence, and this article is more to address folks like you, who love the Legacy format but are like &amp;quot;why are there still so few games to choose from?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To &lt;a href=\"/u/Grey-Ferret\"&gt;/u/Grey-Ferret&lt;/a&gt;&amp;#39;s &amp;#39;reset&amp;#39; point, the best option I have is that once you have finished a campaign, you can play your deck against other people who have also finished the campaign.  But I think the definition of the genre itself means you&amp;#39;ll never have a &amp;#39;reset&amp;#39; button.  Part of the Legacy experience is not knowing what the unlock packets are going to do on your first time around.  Once you know that, you&amp;#39;ll always have an advantage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg67qyl", "score_hidden": false, "stickied": false, "created": 1492047064.0, "created_utc": 1492018264.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6swnb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "omnipotentsco", "parent_id": "t1_dg6nr3v", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "That's actually the way I see more Legacy games going. A base game with a legacy game expansion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s actually the way I see more Legacy games going. A base game with a legacy game expansion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6swnb", "score_hidden": false, "stickied": false, "created": 1492070545.0, "created_utc": 1492041745.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nr3v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aexia", "parent_id": "t1_dg6757a", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "There's the Netrunner expansion that has a legacy-style campaign set in addition to a large set of normal cards that can be used outside of the campaign.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s the Netrunner expansion that has a legacy-style campaign set in addition to a large set of normal cards that can be used outside of the campaign.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6nr3v", "score_hidden": false, "stickied": false, "created": 1492064160.0, "created_utc": 1492035360.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6757a", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "omnipotentsco", "parent_id": "t1_dg66jiy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "See, I'm on the other side of the fence:\n\nI feel there aren't enough Legacy games around. Anything that has a \"reset\" button honestly is just another campaign game, and not really a legacy game.\n\nThe only games that are true Legacy games that I can think of off hand are:\n\nRisk Legacy\nPandemic Legacy\nSeafall\nWe Didn't Playtest this at All: Legacy\n\nJust because one person does or does not like the Legacy format doesn't mean that demand is or isn't there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See, I&amp;#39;m on the other side of the fence:&lt;/p&gt;\n\n&lt;p&gt;I feel there aren&amp;#39;t enough Legacy games around. Anything that has a &amp;quot;reset&amp;quot; button honestly is just another campaign game, and not really a legacy game.&lt;/p&gt;\n\n&lt;p&gt;The only games that are true Legacy games that I can think of off hand are:&lt;/p&gt;\n\n&lt;p&gt;Risk Legacy\nPandemic Legacy\nSeafall\nWe Didn&amp;#39;t Playtest this at All: Legacy&lt;/p&gt;\n\n&lt;p&gt;Just because one person does or does not like the Legacy format doesn&amp;#39;t mean that demand is or isn&amp;#39;t there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6757a", "score_hidden": false, "stickied": false, "created": 1492046464.0, "created_utc": 1492017664.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg79w42", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Kolibri", "parent_id": "t1_dg775iy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Eh, that seems more a difference in presentation than a fundamental difference in design. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, that seems more a difference in presentation than a fundamental difference in design. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg79w42", "score_hidden": false, "stickied": false, "created": 1492096535.0, "created_utc": 1492067735.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg77d96", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "WeaverAishiteruze", "parent_id": "t1_dg775iy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "With my most-played campaign game, KD:M, you get new characters with new abilities frequently throughout the game. There's tons of spoilers, monsters you haven't fought yet, pages in the book you haven't read, equipment you haven't unlocked. You don't have packets, you do go to new pages to see new content, including story events.\n\nThey're not different no matter how much you want them to be.", "edited": 1492062058.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;With my most-played campaign game, KD:M, you get new characters with new abilities frequently throughout the game. There&amp;#39;s tons of spoilers, monsters you haven&amp;#39;t fought yet, pages in the book you haven&amp;#39;t read, equipment you haven&amp;#39;t unlocked. You don&amp;#39;t have packets, you do go to new pages to see new content, including story events.&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re not different no matter how much you want them to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg77d96", "score_hidden": false, "stickied": false, "created": 1492090448.0, "created_utc": 1492061648.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7bz1j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "juhaniit", "parent_id": "t1_dg775iy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "New characters and factions to come across can be implemented just as easily in campaign game.\n\nWhen it comes to spoilers and mysteries, the only difference (as far as I can tell) is that in legacy games the future events are in sealed envelopes and in campaign games in the campaign booklet. So as long as you don't read forward in the book, the progress of the campaign is just as much of a mysterious surprise as a closed envelope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;New characters and factions to come across can be implemented just as easily in campaign game.&lt;/p&gt;\n\n&lt;p&gt;When it comes to spoilers and mysteries, the only difference (as far as I can tell) is that in legacy games the future events are in sealed envelopes and in campaign games in the campaign booklet. So as long as you don&amp;#39;t read forward in the book, the progress of the campaign is just as much of a mysterious surprise as a closed envelope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7bz1j", "score_hidden": false, "stickied": false, "created": 1492102617.0, "created_utc": 1492073817.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg775iy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rlbond86", "parent_id": "t1_dg7712i", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "You don't suddenly get an entirely new faction mid-game. There are no spoilers. There are no mysterious packets to open.\n\nThey're not the same no matter how much you want them to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t suddenly get an entirely new faction mid-game. There are no spoilers. There are no mysterious packets to open.&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re not the same no matter how much you want them to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg775iy", "score_hidden": false, "stickied": false, "created": 1492090000.0, "created_utc": 1492061200.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7712i", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "WeaverAishiteruze", "parent_id": "t1_dg73oo7", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Like choosing a new mission type, fighting new monsters, getting new equipment... all of which have their own rules and mechanisms.\n\nThe only difference is Legacy has permanence. You get to see a physical representation of your progress that isn't jotted down on paper. If you don't care about that, then it offers nothing over a standard campaign.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like choosing a new mission type, fighting new monsters, getting new equipment... all of which have their own rules and mechanisms.&lt;/p&gt;\n\n&lt;p&gt;The only difference is Legacy has permanence. You get to see a physical representation of your progress that isn&amp;#39;t jotted down on paper. If you don&amp;#39;t care about that, then it offers nothing over a standard campaign.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7712i", "score_hidden": false, "stickied": false, "created": 1492089759.0, "created_utc": 1492060959.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73oo7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "rlbond86", "parent_id": "t1_dg6lxtw", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; Literally the only difference between something like Descent and Pandemic: Legacy, is that one streamlines the paper-tracking process with stickers (and also kills its replay/resale value).\n\nLegacy games introduce entirely new rules and mechanics. It's not the same at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Literally the only difference between something like Descent and Pandemic: Legacy, is that one streamlines the paper-tracking process with stickers (and also kills its replay/resale value).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Legacy games introduce entirely new rules and mechanics. It&amp;#39;s not the same at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg73oo7", "score_hidden": false, "stickied": false, "created": 1492084271.0, "created_utc": 1492055471.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6lxtw", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "WeaverAishiteruze", "parent_id": "t1_dg66jiy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "They're called campaign games. Literally the only difference between something like Descent and Pandemic: Legacy, is that one streamlines the paper-tracking process with stickers (and also kills its replay/resale value).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re called campaign games. Literally the only difference between something like Descent and Pandemic: Legacy, is that one streamlines the paper-tracking process with stickers (and also kills its replay/resale value).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6lxtw", "score_hidden": false, "stickied": false, "created": 1492061941.0, "created_utc": 1492033141.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6iso5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RoarShock", "parent_id": "t1_dg66jiy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; Legacy needs to figure out a way to include a \"Reset\" button to allow us to share this experience with all of our friends and not have to pick favorites.\n\nOr, for that matter, to play scenario 10 with people who weren't there for the first 9 games. I don't have a consistent group save for my wife, but Daviau's legacy games seem like they really want a steady party to be there for the whole ride.\n\nGloomhaven makes a good stride in this regard, but it still has a barrier in its learning curve. It's a hard enough game to learn when you're playing the intro scenario, let alone playing a developed character against advanced monsters with special effects.\n\nI wonder if there's a way for a legacy game to meaningfully change the board and pieces between games without a finite \"plot\" hidden in surprise boxes. Hypothetically, I bet cards with Mystic Vale sleeves could do it, but to OP's point, I don't know how you would balance it. Maybe a self-balancing mechanic like an auction or a draft?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Legacy needs to figure out a way to include a &amp;quot;Reset&amp;quot; button to allow us to share this experience with all of our friends and not have to pick favorites.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Or, for that matter, to play scenario 10 with people who weren&amp;#39;t there for the first 9 games. I don&amp;#39;t have a consistent group save for my wife, but Daviau&amp;#39;s legacy games seem like they really want a steady party to be there for the whole ride.&lt;/p&gt;\n\n&lt;p&gt;Gloomhaven makes a good stride in this regard, but it still has a barrier in its learning curve. It&amp;#39;s a hard enough game to learn when you&amp;#39;re playing the intro scenario, let alone playing a developed character against advanced monsters with special effects.&lt;/p&gt;\n\n&lt;p&gt;I wonder if there&amp;#39;s a way for a legacy game to meaningfully change the board and pieces between games without a finite &amp;quot;plot&amp;quot; hidden in surprise boxes. Hypothetically, I bet cards with Mystic Vale sleeves could do it, but to OP&amp;#39;s point, I don&amp;#39;t know how you would balance it. Maybe a self-balancing mechanic like an auction or a draft?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6iso5", "score_hidden": false, "stickied": false, "created": 1492058392.0, "created_utc": 1492029592.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7hiag", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "werfmark", "parent_id": "t1_dg66jiy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "legacy games with a reset have existed for ages, it's just a campaign game. \n\nLegacy is just a gimmick with stickers and the like that did really well on Risk and Pandemic but it's hardly new. \n\nA lot of people already shown legacy overkill and can't be bothered with all the new fluff like it. Some newer campaign/legacy games are also easier to reset. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;legacy games with a reset have existed for ages, it&amp;#39;s just a campaign game. &lt;/p&gt;\n\n&lt;p&gt;Legacy is just a gimmick with stickers and the like that did really well on Risk and Pandemic but it&amp;#39;s hardly new. &lt;/p&gt;\n\n&lt;p&gt;A lot of people already shown legacy overkill and can&amp;#39;t be bothered with all the new fluff like it. Some newer campaign/legacy games are also easier to reset. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7hiag", "score_hidden": false, "stickied": false, "created": 1492116186.0, "created_utc": 1492087386.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6rr17", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jack_Shandy", "parent_id": "t1_dg66jiy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I think a game that is designed to encourage play with many different groups would be amazing. The West Marches is an example of how a game like that could work. It's about a bunch of different player characters who come in and out, while the world itself remains consistent.\n\nhttp://arsludi.lamemage.com/index.php/78/grand-experiments-west-marches/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a game that is designed to encourage play with many different groups would be amazing. The West Marches is an example of how a game like that could work. It&amp;#39;s about a bunch of different player characters who come in and out, while the world itself remains consistent.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://arsludi.lamemage.com/index.php/78/grand-experiments-west-marches/\"&gt;http://arsludi.lamemage.com/index.php/78/grand-experiments-west-marches/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6rr17", "score_hidden": false, "stickied": false, "created": 1492069107.0, "created_utc": 1492040307.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg99l9l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "orionsbelt05", "parent_id": "t1_dg66jiy", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I think actual physical transformation of a Legacy game is core to the idea of it, but I agree that I'd prefer the games more if they allowed for games to be played with whomever, whenever. I remember playing a couple games of **Risk: Legacy** that a friend brought over, and he went on to play the next 19 or so games with other people in his home state. It was great. There didn't seem to be any storyline you had to follow or any major mechanics that complicated the game for anyone new coming into it. It was just \"Risk, but on a board that is a bit unique and personalized\". If that intrigued you, as a new player jumping in, you could ask some questions, kind of like exploring the \"lore\" of a game like Dark Souls.\n\nI think the best way to craft a Legacy game is to make it so that it evolves and changes permanently, but not on such a scripted path, like **Pandemic Legacy** did. Just give us a game that reacts to our playstyle and becomes unique to us, but with slight changes that are quick to explain to anyone new who may be joining. The Alien race in Rick Legacy is a great example. It puts a new Island on the board and a new race to choose from, but neither of these are complicated changes that would spin the head of anyone learning the game for the first time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think actual physical transformation of a Legacy game is core to the idea of it, but I agree that I&amp;#39;d prefer the games more if they allowed for games to be played with whomever, whenever. I remember playing a couple games of &lt;strong&gt;Risk: Legacy&lt;/strong&gt; that a friend brought over, and he went on to play the next 19 or so games with other people in his home state. It was great. There didn&amp;#39;t seem to be any storyline you had to follow or any major mechanics that complicated the game for anyone new coming into it. It was just &amp;quot;Risk, but on a board that is a bit unique and personalized&amp;quot;. If that intrigued you, as a new player jumping in, you could ask some questions, kind of like exploring the &amp;quot;lore&amp;quot; of a game like Dark Souls.&lt;/p&gt;\n\n&lt;p&gt;I think the best way to craft a Legacy game is to make it so that it evolves and changes permanently, but not on such a scripted path, like &lt;strong&gt;Pandemic Legacy&lt;/strong&gt; did. Just give us a game that reacts to our playstyle and becomes unique to us, but with slight changes that are quick to explain to anyone new who may be joining. The Alien race in Rick Legacy is a great example. It puts a new Island on the board and a new race to choose from, but neither of these are complicated changes that would spin the head of anyone learning the game for the first time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg99l9l", "score_hidden": false, "stickied": false, "created": 1492212159.0, "created_utc": 1492183359.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66jiy", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "Grey-Ferret", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "One thing I don't see you really address is the demand for more Legacy games.  I know I'm not alone when I see a \"legacy\" game and think, 'Oh, that's cool, but it's not right for me.'  Because, I play with an ever-fluctuating group of several gamers.  If a game is going to force me to select just 3 of my friends and demand that we exclude all others from playing with us for 12+ sessions, that's a turn-off.\n\nLegacy needs to figure out a way to include a \"Reset\" button to allow us to share this experience with all of our friends and not have to pick favorites.  And no, telling us to just buy several copies of the game is not an acceptable answer.  Until then, I think 15 designers is probably plenty to satisfy the demands of the market.  The current legacy games work now, because there are so few.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing I don&amp;#39;t see you really address is the demand for more Legacy games.  I know I&amp;#39;m not alone when I see a &amp;quot;legacy&amp;quot; game and think, &amp;#39;Oh, that&amp;#39;s cool, but it&amp;#39;s not right for me.&amp;#39;  Because, I play with an ever-fluctuating group of several gamers.  If a game is going to force me to select just 3 of my friends and demand that we exclude all others from playing with us for 12+ sessions, that&amp;#39;s a turn-off.&lt;/p&gt;\n\n&lt;p&gt;Legacy needs to figure out a way to include a &amp;quot;Reset&amp;quot; button to allow us to share this experience with all of our friends and not have to pick favorites.  And no, telling us to just buy several copies of the game is not an acceptable answer.  Until then, I think 15 designers is probably plenty to satisfy the demands of the market.  The current legacy games work now, because there are so few.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg66jiy", "score_hidden": false, "stickied": false, "created": 1492045856.0, "created_utc": 1492017056.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6w2j2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BradleyHCobb", "parent_id": "t1_dg67ohg", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Rob Daviau actually said [just the opposite](http://www.boardgamedesignlab.com/how-to-playtest-like-a-pro-with-rob-daviau/) on the Board Game Design Lab podcast released today.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rob Daviau actually said &lt;a href=\"http://www.boardgamedesignlab.com/how-to-playtest-like-a-pro-with-rob-daviau/\"&gt;just the opposite&lt;/a&gt; on the Board Game Design Lab podcast released today.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6w2j2", "score_hidden": false, "stickied": false, "created": 1492074365.0, "created_utc": 1492045565.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67ohg", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "AbenoSenbei", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "One additional factor is that you require way more playtesters to effectively playtest your game.  If you're trying to go for a setup like Seafall or Pandemic Legacy where there's going to be big twists on games X and Y, a group can only give you genuine feedback on that once.  If they replay through the game knowing that those twists are coming, that's going to affect their playstyle in a way that a regular gaming group wouldn't encounter, making their feedback less accurate.\n  \nTo reuse the chess analogy from above, if you had a Chess Legacy game where you could upgrade your pieces, and in the middle of the campaign something happens that destroys everyone's bishops, you can be pretty sure no one's going to bother building up their bishops on their future playthroughs.  And now you can no longer get effective feedback from that group on how that twist feels or how it affects the game balance going forward.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One additional factor is that you require way more playtesters to effectively playtest your game.  If you&amp;#39;re trying to go for a setup like Seafall or Pandemic Legacy where there&amp;#39;s going to be big twists on games X and Y, a group can only give you genuine feedback on that once.  If they replay through the game knowing that those twists are coming, that&amp;#39;s going to affect their playstyle in a way that a regular gaming group wouldn&amp;#39;t encounter, making their feedback less accurate.&lt;/p&gt;\n\n&lt;p&gt;To reuse the chess analogy from above, if you had a Chess Legacy game where you could upgrade your pieces, and in the middle of the campaign something happens that destroys everyone&amp;#39;s bishops, you can be pretty sure no one&amp;#39;s going to bother building up their bishops on their future playthroughs.  And now you can no longer get effective feedback from that group on how that twist feels or how it affects the game balance going forward.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg67ohg", "score_hidden": false, "stickied": false, "created": 1492046995.0, "created_utc": 1492018195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6jjyb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "labcoat_samurai", "parent_id": "t1_dg6613r", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "My issue with the analogy is that I don't find the number of possible board states a good proxy for complexity unless we're talking about search in an Artificial Intelligence context.\n\nFor instance, making the board a little bit larger could greatly multiply the number of possible board states, but probably wouldn't dramatically increase the complexity of the game.\n\nI still think it's a really good point, though, and it strikes me as a really big concern in competitive legacy games (perhaps less so in cooperative ones?)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My issue with the analogy is that I don&amp;#39;t find the number of possible board states a good proxy for complexity unless we&amp;#39;re talking about search in an Artificial Intelligence context.&lt;/p&gt;\n\n&lt;p&gt;For instance, making the board a little bit larger could greatly multiply the number of possible board states, but probably wouldn&amp;#39;t dramatically increase the complexity of the game.&lt;/p&gt;\n\n&lt;p&gt;I still think it&amp;#39;s a really good point, though, and it strikes me as a really big concern in competitive legacy games (perhaps less so in cooperative ones?)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6jjyb", "score_hidden": false, "stickied": false, "created": 1492059195.0, "created_utc": 1492030395.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg69m1c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JB4GDI", "parent_id": "t1_dg68uan", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg69m1c", "score_hidden": false, "stickied": false, "created": 1492048941.0, "created_utc": 1492020141.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68uan", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SirManatee", "parent_id": "t1_dg6613r", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "The chess example was very helpful for me.\n\nIt may be obvious to some that a legacy game would be more complex, but your example gave a great sense of the *scale* of that massive increase in complexity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The chess example was very helpful for me.&lt;/p&gt;\n\n&lt;p&gt;It may be obvious to some that a legacy game would be more complex, but your example gave a great sense of the &lt;em&gt;scale&lt;/em&gt; of that massive increase in complexity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg68uan", "score_hidden": false, "stickied": false, "created": 1492048155.0, "created_utc": 1492019355.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6613r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JB4GDI", "parent_id": "t1_dg65jio", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Thanks for the feedback!  Maybe I can clean that whole thing up a little (it has honestly been a tough thing for me to find a good, simple analogy for).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the feedback!  Maybe I can clean that whole thing up a little (it has honestly been a tough thing for me to find a good, simple analogy for).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6613r", "score_hidden": false, "stickied": false, "created": 1492045335.0, "created_utc": 1492016535.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65jio", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "insigniayellow", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I found the start of this confusing, and the chess analogy obfuscated more than it enlightened.\n\nI get that you get to 102,400 by multiplying 'the number of possible board states two moves in to game one' by the 'the number of possible board states two moves in to game two', but what on earth does that mean?  \n\nAlso, I think the analogy just gets the way of your main point, which is that all else being equal, legacy games are more complex than their vanilla counterparts so take longer to create.  That seems a fairly obvious and uncontroversial point, you don't need the baroque example to illustrate it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I found the start of this confusing, and the chess analogy obfuscated more than it enlightened.&lt;/p&gt;\n\n&lt;p&gt;I get that you get to 102,400 by multiplying &amp;#39;the number of possible board states two moves in to game one&amp;#39; by the &amp;#39;the number of possible board states two moves in to game two&amp;#39;, but what on earth does that mean?  &lt;/p&gt;\n\n&lt;p&gt;Also, I think the analogy just gets the way of your main point, which is that all else being equal, legacy games are more complex than their vanilla counterparts so take longer to create.  That seems a fairly obvious and uncontroversial point, you don&amp;#39;t need the baroque example to illustrate it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg65jio", "score_hidden": false, "stickied": false, "created": 1492044831.0, "created_utc": 1492016031.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg8bvir", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ah-grih-cuh-la", "parent_id": "t1_dg7t8jx", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Thanks for the reply. I think that is one of the reasons I'm not a huge fan of legacy style games. If you have people in your play group that will stick with the long campaign of a legacy game, then they work great. Otherwise, they aren't nearly as good. The other comments shed some good insight into why the state of legacy games are where they are at right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the reply. I think that is one of the reasons I&amp;#39;m not a huge fan of legacy style games. If you have people in your play group that will stick with the long campaign of a legacy game, then they work great. Otherwise, they aren&amp;#39;t nearly as good. The other comments shed some good insight into why the state of legacy games are where they are at right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg8bvir", "score_hidden": false, "stickied": false, "created": 1492151001.0, "created_utc": 1492122201.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7t8jx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JB4GDI", "parent_id": "t1_dg67lja", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I don't have any Gloomhaven experience, but since no one answered you, I can share 2 examples from experience.\n\nWhen I was playtesting Seafall, I played with 2 groups at different times.  With the group that played later, one person needed to miss game 8.  So we pulled in someone from the earlier game (who knew the rules fairly well).\n\nThey were able to get the mechanics down, but they made a critical mistake because they weren't aware of our group's **interpersonal dynamics**.\n\nThe later group played really aggressively, which meant you could never let your guard down.  The new player made a normal move, but in doing so, left their harbor wide open.  Something none of us would ever do.  Another player noticed, and immediately demolished the new player.\n\nThere was a meta with our group that the new player just didn't see until it was too late.\n\n2nd quick example:\n\nIn my QuickFight game, I've tried a bunch of tests where I'd have a completely new player replace someone into an ongoing game.  I've even had instances where the new player took on a deck that was imbalanced **in their favor.**  But the new player lost every single time.\n\nMy theory is that even if you know the rules inside and out, you're be entering a Legacy game at a major disadvantage in terms of experience, and understanding the existing player dynamics.  Maybe you can come in at game 2, but past that, you have almost no chance to catch up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any Gloomhaven experience, but since no one answered you, I can share 2 examples from experience.&lt;/p&gt;\n\n&lt;p&gt;When I was playtesting Seafall, I played with 2 groups at different times.  With the group that played later, one person needed to miss game 8.  So we pulled in someone from the earlier game (who knew the rules fairly well).&lt;/p&gt;\n\n&lt;p&gt;They were able to get the mechanics down, but they made a critical mistake because they weren&amp;#39;t aware of our group&amp;#39;s &lt;strong&gt;interpersonal dynamics&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;The later group played really aggressively, which meant you could never let your guard down.  The new player made a normal move, but in doing so, left their harbor wide open.  Something none of us would ever do.  Another player noticed, and immediately demolished the new player.&lt;/p&gt;\n\n&lt;p&gt;There was a meta with our group that the new player just didn&amp;#39;t see until it was too late.&lt;/p&gt;\n\n&lt;p&gt;2nd quick example:&lt;/p&gt;\n\n&lt;p&gt;In my QuickFight game, I&amp;#39;ve tried a bunch of tests where I&amp;#39;d have a completely new player replace someone into an ongoing game.  I&amp;#39;ve even had instances where the new player took on a deck that was imbalanced &lt;strong&gt;in their favor.&lt;/strong&gt;  But the new player lost every single time.&lt;/p&gt;\n\n&lt;p&gt;My theory is that even if you know the rules inside and out, you&amp;#39;re be entering a Legacy game at a major disadvantage in terms of experience, and understanding the existing player dynamics.  Maybe you can come in at game 2, but past that, you have almost no chance to catch up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7t8jx", "score_hidden": false, "stickied": false, "created": 1492130180.0, "created_utc": 1492101380.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67lja", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ah-grih-cuh-la", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Of the people that have played legacy games, how many people actually had different people play the game during different sessions? I'm curious how well that worked out for groups, because it feels like you should keep the same players through the whole game. It seems that without that investment, the experience isn't that great for a given session. The overall experience across the campaign makes it feel whole. I played through Pandemic Legacy with the same people but I couldn't imagine playing with different people here and there. Due to this, I'm hesitant to get Gloomhaven because I doubt I'll be able to get the same people to play through the long campaign.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of the people that have played legacy games, how many people actually had different people play the game during different sessions? I&amp;#39;m curious how well that worked out for groups, because it feels like you should keep the same players through the whole game. It seems that without that investment, the experience isn&amp;#39;t that great for a given session. The overall experience across the campaign makes it feel whole. I played through Pandemic Legacy with the same people but I couldn&amp;#39;t imagine playing with different people here and there. Due to this, I&amp;#39;m hesitant to get Gloomhaven because I doubt I&amp;#39;ll be able to get the same people to play through the long campaign.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg67lja", "score_hidden": false, "stickied": false, "created": 1492046913.0, "created_utc": 1492018113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg76qti", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NightGod", "parent_id": "t1_dg74y9q", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "My impression of the people who ask about resetting Gloomhaven to replay it is that those are people who have never played Gloomhaven. It takes about five scenarios before you realize that resetting the game is just about the last thing you'd want (or even need) to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My impression of the people who ask about resetting Gloomhaven to replay it is that those are people who have never played Gloomhaven. It takes about five scenarios before you realize that resetting the game is just about the last thing you&amp;#39;d want (or even need) to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg76qti", "score_hidden": false, "stickied": false, "created": 1492089213.0, "created_utc": 1492060413.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74y9q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Snugrilla", "parent_id": "t1_dg6weg3", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Man I've seen SO MANY people complaining about how they need the option to restart Gloomhaven so they can play the campaign multiple times.   You mean a 200+ hour campaign isn't enough; you need the option to do a complete reset of it?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man I&amp;#39;ve seen SO MANY people complaining about how they need the option to restart Gloomhaven so they can play the campaign multiple times.   You mean a 200+ hour campaign isn&amp;#39;t enough; you need the option to do a complete reset of it?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg74y9q", "score_hidden": false, "stickied": false, "created": 1492086189.0, "created_utc": 1492057389.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6weg3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BradleyHCobb", "parent_id": "t1_dg6mvtn", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "*But muh replayability!*\n\nSeriously... Pandemic Legacy was $80. Divide that by four players, it's $20. You spend more than that by going to dinner and a movie, and that'll last five hours, tops. Go find me another activity that offers 12-18 hours of enjoyment with your friends for $20 each.\n\n*Muh other board games, smart guy!*\n\nHow many games do you have that you've played 12-18 times, and spent $20 or less to acquire?\n\n*Lots!*\n\nThen maybe a legacy game isn't for you, friend. Go try **Star Realms** if you need bang for your buck. My play time versus expense on that particular game is probably top of the list, even after buying ever expansion I could find.\n\n*Okay, maybe only a few...*\n\nThen stop comparing a legacy game to other board games and think of it as a 15-hour experience for you and your friends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;But muh replayability!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Seriously... Pandemic Legacy was $80. Divide that by four players, it&amp;#39;s $20. You spend more than that by going to dinner and a movie, and that&amp;#39;ll last five hours, tops. Go find me another activity that offers 12-18 hours of enjoyment with your friends for $20 each.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Muh other board games, smart guy!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;How many games do you have that you&amp;#39;ve played 12-18 times, and spent $20 or less to acquire?&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Lots!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Then maybe a legacy game isn&amp;#39;t for you, friend. Go try &lt;strong&gt;Star Realms&lt;/strong&gt; if you need bang for your buck. My play time versus expense on that particular game is probably top of the list, even after buying ever expansion I could find.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Okay, maybe only a few...&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Then stop comparing a legacy game to other board games and think of it as a 15-hour experience for you and your friends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6weg3", "score_hidden": false, "stickied": false, "created": 1492074772.0, "created_utc": 1492045972.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mvtn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MiLSturbie", "parent_id": "t1_dg65uwb", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I just can't wrap my head around why people would ask that question. There are a million games out there, and people want to take the most important element of the design out so that they can play it like every other game? I don't get it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just can&amp;#39;t wrap my head around why people would ask that question. There are a million games out there, and people want to take the most important element of the design out so that they can play it like every other game? I don&amp;#39;t get it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6mvtn", "score_hidden": false, "stickied": false, "created": 1492063079.0, "created_utc": 1492034279.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65uwb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "JB4GDI", "parent_id": "t1_dg65exj", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "That's a super good question!  The 'can you play without the Legacy bits' question you see everywhere is a legitimate one, and to be honest, I totally get where they're coming from.  In some instances, yes it's possible.  But for most Legacy games, finding some other system to reduce permanence is going to lead to\n\n*  Extra complexity\n*  Extra cost\n\nSomeone had this exact question (with some good ideas for solutions) in /r/tabletopgamedesign and [I gave some details on why I can't just rip the Legacy out of my game](https://www.reddit.com/r/tabletopgamedesign/comments/62plrl/principles_of_legacy_gaming_long/dfpe87w/).\n\nAs for the whining, I mean, it doesn't bother me at all.  Those people probably aren't going to buy or enjoy my game anyway!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a super good question!  The &amp;#39;can you play without the Legacy bits&amp;#39; question you see everywhere is a legitimate one, and to be honest, I totally get where they&amp;#39;re coming from.  In some instances, yes it&amp;#39;s possible.  But for most Legacy games, finding some other system to reduce permanence is going to lead to&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt; Extra complexity&lt;/li&gt;\n&lt;li&gt; Extra cost&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Someone had this exact question (with some good ideas for solutions) in &lt;a href=\"/r/tabletopgamedesign\"&gt;/r/tabletopgamedesign&lt;/a&gt; and &lt;a href=\"https://www.reddit.com/r/tabletopgamedesign/comments/62plrl/principles_of_legacy_gaming_long/dfpe87w/\"&gt;I gave some details on why I can&amp;#39;t just rip the Legacy out of my game&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;As for the whining, I mean, it doesn&amp;#39;t bother me at all.  Those people probably aren&amp;#39;t going to buy or enjoy my game anyway!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg65uwb", "score_hidden": false, "stickied": false, "created": 1492045158.0, "created_utc": 1492016358.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6mjcf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg65exj", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "You're going to get negativity and whining with any game design, so I don't think that's it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re going to get negativity and whining with any game design, so I don&amp;#39;t think that&amp;#39;s it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6mjcf", "score_hidden": false, "stickied": false, "created": 1492062657.0, "created_utc": 1492033857.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65exj", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "flyliceplick", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I wonder what it feels like to design a legacy game and hear people whine non-stop about it. \"Can you play it without the legacy bits?\"\n\nYou go to all that effort and a bunch of people just shit on it. People who buy the game just don't bother playing it properly.\n\nThat's why there aren't more legacy games. Designers have a hard enough time as it is.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wonder what it feels like to design a legacy game and hear people whine non-stop about it. &amp;quot;Can you play it without the legacy bits?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You go to all that effort and a bunch of people just shit on it. People who buy the game just don&amp;#39;t bother playing it properly.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why there aren&amp;#39;t more legacy games. Designers have a hard enough time as it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg65exj", "score_hidden": false, "stickied": false, "created": 1492044697.0, "created_utc": 1492015897.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7i7vu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ax0r", "parent_id": "t1_dg7chle", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "It's a hard thing to describe, honestly, the difference you get between a legacy game and a campaign game. At some psychological level, the fact that something is truly permanent makes it feel more significant.\n\nI was like a lot of people and couldn't comprehend the idea of defacing a game. Why would you do that?  \nBut from the very first time I say down to play risk legacy, I was completely hooked.  \n You choose the faction to play for the first game, then choose one of two special powers to give it. You don't know how strong it is, how it affects the game or anything. You have to make a choice, then throw the other one away. Your choice is permanent, even later when someone else uses that faction. It adds something that's not quite there without it.  \nThe other part that's compelling is the secret boxes and envelopes. Admittedly, something like this could be done in a regular campaign game, but the surprise only works once. The combination of everything really works. When you're going out of your way to do something because you want to open a box, and then *oh God*, you wish you could undo it because the box is going to change things forever, and not in your favour, it's an amazing feeling.\n\nCould these things be done without permanent alterations? Sure, but the overhead becomes so unwieldy that is not really worth the effort anymore.\n\nI've played Risk and Pandemic legacy, but not seafall.  \nBefore Risk legacy, I *hated* Risk. I would not agree to play it. After legacy? I'll only play our legacy board. I have no interest in other versions of Risk.  \nBefore Pandemic legacy, I'd played enough Pandemic to feel like I'd reasonably \"solved\" it. We could win pretty much every time on one difficulty below max, and on max difficulty felt like whether we won or not came down to card draw. I had no experience with any of the expansions and no desire to try them, as we had other games we felt were more interesting. When we played legacy, we basically played all the way through over the course of a long weekend. It was an incredible time, full of stories and fantastic memories. We were all completely satisfied by the experience. After that, none of us have any desire to play non-legacy Pandemic ever again. I'd play legacy season one with a different group if i was asked, but I don't need to. For us, it was honestly a pretty small price for the four of us to have an amazing weekend that we'll always remember. Trying to track everything that happened in a non legacy way would have been so unwieldy that we'd have given up three games in.\n\nBasically, for everyone who is against legacy, my advice is to just try it. Find someone who isn't against the idea so much and see if you can join with them. Share the cost amongst your friends and schedule it in as an organised activity. It's still cheaper than going to see a movie, even if it turns out not to be for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a hard thing to describe, honestly, the difference you get between a legacy game and a campaign game. At some psychological level, the fact that something is truly permanent makes it feel more significant.&lt;/p&gt;\n\n&lt;p&gt;I was like a lot of people and couldn&amp;#39;t comprehend the idea of defacing a game. Why would you do that?&lt;br/&gt;\nBut from the very first time I say down to play risk legacy, I was completely hooked.&lt;br/&gt;\n You choose the faction to play for the first game, then choose one of two special powers to give it. You don&amp;#39;t know how strong it is, how it affects the game or anything. You have to make a choice, then throw the other one away. Your choice is permanent, even later when someone else uses that faction. It adds something that&amp;#39;s not quite there without it.&lt;br/&gt;\nThe other part that&amp;#39;s compelling is the secret boxes and envelopes. Admittedly, something like this could be done in a regular campaign game, but the surprise only works once. The combination of everything really works. When you&amp;#39;re going out of your way to do something because you want to open a box, and then &lt;em&gt;oh God&lt;/em&gt;, you wish you could undo it because the box is going to change things forever, and not in your favour, it&amp;#39;s an amazing feeling.&lt;/p&gt;\n\n&lt;p&gt;Could these things be done without permanent alterations? Sure, but the overhead becomes so unwieldy that is not really worth the effort anymore.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve played Risk and Pandemic legacy, but not seafall.&lt;br/&gt;\nBefore Risk legacy, I &lt;em&gt;hated&lt;/em&gt; Risk. I would not agree to play it. After legacy? I&amp;#39;ll only play our legacy board. I have no interest in other versions of Risk.&lt;br/&gt;\nBefore Pandemic legacy, I&amp;#39;d played enough Pandemic to feel like I&amp;#39;d reasonably &amp;quot;solved&amp;quot; it. We could win pretty much every time on one difficulty below max, and on max difficulty felt like whether we won or not came down to card draw. I had no experience with any of the expansions and no desire to try them, as we had other games we felt were more interesting. When we played legacy, we basically played all the way through over the course of a long weekend. It was an incredible time, full of stories and fantastic memories. We were all completely satisfied by the experience. After that, none of us have any desire to play non-legacy Pandemic ever again. I&amp;#39;d play legacy season one with a different group if i was asked, but I don&amp;#39;t need to. For us, it was honestly a pretty small price for the four of us to have an amazing weekend that we&amp;#39;ll always remember. Trying to track everything that happened in a non legacy way would have been so unwieldy that we&amp;#39;d have given up three games in.&lt;/p&gt;\n\n&lt;p&gt;Basically, for everyone who is against legacy, my advice is to just try it. Find someone who isn&amp;#39;t against the idea so much and see if you can join with them. Share the cost amongst your friends and schedule it in as an organised activity. It&amp;#39;s still cheaper than going to see a movie, even if it turns out not to be for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7i7vu", "score_hidden": false, "stickied": false, "created": 1492117286.0, "created_utc": 1492088486.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7chle", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CorenSV", "parent_id": "t1_dg6rmpp", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Every Game I own I have played more then 16 times already. Either Solo or with friends. as of now I only own 3 games, Arkham horror the card game. Race for the galaxy and legendary encounter: alien.\n\nTrue I don't have many games. But I don't have much disposable income either. So for me that's a concern.\n\nThe replayablility argument is not theoretical. Just because you don't care about replayability that much doesn't mean others aren't allowed to have it as a valid concern or criticism.\n\nI'm also questioning what the legacy mode even add's to the game. What does pandemic legacy do that Arkham horror the card game doesn't do with it's campaign mode? \n\nI mean I can play through the arkham horror campaigns as many times as I want with as many different groups as I want and all it costs me is pen and paper to write down which group did what and what their different decks are.\nThe same thing with pandemic legacy costs me 50 euro's per playthrough. And I need to hope that somebody doesn't flake out. Which probably is hard to deal with.\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Every Game I own I have played more then 16 times already. Either Solo or with friends. as of now I only own 3 games, Arkham horror the card game. Race for the galaxy and legendary encounter: alien.&lt;/p&gt;\n\n&lt;p&gt;True I don&amp;#39;t have many games. But I don&amp;#39;t have much disposable income either. So for me that&amp;#39;s a concern.&lt;/p&gt;\n\n&lt;p&gt;The replayablility argument is not theoretical. Just because you don&amp;#39;t care about replayability that much doesn&amp;#39;t mean others aren&amp;#39;t allowed to have it as a valid concern or criticism.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also questioning what the legacy mode even add&amp;#39;s to the game. What does pandemic legacy do that Arkham horror the card game doesn&amp;#39;t do with it&amp;#39;s campaign mode? &lt;/p&gt;\n\n&lt;p&gt;I mean I can play through the arkham horror campaigns as many times as I want with as many different groups as I want and all it costs me is pen and paper to write down which group did what and what their different decks are.\nThe same thing with pandemic legacy costs me 50 euro&amp;#39;s per playthrough. And I need to hope that somebody doesn&amp;#39;t flake out. Which probably is hard to deal with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7chle", "score_hidden": false, "stickied": false, "created": 1492104203.0, "created_utc": 1492075403.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6vrmm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pravis", "parent_id": "t1_dg6rmpp", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Sure there are complex games that I have only played a handful but at least I have the option to play them again with the right people.  With current Legacy games that option is gone.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure there are complex games that I have only played a handful but at least I have the option to play them again with the right people.  With current Legacy games that option is gone.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6vrmm", "score_hidden": false, "stickied": false, "created": 1492073986.0, "created_utc": 1492045186.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rmpp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ax0r", "parent_id": "t1_dg6oanu", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "The replayability argument is pretty much theoretical, though.\n\nBe honest, how many games in your entire collection have you played more than 16 times? There will be some, sure. Quick games can hit that number easily. Long term favourites like Carcassonne or Race for the Galaxy will hit that number.  \nBut what about games that take more than 60 minutes to play? How many of those have you played more than 16 times?\n\nI've only been logging my plays since the start of this year, so I don't have great data. I think I *might* have 16 Plays of Descent 2nd Ed. There's no other game in my group's collection that is both longer than an hour and comes close to 16 plays, except for Risk Legacy and Pandemic Legacy.\n\nWe got more value out of those games, despite their legacy nature, than most other games we buy. The Legacy aspect actually encourages us to return to the game, and not get drawn away by something else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The replayability argument is pretty much theoretical, though.&lt;/p&gt;\n\n&lt;p&gt;Be honest, how many games in your entire collection have you played more than 16 times? There will be some, sure. Quick games can hit that number easily. Long term favourites like Carcassonne or Race for the Galaxy will hit that number.&lt;br/&gt;\nBut what about games that take more than 60 minutes to play? How many of those have you played more than 16 times?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve only been logging my plays since the start of this year, so I don&amp;#39;t have great data. I think I &lt;em&gt;might&lt;/em&gt; have 16 Plays of Descent 2nd Ed. There&amp;#39;s no other game in my group&amp;#39;s collection that is both longer than an hour and comes close to 16 plays, except for Risk Legacy and Pandemic Legacy.&lt;/p&gt;\n\n&lt;p&gt;We got more value out of those games, despite their legacy nature, than most other games we buy. The Legacy aspect actually encourages us to return to the game, and not get drawn away by something else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6rmpp", "score_hidden": false, "stickied": false, "created": 1492068959.0, "created_utc": 1492040159.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7ncaz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg7n8ul", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; doesn't mean others can't disagree with it though.\n\nThat's what I'm trying to get across. =)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;doesn&amp;#39;t mean others can&amp;#39;t disagree with it though.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s what I&amp;#39;m trying to get across. =)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7ncaz", "score_hidden": false, "stickied": false, "created": 1492123836.0, "created_utc": 1492095036.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7n8ul", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CorenSV", "parent_id": "t1_dg7mml3", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt;I agree that these things are in principle infinitely repayable. But how many times are you really going to play through COD, or watch Shrek 3?\n\nMore then once ;)\n\n&gt;So for me it's still a great deal and a great experience and I really like them.\n\nAnd that's fine. But just because you think it's a great deal. doesn't mean others can't disagree with it though.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I agree that these things are in principle infinitely repayable. But how many times are you really going to play through COD, or watch Shrek 3?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;More then once ;)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So for me it&amp;#39;s still a great deal and a great experience and I really like them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And that&amp;#39;s fine. But just because you think it&amp;#39;s a great deal. doesn&amp;#39;t mean others can&amp;#39;t disagree with it though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7n8ul", "score_hidden": false, "stickied": false, "created": 1492123725.0, "created_utc": 1492094925.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mml3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg7cpu1", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; Videogames, music,movies you bought on DVD\n\nI agree that these things are in principle infinitely replayable. But how many times are you _really_ going to play through COD, or watch Shrek 3?\n\nWhat I'm getting at is this: there are many things that are _not_ infinitely replayable, neither in principle nor in practice. For some things everyone accepts limited value/time, for others its completely unacceptable. So far I haven't heard good arguments as to why this should be so apart from:\n\n&gt; Most boardgames aren't single use.\n\nAnd I get that, in comparison to other boardgames Legacy games seem less valuable. However, it's really a personal preference how you count value. So _for me_ it's still a great deal and a great experience and I really like them.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Videogames, music,movies you bought on DVD&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree that these things are in principle infinitely replayable. But how many times are you &lt;em&gt;really&lt;/em&gt; going to play through COD, or watch Shrek 3?&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m getting at is this: there are many things that are &lt;em&gt;not&lt;/em&gt; infinitely replayable, neither in principle nor in practice. For some things everyone accepts limited value/time, for others its completely unacceptable. So far I haven&amp;#39;t heard good arguments as to why this should be so apart from:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Most boardgames aren&amp;#39;t single use.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And I get that, in comparison to other boardgames Legacy games seem less valuable. However, it&amp;#39;s really a personal preference how you count value. So &lt;em&gt;for me&lt;/em&gt; it&amp;#39;s still a great deal and a great experience and I really like them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7mml3", "score_hidden": false, "stickied": false, "created": 1492123011.0, "created_utc": 1492094211.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cpu1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CorenSV", "parent_id": "t1_dg7agfd", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt;It's only boardgamers who insist on near-infinite replayability.\n\nYou're ignoring a lot of other groups. Videogames, music,movies you bought on DVD.  Everybody would be outraged if those things deleted themselves after a listen/playthrough/vieuw. \n\nWe sure aren't the only ones who insist on replayability.\n\nAs the meal analogy. I don't really get behind it. You're not buying a meal. You're buying a boardgame. Most boardgames aren't single use. So that's a negative when compairing them to other boardgames. Granted, you can say that other positives outweigh that one negative in your opinion. But I'm baffled when people say being able to only do a single playthrough is a good thing. \n\nI have a problem with legacy games Because aside from the destroy the game thing so it's only worth a single playthrough. It doesn't really add much to the gameplay.  Arkham's campaign mode is pretty damn good without it demanding you destroy stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s only boardgamers who insist on near-infinite replayability.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re ignoring a lot of other groups. Videogames, music,movies you bought on DVD.  Everybody would be outraged if those things deleted themselves after a listen/playthrough/vieuw. &lt;/p&gt;\n\n&lt;p&gt;We sure aren&amp;#39;t the only ones who insist on replayability.&lt;/p&gt;\n\n&lt;p&gt;As the meal analogy. I don&amp;#39;t really get behind it. You&amp;#39;re not buying a meal. You&amp;#39;re buying a boardgame. Most boardgames aren&amp;#39;t single use. So that&amp;#39;s a negative when compairing them to other boardgames. Granted, you can say that other positives outweigh that one negative in your opinion. But I&amp;#39;m baffled when people say being able to only do a single playthrough is a good thing. &lt;/p&gt;\n\n&lt;p&gt;I have a problem with legacy games Because aside from the destroy the game thing so it&amp;#39;s only worth a single playthrough. It doesn&amp;#39;t really add much to the gameplay.  Arkham&amp;#39;s campaign mode is pretty damn good without it demanding you destroy stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7cpu1", "score_hidden": false, "stickied": false, "created": 1492104908.0, "created_utc": 1492076108.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7agfd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg6oanu", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "As far as I can see, you're really repeating my point. There are so many options of entertainment that are consumed when you enjoy them. Dinner with friends, gone after you're finished. Cocktails with a group of people. Going to the cinema. Any activity you can think of. Most of them will have a combined cost of 50 € for a group of four, or probably more, and you can't \"replay\" any of them. Yet no one argues that 12.50 € per person is really too much for a single eat-through, even though you'll probably get far fewer hours of entertainment out of that than out of Pandemic Legacy.\n\nIt's only boardgamers who insist on near-infinite replayability.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As far as I can see, you&amp;#39;re really repeating my point. There are so many options of entertainment that are consumed when you enjoy them. Dinner with friends, gone after you&amp;#39;re finished. Cocktails with a group of people. Going to the cinema. Any activity you can think of. Most of them will have a combined cost of 50 € for a group of four, or probably more, and you can&amp;#39;t &amp;quot;replay&amp;quot; any of them. Yet no one argues that 12.50 € per person is really too much for a single eat-through, even though you&amp;#39;ll probably get far fewer hours of entertainment out of that than out of Pandemic Legacy.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s only boardgamers who insist on near-infinite replayability.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7agfd", "score_hidden": false, "stickied": false, "created": 1492098111.0, "created_utc": 1492069311.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7svr3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jaywinner", "parent_id": "t1_dg7cn2b", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I agree that if you're going to start a legacy game, you better have a rock-solid group to avoid anybody flaking.\n\nI guess when money is tight and you have a small collection, replay value gains importance. The flipside is that if you can afford most any other leisure activity, skipping out on that once as a group saves enough to buy a game.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that if you&amp;#39;re going to start a legacy game, you better have a rock-solid group to avoid anybody flaking.&lt;/p&gt;\n\n&lt;p&gt;I guess when money is tight and you have a small collection, replay value gains importance. The flipside is that if you can afford most any other leisure activity, skipping out on that once as a group saves enough to buy a game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7svr3", "score_hidden": false, "stickied": false, "created": 1492129793.0, "created_utc": 1492100993.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cn2b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CorenSV", "parent_id": "t1_dg6w6uo", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Eh for poor students like me without much disposable income it's a bit of a dealbreaker at times.\n\nI don't mind other people playing and paying for legacy games. (It's their money, what do I care ;) ).\nI just don't see the appeal myself. What does a legacy game offer to me in campaign gameplay that the first playthrough \n\n&gt;You play all 15 campaign games with 4 players and choose never to play again with the unique board you've created.\n\nthat's another iffy thing I have about it. What if one of your 4 players flakes out midway through the campaign? It's going to be slightly iffy to find somebody else. Since they missed half the game already. But you can't just not continue, because that would have been a waste of money. \n\nLeaves you in an awkward position. :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh for poor students like me without much disposable income it&amp;#39;s a bit of a dealbreaker at times.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t mind other people playing and paying for legacy games. (It&amp;#39;s their money, what do I care ;) ).\nI just don&amp;#39;t see the appeal myself. What does a legacy game offer to me in campaign gameplay that the first playthrough &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You play all 15 campaign games with 4 players and choose never to play again with the unique board you&amp;#39;ve created.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;that&amp;#39;s another iffy thing I have about it. What if one of your 4 players flakes out midway through the campaign? It&amp;#39;s going to be slightly iffy to find somebody else. Since they missed half the game already. But you can&amp;#39;t just not continue, because that would have been a waste of money. &lt;/p&gt;\n\n&lt;p&gt;Leaves you in an awkward position. :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7cn2b", "score_hidden": false, "stickied": false, "created": 1492104667.0, "created_utc": 1492075867.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6w6uo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jaywinner", "parent_id": "t1_dg6oanu", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "It's valid in that it can make board games more expensive. But I feel that's only because board games are such great value to begin with.\n\nIf you take Risk Legacy as an example. You play all 15 campaign games with 4 players and choose never to play again with the unique board you've created. That's a cost of under one euro per player per game. That's pretty good entertainment value.\n\nLike you said, it's an experience. I don't expect everybody to like it but I wouldn't let cost get in the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s valid in that it can make board games more expensive. But I feel that&amp;#39;s only because board games are such great value to begin with.&lt;/p&gt;\n\n&lt;p&gt;If you take Risk Legacy as an example. You play all 15 campaign games with 4 players and choose never to play again with the unique board you&amp;#39;ve created. That&amp;#39;s a cost of under one euro per player per game. That&amp;#39;s pretty good entertainment value.&lt;/p&gt;\n\n&lt;p&gt;Like you said, it&amp;#39;s an experience. I don&amp;#39;t expect everybody to like it but I wouldn&amp;#39;t let cost get in the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6w6uo", "score_hidden": false, "stickied": false, "created": 1492074517.0, "created_utc": 1492045717.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6oanu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CorenSV", "parent_id": "t1_dg6mmyd", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Dunno, the complaint of having to dump 50 or more euro's on a game whose 'campaign' mode can only be played once is a valid concern. Especially if multiple routes are possible (which there probably always are. Because what use is a legacy game if there aren't concequences around right?)  . Which means that if you want to explore other routes after you completed a game you (or somebody else in your game group.) needs to pay another 50 euro's.  Not to mention the fact that if you want to play the game with another group the only option is again, buying another box.\n\nI don't know of any other board game type that forces you to buy another copy of the game if you want to start over or just experience the game with other people.\n\nIt might be an interesting experience. But I really don't think the cost is worth it.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dunno, the complaint of having to dump 50 or more euro&amp;#39;s on a game whose &amp;#39;campaign&amp;#39; mode can only be played once is a valid concern. Especially if multiple routes are possible (which there probably always are. Because what use is a legacy game if there aren&amp;#39;t concequences around right?)  . Which means that if you want to explore other routes after you completed a game you (or somebody else in your game group.) needs to pay another 50 euro&amp;#39;s.  Not to mention the fact that if you want to play the game with another group the only option is again, buying another box.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know of any other board game type that forces you to buy another copy of the game if you want to start over or just experience the game with other people.&lt;/p&gt;\n\n&lt;p&gt;It might be an interesting experience. But I really don&amp;#39;t think the cost is worth it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6oanu", "score_hidden": false, "stickied": false, "created": 1492064840.0, "created_utc": 1492036040.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mmyd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg6bj6m", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Is that _really_ a problem for so many people? I have loads of games that I've paid more than $50 for, that I _haven't_ played 12-24 times, nor will I ever sell them. And so do you, I assume.\n\nI can understand that it might be a psychological hurdle for some potential players, but it's not really a practical one, I'd think.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is that &lt;em&gt;really&lt;/em&gt; a problem for so many people? I have loads of games that I&amp;#39;ve paid more than $50 for, that I &lt;em&gt;haven&amp;#39;t&lt;/em&gt; played 12-24 times, nor will I ever sell them. And so do you, I assume.&lt;/p&gt;\n\n&lt;p&gt;I can understand that it might be a psychological hurdle for some potential players, but it&amp;#39;s not really a practical one, I&amp;#39;d think.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6mmyd", "score_hidden": false, "stickied": false, "created": 1492062779.0, "created_utc": 1492033979.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bj6m", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tickthegreat", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "It's a great business model from the publisher's standpoint -- there is zero secondary market interest in Legacy games. You can't trade them away or sell them when you're done. You just pay $50 then that's it. And if someone else wants to play, they pay $50. I'm sure EA is trying to think up some way of making a game that just deletes itself from your harddrive when you finish it in the videogame arena. Even the Telltale games allow you to go back and try the different options to see where they lead.\n\nIt's a novel gimmick right now in boardgaming and has been done well 2 out of the 3 times it has been attempted so far. The games that have extensive campaigns that have lasting changes from game to game (maybe via an app) but can be reset and started over will probably fill this niche eventually and replace the \"write on board and tear up cards\" type of Legacy we are used to now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a great business model from the publisher&amp;#39;s standpoint -- there is zero secondary market interest in Legacy games. You can&amp;#39;t trade them away or sell them when you&amp;#39;re done. You just pay $50 then that&amp;#39;s it. And if someone else wants to play, they pay $50. I&amp;#39;m sure EA is trying to think up some way of making a game that just deletes itself from your harddrive when you finish it in the videogame arena. Even the Telltale games allow you to go back and try the different options to see where they lead.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a novel gimmick right now in boardgaming and has been done well 2 out of the 3 times it has been attempted so far. The games that have extensive campaigns that have lasting changes from game to game (maybe via an app) but can be reset and started over will probably fill this niche eventually and replace the &amp;quot;write on board and tear up cards&amp;quot; type of Legacy we are used to now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6bj6m", "score_hidden": false, "stickied": false, "created": 1492050910.0, "created_utc": 1492022110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6r73z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Stylemys", "parent_id": "t1_dg6pb0z", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "The bar for quality control has to be much higher than usual as well. Missing or even just misplaced components in a legacy game can ruin the entire game. To boot, if the components are in a sealed compartment then the players won't even know about the problem (assuming they even realize the issue) until they have immediate need for them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The bar for quality control has to be much higher than usual as well. Missing or even just misplaced components in a legacy game can ruin the entire game. To boot, if the components are in a sealed compartment then the players won&amp;#39;t even know about the problem (assuming they even realize the issue) until they have immediate need for them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6r73z", "score_hidden": false, "stickied": false, "created": 1492068434.0, "created_utc": 1492039634.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7a6ic", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg6pb0z", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "The Hollywood example is exactly what I'm arguing, especially since the stakes in Hollywood are _much_ higher (movies being more expensive and all). Have you noticed the recent glut in superhero movies, which were sparked by, probably, the Batmans? Or did you notice that Fast and Furious _8_ is in cinemas now? And do you also notice that they all came out a few years after the initial proof, ie. one or two development cycles later? They were proven by a single instance of a successful movie, which really is enough proof. There are now a handful of really successful Legacy games (and a lackluster one).\n\nI bet that there are several Legacy games under development at each of the large publishers, and we'll see them in the coming months and years. They're not here yet because, as others (and I) have pointed out, they take a long time to get right.\n\nWell, that's how I see it anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Hollywood example is exactly what I&amp;#39;m arguing, especially since the stakes in Hollywood are &lt;em&gt;much&lt;/em&gt; higher (movies being more expensive and all). Have you noticed the recent glut in superhero movies, which were sparked by, probably, the Batmans? Or did you notice that Fast and Furious &lt;em&gt;8&lt;/em&gt; is in cinemas now? And do you also notice that they all came out a few years after the initial proof, ie. one or two development cycles later? They were proven by a single instance of a successful movie, which really is enough proof. There are now a handful of really successful Legacy games (and a lackluster one).&lt;/p&gt;\n\n&lt;p&gt;I bet that there are several Legacy games under development at each of the large publishers, and we&amp;#39;ll see them in the coming months and years. They&amp;#39;re not here yet because, as others (and I) have pointed out, they take a long time to get right.&lt;/p&gt;\n\n&lt;p&gt;Well, that&amp;#39;s how I see it anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7a6ic", "score_hidden": false, "stickied": false, "created": 1492097339.0, "created_utc": 1492068539.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pb0z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Daughedm", "parent_id": "t1_dg6mp27", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Because it's a lot harder to make a legacy game work well and they don't have the data yet to prove that a legacy game is a solid investment. There have only been a handful of successful legacy games, where as there have been hundreds of successful equivalent non-legacy games. A small company is much more likely to invest their time and money into a game type that has proven history of success than taking a flyer on the new hotness. \n\nJust look at Hollywood and videogames as an example, how many new IPs do they create? Not many because they feel like making sequels to their movies/videogames is a better investment because they can calculate the success of them, making it less of a risk.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because it&amp;#39;s a lot harder to make a legacy game work well and they don&amp;#39;t have the data yet to prove that a legacy game is a solid investment. There have only been a handful of successful legacy games, where as there have been hundreds of successful equivalent non-legacy games. A small company is much more likely to invest their time and money into a game type that has proven history of success than taking a flyer on the new hotness. &lt;/p&gt;\n\n&lt;p&gt;Just look at Hollywood and videogames as an example, how many new IPs do they create? Not many because they feel like making sequels to their movies/videogames is a better investment because they can calculate the success of them, making it less of a risk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6pb0z", "score_hidden": false, "stickied": false, "created": 1492066078.0, "created_utc": 1492037278.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mp27", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "habeamus", "parent_id": "t1_dg6df71", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "But that's true for any game. Why would it be specific to a Legacy game? There are games with more components, with more complicated rules, with more complicated playtests around, and they get published by small studios all the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But that&amp;#39;s true for any game. Why would it be specific to a Legacy game? There are games with more components, with more complicated rules, with more complicated playtests around, and they get published by small studios all the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6mp27", "score_hidden": false, "stickied": false, "created": 1492062853.0, "created_utc": 1492034053.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7ijn4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FlagstoneSpin", "parent_id": "t1_dg6df71", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "That said, I have been mulling over the idea of making a card-exclusive Legacy game. Thanks to sites like DriveThruCards, you can make it a Print On Demand game, which hugely reduces the financial risk, so long as you have alternative income. Not having to worry about print runs means you can test the waters more readily.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That said, I have been mulling over the idea of making a card-exclusive Legacy game. Thanks to sites like DriveThruCards, you can make it a Print On Demand game, which hugely reduces the financial risk, so long as you have alternative income. Not having to worry about print runs means you can test the waters more readily.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7ijn4", "score_hidden": false, "stickied": false, "created": 1492117774.0, "created_utc": 1492088974.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6df71", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Daughedm", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "The main reason is that there are more financial risks involved with bringing a legacy game to market. A potential flop of a game like that could ruin a smaller game company.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The main reason is that there are more financial risks involved with bringing a legacy game to market. A potential flop of a game like that could ruin a smaller game company.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6df71", "score_hidden": false, "stickied": false, "created": 1492052868.0, "created_utc": 1492024068.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6nllm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Veneretio", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "It's new and it takes time to make things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s new and it takes time to make things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6nllm", "score_hidden": false, "stickied": false, "created": 1492063966.0, "created_utc": 1492035166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6ra8g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dgermain", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "That is really interesting! \n  \nFor games that is possible, it makes simulating and exploring states with computer programming really relevant. Since you can change the rules, and \"playtest\" all the possible game trees without having to involve actual humans.\n  \nIt does not resolve everything, but at least it can check for game balancing and some of the breaking conditions!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is really interesting! &lt;/p&gt;\n\n&lt;p&gt;For games that is possible, it makes simulating and exploring states with computer programming really relevant. Since you can change the rules, and &amp;quot;playtest&amp;quot; all the possible game trees without having to involve actual humans.&lt;/p&gt;\n\n&lt;p&gt;It does not resolve everything, but at least it can check for game balancing and some of the breaking conditions!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6ra8g", "score_hidden": false, "stickied": false, "created": 1492068535.0, "created_utc": 1492039735.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6v14b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pravis", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "My concerns with Legacy games are whether I can actually complete it with a group of friends (as stated elsewhere game g groups may not be static), and replayability.   \n\nAfter one play through of a game you figure out how things from the game impact the following ones.  Even if I was the o ly one who played a second time in a group, I do t think I can enjoy it knowing what the better/worse play is.  Additionally, what if someone in my first play through has played before?  \n\nI don't want to spend money on a game, only get a couple nights of playing and then never play again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My concerns with Legacy games are whether I can actually complete it with a group of friends (as stated elsewhere game g groups may not be static), and replayability.   &lt;/p&gt;\n\n&lt;p&gt;After one play through of a game you figure out how things from the game impact the following ones.  Even if I was the o ly one who played a second time in a group, I do t think I can enjoy it knowing what the better/worse play is.  Additionally, what if someone in my first play through has played before?  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to spend money on a game, only get a couple nights of playing and then never play again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6v14b", "score_hidden": false, "stickied": false, "created": 1492073110.0, "created_utc": 1492044310.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7a027", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tarrach", "parent_id": "t1_dg6xxrh", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Risk Legacy is 6 years old, I wouldn't say the concept is incredibly new.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Risk Legacy is 6 years old, I wouldn&amp;#39;t say the concept is incredibly new.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7a027", "score_hidden": false, "stickied": false, "created": 1492096839.0, "created_utc": 1492068039.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xxrh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "5outh", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I think the main reasons are:\n\n1. It's an incredibly new concept\n2.  Legacy games are incredibly difficult to design", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the main reasons are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;It&amp;#39;s an incredibly new concept&lt;/li&gt;\n&lt;li&gt; Legacy games are incredibly difficult to design&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6xxrh", "score_hidden": false, "stickied": false, "created": 1492076674.0, "created_utc": 1492047874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7fs68", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ludanto", "parent_id": "t1_dg71dic", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; There isn't a non abstract board game that gives you that many possible moves.\n\nHow do you define non-abstract? Plenty of non-abstract games have big trees. Tigris &amp; Euphrates springs to mind as a non-abstract game that starts with a big number of possible moves -- not all of them interesting, granted.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There isn&amp;#39;t a non abstract board game that gives you that many possible moves.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How do you define non-abstract? Plenty of non-abstract games have big trees. Tigris &amp;amp; Euphrates springs to mind as a non-abstract game that starts with a big number of possible moves -- not all of them interesting, granted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7fs68", "score_hidden": false, "stickied": false, "created": 1492113068.0, "created_utc": 1492084268.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71dic", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Drift_Marlo", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "The Chess analogy breaks down instantly. Each player has 16 possible opening moves. That number increases on each turn until pieces begin to be removed. There isn't a non abstract board game that gives you that many possible moves. \n\nThat said, do what you want. If you think there's a shortage of Legacy games, then there is. There's bound to be people who agree. More importantly, the only person your game needs to please is you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Chess analogy breaks down instantly. Each player has 16 possible opening moves. That number increases on each turn until pieces begin to be removed. There isn&amp;#39;t a non abstract board game that gives you that many possible moves. &lt;/p&gt;\n\n&lt;p&gt;That said, do what you want. If you think there&amp;#39;s a shortage of Legacy games, then there is. There&amp;#39;s bound to be people who agree. More importantly, the only person your game needs to please is you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg71dic", "score_hidden": false, "stickied": false, "created": 1492081018.0, "created_utc": 1492052218.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg785j1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "takeic", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I think charterstone is doing it right by introducing replaybility at the final stage of the game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think charterstone is doing it right by introducing replaybility at the final stage of the game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg785j1", "score_hidden": false, "stickied": false, "created": 1492092167.0, "created_utc": 1492063367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7kozm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ch1ma3ra", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Got to say I'm getting really bored of the debate over Legacy-style games and I really don't understand why it's such a big deal - the primary argument is down to the destructive nature of Legacy games - the decisions you make and permanently etched into the fabric of that copy of the game, preventing you from replaying or reselling the game. \n\nSo for the anti-legacy crown this permanence is a big deal, that you're casting money into a one-way transaction that you can't recoup by either reselling it or playing it til it falls apart in your hands. \n\nFor the pro-legacy crowd this is actually part of the appeal - that the choices you make have an undeniable permanence to them beyond that of any campaign game I know about - it adds a stress and intensity to the proceedings that people *really* respond to. \n\nWhat I don't get is why people are so agitated about it - why on earth do the anti-legacy people get so up in arms about it? There are three headline Legacy games at this point. Three, in SIX years. How many other games have been released in that time? If you don't like the Legacy concept that's fine, everyone is entitled to their opinion but surely you can find something more to your tastes in the hundreds of other games released in the same time?\n\nI *loved* playing Pandemic Legacy - I found it a tense and enjoyable game across all 16 of the games it took to get us through to the end, and having completed the story I have exactly *zero* desire to play it again - there is no way my knowledge of the story that is to come wouldn't colour my actions should I try to play it again. \n\nSo of course that then leaves the resale argument - and in fairness it was an expensive game (I believe my friend paid about £60 for it - it's my turn to buy S2 when that comes out) and for that money we got 6 or 7 sessions - him, myself and both our wives - we'd get together, have dinner and maybe a drink or two - play two or three games of Pandemic Legacy and maybe mix in some other games if we weren't really in the mood and generally have a great time hanging out. \n\nMy friend and I already got on well, but as a result of the game all four of us ended up close friends that have continued to play together since completing the game - and in retrospect that seems a very small price to pay - and one I'll be looking forward to paying again one S2 comes out. \n\nOne thing I would say however, is that I don't want the market to flood - I'm fine with Legacy games being a fairly niche market, much like Campaign games - I don't have unlimited time to play games, and while I'm happy to commit to a long running game I'd struggle to commit to more than one at a time if I want to have time to play other stuff as well! As it is now First Martians has slipped I'm a little concerned about balancing that with Pandemic S2 - both of which are due around Gencon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Got to say I&amp;#39;m getting really bored of the debate over Legacy-style games and I really don&amp;#39;t understand why it&amp;#39;s such a big deal - the primary argument is down to the destructive nature of Legacy games - the decisions you make and permanently etched into the fabric of that copy of the game, preventing you from replaying or reselling the game. &lt;/p&gt;\n\n&lt;p&gt;So for the anti-legacy crown this permanence is a big deal, that you&amp;#39;re casting money into a one-way transaction that you can&amp;#39;t recoup by either reselling it or playing it til it falls apart in your hands. &lt;/p&gt;\n\n&lt;p&gt;For the pro-legacy crowd this is actually part of the appeal - that the choices you make have an undeniable permanence to them beyond that of any campaign game I know about - it adds a stress and intensity to the proceedings that people &lt;em&gt;really&lt;/em&gt; respond to. &lt;/p&gt;\n\n&lt;p&gt;What I don&amp;#39;t get is why people are so agitated about it - why on earth do the anti-legacy people get so up in arms about it? There are three headline Legacy games at this point. Three, in SIX years. How many other games have been released in that time? If you don&amp;#39;t like the Legacy concept that&amp;#39;s fine, everyone is entitled to their opinion but surely you can find something more to your tastes in the hundreds of other games released in the same time?&lt;/p&gt;\n\n&lt;p&gt;I &lt;em&gt;loved&lt;/em&gt; playing Pandemic Legacy - I found it a tense and enjoyable game across all 16 of the games it took to get us through to the end, and having completed the story I have exactly &lt;em&gt;zero&lt;/em&gt; desire to play it again - there is no way my knowledge of the story that is to come wouldn&amp;#39;t colour my actions should I try to play it again. &lt;/p&gt;\n\n&lt;p&gt;So of course that then leaves the resale argument - and in fairness it was an expensive game (I believe my friend paid about £60 for it - it&amp;#39;s my turn to buy S2 when that comes out) and for that money we got 6 or 7 sessions - him, myself and both our wives - we&amp;#39;d get together, have dinner and maybe a drink or two - play two or three games of Pandemic Legacy and maybe mix in some other games if we weren&amp;#39;t really in the mood and generally have a great time hanging out. &lt;/p&gt;\n\n&lt;p&gt;My friend and I already got on well, but as a result of the game all four of us ended up close friends that have continued to play together since completing the game - and in retrospect that seems a very small price to pay - and one I&amp;#39;ll be looking forward to paying again one S2 comes out. &lt;/p&gt;\n\n&lt;p&gt;One thing I would say however, is that I don&amp;#39;t want the market to flood - I&amp;#39;m fine with Legacy games being a fairly niche market, much like Campaign games - I don&amp;#39;t have unlimited time to play games, and while I&amp;#39;m happy to commit to a long running game I&amp;#39;d struggle to commit to more than one at a time if I want to have time to play other stuff as well! As it is now First Martians has slipped I&amp;#39;m a little concerned about balancing that with Pandemic S2 - both of which are due around Gencon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7kozm", "score_hidden": false, "stickied": false, "created": 1492120671.0, "created_utc": 1492091871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg9ayys", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BosonMichael", "parent_id": "t1_dg97smw", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Thanks. It's been long, but I'm hoping it will eventually be worth it. The light at the end of the tunnel is approaching...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. It&amp;#39;s been long, but I&amp;#39;m hoping it will eventually be worth it. The light at the end of the tunnel is approaching...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg9ayys", "score_hidden": false, "stickied": false, "created": 1492213782.0, "created_utc": 1492184982.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97smw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JB4GDI", "parent_id": "t1_dg7uwyo", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Please do!  Also, good luck with the base game.  I can't imagine all the headaches that come from working with a licenced IP.", "edited": 1492181344.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please do!  Also, good luck with the base game.  I can&amp;#39;t imagine all the headaches that come from working with a licenced IP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg97smw", "score_hidden": false, "stickied": false, "created": 1492209933.0, "created_utc": 1492181133.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7uwyo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BosonMichael", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "If **Warehouse 13: The Board Game** takes off well, we plan to create a Legacy version where the players play out a 13-game \"season\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If &lt;strong&gt;Warehouse 13: The Board Game&lt;/strong&gt; takes off well, we plan to create a Legacy version where the players play out a 13-game &amp;quot;season&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7uwyo", "score_hidden": false, "stickied": false, "created": 1492131962.0, "created_utc": 1492103162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6hobt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "easto1a", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I feel they are both great and need improvement. They add a lot to the game. Look at pandemic the evolving nature of the game adds a new element to the game. However the stickers on the board mean it's hard to use the board post a legacy run through. Also I'd like to see replayability via player choices of cards.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel they are both great and need improvement. They add a lot to the game. Look at pandemic the evolving nature of the game adds a new element to the game. However the stickers on the board mean it&amp;#39;s hard to use the board post a legacy run through. Also I&amp;#39;d like to see replayability via player choices of cards.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6hobt", "score_hidden": false, "stickied": false, "created": 1492057235.0, "created_utc": 1492028435.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg9f0uj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CrushyOfTheSeas", "parent_id": "t1_dg71yht", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Simplest answer is because there are more gamers in the world than just Nathan and many, many people enjoy the legacy aspect.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Simplest answer is because there are more gamers in the world than just Nathan and many, many people enjoy the legacy aspect.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg9f0uj", "score_hidden": false, "stickied": false, "created": 1492218322.0, "created_utc": 1492189522.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71yht", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nathan555", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Why should there be more legacy games?\n\nEvery time I've tried a legacy game, I make plans to play it with my group every 2 weeks or whatever. And I feel STUCK. I'm trapped playing the same game again and again and the added legacy value is minimal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why should there be more legacy games?&lt;/p&gt;\n\n&lt;p&gt;Every time I&amp;#39;ve tried a legacy game, I make plans to play it with my group every 2 weeks or whatever. And I feel STUCK. I&amp;#39;m trapped playing the same game again and again and the added legacy value is minimal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg71yht", "score_hidden": false, "stickied": false, "created": 1492081795.0, "created_utc": 1492052995.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg73zxq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shitloadofbooks", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I think I could design 2 games in the same amount of time it would take to design, playtest and balance enough twists and content for 1 \"Legacy\" game.\n\nIn my experience the amount of people turned off by Legacy games seems to be about equal to the amount who are turned on _(errr)_ by the thought, so there's no huge incentive to produce a Legacy game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I could design 2 games in the same amount of time it would take to design, playtest and balance enough twists and content for 1 &amp;quot;Legacy&amp;quot; game.&lt;/p&gt;\n\n&lt;p&gt;In my experience the amount of people turned off by Legacy games seems to be about equal to the amount who are turned on &lt;em&gt;(errr)&lt;/em&gt; by the thought, so there&amp;#39;s no huge incentive to produce a Legacy game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg73zxq", "score_hidden": false, "stickied": false, "created": 1492084741.0, "created_utc": 1492055941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7c969", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sebenko", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "They're the boardgame equivalent of those stickerbooks I had as a kid- I don't want my boardgame to end up covered in misplaced stickers and pen scrawling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re the boardgame equivalent of those stickerbooks I had as a kid- I don&amp;#39;t want my boardgame to end up covered in misplaced stickers and pen scrawling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7c969", "score_hidden": false, "stickied": false, "created": 1492103487.0, "created_utc": 1492074687.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7h263", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tbaileysr", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Here is the reason I shy from them. Our game group likes variety. If you play a Legacy game you must play that game each game night. Some folks come one night and not the next. So even if we decided to play legacy not everyone would make it to each session. For us that would be an issue. I even tried starting Pandemic Legacy at home. But my teenage daughter loves our game group game night but it is near impossible to get her to play at home. So we got 2 plays in and have not played since.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here is the reason I shy from them. Our game group likes variety. If you play a Legacy game you must play that game each game night. Some folks come one night and not the next. So even if we decided to play legacy not everyone would make it to each session. For us that would be an issue. I even tried starting Pandemic Legacy at home. But my teenage daughter loves our game group game night but it is near impossible to get her to play at home. So we got 2 plays in and have not played since.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7h263", "score_hidden": false, "stickied": false, "created": 1492115450.0, "created_utc": 1492086650.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg6ln5i", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Rutherford82", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 1, "body": "I'm not interested in legacy board games, as permanently altering a game seems foolish to me.  I'm currently looking to \"legacy-proof\" my copy of Gloomhaven so that I can play it more than one time.\n\nTo me, it's a novelty similar to 3D films.  Legacy games will have their time in the sun and will fade into obscurity not long after.\n\nI can understand the novelty, but it's a penny short of a pound, as a game with no replayability is worthless to me.\n\nI wonder what the next boardgame fad will be.  Real world objects incorporated into the game?  Edible components?  Thrilling stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not interested in legacy board games, as permanently altering a game seems foolish to me.  I&amp;#39;m currently looking to &amp;quot;legacy-proof&amp;quot; my copy of Gloomhaven so that I can play it more than one time.&lt;/p&gt;\n\n&lt;p&gt;To me, it&amp;#39;s a novelty similar to 3D films.  Legacy games will have their time in the sun and will fade into obscurity not long after.&lt;/p&gt;\n\n&lt;p&gt;I can understand the novelty, but it&amp;#39;s a penny short of a pound, as a game with no replayability is worthless to me.&lt;/p&gt;\n\n&lt;p&gt;I wonder what the next boardgame fad will be.  Real world objects incorporated into the game?  Edible components?  Thrilling stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6ln5i", "score_hidden": false, "stickied": false, "created": 1492061587.0, "created_utc": 1492032787.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_64zbqs", "likes": null, "replies": "", "user_reports": [], "id": "dg7z290", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GustyAeroplane", "parent_id": "t1_dg6t3ah", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "....Actually I'm not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;....Actually I&amp;#39;m not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg7z290", "score_hidden": false, "stickied": false, "created": 1492136375.0, "created_utc": 1492107575.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6t3ah", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "GustyAeroplane", "parent_id": "t3_64zbqs", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Because they suck.\n\n\n... Just kidding, just kidding.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because they suck.&lt;/p&gt;\n\n&lt;p&gt;... Just kidding, just kidding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dg6t3ah", "score_hidden": false, "stickied": false, "created": 1492070777.0, "created_utc": 1492041977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]