[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "boardgames", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a (kinda) weekly Descent game that seems to be running into some strife. Myself and one other player are the most active strategists and planners. I am the overlord, and the other plays one of the heroes. The other three players all have lesser and varying degrees of participation. In particular, two players seem content to just say &amp;quot;just put me wherever you want me to go.&amp;quot; They occasionally bring knitting, etc. to the table as well.&lt;br/&gt;\nThis past game I noticed that the active player was getting particularly frustrated with the situation. The heroes were in a tough position, and he was trying to figure out how to win. It really ended up being me vs. one player (who was really trying not to control the whole thing).&lt;br/&gt;\nAny advice for dealing with this? The less active players both say they want to be there, and that they have a good time. At the same time, it&amp;#39;s a little frustrating to be playing with people who seem to be indifferent to the game.&lt;br/&gt;\nEDIT: Thanks for the replies. I think this may be a rare case that I should talk to the more enthusiastic player. Last week may have just been a one-time incident (other things going on, etc.). Both of the less active players seem to want to be there and play Descent, so I just have to make sure that everyone is aware of and okay with the dynamic we have.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have a (kinda) weekly Descent game that seems to be running into some strife. Myself and one other player are the most active strategists and planners. I am the overlord, and the other plays one of the heroes. The other three players all have lesser and varying degrees of participation. In particular, two players seem content to just say \"just put me wherever you want me to go.\" They occasionally bring knitting, etc. to the table as well.   \nThis past game I noticed that the active player was getting particularly frustrated with the situation. The heroes were in a tough position, and he was trying to figure out how to win. It really ended up being me vs. one player (who was really trying not to control the whole thing).  \nAny advice for dealing with this? The less active players both say they want to be there, and that they have a good time. At the same time, it's a little frustrating to be playing with people who seem to be indifferent to the game.   \nEDIT: Thanks for the replies. I think this may be a rare case that I should talk to the more enthusiastic player. Last week may have just been a one-time incident (other things going on, etc.). Both of the less active players seem to want to be there and play Descent, so I just have to make sure that everyone is aware of and okay with the dynamic we have.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65n5pc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "Darwins_Dog", "saved": false, "mod_reports": [], "name": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "approved_by": null, "over_18": false, "domain": "self.boardgames", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmjp", "edited": 1492351434.0, "link_flair_css_class": null, "author_flair_css_class": "descent", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/boardgames/comments/65n5pc/players_who_want_to_play_be_present_but_dont_want/", "num_reports": null, "locked": false, "stickied": false, "created": 1492341567.0, "url": "https://www.reddit.com/r/boardgames/comments/65n5pc/players_who_want_to_play_be_present_but_dont_want/", "author_flair_text": "Descent", "quarantine": false, "title": "Players who want to play (be present), but don't want to play (participate).", "created_utc": 1492312767.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 23, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbu5jp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "N00bLinuXCraft", "parent_id": "t1_dgbnvj2", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "This is a great answer and something to keep in mind! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a great answer and something to keep in mind! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbu5jp", "score_hidden": false, "stickied": false, "created": 1492358515.0, "created_utc": 1492329715.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgc3uct", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ErgonomicCat", "parent_id": "t1_dgbnvj2", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I sort of want every other comment to be hidden, and this one to come to the forefront.\n\nPeople enjoy things in different ways.  My wife knits during pretty much anything she does when she can.  Doesn't mean she's not enjoying what's going on.  Just that she also likes knitting.\n\nReally, everyone needs to read this.  I'm not saying Robin Laws is a supernatural being with god-like levels of insight.  But for that book in particular, it's hard *not* to say that.  ;)\n\nAs has come up in the comments - all the players want to be playing Descent.  I feel like there's a subtle \"Well, they're girls, you probably made them play Descent and they don't want to\" thread that people are probably not even doing consciously.  But they want to play.  They just want to play in their own ways.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sort of want every other comment to be hidden, and this one to come to the forefront.&lt;/p&gt;\n\n&lt;p&gt;People enjoy things in different ways.  My wife knits during pretty much anything she does when she can.  Doesn&amp;#39;t mean she&amp;#39;s not enjoying what&amp;#39;s going on.  Just that she also likes knitting.&lt;/p&gt;\n\n&lt;p&gt;Really, everyone needs to read this.  I&amp;#39;m not saying Robin Laws is a supernatural being with god-like levels of insight.  But for that book in particular, it&amp;#39;s hard &lt;em&gt;not&lt;/em&gt; to say that.  ;)&lt;/p&gt;\n\n&lt;p&gt;As has come up in the comments - all the players want to be playing Descent.  I feel like there&amp;#39;s a subtle &amp;quot;Well, they&amp;#39;re girls, you probably made them play Descent and they don&amp;#39;t want to&amp;quot; thread that people are probably not even doing consciously.  But they want to play.  They just want to play in their own ways.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgc3uct", "score_hidden": false, "stickied": false, "created": 1492383066.0, "created_utc": 1492354266.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgc1vlc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Darwins_Dog", "parent_id": "t1_dgbnvj2", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I've read Robin's Laws before, and it's good to have a reminder. Both players are fun to have at the table, and they both tell me they have fun. I know it just doesn't work to try to change the type of gamer that someone is. Definitely something worth knowing about any game group.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read Robin&amp;#39;s Laws before, and it&amp;#39;s good to have a reminder. Both players are fun to have at the table, and they both tell me they have fun. I know it just doesn&amp;#39;t work to try to change the type of gamer that someone is. Definitely something worth knowing about any game group.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgc1vlc", "score_hidden": false, "stickied": false, "created": 1492379945.0, "created_utc": 1492351145.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnvj2", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "Mourningblade", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Robin D. Laws has a great bit on this kind of person in his pamphlet \"Robin's Laws of Good Game Mastering\".\n\n&gt; *The Casual Gamer* is often forgotten in discussions of this sort, but almost every group has one. Casual gamers tend to be low key folks who are uncomfortable taking center stage even in a small group. Often, they’re present to hang out with the group, and game just because it happens to be the activity everyone else has chosen.\n\nI really like his emphasis on the positive aspects of Casual Gamers:\n\n&gt; Though they’re elusive creatures, casual gamers can be vitally important to a gaming group’s survival. They fill out the ranks, which is especially important in games that spread vital PC abilities across a wide number of character types or classes. Especially if they’re present mostly for social reasons, they may fill an important role in the group’s interpersonal dynamic. Often they’re the mellow, moderating types who keep the more assertive personalities from each other’s throats – in or out of character.\n\nDo your knitters fulfill a social role or bring the group together nicely? Just because they don't bring a fervent desire to win, don't ignore their contribution. With thematic games like Descent, I've seen many Casual Gamers want to help out the group while also wanting to embrace their inner Xena (or whatever is appropriate) - they know they're not the best at the strategy, but they WANT to participate.\n\nLaws goes on to caution on trying to turn a Casual Gamer into someone with more engagement:\n\n&gt; I mention the casual player because the thing he most fervently wants is to remain in the background. He doesn’t want to have to learn rules or come up with a plot hook for his character or engage in detailed planning. You may think it’s a bad thing that he sits there for much of the session thumbing through your latest purchases from the comic book store, but hey, that’s what he wants. The last thing you want to do is to force him into a greater degree of participation than he’s comfortable with. (Of course, if everybody in the group is sitting there reading your comic books, you’ve definitely got a problem . . .)\n\nIn board games, many Casual Gamers keep their fear of making the wrong move in check by staying out of the competitive scene. Others want to hang out with their friends whatever they're doing. Don't try to convert these people into A-list players.\n\nOn the other hand, pay close attention to that \"if everybody in the group\" bit above - if enough of the people are not even paying attention to the game, choose something else to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Robin D. Laws has a great bit on this kind of person in his pamphlet &amp;quot;Robin&amp;#39;s Laws of Good Game Mastering&amp;quot;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;The Casual Gamer&lt;/em&gt; is often forgotten in discussions of this sort, but almost every group has one. Casual gamers tend to be low key folks who are uncomfortable taking center stage even in a small group. Often, they’re present to hang out with the group, and game just because it happens to be the activity everyone else has chosen.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I really like his emphasis on the positive aspects of Casual Gamers:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Though they’re elusive creatures, casual gamers can be vitally important to a gaming group’s survival. They fill out the ranks, which is especially important in games that spread vital PC abilities across a wide number of character types or classes. Especially if they’re present mostly for social reasons, they may fill an important role in the group’s interpersonal dynamic. Often they’re the mellow, moderating types who keep the more assertive personalities from each other’s throats – in or out of character.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do your knitters fulfill a social role or bring the group together nicely? Just because they don&amp;#39;t bring a fervent desire to win, don&amp;#39;t ignore their contribution. With thematic games like Descent, I&amp;#39;ve seen many Casual Gamers want to help out the group while also wanting to embrace their inner Xena (or whatever is appropriate) - they know they&amp;#39;re not the best at the strategy, but they WANT to participate.&lt;/p&gt;\n\n&lt;p&gt;Laws goes on to caution on trying to turn a Casual Gamer into someone with more engagement:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I mention the casual player because the thing he most fervently wants is to remain in the background. He doesn’t want to have to learn rules or come up with a plot hook for his character or engage in detailed planning. You may think it’s a bad thing that he sits there for much of the session thumbing through your latest purchases from the comic book store, but hey, that’s what he wants. The last thing you want to do is to force him into a greater degree of participation than he’s comfortable with. (Of course, if everybody in the group is sitting there reading your comic books, you’ve definitely got a problem . . .)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In board games, many Casual Gamers keep their fear of making the wrong move in check by staying out of the competitive scene. Others want to hang out with their friends whatever they&amp;#39;re doing. Don&amp;#39;t try to convert these people into A-list players.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, pay close attention to that &amp;quot;if everybody in the group&amp;quot; bit above - if enough of the people are not even paying attention to the game, choose something else to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbnvj2", "score_hidden": false, "stickied": false, "created": 1492344655.0, "created_utc": 1492315855.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbv268", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "bleepbloopbleep3000", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Lots of comments about talking to them, telling them how you feel.\n\nTo me, as a frequent host of game nights, I think you need to find a game that suits them better. Maybe you've already played tons of different games with these same people, in which case this advice is useless for you. If that's not the case, get them more involved by finding a game that they want to be more involved in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of comments about talking to them, telling them how you feel.&lt;/p&gt;\n\n&lt;p&gt;To me, as a frequent host of game nights, I think you need to find a game that suits them better. Maybe you&amp;#39;ve already played tons of different games with these same people, in which case this advice is useless for you. If that&amp;#39;s not the case, get them more involved by finding a game that they want to be more involved in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbv268", "score_hidden": false, "stickied": false, "created": 1492361440.0, "created_utc": 1492332640.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgd85pv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ArmHeadLeg", "parent_id": "t1_dgc1g3h", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Ok, in that case I'd say that it is either a mismatch in expectations or mismatch in play style. It could be that they just want to go around and hack and slash and see what happens while for the two more serious players they want to have the challenge and try to win. Since they feel like the outcome is less important for them than for the other they let the other decide so that they don't 'ruin the game'. I'm not saying this is the case, but I know this can happen. I guess my point is it may be a mismatch in what you and the 'non-serious' gamers want the game to be. If that is the case then your play style may make it unfun for them leading to them being less involved. \n\nWith that in mind my advice is to avoid going in to the conversation saying that their play style makes it unfun for you (because it might be the same for them). Rather, ask them why they aren't more involved and then take it from there. It could be that you just have to accept that they are perfectly happy with some hack and slash and then let the tough decisions be up to the more involved gamers. If you accept that then the game can be fun for the whole group even though there is a difference in involvement.\n\nSorry for the rambling, but I hope it gives some new perspectives. Best of luck.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, in that case I&amp;#39;d say that it is either a mismatch in expectations or mismatch in play style. It could be that they just want to go around and hack and slash and see what happens while for the two more serious players they want to have the challenge and try to win. Since they feel like the outcome is less important for them than for the other they let the other decide so that they don&amp;#39;t &amp;#39;ruin the game&amp;#39;. I&amp;#39;m not saying this is the case, but I know this can happen. I guess my point is it may be a mismatch in what you and the &amp;#39;non-serious&amp;#39; gamers want the game to be. If that is the case then your play style may make it unfun for them leading to them being less involved. &lt;/p&gt;\n\n&lt;p&gt;With that in mind my advice is to avoid going in to the conversation saying that their play style makes it unfun for you (because it might be the same for them). Rather, ask them why they aren&amp;#39;t more involved and then take it from there. It could be that you just have to accept that they are perfectly happy with some hack and slash and then let the tough decisions be up to the more involved gamers. If you accept that then the game can be fun for the whole group even though there is a difference in involvement.&lt;/p&gt;\n\n&lt;p&gt;Sorry for the rambling, but I hope it gives some new perspectives. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgd85pv", "score_hidden": false, "stickied": false, "created": 1492440917.0, "created_utc": 1492412117.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1g3h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Darwins_Dog", "parent_id": "t1_dgbvst0", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "We've played other games with similar results. We also went through a two month period where we couldn't play for various reasons, and both of the less interested players told me they couldn't wait to get back to Descent. We've done the app already, but we picked up a fifth player, so it's not an option now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve played other games with similar results. We also went through a two month period where we couldn&amp;#39;t play for various reasons, and both of the less interested players told me they couldn&amp;#39;t wait to get back to Descent. We&amp;#39;ve done the app already, but we picked up a fifth player, so it&amp;#39;s not an option now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgc1g3h", "score_hidden": false, "stickied": false, "created": 1492379176.0, "created_utc": 1492350376.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvst0", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ArmHeadLeg", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Are you sure they want to play Descent at all, have you asked them if they rather want to play something else? How do they act when you play other games?\n\nA friend of mines SO also generally want to be present but seldom wants to play. We often play at his house so that she can join or stay out as she wants. She sits and watch a bit and then go do something else. Maybe this could be a solution? Descent has an app that lets you play coop. You can play together with your gaming friend and let the less interested join as they want. That, or choose another game that will engage them more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you sure they want to play Descent at all, have you asked them if they rather want to play something else? How do they act when you play other games?&lt;/p&gt;\n\n&lt;p&gt;A friend of mines SO also generally want to be present but seldom wants to play. We often play at his house so that she can join or stay out as she wants. She sits and watch a bit and then go do something else. Maybe this could be a solution? Descent has an app that lets you play coop. You can play together with your gaming friend and let the less interested join as they want. That, or choose another game that will engage them more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbvst0", "score_hidden": false, "stickied": false, "created": 1492363950.0, "created_utc": 1492335150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbyg71", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Albatrosson", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "This is really familiar to me, so I'll base my answer on my own experience. YMMV.\n\nMy groups have usually been very mixed gender (likely since I'm a chick and also tend to be the host rather than a +1). But often times, the drivers of any activity are the dudes (whether it be gaming or other). Especially in a cooperative game, the chicks often take a backseat role and will mostly observe or have others practically orchestrate their turn. This is understandable when it's the first playthrough or two, but eventually it becomes habit-- particularly if they're dating one of the dudes. (Though honestly, a lot of this is cultural upbringing and may take a while to shift/depends on personalities.)\n\nThey usually have a desire to be there, they're just more passive in their moves, less confident in their understanding of the game, and/or don't want to ruin someone else's experience. And it becomes EXTREMELY DIFFICULT not to quarterback. Like you have to actively *not* quarterback.\n\nI'd make sure they really want to be playing Descent. Because it doesn't sound like they want to as much as the other players. If they do **really** want to play, it will require a different approach. Actively stop yourselves from directing their turn: don't even provide options unless they're very distressed about making a choice, don't react negatively even if they make a subpar decision. Additionally, you can switch up the roles. Maybe make the two of them jointly play as the overlord vs. the two of you as heroes? That would give them more agency and since they're playing against you, they can't turn to either you or your buddy for help.\n\nAlso consider competitive games to avoid the quarterbacking problem. Give them a chance to choose what to play. If they're not experienced with games, consider starting slow on something like Splendor or Lords of Waterdeep.\n\nAll that said, it can also relate back to the relationships themselves and no game night changes will really fix it. (Example: had a friend who was an active game night participant and loved to be really involved. The next year her boyfriend moved in with her and started to come to game nights. She started bringing more baked goods, more knitting projects, and then showing up less-- even though she had *literally* moved closer so she could make it to game nights more often. Sometimes these things happen.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is really familiar to me, so I&amp;#39;ll base my answer on my own experience. YMMV.&lt;/p&gt;\n\n&lt;p&gt;My groups have usually been very mixed gender (likely since I&amp;#39;m a chick and also tend to be the host rather than a +1). But often times, the drivers of any activity are the dudes (whether it be gaming or other). Especially in a cooperative game, the chicks often take a backseat role and will mostly observe or have others practically orchestrate their turn. This is understandable when it&amp;#39;s the first playthrough or two, but eventually it becomes habit-- particularly if they&amp;#39;re dating one of the dudes. (Though honestly, a lot of this is cultural upbringing and may take a while to shift/depends on personalities.)&lt;/p&gt;\n\n&lt;p&gt;They usually have a desire to be there, they&amp;#39;re just more passive in their moves, less confident in their understanding of the game, and/or don&amp;#39;t want to ruin someone else&amp;#39;s experience. And it becomes EXTREMELY DIFFICULT not to quarterback. Like you have to actively &lt;em&gt;not&lt;/em&gt; quarterback.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d make sure they really want to be playing Descent. Because it doesn&amp;#39;t sound like they want to as much as the other players. If they do &lt;strong&gt;really&lt;/strong&gt; want to play, it will require a different approach. Actively stop yourselves from directing their turn: don&amp;#39;t even provide options unless they&amp;#39;re very distressed about making a choice, don&amp;#39;t react negatively even if they make a subpar decision. Additionally, you can switch up the roles. Maybe make the two of them jointly play as the overlord vs. the two of you as heroes? That would give them more agency and since they&amp;#39;re playing against you, they can&amp;#39;t turn to either you or your buddy for help.&lt;/p&gt;\n\n&lt;p&gt;Also consider competitive games to avoid the quarterbacking problem. Give them a chance to choose what to play. If they&amp;#39;re not experienced with games, consider starting slow on something like Splendor or Lords of Waterdeep.&lt;/p&gt;\n\n&lt;p&gt;All that said, it can also relate back to the relationships themselves and no game night changes will really fix it. (Example: had a friend who was an active game night participant and loved to be really involved. The next year her boyfriend moved in with her and started to come to game nights. She started bringing more baked goods, more knitting projects, and then showing up less-- even though she had &lt;em&gt;literally&lt;/em&gt; moved closer so she could make it to game nights more often. Sometimes these things happen.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbyg71", "score_hidden": false, "stickied": false, "created": 1492372576.0, "created_utc": 1492343776.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbpgc6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Cellard_dweller", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I agree that it's distracting and can take away from the fun of those who want to take things more seriously. Especially when part of the group is doing something else (staring at a phone, knitting, etc) rather than participate.\nIf they're insistent on coming and that they enjoy the chosen game (Descent), then I'm of the opinion that they should give it at least the majority of their attention. \n\nSeeing as your group is composed of two couples and yourself ( my group is the same) and it's two of the SO's which are the lacklustre part of the group, I'd say it's up to your more serious gamer friends to talk to their SO's. Best not to get between a couple. They should explain how it's frustrating to insist on playing only to hand your turn over to someone else. That's seat warming.\n\nI understand couples taking interest in each other's hobbies and encourage it, but not at the expense of everyone's fun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that it&amp;#39;s distracting and can take away from the fun of those who want to take things more seriously. Especially when part of the group is doing something else (staring at a phone, knitting, etc) rather than participate.\nIf they&amp;#39;re insistent on coming and that they enjoy the chosen game (Descent), then I&amp;#39;m of the opinion that they should give it at least the majority of their attention. &lt;/p&gt;\n\n&lt;p&gt;Seeing as your group is composed of two couples and yourself ( my group is the same) and it&amp;#39;s two of the SO&amp;#39;s which are the lacklustre part of the group, I&amp;#39;d say it&amp;#39;s up to your more serious gamer friends to talk to their SO&amp;#39;s. Best not to get between a couple. They should explain how it&amp;#39;s frustrating to insist on playing only to hand your turn over to someone else. That&amp;#39;s seat warming.&lt;/p&gt;\n\n&lt;p&gt;I understand couples taking interest in each other&amp;#39;s hobbies and encourage it, but not at the expense of everyone&amp;#39;s fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbpgc6", "score_hidden": false, "stickied": false, "created": 1492347437.0, "created_utc": 1492318637.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbym8i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "boybogart", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; everyone wants to play Descent\n\nThe SO's might just be too shy to say they prefer another game and is hesitant to say so because they see your enthusiasm or are not yet aware of their gaming preferences so they stay quiet. \n\nThis has happened to us before when we're starting to branch out to dudes on a map game. Me and my bros got together to try it out and we loved it. We shared our enthusiasm to the rest of the group(their sisters), they said they wanna try it out as well but they kinda tuned out once we did. Bought another game the following week and we're back to everyone enjoying the night. \n\nIt won't hurt to try another game just for one evening to see if they're really uninterested in playing or just uninterested in Descent. Beats the awkwardness of trying to ask them why are they knitting in the middle of a game haha\n", "edited": 1492344785.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;everyone wants to play Descent&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The SO&amp;#39;s might just be too shy to say they prefer another game and is hesitant to say so because they see your enthusiasm or are not yet aware of their gaming preferences so they stay quiet. &lt;/p&gt;\n\n&lt;p&gt;This has happened to us before when we&amp;#39;re starting to branch out to dudes on a map game. Me and my bros got together to try it out and we loved it. We shared our enthusiasm to the rest of the group(their sisters), they said they wanna try it out as well but they kinda tuned out once we did. Bought another game the following week and we&amp;#39;re back to everyone enjoying the night. &lt;/p&gt;\n\n&lt;p&gt;It won&amp;#39;t hurt to try another game just for one evening to see if they&amp;#39;re really uninterested in playing or just uninterested in Descent. Beats the awkwardness of trying to ask them why are they knitting in the middle of a game haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbym8i", "score_hidden": false, "stickied": false, "created": 1492373025.0, "created_utc": 1492344225.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgc7dl7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "justkevinmanley", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "My weekly game group has been through a lot of ups and downs. We had issues of inconsistent attendance (of which, I'll admit, I was one of the guilty parties) and some not being fully present even when they were there. We did talk through a lot of the issues we were having and some results included taking some of the pressure off the dogma of \"we will play games every week on X day\". We're a bit more casual about it now and focus more on hanging out. We even let ourselves admit when we are feeling fatigued of certain games and either mix it up by just hanging out and talking or playing lighter games. It's helped the group a lot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My weekly game group has been through a lot of ups and downs. We had issues of inconsistent attendance (of which, I&amp;#39;ll admit, I was one of the guilty parties) and some not being fully present even when they were there. We did talk through a lot of the issues we were having and some results included taking some of the pressure off the dogma of &amp;quot;we will play games every week on X day&amp;quot;. We&amp;#39;re a bit more casual about it now and focus more on hanging out. We even let ourselves admit when we are feeling fatigued of certain games and either mix it up by just hanging out and talking or playing lighter games. It&amp;#39;s helped the group a lot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgc7dl7", "score_hidden": false, "stickied": false, "created": 1492388008.0, "created_utc": 1492359208.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbp5th", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MrAbodi", "parent_id": "t1_dgbnylp", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Talk to them about it and explain how you are feeling", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to them about it and explain how you are feeling&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbp5th", "score_hidden": false, "stickied": false, "created": 1492346897.0, "created_utc": 1492318097.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbvh1i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Veneretio", "parent_id": "t1_dgbpelq", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Yup, really buried the lead on this one. (I kinda suspected it with the knitting comment though)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup, really buried the lead on this one. (I kinda suspected it with the knitting comment though)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbvh1i", "score_hidden": false, "stickied": false, "created": 1492362826.0, "created_utc": 1492334026.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbpelq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LetsWorkTogether", "parent_id": "t1_dgbnylp", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Just a minor detail.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just a minor detail.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbpelq", "score_hidden": false, "stickied": false, "created": 1492347349.0, "created_utc": 1492318549.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgc0u8a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "takabrash", "parent_id": "t1_dgbnylp", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "It's totally an option. If they're not playing, they can just hang out on the couch nearby. Still social time and not hurting anyone else's enjoyment. It's not a big deal to just talk to people about this stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s totally an option. If they&amp;#39;re not playing, they can just hang out on the couch nearby. Still social time and not hurting anyone else&amp;#39;s enjoyment. It&amp;#39;s not a big deal to just talk to people about this stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgc0u8a", "score_hidden": false, "stickied": false, "created": 1492378041.0, "created_utc": 1492349241.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbviv8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Veneretio", "parent_id": "t1_dgbnylp", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Your situation seems really difficult to assess without being in the room. My gut instinct tells me that you may need to just try a different game. Probably something more euro style. Definitely not coop otherwise you'll just frustrate your friend more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your situation seems really difficult to assess without being in the room. My gut instinct tells me that you may need to just try a different game. Probably something more euro style. Definitely not coop otherwise you&amp;#39;ll just frustrate your friend more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbviv8", "score_hidden": false, "stickied": false, "created": 1492363002.0, "created_utc": 1492334202.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgc3xgp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Darwins_Dog", "parent_id": "t1_dgc1i1h", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; Do they though?\n\nWell, everyone has told me that they do (on several occasions, and not always at my prompting). I've asked in the past if anyone wanted to try something different. We occasionally do play something different, but the group seems to want Descent to be played.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Do they though?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, everyone has told me that they do (on several occasions, and not always at my prompting). I&amp;#39;ve asked in the past if anyone wanted to try something different. We occasionally do play something different, but the group seems to want Descent to be played.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgc3xgp", "score_hidden": false, "stickied": false, "created": 1492383195.0, "created_utc": 1492354395.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgd2x7l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bluebird503", "parent_id": "t1_dgc1i1h", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I know someone who asked me over to play a specific game, and knits. They just tend to be knitting whatever they are doing and were quite engaged with the board game. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know someone who asked me over to play a specific game, and knits. They just tend to be knitting whatever they are doing and were quite engaged with the board game. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgd2x7l", "score_hidden": false, "stickied": false, "created": 1492430481.0, "created_utc": 1492401681.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1i1h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Coffeedemon", "parent_id": "t1_dgbnylp", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "&gt; Like I said, everyone wants to play Descent\n\nDo they though? Because bringing knitting seems to imply otherwise. You guys own anything which might be better at fostering some engagement through competition?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Like I said, everyone wants to play Descent&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do they though? Because bringing knitting seems to imply otherwise. You guys own anything which might be better at fostering some engagement through competition?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgc1i1h", "score_hidden": false, "stickied": false, "created": 1492379277.0, "created_utc": 1492350477.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnylp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Darwins_Dog", "parent_id": "t1_dgbmidj", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "I should have mentioned the other wrinkle. The two least interested players are the SO's of the most interested. Excluding them entirely isn't really an option.  \nLike I said, everyone wants to play Descent, so I'm not sure how to handle it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I should have mentioned the other wrinkle. The two least interested players are the SO&amp;#39;s of the most interested. Excluding them entirely isn&amp;#39;t really an option.&lt;br/&gt;\nLike I said, everyone wants to play Descent, so I&amp;#39;m not sure how to handle it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbnylp", "score_hidden": false, "stickied": false, "created": 1492344804.0, "created_utc": 1492316004.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbmidj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rvtk", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 1, "body": "Simply don't play with people who can't focus on the game at hand, they're just wasting your time. Either that or if you insist to play with that particular group, find a game that will actually be involving for everyone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Simply don&amp;#39;t play with people who can&amp;#39;t focus on the game at hand, they&amp;#39;re just wasting your time. Either that or if you insist to play with that particular group, find a game that will actually be involving for everyone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbmidj", "score_hidden": false, "stickied": false, "created": 1492342476.0, "created_utc": 1492313676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmjp", "removal_reason": null, "link_id": "t3_65n5pc", "likes": null, "replies": "", "user_reports": [], "id": "dgbqmpk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MarkDrees", "parent_id": "t3_65n5pc", "subreddit_name_prefixed": "r/boardgames", "controversiality": 0, "body": "Something like:\n\n\"It would make the game more fun, and mean a lot to me, if everyone would engage a bit more when we play.\"\n\nI mean, it's not an unreasonable request to ask someone to play a game when they play a game. Obviously don't push them outside of their comfort zone, but I bet they didn't even realize it was an issue for you. Most people are pretty accommodating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something like:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It would make the game more fun, and mean a lot to me, if everyone would engage a bit more when we play.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I mean, it&amp;#39;s not an unreasonable request to ask someone to play a game when they play a game. Obviously don&amp;#39;t push them outside of their comfort zone, but I bet they didn&amp;#39;t even realize it was an issue for you. Most people are pretty accommodating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "boardgames", "name": "t1_dgbqmpk", "score_hidden": false, "stickied": false, "created": 1492349630.0, "created_utc": 1492320830.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]