[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "GetMotivated", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey. First time posting here. No throwaway account, but I&amp;#39;ll still censor the names  by replacing them with Gravity Falls character names.&lt;/p&gt;\n\n&lt;p&gt;So for context I&amp;#39;m 17, it&amp;#39;s my last year of high school (French system, we get an extra year compared to countries like the UK before going to college/university). I used to weight over 90Kg (about 200 pounds for you chaps across the pond), and only recently after a long depression phase (2y ago) did I manage to get down to 72Kg (about 160 lbs). Fast forward a year later, I start to enjoy life, get friends, etc. but end up going through another depression, which lasted a few months and almost resulted in an hospitalization. It&amp;#39;s about the end of November 2016 when I start to get better, and finally start to have some self confidence. But then there&amp;#39;s that story I&amp;#39;m about to tell...&lt;/p&gt;\n\n&lt;p&gt;There was that person I really liked (censored name: Dipper Pines). In fact, I had a crush on Dipper a few years back. We found out we liked the same stuff, and we both speak English fluently which led us to hang out a lot (remember: we&amp;#39;re in France, nobody speaks English correctly). It&amp;#39;s all sweet: we play with cat stickers, bake Christmas cookies, go to each other&amp;#39;s house...&lt;/p&gt;\n\n&lt;p&gt;Which leads us to the next part. We got pretty close, I now have a lot of trust in Dipper. So I told Dipper my secret. Nobody, /nobody/ knew about it before: when I was a child, about 4 or 5, my teacher led me to some white room, told me to undress and face the wall... while the rest of my class was waiting in the classroom. I don&amp;#39;t know what happened, but I guess it&amp;#39;s safe to assume something happened back then. I have no evidence or memory, and any assumption or accusation beyond that point is not supported by any fact... I&amp;#39;m left in doubt. And that secret is the reason why I fear relationships. I&amp;#39;m naive, the kind of person to believe everyone is nice, the kind of person to never say &amp;quot;no&amp;quot; to anyone.&lt;/p&gt;\n\n&lt;p&gt;I feared someone would just use me the way that teacher might have did.&lt;/p&gt;\n\n&lt;p&gt;Dipperknows about it now. Fast forward weeks later: Dipper&amp;#39;s at a party, I&amp;#39;m home. (important bit: I&amp;#39;ve never drank alcohol/been to a party/whatever, I don&amp;#39;t know how drunk people behave). We spent 10h, until 6 in the morning, texting each other... Dipper&amp;#39;s telling me I&amp;#39;m their only reason for not drinking, I&amp;#39;m the best, etc., I feel great until Dipper decides to chug an entire beer can and post it on Snapchat. My trust starts to disappear slowly...&lt;/p&gt;\n\n&lt;p&gt;Fast forward a few hours: we text each other a lot: saying &amp;quot;you&amp;#39;re the best&amp;quot; &amp;quot;I&amp;#39;ll always be there for you&amp;quot; and other sweet stuff. At 6 in the morning, I&amp;#39;m officially in my first relationship. Not gonna lie, I felt pretty good.&lt;/p&gt;\n\n&lt;p&gt;Days later, we get to see each other in person for the first time since then. Now please keep in mind something extremely important: &lt;strong&gt;I&amp;#39;m like, extremely romantic, as in candle dinners/hand-holding beach walks/cuddles while watching stupid movies, etc.&lt;/strong&gt; People used to make fun of me for it, cause apparently a 17y old shouldn&amp;#39;t be interested in anything else than sex. So anyway we have a few hours of free time and decide to hang out at my house. It&amp;#39;s all sweet: I get to hug Dipper, a lot, and eventually Dipper jumps in my bed. (I&amp;#39;m not stupid, I know Dipper wants me there too, but I&amp;#39;m just too shy to join) so after 5m of awkward me standing there and Dipper waiting for me Dipper tells me to come, and the cuddling starts. I enjoy it, it&amp;#39;s all comfy and warm, I get to relax like this for an hour. Dipper then leaves. &lt;strong&gt;At this point, Dipper knows I&amp;#39;m really shy, don&amp;#39;t want to be too forward, and want nothing else than cute cringy romantic stuff.&lt;/strong&gt; Yet Dipper doesn&amp;#39;t want us to be seen together in public. I start to feel really bad, as in really really bad.&lt;/p&gt;\n\n&lt;p&gt;Fast forward days later. I go to Dipper&amp;#39;s place. Nobody&amp;#39;s there but us. I thought we were gonna play but NO it instantly switches to cuddles. And minutes later to undressing. You get the picture. We didn&amp;#39;t do &lt;em&gt;it&lt;/em&gt; though, we just got intimate... Now if you remember what I wrote earlier, I don&amp;#39;t want any of this, especially on the fourth day on my first relationship. I wanted to say no, but couldn&amp;#39;t. I just went along with it thinking that her being happy is the all that would matter... I spend a horrible afternoon. Hours later, when I&amp;#39;m home, Dipper texts me stuff about needing space and being depressed. I start to freak out, and call a friend of both of us.  (censored name: Soos Ramirez). I tell Soos everything. Soos tells me they&amp;#39;ve been together in the past, and that Soos gave Dipper 7 &amp;quot;second chances&amp;quot;. Soos tells me to never give Dipper any. Soos also tells me Dipper never loved me. I freak out, Soos has to leave so I call another friend (censored name: Mabel Pines). Mabel lives 2m away from my house, so we see each other. Mabel is in her first relationship too so it&amp;#39;s solid advice but Mabel convinces me to break up, I do the same day and feel devastated. Dipper used me just like that teacher did even though I told him about it.&lt;/p&gt;\n\n&lt;p&gt;But don&amp;#39;t forget what I wrote earlier. I&amp;#39;m naive. I call back the exact same day apologizing and asking to stay friends (which is exactly what Soos and Mabel told me not to). I felt guilty, maybe Dipper loved me and didn&amp;#39;t know how to show it.&lt;/p&gt;\n\n&lt;p&gt;Fast forward a month later, yesterday. I invited Dipper and Soos to a sleepover but Soos had to stay home (last minute decision. So Dipper is sleeping with me, I feel pretty uncomfortable. But at least Dipper&amp;#39;s got a sleeping bag, right? No. Dipper &amp;quot;forgot&amp;quot; about it. So we have to sleep in the same bed. As we watch movies through the night, it goes from being uncomfortably close to guilt forcing me to cuddle. And it gets intimate again. I start freaking out, almost break down crying, but decide to go with it: after all, doing this must mean Dipper still loves me, right? So I try to forget about my uneasiness, my fear, and decide to go with it. When what had to be done is done, I expect a &amp;quot;I love you&amp;quot; or something... but the all I get is &amp;quot;By the way, you don&amp;#39;t love me anymore, right?&amp;quot;. I felt like I wanted to die. I&amp;#39;ve been used, again. Dipper used me not once but twice in a month.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s it for the story... I don&amp;#39;t know what to do. I feel like a worthless piece of meat used by people. I don&amp;#39;t know what to do, I have nothing to look forward to, I just feel emptiness. The worst part: Dipper still texts me about how she can&amp;#39;t wait for next time.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m here today to ask for your help. I&amp;#39;m sure some of you have been there too. I need help, I really need it. I won&amp;#39;t make it through a third depression.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Potentially useful information in this context:&lt;/p&gt;\n\n&lt;p&gt;Me: 17M&lt;/p&gt;\n\n&lt;p&gt;Dipper: 17F&lt;/p&gt;\n\n&lt;p&gt;Soos: 16F&lt;/p&gt;\n\n&lt;p&gt;Mabel: 18F&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey. First time posting here. No throwaway account, but I'll still censor the names  by replacing them with Gravity Falls character names.\n\nSo for context I'm 17, it's my last year of high school (French system, we get an extra year compared to countries like the UK before going to college/university). I used to weight over 90Kg (about 200 pounds for you chaps across the pond), and only recently after a long depression phase (2y ago) did I manage to get down to 72Kg (about 160 lbs). Fast forward a year later, I start to enjoy life, get friends, etc. but end up going through another depression, which lasted a few months and almost resulted in an hospitalization. It's about the end of November 2016 when I start to get better, and finally start to have some self confidence. But then there's that story I'm about to tell...\n\nThere was that person I really liked (censored name: Dipper Pines). In fact, I had a crush on Dipper a few years back. We found out we liked the same stuff, and we both speak English fluently which led us to hang out a lot (remember: we're in France, nobody speaks English correctly). It's all sweet: we play with cat stickers, bake Christmas cookies, go to each other's house...\n\nWhich leads us to the next part. We got pretty close, I now have a lot of trust in Dipper. So I told Dipper my secret. Nobody, /nobody/ knew about it before: when I was a child, about 4 or 5, my teacher led me to some white room, told me to undress and face the wall... while the rest of my class was waiting in the classroom. I don't know what happened, but I guess it's safe to assume something happened back then. I have no evidence or memory, and any assumption or accusation beyond that point is not supported by any fact... I'm left in doubt. And that secret is the reason why I fear relationships. I'm naive, the kind of person to believe everyone is nice, the kind of person to never say \"no\" to anyone.\n\nI feared someone would just use me the way that teacher might have did.\n\nDipperknows about it now. Fast forward weeks later: Dipper's at a party, I'm home. (important bit: I've never drank alcohol/been to a party/whatever, I don't know how drunk people behave). We spent 10h, until 6 in the morning, texting each other... Dipper's telling me I'm their only reason for not drinking, I'm the best, etc., I feel great until Dipper decides to chug an entire beer can and post it on Snapchat. My trust starts to disappear slowly...\n\nFast forward a few hours: we text each other a lot: saying \"you're the best\" \"I'll always be there for you\" and other sweet stuff. At 6 in the morning, I'm officially in my first relationship. Not gonna lie, I felt pretty good.\n\nDays later, we get to see each other in person for the first time since then. Now please keep in mind something extremely important: **I'm like, extremely romantic, as in candle dinners/hand-holding beach walks/cuddles while watching stupid movies, etc.** People used to make fun of me for it, cause apparently a 17y old shouldn't be interested in anything else than sex. So anyway we have a few hours of free time and decide to hang out at my house. It's all sweet: I get to hug Dipper, a lot, and eventually Dipper jumps in my bed. (I'm not stupid, I know Dipper wants me there too, but I'm just too shy to join) so after 5m of awkward me standing there and Dipper waiting for me Dipper tells me to come, and the cuddling starts. I enjoy it, it's all comfy and warm, I get to relax like this for an hour. Dipper then leaves. **At this point, Dipper knows I'm really shy, don't want to be too forward, and want nothing else than cute cringy romantic stuff.** Yet Dipper doesn't want us to be seen together in public. I start to feel really bad, as in really really bad.\n\nFast forward days later. I go to Dipper's place. Nobody's there but us. I thought we were gonna play but NO it instantly switches to cuddles. And minutes later to undressing. You get the picture. We didn't do *it* though, we just got intimate... Now if you remember what I wrote earlier, I don't want any of this, especially on the fourth day on my first relationship. I wanted to say no, but couldn't. I just went along with it thinking that her being happy is the all that would matter... I spend a horrible afternoon. Hours later, when I'm home, Dipper texts me stuff about needing space and being depressed. I start to freak out, and call a friend of both of us.  (censored name: Soos Ramirez). I tell Soos everything. Soos tells me they've been together in the past, and that Soos gave Dipper 7 \"second chances\". Soos tells me to never give Dipper any. Soos also tells me Dipper never loved me. I freak out, Soos has to leave so I call another friend (censored name: Mabel Pines). Mabel lives 2m away from my house, so we see each other. Mabel is in her first relationship too so it's solid advice but Mabel convinces me to break up, I do the same day and feel devastated. Dipper used me just like that teacher did even though I told him about it.\n\nBut don't forget what I wrote earlier. I'm naive. I call back the exact same day apologizing and asking to stay friends (which is exactly what Soos and Mabel told me not to). I felt guilty, maybe Dipper loved me and didn't know how to show it.\n\nFast forward a month later, yesterday. I invited Dipper and Soos to a sleepover but Soos had to stay home (last minute decision. So Dipper is sleeping with me, I feel pretty uncomfortable. But at least Dipper's got a sleeping bag, right? No. Dipper \"forgot\" about it. So we have to sleep in the same bed. As we watch movies through the night, it goes from being uncomfortably close to guilt forcing me to cuddle. And it gets intimate again. I start freaking out, almost break down crying, but decide to go with it: after all, doing this must mean Dipper still loves me, right? So I try to forget about my uneasiness, my fear, and decide to go with it. When what had to be done is done, I expect a \"I love you\" or something... but the all I get is \"By the way, you don't love me anymore, right?\". I felt like I wanted to die. I've been used, again. Dipper used me not once but twice in a month.\n\nThat's it for the story... I don't know what to do. I feel like a worthless piece of meat used by people. I don't know what to do, I have nothing to look forward to, I just feel emptiness. The worst part: Dipper still texts me about how she can't wait for next time.\n\nI'm here today to ask for your help. I'm sure some of you have been there too. I need help, I really need it. I won't make it through a third depression.\n\n---\n\nPotentially useful information in this context:\n\nMe: 17M\n\nDipper: 17F\n\nSoos: 16F\n\nMabel: 18F", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "", "id": "64mkw9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "Garuda1Talisman", "saved": false, "mod_reports": [], "name": "t3_64mkw9", "subreddit_name_prefixed": "r/GetMotivated", "approved_by": null, "over_18": false, "domain": "self.GetMotivated", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rmfx", "edited": 1491862510.0, "link_flair_css_class": "story", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/GetMotivated/comments/64mkw9/story_cancerous_abusive_relationship/", "num_reports": null, "locked": false, "stickied": false, "created": 1491889176.0, "url": "https://www.reddit.com/r/GetMotivated/comments/64mkw9/story_cancerous_abusive_relationship/", "author_flair_text": null, "quarantine": false, "title": "[Story] Cancerous, abusive relationship", "created_utc": 1491860376.0, "distinguished": null, "media": null, "upvote_ratio": 0.66, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64mkw9", "likes": null, "replies": "", "user_reports": [], "id": "dg3dktd", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "AwesomeJG", "parent_id": "t3_64mkw9", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "get out of there man, that kind of relationship ain't good for you. Just block their number and get out. Stay friends with the others if you want but just avoid \"dipper\" like the plague. Or tell him to f**k off then Get out but your choice there", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;get out of there man, that kind of relationship ain&amp;#39;t good for you. Just block their number and get out. Stay friends with the others if you want but just avoid &amp;quot;dipper&amp;quot; like the plague. Or tell him to f**k off then Get out but your choice there&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg3dktd", "score_hidden": false, "stickied": false, "created": 1491891253.0, "created_utc": 1491862453.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64mkw9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64mkw9", "likes": null, "replies": "", "user_reports": [], "id": "dg44zjy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Garuda1Talisman", "parent_id": "t1_dg3xphp", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "Well, thank you for taking the time to write such a long wall of text, I'm glad to know I'm not the only one to deal with such situations. Have a [HD potato](http://i.imgur.com/AcEQevW.jpg) as a thank you :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, thank you for taking the time to write such a long wall of text, I&amp;#39;m glad to know I&amp;#39;m not the only one to deal with such situations. Have a &lt;a href=\"http://i.imgur.com/AcEQevW.jpg\"&gt;HD potato&lt;/a&gt; as a thank you :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg44zjy", "score_hidden": false, "stickied": false, "created": 1491939432.0, "created_utc": 1491910632.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3xphp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "snicknicky", "parent_id": "t3_64mkw9", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "Dang, for speaking English as a second language, you're better at it than I am. \nBut yo, when I was 17 I was super into a guy that I'll call Nero. Nero was my section leader in band and I looked up to him a lot. We did the whole texting thing and awkwardly admitted that we liked each other etc. I'd never been with or kissed anyone- so even when he did off-color things like tell me what a bad driver I am since I'm a girl or completely ignore me when his friends were around- I just looked passed it and felt lucky that he liked me. He asked me to keep 'us' a secret and I didn't think much of it at the time. He tried to show me a lot of sex-based humor on YouTube that made me uncomfortable and I uncomfortably told him it wasn't my thing- a little later he ended things pretty quick and stopped speaking to me for a few months until he went out with my best friend and excitedly told everyone about it. It hurt that she was worth telling people about but not I guess I wasn't. \n\nNow fast forward a lot. Their relationship deteriorated when she went to college and he became extremely controlling and she resented it a lot. They eventually broke up but It wasn't till just a year ago she admitted to me that he had slowly pushed her to do things she was uncomfortable with until he actually ended up raping her. \n\nI didn't end up being in an actual healthy relationship till I was almost 22- but the guy I'm with now is honest and sincere and caring and respectful and THATS the kind of person you deserve. I honestly never even think about Nero anymore and I don't feel bad about the stupid crap he did. (Except I hate what he did to my best friend)It took a long time to feel better at the time- but eventually I couldn't help but realize that he was abusive in a multiplicity of ways and not really worth wasting time thinking about. \n\nThe fact that dipper hurt you says more about her than you. People who basically lie every time they say \"I love you\" and barely hesitate to use others are just not worth the time we spend crying over them. Distance yourself from her and avoid even letting your mind wander to the pain she caused you and you won't regret it. You have a bright future. I can genuinely say that because at 17 after Nero proudly went out with my best friend- I could have never imagined how happy I'd be today. You can't even imagine how much better someone is going to treat you someday. Just hang in there :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dang, for speaking English as a second language, you&amp;#39;re better at it than I am. \nBut yo, when I was 17 I was super into a guy that I&amp;#39;ll call Nero. Nero was my section leader in band and I looked up to him a lot. We did the whole texting thing and awkwardly admitted that we liked each other etc. I&amp;#39;d never been with or kissed anyone- so even when he did off-color things like tell me what a bad driver I am since I&amp;#39;m a girl or completely ignore me when his friends were around- I just looked passed it and felt lucky that he liked me. He asked me to keep &amp;#39;us&amp;#39; a secret and I didn&amp;#39;t think much of it at the time. He tried to show me a lot of sex-based humor on YouTube that made me uncomfortable and I uncomfortably told him it wasn&amp;#39;t my thing- a little later he ended things pretty quick and stopped speaking to me for a few months until he went out with my best friend and excitedly told everyone about it. It hurt that she was worth telling people about but not I guess I wasn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Now fast forward a lot. Their relationship deteriorated when she went to college and he became extremely controlling and she resented it a lot. They eventually broke up but It wasn&amp;#39;t till just a year ago she admitted to me that he had slowly pushed her to do things she was uncomfortable with until he actually ended up raping her. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t end up being in an actual healthy relationship till I was almost 22- but the guy I&amp;#39;m with now is honest and sincere and caring and respectful and THATS the kind of person you deserve. I honestly never even think about Nero anymore and I don&amp;#39;t feel bad about the stupid crap he did. (Except I hate what he did to my best friend)It took a long time to feel better at the time- but eventually I couldn&amp;#39;t help but realize that he was abusive in a multiplicity of ways and not really worth wasting time thinking about. &lt;/p&gt;\n\n&lt;p&gt;The fact that dipper hurt you says more about her than you. People who basically lie every time they say &amp;quot;I love you&amp;quot; and barely hesitate to use others are just not worth the time we spend crying over them. Distance yourself from her and avoid even letting your mind wander to the pain she caused you and you won&amp;#39;t regret it. You have a bright future. I can genuinely say that because at 17 after Nero proudly went out with my best friend- I could have never imagined how happy I&amp;#39;d be today. You can&amp;#39;t even imagine how much better someone is going to treat you someday. Just hang in there :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg3xphp", "score_hidden": false, "stickied": false, "created": 1491919265.0, "created_utc": 1491890465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64mkw9", "likes": null, "replies": "", "user_reports": [], "id": "dg4s6pc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "phubans", "parent_id": "t3_64mkw9", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "How is this supposed to be motivational? I think you posted this to the wrong sub. My advice would be to, well, \"man up.\" I honestly had the impression you were the girl in this story and Dipper was a guy until the genders were clarified at the end. You can still have all these feelings and sensitivities as a man without letting people walk all over you. Take your friend's advice and get away from this person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How is this supposed to be motivational? I think you posted this to the wrong sub. My advice would be to, well, &amp;quot;man up.&amp;quot; I honestly had the impression you were the girl in this story and Dipper was a guy until the genders were clarified at the end. You can still have all these feelings and sensitivities as a man without letting people walk all over you. Take your friend&amp;#39;s advice and get away from this person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg4s6pc", "score_hidden": false, "stickied": false, "created": 1491967893.0, "created_utc": 1491939093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]