[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "GetMotivated", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know how to begin. &lt;/p&gt;\n\n&lt;p&gt;Last year, around February or March, I realized I had depression and I wanted to fix everything wrong with me. I was worried about my future so I was doing my best at college, I have never had a girlfriend so I tried to get one, I wanted to get a job so I started to look for one, I was overweight and I started to workout.&lt;/p&gt;\n\n&lt;p&gt;So far everything was going great in the first 6 months. I got a GPA of 3.4 and I received a letter from college that congratulated me for my grades. I got a job during the summer that helped me a lot with my expenses. I lost 30 pounds and I felt healthier. Although I did not get a girlfriend, it was not a big deal for me. However, after those 6 months, I lost all motivation to continue. &lt;/p&gt;\n\n&lt;p&gt;By the time I am writing this post, I am about to fail a pre-calculus course. After my summer job, I haven&amp;#39;t been able to get another job. I lost any interest in get a girlfriend. I have gained the 30 pounds I had lost, and I don&amp;#39;t feel with the same motivation to work out. Depression has completely overcome me. I sleep the most part of the afternoon and I have insomnia. Sometimes I barely sleep 4 hours during night. I get distracted so easily, and suddenly I get anxiety attacks. I don&amp;#39;t know what is happening to me now. Everything went wrong so fast and I did nothing to fix as soon as possible. I feel like everytime I try to fix something it gets worse.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if this is the right place to post this, but a need some advise.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know how to begin. \n\nLast year, around February or March, I realized I had depression and I wanted to fix everything wrong with me. I was worried about my future so I was doing my best at college, I have never had a girlfriend so I tried to get one, I wanted to get a job so I started to look for one, I was overweight and I started to workout.\n\nSo far everything was going great in the first 6 months. I got a GPA of 3.4 and I received a letter from college that congratulated me for my grades. I got a job during the summer that helped me a lot with my expenses. I lost 30 pounds and I felt healthier. Although I did not get a girlfriend, it was not a big deal for me. However, after those 6 months, I lost all motivation to continue. \n\nBy the time I am writing this post, I am about to fail a pre-calculus course. After my summer job, I haven't been able to get another job. I lost any interest in get a girlfriend. I have gained the 30 pounds I had lost, and I don't feel with the same motivation to work out. Depression has completely overcome me. I sleep the most part of the afternoon and I have insomnia. Sometimes I barely sleep 4 hours during night. I get distracted so easily, and suddenly I get anxiety attacks. I don't know what is happening to me now. Everything went wrong so fast and I did nothing to fix as soon as possible. I feel like everytime I try to fix something it gets worse.\n\nI don't know if this is the right place to post this, but a need some advise.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qr34", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "BasementOnFire", "saved": false, "mod_reports": [], "name": "t3_64qr34", "subreddit_name_prefixed": "r/GetMotivated", "approved_by": null, "over_18": false, "domain": "self.GetMotivated", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rmfx", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/GetMotivated/comments/64qr34/discussion_i_have_lost_all_motivation_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1491945510.0, "url": "https://www.reddit.com/r/GetMotivated/comments/64qr34/discussion_i_have_lost_all_motivation_and/", "author_flair_text": null, "quarantine": false, "title": "[Discussion] I have lost all motivation, and depression has overcome me", "created_utc": 1491916710.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64qr34", "likes": null, "replies": "", "user_reports": [], "id": "dg4g2yn", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "K-Linton", "parent_id": "t3_64qr34", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "It sounds to me like you have proven to yourself that you are *able* to help yourself, but you have currently lost the will to do so. I think there are two ways to move forward:\nEither find the will outside of yourself, as in, do it for an external reason or another person **or**  the harder way which is to face yourself and stare hard, forcing yourself to carry on with the better habits and self control. I want to remind you that this is a feeling (or lack thereof) that you have right now, and things will always change. Maybe better maybe worse, but that change happens and you can't help it. Perhaps you are in a rut, but facing that, and being aware is a great start.   You have come here and posted, asking for help. Which means, you want change and you think yourself worthwhile so you are seeking help. That is fantastic news.\n\nI watched a Ted Talk and this woman had three points about courage but one thing will always stay in my mind. She said \"Act in the face of overwhelm.\"\n\nYou might be overwhelmed right now, realizing things have gone way out of order in your life. But you have everything you need to change it.  You can find the drive. Even if you don't get driven and go nuts and make all of these amazing changes like you did the first time, you can still choose every day to do the better thing for yourself. That's still drive, and it's still change. \n\nTalking with people helps and I think you should continue to reach out. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds to me like you have proven to yourself that you are &lt;em&gt;able&lt;/em&gt; to help yourself, but you have currently lost the will to do so. I think there are two ways to move forward:\nEither find the will outside of yourself, as in, do it for an external reason or another person &lt;strong&gt;or&lt;/strong&gt;  the harder way which is to face yourself and stare hard, forcing yourself to carry on with the better habits and self control. I want to remind you that this is a feeling (or lack thereof) that you have right now, and things will always change. Maybe better maybe worse, but that change happens and you can&amp;#39;t help it. Perhaps you are in a rut, but facing that, and being aware is a great start.   You have come here and posted, asking for help. Which means, you want change and you think yourself worthwhile so you are seeking help. That is fantastic news.&lt;/p&gt;\n\n&lt;p&gt;I watched a Ted Talk and this woman had three points about courage but one thing will always stay in my mind. She said &amp;quot;Act in the face of overwhelm.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You might be overwhelmed right now, realizing things have gone way out of order in your life. But you have everything you need to change it.  You can find the drive. Even if you don&amp;#39;t get driven and go nuts and make all of these amazing changes like you did the first time, you can still choose every day to do the better thing for yourself. That&amp;#39;s still drive, and it&amp;#39;s still change. &lt;/p&gt;\n\n&lt;p&gt;Talking with people helps and I think you should continue to reach out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg4g2yn", "score_hidden": false, "stickied": false, "created": 1491954730.0, "created_utc": 1491925930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64qr34", "likes": null, "replies": "", "user_reports": [], "id": "dg4n77i", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Jonkawfee", "parent_id": "t3_64qr34", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "I think your best bet is to see a doctor, anxiety and depression go hand in hand and are best treated with a combination of things like medication, therapy and diet and exercise. Depression is not a lack of willpower it's an illness and can be treated like one", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your best bet is to see a doctor, anxiety and depression go hand in hand and are best treated with a combination of things like medication, therapy and diet and exercise. Depression is not a lack of willpower it&amp;#39;s an illness and can be treated like one&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg4n77i", "score_hidden": false, "stickied": false, "created": 1491962510.0, "created_utc": 1491933710.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64qr34", "likes": null, "replies": "", "user_reports": [], "id": "dg4exku", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ryderlive", "parent_id": "t3_64qr34", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "I can't pretend to know what depression feels like, but people close to me have it so I can definitely emphasize. I think it's important to understand that things happen and you can only control so much. \n\nStart with your sleeping and health first - build a regular sleep schedule. Keep yourself awake during the day so you get a solid 7-8 hours a night, this will help with your insomnia. Also, put away the electronics in the hour before you are trying to fall asleep and try some deep breathing.\n\nExercise! I know its not easy but you can put in 45 minutes a day to get out for a run or a lift. It will raise your spirits, help with your sleep patterns by tiring you out, and generally make you feel better. \n\nI know sometimes it feels like nothing is going your way but you have the power and control to take steps everyday to make things better! I believe in you and more importantly you should believe in you to turn it around. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t pretend to know what depression feels like, but people close to me have it so I can definitely emphasize. I think it&amp;#39;s important to understand that things happen and you can only control so much. &lt;/p&gt;\n\n&lt;p&gt;Start with your sleeping and health first - build a regular sleep schedule. Keep yourself awake during the day so you get a solid 7-8 hours a night, this will help with your insomnia. Also, put away the electronics in the hour before you are trying to fall asleep and try some deep breathing.&lt;/p&gt;\n\n&lt;p&gt;Exercise! I know its not easy but you can put in 45 minutes a day to get out for a run or a lift. It will raise your spirits, help with your sleep patterns by tiring you out, and generally make you feel better. &lt;/p&gt;\n\n&lt;p&gt;I know sometimes it feels like nothing is going your way but you have the power and control to take steps everyday to make things better! I believe in you and more importantly you should believe in you to turn it around. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg4exku", "score_hidden": false, "stickied": false, "created": 1491953452.0, "created_utc": 1491924652.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64qr34", "likes": null, "replies": "", "user_reports": [], "id": "dg4xkv0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "usernamenn", "parent_id": "t3_64qr34", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "Keep at it.  \nI wish you the best.  \n\nThe path to change is incremental, you don't need to attain all goals at once.  Simply walk an extra ten minutes a day, spend a bit more time outside than you normally would.  Start small.  Change will come.  \nYou sound like you already no how to proceed but like all of us, you've stumbled.  Try, try and try again.\n\nIf you feel you need support get in touch with some groups in your area and/or see a doctor if you feel it may help.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep at it.&lt;br/&gt;\nI wish you the best.  &lt;/p&gt;\n\n&lt;p&gt;The path to change is incremental, you don&amp;#39;t need to attain all goals at once.  Simply walk an extra ten minutes a day, spend a bit more time outside than you normally would.  Start small.  Change will come.&lt;br/&gt;\nYou sound like you already no how to proceed but like all of us, you&amp;#39;ve stumbled.  Try, try and try again.&lt;/p&gt;\n\n&lt;p&gt;If you feel you need support get in touch with some groups in your area and/or see a doctor if you feel it may help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg4xkv0", "score_hidden": false, "stickied": false, "created": 1491973911.0, "created_utc": 1491945111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64qr34", "likes": null, "replies": "", "user_reports": [], "id": "dg594f1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "d3ssybby", "parent_id": "t3_64qr34", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "You are an incredible person! Wow, what an accomplishment that you were able to take charge of your depression and make a change. I have depression as well, and am very proactive about it just like you. It's not always a struggle, there will be months and months that I am happy and fine, and some months where I fall back into my slump. The BIGGEST help for me has and always will be therapy, and talking with my family and friends. Therapy has helped me in ways I can't imagine, so I recommend it. I personally don't tAke medication, because talk therapy helps me so much. I'm no opposed to it, but my therapist and myself don't think I'm at that point. \n\nI am very quick to want to \"fix\" myself as soon as I realize I'm starting to fall back.. but I've learned to not let my depression scare me, to not get overwhelmed by it. Focus on little things, and really try to think, is there an external factor contributing to your depression like a person, lack of job, etc. and try to make simple changes in your life and mostly, yourself.\n\nYou'll be okay! Just focus on little tasks like working on your sleep, talk more to people, and do things that make you happy. I wish you the best of luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are an incredible person! Wow, what an accomplishment that you were able to take charge of your depression and make a change. I have depression as well, and am very proactive about it just like you. It&amp;#39;s not always a struggle, there will be months and months that I am happy and fine, and some months where I fall back into my slump. The BIGGEST help for me has and always will be therapy, and talking with my family and friends. Therapy has helped me in ways I can&amp;#39;t imagine, so I recommend it. I personally don&amp;#39;t tAke medication, because talk therapy helps me so much. I&amp;#39;m no opposed to it, but my therapist and myself don&amp;#39;t think I&amp;#39;m at that point. &lt;/p&gt;\n\n&lt;p&gt;I am very quick to want to &amp;quot;fix&amp;quot; myself as soon as I realize I&amp;#39;m starting to fall back.. but I&amp;#39;ve learned to not let my depression scare me, to not get overwhelmed by it. Focus on little things, and really try to think, is there an external factor contributing to your depression like a person, lack of job, etc. and try to make simple changes in your life and mostly, yourself.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll be okay! Just focus on little tasks like working on your sleep, talk more to people, and do things that make you happy. I wish you the best of luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg594f1", "score_hidden": false, "stickied": false, "created": 1491988844.0, "created_utc": 1491960044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64qr34", "likes": null, "replies": "", "user_reports": [], "id": "dg5dw3y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "shinjo101788", "parent_id": "t3_64qr34", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "My heart goes out to you.  I've found that giving yourself credit for the things you are able to do, and cultivating gratefulness for the things you currently have, helps a great deal.  From what you have said, you've proven to yourself that you possess the strength and capacity to take care of yourself - that is wonderful!\n\nSometimes, it can be something as small as meditating for 5-10 minutes a day that can help.  Here is a short guided meditation that can help:\n\nhttps://m.youtube.com/watch?v=dEzbdLn2bJc\n\nAlso, being kind to yourself can also help you too - you can think of it as \"being your own best friend.\"  When self criticizing thoughts arise, you can imagine that you met yourself on the street and you came to yourself with your current concerns.  Saying things like \"don't worry, it will be okay\" and \"you are safe and cared for\" to yourself can really help.  May you be well, BasementOnFire. Namaste. 🙏", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My heart goes out to you.  I&amp;#39;ve found that giving yourself credit for the things you are able to do, and cultivating gratefulness for the things you currently have, helps a great deal.  From what you have said, you&amp;#39;ve proven to yourself that you possess the strength and capacity to take care of yourself - that is wonderful!&lt;/p&gt;\n\n&lt;p&gt;Sometimes, it can be something as small as meditating for 5-10 minutes a day that can help.  Here is a short guided meditation that can help:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://m.youtube.com/watch?v=dEzbdLn2bJc\"&gt;https://m.youtube.com/watch?v=dEzbdLn2bJc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Also, being kind to yourself can also help you too - you can think of it as &amp;quot;being your own best friend.&amp;quot;  When self criticizing thoughts arise, you can imagine that you met yourself on the street and you came to yourself with your current concerns.  Saying things like &amp;quot;don&amp;#39;t worry, it will be okay&amp;quot; and &amp;quot;you are safe and cared for&amp;quot; to yourself can really help.  May you be well, BasementOnFire. Namaste. 🙏&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg5dw3y", "score_hidden": false, "stickied": false, "created": 1491995315.0, "created_utc": 1491966515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]