[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "GetMotivated", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;\u007f\u007fHello reddit. I am 22 year old guy. I have been lurking on this subreddit for a while now. I recently qualified AFCAT for the indian air force and I am to be interviewed in June but here is my problem. I don&amp;#39;t think I want it. With everyone telling me how lucky I am to qualify it in the first go and I should start oiling my gears up for the interview. I don&amp;#39;t want it. The pay is good and life will be amazing but It just does not feel right.But here is the thing. I need that money. We are too broke.  I can really use that money to better the life that I have. I am not disillusioned, I know what I want but there is no way. There don&amp;#39;t seem to be any other as lucrative opportunities. I planned to do a job while saving up enough to pay for my diploma in media studies but this one exam has shattered all of my plans. I am being told I am too stupid for letting go of such an opportunity. I cry myself to sleep reddit. I feel I am in the wrong. It is overwhelming. I let people choose for me and now I am in the ruins. I want to scream but I cannot. I am told that I am not certain of what I want. I am told that I will always be an underachiever and I let people down. People around me are happy for me and letting so many people down seems  to me like I am cheating with them. I don&amp;#39;t know what to do anymore. I feel helpless and weak. Help me.&lt;/p&gt;\n\n&lt;p&gt;edit: Sorry for my language skills.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "\u007f\u007fHello reddit. I am 22 year old guy. I have been lurking on this subreddit for a while now. I recently qualified AFCAT for the indian air force and I am to be interviewed in June but here is my problem. I don't think I want it. With everyone telling me how lucky I am to qualify it in the first go and I should start oiling my gears up for the interview. I don't want it. The pay is good and life will be amazing but It just does not feel right.But here is the thing. I need that money. We are too broke.  I can really use that money to better the life that I have. I am not disillusioned, I know what I want but there is no way. There don't seem to be any other as lucrative opportunities. I planned to do a job while saving up enough to pay for my diploma in media studies but this one exam has shattered all of my plans. I am being told I am too stupid for letting go of such an opportunity. I cry myself to sleep reddit. I feel I am in the wrong. It is overwhelming. I let people choose for me and now I am in the ruins. I want to scream but I cannot. I am told that I am not certain of what I want. I am told that I will always be an underachiever and I let people down. People around me are happy for me and letting so many people down seems  to me like I am cheating with them. I don't know what to do anymore. I feel helpless and weak. Help me.\n\nedit: Sorry for my language skills.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "", "id": "64rmrr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "BeesAreFliesWithKniv", "saved": false, "mod_reports": [], "name": "t3_64rmrr", "subreddit_name_prefixed": "r/GetMotivated", "approved_by": null, "over_18": false, "domain": "self.GetMotivated", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rmfx", "edited": 1491926143.0, "link_flair_css_class": "discussion", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/GetMotivated/comments/64rmrr/discussion_i_have_an_amazing_opportunity_in_hand/", "num_reports": null, "locked": false, "stickied": false, "created": 1491954388.0, "url": "https://www.reddit.com/r/GetMotivated/comments/64rmrr/discussion_i_have_an_amazing_opportunity_in_hand/", "author_flair_text": null, "quarantine": false, "title": "[Discussion] I have an amazing opportunity in hand but this is not what I want from life.", "created_utc": 1491925588.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64rmrr", "likes": null, "replies": "", "user_reports": [], "id": "dg4mz6y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "KrozFan", "parent_id": "t3_64rmrr", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "What do you want?  Why?\n\n&gt;  I need that money. We are too broke.\n\nSometimes you do what you have to do to get by.  Maybe you'll need some stability to go after what you really want.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you want?  Why?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I need that money. We are too broke.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sometimes you do what you have to do to get by.  Maybe you&amp;#39;ll need some stability to go after what you really want.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg4mz6y", "score_hidden": false, "stickied": false, "created": 1491962264.0, "created_utc": 1491933464.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64rmrr", "likes": null, "replies": "", "user_reports": [], "id": "dg4halg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "sqfqs", "parent_id": "t3_64rmrr", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "You shouldn't be afraid to turn down a good opportunity because you want to do something else.\n\nHowever, make sure that's what you really want, and you aren't just afraid of the opportunity.  You might be afraid because it's a commitment or because something about the job scares you - being afraid you might fail to live up to all these expectations for example.\n\nDo you have anything else that you know you have a good shot at that you prefer to do?  Perhaps there will be a way to direct this new opportunity towards something you want to do?  It's quite rare that people can immediately do what they really want, usually people have to do something else while they build up to what they really want. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You shouldn&amp;#39;t be afraid to turn down a good opportunity because you want to do something else.&lt;/p&gt;\n\n&lt;p&gt;However, make sure that&amp;#39;s what you really want, and you aren&amp;#39;t just afraid of the opportunity.  You might be afraid because it&amp;#39;s a commitment or because something about the job scares you - being afraid you might fail to live up to all these expectations for example.&lt;/p&gt;\n\n&lt;p&gt;Do you have anything else that you know you have a good shot at that you prefer to do?  Perhaps there will be a way to direct this new opportunity towards something you want to do?  It&amp;#39;s quite rare that people can immediately do what they really want, usually people have to do something else while they build up to what they really want. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg4halg", "score_hidden": false, "stickied": false, "created": 1491956062.0, "created_utc": 1491927262.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64rmrr", "likes": null, "replies": "", "user_reports": [], "id": "dg4vv51", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "encouragingword", "parent_id": "t3_64rmrr", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "What happens if you go with the opportunity? What's the other option? \n\n&gt; I planned to do a job while saving up enough to pay for my diploma in media studies\n\nThe air force is a job, isn't it? I don't know how it is in India, but in the U.S., joining the military is an obligation of a few years (depending, in part, on what job you go into), not a commitment to a career. And often, you can continue your education while you serve. Now, if it requires a 20 year commitment, that's a different story. But if it's 5-6 years or so? Would that be worth the financial advantages it gives you to delay your other goals for a while?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What happens if you go with the opportunity? What&amp;#39;s the other option? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I planned to do a job while saving up enough to pay for my diploma in media studies&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The air force is a job, isn&amp;#39;t it? I don&amp;#39;t know how it is in India, but in the U.S., joining the military is an obligation of a few years (depending, in part, on what job you go into), not a commitment to a career. And often, you can continue your education while you serve. Now, if it requires a 20 year commitment, that&amp;#39;s a different story. But if it&amp;#39;s 5-6 years or so? Would that be worth the financial advantages it gives you to delay your other goals for a while?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg4vv51", "score_hidden": false, "stickied": false, "created": 1491971941.0, "created_utc": 1491943141.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_64rmrr", "likes": null, "replies": "", "user_reports": [], "id": "dg59czo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rwpoet", "parent_id": "t3_64rmrr", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "Remind yourself it isn't forever. You can take the job, save some money, and then see. Maybe you will like it or it will open up an opportunity that excites you more. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remind yourself it isn&amp;#39;t forever. You can take the job, save some money, and then see. Maybe you will like it or it will open up an opportunity that excites you more. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dg59czo", "score_hidden": false, "stickied": false, "created": 1491989144.0, "created_utc": 1491960344.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]