[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "GetMotivated", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For instance, I lost weight and got my dream job. Still want to die because I know there is no God and life is futile. I know we are either alone in the universe, or the worst part of the universe that nobody even bothers to come save. I know that death is inevitable and should rush to it so that I can finally silence the voices in my head and I won&amp;#39;t have to deal with worldly issues like money anymore. So what is the point? Once you reach your goals, you won&amp;#39;t be happy. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For instance, I lost weight and got my dream job. Still want to die because I know there is no God and life is futile. I know we are either alone in the universe, or the worst part of the universe that nobody even bothers to come save. I know that death is inevitable and should rush to it so that I can finally silence the voices in my head and I won't have to deal with worldly issues like money anymore. So what is the point? Once you reach your goals, you won't be happy. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65laoq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "j_keeble", "saved": false, "mod_reports": [], "name": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "approved_by": null, "over_18": false, "domain": "self.GetMotivated", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rmfx", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/GetMotivated/comments/65laoq/what_is_the_point_of_being_motivated_if_after_i/", "num_reports": null, "locked": false, "stickied": false, "created": 1492317530.0, "url": "https://www.reddit.com/r/GetMotivated/comments/65laoq/what_is_the_point_of_being_motivated_if_after_i/", "author_flair_text": null, "quarantine": false, "title": "What is the point of being motivated if, after I reach my goals, I still want to be dead? (Discussion)", "created_utc": 1492288730.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgb5vjp", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "PowerPeels", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "Jesus dude if you're that deep in a hole get the hell of reddit for psychological advice and go see a professional.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus dude if you&amp;#39;re that deep in a hole get the hell of reddit for psychological advice and go see a professional.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgb5vjp", "score_hidden": false, "stickied": false, "created": 1492318528.0, "created_utc": 1492289728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgb5cll", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "PoundNaCL", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "There's plenty of time to want to be dead. No need to rush. Cultivate empathy and service. Do something that makes the world a better place. At least then, when its time, your life wasn't a total waste.\n\nAs Israel Regardie once said, \"He is happiest who seeks the unattainable.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s plenty of time to want to be dead. No need to rush. Cultivate empathy and service. Do something that makes the world a better place. At least then, when its time, your life wasn&amp;#39;t a total waste.&lt;/p&gt;\n\n&lt;p&gt;As Israel Regardie once said, &amp;quot;He is happiest who seeks the unattainable.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgb5cll", "score_hidden": false, "stickied": false, "created": 1492317810.0, "created_utc": 1492289010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgd22hx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JeromieRomieRome", "parent_id": "t1_dgbqaxd", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "I really like that post. I feel very similar in many ways, I had been doing transcendental meditation but that's fallen off. I do find existentialism very helpful in finding that we give life our own meaning when nothing has a meaning in the first place if we're just animals on a floating rotating rock meant to simply evolve. I also enjoy that quote, very true to find that there is no purpose defeats the statement itself. So define your own purpose which may seem to be meaningless if it's not something you really care about. Finding that passion and something or someone to live for is sometimes all that matters although both of those things can be temporal. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really like that post. I feel very similar in many ways, I had been doing transcendental meditation but that&amp;#39;s fallen off. I do find existentialism very helpful in finding that we give life our own meaning when nothing has a meaning in the first place if we&amp;#39;re just animals on a floating rotating rock meant to simply evolve. I also enjoy that quote, very true to find that there is no purpose defeats the statement itself. So define your own purpose which may seem to be meaningless if it&amp;#39;s not something you really care about. Finding that passion and something or someone to live for is sometimes all that matters although both of those things can be temporal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgd22hx", "score_hidden": false, "stickied": false, "created": 1492429136.0, "created_utc": 1492400336.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbqaxd", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "vegannazi", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "This used to be me for years, up until 3 years ago. I couldn't be bothered to get up before 5 p.m., pay bills (or do anything, really) on time because what's the fucking point? We're all gonna die anyway. It used to consume my thoughts. I'd spill something on the floor and instead of grabbing a mop, my first thought would be \"What's the fucking point?\"\n\nThen I got into volunteering (fostering disabled dogs) - I tell people now I wanted to help an animal in need but honestly, I just had nothing going on in my life and wanted to fill my days with *something*, and I heard somewhere that the best way to keep your mind off your own misery is to concentrate on helping others. If you don't know what to do, do good and all that. So I got the dog, and just went through the motions of caring for her, went to therapy, took meds (that didn't make much difference), and googled obsessively trying to figure out the purpose of life lol. Got my thyroid sorted out too - definitely recommend having that checked. (That said, while my thyroid might have gotten me depressed, it probably didn't put those questions in my head).\n\nOne day I stumbled upon a message board full of people in the same situation I was in, absolutely convinced there was no way out of this, except for the obvious one. But there were folks there who used to think that way and figured it out somehow. One quote that really stuck with me was something along the lines of, \"If you believe that nothing in life has meaning then the fact that nothing has meaning itself... means nothing. Why does it depress you then?\" You can't have it both ways. No, it did not make me snap out of the existential depression I was in seconds after I read it. But it did stay with me as I continued to do all the things you're supposed to do to get out of depression (meds, therapy, walks, dogs, making friends through the rescue). I believed that I could get out of this, because I knew someone else did. \n\nLong story short(er), it's 3 years later and I'm doing pretty great. I never really wonder about it anymore, I just accepted that life has no purpose and somehow, somewhere along the way realized it's a freeing, not a depressing thought. If nothing means anything, we're all irrelevant and life has no purpose, it means that nothing I do matters. Neither do my thoughts. Now, instead of wanting to lie down and die at this thought, it makes me feel free to do anything I want. I actually have plans and am excited for the future for the first time since I was a kid. I haven't found Jesus or any other \"reason to live\". There is no reason to live, but I quite enjoy it. I do struggle sometimes when life gets bad (like when I'm sick as fuck and puking my guts out for 3 days) but I always remind myself that it's all temporary (as is everything) and I get through it. I might actually get the cliche \"This too shall pass\" tattoo one day, as this phrase has saved my butt quite a few times.\n\nI got into mindfulness meditation for a bit and while I never stuck with it long enough to see the amazing results I read about, I did find some concepts quite helpful - like the whole \"thoughts are just mental events\" thing. You are not your thoughts and the fact that you think something doesn't make it real. You're a mountain, thoughts are just clouds passing by. Observe them, name them if you want (\"Oh, there is this existential shit again\") and let them go, they only have the power to drag you with them if you latch onto them. No, it's not easy. The mind loves to wander and gets really fucking bored if you expect it to just concentrate on washing the dishes. Why waste time on being in the moment if I can do it on autopilot and create all these stories in my head instead? Definitely not our default setting but with practice, you can get out of this habit of living in your head, just the realization that this is what I was doing has been really helpful to me.\n\nClinical and existential depression are two different things but you probably have both at the moment. Adress the first one because I promise you, it's clouding your judgement. In the absolutely worst period of my depression I was 100% convinced that now that I figured out how pointless life is there was no going back and I'd never be well (I'd say \"again\" but I was never really well before that either). I fully believed I saw The Truth and would spend the rest of my miserable life trying to unsee it which seemed as doable as convincing yourself Santa is real again after you've realized he doesn't exist. In a way, I guess, I did see the truth - life *is* pointless in my opinion, I still do believe that. The difference is, now that I actually enjoy my life when this thought pops into my head, I acknowledge it and move on instead of feeling despair.", "edited": 1492320603.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This used to be me for years, up until 3 years ago. I couldn&amp;#39;t be bothered to get up before 5 p.m., pay bills (or do anything, really) on time because what&amp;#39;s the fucking point? We&amp;#39;re all gonna die anyway. It used to consume my thoughts. I&amp;#39;d spill something on the floor and instead of grabbing a mop, my first thought would be &amp;quot;What&amp;#39;s the fucking point?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Then I got into volunteering (fostering disabled dogs) - I tell people now I wanted to help an animal in need but honestly, I just had nothing going on in my life and wanted to fill my days with &lt;em&gt;something&lt;/em&gt;, and I heard somewhere that the best way to keep your mind off your own misery is to concentrate on helping others. If you don&amp;#39;t know what to do, do good and all that. So I got the dog, and just went through the motions of caring for her, went to therapy, took meds (that didn&amp;#39;t make much difference), and googled obsessively trying to figure out the purpose of life lol. Got my thyroid sorted out too - definitely recommend having that checked. (That said, while my thyroid might have gotten me depressed, it probably didn&amp;#39;t put those questions in my head).&lt;/p&gt;\n\n&lt;p&gt;One day I stumbled upon a message board full of people in the same situation I was in, absolutely convinced there was no way out of this, except for the obvious one. But there were folks there who used to think that way and figured it out somehow. One quote that really stuck with me was something along the lines of, &amp;quot;If you believe that nothing in life has meaning then the fact that nothing has meaning itself... means nothing. Why does it depress you then?&amp;quot; You can&amp;#39;t have it both ways. No, it did not make me snap out of the existential depression I was in seconds after I read it. But it did stay with me as I continued to do all the things you&amp;#39;re supposed to do to get out of depression (meds, therapy, walks, dogs, making friends through the rescue). I believed that I could get out of this, because I knew someone else did. &lt;/p&gt;\n\n&lt;p&gt;Long story short(er), it&amp;#39;s 3 years later and I&amp;#39;m doing pretty great. I never really wonder about it anymore, I just accepted that life has no purpose and somehow, somewhere along the way realized it&amp;#39;s a freeing, not a depressing thought. If nothing means anything, we&amp;#39;re all irrelevant and life has no purpose, it means that nothing I do matters. Neither do my thoughts. Now, instead of wanting to lie down and die at this thought, it makes me feel free to do anything I want. I actually have plans and am excited for the future for the first time since I was a kid. I haven&amp;#39;t found Jesus or any other &amp;quot;reason to live&amp;quot;. There is no reason to live, but I quite enjoy it. I do struggle sometimes when life gets bad (like when I&amp;#39;m sick as fuck and puking my guts out for 3 days) but I always remind myself that it&amp;#39;s all temporary (as is everything) and I get through it. I might actually get the cliche &amp;quot;This too shall pass&amp;quot; tattoo one day, as this phrase has saved my butt quite a few times.&lt;/p&gt;\n\n&lt;p&gt;I got into mindfulness meditation for a bit and while I never stuck with it long enough to see the amazing results I read about, I did find some concepts quite helpful - like the whole &amp;quot;thoughts are just mental events&amp;quot; thing. You are not your thoughts and the fact that you think something doesn&amp;#39;t make it real. You&amp;#39;re a mountain, thoughts are just clouds passing by. Observe them, name them if you want (&amp;quot;Oh, there is this existential shit again&amp;quot;) and let them go, they only have the power to drag you with them if you latch onto them. No, it&amp;#39;s not easy. The mind loves to wander and gets really fucking bored if you expect it to just concentrate on washing the dishes. Why waste time on being in the moment if I can do it on autopilot and create all these stories in my head instead? Definitely not our default setting but with practice, you can get out of this habit of living in your head, just the realization that this is what I was doing has been really helpful to me.&lt;/p&gt;\n\n&lt;p&gt;Clinical and existential depression are two different things but you probably have both at the moment. Adress the first one because I promise you, it&amp;#39;s clouding your judgement. In the absolutely worst period of my depression I was 100% convinced that now that I figured out how pointless life is there was no going back and I&amp;#39;d never be well (I&amp;#39;d say &amp;quot;again&amp;quot; but I was never really well before that either). I fully believed I saw The Truth and would spend the rest of my miserable life trying to unsee it which seemed as doable as convincing yourself Santa is real again after you&amp;#39;ve realized he doesn&amp;#39;t exist. In a way, I guess, I did see the truth - life &lt;em&gt;is&lt;/em&gt; pointless in my opinion, I still do believe that. The difference is, now that I actually enjoy my life when this thought pops into my head, I acknowledge it and move on instead of feeling despair.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgbqaxd", "score_hidden": false, "stickied": false, "created": 1492348995.0, "created_utc": 1492320195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgbaya1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sneakers69", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "I have those thoughts sometimes and this is the way I look at it - Instead of making your goals specific things like your weight, job, money etc., try to make your life goal striving to be happy. Whatever that may be. There's always hope of finding your happiness. The fact that you believe life is futile because we're all going to die anyway actually sets you up well to do this. The things we do in life may not ultimately mean anything, the only thing left is to enjoy the journey as much as you can. It's all that counts.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have those thoughts sometimes and this is the way I look at it - Instead of making your goals specific things like your weight, job, money etc., try to make your life goal striving to be happy. Whatever that may be. There&amp;#39;s always hope of finding your happiness. The fact that you believe life is futile because we&amp;#39;re all going to die anyway actually sets you up well to do this. The things we do in life may not ultimately mean anything, the only thing left is to enjoy the journey as much as you can. It&amp;#39;s all that counts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgbaya1", "score_hidden": false, "stickied": false, "created": 1492325703.0, "created_utc": 1492296903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgb5dz8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Zimited", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "Figuring out your purpose is another journey.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Figuring out your purpose is another journey.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgb5dz8", "score_hidden": false, "stickied": false, "created": 1492317863.0, "created_utc": 1492289063.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgbbsek", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FreakyMoose", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "I strongly advise you to get medical help ... and I'm being 100% serious. Best wishes, my friend !", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I strongly advise you to get medical help ... and I&amp;#39;m being 100% serious. Best wishes, my friend !&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgbbsek", "score_hidden": false, "stickied": false, "created": 1492326924.0, "created_utc": 1492298124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgb8qbl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kendrick_lamahr", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "theres things you don't know and haven't even imagined. some of those things may make life worthwhile. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;theres things you don&amp;#39;t know and haven&amp;#39;t even imagined. some of those things may make life worthwhile. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgb8qbl", "score_hidden": false, "stickied": false, "created": 1492322488.0, "created_utc": 1492293688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgbm6ab", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "startledgrey", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "I feel the same exact way. I am graduating university, doing good in life in general but I still feel deeply unhappy and nothing will shake it. My life feels endless even though I know there will be an eventual end. Not sure what you know about these things but look up \"nihilism\" if you have yet to acquaint yourself to that philosophy. If you have any questions go to r/askphilosophy \n\nJust in case:\nr/suicidewatch\nr/depression", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel the same exact way. I am graduating university, doing good in life in general but I still feel deeply unhappy and nothing will shake it. My life feels endless even though I know there will be an eventual end. Not sure what you know about these things but look up &amp;quot;nihilism&amp;quot; if you have yet to acquaint yourself to that philosophy. If you have any questions go to &lt;a href=\"/r/askphilosophy\"&gt;r/askphilosophy&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;Just in case:\n&lt;a href=\"/r/suicidewatch\"&gt;r/suicidewatch&lt;/a&gt;\n&lt;a href=\"/r/depression\"&gt;r/depression&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgbm6ab", "score_hidden": false, "stickied": false, "created": 1492341953.0, "created_utc": 1492313153.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgbot39", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "837383737373737373", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "You are suffering from severe depression. I have been in your position. Please seek a mental health specialist as soon as you can. Your life is worth living, no matter how small you may feel in the universe. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are suffering from severe depression. I have been in your position. Please seek a mental health specialist as soon as you can. Your life is worth living, no matter how small you may feel in the universe. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgbot39", "score_hidden": false, "stickied": false, "created": 1492346259.0, "created_utc": 1492317459.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgbx235", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeanOTRS", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "sorry to bother you, but when I tried to post on /r/getmotivated my post didn't appear in the new section. It was tagged properly. I'm only asking you because you clearly were able to post this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sorry to bother you, but when I tried to post on &lt;a href=\"/r/getmotivated\"&gt;/r/getmotivated&lt;/a&gt; my post didn&amp;#39;t appear in the new section. It was tagged properly. I&amp;#39;m only asking you because you clearly were able to post this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgbx235", "score_hidden": false, "stickied": false, "created": 1492368314.0, "created_utc": 1492339514.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgbx32f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SeanOTRS", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "Not to self promote, but I think this is relevant to you:\n\nhttps://redd.it/65ojry", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to self promote, but I think this is relevant to you:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://redd.it/65ojry\"&gt;https://redd.it/65ojry&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgbx32f", "score_hidden": false, "stickied": false, "created": 1492368401.0, "created_utc": 1492339601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgc049i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wubalubadubdub01", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "I feel the same way sometimes, but i haven't gotten to the point of considering self harm. If you are thinking about self harm, you should probably talk to a professional about these thoughts. \n\nWhen I remember that everything's pointless, i try to listen to music. Like music done by great musicians. Seeing or listening to someone who seems so full of purpose helps. I think it helps to see someone do something so passionately, might persuade you that there's something worth sticking around for.\n\nAlso, looking forward to eating good food helps.\n\nYou're not alone tho. A lot of people are having similar thoughts. Some good series have expressed this kind of sentiments. Watch \"Rick and Morty\". It won't convince you that anything has a purpose, but it might at least help you feel less alone, and help you just laugh at the absurdity of life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel the same way sometimes, but i haven&amp;#39;t gotten to the point of considering self harm. If you are thinking about self harm, you should probably talk to a professional about these thoughts. &lt;/p&gt;\n\n&lt;p&gt;When I remember that everything&amp;#39;s pointless, i try to listen to music. Like music done by great musicians. Seeing or listening to someone who seems so full of purpose helps. I think it helps to see someone do something so passionately, might persuade you that there&amp;#39;s something worth sticking around for.&lt;/p&gt;\n\n&lt;p&gt;Also, looking forward to eating good food helps.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not alone tho. A lot of people are having similar thoughts. Some good series have expressed this kind of sentiments. Watch &amp;quot;Rick and Morty&amp;quot;. It won&amp;#39;t convince you that anything has a purpose, but it might at least help you feel less alone, and help you just laugh at the absurdity of life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgc049i", "score_hidden": false, "stickied": false, "created": 1492376617.0, "created_utc": 1492347817.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgc7tp1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "About_Unbecoming", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "Happiness happens. It doesn't come from God, it doesn't come from having a perfect body or a dream job. It doesn't come from a perfect person or a series of people. It comes in a light breeze on your skin in a beautiful day, a kind gesture, an unexpected laugh. It happens, and it will never be a constant because it wasn't meant to be. So yeah, to echo everyone else, seek some professional help as soon as possible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Happiness happens. It doesn&amp;#39;t come from God, it doesn&amp;#39;t come from having a perfect body or a dream job. It doesn&amp;#39;t come from a perfect person or a series of people. It comes in a light breeze on your skin in a beautiful day, a kind gesture, an unexpected laugh. It happens, and it will never be a constant because it wasn&amp;#39;t meant to be. So yeah, to echo everyone else, seek some professional help as soon as possible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgc7tp1", "score_hidden": false, "stickied": false, "created": 1492388610.0, "created_utc": 1492359810.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgceq0h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kiwa_tyleri", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "You should see a doctor if you're serious. You sound depressed. \n\nAlso, it's possible we aren't alone in the universe. But other species are too far away and/or aren't evolved enough or technologically advanced enough to reach us. \n\nIt sounds like you need to start appreciating the good things in life and have happened to you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should see a doctor if you&amp;#39;re serious. You sound depressed. &lt;/p&gt;\n\n&lt;p&gt;Also, it&amp;#39;s possible we aren&amp;#39;t alone in the universe. But other species are too far away and/or aren&amp;#39;t evolved enough or technologically advanced enough to reach us. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you need to start appreciating the good things in life and have happened to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgceq0h", "score_hidden": false, "stickied": false, "created": 1492397729.0, "created_utc": 1492368929.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgcpswf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "justporlamemes", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "The small things in life are worth living for. Who will take care of my pet? What happens next on the TV show I love? But really tho u should see a professional", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The small things in life are worth living for. Who will take care of my pet? What happens next on the TV show I love? But really tho u should see a professional&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgcpswf", "score_hidden": false, "stickied": false, "created": 1492412330.0, "created_utc": 1492383530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rmfx", "removal_reason": null, "link_id": "t3_65laoq", "likes": null, "replies": "", "user_reports": [], "id": "dgb7d9z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KingofShitPosts", "parent_id": "t3_65laoq", "subreddit_name_prefixed": "r/GetMotivated", "controversiality": 0, "body": "i used to fell this way two but then i discofered a show on the tv called friends. wat u just said reminds me so much of ross.\n\nthank u an god bles", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i used to fell this way two but then i discofered a show on the tv called friends. wat u just said reminds me so much of ross.&lt;/p&gt;\n\n&lt;p&gt;thank u an god bles&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GetMotivated", "name": "t1_dgb7d9z", "score_hidden": false, "stickied": false, "created": 1492320617.0, "created_utc": 1492291817.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]