[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "howtonotgiveafuck", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;[99 Days of Rejection]&lt;/strong&gt;\nThis is my take on all the rejection challenges on this subreddit, but just because I&amp;#39;m special I&amp;#39;ll be doing &lt;strong&gt;99&lt;/strong&gt; days instead of a 100.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;This challenge is inspired by this &lt;a href=\"https://www.reddit.com/r/howtonotgiveafuck/comments/3x44hm/100_days_of_rejection_day_88/\"&gt;post&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Can I honk your horn? Part 2&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This post will be mostly focused on how the challenge went overall than the single challenge that I did today. I didn&amp;#39;t do anything spectacular as I am tired of doing these at this point. Most of the challenges that I can come up with at this point are very easy for me to go through with. It just feels like a waste of time now.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;A man in his 40s is sitting in his car and smoking.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Me:&lt;/strong&gt; Hey! I was wondering if you could let me honk your horn?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Man:&lt;/strong&gt; Why?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Me:&lt;/strong&gt; I just want to try it!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Man:&lt;/strong&gt; That&amp;#39;s interesting. But did you know that it&amp;#39;s illegal to honk in town for no reason? It&amp;#39;s fined up to 500kr.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Me:&lt;/strong&gt; I had no idea. Probably a good idea not to honk then. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Man:&lt;/strong&gt; Probably.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Me:&lt;/strong&gt; Thanks for informing me.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Me:&lt;/strong&gt; No problem.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;With that out of the way let&amp;#39;s move on to the summary of the whole challenge. I&amp;#39;ll begin by answering the most asked question that I have gotten throughout my whole run. &lt;em&gt;Should you do a rejection challenge?&lt;/em&gt; The answer is pretty simple. &lt;a href=\"https://www.reddit.com/user/Czaarek/?count=25&amp;amp;after=t1_deenbfy\"&gt;Go read some of my challenges&lt;/a&gt; and if after reading them you feel like what I did makes you cringe or if it makes you uncomfortable you should do it. If you feel like you would be unable to do what I did then you should do it. This challenge can completely change how you view the world. There is one important thing to keep in mind if you decide to do the challenge though. Do not drag out on it. Do a challenge seven days a week for 99 days without any breaks. This challenge took over six months for me to complete because I procrastinated like crazy. It is a lot easier to do these challenges with continuity. &lt;/p&gt;\n\n&lt;p&gt;This challenge has changed my life in a few ways. I no longer go around worrying what most people think about my looks, what I am doing or what I am saying. I am not the most politically correct or nice person. Sometimes I can even say things that hurt people. I no longer worry that I&amp;#39;ll say something that someone won&amp;#39;t like. I am not saying that you should be a dick to people. What I am saying is when I fuck up I resolve the problem then and there. Why the fuck should I worry about making a mistake before I&amp;#39;ve made one? This has also made me worry less about things overall. I live in the moment and if something goes wrong it does and if it doesn&amp;#39;t then it doesn&amp;#39;t. Not having to worry about anything has cleared up my mind and allowed me to be even more productive in school and in my work. I am so effective now that I don&amp;#39;t even have to go to school some days because I am already done doing the assignments that we would be doing. &lt;/p&gt;\n\n&lt;p&gt;I also no longer feel the need to justify anything to most people. A real life example happened a few days ago to me. I was asked to go to a meeting to represent my class. It wasn&amp;#39;t obligatory and I really didn&amp;#39;t feel like going. I just said &amp;quot;I&amp;#39;m sorry but I&amp;#39;d rather not go&amp;quot;. Then they argued that it was only one meeting and it wouldn&amp;#39;t take up a lot of my time. I responded by saying that I&amp;#39;d rather not go to any meetings at all. Before I did this challenge the pressure would&amp;#39;ve been too much and I would&amp;#39;ve gone to the meeting while hating myself for saying yes. Or even worse: I would come up with some stupid reason why I couldn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;There is one thing that is important to understand though. This challenge isn&amp;#39;t a magic pill that will solve all your social issues. I started this challenge at a time in my life where I didn&amp;#39;t feel shit about myself nor did I feel great. I was getting by just fine but life wasn&amp;#39;t amazing. If you have severe social anxiety you might have to do other things to combat those issues before trying a challenge like this. Everyone is different and you know best what you&amp;#39;re capable of.&lt;/p&gt;\n\n&lt;p&gt;Doing this challenge has probably been the best decision in my life.\nPeace out and thank you for reading my blog for 99 days.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Hesitation free days:&lt;/strong&gt; 1&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**[99 Days of Rejection]**\nThis is my take on all the rejection challenges on this subreddit, but just because I'm special I'll be doing **99** days instead of a 100.\n\n---\n\nThis challenge is inspired by this [post](https://www.reddit.com/r/howtonotgiveafuck/comments/3x44hm/100_days_of_rejection_day_88/).\n\n**Can I honk your horn? Part 2**\n\nThis post will be mostly focused on how the challenge went overall than the single challenge that I did today. I didn't do anything spectacular as I am tired of doing these at this point. Most of the challenges that I can come up with at this point are very easy for me to go through with. It just feels like a waste of time now.\n\n---\n\nA man in his 40s is sitting in his car and smoking.\n\n**Me:** Hey! I was wondering if you could let me honk your horn?\n\n**Man:** Why?\n\n**Me:** I just want to try it!\n\n**Man:** That's interesting. But did you know that it's illegal to honk in town for no reason? It's fined up to 500kr.\n\n**Me:** I had no idea. Probably a good idea not to honk then. \n\n**Man:** Probably.\n\n**Me:** Thanks for informing me.\n\n**Me:** No problem.\n\n---\n\nWith that out of the way let's move on to the summary of the whole challenge. I'll begin by answering the most asked question that I have gotten throughout my whole run. *Should you do a rejection challenge?* The answer is pretty simple. [Go read some of my challenges] (https://www.reddit.com/user/Czaarek/?count=25&amp;after=t1_deenbfy) and if after reading them you feel like what I did makes you cringe or if it makes you uncomfortable you should do it. If you feel like you would be unable to do what I did then you should do it. This challenge can completely change how you view the world. There is one important thing to keep in mind if you decide to do the challenge though. Do not drag out on it. Do a challenge seven days a week for 99 days without any breaks. This challenge took over six months for me to complete because I procrastinated like crazy. It is a lot easier to do these challenges with continuity. \n\nThis challenge has changed my life in a few ways. I no longer go around worrying what most people think about my looks, what I am doing or what I am saying. I am not the most politically correct or nice person. Sometimes I can even say things that hurt people. I no longer worry that I'll say something that someone won't like. I am not saying that you should be a dick to people. What I am saying is when I fuck up I resolve the problem then and there. Why the fuck should I worry about making a mistake before I've made one? This has also made me worry less about things overall. I live in the moment and if something goes wrong it does and if it doesn't then it doesn't. Not having to worry about anything has cleared up my mind and allowed me to be even more productive in school and in my work. I am so effective now that I don't even have to go to school some days because I am already done doing the assignments that we would be doing. \n\nI also no longer feel the need to justify anything to most people. A real life example happened a few days ago to me. I was asked to go to a meeting to represent my class. It wasn't obligatory and I really didn't feel like going. I just said \"I'm sorry but I'd rather not go\". Then they argued that it was only one meeting and it wouldn't take up a lot of my time. I responded by saying that I'd rather not go to any meetings at all. Before I did this challenge the pressure would've been too much and I would've gone to the meeting while hating myself for saying yes. Or even worse: I would come up with some stupid reason why I couldn't.\n\nThere is one thing that is important to understand though. This challenge isn't a magic pill that will solve all your social issues. I started this challenge at a time in my life where I didn't feel shit about myself nor did I feel great. I was getting by just fine but life wasn't amazing. If you have severe social anxiety you might have to do other things to combat those issues before trying a challenge like this. Everyone is different and you know best what you're capable of.\n\nDoing this challenge has probably been the best decision in my life.\nPeace out and thank you for reading my blog for 99 days.\n\n---\n\n**Hesitation free days:** 1", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Challenge", "id": "64pn2r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "Czaarek", "saved": false, "mod_reports": [], "name": "t3_64pn2r", "subreddit_name_prefixed": "r/howtonotgiveafuck", "approved_by": null, "over_18": false, "domain": "self.howtonotgiveafuck", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tna8", "edited": false, "link_flair_css_class": "", "author_flair_css_class": "flair", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/howtonotgiveafuck/comments/64pn2r/99_days_of_rejection_day_99/", "num_reports": null, "locked": false, "stickied": false, "created": 1491928773.0, "url": "https://www.reddit.com/r/howtonotgiveafuck/comments/64pn2r/99_days_of_rejection_day_99/", "author_flair_text": "FUCK", "quarantine": false, "title": "[99 Days of Rejection] Day 99", "created_utc": 1491899973.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64pn2r", "likes": null, "replies": "", "user_reports": [], "id": "dg7drd0", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "funky-monk76", "parent_id": "t3_64pn2r", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "Finally you have finished your bullshit challenge, now stop posting your shit here and go find a diary", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Finally you have finished your bullshit challenge, now stop posting your shit here and go find a diary&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg7drd0", "score_hidden": false, "stickied": false, "created": 1492108051.0, "created_utc": 1492079251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]