[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "howtonotgiveafuck", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife told me she wanted a divorce early February. She had been talking to a male &amp;quot;friend&amp;quot; who had convinced her to give me up. She said he had nothing to do with it but apparently he has been nipping at my heels for years. We&amp;#39;ve been married for 12 years together for 14. &lt;/p&gt;\n\n&lt;p&gt;Two days ago as I was coming upstairs I heard this from her room:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I love it at your place. We fucked 4 times! We would have sex, go to the bar to eat, go back home, fuck, go back to the bar to eat more food, go back have more sex. Tee hee hee&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It was as if someone shot me in the stomach. She had been telling me all along that there was nothing going on and that they weren&amp;#39;t having sex because they didn&amp;#39;t want to jeopardize their future together.&lt;/p&gt;\n\n&lt;p&gt;Come to find out they had been having sex for at least a month and it started 2 weeks after she asked for a divorce. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t close my eyes, stop thinking about something else, without seeing them together in my mind. I can hear her moaning and screaming, telling him to fuck her. Turning over and sticking her ass in the air like she used to do for me and saying &amp;quot;fuck me like this&amp;quot;. Taking his penis into her mouth and sucking him off until he cums and she swallows. &lt;/p&gt;\n\n&lt;p&gt;When we met 14 years ago she was a timid, quiet, virgin. She had already been married for a year and they never had sex. I, being the experienced one, taught her everything. Different positions, how to move her hips, how to enjoy slaps on the ass, hair pulling, learning how to suck a cock without scraping it to death.&lt;/p&gt;\n\n&lt;p&gt;Now she&amp;#39;s using that knowledge on someone else. I heard her say it, and now I can&amp;#39;t get through a day without going into a blind weeping mess.&lt;/p&gt;\n\n&lt;p&gt;Please. Anyone. Help. How do I not give a fuck? I can&amp;#39;t not think about her and him. Every fucking second,  I can&amp;#39;t stop. I turn into a weeping crying mess. I can&amp;#39;t work like this. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My wife told me she wanted a divorce early February. She had been talking to a male \"friend\" who had convinced her to give me up. She said he had nothing to do with it but apparently he has been nipping at my heels for years. We've been married for 12 years together for 14. \n\nTwo days ago as I was coming upstairs I heard this from her room:\n\n\"I love it at your place. We fucked 4 times! We would have sex, go to the bar to eat, go back home, fuck, go back to the bar to eat more food, go back have more sex. Tee hee hee\"\n\nIt was as if someone shot me in the stomach. She had been telling me all along that there was nothing going on and that they weren't having sex because they didn't want to jeopardize their future together.\n\nCome to find out they had been having sex for at least a month and it started 2 weeks after she asked for a divorce. \n\nI can't close my eyes, stop thinking about something else, without seeing them together in my mind. I can hear her moaning and screaming, telling him to fuck her. Turning over and sticking her ass in the air like she used to do for me and saying \"fuck me like this\". Taking his penis into her mouth and sucking him off until he cums and she swallows. \n\nWhen we met 14 years ago she was a timid, quiet, virgin. She had already been married for a year and they never had sex. I, being the experienced one, taught her everything. Different positions, how to move her hips, how to enjoy slaps on the ass, hair pulling, learning how to suck a cock without scraping it to death.\n\nNow she's using that knowledge on someone else. I heard her say it, and now I can't get through a day without going into a blind weeping mess.\n\nPlease. Anyone. Help. How do I not give a fuck? I can't not think about her and him. Every fucking second,  I can't stop. I turn into a weeping crying mess. I can't work like this. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64wp1k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 29, "report_reasons": null, "author": "MyWorldIsGone", "saved": false, "mod_reports": [], "name": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "approved_by": null, "over_18": false, "domain": "self.howtonotgiveafuck", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tna8", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/howtonotgiveafuck/comments/64wp1k/how_do_i_stop_running_her_cheating_escapades/", "num_reports": null, "locked": false, "stickied": false, "created": 1492010399.0, "url": "https://www.reddit.com/r/howtonotgiveafuck/comments/64wp1k/how_do_i_stop_running_her_cheating_escapades/", "author_flair_text": null, "quarantine": false, "title": "How do I stop running her cheating escapades through my head?", "created_utc": 1491981599.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg5mobo", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "epsilion11", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "It's not an easy process man, and you've got a long, long way to go. \n\nThe only thing I would advise you to do at this point is to realize emotions should be a tool for behavior, but they should NOT be controlling your behavior. You seem to be hyper emotional that's just as hard to deal with as the cheating. Those flashes will be in your head for years, potentially decades.  All you can truly do is smile and reflect on your time together as positive, and realize life's not a fucking fairy tale. There is no forever romance, there is no perfect relationship, and there's definitely a lot more dishonesty than I think you're ready to accept. Don't hate life, just see it for what it is. And when you let go of all expectation, you'll truly stop giving a fuck.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not an easy process man, and you&amp;#39;ve got a long, long way to go. &lt;/p&gt;\n\n&lt;p&gt;The only thing I would advise you to do at this point is to realize emotions should be a tool for behavior, but they should NOT be controlling your behavior. You seem to be hyper emotional that&amp;#39;s just as hard to deal with as the cheating. Those flashes will be in your head for years, potentially decades.  All you can truly do is smile and reflect on your time together as positive, and realize life&amp;#39;s not a fucking fairy tale. There is no forever romance, there is no perfect relationship, and there&amp;#39;s definitely a lot more dishonesty than I think you&amp;#39;re ready to accept. Don&amp;#39;t hate life, just see it for what it is. And when you let go of all expectation, you&amp;#39;ll truly stop giving a fuck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg5mobo", "score_hidden": false, "stickied": false, "created": 1492013415.0, "created_utc": 1491984615.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg6tqq1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "epsilion11", "parent_id": "t1_dg5onsy", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "That's so interesting because nothing I did changed my internal state. No matter how good things were, I was still fucked up inside. I just had to face the emotions head-on, and realize that I control them, or they control me. I chose the former.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s so interesting because nothing I did changed my internal state. No matter how good things were, I was still fucked up inside. I just had to face the emotions head-on, and realize that I control them, or they control me. I chose the former.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6tqq1", "score_hidden": false, "stickied": false, "created": 1492071582.0, "created_utc": 1492042782.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5onsy", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "numbertwomilf", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "Having had experienced reoccurring heartbroken trauma of being cheated on and left for, it never goes away but it lessens over time. All those thoughts infiltrate your everyday and that sinking pit in your stomach/anxiety also decreases over time. The pain is strong rn so I'm sorry to hear that. It sucked when I would replay those thoughts in my head that I couldn't or didn't want to be intimate with anyone else because id think of him...even masturbate. \n\nSo, \n\nI put in all that angry energy towards something productive in my life instead of feeling sorry for myself or thinking about how fucked up this other person had been because honestly I made myself so fucking miserable that I couldn't function or even feel like moving forward with my life. \n\nI got closure after awhile. I learned to do shit for myself like excercise, volunteer, meet new people, go out etctera and in that process of taking my mind off of all that pain... I ended up realizing how much I had done in spite of being heartbroken that I found myself growing a bit out of it. \n\nSo when you feel those thoughts creep up... \nRun till your legs hurt, journal that shit out, listen to music just feel everything... See that group on getaway... Take it but just free yourself by keeping busy and finding life is so fucking amazing it really wasn't worth losing that beauty and passion towards someone as lowly as your bitch ex wife. \n\nGood luck to you man.. I am sending good vibes your way!! Love will find you again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having had experienced reoccurring heartbroken trauma of being cheated on and left for, it never goes away but it lessens over time. All those thoughts infiltrate your everyday and that sinking pit in your stomach/anxiety also decreases over time. The pain is strong rn so I&amp;#39;m sorry to hear that. It sucked when I would replay those thoughts in my head that I couldn&amp;#39;t or didn&amp;#39;t want to be intimate with anyone else because id think of him...even masturbate. &lt;/p&gt;\n\n&lt;p&gt;So, &lt;/p&gt;\n\n&lt;p&gt;I put in all that angry energy towards something productive in my life instead of feeling sorry for myself or thinking about how fucked up this other person had been because honestly I made myself so fucking miserable that I couldn&amp;#39;t function or even feel like moving forward with my life. &lt;/p&gt;\n\n&lt;p&gt;I got closure after awhile. I learned to do shit for myself like excercise, volunteer, meet new people, go out etctera and in that process of taking my mind off of all that pain... I ended up realizing how much I had done in spite of being heartbroken that I found myself growing a bit out of it. &lt;/p&gt;\n\n&lt;p&gt;So when you feel those thoughts creep up... \nRun till your legs hurt, journal that shit out, listen to music just feel everything... See that group on getaway... Take it but just free yourself by keeping busy and finding life is so fucking amazing it really wasn&amp;#39;t worth losing that beauty and passion towards someone as lowly as your bitch ex wife. &lt;/p&gt;\n\n&lt;p&gt;Good luck to you man.. I am sending good vibes your way!! Love will find you again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg5onsy", "score_hidden": false, "stickied": false, "created": 1492019663.0, "created_utc": 1491990863.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg5n0uf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "burnburnburning", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "That's fucking horrible and painful. This might sound weird, but if it's any help, it's worth a mention. I have found when trying to work with a knife in your heart as you currently are experiencing, that letting myself bawl it out before and after work when I'm home helps. Or if you've got an outdoor place you like, that can be better because it's out of your home (where it's all probably more acute at the moment). I don't fight it at this juncture. Not yet. This is fresh and essentially a death, so you are grieving. It's just for me knowing I'll let myself indulge in all my emotions at some point in the day - can help me focus on all the stuff I need to get done until then.\n\nThis is a time to take care of you. I'm moody so sometimes writing helps, but sometimes it just pisses me off because I just want to cry and feel sorry for myself - because life sucks, and you can do that sometimes. Just don't get stuck there. There's better things for you to do and better women to meet when you're ready. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s fucking horrible and painful. This might sound weird, but if it&amp;#39;s any help, it&amp;#39;s worth a mention. I have found when trying to work with a knife in your heart as you currently are experiencing, that letting myself bawl it out before and after work when I&amp;#39;m home helps. Or if you&amp;#39;ve got an outdoor place you like, that can be better because it&amp;#39;s out of your home (where it&amp;#39;s all probably more acute at the moment). I don&amp;#39;t fight it at this juncture. Not yet. This is fresh and essentially a death, so you are grieving. It&amp;#39;s just for me knowing I&amp;#39;ll let myself indulge in all my emotions at some point in the day - can help me focus on all the stuff I need to get done until then.&lt;/p&gt;\n\n&lt;p&gt;This is a time to take care of you. I&amp;#39;m moody so sometimes writing helps, but sometimes it just pisses me off because I just want to cry and feel sorry for myself - because life sucks, and you can do that sometimes. Just don&amp;#39;t get stuck there. There&amp;#39;s better things for you to do and better women to meet when you&amp;#39;re ready. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg5n0uf", "score_hidden": false, "stickied": false, "created": 1492014491.0, "created_utc": 1491985691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg5vup6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Riverscapegirl", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "I agree that if you feel like crying- do it!! Don't be so stoic- get your emotions and baggage out now. \n\nThe first thing I would recommend is to GET OUT- DONT LIVE TOGETHER ANYMORE!!  You don't need that in your face everyday! \n\nI was living with my ex when we decided to divorce- and it took him starting to date- while living together to really push me to leave. That's just pure torture.\n\nAs clique as it sounds- take a class, reunite with some old friends- you probably should look into a divorce support group to help you through this. \n\nSeems like you're just concentrating on the physical aspects of her being with this guy..... she checked out emotionally a long time ago- and it's curious that you're just interested in her sexual activity.\n\nLet her go... she's got bad character and u deserve better.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that if you feel like crying- do it!! Don&amp;#39;t be so stoic- get your emotions and baggage out now. &lt;/p&gt;\n\n&lt;p&gt;The first thing I would recommend is to GET OUT- DONT LIVE TOGETHER ANYMORE!!  You don&amp;#39;t need that in your face everyday! &lt;/p&gt;\n\n&lt;p&gt;I was living with my ex when we decided to divorce- and it took him starting to date- while living together to really push me to leave. That&amp;#39;s just pure torture.&lt;/p&gt;\n\n&lt;p&gt;As clique as it sounds- take a class, reunite with some old friends- you probably should look into a divorce support group to help you through this. &lt;/p&gt;\n\n&lt;p&gt;Seems like you&amp;#39;re just concentrating on the physical aspects of her being with this guy..... she checked out emotionally a long time ago- and it&amp;#39;s curious that you&amp;#39;re just interested in her sexual activity.&lt;/p&gt;\n\n&lt;p&gt;Let her go... she&amp;#39;s got bad character and u deserve better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg5vup6", "score_hidden": false, "stickied": false, "created": 1492033990.0, "created_utc": 1492005190.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg67bz7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Symbiotx", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "The only way out is through.  I know it can be hard during a time like this, but if there's anything at all you can focus on that excites you or that you desire, do it.  It's not easy to get past this part, and I'm sure it feels like you never will, but it will get easier over time.  You just need to hang in there for now.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only way out is through.  I know it can be hard during a time like this, but if there&amp;#39;s anything at all you can focus on that excites you or that you desire, do it.  It&amp;#39;s not easy to get past this part, and I&amp;#39;m sure it feels like you never will, but it will get easier over time.  You just need to hang in there for now.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg67bz7", "score_hidden": false, "stickied": false, "created": 1492046648.0, "created_utc": 1492017848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg6kdx6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "No-Spoilers", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "Get away and keep busy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get away and keep busy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6kdx6", "score_hidden": false, "stickied": false, "created": 1492060129.0, "created_utc": 1492031329.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg6lvu7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tlegend2", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "It sucks man, it really does. Give her what she wants and simply cease to exist in her life and remember that you existed just fine without her 15 years ago.\n\nAlthough I would advise never giving another woman your full heart for her to handle as she pleases, being in love is a wonderful feeling and I can't in good conscience tell you to never try that again.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sucks man, it really does. Give her what she wants and simply cease to exist in her life and remember that you existed just fine without her 15 years ago.&lt;/p&gt;\n\n&lt;p&gt;Although I would advise never giving another woman your full heart for her to handle as she pleases, being in love is a wonderful feeling and I can&amp;#39;t in good conscience tell you to never try that again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6lvu7", "score_hidden": false, "stickied": false, "created": 1492061875.0, "created_utc": 1492033075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg7cpnt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "alexd1976", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "Protect your assets, prepare for a clean break.  Take all the best shit you can and just ghost ASAP.  At that point, only contact her through your lawyer.\n\nedit: The red pill is a bit bitter, but it might help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Protect your assets, prepare for a clean break.  Take all the best shit you can and just ghost ASAP.  At that point, only contact her through your lawyer.&lt;/p&gt;\n\n&lt;p&gt;edit: The red pill is a bit bitter, but it might help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg7cpnt", "score_hidden": false, "stickied": false, "created": 1492104892.0, "created_utc": 1492076092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg6cfh0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "heytherecutiemcbooty", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "/r/theredpill\n\nTerrible rep but this is why most of the guys are on that sub. Take what helps you and ignore the rest", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/theredpill\"&gt;/r/theredpill&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Terrible rep but this is why most of the guys are on that sub. Take what helps you and ignore the rest&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6cfh0", "score_hidden": false, "stickied": false, "created": 1492051828.0, "created_utc": 1492023028.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg5z566", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Benny757", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "Yes, you are in deep pain.  Grieving a loss, much like the death of a loved one.  And I will submit, that the loss, is a part of you dying.  Now that you have realized this, here is the truth.  You are grieving the loss of someone who does not respect you, and who is repelled by you.  This person is no longer worthy of your friendship.  \n\nThe \"extraction\" process of a relationship is always difficult.  But, there is a new beginning for you.  You don't see it quite yet, but wait for it - it will come.  \n\nIt's ok, and you will ensure that you come away stronger for this experience.  You will see \"love\" entirely different from now on.  Embrace this darkness.  Sometimes the road does lead to dark places.  Sometimes the darkness is your friend....  songwriter Bruce Cockburn wrote that in \"Pacing the Cage.\"\n\nAt the end of the day, we men are all lone wolves.  And it's ok to be a lone wolf.  Embrace it.  You DO NOT need a woman to be satisfied, leading to happiness.  First and foremost, you need \"yourself.\"  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, you are in deep pain.  Grieving a loss, much like the death of a loved one.  And I will submit, that the loss, is a part of you dying.  Now that you have realized this, here is the truth.  You are grieving the loss of someone who does not respect you, and who is repelled by you.  This person is no longer worthy of your friendship.  &lt;/p&gt;\n\n&lt;p&gt;The &amp;quot;extraction&amp;quot; process of a relationship is always difficult.  But, there is a new beginning for you.  You don&amp;#39;t see it quite yet, but wait for it - it will come.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s ok, and you will ensure that you come away stronger for this experience.  You will see &amp;quot;love&amp;quot; entirely different from now on.  Embrace this darkness.  Sometimes the road does lead to dark places.  Sometimes the darkness is your friend....  songwriter Bruce Cockburn wrote that in &amp;quot;Pacing the Cage.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;At the end of the day, we men are all lone wolves.  And it&amp;#39;s ok to be a lone wolf.  Embrace it.  You DO NOT need a woman to be satisfied, leading to happiness.  First and foremost, you need &amp;quot;yourself.&amp;quot;  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg5z566", "score_hidden": false, "stickied": false, "created": 1492037929.0, "created_utc": 1492009129.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg6bv9x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PM-ME-UR-THIGH-GAP", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "r/MGTOW", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/MGTOW\"&gt;r/MGTOW&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6bv9x", "score_hidden": false, "stickied": false, "created": 1492051255.0, "created_utc": 1492022455.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg6d8ga", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "therealpsychx", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "You're going to have to realize that she is just a horrible person. It will be hard and take time, but nobody with a heart would allow their significant other or even an EX hear about that kind of stuff. Also, do what you can to distance yourself from her and record anything that you can legally in case you have to use it in court. Don't support her whatsoever.\n\nThis is also why other people need to realize that there may be unwanted consequences for having a serious relationship with a young, inexperienced woman.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re going to have to realize that she is just a horrible person. It will be hard and take time, but nobody with a heart would allow their significant other or even an EX hear about that kind of stuff. Also, do what you can to distance yourself from her and record anything that you can legally in case you have to use it in court. Don&amp;#39;t support her whatsoever.&lt;/p&gt;\n\n&lt;p&gt;This is also why other people need to realize that there may be unwanted consequences for having a serious relationship with a young, inexperienced woman.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6d8ga", "score_hidden": false, "stickied": false, "created": 1492052671.0, "created_utc": 1492023871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg798og", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MyWorldIsGone", "parent_id": "t1_dg6fro7", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "I live in WA. They don't care here. She could sleep with 5 dudes and it wouldn't matter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I live in WA. They don&amp;#39;t care here. She could sleep with 5 dudes and it wouldn&amp;#39;t matter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg798og", "score_hidden": false, "stickied": false, "created": 1492094804.0, "created_utc": 1492066004.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fro7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kildar007", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "Something to keep in mind, don't now where you are but most of the US being in the process of a divorce is not being divorced so sleeping with someone else during that process is considered being unfaithful  in case she is trying to get more out of court than you would like. Highly depends on where you live though.\n\nIts difficult, I cut my ex out of my life got rid of most of her things and dont talk to her or her new bf who used to be a friend. It took me a year to get out of my slump. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something to keep in mind, don&amp;#39;t now where you are but most of the US being in the process of a divorce is not being divorced so sleeping with someone else during that process is considered being unfaithful  in case she is trying to get more out of court than you would like. Highly depends on where you live though.&lt;/p&gt;\n\n&lt;p&gt;Its difficult, I cut my ex out of my life got rid of most of her things and dont talk to her or her new bf who used to be a friend. It took me a year to get out of my slump. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6fro7", "score_hidden": false, "stickied": false, "created": 1492055277.0, "created_utc": 1492026477.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg6fsc4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "endlessleeper", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "It will pass. You're going through something now, it hurts like fuck, you have to get through the emotions and give yourself time to heal. And you will heal. \n\nBe kind to yourself, treat yourself as you would if your best friend came to you in this situation. Would you keep reminding him about what happened? Of course not, you would distract him and give him other things to think about. Our minds are defiant, stubborn, disobedient things and we have to train them otherwise. You will need to be strong, but at the moment you can let yourself be weak and feel the pain you need to feel. It will pass. Because the only other option is that it will consume you, and that would be a terrible waste of everything that you might be in the future.\n\nTalk if you need to. Scream at the top of your lungs and cry your heart out if you need to. It won't be raw forever. You will find yourself again, because as I said before, the only other option is that you would be lost forever to this pain and I can promise you that won't happen. People are stronger than that. You are stronger than that. It will pass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It will pass. You&amp;#39;re going through something now, it hurts like fuck, you have to get through the emotions and give yourself time to heal. And you will heal. &lt;/p&gt;\n\n&lt;p&gt;Be kind to yourself, treat yourself as you would if your best friend came to you in this situation. Would you keep reminding him about what happened? Of course not, you would distract him and give him other things to think about. Our minds are defiant, stubborn, disobedient things and we have to train them otherwise. You will need to be strong, but at the moment you can let yourself be weak and feel the pain you need to feel. It will pass. Because the only other option is that it will consume you, and that would be a terrible waste of everything that you might be in the future.&lt;/p&gt;\n\n&lt;p&gt;Talk if you need to. Scream at the top of your lungs and cry your heart out if you need to. It won&amp;#39;t be raw forever. You will find yourself again, because as I said before, the only other option is that you would be lost forever to this pain and I can promise you that won&amp;#39;t happen. People are stronger than that. You are stronger than that. It will pass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6fsc4", "score_hidden": false, "stickied": false, "created": 1492055296.0, "created_utc": 1492026496.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tna8", "removal_reason": null, "link_id": "t3_64wp1k", "likes": null, "replies": "", "user_reports": [], "id": "dg6mxvu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "neversleep", "parent_id": "t3_64wp1k", "subreddit_name_prefixed": "r/howtonotgiveafuck", "controversiality": 0, "body": "You cant. It will eventually and slowly fade away from your mind. It does help to keep yourself busy or meet new people but in my experience, this is something you are going to keep in your head for a long time. I felt like i was dieing when i found out my ex gf cheated on me and i felt like that for months until i met some people and another girl. Im insecure and kind of weak sometimes but i felt better about my ex gf and so can you.\n\nI tried meditation for the first time in my life and the most important thing i learned from it is that you can let those horrible thoughts run through your head and not affect you. Hope this works for you and things get better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You cant. It will eventually and slowly fade away from your mind. It does help to keep yourself busy or meet new people but in my experience, this is something you are going to keep in your head for a long time. I felt like i was dieing when i found out my ex gf cheated on me and i felt like that for months until i met some people and another girl. Im insecure and kind of weak sometimes but i felt better about my ex gf and so can you.&lt;/p&gt;\n\n&lt;p&gt;I tried meditation for the first time in my life and the most important thing i learned from it is that you can let those horrible thoughts run through your head and not affect you. Hope this works for you and things get better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "howtonotgiveafuck", "name": "t1_dg6mxvu", "score_hidden": false, "stickied": false, "created": 1492063147.0, "created_utc": 1492034347.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]