[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "howtonotgiveafuck", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When the division and resulting conflict goes, it really goes. You won&amp;#39;t look at human beings even remotely the same again. It&amp;#39;s almost like being with small children, just trying to navigate through their day without getting hurt or yelled at. You can&amp;#39;t let them abuse the cat, smack the other kids, or inflict whatever chaos they want, on whatever they want to inflict it on. But it&amp;#39;s quite pointless and of no benefit to anyone, to be emotionally affected by their very desire, to in fact inflict chaos. You just have to take an appropriate action when they do, that&amp;#39;s all.&lt;/p&gt;\n\n&lt;p&gt;When you get to a certain level of neuroscience, you really begin to question &amp;quot;conscious choice&amp;quot;. Upon further study, you may discount it altogether. Do you truly have &amp;quot;choice&amp;quot; in what you think, when you think it, and what emotional experience arises from it? I&amp;#39;m saying you don&amp;#39;t. It is not my intent to compare, but rather just to throw out a &amp;quot;thought&amp;quot;. If I have a &amp;quot;choice&amp;quot; that is.&lt;/p&gt;\n\n&lt;p&gt;If humans really have &amp;quot;conscious choice&amp;quot;, then please explain to me with any level of logic at all, why they are &amp;quot;unhappy&amp;quot;? Why they struggle with undesirable emotional experiences. Shame, guilt, jealousy, envy, sadness, anxiety, frustration etc. Why? Isn&amp;#39;t there &amp;quot;choice&amp;quot;? Scientifically and biologically speaking, almost all emotions arise out of cultural influence, unless your in real actual danger or harms way. &amp;quot;Cultural influence&amp;quot;, simply means, the way in which you were conditioned to interpret a particular situation or circumstance. There is no other &amp;quot;choice&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;The capacity for emotions is obviously evolutionary, and genetically innate. What is not &amp;quot;innate&amp;quot; however, is how to interpret any given experience you have at all. Even animals have to be taught many things to be afraid of, what to eat, and so on. Subjective emotional experiences don&amp;#39;t arise by &amp;quot;rolling the dice&amp;quot;. They are a biological response created by neurological process&amp;#39;s, in response to the &amp;quot;meaning&amp;quot; of outside stimulus. That &amp;quot;meaning&amp;quot; however, has to be &amp;quot;taught&amp;quot;. This is what we call &amp;quot;conditioning&amp;quot;. The ideas of others, passed on to you. There is no other &amp;quot;source&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;So if &amp;quot;unhappiness&amp;quot; is the experiencing of the above listed &amp;quot;negative emotions&amp;quot;, the question is...why are you experiencing them? I thought you had &amp;quot;choice&amp;quot;? Even someone else &amp;quot;making&amp;quot; you feel a certain way, still implies no choice. Otherwise, you wouldn&amp;#39;t &amp;quot;allow&amp;quot; them to arise within you, crappy emotional states. Or, maybe you would, I don&amp;#39;t know. Either way, it has to be one or the other. Either you have choice in your thinking and emotional experiences, which are the same, or you don&amp;#39;t. I&amp;#39;m simply asking which it is, with no &amp;quot;devaluing&amp;quot; connotation at all.&lt;/p&gt;\n\n&lt;p&gt;Are you a sadomasochist? I&amp;#39;m dead serious. I can&amp;#39;t think of any other justification for your &amp;quot;unhappiness&amp;quot;, assuming there&amp;#39;s truly choice. If you have such, then that has to automatically mean that you are intentionally allowing, or creating, all the undesirable emotional experiences responsible for your unhappiness. What else can it be? &amp;quot;Choice&amp;quot; implies intention does it not? So why do you intend to be unhappy? This seems at least mildly far-fetched to me. I don&amp;#39;t know anyone who &amp;quot;intends&amp;quot; this for themselves. I sure don&amp;#39;t. Do you?&lt;/p&gt;\n\n&lt;p&gt;So how is it then, that you have conscious choice, yet can&amp;#39;t seem to avoid being unhappy? I wonder if you know, that all of what we call &amp;quot;negative emotions&amp;quot;, arise as a direct result of a biological &amp;quot;stress response&amp;quot;, which is essentially your &amp;quot;fight or flight&amp;quot; response? This is science, not my opinion. &amp;quot;Stress response&amp;quot;, means the release of &amp;quot;adrenaline&amp;quot;, known in the U.S. as &amp;quot;epinephrine&amp;quot;, and a much more dangerous class of hormones called &amp;quot;glucocorticoids&amp;quot;, particularly &amp;quot;cortisol&amp;quot;, known as &amp;quot;hydrocortisone&amp;quot;. They are the backbones of stress response.&lt;/p&gt;\n\n&lt;p&gt;When chronic, the result eventually is stress related disease. There is nothing else in modern culture that is more responsible for disease. This is also science. I highly recommend the national geographic special &amp;quot;Stress...portrait of a killer&amp;quot;, which highlights the work of neuroscience&amp;#39;s most noted pioneer in the study of stress, Dr. Robert Sapolsky of Stanford University. You didn&amp;#39;t think I&amp;#39;d just throw out a random opinion did you? Just kidding.&lt;/p&gt;\n\n&lt;p&gt;Human beings have believed in conscious choice forever I&amp;#39;d assume. Is it just a coincidence, that they also have struggled with &amp;quot;unhappiness&amp;quot; forever as well? Is &amp;quot;choice&amp;quot; just hiding somewhere? Maybe as a joke? Where is it I&amp;#39;m asking? Can you have &amp;quot;conscious free will&amp;quot;, and still be &amp;quot;unintentionally&amp;quot; or &amp;quot;involuntarily&amp;quot; unhappy? You see what I&amp;#39;m saying? Any justification you give for unhappiness must then be false, if you truly have &amp;quot;choice&amp;quot;. It&amp;#39;s just that simple. So where do we go from here? Next post.&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;                                                             https://www.youtube.com/watch?v=eYG0ZuTv5rs...\n                                                            &amp;quot;Stress...portrait of a killer&amp;quot;...Robert Sapolsky.\n\n                                           WWW.AUTHENTICPERCEPTIONS.COM\n&lt;/code&gt;&lt;/pre&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "When the division and resulting conflict goes, it really goes. You won't look at human beings even remotely the same again. It's almost like being with small children, just trying to navigate through their day without getting hurt or yelled at. You can't let them abuse the cat, smack the other kids, or inflict whatever chaos they want, on whatever they want to inflict it on. But it's quite pointless and of no benefit to anyone, to be emotionally affected by their very desire, to in fact inflict chaos. You just have to take an appropriate action when they do, that's all.\n\nWhen you get to a certain level of neuroscience, you really begin to question \"conscious choice\". Upon further study, you may discount it altogether. Do you truly have \"choice\" in what you think, when you think it, and what emotional experience arises from it? I'm saying you don't. It is not my intent to compare, but rather just to throw out a \"thought\". If I have a \"choice\" that is.\n\nIf humans really have \"conscious choice\", then please explain to me with any level of logic at all, why they are \"unhappy\"? Why they struggle with undesirable emotional experiences. Shame, guilt, jealousy, envy, sadness, anxiety, frustration etc. Why? Isn't there \"choice\"? Scientifically and biologically speaking, almost all emotions arise out of cultural influence, unless your in real actual danger or harms way. \"Cultural influence\", simply means, the way in which you were conditioned to interpret a particular situation or circumstance. There is no other \"choice\".\n\nThe capacity for emotions is obviously evolutionary, and genetically innate. What is not \"innate\" however, is how to interpret any given experience you have at all. Even animals have to be taught many things to be afraid of, what to eat, and so on. Subjective emotional experiences don't arise by \"rolling the dice\". They are a biological response created by neurological process's, in response to the \"meaning\" of outside stimulus. That \"meaning\" however, has to be \"taught\". This is what we call \"conditioning\". The ideas of others, passed on to you. There is no other \"source\".\n\nSo if \"unhappiness\" is the experiencing of the above listed \"negative emotions\", the question is...why are you experiencing them? I thought you had \"choice\"? Even someone else \"making\" you feel a certain way, still implies no choice. Otherwise, you wouldn't \"allow\" them to arise within you, crappy emotional states. Or, maybe you would, I don't know. Either way, it has to be one or the other. Either you have choice in your thinking and emotional experiences, which are the same, or you don't. I'm simply asking which it is, with no \"devaluing\" connotation at all.\n\nAre you a sadomasochist? I'm dead serious. I can't think of any other justification for your \"unhappiness\", assuming there's truly choice. If you have such, then that has to automatically mean that you are intentionally allowing, or creating, all the undesirable emotional experiences responsible for your unhappiness. What else can it be? \"Choice\" implies intention does it not? So why do you intend to be unhappy? This seems at least mildly far-fetched to me. I don't know anyone who \"intends\" this for themselves. I sure don't. Do you?\n\nSo how is it then, that you have conscious choice, yet can't seem to avoid being unhappy? I wonder if you know, that all of what we call \"negative emotions\", arise as a direct result of a biological \"stress response\", which is essentially your \"fight or flight\" response? This is science, not my opinion. \"Stress response\", means the release of \"adrenaline\", known in the U.S. as \"epinephrine\", and a much more dangerous class of hormones called \"glucocorticoids\", particularly \"cortisol\", known as \"hydrocortisone\". They are the backbones of stress response.\n\nWhen chronic, the result eventually is stress related disease. There is nothing else in modern culture that is more responsible for disease. This is also science. I highly recommend the national geographic special \"Stress...portrait of a killer\", which highlights the work of neuroscience's most noted pioneer in the study of stress, Dr. Robert Sapolsky of Stanford University. You didn't think I'd just throw out a random opinion did you? Just kidding.\n\nHuman beings have believed in conscious choice forever I'd assume. Is it just a coincidence, that they also have struggled with \"unhappiness\" forever as well? Is \"choice\" just hiding somewhere? Maybe as a joke? Where is it I'm asking? Can you have \"conscious free will\", and still be \"unintentionally\" or \"involuntarily\" unhappy? You see what I'm saying? Any justification you give for unhappiness must then be false, if you truly have \"choice\". It's just that simple. So where do we go from here? Next post.\n\n                                                                 https://www.youtube.com/watch?v=eYG0ZuTv5rs...\n                                                                \"Stress...portrait of a killer\"...Robert Sapolsky.\n\n                                               WWW.AUTHENTICPERCEPTIONS.COM", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Video", "id": "65xdvm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "Jayhawkr", "saved": false, "mod_reports": [], "name": "t3_65xdvm", "subreddit_name_prefixed": "r/howtonotgiveafuck", "approved_by": null, "over_18": false, "domain": "self.howtonotgiveafuck", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tna8", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/howtonotgiveafuck/comments/65xdvm/conscious_choicedo_you_really_have_it/", "num_reports": null, "locked": false, "stickied": false, "created": 1492482658.0, "url": "https://www.reddit.com/r/howtonotgiveafuck/comments/65xdvm/conscious_choicedo_you_really_have_it/", "author_flair_text": null, "quarantine": false, "title": "\"CONSCIOUS CHOICE\"...do you really have it?", "created_utc": 1492453858.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]