[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sadcringe", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an alcoholic. I have one really good friend, we&amp;#39;re like brothers. We drink quite a bit, at least 1L of Ron Rio a day, plus bar stops and sometimes beer. So yesterday my friend let&amp;#39;s call him Frank hit me up around Noon telling me to scoop him up for a trip to the flying saucer. We agreed to lay off the liquor for a day or two, so I had one hard cider ($2 they have the best beer specials) and a burger. We leave and on the way back this super cute girl hit Frank up to swing by her place and kick it at her pool. At first we weren&amp;#39;t too into it, I had to swing by my new employer and pick up some information for my first day today. No issues there made it got the information walked back to my truck and Frank says, &amp;quot;She says there&amp;#39;s a bunch of single sorority girls going,&amp;quot; of course I agree to go. The only thing was we had to bring booze. I told Frank alright I&amp;#39;ll buy the Ron Rio you get the mixer. Keep in mind I&amp;#39;ve been in vacation mode for about 3 weeks and have about $20 cash to my name. We get out there go straight to her pool and start pre gaming. Well we forgot to pull the paper bag off and within about half an hour I had drank almost half the litre. Our contact shows up and I look over to Frank and tell him I think we&amp;#39;ll need some more liquor. He just cracks up and says to me, &amp;quot;well I&amp;#39;m not going anywhere.&amp;quot; I chill out, lay down on one of the reclining chairs to get some tan to my pasty skin. Then the Girls start showing up and I realize real quick that this group of characters weren&amp;#39;t the biggest fans of me. Apparently I had made a scene about a year prior while on xanax at a house part; I had no memory of it. I played it cool, being about 40lbs lighter they could tell I was different and I could see it in their eyes. I jump in the pool, immediately slicing my foot open on some glass. No biggie, walk it off. Then I start hearing, &amp;quot;where&amp;#39;s all the drinks?&amp;quot; I look over and see that the two of us had damn near killed the litre within an hour. No big deal I volunteer to buy more and one of them takes me to the store. I buy another litre and she buys 2 750s of some cheap vodka. We get back to the pool and to my suprise Frank made some new friends while I was gone and was helping himself to two handles of svedka. I go straight to the back and resume drinking off the bottle. I&amp;#39;m about half way done with the second litre and I&amp;#39;m having a great conversation with a couple of nice young ladies. Look at my phone and see that I have to be at work for my first day in 12 hours. No big deal i&amp;#39;ll just slow down and grab a bite. When I&amp;#39;m getting up to walk back to our contact&amp;#39;s appartment to sober up for a biy, Frank stops me and puts the handle of svedka to my mouth, 6 seconds and 1 video later, I get caught up drinking again. This time I&amp;#39;m pretty drunk, drunk enough to send most people to the hospital, but I&amp;#39;m completely functional coherent and speaking fine. We leave the pool around 10pm and go back to our contact&amp;#39;s place where the party continued. Our new friends and the sorority girls all came back with, to my amazement, more liquor. I sit down, not trying to talk to anyone because I&amp;#39;m way too drunk to consent to anything [wink]. I baby sit that second bottle until midnight when Frank asks me how I&amp;#39;m feeling. I replied, &amp;quot;why do you ask?&amp;quot; Frank, &amp;quot;you almost killed that bottle too. How are you still standing?&amp;quot; I look down at the bottle and to my amazement it was completely empty sans 1 or 2 shots. Our contact&amp;#39;s neighor comes in smoking a blunt, i take 1 or 2 hits and pass out on the couch. I wake up at 2a.m. with a burger in my face. And a nice young lady trying to wake me up and spraying listerine in my mouth. At this point I realize I&amp;#39;m fucked. Somehow while asleep my feeling of intoxication had magnified itself. I brush her away and pass her off to some frat guy who she ends up leaving with. Now it&amp;#39;s 4 a.m. and I have to be at work in 6 hours. I get home pass out immediately. Wake up this morning at 9 am and realize I hadn&amp;#39;t done any of my pre employment paperwork. Still drunk I fill everything out get showered and clean myself up a bit. Now I have no time to sober up and go straight to work. I arrive (to work), sit down, and immediately realize I hadn&amp;#39;t done my i-9 online. No worries I just won&amp;#39;t say anything unless they ask. We do our orientation and the manager is going through everyone&amp;#39;s paperwork handing out time cards. She asks me &amp;quot;your id and social security card please.&amp;quot; Now this was the moment I realized I really fucked up. No wallet no SS card, I try to talk them into letting me bring it by right after we&amp;#39;re done. Nope. No go. So now I won&amp;#39;t get paid for orientation and can&amp;#39;t start for another week when the next orientation class starts.\nTl ; DR Now i have to make my last $12 last at least 3 weeks. Time to get creative.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm an alcoholic. I have one really good friend, we're like brothers. We drink quite a bit, at least 1L of Ron Rio a day, plus bar stops and sometimes beer. So yesterday my friend let's call him Frank hit me up around Noon telling me to scoop him up for a trip to the flying saucer. We agreed to lay off the liquor for a day or two, so I had one hard cider ($2 they have the best beer specials) and a burger. We leave and on the way back this super cute girl hit Frank up to swing by her place and kick it at her pool. At first we weren't too into it, I had to swing by my new employer and pick up some information for my first day today. No issues there made it got the information walked back to my truck and Frank says, \"She says there's a bunch of single sorority girls going,\" of course I agree to go. The only thing was we had to bring booze. I told Frank alright I'll buy the Ron Rio you get the mixer. Keep in mind I've been in vacation mode for about 3 weeks and have about $20 cash to my name. We get out there go straight to her pool and start pre gaming. Well we forgot to pull the paper bag off and within about half an hour I had drank almost half the litre. Our contact shows up and I look over to Frank and tell him I think we'll need some more liquor. He just cracks up and says to me, \"well I'm not going anywhere.\" I chill out, lay down on one of the reclining chairs to get some tan to my pasty skin. Then the Girls start showing up and I realize real quick that this group of characters weren't the biggest fans of me. Apparently I had made a scene about a year prior while on xanax at a house part; I had no memory of it. I played it cool, being about 40lbs lighter they could tell I was different and I could see it in their eyes. I jump in the pool, immediately slicing my foot open on some glass. No biggie, walk it off. Then I start hearing, \"where's all the drinks?\" I look over and see that the two of us had damn near killed the litre within an hour. No big deal I volunteer to buy more and one of them takes me to the store. I buy another litre and she buys 2 750s of some cheap vodka. We get back to the pool and to my suprise Frank made some new friends while I was gone and was helping himself to two handles of svedka. I go straight to the back and resume drinking off the bottle. I'm about half way done with the second litre and I'm having a great conversation with a couple of nice young ladies. Look at my phone and see that I have to be at work for my first day in 12 hours. No big deal i'll just slow down and grab a bite. When I'm getting up to walk back to our contact's appartment to sober up for a biy, Frank stops me and puts the handle of svedka to my mouth, 6 seconds and 1 video later, I get caught up drinking again. This time I'm pretty drunk, drunk enough to send most people to the hospital, but I'm completely functional coherent and speaking fine. We leave the pool around 10pm and go back to our contact's place where the party continued. Our new friends and the sorority girls all came back with, to my amazement, more liquor. I sit down, not trying to talk to anyone because I'm way too drunk to consent to anything [wink]. I baby sit that second bottle until midnight when Frank asks me how I'm feeling. I replied, \"why do you ask?\" Frank, \"you almost killed that bottle too. How are you still standing?\" I look down at the bottle and to my amazement it was completely empty sans 1 or 2 shots. Our contact's neighor comes in smoking a blunt, i take 1 or 2 hits and pass out on the couch. I wake up at 2a.m. with a burger in my face. And a nice young lady trying to wake me up and spraying listerine in my mouth. At this point I realize I'm fucked. Somehow while asleep my feeling of intoxication had magnified itself. I brush her away and pass her off to some frat guy who she ends up leaving with. Now it's 4 a.m. and I have to be at work in 6 hours. I get home pass out immediately. Wake up this morning at 9 am and realize I hadn't done any of my pre employment paperwork. Still drunk I fill everything out get showered and clean myself up a bit. Now I have no time to sober up and go straight to work. I arrive (to work), sit down, and immediately realize I hadn't done my i-9 online. No worries I just won't say anything unless they ask. We do our orientation and the manager is going through everyone's paperwork handing out time cards. She asks me \"your id and social security card please.\" Now this was the moment I realized I really fucked up. No wallet no SS card, I try to talk them into letting me bring it by right after we're done. Nope. No go. So now I won't get paid for orientation and can't start for another week when the next orientation class starts.\nTl ; DR Now i have to make my last $12 last at least 3 weeks. Time to get creative.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65mimq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "mbt20", "saved": false, "mod_reports": [], "name": "t3_65mimq", "subreddit_name_prefixed": "r/sadcringe", "approved_by": null, "over_18": false, "domain": "self.sadcringe", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2wsc9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sadcringe/comments/65mimq/tifu_by_drinking_2_litres_of_rum/", "num_reports": null, "locked": false, "stickied": false, "created": 1492332609.0, "url": "https://www.reddit.com/r/sadcringe/comments/65mimq/tifu_by_drinking_2_litres_of_rum/", "author_flair_text": null, "quarantine": false, "title": "TIFU by drinking 2+ litres of Rum", "created_utc": 1492303809.0, "distinguished": null, "media": null, "upvote_ratio": 0.6, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": "", "user_reports": [], "id": "dgbpb8x", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "moffetts9001", "parent_id": "t3_65mimq", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Seek help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seek help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgbpb8x", "score_hidden": false, "stickied": false, "created": 1492347177.0, "created_utc": 1492318377.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": "", "user_reports": [], "id": "dgc8c9q", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "goeiendag", "parent_id": "t1_dgc1g7t", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "And help", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And help&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgc8c9q", "score_hidden": false, "stickied": false, "created": 1492389296.0, "created_utc": 1492360496.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1g7t", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "shizu_murasaki", "parent_id": "t3_65mimq", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "You need some paragraph breaks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need some paragraph breaks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgc1g7t", "score_hidden": false, "stickied": false, "created": 1492379182.0, "created_utc": 1492350382.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": "", "user_reports": [], "id": "dgcgcg2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "baref00tmama", "parent_id": "t3_65mimq", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "You need rehab. Go to a social service agency and explain your situation. They will help you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need rehab. Go to a social service agency and explain your situation. They will help you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgcgcg2", "score_hidden": false, "stickied": false, "created": 1492399869.0, "created_utc": 1492371069.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": "", "user_reports": [], "id": "dgcn2ny", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mbt20", "parent_id": "t1_dgcc2do", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Oh man if you think it's a mess now you should have seen me a month or two ago. I used for years and got on meth one night and ended up using that for the last couple months. Now, other than the drinks, completely sober for the first time in almost a decade. I haven't even smoked weed the last couple weeks. I shrank my circle of friends down to just a couple people that have known me my whole life. I don't hang out with my brother anymore. I have to give \"frank\" all the credit. He showed me a video of me smoking ice, something I thought I would never do. And has helped me stay away from drugs the last couple weeks. I owe him alot probably my life\n\nEdit: clarification: i've had a couple puffs of bud at parties since, but i haven't purchased or had any bud myself in weeks. The last time I didn't own bud for this long was 2009. Two years ago I smoked around 2 ounces a month and was a pill junkie.", "edited": 1492380268.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man if you think it&amp;#39;s a mess now you should have seen me a month or two ago. I used for years and got on meth one night and ended up using that for the last couple months. Now, other than the drinks, completely sober for the first time in almost a decade. I haven&amp;#39;t even smoked weed the last couple weeks. I shrank my circle of friends down to just a couple people that have known me my whole life. I don&amp;#39;t hang out with my brother anymore. I have to give &amp;quot;frank&amp;quot; all the credit. He showed me a video of me smoking ice, something I thought I would never do. And has helped me stay away from drugs the last couple weeks. I owe him alot probably my life&lt;/p&gt;\n\n&lt;p&gt;Edit: clarification: i&amp;#39;ve had a couple puffs of bud at parties since, but i haven&amp;#39;t purchased or had any bud myself in weeks. The last time I didn&amp;#39;t own bud for this long was 2009. Two years ago I smoked around 2 ounces a month and was a pill junkie.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgcn2ny", "score_hidden": false, "stickied": false, "created": 1492408638.0, "created_utc": 1492379838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc2do", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Mickeymousetitdirt", "parent_id": "t3_65mimq", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "You need help. Immediately. Your life is in a bad place and I think this is evident to you. Is your new job a restaurant job? If so, you can make some money pretty quickly if you breeze through training. But, you really need help. ASAP. I don't say it to be mean. But, you're posting this, I feel, as a cry for help. So, go acquire that help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need help. Immediately. Your life is in a bad place and I think this is evident to you. Is your new job a restaurant job? If so, you can make some money pretty quickly if you breeze through training. But, you really need help. ASAP. I don&amp;#39;t say it to be mean. But, you&amp;#39;re posting this, I feel, as a cry for help. So, go acquire that help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgcc2do", "score_hidden": false, "stickied": false, "created": 1492394160.0, "created_utc": 1492365360.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": "", "user_reports": [], "id": "dgctg96", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RealRealDirty", "parent_id": "t1_dgcnlmv", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Maaann that's fucking awesome to hear. Good job dude! Keep it going, it only gets better and easier(as I'm sure you know). Again seriously, if you ever want/need to talk to some random dude from the interwebs, just hit me up. I can relate to what you're going through. Except I *gained* weight when I quit using hahahaha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maaann that&amp;#39;s fucking awesome to hear. Good job dude! Keep it going, it only gets better and easier(as I&amp;#39;m sure you know). Again seriously, if you ever want/need to talk to some random dude from the interwebs, just hit me up. I can relate to what you&amp;#39;re going through. Except I &lt;em&gt;gained&lt;/em&gt; weight when I quit using hahahaha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgctg96", "score_hidden": false, "stickied": false, "created": 1492417304.0, "created_utc": 1492388504.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnlmv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mbt20", "parent_id": "t1_dgcnfok", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Ty man. Appreciate it. If I remember I'll post an update. Maybe a before and after picture. I was all pale and sickly looking. Now the color of my skin is coming back and I've dropped a fair amount of weight. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ty man. Appreciate it. If I remember I&amp;#39;ll post an update. Maybe a before and after picture. I was all pale and sickly looking. Now the color of my skin is coming back and I&amp;#39;ve dropped a fair amount of weight. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgcnlmv", "score_hidden": false, "stickied": false, "created": 1492409317.0, "created_utc": 1492380517.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnfok", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RealRealDirty", "parent_id": "t1_dgcmrr8", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "I hope the best for you. Congratulations on getting off the ice, just keep at it and please don't go back. It gets easier \n\nYeah I would definitely ween off the booze. You can do it, man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope the best for you. Congratulations on getting off the ice, just keep at it and please don&amp;#39;t go back. It gets easier &lt;/p&gt;\n\n&lt;p&gt;Yeah I would definitely ween off the booze. You can do it, man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgcnfok", "score_hidden": false, "stickied": false, "created": 1492409106.0, "created_utc": 1492380306.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmrr8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mbt20", "parent_id": "t1_dgclea7", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Appreciate it. I'm going to stop drinking completely soon. I woke up this morning and the ice withdrawals were finally gone. Probably going to have to ween off of it a bit. Last time I stopped my hands shook like crazy, so I'm guessing it wouldn't be safe to stop cold turkey.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Appreciate it. I&amp;#39;m going to stop drinking completely soon. I woke up this morning and the ice withdrawals were finally gone. Probably going to have to ween off of it a bit. Last time I stopped my hands shook like crazy, so I&amp;#39;m guessing it wouldn&amp;#39;t be safe to stop cold turkey.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgcmrr8", "score_hidden": false, "stickied": false, "created": 1492408234.0, "created_utc": 1492379434.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclea7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RealRealDirty", "parent_id": "t1_dgckhzu", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Good for you, man. I just stopped using fentanyl September 3 last year, so I definitely understand the use of alcohol to cover WD symptoms. I would suggest getting some Suboxone treatment, but I assume that doesn't really work if your D.O.C. is methamphetamine. I wish you all of the luck. If you ever need to talk or whatever, shoot me a PM. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good for you, man. I just stopped using fentanyl September 3 last year, so I definitely understand the use of alcohol to cover WD symptoms. I would suggest getting some Suboxone treatment, but I assume that doesn&amp;#39;t really work if your D.O.C. is methamphetamine. I wish you all of the luck. If you ever need to talk or whatever, shoot me a PM. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgclea7", "score_hidden": false, "stickied": false, "created": 1492406423.0, "created_utc": 1492377623.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckhzu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mbt20", "parent_id": "t1_dgcjpvf", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "I actually quit using last week. The drinking stops the withdrawals from the other substances or at least when I get drunk I don't have the urge to go do ice. So as much as everyone thinks I need to seek out help, I have to deal with these demons 1 at a time. Other than drinking I'm drug free for the first time in almost a decade.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually quit using last week. The drinking stops the withdrawals from the other substances or at least when I get drunk I don&amp;#39;t have the urge to go do ice. So as much as everyone thinks I need to seek out help, I have to deal with these demons 1 at a time. Other than drinking I&amp;#39;m drug free for the first time in almost a decade.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgckhzu", "score_hidden": false, "stickied": false, "created": 1492405252.0, "created_utc": 1492376452.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wsc9", "removal_reason": null, "link_id": "t3_65mimq", "likes": null, "replies": "", "user_reports": [], "id": "dge9zvu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RealRealDirty", "parent_id": "t1_dge9bxu", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "It takes months and months to feel normal after using, don't forget that. I was a very high functioning addict and parent. \n\nOddly enough I was my dudes \"guinea pig\" when it came to new batches, hence my overdose. I was never nervous because I was an extreme idiot and felt \"it would never happen to me\". You can find ridiculous stuff on the dark web, it surprised me too. A part of me finds it exillerating that I found it and a huge part of me wishes I never felt that high. During the end of my using I was *literally* going insane. The stuff I was getting also had SSRI's in it which caused me seizures during my withdrawals. Never again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It takes months and months to feel normal after using, don&amp;#39;t forget that. I was a very high functioning addict and parent. &lt;/p&gt;\n\n&lt;p&gt;Oddly enough I was my dudes &amp;quot;guinea pig&amp;quot; when it came to new batches, hence my overdose. I was never nervous because I was an extreme idiot and felt &amp;quot;it would never happen to me&amp;quot;. You can find ridiculous stuff on the dark web, it surprised me too. A part of me finds it exillerating that I found it and a huge part of me wishes I never felt that high. During the end of my using I was &lt;em&gt;literally&lt;/em&gt; going insane. The stuff I was getting also had SSRI&amp;#39;s in it which caused me seizures during my withdrawals. Never again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dge9zvu", "score_hidden": false, "stickied": false, "created": 1492498948.0, "created_utc": 1492470148.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge9bxu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mojayokok", "parent_id": "t1_dge2yv6", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Drinking  vinegar sounds really unpleasant, LOL!  I can't believe you even got something worthwhile like that online from China, I can't tell you how many times I tried to order pills online and they'd send this placebo oblong white pill that had blue dots not to mention that it would take 15-20 business days to get to the East Coast of the States.  It was the same no matter where you ordered so it's crazy to think they'd sent something that strong.  I'm afraid of any type of powder or really anything that doesn't have the info on a pill in order to look it up.  I used to get high and I was able to clean the house in OCD mode, do the laundry and do my Amazon orders, I was a high functioning addict to say the least.  Your stuff sounds scary, I'm happy for you that you were able to get clean.  I don't know about you but I seriously thought getting clean would have me happy and relieved because withdrawals make you want to die and waiting for your dealer to call is maddening, it just takes over your life and I can say I was very wrong, it didn't make me happy, my Bipolar weighs me down every couple of months and life is so goddamn boring it makes me miss using ... maybe that's just my experience though. \n\n\n\nTL:DR  A lot of rambling and really no useful info so consider this to be your warning 🤗", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Drinking  vinegar sounds really unpleasant, LOL!  I can&amp;#39;t believe you even got something worthwhile like that online from China, I can&amp;#39;t tell you how many times I tried to order pills online and they&amp;#39;d send this placebo oblong white pill that had blue dots not to mention that it would take 15-20 business days to get to the East Coast of the States.  It was the same no matter where you ordered so it&amp;#39;s crazy to think they&amp;#39;d sent something that strong.  I&amp;#39;m afraid of any type of powder or really anything that doesn&amp;#39;t have the info on a pill in order to look it up.  I used to get high and I was able to clean the house in OCD mode, do the laundry and do my Amazon orders, I was a high functioning addict to say the least.  Your stuff sounds scary, I&amp;#39;m happy for you that you were able to get clean.  I don&amp;#39;t know about you but I seriously thought getting clean would have me happy and relieved because withdrawals make you want to die and waiting for your dealer to call is maddening, it just takes over your life and I can say I was very wrong, it didn&amp;#39;t make me happy, my Bipolar weighs me down every couple of months and life is so goddamn boring it makes me miss using ... maybe that&amp;#39;s just my experience though. &lt;/p&gt;\n\n&lt;p&gt;TL:DR  A lot of rambling and really no useful info so consider this to be your warning 🤗&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dge9bxu", "score_hidden": false, "stickied": false, "created": 1492498078.0, "created_utc": 1492469278.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge2yv6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RealRealDirty", "parent_id": "t1_dge25dy", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Hahahaha I understand. Well, to start I wasn't doing what most people think of as fentanyl (such as patches or IV from a hospital). I was getting powder form from China. So, it's not like it was medical grade fentanyl, it was an analog of the drug that your body accepts as fentanyl. Extremely dangerous, extremely stupid, gets you extremely high. Many MANY people have died from trying to shoot the same drug I was doing. There was no safe way to bang the formula I had. The safest was to mix with an acid(such as vinegar, and drink it). My dumb ass chose to smoke it off foil. Almost just as dangerous as banging it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hahahaha I understand. Well, to start I wasn&amp;#39;t doing what most people think of as fentanyl (such as patches or IV from a hospital). I was getting powder form from China. So, it&amp;#39;s not like it was medical grade fentanyl, it was an analog of the drug that your body accepts as fentanyl. Extremely dangerous, extremely stupid, gets you extremely high. Many MANY people have died from trying to shoot the same drug I was doing. There was no safe way to bang the formula I had. The safest was to mix with an acid(such as vinegar, and drink it). My dumb ass chose to smoke it off foil. Almost just as dangerous as banging it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dge2yv6", "score_hidden": false, "stickied": false, "created": 1492490304.0, "created_utc": 1492461504.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge25dy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mojayokok", "parent_id": "t1_dgdcreh", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "I had to Google fentanyl because I thought I was thinking of the wrong thing but I wasn't.  Can I ask how you had access to that?  It's hard enough just to get regular pain pills and that stuff doesn't sound like something a Dr. would give a Rx too.  I'm not questioning you I'm just literally being nosy and maybe a little jealous. 🤗", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had to Google fentanyl because I thought I was thinking of the wrong thing but I wasn&amp;#39;t.  Can I ask how you had access to that?  It&amp;#39;s hard enough just to get regular pain pills and that stuff doesn&amp;#39;t sound like something a Dr. would give a Rx too.  I&amp;#39;m not questioning you I&amp;#39;m just literally being nosy and maybe a little jealous. 🤗&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dge25dy", "score_hidden": false, "stickied": false, "created": 1492489392.0, "created_utc": 1492460592.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcreh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RealRealDirty", "parent_id": "t1_dgd8d35", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Eh you never know \n\nEx fentanyl user and overdose stupid head.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh you never know &lt;/p&gt;\n\n&lt;p&gt;Ex fentanyl user and overdose stupid head.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgdcreh", "score_hidden": false, "stickied": false, "created": 1492455368.0, "created_utc": 1492426568.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8d35", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mojayokok", "parent_id": "t1_dgcjpvf", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Your intentions are giood but ppl stating over and over \"Get help\" makes no difference, he has to his rock bottom and he hasn't yet, ppl don't seek help based on several comments to do so (ex pill junkie, 4 1/2 years clean and life is so damn boring that I miss doing it)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your intentions are giood but ppl stating over and over &amp;quot;Get help&amp;quot; makes no difference, he has to his rock bottom and he hasn&amp;#39;t yet, ppl don&amp;#39;t seek help based on several comments to do so (ex pill junkie, 4 1/2 years clean and life is so damn boring that I miss doing it)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgd8d35", "score_hidden": false, "stickied": false, "created": 1492441378.0, "created_utc": 1492412578.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjpvf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RealRealDirty", "parent_id": "t3_65mimq", "subreddit_name_prefixed": "r/sadcringe", "controversiality": 0, "body": "Please get help, man. I understand how while you're using everything feels like a joke and all is well(except for cash flow) but life is so much better when it's not constantly clouded by a substance. And, believe me, you will be even more motivated to get an even better paying job when you're sober. It's definitely worth it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please get help, man. I understand how while you&amp;#39;re using everything feels like a joke and all is well(except for cash flow) but life is so much better when it&amp;#39;s not constantly clouded by a substance. And, believe me, you will be even more motivated to get an even better paying job when you&amp;#39;re sober. It&amp;#39;s definitely worth it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sadcringe", "name": "t1_dgcjpvf", "score_hidden": false, "stickied": false, "created": 1492404239.0, "created_utc": 1492375439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]