[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "circlejerk", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64o9ov", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "ColonMockery", "saved": false, "mod_reports": [], "name": "t3_64o9ov", "subreddit_name_prefixed": "r/circlejerk", "approved_by": null, "over_18": false, "domain": "self.circlejerk", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_2qpol", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/circlejerk/comments/64o9ov/samuel_l_jackson_ive_had_it_with_these_motherfing/", "num_reports": null, "locked": false, "stickied": false, "created": 1491907818.0, "url": "https://www.reddit.com/r/circlejerk/comments/64o9ov/samuel_l_jackson_ive_had_it_with_these_motherfing/", "author_flair_text": null, "quarantine": false, "title": "Samuel L Jackson- \"I've had it with these motherf-*%ing Chinese-American doctors on this motherf-*%ing plane!\"", "created_utc": 1491879018.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_64o9ov", "likes": null, "replies": "", "user_reports": [], "id": "dg3r5al", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "succerberg", "parent_id": "t3_64o9ov", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "Ok, this is ABSOLUTE fucking bullshit. I went to see Cars in the theater yesterday, and when Lightning McQueen got HOT with Sally in Radiator Springs, my boner engaged. When Lightning McQueen said \"Ka-Chow!\", I couldn't help it!!! I closed my eyes, and I TORE my dick to shreds, using whip like motions and pulled with great force. That was one of the best nuts I ever had, just thinking about it now gets me riled up. Thing is, I nutted all over the kid sitting right next to me, and his mom got all pissed at me, screaming at me for jacking off on her son. I told that bitch to shut the fuck up, and that jacking off is a natural, artistic, and beautiful process. You should BE HAPPY that my semen is all over your son, maybe he can learn a lesson or two about the culture and art of jacking off. HOWEVER, the movie theater managers didn't agree with me. They KICKED ME OUT of the movie theater, and I didn't even finish watching the Cars movie. Not only THAT, but they made me clean up my semen after it already dried out and solidified on the seats. THATS TORTURE!! Do you know how hard it is to clean semen after its dried out? You CLEAN semen after its FRESH out of your cock, not an hour after you fucking nutted. This is a fucking OUTRAGE. Do you really expect me to not whip out my cock and jack off when i see a HOT sex scene in a movie? Either don't ban sex scenes in movies, or LET ME jack off in your theater, assholes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, this is ABSOLUTE fucking bullshit. I went to see Cars in the theater yesterday, and when Lightning McQueen got HOT with Sally in Radiator Springs, my boner engaged. When Lightning McQueen said &amp;quot;Ka-Chow!&amp;quot;, I couldn&amp;#39;t help it!!! I closed my eyes, and I TORE my dick to shreds, using whip like motions and pulled with great force. That was one of the best nuts I ever had, just thinking about it now gets me riled up. Thing is, I nutted all over the kid sitting right next to me, and his mom got all pissed at me, screaming at me for jacking off on her son. I told that bitch to shut the fuck up, and that jacking off is a natural, artistic, and beautiful process. You should BE HAPPY that my semen is all over your son, maybe he can learn a lesson or two about the culture and art of jacking off. HOWEVER, the movie theater managers didn&amp;#39;t agree with me. They KICKED ME OUT of the movie theater, and I didn&amp;#39;t even finish watching the Cars movie. Not only THAT, but they made me clean up my semen after it already dried out and solidified on the seats. THATS TORTURE!! Do you know how hard it is to clean semen after its dried out? You CLEAN semen after its FRESH out of your cock, not an hour after you fucking nutted. This is a fucking OUTRAGE. Do you really expect me to not whip out my cock and jack off when i see a HOT sex scene in a movie? Either don&amp;#39;t ban sex scenes in movies, or LET ME jack off in your theater, assholes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dg3r5al", "score_hidden": false, "stickied": false, "created": 1491908304.0, "created_utc": 1491879504.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]