[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "circlejerk", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64quyp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 79, "report_reasons": null, "author": "rbosst", "saved": false, "mod_reports": [], "name": "t3_64quyp", "subreddit_name_prefixed": "r/circlejerk", "approved_by": null, "over_18": false, "domain": "self.circlejerk", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_2qpol", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/circlejerk/comments/64quyp/breaking_comcast_buys_out_united_airlines/", "num_reports": null, "locked": false, "stickied": false, "created": 1491946742.0, "url": "https://www.reddit.com/r/circlejerk/comments/64quyp/breaking_comcast_buys_out_united_airlines/", "author_flair_text": null, "quarantine": false, "title": "BREAKING: COMCAST BUYS OUT UNITED AIRLINES", "created_utc": 1491917942.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 79}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_64quyp", "likes": null, "replies": "", "user_reports": [], "id": "dg56god", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaeBorowskisGhost", "parent_id": "t3_64quyp", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "I'm Harambe, and this is my zoo enclosure. I work here with my zoo keeper and my friend, cecil the lion. Everything in here has a story and a price. One thing I've learned after 21 years - you never know **WHO** is gonna come over that fence.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m Harambe, and this is my zoo enclosure. I work here with my zoo keeper and my friend, cecil the lion. Everything in here has a story and a price. One thing I&amp;#39;ve learned after 21 years - you never know &lt;strong&gt;WHO&lt;/strong&gt; is gonna come over that fence.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dg56god", "score_hidden": false, "stickied": false, "created": 1491985367.0, "created_utc": 1491956567.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_64quyp", "likes": null, "replies": "", "user_reports": [], "id": "dg574gl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ibreakstuffbyacciden", "parent_id": "t3_64quyp", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "That is a very complicated issue with many contributing factors.\n\nA lot of this is the result of politics and the war on drugs. Overall, there has been an extensive militarization of the police.  The police want the ability to deal with problems themselves. They want to have local SWAT teams and military grade equipment.\n\nThis does improve their ability to react to serious threats. However, only the best become SWAT.  So there is a drive to become militaristic there.\n\nYou have to remember that local SWAT teams are still a new-ish thing.  In the past, you really only had SWAT teams in major cities.  And they only dealt with serious problems. Like hostages, stand-offs, or raids on organized crime.  A lot of the time, the national guard would be called in for the real shit. As they were trained for real conflicts.  You didn't want soldiers policing the streets normally. Soldiers are trained to be combative. While police are supposed to serve and protect. To de-escalate problems rather than fight them.\n\nPrior to the war on drugs, US SWAT teams were deployed roughly 3000 times per year. Now we see SWAT being used over 50000 times per year.  Almost every city has a SWAT team these days, and they are deployed for any reason.  Most of the time a warrant gets served, or a situation is deemed risky, the SWAT team gets deployed.  This leads to more interaction between the public, and the arm of the police trained to be combative. Although, the training the police are using seems to be more combative year after year.\n\nThis is a problem. You can see it in the video. The officer reacts to an unarmed individual who is no real threat to him by slamming her to the ground like she is a terrorist with a gun in her hand.  We are supposed to use the least amount of force necessary to accomplish the goal.  To arrest this woman would have required very little force.\n\nSO why isn't more done to stop this behavior?  Because so much is being done to cause this combative behavior. We are giving small town police forces machine guns and tanks and military training on this military hardware.  Of course they are going to become very combative with the people they are supposed to serve and protect.  We are training them and equipping them to fight a war that isn't coming.  History tells is in very certain terms what happens when you have a large standing army.\n\nAs for your second question, \"Why isn't more done to punish these criminals with a badge?\"... well that one is much simpler.\n\nFirst, we're militarizing the police force.  So they are going to act more like soldiers.  Soldiers cover each other's backs. It is us vs them, and the only ones keeping you alive are the guys to your left and right.  In the army, you look after your buddy. Cover up for him if he makes a mistake. You want him to want to keep you alive. \n\nIn the army, this is good. In the police, it's probably a breach of ethics.\n\nFurthermore, when the police fuck up... It's the police who investigate the police.  And the police who decide the punishment.  I mean, that's like the textbook recipe for corruption. There just isn't enough external oversight.  \n\nWhen it  comes down to it, these sort of things are going to continue to happen, and at an increasing rate until we demilitarize the police, reduce SWAT teams to being a single state-wide department external to local police, and implement sweeping reforms to training, oversight, and punishment of police offenses.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is a very complicated issue with many contributing factors.&lt;/p&gt;\n\n&lt;p&gt;A lot of this is the result of politics and the war on drugs. Overall, there has been an extensive militarization of the police.  The police want the ability to deal with problems themselves. They want to have local SWAT teams and military grade equipment.&lt;/p&gt;\n\n&lt;p&gt;This does improve their ability to react to serious threats. However, only the best become SWAT.  So there is a drive to become militaristic there.&lt;/p&gt;\n\n&lt;p&gt;You have to remember that local SWAT teams are still a new-ish thing.  In the past, you really only had SWAT teams in major cities.  And they only dealt with serious problems. Like hostages, stand-offs, or raids on organized crime.  A lot of the time, the national guard would be called in for the real shit. As they were trained for real conflicts.  You didn&amp;#39;t want soldiers policing the streets normally. Soldiers are trained to be combative. While police are supposed to serve and protect. To de-escalate problems rather than fight them.&lt;/p&gt;\n\n&lt;p&gt;Prior to the war on drugs, US SWAT teams were deployed roughly 3000 times per year. Now we see SWAT being used over 50000 times per year.  Almost every city has a SWAT team these days, and they are deployed for any reason.  Most of the time a warrant gets served, or a situation is deemed risky, the SWAT team gets deployed.  This leads to more interaction between the public, and the arm of the police trained to be combative. Although, the training the police are using seems to be more combative year after year.&lt;/p&gt;\n\n&lt;p&gt;This is a problem. You can see it in the video. The officer reacts to an unarmed individual who is no real threat to him by slamming her to the ground like she is a terrorist with a gun in her hand.  We are supposed to use the least amount of force necessary to accomplish the goal.  To arrest this woman would have required very little force.&lt;/p&gt;\n\n&lt;p&gt;SO why isn&amp;#39;t more done to stop this behavior?  Because so much is being done to cause this combative behavior. We are giving small town police forces machine guns and tanks and military training on this military hardware.  Of course they are going to become very combative with the people they are supposed to serve and protect.  We are training them and equipping them to fight a war that isn&amp;#39;t coming.  History tells is in very certain terms what happens when you have a large standing army.&lt;/p&gt;\n\n&lt;p&gt;As for your second question, &amp;quot;Why isn&amp;#39;t more done to punish these criminals with a badge?&amp;quot;... well that one is much simpler.&lt;/p&gt;\n\n&lt;p&gt;First, we&amp;#39;re militarizing the police force.  So they are going to act more like soldiers.  Soldiers cover each other&amp;#39;s backs. It is us vs them, and the only ones keeping you alive are the guys to your left and right.  In the army, you look after your buddy. Cover up for him if he makes a mistake. You want him to want to keep you alive. &lt;/p&gt;\n\n&lt;p&gt;In the army, this is good. In the police, it&amp;#39;s probably a breach of ethics.&lt;/p&gt;\n\n&lt;p&gt;Furthermore, when the police fuck up... It&amp;#39;s the police who investigate the police.  And the police who decide the punishment.  I mean, that&amp;#39;s like the textbook recipe for corruption. There just isn&amp;#39;t enough external oversight.  &lt;/p&gt;\n\n&lt;p&gt;When it  comes down to it, these sort of things are going to continue to happen, and at an increasing rate until we demilitarize the police, reduce SWAT teams to being a single state-wide department external to local police, and implement sweeping reforms to training, oversight, and punishment of police offenses.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dg574gl", "score_hidden": false, "stickied": false, "created": 1491986256.0, "created_utc": 1491957456.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_64quyp", "likes": null, "replies": "", "user_reports": [], "id": "dg5qk21", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mexifro218", "parent_id": "t3_64quyp", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "Isthislegit", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Isthislegit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dg5qk21", "score_hidden": false, "stickied": false, "created": 1492024983.0, "created_utc": 1491996183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_64quyp", "likes": null, "replies": "", "user_reports": [], "id": "dgcqmia", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "succerberg", "parent_id": "t3_64quyp", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "I used to masturbate onto birds at a local park. Not a thing that I'm particularly proud of but I became quite good at it. I was taking zinc supplements so I was shooting massive loads and it became something of a sport to me. For anyone interested here is your best strategy. first, you need to find an isolated spot so you don't become a sex offender. I found a short kind of channel area where I saw the pigeons would congregate. Next, you arouse yourself. I was usually content with envisioning the occasional jogging lady coming over and taking a shit on my chest and that was enough to fuel the fire but if you're not as sexually charged as me just take some porn on the go. After you're good an horny, you get some bread. My pigeons preferred white bread but healthier birds might have a taste for honey wheat or maybe even multigrain. Fat, unhealthy birds are slower and easier to hit so remember that. Once you are seated on the bench and ready to do the deed, whip your roosevelt out and scatter bread out within a few feet of you. use your judgement based on how far you know you can cum. I was a lonely and depraved soul who could hit targets the size of a thimble at distances up to 4 feet. You wait for the pigeons to begin eating and to get comfortable with your presence. At this point, you want to coo gently and talk sensually to them to gain their trust. Now you're finally ready to cum on your bird. This is a tough part because the rapid motion of masturbation is very frightening to the birds, so you have to be subtle. Once you master a technique, you simply wind it up and let it go, aiming depending on your past cumming experiences. I always came high so I would aim for the neck of the bird and catch it right in the face. It's an extremely satisfying and erotic feeling, seeing those birds reel around covered in cum and maybe even transporting it to other places in the city. Either way I haven't done it in years but every now and then I catch myself gazing wistfully at a flock of birds, cock throbbing and waiting for them to land close to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to masturbate onto birds at a local park. Not a thing that I&amp;#39;m particularly proud of but I became quite good at it. I was taking zinc supplements so I was shooting massive loads and it became something of a sport to me. For anyone interested here is your best strategy. first, you need to find an isolated spot so you don&amp;#39;t become a sex offender. I found a short kind of channel area where I saw the pigeons would congregate. Next, you arouse yourself. I was usually content with envisioning the occasional jogging lady coming over and taking a shit on my chest and that was enough to fuel the fire but if you&amp;#39;re not as sexually charged as me just take some porn on the go. After you&amp;#39;re good an horny, you get some bread. My pigeons preferred white bread but healthier birds might have a taste for honey wheat or maybe even multigrain. Fat, unhealthy birds are slower and easier to hit so remember that. Once you are seated on the bench and ready to do the deed, whip your roosevelt out and scatter bread out within a few feet of you. use your judgement based on how far you know you can cum. I was a lonely and depraved soul who could hit targets the size of a thimble at distances up to 4 feet. You wait for the pigeons to begin eating and to get comfortable with your presence. At this point, you want to coo gently and talk sensually to them to gain their trust. Now you&amp;#39;re finally ready to cum on your bird. This is a tough part because the rapid motion of masturbation is very frightening to the birds, so you have to be subtle. Once you master a technique, you simply wind it up and let it go, aiming depending on your past cumming experiences. I always came high so I would aim for the neck of the bird and catch it right in the face. It&amp;#39;s an extremely satisfying and erotic feeling, seeing those birds reel around covered in cum and maybe even transporting it to other places in the city. Either way I haven&amp;#39;t done it in years but every now and then I catch myself gazing wistfully at a flock of birds, cock throbbing and waiting for them to land close to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgcqmia", "score_hidden": false, "stickied": false, "created": 1492413477.0, "created_utc": 1492384677.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]