[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "circlejerk", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65myoz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 54, "report_reasons": null, "author": "mikeyfreshh", "saved": false, "mod_reports": [], "name": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "approved_by": null, "over_18": false, "domain": "self.circlejerk", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_2qpol", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/circlejerk/comments/65myoz/people_who_are_colorblind_what_are_some_gray_flags/", "num_reports": null, "locked": false, "stickied": false, "created": 1492338804.0, "url": "https://www.reddit.com/r/circlejerk/comments/65myoz/people_who_are_colorblind_what_are_some_gray_flags/", "author_flair_text": null, "quarantine": false, "title": "People who are colorblind what are some gray flags?", "created_utc": 1492310004.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 54}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": "", "user_reports": [], "id": "dgbordm", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "kibretw", "parent_id": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "As a reminder, this subreddit is for civil discussion.\n\nIn general, be courteous to others. Attack ideas, not users. Personal insults, shill or troll accusations, hate speech, and other incivility violations can result in a permanent ban.\n\nIf you see comments in violation of our rules, please report them.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a reminder, this subreddit is for civil discussion.&lt;/p&gt;\n\n&lt;p&gt;In general, be courteous to others. Attack ideas, not users. Personal insults, shill or troll accusations, hate speech, and other incivility violations can result in a permanent ban.&lt;/p&gt;\n\n&lt;p&gt;If you see comments in violation of our rules, please report them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbordm", "score_hidden": false, "stickied": false, "created": 1492346177.0, "created_utc": 1492317377.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": "", "user_reports": [], "id": "dgbm8b0", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "6734521980", "parent_id": "t1_dgbltxb", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "Chapter I: Bourgeois and Proletarians\n\nThe history of all hitherto existing society is the history of class struggles.\n\nFreeman and slave, patrician and plebeian, lord and serf, guild-master and journeyman, in a word, oppressor and oppressed, stood in constant opposition to one another, carried on an uninterrupted, now hidden, now open fight, a fight that each time ended, either in a revolutionary reconstitution of society at large, or in the common ruin of the contending classes.\n\nIn the earlier epochs of history, we find almost everywhere a complicated arrangement of society into various orders, a manifold gradation of social rank. In ancient Rome we have patricians, knights, plebeians, slaves; in the Middle Ages, feudal lords, vassals, guild-masters, journeymen, apprentices, serfs; in almost all of these classes, again, subordinate gradations.\n\nThe modern bourgeois society that has sprouted from the ruins of feudal society has not done away with class antagonisms. It has but established new classes, new conditions of oppression, new forms of struggle in place of the old ones.\n\nOur epoch, the epoch of the bourgeoisie, possesses, however, this distinct feature: it has simplified class antagonisms. Society as a whole is more and more splitting up into two great hostile camps, into two great classes directly facing each other — Bourgeoisie and Proletariat.\n\nFrom the serfs of the Middle Ages sprang the chartered burghers of the earliest towns. From these burgesses the first elements of the bourgeoisie were developed.\n\nThe discovery of America, the rounding of the Cape, opened up fresh ground for the rising bourgeoisie. The East-Indian and Chinese markets, the colonization of America, trade with the colonies, the increase in the means of exchange and in commodities generally, gave to commerce, to navigation, to industry, an impulse never before known, and thereby, to the revolutionary element in the tottering feudal society, a rapid development.\n\nThe feudal system of industry, in which industrial production was monopolized by closed guilds, now no longer sufficed for the growing wants of the new markets. The manufacturing system took its place. The guild-masters were pushed on one side by the manufacturing middle class; division of labor between the different corporate guilds vanished in the face of division of labor in each single workshop.\n\nMeantime the markets kept ever growing, the demand ever rising. Even manufacturer no longer sufficed. Thereupon, steam and machinery revolutionized industrial production. The place of manufacture was taken by the giant, Modern Industry; the place of the industrial middle class by industrial millionaires, the leaders of the whole industrial armies, the modern bourgeois.\n\nModern industry has established the world market, for which the discovery of America paved the way. This market has given an immense development to commerce, to navigation, to communication by land. This development has, in its turn, reacted on the extension of industry; and in proportion as industry, commerce, navigation, railways extended, in the same proportion the bourgeoisie developed, increased its capital, and pushed into the background every class handed down from the Middle Ages.\n\nWe see, therefore, how the modern bourgeoisie is itself the product of a long course of development, of a series of revolutions in the modes of production and of exchange.\n\nEach step in the development of the bourgeoisie was accompanied by a corresponding political advance of that class. An oppressed class under the sway of the feudal nobility, an armed and self-governing association in the medieval commune(4): here independent urban republic (as in Italy and Germany); there taxable “third estate” of the monarchy (as in France); afterwards, in the period of manufacturing proper, serving either the semi-feudal or the absolute monarchy as a counterpoise against the nobility, and, in fact, cornerstone of the great monarchies in general, the bourgeoisie has at last, since the establishment of Modern Industry and of the world market, conquered for itself, in the modern representative State, exclusive political sway. The executive of the modern state is but a committee for managing the common affairs of the whole bourgeoisie.\n\nThe bourgeoisie, historically, has played a most revolutionary part.\n\nThe bourgeoisie, wherever it has got the upper hand, has put an end to all feudal, patriarchal, idyllic relations. It has pitilessly torn asunder the motley feudal ties that bound man to his “natural superiors”, and has left remaining no other nexus between man and man than naked self-interest, than callous “cash payment”. It has drowned the most heavenly ecstasies of religious fervor, of chivalrous enthusiasm, of philistine sentimentalism, in the icy water of egotistical calculation. It has resolved personal worth into exchange value, and in place of the numberless indefeasible chartered freedoms, has set up that single, unconscionable freedom — Free Trade. In one word, for exploitation, veiled by religious and political illusions, it has substituted naked, shameless, direct, brutal exploitation.\n\nThe bourgeoisie has stripped of its halo every occupation hitherto honored and looked up to with reverent awe. It has converted the physician, the lawyer, the priest, the poet, the man of science, into its paid wage laborers.\n\nThe bourgeoisie has torn away from the family its sentimental veil, and has reduced the family relation to a mere money relation.\n\nThe bourgeoisie has disclosed how it came to pass that the brutal display of vigor in the Middle Ages, which reactionaries so much admire, found its fitting complement in the most slothful indolence. It has been the first to show what man’s activity can bring about. It has accomplished wonders far surpassing Egyptian pyramids, Roman aqueducts, and Gothic cathedrals; it has conducted expeditions that put in the shade all former Exoduses of nations and crusades.\n\nThe bourgeoisie cannot exist without constantly revolutionizing the instruments of production, and thereby the relations of production, and with them the whole relations of society. Conservation of the old modes of production in unaltered form, was, on the contrary, the first condition of existence for all earlier industrial classes. Constant revolutionizing of production, uninterrupted disturbance of all social conditions, everlasting uncertainty and agitation distinguish the bourgeois epoch from all earlier ones. All fixed, fast-frozen relations, with their train of ancient and venerable prejudices and opinions, are swept away, all new-formed ones become antiquated before they can ossify. All that is solid melts into air, all that is holy is profaned, and man is at last compelled to face with sober senses his real conditions of life, and his relations with his kind.\n\nThe need of a constantly expanding market for its products chases the bourgeoisie over the entire surface of the globe. It must nestle everywhere, settle everywhere, establish connections everywhere.\n\nThe bourgeoisie has through its exploitation of the world market given a cosmopolitan character to production and consumption in every country. To the great chagrin of Reactionaries, it has drawn from under the feet of industry the national ground on which it stood. All old-established national industries have been destroyed or are daily being destroyed. They are dislodged by new industries, whose introduction becomes a life and death question for all civilized nations, by industries that no longer work up indigenous raw material, but raw material drawn from the remotest zones; industries whose products are consumed, not only at home, but in every quarter of the globe. In place of the old wants, satisfied by the production of the country, we find new wants, requiring for their satisfaction the products of distant lands and climes. In place of the old local and national seclusion and self-sufficiency, we have intercourse in every direction, universal inter-dependence of nations. And as in material, so also in intellectual production. The intellectual creations of individual nations become common property. National one-sidedness and narrow-mindedness become more and more impossible, and from the numerous national and local literature, there arises a world literature.\n\nThe bourgeoisie, by the rapid improvement of all instruments of production, by the immensely facilitated means of communication, draws all, even the most barbarian, nations into civilization. The cheap prices of commodities are the heavy artillery with which it batters down all Chinese walls, with which it forces the barbarians’ intensely obstinate hatred of foreigners to capitulate. It compels all nations, on pain of extinction, to adopt the bourgeois mode of production; it compels them to introduce what it calls civilization into their midst, i.e., to become bourgeois themselves. In one word, it creates a world after its own image.\n\nThe bourgeoisie has subjected the country to the rule of the towns. It has created enormous cities, has greatly increased the urban population as compared with the rural, and has thus rescued a considerable part of the population from the idiocy of rural life. Just as it has made the country dependent on the towns, so it has made barbarian and semi-barbarian countries dependent on the civilized ones, nations of peasants on nations of bourgeois, the East on the West.", "edited": 1492313581.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Chapter I: Bourgeois and Proletarians&lt;/p&gt;\n\n&lt;p&gt;The history of all hitherto existing society is the history of class struggles.&lt;/p&gt;\n\n&lt;p&gt;Freeman and slave, patrician and plebeian, lord and serf, guild-master and journeyman, in a word, oppressor and oppressed, stood in constant opposition to one another, carried on an uninterrupted, now hidden, now open fight, a fight that each time ended, either in a revolutionary reconstitution of society at large, or in the common ruin of the contending classes.&lt;/p&gt;\n\n&lt;p&gt;In the earlier epochs of history, we find almost everywhere a complicated arrangement of society into various orders, a manifold gradation of social rank. In ancient Rome we have patricians, knights, plebeians, slaves; in the Middle Ages, feudal lords, vassals, guild-masters, journeymen, apprentices, serfs; in almost all of these classes, again, subordinate gradations.&lt;/p&gt;\n\n&lt;p&gt;The modern bourgeois society that has sprouted from the ruins of feudal society has not done away with class antagonisms. It has but established new classes, new conditions of oppression, new forms of struggle in place of the old ones.&lt;/p&gt;\n\n&lt;p&gt;Our epoch, the epoch of the bourgeoisie, possesses, however, this distinct feature: it has simplified class antagonisms. Society as a whole is more and more splitting up into two great hostile camps, into two great classes directly facing each other — Bourgeoisie and Proletariat.&lt;/p&gt;\n\n&lt;p&gt;From the serfs of the Middle Ages sprang the chartered burghers of the earliest towns. From these burgesses the first elements of the bourgeoisie were developed.&lt;/p&gt;\n\n&lt;p&gt;The discovery of America, the rounding of the Cape, opened up fresh ground for the rising bourgeoisie. The East-Indian and Chinese markets, the colonization of America, trade with the colonies, the increase in the means of exchange and in commodities generally, gave to commerce, to navigation, to industry, an impulse never before known, and thereby, to the revolutionary element in the tottering feudal society, a rapid development.&lt;/p&gt;\n\n&lt;p&gt;The feudal system of industry, in which industrial production was monopolized by closed guilds, now no longer sufficed for the growing wants of the new markets. The manufacturing system took its place. The guild-masters were pushed on one side by the manufacturing middle class; division of labor between the different corporate guilds vanished in the face of division of labor in each single workshop.&lt;/p&gt;\n\n&lt;p&gt;Meantime the markets kept ever growing, the demand ever rising. Even manufacturer no longer sufficed. Thereupon, steam and machinery revolutionized industrial production. The place of manufacture was taken by the giant, Modern Industry; the place of the industrial middle class by industrial millionaires, the leaders of the whole industrial armies, the modern bourgeois.&lt;/p&gt;\n\n&lt;p&gt;Modern industry has established the world market, for which the discovery of America paved the way. This market has given an immense development to commerce, to navigation, to communication by land. This development has, in its turn, reacted on the extension of industry; and in proportion as industry, commerce, navigation, railways extended, in the same proportion the bourgeoisie developed, increased its capital, and pushed into the background every class handed down from the Middle Ages.&lt;/p&gt;\n\n&lt;p&gt;We see, therefore, how the modern bourgeoisie is itself the product of a long course of development, of a series of revolutions in the modes of production and of exchange.&lt;/p&gt;\n\n&lt;p&gt;Each step in the development of the bourgeoisie was accompanied by a corresponding political advance of that class. An oppressed class under the sway of the feudal nobility, an armed and self-governing association in the medieval commune(4): here independent urban republic (as in Italy and Germany); there taxable “third estate” of the monarchy (as in France); afterwards, in the period of manufacturing proper, serving either the semi-feudal or the absolute monarchy as a counterpoise against the nobility, and, in fact, cornerstone of the great monarchies in general, the bourgeoisie has at last, since the establishment of Modern Industry and of the world market, conquered for itself, in the modern representative State, exclusive political sway. The executive of the modern state is but a committee for managing the common affairs of the whole bourgeoisie.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie, historically, has played a most revolutionary part.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie, wherever it has got the upper hand, has put an end to all feudal, patriarchal, idyllic relations. It has pitilessly torn asunder the motley feudal ties that bound man to his “natural superiors”, and has left remaining no other nexus between man and man than naked self-interest, than callous “cash payment”. It has drowned the most heavenly ecstasies of religious fervor, of chivalrous enthusiasm, of philistine sentimentalism, in the icy water of egotistical calculation. It has resolved personal worth into exchange value, and in place of the numberless indefeasible chartered freedoms, has set up that single, unconscionable freedom — Free Trade. In one word, for exploitation, veiled by religious and political illusions, it has substituted naked, shameless, direct, brutal exploitation.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie has stripped of its halo every occupation hitherto honored and looked up to with reverent awe. It has converted the physician, the lawyer, the priest, the poet, the man of science, into its paid wage laborers.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie has torn away from the family its sentimental veil, and has reduced the family relation to a mere money relation.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie has disclosed how it came to pass that the brutal display of vigor in the Middle Ages, which reactionaries so much admire, found its fitting complement in the most slothful indolence. It has been the first to show what man’s activity can bring about. It has accomplished wonders far surpassing Egyptian pyramids, Roman aqueducts, and Gothic cathedrals; it has conducted expeditions that put in the shade all former Exoduses of nations and crusades.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie cannot exist without constantly revolutionizing the instruments of production, and thereby the relations of production, and with them the whole relations of society. Conservation of the old modes of production in unaltered form, was, on the contrary, the first condition of existence for all earlier industrial classes. Constant revolutionizing of production, uninterrupted disturbance of all social conditions, everlasting uncertainty and agitation distinguish the bourgeois epoch from all earlier ones. All fixed, fast-frozen relations, with their train of ancient and venerable prejudices and opinions, are swept away, all new-formed ones become antiquated before they can ossify. All that is solid melts into air, all that is holy is profaned, and man is at last compelled to face with sober senses his real conditions of life, and his relations with his kind.&lt;/p&gt;\n\n&lt;p&gt;The need of a constantly expanding market for its products chases the bourgeoisie over the entire surface of the globe. It must nestle everywhere, settle everywhere, establish connections everywhere.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie has through its exploitation of the world market given a cosmopolitan character to production and consumption in every country. To the great chagrin of Reactionaries, it has drawn from under the feet of industry the national ground on which it stood. All old-established national industries have been destroyed or are daily being destroyed. They are dislodged by new industries, whose introduction becomes a life and death question for all civilized nations, by industries that no longer work up indigenous raw material, but raw material drawn from the remotest zones; industries whose products are consumed, not only at home, but in every quarter of the globe. In place of the old wants, satisfied by the production of the country, we find new wants, requiring for their satisfaction the products of distant lands and climes. In place of the old local and national seclusion and self-sufficiency, we have intercourse in every direction, universal inter-dependence of nations. And as in material, so also in intellectual production. The intellectual creations of individual nations become common property. National one-sidedness and narrow-mindedness become more and more impossible, and from the numerous national and local literature, there arises a world literature.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie, by the rapid improvement of all instruments of production, by the immensely facilitated means of communication, draws all, even the most barbarian, nations into civilization. The cheap prices of commodities are the heavy artillery with which it batters down all Chinese walls, with which it forces the barbarians’ intensely obstinate hatred of foreigners to capitulate. It compels all nations, on pain of extinction, to adopt the bourgeois mode of production; it compels them to introduce what it calls civilization into their midst, i.e., to become bourgeois themselves. In one word, it creates a world after its own image.&lt;/p&gt;\n\n&lt;p&gt;The bourgeoisie has subjected the country to the rule of the towns. It has created enormous cities, has greatly increased the urban population as compared with the rural, and has thus rescued a considerable part of the population from the idiocy of rural life. Just as it has made the country dependent on the towns, so it has made barbarian and semi-barbarian countries dependent on the civilized ones, nations of peasants on nations of bourgeois, the East on the West.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbm8b0", "score_hidden": false, "stickied": false, "created": 1492342041.0, "created_utc": 1492313241.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbltxb", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "succerberg", "parent_id": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "The community here is cancer. Everything is being swallowed by copypastas. The comments section of every post is slowly degrading into a shitfesty circlejerk. Even this is going to end up as a copypasta, I guarantee it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The community here is cancer. Everything is being swallowed by copypastas. The comments section of every post is slowly degrading into a shitfesty circlejerk. Even this is going to end up as a copypasta, I guarantee it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbltxb", "score_hidden": false, "stickied": false, "created": 1492341420.0, "created_utc": 1492312620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": "", "user_reports": [], "id": "dgbr7ri", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Samesyo", "parent_id": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "Adolf take the wheel ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Adolf take the wheel &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbr7ri", "score_hidden": false, "stickied": false, "created": 1492350893.0, "created_utc": 1492322093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": "", "user_reports": [], "id": "dgbtzeo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pluto098", "parent_id": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "On a serious note suicide is a problem that is near and dear to some of with colorblindness and it can be a very troubling issue. If you are having thoughts of wanting to see color that can result in damaging outbursts, please dial one of these numbers numbers below for help! Or, just go ahead and do it, I don't really give a fuck to be honest. Remember, no medical advice is allowed in our posts and that includes psychiatric advice (asking for medical treatments of psychological diseases).\n\nU.S.\n\nCutting: 1-800-366-8288\n\nSubstance Abuse: 1-877-726-4727\n\nDomestic Abuse: 1-800-799-7233\n\nDepression Hotline: 1-630-482-9696\n\nSuicide Hotline: 1-800-784-8433\n\nLifeLine: 1-800-273-8255\n\nCrisis Textline: Text \"start\" to 741-741\n\nHuman trafficking: 1-(888)-373-7888\n\nTrevor Project (LGBT sexuality support): 1-866-488-7386\n\nSexuality Support: 1-800-246-7743\n\nEating Disorders Hotline: 1-847-831-3438\n\nRape and Sexual Assault: 1-800-656-4673\n\nGrief Support: 1-650-321-5272\n\nRunaway: National Runaway Safeline 1-800-RUNAWAY (1-800-786-2929)\n\nExhale: Abortion Hotline/Pro-Voice: 1-866-4394253\n\nInternational Hotline List:\n\nhttp://www.suicide.org/international-suicide-hotlines.html\n\nUK:\n\nSamaritans (Suicide / General Crisis): 08457 90 90 90\n\nRape: 0808 802 634 1414\n\nEating / Weight Issues: 0845 634 1414\n\nAnother one in the UK: Campaign Against Living Miserably - 0800 58 58 58\n\nCanada:\n\nGeneral Crisis Help: http://www.dcontario.org/help.html (Click your location for the number, Ontario only)\n\nKids Help (Under 19): 800-668-6868\n\nSuicide Hotline - 1.800.784.2433.\n\nDistress Centre for Southern Alberta (Canada) - 1.403.266.4357,\n\nhttp://suicideprevention.ca/thinking-about-suicide/find-a-crisis-centre/\n\nhttp://mindcheck.ca/\n\nNew Zealand\n\nYouthline: 0800 37 66 33\n\nLifeline 24/7 Helpline: 0800 543 354\n\nSuicide Prevention Helpline: 0508 TAUTOKO (0508 828 865)\n\nChinese Lifeline: 0800 888 880\n\nAustralia\n\nSuicide Call Back Service: 1300 659 467\n\nCommunity Action for the Prevention of Suicide (CAPS): 1800 008 255\n\nhttp://www.beyondblue.org.au/get-support/national-help-lines-and-websites\n\nLifeline: 13 11 14\n\nKids Help Line (ages 15-25): 1800 55 1800\n\nSweden\n\nSjälvmordslinjen: 90101 Chatt: https://mind.se/sjalvmordslinjen/chatt/\n\nJourhavande medmänniska: 08- 702 16 80 öppet 21-06 http://www.jourhavande-medmanniska.com/\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On a serious note suicide is a problem that is near and dear to some of with colorblindness and it can be a very troubling issue. If you are having thoughts of wanting to see color that can result in damaging outbursts, please dial one of these numbers numbers below for help! Or, just go ahead and do it, I don&amp;#39;t really give a fuck to be honest. Remember, no medical advice is allowed in our posts and that includes psychiatric advice (asking for medical treatments of psychological diseases).&lt;/p&gt;\n\n&lt;p&gt;U.S.&lt;/p&gt;\n\n&lt;p&gt;Cutting: 1-800-366-8288&lt;/p&gt;\n\n&lt;p&gt;Substance Abuse: 1-877-726-4727&lt;/p&gt;\n\n&lt;p&gt;Domestic Abuse: 1-800-799-7233&lt;/p&gt;\n\n&lt;p&gt;Depression Hotline: 1-630-482-9696&lt;/p&gt;\n\n&lt;p&gt;Suicide Hotline: 1-800-784-8433&lt;/p&gt;\n\n&lt;p&gt;LifeLine: 1-800-273-8255&lt;/p&gt;\n\n&lt;p&gt;Crisis Textline: Text &amp;quot;start&amp;quot; to 741-741&lt;/p&gt;\n\n&lt;p&gt;Human trafficking: 1-(888)-373-7888&lt;/p&gt;\n\n&lt;p&gt;Trevor Project (LGBT sexuality support): 1-866-488-7386&lt;/p&gt;\n\n&lt;p&gt;Sexuality Support: 1-800-246-7743&lt;/p&gt;\n\n&lt;p&gt;Eating Disorders Hotline: 1-847-831-3438&lt;/p&gt;\n\n&lt;p&gt;Rape and Sexual Assault: 1-800-656-4673&lt;/p&gt;\n\n&lt;p&gt;Grief Support: 1-650-321-5272&lt;/p&gt;\n\n&lt;p&gt;Runaway: National Runaway Safeline 1-800-RUNAWAY (1-800-786-2929)&lt;/p&gt;\n\n&lt;p&gt;Exhale: Abortion Hotline/Pro-Voice: 1-866-4394253&lt;/p&gt;\n\n&lt;p&gt;International Hotline List:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.suicide.org/international-suicide-hotlines.html\"&gt;http://www.suicide.org/international-suicide-hotlines.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;UK:&lt;/p&gt;\n\n&lt;p&gt;Samaritans (Suicide / General Crisis): 08457 90 90 90&lt;/p&gt;\n\n&lt;p&gt;Rape: 0808 802 634 1414&lt;/p&gt;\n\n&lt;p&gt;Eating / Weight Issues: 0845 634 1414&lt;/p&gt;\n\n&lt;p&gt;Another one in the UK: Campaign Against Living Miserably - 0800 58 58 58&lt;/p&gt;\n\n&lt;p&gt;Canada:&lt;/p&gt;\n\n&lt;p&gt;General Crisis Help: &lt;a href=\"http://www.dcontario.org/help.html\"&gt;http://www.dcontario.org/help.html&lt;/a&gt; (Click your location for the number, Ontario only)&lt;/p&gt;\n\n&lt;p&gt;Kids Help (Under 19): 800-668-6868&lt;/p&gt;\n\n&lt;p&gt;Suicide Hotline - 1.800.784.2433.&lt;/p&gt;\n\n&lt;p&gt;Distress Centre for Southern Alberta (Canada) - 1.403.266.4357,&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://suicideprevention.ca/thinking-about-suicide/find-a-crisis-centre/\"&gt;http://suicideprevention.ca/thinking-about-suicide/find-a-crisis-centre/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://mindcheck.ca/\"&gt;http://mindcheck.ca/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;New Zealand&lt;/p&gt;\n\n&lt;p&gt;Youthline: 0800 37 66 33&lt;/p&gt;\n\n&lt;p&gt;Lifeline 24/7 Helpline: 0800 543 354&lt;/p&gt;\n\n&lt;p&gt;Suicide Prevention Helpline: 0508 TAUTOKO (0508 828 865)&lt;/p&gt;\n\n&lt;p&gt;Chinese Lifeline: 0800 888 880&lt;/p&gt;\n\n&lt;p&gt;Australia&lt;/p&gt;\n\n&lt;p&gt;Suicide Call Back Service: 1300 659 467&lt;/p&gt;\n\n&lt;p&gt;Community Action for the Prevention of Suicide (CAPS): 1800 008 255&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.beyondblue.org.au/get-support/national-help-lines-and-websites\"&gt;http://www.beyondblue.org.au/get-support/national-help-lines-and-websites&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Lifeline: 13 11 14&lt;/p&gt;\n\n&lt;p&gt;Kids Help Line (ages 15-25): 1800 55 1800&lt;/p&gt;\n\n&lt;p&gt;Sweden&lt;/p&gt;\n\n&lt;p&gt;Självmordslinjen: 90101 Chatt: &lt;a href=\"https://mind.se/sjalvmordslinjen/chatt/\"&gt;https://mind.se/sjalvmordslinjen/chatt/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Jourhavande medmänniska: 08- 702 16 80 öppet 21-06 &lt;a href=\"http://www.jourhavande-medmanniska.com/\"&gt;http://www.jourhavande-medmanniska.com/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbtzeo", "score_hidden": false, "stickied": false, "created": 1492357995.0, "created_utc": 1492329195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": "", "user_reports": [], "id": "dgbo090", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "The-idiots114", "parent_id": "t1_dgbn7tj", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "Explain to me what your username is supposed to be", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Explain to me what your username is supposed to be&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbo090", "score_hidden": false, "stickied": false, "created": 1492344883.0, "created_utc": 1492316083.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbn7tj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "6734521980", "parent_id": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "The splitting up of the world into three great super-states was an event which could be and indeed was foreseen before the middle of the twentieth century. With the absorption of Europe by Russia and of the British Empire by the United States, two of the three existing powers, Eurasia and Oceania, were already effectively in being. The third, Eastasia, only emerged as a distinct unit after another decade of confused fighting. The frontiers between the three super-states are in some places arbitrary, and in others they fluctuate according to the fortunes of war, but in general they follow geographical lines. Eurasia comprises the whole of the northern part of the European and Asiatic land-mass, from Portugal to the Bering Strait. Oceania comprises the Americas, the Atlantic islands including the British Isles, Australasia, and the southern portion of Africa. Eastasia, smaller than the others and with a less definite western frontier, comprises China and the countries to the south of it, the Japanese islands and a large but fluctuating portion of Manchuria, Mongolia, and Tibet. In one combination or another, these three super-states are permanently at war, and have been so for the past twenty-five years. War, however, is no longer the desperate, annihilating struggle that it was in the early decades of the twentieth century. It is a warfare of limited aims between combatants who are unable to destroy one another, have no material cause for fighting and are not divided by any genuine ideological difference. This is not to say that either the conduct of war, or the prevailing attitude towards it, has become less bloodthirsty or more chivalrous. On the contrary, war hysteria is continuous and universal in all countries, and such acts as raping, looting, the slaughter of children, the reduction of whole populations to slavery, and reprisals against prisoners which extend even to boiling and burying alive, are looked upon as normal, and, when they are committed by one's own side and not by the enemy, meritorious. But in a physical sense war involves very small numbers of people, mostly highly-trained specialists, and causes comparatively few casualties. The fighting, when there is any, takes place on the vague frontiers whose whereabouts the average man can only guess at, or round the Floating Fortresses which guard strategic spots on the sea lanes. In the centres of civilization war means no more than a continuous shortage of consumption goods, and the occasional crash of a rocket bomb which may cause a few scores of deaths. War has in fact changed its character. More exactly, the reasons for which war is waged have changed in their order of importance. Motives which were already present to some small extent in the great wars of the early twentieth century have now become dominant and are consciously recognized and acted upon. To understand the nature of the present war -- for in spite of the regrouping which occurs every few years, it is always the same war -- one must realize in the first place that it is impossible for it to be decisive. None of the three super-states could be definitively conquered even by the other two in combination. They are too evenly matched, and their natural defences are too formidable. Eurasia is protected by its vast land spaces. Oceania by the width of the Atlantic and the Pacific, Eastasia by the fecundity and industriousness of its inhabitants. Secondly, there is no longer, in a material sense, anything to fight about. With the establishment of self-contained economies, in which production and consumption are geared to one another, the scramble for markets which was a main cause of previous wars has come to an end, while the competition for raw materials is no longer a matter of life and death. In any case each of the three super-states is so vast that it can obtain almost all the materials that it needs within its own boundaries. In so far as the war has a direct economic purpose, it is a war for labour power. Between the frontiers of the super-states, and not permanently in the possession of any of them, there lies a rough quadrilateral with its corners at Tangier, Brazzaville, Darwin, and Hong Kong, containing within it about a fifth of the population of the earth. It is for the possession of these thickly-populated regions, and of the northern ice-cap, that the three powers are constantly struggling. In practice no one power ever controls the whole of the disputed area. Portions of it are constantly changing hands, and it is the chance of seizing this or that fragment by a sudden stroke of treachery that dictates the endless changes of alignment. All of the disputed territories contain valuable minerals, and some of them yield important vegetable products such as rubber which in colder climates it is necessary to synthesize by comparatively expensive methods. But above all they contain a bottomless reserve of cheap labour. Whichever power controls equatorial Africa, or the countries of the Middle East, or Southern India, or the Indonesian Archipelago, disposes also of the bodies of scores or hundreds of millions of ill-paid and hard-working coolies. The inhabitants of these areas, reduced more or less openly to the status of slaves, pass continually from conqueror to conqueror, and are expended like so much coal or oil in the race to turn out more armaments, to capture more territory, to control more labour power, to turn out more armaments, to capture more territory, and so on indefinitely. It should be noted that the fighting never really moves beyond the edges of the disputed areas. The frontiers of Eurasia flow back and forth between the basin of the Congo and the northern shore of the Mediterranean; the islands of the Indian Ocean and the Pacific are constantly being captured and recaptured by Oceania or by Eastasia; in Mongolia the dividing line between Eurasia and Eastasia is never stable; round the Pole all three powers lay claim to enormous territories which in fact are largely unihabited and unexplored: but the balance of power always remains roughly even, and the territory which forms the heartland of each super-state always remains inviolate. Moreover, the labour of the exploited peoples round the Equator is not really necessary to the world's economy. They add nothing to the wealth of the world, since whatever they produce is used for purposes of war, and the object of waging a war is always to be in a better position in which to wage another war. By their labour the slave populations allow the tempo of continuous warfare to be speeded up. But if they did not exist, the structure of world society, and the process by which it maintains itself, would not be essentially different. The primary aim of modern warfare (in accordance with the principles of doublethink, this aim is simultaneously recognized and not recognized by the directing brains of the Inner Party) is to use up the products of the machine without raising the general standard of living. Ever since the end of the nineteenth century, the problem of what to do with the surplus of consumption goods has been latent in industrial society. At present, when few human beings even have enough to eat, this problem is obviously not urgent, and it might not have become so, even if no artificial processes of destruction had been at work. The world of today is a bare, hungry, dilapidated place compared with the world that existed before 1914, and still more so if compared with the imaginary future to which the people of that period looked forward. In the early twentieth century, the vision of a future society unbelievably rich, leisured, orderly, and efficient -- a glittering antiseptic world of glass and steel and snow-white concrete -- was part of the consciousness of nearly every literate person. Science and technology were developing at a prodigious speed, and it seemed natural to assume that they would go on developing. This failed to happen, partly because of the impoverishment caused by a long series of wars and revolutions, partly because scientific and technical progress depended on the empirical habit of thought, which could not survive in a strictly regimented society. As a whole the world is more primitive today than it was fifty years ago. Certain backward areas have advanced, and various devices, always in some way connected with warfare and police espionage, have been developed, but experiment and invention have largely stopped, and the ravages of the atomic war of the nineteen-fifties have never been fully repaired. Nevertheless the dangers inherent in the machine are still there. From the moment when the machine first made its appearance it was clear to all thinking people that the need for human drudgery, and therefore to a great extent for human inequality, had disappeared. If the machine were used deliberately for that end, hunger, overwork, dirt, illiteracy, and disease could be eliminated within a few generations. And in fact, without being used for any such purpose, but by a sort of automatic process -- by producing wealth which it was sometimes impossible not to distribute -- the machine did raise the living standards of the average human being very greatly over a period of about fifty years at the end of the nineteenth and the beginning of the twentieth centuries.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The splitting up of the world into three great super-states was an event which could be and indeed was foreseen before the middle of the twentieth century. With the absorption of Europe by Russia and of the British Empire by the United States, two of the three existing powers, Eurasia and Oceania, were already effectively in being. The third, Eastasia, only emerged as a distinct unit after another decade of confused fighting. The frontiers between the three super-states are in some places arbitrary, and in others they fluctuate according to the fortunes of war, but in general they follow geographical lines. Eurasia comprises the whole of the northern part of the European and Asiatic land-mass, from Portugal to the Bering Strait. Oceania comprises the Americas, the Atlantic islands including the British Isles, Australasia, and the southern portion of Africa. Eastasia, smaller than the others and with a less definite western frontier, comprises China and the countries to the south of it, the Japanese islands and a large but fluctuating portion of Manchuria, Mongolia, and Tibet. In one combination or another, these three super-states are permanently at war, and have been so for the past twenty-five years. War, however, is no longer the desperate, annihilating struggle that it was in the early decades of the twentieth century. It is a warfare of limited aims between combatants who are unable to destroy one another, have no material cause for fighting and are not divided by any genuine ideological difference. This is not to say that either the conduct of war, or the prevailing attitude towards it, has become less bloodthirsty or more chivalrous. On the contrary, war hysteria is continuous and universal in all countries, and such acts as raping, looting, the slaughter of children, the reduction of whole populations to slavery, and reprisals against prisoners which extend even to boiling and burying alive, are looked upon as normal, and, when they are committed by one&amp;#39;s own side and not by the enemy, meritorious. But in a physical sense war involves very small numbers of people, mostly highly-trained specialists, and causes comparatively few casualties. The fighting, when there is any, takes place on the vague frontiers whose whereabouts the average man can only guess at, or round the Floating Fortresses which guard strategic spots on the sea lanes. In the centres of civilization war means no more than a continuous shortage of consumption goods, and the occasional crash of a rocket bomb which may cause a few scores of deaths. War has in fact changed its character. More exactly, the reasons for which war is waged have changed in their order of importance. Motives which were already present to some small extent in the great wars of the early twentieth century have now become dominant and are consciously recognized and acted upon. To understand the nature of the present war -- for in spite of the regrouping which occurs every few years, it is always the same war -- one must realize in the first place that it is impossible for it to be decisive. None of the three super-states could be definitively conquered even by the other two in combination. They are too evenly matched, and their natural defences are too formidable. Eurasia is protected by its vast land spaces. Oceania by the width of the Atlantic and the Pacific, Eastasia by the fecundity and industriousness of its inhabitants. Secondly, there is no longer, in a material sense, anything to fight about. With the establishment of self-contained economies, in which production and consumption are geared to one another, the scramble for markets which was a main cause of previous wars has come to an end, while the competition for raw materials is no longer a matter of life and death. In any case each of the three super-states is so vast that it can obtain almost all the materials that it needs within its own boundaries. In so far as the war has a direct economic purpose, it is a war for labour power. Between the frontiers of the super-states, and not permanently in the possession of any of them, there lies a rough quadrilateral with its corners at Tangier, Brazzaville, Darwin, and Hong Kong, containing within it about a fifth of the population of the earth. It is for the possession of these thickly-populated regions, and of the northern ice-cap, that the three powers are constantly struggling. In practice no one power ever controls the whole of the disputed area. Portions of it are constantly changing hands, and it is the chance of seizing this or that fragment by a sudden stroke of treachery that dictates the endless changes of alignment. All of the disputed territories contain valuable minerals, and some of them yield important vegetable products such as rubber which in colder climates it is necessary to synthesize by comparatively expensive methods. But above all they contain a bottomless reserve of cheap labour. Whichever power controls equatorial Africa, or the countries of the Middle East, or Southern India, or the Indonesian Archipelago, disposes also of the bodies of scores or hundreds of millions of ill-paid and hard-working coolies. The inhabitants of these areas, reduced more or less openly to the status of slaves, pass continually from conqueror to conqueror, and are expended like so much coal or oil in the race to turn out more armaments, to capture more territory, to control more labour power, to turn out more armaments, to capture more territory, and so on indefinitely. It should be noted that the fighting never really moves beyond the edges of the disputed areas. The frontiers of Eurasia flow back and forth between the basin of the Congo and the northern shore of the Mediterranean; the islands of the Indian Ocean and the Pacific are constantly being captured and recaptured by Oceania or by Eastasia; in Mongolia the dividing line between Eurasia and Eastasia is never stable; round the Pole all three powers lay claim to enormous territories which in fact are largely unihabited and unexplored: but the balance of power always remains roughly even, and the territory which forms the heartland of each super-state always remains inviolate. Moreover, the labour of the exploited peoples round the Equator is not really necessary to the world&amp;#39;s economy. They add nothing to the wealth of the world, since whatever they produce is used for purposes of war, and the object of waging a war is always to be in a better position in which to wage another war. By their labour the slave populations allow the tempo of continuous warfare to be speeded up. But if they did not exist, the structure of world society, and the process by which it maintains itself, would not be essentially different. The primary aim of modern warfare (in accordance with the principles of doublethink, this aim is simultaneously recognized and not recognized by the directing brains of the Inner Party) is to use up the products of the machine without raising the general standard of living. Ever since the end of the nineteenth century, the problem of what to do with the surplus of consumption goods has been latent in industrial society. At present, when few human beings even have enough to eat, this problem is obviously not urgent, and it might not have become so, even if no artificial processes of destruction had been at work. The world of today is a bare, hungry, dilapidated place compared with the world that existed before 1914, and still more so if compared with the imaginary future to which the people of that period looked forward. In the early twentieth century, the vision of a future society unbelievably rich, leisured, orderly, and efficient -- a glittering antiseptic world of glass and steel and snow-white concrete -- was part of the consciousness of nearly every literate person. Science and technology were developing at a prodigious speed, and it seemed natural to assume that they would go on developing. This failed to happen, partly because of the impoverishment caused by a long series of wars and revolutions, partly because scientific and technical progress depended on the empirical habit of thought, which could not survive in a strictly regimented society. As a whole the world is more primitive today than it was fifty years ago. Certain backward areas have advanced, and various devices, always in some way connected with warfare and police espionage, have been developed, but experiment and invention have largely stopped, and the ravages of the atomic war of the nineteen-fifties have never been fully repaired. Nevertheless the dangers inherent in the machine are still there. From the moment when the machine first made its appearance it was clear to all thinking people that the need for human drudgery, and therefore to a great extent for human inequality, had disappeared. If the machine were used deliberately for that end, hunger, overwork, dirt, illiteracy, and disease could be eliminated within a few generations. And in fact, without being used for any such purpose, but by a sort of automatic process -- by producing wealth which it was sometimes impossible not to distribute -- the machine did raise the living standards of the average human being very greatly over a period of about fifty years at the end of the nineteenth and the beginning of the twentieth centuries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbn7tj", "score_hidden": false, "stickied": false, "created": 1492343564.0, "created_utc": 1492314764.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": "", "user_reports": [], "id": "dgbk5sr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MarsBarSpaceBar", "parent_id": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "North Szechuan State of Sanders\n\nedit: United Airlines fuck those guys", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;North Szechuan State of Sanders&lt;/p&gt;\n\n&lt;p&gt;edit: United Airlines fuck those guys&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbk5sr", "score_hidden": false, "stickied": false, "created": 1492338958.0, "created_utc": 1492310158.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": "", "user_reports": [], "id": "dgcp1i1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NotSoFastJohnson", "parent_id": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "The community here is cancer. Everything is being swallowed by copypastas. The comments section of every post is slowly degrading into a shitfesty circlejerk. Even this is going to end up as a copypasta, I guarantee it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The community here is cancer. Everything is being swallowed by copypastas. The comments section of every post is slowly degrading into a shitfesty circlejerk. Even this is going to end up as a copypasta, I guarantee it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgcp1i1", "score_hidden": false, "stickied": false, "created": 1492411282.0, "created_utc": 1492382482.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65myoz", "likes": null, "replies": "", "user_reports": [], "id": "dgbsxh7", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "biff_wonsley", "parent_id": "t3_65myoz", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "*Ricky Spanish*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Ricky Spanish&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgbsxh7", "score_hidden": false, "stickied": false, "created": 1492355069.0, "created_utc": 1492326269.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]