[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "circlejerk", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65p3wa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 60, "report_reasons": null, "author": "weaknessx100", "saved": false, "mod_reports": [], "name": "t3_65p3wa", "subreddit_name_prefixed": "r/circlejerk", "approved_by": null, "over_18": false, "domain": "encrypted-tbn1.gstatic.com", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/e4Zjs8SM5S8XTFvbQkp6-7m_hK9eUd-dcsTlxOTIFSI.jpg?s=c63a473eb1b3bf58c4048d8811c30b31", "width": 335, "height": 439}, "resolutions": [{"url": "https://i.redditmedia.com/e4Zjs8SM5S8XTFvbQkp6-7m_hK9eUd-dcsTlxOTIFSI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=74b6ec484985de2181fe8065cce9bd61", "width": 108, "height": 141}, {"url": "https://i.redditmedia.com/e4Zjs8SM5S8XTFvbQkp6-7m_hK9eUd-dcsTlxOTIFSI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=fab63e9ebe277f0b459da40bb8114b85", "width": 216, "height": 283}, {"url": "https://i.redditmedia.com/e4Zjs8SM5S8XTFvbQkp6-7m_hK9eUd-dcsTlxOTIFSI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=dd4d8e8ec9594fd679345299c44f92f6", "width": 320, "height": 419}], "variants": {"obfuscated": {"source": {"url": "https://i.redditmedia.com/e4Zjs8SM5S8XTFvbQkp6-7m_hK9eUd-dcsTlxOTIFSI.jpg?fm=png&amp;blur=600&amp;px=32&amp;s=1a32001592854ba6f5a041b999ba0625", "width": 335, "height": 439}, "resolutions": [{"url": "https://i.redditmedia.com/e4Zjs8SM5S8XTFvbQkp6-7m_hK9eUd-dcsTlxOTIFSI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;fm=png&amp;blur=600&amp;px=32&amp;s=8cfdf8766ad799a2d5947d6103daa4d4", "width": 108, "height": 141}, {"url": "https://i.redditmedia.com/e4Zjs8SM5S8XTFvbQkp6-7m_hK9eUd-dcsTlxOTIFSI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;fm=png&amp;blur=600&amp;px=32&amp;s=e3702e14888970611ad0c15f409646b7", "width": 216, "height": 283}, {"url": "https://i.redditmedia.com/e4Zjs8SM5S8XTFvbQkp6-7m_hK9eUd-dcsTlxOTIFSI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;fm=png&amp;blur=600&amp;px=32&amp;s=76216b1db8e442cbcd00b9573349c3b2", "width": 320, "height": 419}]}}, "id": "86IHRkYZwyzBCSn6GVgZquvhjIcXKgYTMvS9jB-lrDY"}], "enabled": false}, "thumbnail": "spoiler", "subreddit_id": "t5_2qpol", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "link", "is_self": false, "hide_score": false, "spoiler": true, "permalink": "/r/circlejerk/comments/65p3wa/adolf_hitler_if_you_upvote_this_image_it_will_be/", "num_reports": null, "locked": false, "stickied": false, "created": 1492378288.0, "url": "https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcQIrnrNc-t3sSkz1sCtA_k3FNsrZUP4xtFpLbThxEzuOg6k7dtpL6WSfF-4DA", "author_flair_text": null, "quarantine": false, "title": "Adolf Hitler. If you upvote this image it will be the first search result that comes up when someone searches 'Adolf Hitler'.", "created_utc": 1492349488.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 60}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65p3wa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65p3wa", "likes": null, "replies": "", "user_reports": [], "id": "dgcfym6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mr_Shav", "parent_id": "t1_dgc49ff", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "r/theydidthemath", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/theydidthemath\"&gt;r/theydidthemath&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgcfym6", "score_hidden": false, "stickied": false, "created": 1492399365.0, "created_utc": 1492370565.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65p3wa", "likes": null, "replies": "", "user_reports": [], "id": "dgd05kt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "humblegold", "parent_id": "t1_dgc49ff", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "but what about the high ground?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;but what about the high ground?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgd05kt", "score_hidden": false, "stickied": false, "created": 1492426372.0, "created_utc": 1492397572.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65p3wa", "likes": null, "replies": "", "user_reports": [], "id": "dgdcnct", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Archeiii", "parent_id": "t1_dgc49ff", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "1984 what a classic", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1984 what a classic&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgdcnct", "score_hidden": false, "stickied": false, "created": 1492455029.0, "created_utc": 1492426229.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc49ff", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "6734521980", "parent_id": "t3_65p3wa", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "Throughout recorded time, and probably since the end of the Neolithic Age, there have been three kinds of people in the world, the High, the Middle, and the Low. They have been subdivided in many ways, they have borne countless different names, and their relative numbers, as well as their attitude towards one another, have varied from age to age: but the essential structure of society has never altered. Even after enormous upheavals and seemingly irrevocable changes, the same pattern has always reasserted itself, just as a gyroscope will always return to equilibnum, however far it is pushed one way or the other. The aims of these three groups are entirely irreconcilable. The aim of the High is to remain where they are. The aim of the Middle is to change places with the High. The aim of the Low, when they have an aim -- for it is an abiding characteristic of the Low that they are too much crushed by drudgery to be more than intermittently conscious of anything outside their daily lives -- is to abolish all distinctions and create a society in which all men shall be equal. Thus throughout history a struggle which is the same in its main outlines recurs over and over again. For long periods the High seem to be securely in power, but sooner or later there always comes a moment when they lose either their belief in themselves or their capacity to govern efficiently, or both. They are then overthrown by the Middle, who enlist the Low on their side by pretending to them that they are fighting for liberty and justice. As soon as they have reached their objective, the Middle thrust the Low back into their old position of servitude, and themselves become the High. Presently a new Middle group splits off from one of the other groups, or from both of them, and the struggle begins over again. Of the three groups, only the Low are never even temporarily successful in achieving their aims. It would be an exaggeration to say that throughout history there has been no progress of a material kind. Even today, in a period of decline, the average human being is physically better off than he was a few centuries ago. But no advance in wealth, no softening of manners, no reform or revolution has ever brought human equality a millimetre nearer. From the point of view of the Low, no historic change has ever meant much more than a change in the name of their masters. By the late nineteenth century the recurrence of this pattern had become obvious to many observers. There then rose schools of thinkers who interpreted history as a cyclical process and claimed to show that inequality was the unalterable law of human life. This doctrine, of course, had always had its adherents, but in the manner in which it was now put forward there was a significant change. In the past the need for a hierarchical form of society had been the doctrine specifically of the High. It had been preached by kings and aristocrats and by the priests, lawyers, and the like who were parasitical upon them, and it had generally been softened by promises of compensation in an imaginary world beyond the grave. The Middle, so long as it was struggling for power, had always made use of such terms as freedom, justice, and fraternity. Now, however, the concept of human brotherhood began to be assailed by people who were not yet in positions of command, but merely hoped to be so before long. In the past the Middle had made revolutions under the banner of equality, and then had established a fresh tyranny as soon as the old one was overthrown. The new Middle groups in effect proclaimed their tyranny beforehand. Socialism, a theory which appeared in the early nineteenth century and was the last link in a chain of thought stretching back to the slave rebellions of antiquity, was still deeply infected by the Utopianism of past ages. But in each variant of Socialism that appeared from about 1900 onwards the aim of establishing liberty and equality was more and more openly abandoned. The new movements which appeared in the middle years of the century, Ingsoc in Oceania, Neo-Bolshevism in Eurasia, Death-Worship, as it is commonly called, in Eastasia, had the conscious aim of perpetuating unfreedom and inequality. These new movements, of course, grew out of the old ones and tended to keep their names and pay lip-service to their ideology. But the purpose of all of them was to arrest progress and freeze history at a chosen moment. The familiar pendulum swing was to happen once more, and then stop. As usual, the High were to be turned out by the Middle, who would then become the High; but this time, by conscious strategy, the High would be able to maintain their position permanently. The new doctrines arose partly because of the accumulation of historical knowledge, and the growth of the historical sense, which had hardly existed before the nineteenth century. The cyclical movement of history was now intelligible, or appeared to be so; and if it was intelligible, then it was alterable. But the principal, underlying cause was that, as early as the beginning of the twentieth century, human equality had become technically possible. It was still true that men were not equal in their native talents and that functions had to be specialized in ways that favoured some individuals against others; but there was no longer any real need for class distinctions or for large differences of wealth. In earlier ages, class distinctions had been not only inevitable but desirable. Inequality was the price of civilization. With the development of machine production, however, the case was altered. Even if it was still necessary for human beings to do different kinds of work, it was no longer necessary for them to live at different social or economic levels. Therefore, from the point of view of the new groups who were on the point of seizing power, human equality was no longer an ideal to be striven after, but a danger to be averted. In more primitive ages, when a just and peaceful society was in fact not possible, it had been fairly easy to believe it. The idea of an earthly paradise in which men should live together in a state of brotherhood, without laws and without brute labour, had haunted the human imagination for thousands of years. And this vision had had a certain hold even on the groups who actually profited by each historical change. The heirs of the French, English, and American revolutions had partly believed in their own phrases about the rights of man, freedom of speech, equality before the law, and the like, and have even allowed their conduct to be influenced by them to some extent. But by the fourth decade of the twentieth century all the main currents of political thought were authoritarian. The earthly paradise had been discredited at exactly the moment when it became realizable. Every new political theory, by whatever name it called itself, led back to hierarchy and regimentation. And in the general hardening of outlook that set in round about 1930, practices which had been long abandoned, in some cases for hundreds of years -- imprisonment without trial, the use of war prisoners as slaves, public executions, torture to extract confessions, the use of hostages, and the deportation of whole populations -- not only became common again, but were tolerated and even defended by people who considered themselves enlightened and progressive. It was only after a decade of national wars, civil wars, revolutions, and counter-revolutions in all parts of the world that Ingsoc and its rivals emerged as fully worked-out political theories. But they had been foreshadowed by the various systems, generally called totalitarian, which had appeared earlier in the century, and the main outlines of the world which would emerge from the prevailing chaos had long been obvious. What kind of people would control this world had been equally obvious. The new aristocracy was made up for the most part of bureaucrats, scientists, technicians, trade-union organizers, publicity experts, sociologists, teachers, journalists, and professional politicians. These people, whose origins lay in the salaried middle class and the upper grades of the working class, had been shaped and brought together by the barren world of monopoly industry and centralized government. As compared with their opposite numbers in past ages, they were less avaricious, less tempted by luxury, hungrier for pure power, and, above all, more conscious of what they were doing and more intent on crushing opposition. This last difference was cardinal. By comparison with that existing today, all the tyrannies of the past were half-hearted and inefficient. The ruling groups were always infected to some extent by liberal ideas, and were content to leave loose ends everywhere, to regard only the overt act and to be uninterested in what their subjects were thinking. Even the Catholic Church of the Middle Ages was tolerant by modern standards. Part of the reason for this was that in the past no government had the power to keep its citizens under constant surveillance. The invention of print, however, made it easier to manipulate public opinion, and the film and the radio carried the process further. With the development of television, and the technical advance which made it possible to receive and transmit simultaneously on the same instrument, private life came to an end. Every citizen, or at least every citizen important enough to be worth watching, could be kept for twenty-four hours a day under the eyes of the police and in the sound of official propaganda, with all other channels of communication closed. The possibility of enforcing not only complete obedience to the will of the State, but complete uniformity of opinion on all subjects, now existed for the first time. After the revolutionary period of the fifties and sixties, society regrouped itself, as always, into High, Middle, and Low. But the new High group, unlike all its forerunners, did not act upon i", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Throughout recorded time, and probably since the end of the Neolithic Age, there have been three kinds of people in the world, the High, the Middle, and the Low. They have been subdivided in many ways, they have borne countless different names, and their relative numbers, as well as their attitude towards one another, have varied from age to age: but the essential structure of society has never altered. Even after enormous upheavals and seemingly irrevocable changes, the same pattern has always reasserted itself, just as a gyroscope will always return to equilibnum, however far it is pushed one way or the other. The aims of these three groups are entirely irreconcilable. The aim of the High is to remain where they are. The aim of the Middle is to change places with the High. The aim of the Low, when they have an aim -- for it is an abiding characteristic of the Low that they are too much crushed by drudgery to be more than intermittently conscious of anything outside their daily lives -- is to abolish all distinctions and create a society in which all men shall be equal. Thus throughout history a struggle which is the same in its main outlines recurs over and over again. For long periods the High seem to be securely in power, but sooner or later there always comes a moment when they lose either their belief in themselves or their capacity to govern efficiently, or both. They are then overthrown by the Middle, who enlist the Low on their side by pretending to them that they are fighting for liberty and justice. As soon as they have reached their objective, the Middle thrust the Low back into their old position of servitude, and themselves become the High. Presently a new Middle group splits off from one of the other groups, or from both of them, and the struggle begins over again. Of the three groups, only the Low are never even temporarily successful in achieving their aims. It would be an exaggeration to say that throughout history there has been no progress of a material kind. Even today, in a period of decline, the average human being is physically better off than he was a few centuries ago. But no advance in wealth, no softening of manners, no reform or revolution has ever brought human equality a millimetre nearer. From the point of view of the Low, no historic change has ever meant much more than a change in the name of their masters. By the late nineteenth century the recurrence of this pattern had become obvious to many observers. There then rose schools of thinkers who interpreted history as a cyclical process and claimed to show that inequality was the unalterable law of human life. This doctrine, of course, had always had its adherents, but in the manner in which it was now put forward there was a significant change. In the past the need for a hierarchical form of society had been the doctrine specifically of the High. It had been preached by kings and aristocrats and by the priests, lawyers, and the like who were parasitical upon them, and it had generally been softened by promises of compensation in an imaginary world beyond the grave. The Middle, so long as it was struggling for power, had always made use of such terms as freedom, justice, and fraternity. Now, however, the concept of human brotherhood began to be assailed by people who were not yet in positions of command, but merely hoped to be so before long. In the past the Middle had made revolutions under the banner of equality, and then had established a fresh tyranny as soon as the old one was overthrown. The new Middle groups in effect proclaimed their tyranny beforehand. Socialism, a theory which appeared in the early nineteenth century and was the last link in a chain of thought stretching back to the slave rebellions of antiquity, was still deeply infected by the Utopianism of past ages. But in each variant of Socialism that appeared from about 1900 onwards the aim of establishing liberty and equality was more and more openly abandoned. The new movements which appeared in the middle years of the century, Ingsoc in Oceania, Neo-Bolshevism in Eurasia, Death-Worship, as it is commonly called, in Eastasia, had the conscious aim of perpetuating unfreedom and inequality. These new movements, of course, grew out of the old ones and tended to keep their names and pay lip-service to their ideology. But the purpose of all of them was to arrest progress and freeze history at a chosen moment. The familiar pendulum swing was to happen once more, and then stop. As usual, the High were to be turned out by the Middle, who would then become the High; but this time, by conscious strategy, the High would be able to maintain their position permanently. The new doctrines arose partly because of the accumulation of historical knowledge, and the growth of the historical sense, which had hardly existed before the nineteenth century. The cyclical movement of history was now intelligible, or appeared to be so; and if it was intelligible, then it was alterable. But the principal, underlying cause was that, as early as the beginning of the twentieth century, human equality had become technically possible. It was still true that men were not equal in their native talents and that functions had to be specialized in ways that favoured some individuals against others; but there was no longer any real need for class distinctions or for large differences of wealth. In earlier ages, class distinctions had been not only inevitable but desirable. Inequality was the price of civilization. With the development of machine production, however, the case was altered. Even if it was still necessary for human beings to do different kinds of work, it was no longer necessary for them to live at different social or economic levels. Therefore, from the point of view of the new groups who were on the point of seizing power, human equality was no longer an ideal to be striven after, but a danger to be averted. In more primitive ages, when a just and peaceful society was in fact not possible, it had been fairly easy to believe it. The idea of an earthly paradise in which men should live together in a state of brotherhood, without laws and without brute labour, had haunted the human imagination for thousands of years. And this vision had had a certain hold even on the groups who actually profited by each historical change. The heirs of the French, English, and American revolutions had partly believed in their own phrases about the rights of man, freedom of speech, equality before the law, and the like, and have even allowed their conduct to be influenced by them to some extent. But by the fourth decade of the twentieth century all the main currents of political thought were authoritarian. The earthly paradise had been discredited at exactly the moment when it became realizable. Every new political theory, by whatever name it called itself, led back to hierarchy and regimentation. And in the general hardening of outlook that set in round about 1930, practices which had been long abandoned, in some cases for hundreds of years -- imprisonment without trial, the use of war prisoners as slaves, public executions, torture to extract confessions, the use of hostages, and the deportation of whole populations -- not only became common again, but were tolerated and even defended by people who considered themselves enlightened and progressive. It was only after a decade of national wars, civil wars, revolutions, and counter-revolutions in all parts of the world that Ingsoc and its rivals emerged as fully worked-out political theories. But they had been foreshadowed by the various systems, generally called totalitarian, which had appeared earlier in the century, and the main outlines of the world which would emerge from the prevailing chaos had long been obvious. What kind of people would control this world had been equally obvious. The new aristocracy was made up for the most part of bureaucrats, scientists, technicians, trade-union organizers, publicity experts, sociologists, teachers, journalists, and professional politicians. These people, whose origins lay in the salaried middle class and the upper grades of the working class, had been shaped and brought together by the barren world of monopoly industry and centralized government. As compared with their opposite numbers in past ages, they were less avaricious, less tempted by luxury, hungrier for pure power, and, above all, more conscious of what they were doing and more intent on crushing opposition. This last difference was cardinal. By comparison with that existing today, all the tyrannies of the past were half-hearted and inefficient. The ruling groups were always infected to some extent by liberal ideas, and were content to leave loose ends everywhere, to regard only the overt act and to be uninterested in what their subjects were thinking. Even the Catholic Church of the Middle Ages was tolerant by modern standards. Part of the reason for this was that in the past no government had the power to keep its citizens under constant surveillance. The invention of print, however, made it easier to manipulate public opinion, and the film and the radio carried the process further. With the development of television, and the technical advance which made it possible to receive and transmit simultaneously on the same instrument, private life came to an end. Every citizen, or at least every citizen important enough to be worth watching, could be kept for twenty-four hours a day under the eyes of the police and in the sound of official propaganda, with all other channels of communication closed. The possibility of enforcing not only complete obedience to the will of the State, but complete uniformity of opinion on all subjects, now existed for the first time. After the revolutionary period of the fifties and sixties, society regrouped itself, as always, into High, Middle, and Low. But the new High group, unlike all its forerunners, did not act upon i&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgc49ff", "score_hidden": false, "stickied": false, "created": 1492383694.0, "created_utc": 1492354894.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65p3wa", "likes": null, "replies": "", "user_reports": [], "id": "dgc9d9v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "succerberg", "parent_id": "t3_65p3wa", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "I was offered sex with a 21 year old girl today. In exchange, I was supposed to advertise some kind of bathroom cleaner. Of course I declined, because I am a person with high moral standards and strong willpower. Just as strong as Ajax, the super strong bathroom cleaner. Now available with scented lemon or vanilla.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was offered sex with a 21 year old girl today. In exchange, I was supposed to advertise some kind of bathroom cleaner. Of course I declined, because I am a person with high moral standards and strong willpower. Just as strong as Ajax, the super strong bathroom cleaner. Now available with scented lemon or vanilla.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgc9d9v", "score_hidden": false, "stickied": false, "created": 1492390617.0, "created_utc": 1492361817.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65p3wa", "likes": null, "replies": "", "user_reports": [], "id": "dgc4he1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bfjkasds", "parent_id": "t3_65p3wa", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "The community here is cancer. Everything is being swallowed by copypastas. The comments section of every post is slowly degrading into a shitfesty circlejerk. Even this is going to end up as a copypasta, I guarantee it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The community here is cancer. Everything is being swallowed by copypastas. The comments section of every post is slowly degrading into a shitfesty circlejerk. Even this is going to end up as a copypasta, I guarantee it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgc4he1", "score_hidden": false, "stickied": false, "created": 1492384030.0, "created_utc": 1492355230.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65p3wa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpol", "removal_reason": null, "link_id": "t3_65p3wa", "likes": null, "replies": "", "user_reports": [], "id": "dgcaa0d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WhenAllElseFail", "parent_id": "t1_dgc4vf0", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "Lol why do you keep mentioning me? I've never said this ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol why do you keep mentioning me? I&amp;#39;ve never said this &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgcaa0d", "score_hidden": false, "stickied": false, "created": 1492391808.0, "created_utc": 1492363008.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4vf0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65p3wa", "subreddit_name_prefixed": "r/circlejerk", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "circlejerk", "name": "t1_dgc4vf0", "score_hidden": false, "stickied": false, "created": 1492384584.0, "created_utc": 1492355784.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]