[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeIAmA", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65z6wc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "MissionFever", "saved": false, "mod_reports": [], "name": "t3_65z6wc", "subreddit_name_prefixed": "r/explainlikeIAmA", "approved_by": null, "over_18": false, "domain": "self.explainlikeIAmA", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t5iz", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeIAmA/comments/65z6wc/explain_how_the_fast_furious_movies_became_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492500536.0, "url": "https://www.reddit.com/r/explainlikeIAmA/comments/65z6wc/explain_how_the_fast_furious_movies_became_a/", "author_flair_text": null, "quarantine": false, "title": "Explain How the Fast &amp; Furious movies became a box-office juggernaut to rival Star Wars like I'm someone who has only seen the first two F&amp;F movies.", "created_utc": 1492471736.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5iz", "removal_reason": null, "link_id": "t3_65z6wc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5iz", "removal_reason": null, "link_id": "t3_65z6wc", "likes": null, "replies": "", "user_reports": [], "id": "dgep75m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheYask", "parent_id": "t1_dgeoryt", "subreddit_name_prefixed": "r/explainlikeIAmA", "controversiality": 0, "body": "Whoa, really? We've only seen the first one and a bit of the second one and found them fairly mediocre and clichéd. Though it may be our memories that are mediocre, we never went back to the series to give it another chance. Sounds like it's worth giving them another shot.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whoa, really? We&amp;#39;ve only seen the first one and a bit of the second one and found them fairly mediocre and clichéd. Though it may be our memories that are mediocre, we never went back to the series to give it another chance. Sounds like it&amp;#39;s worth giving them another shot.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeIAmA", "name": "t1_dgep75m", "score_hidden": false, "stickied": false, "created": 1492518515.0, "created_utc": 1492489715.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeoryt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ixidor89", "parent_id": "t3_65z6wc", "subreddit_name_prefixed": "r/explainlikeIAmA", "controversiality": 0, "body": "Imagine the Fast and Furious movies, but imagine that instead of making them about racing they make them kinda-sorta heist/spy movies where the heroes drive fast cars. Add the comedic genius of Dwayne Johnson to the mix and how can you go wrong?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Imagine the Fast and Furious movies, but imagine that instead of making them about racing they make them kinda-sorta heist/spy movies where the heroes drive fast cars. Add the comedic genius of Dwayne Johnson to the mix and how can you go wrong?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeIAmA", "name": "t1_dgeoryt", "score_hidden": false, "stickied": false, "created": 1492517869.0, "created_utc": 1492489069.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5iz", "removal_reason": null, "link_id": "t3_65z6wc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5iz", "removal_reason": null, "link_id": "t3_65z6wc", "likes": null, "replies": "", "user_reports": [], "id": "dgefknc", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Rooksey", "parent_id": "t1_dgeb7cq", "subreddit_name_prefixed": "r/explainlikeIAmA", "controversiality": 0, "body": "I don't even know how to explain it if you've seen them all", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t even know how to explain it if you&amp;#39;ve seen them all&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeIAmA", "name": "t1_dgefknc", "score_hidden": false, "stickied": false, "created": 1492506046.0, "created_utc": 1492477246.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeb7cq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AutoModerator", "parent_id": "t3_65z6wc", "subreddit_name_prefixed": "r/explainlikeIAmA", "controversiality": 0, "body": "This area is for general discussion.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/explainlikeIAmA) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This area is for general discussion.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/explainlikeIAmA\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeIAmA", "name": "t1_dgeb7cq", "score_hidden": false, "stickied": false, "created": 1492500536.0, "created_utc": 1492471736.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5iz", "removal_reason": null, "link_id": "t3_65z6wc", "likes": null, "replies": "", "user_reports": [], "id": "dgeq69w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kensquatch", "parent_id": "t3_65z6wc", "subreddit_name_prefixed": "r/explainlikeIAmA", "controversiality": 0, "body": "So the franchise is kind of grasping at straws as far as you know. Vin Diesel didn't come back for the second movie and you've probably heard that none of the original actors are coming back for the third one. Things are definitely looking dark for the Fastiverse. A string of direct to Redox sequels are all they've got left in the tank.\n\nBut check this out; the studio hired this up and coming Taiwanese director named James Lin to make the third movie. And despite the fact that they also picked this weird-looking, uncharismatic, squishy-faced Peyton Manning clone to star in it alongside Lil Bow Wow, the movie is surprisingly bearable. Lin showed promise as an action director and some of the secondary characters were genuinely likable.\n\nLin did a good enough job with the material and actors given to him that they brought him back to direct the fourth installment. Serendipitously, all of the stars from the first movie were suffering from floundering careers. So Vin Diesel, Paul Walker, Jordana Brewster, and Michelle Rodriguez all returned to the franchise. The movie itself was pretty forgettable, so much so that i can't comment about it or anything that happens in it. I think nostalgia from the cast returning drove most of the ticket sales. Apparently it made enough money to justify another sequel, though. The franchised continued.\n\nThis is where it gets interesting. The first four movies range from laughably corny at best, to bland and cringeworthy at worst. Fast Five, however, is pretty amazing. it's un-ironically enjoyable. If you haven't seen any of the other movies or you don't care about cars or street racing, you should still check out this movie. Most of the main cast returns, as well as the more popular side characters cherry-picked from the previous films. With his inexplicable charm, The Rock is a great addition to the cast, as a federal agent chasing down the protagonists. At it's core it's a heist movie. There are plenty of genuinely great action set pieces, car chases (obviously), a few plot twists, and a great finale. The cast really works well together and Lin is at his peak, using mainly practical effects and stuntmen instead of CGI. It's big, fun, and dumb - but well made.\n\nHaving established the (now much larger) cast of returning characters, the 6th movie continued along the path set by the previous 5. Increasingly ridiculous action, gratuitous near-nudity, and grumbly growl-acting. It's pretty good, but a step down from Fast five. It made plenty of cash though, so we were treated to yet another sequel.\nFurious Seven saw the departure of Justin Lin. He was replaced by horror director James Wan. The action in the franchise had grown more and more over-the-top with each movie, and this one continued the trend. Every character is now basically a super hero, surviving accidents that would liquify a normal person and performing inhuman feats of strength. It's an ok action movie thats mainly memorable for what happened off screen. I think the death of Paul walker drew most of viewers back to the franchise. A lot of people who had lost interest probably went back to see his last movie. This, plus the increasingly diverse cast, added up to MASSIVE world wide box office returns.\n\nI haven't seen the newest one yet, but I'm sure it falls in with the established pattern and tone of the previous movies. \n\nTL;DR After the 4th one they are reasonably enjoyable action schlock with a racially diverse cast and talented directors.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So the franchise is kind of grasping at straws as far as you know. Vin Diesel didn&amp;#39;t come back for the second movie and you&amp;#39;ve probably heard that none of the original actors are coming back for the third one. Things are definitely looking dark for the Fastiverse. A string of direct to Redox sequels are all they&amp;#39;ve got left in the tank.&lt;/p&gt;\n\n&lt;p&gt;But check this out; the studio hired this up and coming Taiwanese director named James Lin to make the third movie. And despite the fact that they also picked this weird-looking, uncharismatic, squishy-faced Peyton Manning clone to star in it alongside Lil Bow Wow, the movie is surprisingly bearable. Lin showed promise as an action director and some of the secondary characters were genuinely likable.&lt;/p&gt;\n\n&lt;p&gt;Lin did a good enough job with the material and actors given to him that they brought him back to direct the fourth installment. Serendipitously, all of the stars from the first movie were suffering from floundering careers. So Vin Diesel, Paul Walker, Jordana Brewster, and Michelle Rodriguez all returned to the franchise. The movie itself was pretty forgettable, so much so that i can&amp;#39;t comment about it or anything that happens in it. I think nostalgia from the cast returning drove most of the ticket sales. Apparently it made enough money to justify another sequel, though. The franchised continued.&lt;/p&gt;\n\n&lt;p&gt;This is where it gets interesting. The first four movies range from laughably corny at best, to bland and cringeworthy at worst. Fast Five, however, is pretty amazing. it&amp;#39;s un-ironically enjoyable. If you haven&amp;#39;t seen any of the other movies or you don&amp;#39;t care about cars or street racing, you should still check out this movie. Most of the main cast returns, as well as the more popular side characters cherry-picked from the previous films. With his inexplicable charm, The Rock is a great addition to the cast, as a federal agent chasing down the protagonists. At it&amp;#39;s core it&amp;#39;s a heist movie. There are plenty of genuinely great action set pieces, car chases (obviously), a few plot twists, and a great finale. The cast really works well together and Lin is at his peak, using mainly practical effects and stuntmen instead of CGI. It&amp;#39;s big, fun, and dumb - but well made.&lt;/p&gt;\n\n&lt;p&gt;Having established the (now much larger) cast of returning characters, the 6th movie continued along the path set by the previous 5. Increasingly ridiculous action, gratuitous near-nudity, and grumbly growl-acting. It&amp;#39;s pretty good, but a step down from Fast five. It made plenty of cash though, so we were treated to yet another sequel.\nFurious Seven saw the departure of Justin Lin. He was replaced by horror director James Wan. The action in the franchise had grown more and more over-the-top with each movie, and this one continued the trend. Every character is now basically a super hero, surviving accidents that would liquify a normal person and performing inhuman feats of strength. It&amp;#39;s an ok action movie thats mainly memorable for what happened off screen. I think the death of Paul walker drew most of viewers back to the franchise. A lot of people who had lost interest probably went back to see his last movie. This, plus the increasingly diverse cast, added up to MASSIVE world wide box office returns.&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t seen the newest one yet, but I&amp;#39;m sure it falls in with the established pattern and tone of the previous movies. &lt;/p&gt;\n\n&lt;p&gt;TL;DR After the 4th one they are reasonably enjoyable action schlock with a racially diverse cast and talented directors.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeIAmA", "name": "t1_dgeq69w", "score_hidden": false, "stickied": false, "created": 1492520083.0, "created_utc": 1492491283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]