[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "CasualConversation", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You know those people that you met in passing somewhere, had a deep discussion with, only to never see them again?&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s my story (warning, it&amp;#39;s long, sorry!): About 5 years ago I was flying back to the state I was currently living in after visiting home for two weeks. The time was bad for me. The two weeks at home were hell, my mother was treating me horribly. My bf at the time was extremely controlling and abusive. I was just lost and at a bad place. I had two flights that day to get home and I was not in the mood to talk to anyone. On my first flight I made it a point to put on my bitchiest face so no one would sit by me or talk to me, I even pulled the whole backpack in the seat thing to try and prevent anyone from sitting next to me (Southwest airline style seating). &lt;/p&gt;\n\n&lt;p&gt;First flight went great, not a single person talked to me. On the second flight I tried to do the same thing, hard bitch face and backpack in seat. I was in the window seat and I see this guy coming down the aisle who noticed me so I avoided eye contact. Of course this guy asks, &amp;quot;Is this seat open?&amp;quot; Sure, whatever, just don&amp;#39;t talk to me...nope! He then proceeds to ask me a million questions about myself, where I&amp;#39;m heading etc. But instead of it annoying me I actually started enjoying his company. We got into some pretty deep topics about our families and the like, talked about guitars since he played and I was just trying to learn, video games, yada yada. &lt;/p&gt;\n\n&lt;p&gt;We were mostly through the flight before he says this: &amp;quot;You know, I don&amp;#39;t want to sound creepy or anything, but I actually saw you on the previous flight. We were on the same flight before this and I saw you, but not gonna lie, you looked super bitchy. But when I saw you on this flight too I thought, what the heck, and decided to ask you if I could sit here. Turns out you aren&amp;#39;t a bitch at all! You are actually really cool to talk to!&amp;quot; Ha! While this was like the weirdest non-compliment compliment I had ever received, I also found it amazing that we happened to be taking the same route, he saw me and for some reason decided to talk to me. &lt;/p&gt;\n\n&lt;p&gt;Sometime near the end of our conversation he started talking about how you meet people like this and then just never see them again. He had this amazing term for it which I of course forgot and wish desperately that I could remember it. Next thing I know, he pulls out a purple guitar pick and says &amp;quot;We&amp;#39;ll probably never meet again, but this conversation was great and I want to give this to you as a way to remember meeting this random guy on a plane&amp;quot; To this day, I still carry around that guitar pick in my wallet, as a reminder of all the people that affect you in life that you can never thank later. &lt;/p&gt;\n\n&lt;p&gt;He made my flight so much better, I was on the verge of tears the entire first flight and he made me feel so much better. I wish I could thank that guy for being so nice that day, because I desperately needed it and I don&amp;#39;t think he ever realized how much it meant to me. Also to note, a while after the encounter I was scrolling through my instagram and found a picture I had taken the day I took those flights of everyone around me on their cellphones. I started looking at the picture and the guy was literally sitting right in front of me and is in the picture!!! Crazy...&lt;/p&gt;\n\n&lt;p&gt;Anyway, long-winded but that&amp;#39;s my story. What&amp;#39;s yours??&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "You know those people that you met in passing somewhere, had a deep discussion with, only to never see them again?\n\nHere's my story (warning, it's long, sorry!): About 5 years ago I was flying back to the state I was currently living in after visiting home for two weeks. The time was bad for me. The two weeks at home were hell, my mother was treating me horribly. My bf at the time was extremely controlling and abusive. I was just lost and at a bad place. I had two flights that day to get home and I was not in the mood to talk to anyone. On my first flight I made it a point to put on my bitchiest face so no one would sit by me or talk to me, I even pulled the whole backpack in the seat thing to try and prevent anyone from sitting next to me (Southwest airline style seating). \n\nFirst flight went great, not a single person talked to me. On the second flight I tried to do the same thing, hard bitch face and backpack in seat. I was in the window seat and I see this guy coming down the aisle who noticed me so I avoided eye contact. Of course this guy asks, \"Is this seat open?\" Sure, whatever, just don't talk to me...nope! He then proceeds to ask me a million questions about myself, where I'm heading etc. But instead of it annoying me I actually started enjoying his company. We got into some pretty deep topics about our families and the like, talked about guitars since he played and I was just trying to learn, video games, yada yada. \n\nWe were mostly through the flight before he says this: \"You know, I don't want to sound creepy or anything, but I actually saw you on the previous flight. We were on the same flight before this and I saw you, but not gonna lie, you looked super bitchy. But when I saw you on this flight too I thought, what the heck, and decided to ask you if I could sit here. Turns out you aren't a bitch at all! You are actually really cool to talk to!\" Ha! While this was like the weirdest non-compliment compliment I had ever received, I also found it amazing that we happened to be taking the same route, he saw me and for some reason decided to talk to me. \n\nSometime near the end of our conversation he started talking about how you meet people like this and then just never see them again. He had this amazing term for it which I of course forgot and wish desperately that I could remember it. Next thing I know, he pulls out a purple guitar pick and says \"We'll probably never meet again, but this conversation was great and I want to give this to you as a way to remember meeting this random guy on a plane\" To this day, I still carry around that guitar pick in my wallet, as a reminder of all the people that affect you in life that you can never thank later. \n\nHe made my flight so much better, I was on the verge of tears the entire first flight and he made me feel so much better. I wish I could thank that guy for being so nice that day, because I desperately needed it and I don't think he ever realized how much it meant to me. Also to note, a while after the encounter I was scrolling through my instagram and found a picture I had taken the day I took those flights of everyone around me on their cellphones. I started looking at the picture and the guy was literally sitting right in front of me and is in the picture!!! Crazy...\n\nAnyway, long-winded but that's my story. What's yours??", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65npbt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 63, "report_reasons": null, "author": "blondestripes", "saved": false, "mod_reports": [], "name": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "approved_by": null, "over_18": false, "domain": "self.CasualConversation", "hidden": false, "thumbnail": "", "subreddit_id": "t5_323oy", "edited": 1492322585.0, "link_flair_css_class": null, "author_flair_css_class": "pineapple", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/CasualConversation/comments/65npbt/tell_me_about_that_person_you_only_met_once_who/", "num_reports": null, "locked": false, "stickied": false, "created": 1492350197.0, "url": "https://www.reddit.com/r/CasualConversation/comments/65npbt/tell_me_about_that_person_you_only_met_once_who/", "author_flair_text": "", "quarantine": false, "title": "Tell me about that person you only met once, who affected your life and you'll never forget them, even if you'll never see them again", "created_utc": 1492321397.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 58, "visited": false, "subreddit_type": "public", "ups": 63}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbrrky", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbropz", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Haha! Yep it's not easy! I hope things stay great for you two, especially after you start living near one another!\n\nAnd omg yea thank goodness...so happy to be able to go \"okay, gotta go now! bye!\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha! Yep it&amp;#39;s not easy! I hope things stay great for you two, especially after you start living near one another!&lt;/p&gt;\n\n&lt;p&gt;And omg yea thank goodness...so happy to be able to go &amp;quot;okay, gotta go now! bye!&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrrky", "score_hidden": false, "stickied": false, "created": 1492352157.0, "created_utc": 1492323357.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbropz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "myparentsarecool", "parent_id": "t1_dgbrk4y", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Aawww YAY that makes me so happy! Congratulations. :) I hope we can be as happy as y'all are!\n\nIt's been almost a year for us, and we're both getting tired of the wait, so one of us will probably end up caving and just move to the other. LOL. We want to finish school first, but ugh. It's hard when you love someone so far away. \n\nWell, good job on the handling skills. ;) At least you're not living there anymore! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aawww YAY that makes me so happy! Congratulations. :) I hope we can be as happy as y&amp;#39;all are!&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been almost a year for us, and we&amp;#39;re both getting tired of the wait, so one of us will probably end up caving and just move to the other. LOL. We want to finish school first, but ugh. It&amp;#39;s hard when you love someone so far away. &lt;/p&gt;\n\n&lt;p&gt;Well, good job on the handling skills. ;) At least you&amp;#39;re not living there anymore! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbropz", "score_hidden": false, "stickied": false, "created": 1492351970.0, "created_utc": 1492323170.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrk4y", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbrhpg", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Aw you are so nice! Thank you :) And yes no I am married to an incredible guy (like the kind of guy where I get straight men ask me if they can marry my husband too because he so awesome) \n\nGlad you found someone so special! I wish you both tons of happiness!\n\nAnd yea things got a little better at home, my mother still sucks but I got better at dealing with it ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aw you are so nice! Thank you :) And yes no I am married to an incredible guy (like the kind of guy where I get straight men ask me if they can marry my husband too because he so awesome) &lt;/p&gt;\n\n&lt;p&gt;Glad you found someone so special! I wish you both tons of happiness!&lt;/p&gt;\n\n&lt;p&gt;And yea things got a little better at home, my mother still sucks but I got better at dealing with it ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrk4y", "score_hidden": false, "stickied": false, "created": 1492351674.0, "created_utc": 1492322874.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrhpg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "myparentsarecool", "parent_id": "t1_dgbrdo2", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Your plane story was really sweet, too! It's cool how people come and go in life. Everyone serves a purpose, that's for sure. \n\nThe guy I dated before my SO was abusive and controlling, so I totally get where you're coming from. I am so sorry you went through it. You're a queen and shouldn't ever settle for anything less than the best, and I'm sure you know that now!\n\nAnd thank you! It'll be for another 2 years or so, but we can do it. I wouldn't do it for anyone but him...he's a special one. Best wishes to you! I hope everything at home got better and is better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your plane story was really sweet, too! It&amp;#39;s cool how people come and go in life. Everyone serves a purpose, that&amp;#39;s for sure. &lt;/p&gt;\n\n&lt;p&gt;The guy I dated before my SO was abusive and controlling, so I totally get where you&amp;#39;re coming from. I am so sorry you went through it. You&amp;#39;re a queen and shouldn&amp;#39;t ever settle for anything less than the best, and I&amp;#39;m sure you know that now!&lt;/p&gt;\n\n&lt;p&gt;And thank you! It&amp;#39;ll be for another 2 years or so, but we can do it. I wouldn&amp;#39;t do it for anyone but him...he&amp;#39;s a special one. Best wishes to you! I hope everything at home got better and is better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrhpg", "score_hidden": false, "stickied": false, "created": 1492351512.0, "created_utc": 1492322712.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrdo2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbr84r", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "That is so sweet. What a nice guy! My ex (who turned out to be the abusive controlling one but that's a different story) and I were long distance when we were dating. Our relationship didn't work out (Thank God) but I understand the pain of leaving someone you love to go back home. After that I told myself I couldn't do another long term since it's so challenging. Sorry you are having to deal with the distance for now, but hopefully you will be together soon!  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is so sweet. What a nice guy! My ex (who turned out to be the abusive controlling one but that&amp;#39;s a different story) and I were long distance when we were dating. Our relationship didn&amp;#39;t work out (Thank God) but I understand the pain of leaving someone you love to go back home. After that I told myself I couldn&amp;#39;t do another long term since it&amp;#39;s so challenging. Sorry you are having to deal with the distance for now, but hopefully you will be together soon!  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrdo2", "score_hidden": false, "stickied": false, "created": 1492351255.0, "created_utc": 1492322455.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbr84r", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "myparentsarecool", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Mine is kinda similar! It also happened on a plane. \n\nMy boyfriend and I are long distance. I live in Texas, and he lives in Michigan. \n\nI flew to visit him for the first time in December (after a long nine month wait), and was dreading the flight back. Well, of course, it came. I got on the crowded Spirit flight and managed to hold in most of the tears until the plane started moving. Then I lost it, and was silently sobbing because my heart was breaking. \n\nThe man sitting next to me noticed, and politely tapped my knee and asked if I was alright. I replied with, \"Yes, I just left my love and it'll be a while before we can see each other again.\" I fully expected an eye roll, but he actually looked genuinely sympathetic and said, \"You know, my wife and I are long distance now too. She went back to school somewhere else, and we can only see each other a few times out of the year.\" I was still shaking and upset, but he took the time to talk to me about faith, how important it is to have it, how strong our relationships will be, and how everything works out the way it's meant to. \n\nI still cried all the way back, but knowing that someone understood the incredible pain I was feeling (and who also cared), was incredible. Especially because it was a total stranger. He took the time and care to talk to me and comfort me when I was in a very tough emotional state, and it reinstalled my faith in humanity. \n\nI wish I could hug him and thank him, because I will always think of him with every goodbye my SO and I have to live through. He gave me just enough strength when I had none, and it was the gift I needed at that moment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mine is kinda similar! It also happened on a plane. &lt;/p&gt;\n\n&lt;p&gt;My boyfriend and I are long distance. I live in Texas, and he lives in Michigan. &lt;/p&gt;\n\n&lt;p&gt;I flew to visit him for the first time in December (after a long nine month wait), and was dreading the flight back. Well, of course, it came. I got on the crowded Spirit flight and managed to hold in most of the tears until the plane started moving. Then I lost it, and was silently sobbing because my heart was breaking. &lt;/p&gt;\n\n&lt;p&gt;The man sitting next to me noticed, and politely tapped my knee and asked if I was alright. I replied with, &amp;quot;Yes, I just left my love and it&amp;#39;ll be a while before we can see each other again.&amp;quot; I fully expected an eye roll, but he actually looked genuinely sympathetic and said, &amp;quot;You know, my wife and I are long distance now too. She went back to school somewhere else, and we can only see each other a few times out of the year.&amp;quot; I was still shaking and upset, but he took the time to talk to me about faith, how important it is to have it, how strong our relationships will be, and how everything works out the way it&amp;#39;s meant to. &lt;/p&gt;\n\n&lt;p&gt;I still cried all the way back, but knowing that someone understood the incredible pain I was feeling (and who also cared), was incredible. Especially because it was a total stranger. He took the time and care to talk to me and comfort me when I was in a very tough emotional state, and it reinstalled my faith in humanity. &lt;/p&gt;\n\n&lt;p&gt;I wish I could hug him and thank him, because I will always think of him with every goodbye my SO and I have to live through. He gave me just enough strength when I had none, and it was the gift I needed at that moment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbr84r", "score_hidden": false, "stickied": false, "created": 1492350917.0, "created_utc": 1492322117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbu629", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbu2qv", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Wow that's such a neat story! It's hard to feel confident wearing something that could be considered shocking or different but props to her and you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow that&amp;#39;s such a neat story! It&amp;#39;s hard to feel confident wearing something that could be considered shocking or different but props to her and you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbu629", "score_hidden": false, "stickied": false, "created": 1492358559.0, "created_utc": 1492329759.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbu2qv", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "willorbot", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "It wasn't a conversation, but one day I was walking down the street and a girl passed by, who had these stripes of blue glitter under her eyes. And I remember being kind of amazed that someone had the bravery to do that. It suddenly gave me way more confidence to wear what I wanted to wear and look how I wanted to look, it kind of stopped me being self conscious at all about how I looked (I had just dyed my hair pink and though I loved it, was also a bit scared of what other people thought.)\n\nThis sounds a bit superficial, but she kind of changed my life by making me realise that hey, if I want to cover myself in glitter, that's something I'm totally free to do. It's odd how much it hit me that day, but she really gave me a lot of confidence and helped me feel better in myself, and I wish I could thank her for that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It wasn&amp;#39;t a conversation, but one day I was walking down the street and a girl passed by, who had these stripes of blue glitter under her eyes. And I remember being kind of amazed that someone had the bravery to do that. It suddenly gave me way more confidence to wear what I wanted to wear and look how I wanted to look, it kind of stopped me being self conscious at all about how I looked (I had just dyed my hair pink and though I loved it, was also a bit scared of what other people thought.)&lt;/p&gt;\n\n&lt;p&gt;This sounds a bit superficial, but she kind of changed my life by making me realise that hey, if I want to cover myself in glitter, that&amp;#39;s something I&amp;#39;m totally free to do. It&amp;#39;s odd how much it hit me that day, but she really gave me a lot of confidence and helped me feel better in myself, and I wish I could thank her for that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbu2qv", "score_hidden": false, "stickied": false, "created": 1492358279.0, "created_utc": 1492329479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgceedi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgcdtj7", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I realllyyy want to see the Giant's Causeway, but we didn't get up that far. So now I have a good reason to go back!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I realllyyy want to see the Giant&amp;#39;s Causeway, but we didn&amp;#39;t get up that far. So now I have a good reason to go back!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgceedi", "score_hidden": false, "stickied": false, "created": 1492397288.0, "created_utc": 1492368488.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdtj7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "caca_milis_", "parent_id": "t1_dgcdkdg", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I did that with my ex a few years ago! He was French and had been to Dublin on a language course and wanted to see more of it.\n\nWe rented a car and drove from Dublin to Belfast to see Giant's Causeway, we wanted to do the GoT tour but they weren't running the day we were there, then we went to Galway, Cliffs of Moher and stayed with my sister in Tipperary, then back to Dublin.\n\nI had never been to Giant's Causeway or Cliffs of Moher before so it was really nice to do/see those things and to be able to show them off to a visitor. We really do have a great wee country :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did that with my ex a few years ago! He was French and had been to Dublin on a language course and wanted to see more of it.&lt;/p&gt;\n\n&lt;p&gt;We rented a car and drove from Dublin to Belfast to see Giant&amp;#39;s Causeway, we wanted to do the GoT tour but they weren&amp;#39;t running the day we were there, then we went to Galway, Cliffs of Moher and stayed with my sister in Tipperary, then back to Dublin.&lt;/p&gt;\n\n&lt;p&gt;I had never been to Giant&amp;#39;s Causeway or Cliffs of Moher before so it was really nice to do/see those things and to be able to show them off to a visitor. We really do have a great wee country :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcdtj7", "score_hidden": false, "stickied": false, "created": 1492396508.0, "created_utc": 1492367708.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdkdg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgcbdmo", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Cool! Yea we went a couple years back and drove straight from Dublin to the Cliffs of Moher, then followed the coast down and back up and around to Dublin. Such a gorgeous country :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool! Yea we went a couple years back and drove straight from Dublin to the Cliffs of Moher, then followed the coast down and back up and around to Dublin. Such a gorgeous country :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcdkdg", "score_hidden": false, "stickied": false, "created": 1492396161.0, "created_utc": 1492367361.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbdmo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "caca_milis_", "parent_id": "t1_dgcajib", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I'm from Dublin, but in the suburbs, about 20 mins out of the city.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m from Dublin, but in the suburbs, about 20 mins out of the city.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcbdmo", "score_hidden": false, "stickied": false, "created": 1492393262.0, "created_utc": 1492364462.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcajib", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgcadt9", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I loved visiting Ireland! Which part are you from?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I loved visiting Ireland! Which part are you from?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcajib", "score_hidden": false, "stickied": false, "created": 1492392151.0, "created_utc": 1492363351.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcadt9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "caca_milis_", "parent_id": "t1_dgc9yd9", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I sure am :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sure am :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcadt9", "score_hidden": false, "stickied": false, "created": 1492391947.0, "created_utc": 1492363147.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9yd9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgc8o30", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Oh wow, are you from Ireland?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh wow, are you from Ireland?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc9yd9", "score_hidden": false, "stickied": false, "created": 1492391380.0, "created_utc": 1492362580.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8o30", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "caca_milis_", "parent_id": "t1_dgc7hmz", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Media arts, the big selling point for me was that I could keep up Irish language as part of my course.\n\nI loved it and met some amazing friends I wouldn't have otherwise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Media arts, the big selling point for me was that I could keep up Irish language as part of my course.&lt;/p&gt;\n\n&lt;p&gt;I loved it and met some amazing friends I wouldn&amp;#39;t have otherwise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc8o30", "score_hidden": false, "stickied": false, "created": 1492389723.0, "created_utc": 1492360923.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7hmz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbx67r", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Crazy! What course was it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Crazy! What course was it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc7hmz", "score_hidden": false, "stickied": false, "created": 1492388158.0, "created_utc": 1492359358.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbx67r", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "caca_milis_", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "For my last year of school I moved to this ... specialised school? It was more like university and they treated students like adults. It has a great reputation and lots of people go there as a 'boost' for their final year or two years of school.\n\nAnyway, I was kind of friendly with this one girl, and around the time we trying to choose which college we wanted to go to this girl mentioned her boyfriend was in a course that sounded right up my alley.\n\nShe had him come meet us for lunch one day, he told me about the course and I was sold instantly. I can't remember but he must have been in his final year when he met me for lunch that day because I never saw him again and his GF and I weren't really close enough to keep in touch.\n\nSo yeah, one random lunch date and I went to a completely different university than I had been planning on going to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For my last year of school I moved to this ... specialised school? It was more like university and they treated students like adults. It has a great reputation and lots of people go there as a &amp;#39;boost&amp;#39; for their final year or two years of school.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I was kind of friendly with this one girl, and around the time we trying to choose which college we wanted to go to this girl mentioned her boyfriend was in a course that sounded right up my alley.&lt;/p&gt;\n\n&lt;p&gt;She had him come meet us for lunch one day, he told me about the course and I was sold instantly. I can&amp;#39;t remember but he must have been in his final year when he met me for lunch that day because I never saw him again and his GF and I weren&amp;#39;t really close enough to keep in touch.&lt;/p&gt;\n\n&lt;p&gt;So yeah, one random lunch date and I went to a completely different university than I had been planning on going to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbx67r", "score_hidden": false, "stickied": false, "created": 1492368690.0, "created_utc": 1492339890.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbrhib", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbr9u1", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "What a genuinely nice guy!! That's so cool of him to do that :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a genuinely nice guy!! That&amp;#39;s so cool of him to do that :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrhib", "score_hidden": false, "stickied": false, "created": 1492351499.0, "created_utc": 1492322699.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgchqjh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VettaBTertiary", "parent_id": "t1_dgbr9u1", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "That was really nice! And good on you for letting him take back a mistake--he would have been kicking himself too. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was really nice! And good on you for letting him take back a mistake--he would have been kicking himself too. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgchqjh", "score_hidden": false, "stickied": false, "created": 1492401684.0, "created_utc": 1492372884.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbr9u1", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "LRats", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I was at a large Magic: The Gathering legacy tournament. It was the last round and I was out of any major prize contention, but my opponent and I still had an outside shot to sneak into a lower prize bracket. \n\nI should have won the match, but I made a large number of mistakes and bumbled my way to a loss. I was very much upset with myself. However, there was one point in the game where my opponent made minor error, and I let him take it back. I didn't have to. He probably would have won anyway, but it let him do it much quicker. \n\nI was already in a pretty depressed mood before the tournament, and losing the way I did really put me over the edge. I stuck around to see the final standings, and it turned out my opponent ended up being the last person to win any prizes. As my friend and I were leaving the tournament hall, I hear someone call my name. It was my opponent. He said because I let him take back that mistake, he wanted to share a little bit of his winnings with me. I was taken aback. It lifted my spirits so much that he did that. I was able to get a cool drawstring bag with the prize winning (the prize was in the form of credits). It instantly lifted my mood that night. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was at a large Magic: The Gathering legacy tournament. It was the last round and I was out of any major prize contention, but my opponent and I still had an outside shot to sneak into a lower prize bracket. &lt;/p&gt;\n\n&lt;p&gt;I should have won the match, but I made a large number of mistakes and bumbled my way to a loss. I was very much upset with myself. However, there was one point in the game where my opponent made minor error, and I let him take it back. I didn&amp;#39;t have to. He probably would have won anyway, but it let him do it much quicker. &lt;/p&gt;\n\n&lt;p&gt;I was already in a pretty depressed mood before the tournament, and losing the way I did really put me over the edge. I stuck around to see the final standings, and it turned out my opponent ended up being the last person to win any prizes. As my friend and I were leaving the tournament hall, I hear someone call my name. It was my opponent. He said because I let him take back that mistake, he wanted to share a little bit of his winnings with me. I was taken aback. It lifted my spirits so much that he did that. I was able to get a cool drawstring bag with the prize winning (the prize was in the form of credits). It instantly lifted my mood that night. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbr9u1", "score_hidden": false, "stickied": false, "created": 1492351028.0, "created_utc": 1492322228.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbrlsa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbrk8b", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Me too! I always think about whether he looks back and remembers that day too. Crazy thing is that I still have that picture of him..if I had super special hacker powers (or whatever) I could maybe search his face in some secret database i'm sure...lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Me too! I always think about whether he looks back and remembers that day too. Crazy thing is that I still have that picture of him..if I had super special hacker powers (or whatever) I could maybe search his face in some secret database i&amp;#39;m sure...lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrlsa", "score_hidden": false, "stickied": false, "created": 1492351779.0, "created_utc": 1492322979.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrk8b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lenethren", "parent_id": "t1_dgbra7r", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "It really did. It showed someone cared and as a kid on  the streets who came from a broken home, this was surprising to me yet needed. Reaching out to me made a difference and it's too bad I can't tell her.\n\nI'm kinda curious about the guy you met. He must think of you now and again and wonder too. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really did. It showed someone cared and as a kid on  the streets who came from a broken home, this was surprising to me yet needed. Reaching out to me made a difference and it&amp;#39;s too bad I can&amp;#39;t tell her.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m kinda curious about the guy you met. He must think of you now and again and wonder too. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrk8b", "score_hidden": false, "stickied": false, "created": 1492351680.0, "created_utc": 1492322880.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbra7r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbr6f1", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Thanks! I just wish I could tell the guy thanks, also it would be interesting to see where he ended up in life.\n\nThat's amazing, sad she couldn't do more, but great that you made it okay and she helped you out some. I bet those $5 meant a lot to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! I just wish I could tell the guy thanks, also it would be interesting to see where he ended up in life.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s amazing, sad she couldn&amp;#39;t do more, but great that you made it okay and she helped you out some. I bet those $5 meant a lot to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbra7r", "score_hidden": false, "stickied": false, "created": 1492351052.0, "created_utc": 1492322252.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbr6f1", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Lenethren", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "That is an awesome story. I'm so glad you have that experience. Very cool. \n\nIt's a little thing but I remember a social worker who tried to help me as a kid. There wasn't much she could do but she did give me $5 for food out of her own pocket. I wish I could tell her I made it ok but I don't even know her name. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is an awesome story. I&amp;#39;m so glad you have that experience. Very cool. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a little thing but I remember a social worker who tried to help me as a kid. There wasn&amp;#39;t much she could do but she did give me $5 for food out of her own pocket. I wish I could tell her I made it ok but I don&amp;#39;t even know her name. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbr6f1", "score_hidden": false, "stickied": false, "created": 1492350810.0, "created_utc": 1492322010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbs1u0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbrx32", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Only thing that would have made it better was if he also then got you a beer or a shot of whiskey or something lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Only thing that would have made it better was if he also then got you a beer or a shot of whiskey or something lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbs1u0", "score_hidden": false, "stickied": false, "created": 1492352845.0, "created_utc": 1492324045.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrx32", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rusty0123", "parent_id": "t1_dgbro2y", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I will never forget him. I think he's the most compassionate person I've ever met. \n\nI'm sitting there on his front porch, crying my eyes out, and he's all calm and caring and talking to me. Not even the littlest bit embarrassed. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will never forget him. I think he&amp;#39;s the most compassionate person I&amp;#39;ve ever met. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sitting there on his front porch, crying my eyes out, and he&amp;#39;s all calm and caring and talking to me. Not even the littlest bit embarrassed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrx32", "score_hidden": false, "stickied": false, "created": 1492352527.0, "created_utc": 1492323727.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbro2y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbrik2", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Wow what a cool guy. Amazing how some people seem to just know, ya know? We always seem to go through life with yep im goods and doing fines but in reality sometimes we do need a complete stranger to listen and give us solid life advice", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow what a cool guy. Amazing how some people seem to just know, ya know? We always seem to go through life with yep im goods and doing fines but in reality sometimes we do need a complete stranger to listen and give us solid life advice&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbro2y", "score_hidden": false, "stickied": false, "created": 1492351931.0, "created_utc": 1492323131.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrik2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "rusty0123", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Crossposted from an Ask Reddit question I answered some time back....\n\nWhen I was early 20s, I recently had a bad breakup, moved to a town where I didn't know anyone, and started a new job. I was insanely lonely. And depressed. And miserable.\n\nIn my infinite 20yo wisdom, I decided that the solution to my problem was to get out of my apartment. Talk to people. So I took a second job, part-time, selling *some famous door-to-door product*. This was a very bad idea. I forced myself to cover my route at least once--just give it a chance, you know?\n\nI'm going door to door, mostly getting told off, getting doors slammed in my face. I'm upset, my hands are shaking, but I'm determined that I am not giving up. I am going to finish this route no matter what.\n\nI knock on a door. A middle-aged guy answers. I go into the sales spiel. He listens politely, then asks me, \"Are you alright?\" \"Yes, fine.\" \"No, really. Are you okay?\" \"Yes, just a bad day.\"\n\nSo he sits down on the front steps and says, \"Tell me about it.\"\n\nPoor guy. He got way more than he asked for. I think maybe he was a counselor or psychiatrist because the guy knew his shit. Asked all the right questions, and gave me some excellent life advice.\n\nAfter about 30 minutes, I apologized, thanked him, and went on my way.\n\nNever saw him again, but he made my life so much better.\n\nOh...and I stopped trying to sell that stuff. Never went knocking on strange doors again.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Crossposted from an Ask Reddit question I answered some time back....&lt;/p&gt;\n\n&lt;p&gt;When I was early 20s, I recently had a bad breakup, moved to a town where I didn&amp;#39;t know anyone, and started a new job. I was insanely lonely. And depressed. And miserable.&lt;/p&gt;\n\n&lt;p&gt;In my infinite 20yo wisdom, I decided that the solution to my problem was to get out of my apartment. Talk to people. So I took a second job, part-time, selling &lt;em&gt;some famous door-to-door product&lt;/em&gt;. This was a very bad idea. I forced myself to cover my route at least once--just give it a chance, you know?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going door to door, mostly getting told off, getting doors slammed in my face. I&amp;#39;m upset, my hands are shaking, but I&amp;#39;m determined that I am not giving up. I am going to finish this route no matter what.&lt;/p&gt;\n\n&lt;p&gt;I knock on a door. A middle-aged guy answers. I go into the sales spiel. He listens politely, then asks me, &amp;quot;Are you alright?&amp;quot; &amp;quot;Yes, fine.&amp;quot; &amp;quot;No, really. Are you okay?&amp;quot; &amp;quot;Yes, just a bad day.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So he sits down on the front steps and says, &amp;quot;Tell me about it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Poor guy. He got way more than he asked for. I think maybe he was a counselor or psychiatrist because the guy knew his shit. Asked all the right questions, and gave me some excellent life advice.&lt;/p&gt;\n\n&lt;p&gt;After about 30 minutes, I apologized, thanked him, and went on my way.&lt;/p&gt;\n\n&lt;p&gt;Never saw him again, but he made my life so much better.&lt;/p&gt;\n\n&lt;p&gt;Oh...and I stopped trying to sell that stuff. Never went knocking on strange doors again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrik2", "score_hidden": false, "stickied": false, "created": 1492351572.0, "created_utc": 1492322772.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbv610", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbv4kx", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Yea hopefully things work out for her :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea hopefully things work out for her :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbv610", "score_hidden": false, "stickied": false, "created": 1492361797.0, "created_utc": 1492332997.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbv4kx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dreamtreedown", "parent_id": "t1_dgbuw2r", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Yeah. Hopefully the next chance I get to have a one on one conversation with her I can bring it up. It's something she's loved to do since she was very young and it's one of her life's dreams to publish a novel/series. She would be sad and it would make me sad to see her lose that passion", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah. Hopefully the next chance I get to have a one on one conversation with her I can bring it up. It&amp;#39;s something she&amp;#39;s loved to do since she was very young and it&amp;#39;s one of her life&amp;#39;s dreams to publish a novel/series. She would be sad and it would make me sad to see her lose that passion&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbv4kx", "score_hidden": false, "stickied": false, "created": 1492361659.0, "created_utc": 1492332859.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbuw2r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbus7i", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Definitely good advice. I had been told this years ago and yes its for sure true. Once you turn your hobby into a job it just becomes a job. You dont enjoy it because now it becomes something you *have* to do instead of something you *want* to do.\n\n Sounds like your friend might be heading that direction :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely good advice. I had been told this years ago and yes its for sure true. Once you turn your hobby into a job it just becomes a job. You dont enjoy it because now it becomes something you &lt;em&gt;have&lt;/em&gt; to do instead of something you &lt;em&gt;want&lt;/em&gt; to do.&lt;/p&gt;\n\n&lt;p&gt;Sounds like your friend might be heading that direction :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbuw2r", "score_hidden": false, "stickied": false, "created": 1492360884.0, "created_utc": 1492332084.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbus7i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dreamtreedown", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Mine happened on July 6 2014. Probably the best words to live by I've ever gotten from anyone. Long story, but I hope someone can take inspiration from this.\n\nLet's start with some background. It was the middle of an internship as an island steward on a small island off the coast of Connecticut. I was looking forward to it originally, but after a month or so on the island the isolation and general tediousness of the work (pulling weeds all day) was really getting to me. After the fourth of July weekend, I get to the island and my co-steward is on his days off so it's just me. I'm on my final trash collection round, I realize some people who had arrived earlier set up a tent and a barbecue. They know the island is staffed by someone and they (complete strangers) told me to join them at their barbecue. I finish my trash round (and work for the day) and join them afterwards, very glad about the opportunity social interaction. We shared life stories, ate some fantastic gumbo, and since my work was done for the day I stayed for the fun. Something felt very welcoming about this group, and despite being strangers, they were quick friends for the day. \n\nThe quality of the gumbo was a bit of a premonition. As the sun went down, the last call for when visitors are allowed on the island (30 minutes after sunset is when it closes to any visitors whatsoever), the festivities pack up and we're about share our goodbyes. I go to thank and compliment the gumbo chef, who had introduced himself as Frank. He was busy cooking so he was one of the group I didn't get to speak with much earlier on. And this is what he told me (not exact quotes, but the message): \n\nYou know how your family, your friends, your college, and pretty much everyone tells you to follow your passion? You have to be careful with that. Of course, you should follow it, but a lot of people think that following your passion involves working with your passion in a career or a business. You're going to get the best out of your passion following it on your own time as opposed to someone else's time or on constraints you set yourself too. I had a passion for cooking and started a restaurant. But, there's so much to running a restaurant that my cooking suffered and I started to almost lose it. I also have a passion for traveling. I quit my finance job in New York a while ago to travel the world on my own terms and I can tell you the people that were doing what they liked when they liked were by far the happiest. Of course, you do need a career to keep yourself going, it's a part of life. But you're going to get the most out of you passions if you pursue them on your own terms and your own time. \n\nAnd with that, we shook hands, I thanked him, and he went to his boat and drove off. \n\nOn a side note to that, I feel like a friend nowadays is going through something like this and I may want to share this with her. She's a creative writer and is a month away from a degree in it. Her classes have been very critical of her writing and that of others, and she doesn't have much time to actually think about it. I remember her loving every part of creative writing and she told me recently that she's not been feeling it even on her own time and she's afraid she's losing that passion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mine happened on July 6 2014. Probably the best words to live by I&amp;#39;ve ever gotten from anyone. Long story, but I hope someone can take inspiration from this.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s start with some background. It was the middle of an internship as an island steward on a small island off the coast of Connecticut. I was looking forward to it originally, but after a month or so on the island the isolation and general tediousness of the work (pulling weeds all day) was really getting to me. After the fourth of July weekend, I get to the island and my co-steward is on his days off so it&amp;#39;s just me. I&amp;#39;m on my final trash collection round, I realize some people who had arrived earlier set up a tent and a barbecue. They know the island is staffed by someone and they (complete strangers) told me to join them at their barbecue. I finish my trash round (and work for the day) and join them afterwards, very glad about the opportunity social interaction. We shared life stories, ate some fantastic gumbo, and since my work was done for the day I stayed for the fun. Something felt very welcoming about this group, and despite being strangers, they were quick friends for the day. &lt;/p&gt;\n\n&lt;p&gt;The quality of the gumbo was a bit of a premonition. As the sun went down, the last call for when visitors are allowed on the island (30 minutes after sunset is when it closes to any visitors whatsoever), the festivities pack up and we&amp;#39;re about share our goodbyes. I go to thank and compliment the gumbo chef, who had introduced himself as Frank. He was busy cooking so he was one of the group I didn&amp;#39;t get to speak with much earlier on. And this is what he told me (not exact quotes, but the message): &lt;/p&gt;\n\n&lt;p&gt;You know how your family, your friends, your college, and pretty much everyone tells you to follow your passion? You have to be careful with that. Of course, you should follow it, but a lot of people think that following your passion involves working with your passion in a career or a business. You&amp;#39;re going to get the best out of your passion following it on your own time as opposed to someone else&amp;#39;s time or on constraints you set yourself too. I had a passion for cooking and started a restaurant. But, there&amp;#39;s so much to running a restaurant that my cooking suffered and I started to almost lose it. I also have a passion for traveling. I quit my finance job in New York a while ago to travel the world on my own terms and I can tell you the people that were doing what they liked when they liked were by far the happiest. Of course, you do need a career to keep yourself going, it&amp;#39;s a part of life. But you&amp;#39;re going to get the most out of you passions if you pursue them on your own terms and your own time. &lt;/p&gt;\n\n&lt;p&gt;And with that, we shook hands, I thanked him, and he went to his boat and drove off. &lt;/p&gt;\n\n&lt;p&gt;On a side note to that, I feel like a friend nowadays is going through something like this and I may want to share this with her. She&amp;#39;s a creative writer and is a month away from a degree in it. Her classes have been very critical of her writing and that of others, and she doesn&amp;#39;t have much time to actually think about it. I remember her loving every part of creative writing and she told me recently that she&amp;#39;s not been feeling it even on her own time and she&amp;#39;s afraid she&amp;#39;s losing that passion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbus7i", "score_hidden": false, "stickied": false, "created": 1492360531.0, "created_utc": 1492331731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgc7ufx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgby2ew", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Woah..this is something I constantly think about doing. Only it sucks when you live in Texas so I would literally have to drive a whole day just to get out of Texas haha \n\nBut seriously though, just last night I was driving home around midnight and the weather was awesome. It was dark but you had those sort of pre-rain clouds overhead and it was a cool breeze but still comfortable. I seriously was thinking wow it would be so nice just to drive somewhere and just sit outside for a couple hours and enjoy this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woah..this is something I constantly think about doing. Only it sucks when you live in Texas so I would literally have to drive a whole day just to get out of Texas haha &lt;/p&gt;\n\n&lt;p&gt;But seriously though, just last night I was driving home around midnight and the weather was awesome. It was dark but you had those sort of pre-rain clouds overhead and it was a cool breeze but still comfortable. I seriously was thinking wow it would be so nice just to drive somewhere and just sit outside for a couple hours and enjoy this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc7ufx", "score_hidden": false, "stickied": false, "created": 1492388639.0, "created_utc": 1492359839.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgchwfg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VettaBTertiary", "parent_id": "t1_dgby2ew", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "That's a really nice little store. What a nice way to start the day. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a really nice little store. What a nice way to start the day. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgchwfg", "score_hidden": false, "stickied": false, "created": 1492401893.0, "created_utc": 1492373093.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgby2ew", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "HaveAMap", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I used to work in a park. One morning I was opening the visitor center alone and it was a chilly spring morning without any visitors for the first hour. I had my tea and a book and was happy to just exist for a bit. \n\nThis 20-something guy comes in and we nod at each other. He looks sleepy and I just let him quietly look around. Eventually he comes up and asks if he can have some of the visitor coffee and of course he can. So we're both sipping our drinks, looking out the picture window and he says he couldn't sleep last night in Phoenix, so he decided to see the sunrise in Monument Valley. \n\nAnd you know, I got that. It was just recognition of a kindred spirit who would drive alone all night just to see the sun come up over something different. \n\nIt was just a lovely little moment that I'll never forget. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to work in a park. One morning I was opening the visitor center alone and it was a chilly spring morning without any visitors for the first hour. I had my tea and a book and was happy to just exist for a bit. &lt;/p&gt;\n\n&lt;p&gt;This 20-something guy comes in and we nod at each other. He looks sleepy and I just let him quietly look around. Eventually he comes up and asks if he can have some of the visitor coffee and of course he can. So we&amp;#39;re both sipping our drinks, looking out the picture window and he says he couldn&amp;#39;t sleep last night in Phoenix, so he decided to see the sunrise in Monument Valley. &lt;/p&gt;\n\n&lt;p&gt;And you know, I got that. It was just recognition of a kindred spirit who would drive alone all night just to see the sun come up over something different. &lt;/p&gt;\n\n&lt;p&gt;It was just a lovely little moment that I&amp;#39;ll never forget. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgby2ew", "score_hidden": false, "stickied": false, "created": 1492371502.0, "created_utc": 1492342702.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbsc4w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbs8zw", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Hmm that doesn't sound exactly right....I wish I could remember! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm that doesn&amp;#39;t sound exactly right....I wish I could remember! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbsc4w", "score_hidden": false, "stickied": false, "created": 1492353541.0, "created_utc": 1492324741.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbs8zw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gnome_census", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Was it single serving friend?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was it single serving friend?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbs8zw", "score_hidden": false, "stickied": false, "created": 1492353325.0, "created_utc": 1492324525.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgc7m58", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbxkaw", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Thats really sweet", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thats really sweet&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc7m58", "score_hidden": false, "stickied": false, "created": 1492388328.0, "created_utc": 1492359528.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxkaw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FrozenPhysics28", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "This literally just happened today. It wasn't a saying or anything but an action.  So I was at this camp and with the cool air and the blankets naturally someone fell asleep.  One of the teachers crawled to get a blanket and covered the person up as they were probably chilled to the bone.  It was just something that reminded me that whatever your job is or your point in life is whatever happens there's always someone to care for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This literally just happened today. It wasn&amp;#39;t a saying or anything but an action.  So I was at this camp and with the cool air and the blankets naturally someone fell asleep.  One of the teachers crawled to get a blanket and covered the person up as they were probably chilled to the bone.  It was just something that reminded me that whatever your job is or your point in life is whatever happens there&amp;#39;s always someone to care for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbxkaw", "score_hidden": false, "stickied": false, "created": 1492369968.0, "created_utc": 1492341168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgc7wrw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgc1xgh", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Its a neat reminder that there are so many fascinating people in this world that we can connect with outside our own little bubble", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its a neat reminder that there are so many fascinating people in this world that we can connect with outside our own little bubble&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc7wrw", "score_hidden": false, "stickied": false, "created": 1492388727.0, "created_utc": 1492359927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1xgh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MrEvilNES", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "None of these have affected majorly my life, but I've had a few cool interactions with strangers, like nice conversations in concerts/Comic-Con, or this guy who picked me up and gave me a ride after I missed my bus to school, this kid who had a staring contest with me before we pulled out our tongues at each other in a museum, all these people who were wearing shirts of bands I like... It's just a bunch of little things that make me happy :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;None of these have affected majorly my life, but I&amp;#39;ve had a few cool interactions with strangers, like nice conversations in concerts/Comic-Con, or this guy who picked me up and gave me a ride after I missed my bus to school, this kid who had a staring contest with me before we pulled out our tongues at each other in a museum, all these people who were wearing shirts of bands I like... It&amp;#39;s just a bunch of little things that make me happy :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc1xgh", "score_hidden": false, "stickied": false, "created": 1492380036.0, "created_utc": 1492351236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbul3v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbu94n", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Oh! Hmm....I honestly am not even sure I would remember if I heard it again at this point but that's a really cool word anyway", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh! Hmm....I honestly am not even sure I would remember if I heard it again at this point but that&amp;#39;s a really cool word anyway&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbul3v", "score_hidden": false, "stickied": false, "created": 1492359880.0, "created_utc": 1492331080.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbu94n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JustAddFire", "parent_id": "t1_dgbu6bx", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I was guessing the word that your flight - mate used....       \n        \nsonder n. - the realization that each random passerby is living a life as vivid and complex as your own—populated with their own ambitions, friends, routines, worries and inherited craziness—an epic story that continues invisibly around you like an anthill sprawling deep underground, with elaborate passageways to thousands of other lives that you’ll never know existed, in which you might appear only once, as an extra sipping coffee in the background, as a blur of traffic passing on the highway, as a lighted window at dusk", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was guessing the word that your flight - mate used....       &lt;/p&gt;\n\n&lt;p&gt;sonder n. - the realization that each random passerby is living a life as vivid and complex as your own—populated with their own ambitions, friends, routines, worries and inherited craziness—an epic story that continues invisibly around you like an anthill sprawling deep underground, with elaborate passageways to thousands of other lives that you’ll never know existed, in which you might appear only once, as an extra sipping coffee in the background, as a blur of traffic passing on the highway, as a lighted window at dusk&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbu94n", "score_hidden": false, "stickied": false, "created": 1492358825.0, "created_utc": 1492330025.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbu6bx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbts9h", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbu6bx", "score_hidden": false, "stickied": false, "created": 1492358581.0, "created_utc": 1492329781.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbts9h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustAddFire", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Sonder?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sonder?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbts9h", "score_hidden": false, "stickied": false, "created": 1492357418.0, "created_utc": 1492328618.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgc7npq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbwijn", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Thats great that you took so much away from that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thats great that you took so much away from that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc7npq", "score_hidden": false, "stickied": false, "created": 1492388385.0, "created_utc": 1492359585.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbwijn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EverGoodHunterMe", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "That's an awesome story I just wanted to say and I have one kinda similar feeling about an encouter. I was part of this group council student thing in highschool and we went to this big district meetimg thing woth a bunch of other schools and students and teachers and such. And I unknowingly offered to speak in front of a crowd, and bit of sidetrack but we did a speech in front of like 8 teachers forst and such and I was freaking out at that then I found out after that it was a practise speech amd I had to talk in front of over 300 teachers and principals and ministry of teaching staff. And nearly backed out of panic. But my group/council parter who I didn't like or agreed with on anything came outa the blue and told me I got this and that I was the best outa our group to do it. And well I always tell myself I'm not good at anything and that was just a shocking real and true compliment. And it made me really rethink what I thought of myself and of other people. And one of the people running the whole event came to me afterwards and told me that I did good and just talked with me for a bit and listened to what I had to say. And for a highschooler with bsd self esteem and confidence that made me feel on top of the world and I just try and make other people feel good like that. It's what makes me the most happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s an awesome story I just wanted to say and I have one kinda similar feeling about an encouter. I was part of this group council student thing in highschool and we went to this big district meetimg thing woth a bunch of other schools and students and teachers and such. And I unknowingly offered to speak in front of a crowd, and bit of sidetrack but we did a speech in front of like 8 teachers forst and such and I was freaking out at that then I found out after that it was a practise speech amd I had to talk in front of over 300 teachers and principals and ministry of teaching staff. And nearly backed out of panic. But my group/council parter who I didn&amp;#39;t like or agreed with on anything came outa the blue and told me I got this and that I was the best outa our group to do it. And well I always tell myself I&amp;#39;m not good at anything and that was just a shocking real and true compliment. And it made me really rethink what I thought of myself and of other people. And one of the people running the whole event came to me afterwards and told me that I did good and just talked with me for a bit and listened to what I had to say. And for a highschooler with bsd self esteem and confidence that made me feel on top of the world and I just try and make other people feel good like that. It&amp;#39;s what makes me the most happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbwijn", "score_hidden": false, "stickied": false, "created": 1492366471.0, "created_utc": 1492337671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgci9kz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nathanael_Petersen26", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I was at a conference thing in new york a few years back. I was just a kid, 13 ish at the time, where I met this old woman. I'm still not sure if she was mute, or just didn't speak english, but something about her just felt so caring. I don't know any of her story, but I still remember how kind she seemed. I hope one day I can be kind enough for people to just feel it, the way I did around her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was at a conference thing in new york a few years back. I was just a kid, 13 ish at the time, where I met this old woman. I&amp;#39;m still not sure if she was mute, or just didn&amp;#39;t speak english, but something about her just felt so caring. I don&amp;#39;t know any of her story, but I still remember how kind she seemed. I hope one day I can be kind enough for people to just feel it, the way I did around her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgci9kz", "score_hidden": false, "stickied": false, "created": 1492402364.0, "created_utc": 1492373564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgcvjon", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "manlikerealities", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Awh! Not sure about a deep discussion, but I did meet someone for about 5 minutes when I was a kid who I've remembered for the past 20 years. \n\n When I was 5 years old, my mother and I went wandering in arcade in a shopping centre, just looking around. We were living in a women's shelter for survivors of domestic abuse, so we didn't really have money. I saw vending machines which held trading cards with cartoon pictures of them, like of Sailor Moon. After a lot of pestering, my mom gave in and the machine ate all our coins. I was devastated. One of the dads in the arcade came up to us and asked me which one I wanted, and inserted his own cash into another machine. I kept those trading cards forever, until they virtually disintegrated. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awh! Not sure about a deep discussion, but I did meet someone for about 5 minutes when I was a kid who I&amp;#39;ve remembered for the past 20 years. &lt;/p&gt;\n\n&lt;p&gt;When I was 5 years old, my mother and I went wandering in arcade in a shopping centre, just looking around. We were living in a women&amp;#39;s shelter for survivors of domestic abuse, so we didn&amp;#39;t really have money. I saw vending machines which held trading cards with cartoon pictures of them, like of Sailor Moon. After a lot of pestering, my mom gave in and the machine ate all our coins. I was devastated. One of the dads in the arcade came up to us and asked me which one I wanted, and inserted his own cash into another machine. I kept those trading cards forever, until they virtually disintegrated. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcvjon", "score_hidden": false, "stickied": false, "created": 1492420100.0, "created_utc": 1492391300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbre6y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbrbq7", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Ahh sorry. I suck at posting lol I'll edit now!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahh sorry. I suck at posting lol I&amp;#39;ll edit now!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbre6y", "score_hidden": false, "stickied": false, "created": 1492351288.0, "created_utc": 1492322488.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbrnr1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MisterDrProf", "parent_id": "t1_dgbrmfg", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Eh, it can be hard to remember to do that stuff in the heat of the moment. No harm no foul. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, it can be hard to remember to do that stuff in the heat of the moment. No harm no foul. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrnr1", "score_hidden": false, "stickied": false, "created": 1492351909.0, "created_utc": 1492323109.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrmfg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbrkid", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Cool! Yea formatting is not my strong suit..sad thing is that I haven't even been drinking tonight. You'd think sober me would do better", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool! Yea formatting is not my strong suit..sad thing is that I haven&amp;#39;t even been drinking tonight. You&amp;#39;d think sober me would do better&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrmfg", "score_hidden": false, "stickied": false, "created": 1492351821.0, "created_utc": 1492323021.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrkid", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MisterDrProf", "parent_id": "t1_dgbrgk3", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Much better, thank you. Having some breaks makes your post much easier to follow. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Much better, thank you. Having some breaks makes your post much easier to follow. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrkid", "score_hidden": false, "stickied": false, "created": 1492351697.0, "created_utc": 1492322897.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65npbt", "likes": null, "replies": "", "user_reports": [], "id": "dgbrx05", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbrtng", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Haha well thanks! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha well thanks! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrx05", "score_hidden": false, "stickied": false, "created": 1492352522.0, "created_utc": 1492323722.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrtng", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VBassmeister", "parent_id": "t1_dgbrgk3", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I'm only seeing it post edit and it looks fine to me :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m only seeing it post edit and it looks fine to me :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrtng", "score_hidden": false, "stickied": false, "created": 1492352296.0, "created_utc": 1492323496.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrgk3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blondestripes", "parent_id": "t1_dgbrbq7", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Idk, is that better? I literally just threw in breaks where they seemed to fit...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Idk, is that better? I literally just threw in breaks where they seemed to fit...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrgk3", "score_hidden": false, "stickied": false, "created": 1492351438.0, "created_utc": 1492322638.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrbq7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MisterDrProf", "parent_id": "t3_65npbt", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Pro tip: Break your post into paragraphs. As is it's impenetrable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pro tip: Break your post into paragraphs. As is it&amp;#39;s impenetrable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgbrbq7", "score_hidden": false, "stickied": false, "created": 1492351141.0, "created_utc": 1492322341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]