[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "CasualConversation", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I dunno if this is the right subreddit for this kind of stuff but I haven&amp;#39;t shared this with anyone and I just wanted to talk about it so here it is (sorry if it gets really rambly):&lt;/p&gt;\n\n&lt;p&gt;Tl;dr at the bottom&lt;/p&gt;\n\n&lt;p&gt;It all started back in late February this year. I&amp;#39;ve known this girl for a while now as I see her in speech and debate tournaments frequently. I was never really even acquaintances with her; I just never really talked to her. She was &lt;em&gt;kinda&lt;/em&gt; cute but she wasn&amp;#39;t exactly &amp;quot;my type&amp;quot; either. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to this year and somehow, I started talking to her over Twitter DMs. She lives about 300+ miles away from me so hanging out really isn&amp;#39;t an option. Straight off the bat, I could tell she was interested in me (although I couldn&amp;#39;t tell if it was as a friend or more than that) as I noticed the way she asked me questions was similar to the way I ask questions when I&amp;#39;m interested in someone. Over the course of several weeks, we kept talking and the feeling that she might like me more than a friend kept growing. In retrospect, it was super obvious she was trying to be flirty but I wasn&amp;#39;t so sure at the time.  &lt;/p&gt;\n\n&lt;p&gt;When I realized we would actually get to meet up in person for a 3 day debate competition in March, I didn&amp;#39;t think too much of it in the weeks leading up to it. The first day, we didn&amp;#39;t even see each other bc we were just so busy. But the 2nd and 3rd day, oh dear were those the most memorable days of my life. &lt;/p&gt;\n\n&lt;p&gt;(Quick side note: I&amp;#39;m a 17 year old high school senior who is hella awkward and has never really dated anyone. I&amp;#39;ve been in a few pseudo-relationships but those don&amp;#39;t really count lol)&lt;/p&gt;\n\n&lt;p&gt;On those days, we had almost the whole day to ourselves so a lot of it was spent alone in a remote hallway, just talking about stuff. I noticed that she was super flirty with me especially when she kept hugging me and laying her head on my shoulder. I also noticed that while the first little while of talking to her was slightly awkward, it soon disappeared. &lt;/p&gt;\n\n&lt;p&gt;(In one of my past pseudo-relationships even thought we had a big crush on one another, things were always awkward so I assumed awkwardness was just abnormal part of any relationship)&lt;/p&gt;\n\n&lt;p&gt;I couldn&amp;#39;t help but feel so comfortable being with her... We talked about everything from colleges to memes lol. Nothing was off limits. And by the end of that first day, I realized, I really liked her, more than a friend. So I finally mustered up the courage to tell her. And she said she did as well. I remember when she kissed my cheek: i finally understood what euphoria felt like... I finally understood so much...&lt;/p&gt;\n\n&lt;p&gt;The last day we were together, we just kept growing a deep emotional bond I didn&amp;#39;t even realize we were making. Somehow, the conversation turned to insecurities, and we shared secrets about ourselves we never imagined we would ever tell. And I liked her for who she was, not despite her flaws, but because of them. She saw the deepest part of my soul, yet didn&amp;#39;t recoil. She saw my broken, lonely soul, yet she admired me because of them, not in spite of. It was perfect...&lt;/p&gt;\n\n&lt;p&gt;... just a little too perfect. This was our last day together, and we had to face it. It turns out her parents are very strict with who she is allowed to date and I DEFINITELY am not one of them. None of that matters in that moment in time: wrapped in each other&amp;#39;s arms where not a care in the world that can reach us. When we finally said goodbye for the last time, agreeing to not talk to each other bc of her parents, it didn&amp;#39;t hit me that night. But the next morning when she laid bare all the last things she wanted to say, I started crying. And crying. And crying. How foolish was I to not understand the gravity of what we had. Was what we had love? I didn&amp;#39;t know... I asked her and she thought that it was &amp;quot;love-quality&amp;quot; since love took time. &lt;/p&gt;\n\n&lt;p&gt;But we couldn&amp;#39;t stop talking to one another. For several weeks afterwards we did. But it all ended when we almost got caught by her parents. That night was the night that she said we needed to face the possibility of never talking to one another, or at the very least, hardly ever talking. That night we agreed was the last night we would speak freely. It lasted from 11 pm to 4 am. So many things were said. And she said those words: &amp;quot;I love you&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Those 3 words that I tossed around before in my past pseudo-relationships I now understood, if not fully, on a deeper level. Those 3 words that I so cynically thought was nothing but a stupid fantasy I now felt. Even though we might not ever talk to or see each other ever again, we want each other to find happiness in our lives, even if it means her finding someone else besides me and vice versa. We will look back at these memories and treasure them, regardless of what happens because to call it a fling would devalue what it meant to us; it was so, so much more...&lt;/p&gt;\n\n&lt;p&gt;This was a girl who I could finally imagine myself being in a long term relationship, but fate otherwise was said otherwise. We did leave open the possibility for a future long distance relationship though. We have our whole lives ahead of us and there&amp;#39;s nothing to say that we won&amp;#39;t find a way back to each other. But unfortunately, it can&amp;#39;t happen now. &lt;/p&gt;\n\n&lt;p&gt;Had I been looking from the outside into this situation, I would&amp;#39;ve been like the next person in saying that it was just young love, you have no idea how shallow it was based upon, etc. But it is so much different, which is also a line we&amp;#39;ve all heard before. &lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m terrified of is that I&amp;#39;ll never meet someone like her, someone who truly accepts me the way I am, not the illusion I make for myself. I love her, and I can&amp;#39;t imagine letting go of what we&amp;#39;ve had. If she does find someone she is truly happy with and it&amp;#39;s not me, I want her to be with that guy. I want her to have a happy future.&lt;/p&gt;\n\n&lt;p&gt;I know that someone is gonna say that pretty much almost everyone meets &amp;quot;the one&amp;quot; eventually. But what if she was the one? I&amp;#39;m not popular by any stretch of the imaginations and putting myself out there has almost always ended in failure...&lt;/p&gt;\n\n&lt;p&gt;Tl;dr: Fell in love with a girl. Have to go our separate ways for now. Terrified that I&amp;#39;m losing something I may never find again. &lt;/p&gt;\n\n&lt;p&gt;Edit: some words here and there for clarity. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I dunno if this is the right subreddit for this kind of stuff but I haven't shared this with anyone and I just wanted to talk about it so here it is (sorry if it gets really rambly):\n\nTl;dr at the bottom\n\nIt all started back in late February this year. I've known this girl for a while now as I see her in speech and debate tournaments frequently. I was never really even acquaintances with her; I just never really talked to her. She was *kinda* cute but she wasn't exactly \"my type\" either. \n\nFast forward to this year and somehow, I started talking to her over Twitter DMs. She lives about 300+ miles away from me so hanging out really isn't an option. Straight off the bat, I could tell she was interested in me (although I couldn't tell if it was as a friend or more than that) as I noticed the way she asked me questions was similar to the way I ask questions when I'm interested in someone. Over the course of several weeks, we kept talking and the feeling that she might like me more than a friend kept growing. In retrospect, it was super obvious she was trying to be flirty but I wasn't so sure at the time.  \n\nWhen I realized we would actually get to meet up in person for a 3 day debate competition in March, I didn't think too much of it in the weeks leading up to it. The first day, we didn't even see each other bc we were just so busy. But the 2nd and 3rd day, oh dear were those the most memorable days of my life. \n\n(Quick side note: I'm a 17 year old high school senior who is hella awkward and has never really dated anyone. I've been in a few pseudo-relationships but those don't really count lol)\n\nOn those days, we had almost the whole day to ourselves so a lot of it was spent alone in a remote hallway, just talking about stuff. I noticed that she was super flirty with me especially when she kept hugging me and laying her head on my shoulder. I also noticed that while the first little while of talking to her was slightly awkward, it soon disappeared. \n\n(In one of my past pseudo-relationships even thought we had a big crush on one another, things were always awkward so I assumed awkwardness was just abnormal part of any relationship)\n\nI couldn't help but feel so comfortable being with her... We talked about everything from colleges to memes lol. Nothing was off limits. And by the end of that first day, I realized, I really liked her, more than a friend. So I finally mustered up the courage to tell her. And she said she did as well. I remember when she kissed my cheek: i finally understood what euphoria felt like... I finally understood so much...\n\nThe last day we were together, we just kept growing a deep emotional bond I didn't even realize we were making. Somehow, the conversation turned to insecurities, and we shared secrets about ourselves we never imagined we would ever tell. And I liked her for who she was, not despite her flaws, but because of them. She saw the deepest part of my soul, yet didn't recoil. She saw my broken, lonely soul, yet she admired me because of them, not in spite of. It was perfect...\n\n... just a little too perfect. This was our last day together, and we had to face it. It turns out her parents are very strict with who she is allowed to date and I DEFINITELY am not one of them. None of that matters in that moment in time: wrapped in each other's arms where not a care in the world that can reach us. When we finally said goodbye for the last time, agreeing to not talk to each other bc of her parents, it didn't hit me that night. But the next morning when she laid bare all the last things she wanted to say, I started crying. And crying. And crying. How foolish was I to not understand the gravity of what we had. Was what we had love? I didn't know... I asked her and she thought that it was \"love-quality\" since love took time. \n\nBut we couldn't stop talking to one another. For several weeks afterwards we did. But it all ended when we almost got caught by her parents. That night was the night that she said we needed to face the possibility of never talking to one another, or at the very least, hardly ever talking. That night we agreed was the last night we would speak freely. It lasted from 11 pm to 4 am. So many things were said. And she said those words: \"I love you\". \n\nThose 3 words that I tossed around before in my past pseudo-relationships I now understood, if not fully, on a deeper level. Those 3 words that I so cynically thought was nothing but a stupid fantasy I now felt. Even though we might not ever talk to or see each other ever again, we want each other to find happiness in our lives, even if it means her finding someone else besides me and vice versa. We will look back at these memories and treasure them, regardless of what happens because to call it a fling would devalue what it meant to us; it was so, so much more...\n\nThis was a girl who I could finally imagine myself being in a long term relationship, but fate otherwise was said otherwise. We did leave open the possibility for a future long distance relationship though. We have our whole lives ahead of us and there's nothing to say that we won't find a way back to each other. But unfortunately, it can't happen now. \n\nHad I been looking from the outside into this situation, I would've been like the next person in saying that it was just young love, you have no idea how shallow it was based upon, etc. But it is so much different, which is also a line we've all heard before. \n\nWhat I'm terrified of is that I'll never meet someone like her, someone who truly accepts me the way I am, not the illusion I make for myself. I love her, and I can't imagine letting go of what we've had. If she does find someone she is truly happy with and it's not me, I want her to be with that guy. I want her to have a happy future.\n\nI know that someone is gonna say that pretty much almost everyone meets \"the one\" eventually. But what if she was the one? I'm not popular by any stretch of the imaginations and putting myself out there has almost always ended in failure...\n\nTl;dr: Fell in love with a girl. Have to go our separate ways for now. Terrified that I'm losing something I may never find again. \n\nEdit: some words here and there for clarity. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65po9o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 41, "report_reasons": null, "author": "sgulls", "saved": false, "mod_reports": [], "name": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "approved_by": null, "over_18": false, "domain": "self.CasualConversation", "hidden": false, "thumbnail": "", "subreddit_id": "t5_323oy", "edited": 1492388362.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/CasualConversation/comments/65po9o/finally_found_what_it_was_like_to_have_a_deep/", "num_reports": null, "locked": false, "stickied": false, "created": 1492385619.0, "url": "https://www.reddit.com/r/CasualConversation/comments/65po9o/finally_found_what_it_was_like_to_have_a_deep/", "author_flair_text": null, "quarantine": false, "title": "Finally found what it was like to have a deep, meaningful relationship. Then life had to throw in a wrench [LONG]", "created_utc": 1492356819.0, "distinguished": null, "media": null, "upvote_ratio": 0.99, "num_comments": 34, "visited": false, "subreddit_type": "public", "ups": 41}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcd4s3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgcb45d", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Haha thanks. Being in speech and debate has made it so that my writing style follows the way I would speak if that explains anything. Apparently my English teachers don't like it and stress that writing and speaking use two very different structures, the difference of which I haven't exactly been informed fully on lol ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha thanks. Being in speech and debate has made it so that my writing style follows the way I would speak if that explains anything. Apparently my English teachers don&amp;#39;t like it and stress that writing and speaking use two very different structures, the difference of which I haven&amp;#39;t exactly been informed fully on lol &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcd4s3", "score_hidden": false, "stickied": false, "created": 1492395585.0, "created_utc": 1492366785.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcb45d", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "4tchan", "parent_id": "t1_dgcaeqy", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "You express your feelings well, the progression is timely, the formatting (paragraphs, commas) help your post flow.  \n I've never experienced what you have but somehow I know how you feel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You express your feelings well, the progression is timely, the formatting (paragraphs, commas) help your post flow.&lt;br/&gt;\n I&amp;#39;ve never experienced what you have but somehow I know how you feel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcb45d", "score_hidden": false, "stickied": false, "created": 1492392918.0, "created_utc": 1492364118.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcaeqy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgc60o6", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "No, I appreciate it! What about my style do you specifically like?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, I appreciate it! What about my style do you specifically like?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcaeqy", "score_hidden": false, "stickied": false, "created": 1492391981.0, "created_utc": 1492363181.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc60o6", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "4tchan", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I hope this doesn't come off as inconsiderate since it diverges from the point of your post, but I really like the way you write.  \nI hope everything works out for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope this doesn&amp;#39;t come off as inconsiderate since it diverges from the point of your post, but I really like the way you write.&lt;br/&gt;\nI hope everything works out for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc60o6", "score_hidden": false, "stickied": false, "created": 1492386166.0, "created_utc": 1492357366.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcdqzk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "KidSupreme", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "2013 I met a girl and it took us awhile to get the first date going (schedules never worked out). Our first date happens and she tells me she's moving to Colorado for a job she took. We went on a few more dates and really vibed. \n\nAnyways, she's gone now and I've never met anyone like her ever since. I've met some amazing women in the meantime, but I'd be lying if I said I didn't think about that woman here and there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;2013 I met a girl and it took us awhile to get the first date going (schedules never worked out). Our first date happens and she tells me she&amp;#39;s moving to Colorado for a job she took. We went on a few more dates and really vibed. &lt;/p&gt;\n\n&lt;p&gt;Anyways, she&amp;#39;s gone now and I&amp;#39;ve never met anyone like her ever since. I&amp;#39;ve met some amazing women in the meantime, but I&amp;#39;d be lying if I said I didn&amp;#39;t think about that woman here and there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcdqzk", "score_hidden": false, "stickied": false, "created": 1492396411.0, "created_utc": 1492367611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgce3q4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Over_Heaven", "parent_id": "t1_dgcd1le", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Ahh, I can totally relate to that. For many years I had to receive positive affirmations from others not to let my self esteem crumble, but eventually I learnt that the trick is being positive yourself every now and then.\nYeah! Try complimenting yourself even for the smallest daily achievement just for once.\n\nIt might not work at first and it may look childish or something, but we all need some silliness in our lives to keep goin'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahh, I can totally relate to that. For many years I had to receive positive affirmations from others not to let my self esteem crumble, but eventually I learnt that the trick is being positive yourself every now and then.\nYeah! Try complimenting yourself even for the smallest daily achievement just for once.&lt;/p&gt;\n\n&lt;p&gt;It might not work at first and it may look childish or something, but we all need some silliness in our lives to keep goin&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgce3q4", "score_hidden": false, "stickied": false, "created": 1492396893.0, "created_utc": 1492368093.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd1le", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgcbimc", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "For so long, I've struggled with self esteem and my self worth has always been dependent on others. Which, as you can imagine, isn't a good idea or healthy for someone who is perpetually lonely. It's a struggle especially since she was the first one who gave me that external validation, and I to her as well. But thank you so much for your advice :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For so long, I&amp;#39;ve struggled with self esteem and my self worth has always been dependent on others. Which, as you can imagine, isn&amp;#39;t a good idea or healthy for someone who is perpetually lonely. It&amp;#39;s a struggle especially since she was the first one who gave me that external validation, and I to her as well. But thank you so much for your advice :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcd1le", "score_hidden": false, "stickied": false, "created": 1492395461.0, "created_utc": 1492366661.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbimc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Over_Heaven", "parent_id": "t1_dgcaiq7", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "People are a hit or a miss. It is all a matter of whether they click with you or not, it is alright if you haven't managed to find the right people, but rest assured you will.\n\nIt is also alright if you want to salvage your relationship with this person, but don't let it destroy you. You'll regret it, as I did.\nYour own well-being is the single most important thing you have in this world.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People are a hit or a miss. It is all a matter of whether they click with you or not, it is alright if you haven&amp;#39;t managed to find the right people, but rest assured you will.&lt;/p&gt;\n\n&lt;p&gt;It is also alright if you want to salvage your relationship with this person, but don&amp;#39;t let it destroy you. You&amp;#39;ll regret it, as I did.\nYour own well-being is the single most important thing you have in this world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcbimc", "score_hidden": false, "stickied": false, "created": 1492393445.0, "created_utc": 1492364645.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcaiq7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgc6zbi", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I hope you're right. I've just had terrible luck in making friends, let alone meaningful romantic relationships so letting go and moving on is just too painful of an option. But yeah, I suppose if that was all there is, there's no point in being all negative. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you&amp;#39;re right. I&amp;#39;ve just had terrible luck in making friends, let alone meaningful romantic relationships so letting go and moving on is just too painful of an option. But yeah, I suppose if that was all there is, there&amp;#39;s no point in being all negative. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcaiq7", "score_hidden": false, "stickied": false, "created": 1492392124.0, "created_utc": 1492363324.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6zbi", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Over_Heaven", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "\"The one\" doesn't exist, you'll meet many more people in your life whom you'll be able to trust and be yourself with (not strictly in a romantic relationship).\nYou also said it yourself: treasure the moments you had with this person. As clichèd as this saying may sound, it is definitely true: don't be sad because it is over, smile because it happened.\n\nHave a wonderful day and/or Easter, if you celebrate it!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;The one&amp;quot; doesn&amp;#39;t exist, you&amp;#39;ll meet many more people in your life whom you&amp;#39;ll be able to trust and be yourself with (not strictly in a romantic relationship).\nYou also said it yourself: treasure the moments you had with this person. As clichèd as this saying may sound, it is definitely true: don&amp;#39;t be sad because it is over, smile because it happened.&lt;/p&gt;\n\n&lt;p&gt;Have a wonderful day and/or Easter, if you celebrate it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgc6zbi", "score_hidden": false, "stickied": false, "created": 1492387479.0, "created_utc": 1492358679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcl1yl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "omnifeathers", "parent_id": "t1_dgckosd", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "It's too bad at that age you're still kind of at the mercy of the parents in terms of permission to date. Maybe you guys can stay friends and if the friendship holds strong you can have another go at the relationship when you're a bit more independent. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s too bad at that age you&amp;#39;re still kind of at the mercy of the parents in terms of permission to date. Maybe you guys can stay friends and if the friendship holds strong you can have another go at the relationship when you&amp;#39;re a bit more independent. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcl1yl", "score_hidden": false, "stickied": false, "created": 1492405989.0, "created_utc": 1492377189.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgckosd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgcjzar", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I'm not religious, let alone their specific sect of Christianity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not religious, let alone their specific sect of Christianity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgckosd", "score_hidden": false, "stickied": false, "created": 1492405512.0, "created_utc": 1492376712.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjzar", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "omnifeathers", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Why wouldn't her parents let you date her?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why wouldn&amp;#39;t her parents let you date her?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcjzar", "score_hidden": false, "stickied": false, "created": 1492404570.0, "created_utc": 1492375770.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgctb0h", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "terradi", "parent_id": "t1_dgcndjr", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "While breakups aren't fun, you learn a lot about yourself and the people you are with. Even the bad relationships teach you about things like boundaries and communication and what you can and can't put up with in someone. \n\nI would urge you not to put off dating with the idea of finding 'the one' on the first shot after you're set financially. Or at the very least, cultivate lots of friendships with friends of your desired gender so you're not interacting with them for the first time when you try and take a relationship all the way. \n\nGood luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While breakups aren&amp;#39;t fun, you learn a lot about yourself and the people you are with. Even the bad relationships teach you about things like boundaries and communication and what you can and can&amp;#39;t put up with in someone. &lt;/p&gt;\n\n&lt;p&gt;I would urge you not to put off dating with the idea of finding &amp;#39;the one&amp;#39; on the first shot after you&amp;#39;re set financially. Or at the very least, cultivate lots of friendships with friends of your desired gender so you&amp;#39;re not interacting with them for the first time when you try and take a relationship all the way. &lt;/p&gt;\n\n&lt;p&gt;Good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgctb0h", "score_hidden": false, "stickied": false, "created": 1492417117.0, "created_utc": 1492388317.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcp19f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mgsquirrel", "parent_id": "t1_dgco0rh", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "You're absolutely right about all of that. I can't ​imagine what it would be like to get split up with someone that close by the situation that can't be changed by either of us. In some ways that's much worse than the alternative (ways of being separated). \n\nI appreciate your advice. I know that I may be missing opportunities as I have read and heard sooo many stories of people seeing what they did/read wrong in hindsight, etc. I'm trying really hard to stay alert for people who are interested in me. I'm also pretty certain that I will misread the conversations you're talking about when they happen. I have some female friends who I would definitely consider dating if I thought for sure they were into me, but I would rather stick with good friendships if I'm not sure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re absolutely right about all of that. I can&amp;#39;t ​imagine what it would be like to get split up with someone that close by the situation that can&amp;#39;t be changed by either of us. In some ways that&amp;#39;s much worse than the alternative (ways of being separated). &lt;/p&gt;\n\n&lt;p&gt;I appreciate your advice. I know that I may be missing opportunities as I have read and heard sooo many stories of people seeing what they did/read wrong in hindsight, etc. I&amp;#39;m trying really hard to stay alert for people who are interested in me. I&amp;#39;m also pretty certain that I will misread the conversations you&amp;#39;re talking about when they happen. I have some female friends who I would definitely consider dating if I thought for sure they were into me, but I would rather stick with good friendships if I&amp;#39;m not sure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcp19f", "score_hidden": false, "stickied": false, "created": 1492411273.0, "created_utc": 1492382473.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgco0rh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgcndjr", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "The worst part was that it wasn't us, it ended not because one of us hurt the other or because we weren't compatible or anything, it was because of circumstances beyond our control. \n\nJust like you, I thought that I wasn't going to even try to be in a relationship until much later in life. The thing is, at least for me, the best opportunities don't wait around for your planning. They pop up at the oddest and sometimes the most inconvenient time. It just... happens. \n\nSo if I had advice for you, it's that while you may not actively be searching for anyone, don't blind yourself to possible opportunities that may be sitting right in front of your face.\n\nThe most random thoughts and sentences can stimulate conversations that lead to so much more than what you were initially expecting (or not expecting)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The worst part was that it wasn&amp;#39;t us, it ended not because one of us hurt the other or because we weren&amp;#39;t compatible or anything, it was because of circumstances beyond our control. &lt;/p&gt;\n\n&lt;p&gt;Just like you, I thought that I wasn&amp;#39;t going to even try to be in a relationship until much later in life. The thing is, at least for me, the best opportunities don&amp;#39;t wait around for your planning. They pop up at the oddest and sometimes the most inconvenient time. It just... happens. &lt;/p&gt;\n\n&lt;p&gt;So if I had advice for you, it&amp;#39;s that while you may not actively be searching for anyone, don&amp;#39;t blind yourself to possible opportunities that may be sitting right in front of your face.&lt;/p&gt;\n\n&lt;p&gt;The most random thoughts and sentences can stimulate conversations that lead to so much more than what you were initially expecting (or not expecting)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgco0rh", "score_hidden": false, "stickied": false, "created": 1492409881.0, "created_utc": 1492381081.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcndjr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mgsquirrel", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Feel you with akwardness/discomfort about talking to people and relationships, and I'm not much older than you. Your story is the embodiment of exactly what I'm afraid of. I've been very hesitant to act on any whims that cross my mind with friends/acquaintances because my ultimate goal is, \"one shot, one kill,\" as in no breakups (I know that's lofty and probably unrealistic, but I'm still going to give it my best effort).\n\nTo that end, at least I haven't met anyone quite like you have. My plan presently is to wait until I have a solid career on track before I actively go looking for someone to date, or at least on the way there if I see an opportunity. I am still working on that, and on a side note there is a possibility of a breakthrough I never dreamed of :)\n\nI'm sorry it had to end the way it did for you. I would probably not handle it quite as well as you seem to be; I have not even been in a relationship and I can see how much my SO would mean to me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Feel you with akwardness/discomfort about talking to people and relationships, and I&amp;#39;m not much older than you. Your story is the embodiment of exactly what I&amp;#39;m afraid of. I&amp;#39;ve been very hesitant to act on any whims that cross my mind with friends/acquaintances because my ultimate goal is, &amp;quot;one shot, one kill,&amp;quot; as in no breakups (I know that&amp;#39;s lofty and probably unrealistic, but I&amp;#39;m still going to give it my best effort).&lt;/p&gt;\n\n&lt;p&gt;To that end, at least I haven&amp;#39;t met anyone quite like you have. My plan presently is to wait until I have a solid career on track before I actively go looking for someone to date, or at least on the way there if I see an opportunity. I am still working on that, and on a side note there is a possibility of a breakthrough I never dreamed of :)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry it had to end the way it did for you. I would probably not handle it quite as well as you seem to be; I have not even been in a relationship and I can see how much my SO would mean to me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcndjr", "score_hidden": false, "stickied": false, "created": 1492409031.0, "created_utc": 1492380231.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcvj95", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "terradi", "parent_id": "t1_dgctuyw", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I hear you and I was the same way. It's a ridiculous story, and it sounds like something you read about in movies rather than something that happens in real life. I've told people who are dating or married our story and it doesn't sound real to them either. \n\nHonestly, I think having to work to be together made us fight a lot harder for each other. We value each other a lot because we both worked hard to get to where we are. It helped too that we were friends first and enjoyed each other, even without the added romantic side of it all. \n\nI am glad you have had such a positive experience and gotten a chance to see what a natural and healthy growth of love can look like. It will serve you well whether your paths with this young lady cross again or whether you find yourself in a new romance in the future. \n\nI have confidence that you will be lucky enough to be with someone who loves you for you and understands that everyone has flaws -- and that love is enjoying someone for all that they are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hear you and I was the same way. It&amp;#39;s a ridiculous story, and it sounds like something you read about in movies rather than something that happens in real life. I&amp;#39;ve told people who are dating or married our story and it doesn&amp;#39;t sound real to them either. &lt;/p&gt;\n\n&lt;p&gt;Honestly, I think having to work to be together made us fight a lot harder for each other. We value each other a lot because we both worked hard to get to where we are. It helped too that we were friends first and enjoyed each other, even without the added romantic side of it all. &lt;/p&gt;\n\n&lt;p&gt;I am glad you have had such a positive experience and gotten a chance to see what a natural and healthy growth of love can look like. It will serve you well whether your paths with this young lady cross again or whether you find yourself in a new romance in the future. &lt;/p&gt;\n\n&lt;p&gt;I have confidence that you will be lucky enough to be with someone who loves you for you and understands that everyone has flaws -- and that love is enjoying someone for all that they are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcvj95", "score_hidden": false, "stickied": false, "created": 1492420084.0, "created_utc": 1492391284.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctuyw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgct5y1", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "The thing I find funny/sad is that had you told me this story just 2 months ago, I would've totally laughed or something bc there was no way I could understand this kind of situation especially since I've never truly been in a relationship. It seems that this kind of thing only happens in movies. \n\nBut looking at them now, your words give me hope. And I greatly admire both of you for having the strength and resolve to bridge the physical distance between the both of you. And you're right, even if we grow apart, the experience will serve me well in my future endeavors. I just hope that there will be a next time if that's the case... which is irrational but I still can't shake the feeling nonetheless. But thank you for sharing your experience nonetheless :)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing I find funny/sad is that had you told me this story just 2 months ago, I would&amp;#39;ve totally laughed or something bc there was no way I could understand this kind of situation especially since I&amp;#39;ve never truly been in a relationship. It seems that this kind of thing only happens in movies. &lt;/p&gt;\n\n&lt;p&gt;But looking at them now, your words give me hope. And I greatly admire both of you for having the strength and resolve to bridge the physical distance between the both of you. And you&amp;#39;re right, even if we grow apart, the experience will serve me well in my future endeavors. I just hope that there will be a next time if that&amp;#39;s the case... which is irrational but I still can&amp;#39;t shake the feeling nonetheless. But thank you for sharing your experience nonetheless :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgctuyw", "score_hidden": false, "stickied": false, "created": 1492417855.0, "created_utc": 1492389055.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgct5y1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "terradi", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Hiyo. \n\nI am significantly older than you, but I totally get the whole being deeply in love and having no way to actually be with someone business. Some years back, I invited a guy and an old college buddy to come and visit me. I lived in Japan at the time and he lived in Australia. He visited. We hit it off amazingly and had the time of our lives. But he was halfway through his master's degree and I was working a full-time job and we had no idea on when or how we were ever going to be on the same continent again.\n\nSaying goodbye and watching him go sucked hard. Chatting online wasn't satisfactory, and we decided not to formally date, but to work on getting on the same continent so that we could try this together thing. \n\nIt took us over a year -- he visited in very early 2011 and I didn't get back to the US (which he'd returned to and gotten a job at) until September 2012, but eventually we managed to make it all work out. Been married since 2014 now. \n\nSo it can work. You're young and it won't be easy. You will meet other people who love you and who you can love, but I would say don't be afraid to keep in touch, even if it's not romantic right now. You may have another chance in the future. You may grow together OR grow apart, but it sounds like you learned a lot and you learned what real love is, and that is important. \n\nYou'll be okay. I'm sure it doesn't feel that way right now but you will be. Best of luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hiyo. &lt;/p&gt;\n\n&lt;p&gt;I am significantly older than you, but I totally get the whole being deeply in love and having no way to actually be with someone business. Some years back, I invited a guy and an old college buddy to come and visit me. I lived in Japan at the time and he lived in Australia. He visited. We hit it off amazingly and had the time of our lives. But he was halfway through his master&amp;#39;s degree and I was working a full-time job and we had no idea on when or how we were ever going to be on the same continent again.&lt;/p&gt;\n\n&lt;p&gt;Saying goodbye and watching him go sucked hard. Chatting online wasn&amp;#39;t satisfactory, and we decided not to formally date, but to work on getting on the same continent so that we could try this together thing. &lt;/p&gt;\n\n&lt;p&gt;It took us over a year -- he visited in very early 2011 and I didn&amp;#39;t get back to the US (which he&amp;#39;d returned to and gotten a job at) until September 2012, but eventually we managed to make it all work out. Been married since 2014 now. &lt;/p&gt;\n\n&lt;p&gt;So it can work. You&amp;#39;re young and it won&amp;#39;t be easy. You will meet other people who love you and who you can love, but I would say don&amp;#39;t be afraid to keep in touch, even if it&amp;#39;s not romantic right now. You may have another chance in the future. You may grow together OR grow apart, but it sounds like you learned a lot and you learned what real love is, and that is important. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll be okay. I&amp;#39;m sure it doesn&amp;#39;t feel that way right now but you will be. Best of luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgct5y1", "score_hidden": false, "stickied": false, "created": 1492416929.0, "created_utc": 1492388129.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcszon", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgcdvdd", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I know that I still have a ton of years left in me to figure all of this out, it's just that it's so, so hard to find what so many people are looking for only to lose it... I remember talking with a few other people about relationships and this one girl who is super attractive and intelligent and hella outgoing laments that she's \"tired of making out with guys while drunk at every party and [she] wants something real for once\". \n\nLike, if people who have zero social anxiety and have little issue with approaching new people have trouble finding a meaningful relationship, that to me just means that what I found and created with that girl was just so much more valuable; something to fight for. But life isn't like a movie script I suppose...", "edited": 1492388233.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know that I still have a ton of years left in me to figure all of this out, it&amp;#39;s just that it&amp;#39;s so, so hard to find what so many people are looking for only to lose it... I remember talking with a few other people about relationships and this one girl who is super attractive and intelligent and hella outgoing laments that she&amp;#39;s &amp;quot;tired of making out with guys while drunk at every party and [she] wants something real for once&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Like, if people who have zero social anxiety and have little issue with approaching new people have trouble finding a meaningful relationship, that to me just means that what I found and created with that girl was just so much more valuable; something to fight for. But life isn&amp;#39;t like a movie script I suppose...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcszon", "score_hidden": false, "stickied": false, "created": 1492416693.0, "created_utc": 1492387893.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdvdd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Libelnon", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "You're still young. Things may turn around and it will turn out okay, maybe with her, maybe not. Life is like that. \nDon't kick yourself over it, it's an experience to cherish. Knowing what it is like now will make future relationships easier. You will meet others who you share similar feelings with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re still young. Things may turn around and it will turn out okay, maybe with her, maybe not. Life is like that. \nDon&amp;#39;t kick yourself over it, it&amp;#39;s an experience to cherish. Knowing what it is like now will make future relationships easier. You will meet others who you share similar feelings with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcdvdd", "score_hidden": false, "stickied": false, "created": 1492396580.0, "created_utc": 1492367780.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcsqgp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgcrapf", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Thank you so much for the kind words :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for the kind words :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcsqgp", "score_hidden": false, "stickied": false, "created": 1492416331.0, "created_utc": 1492387531.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrapf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DexterTheSlayer", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Great writing and also am very sorry to hear that her parents where the ones to end it before it even started to go places. I can only hope your guys path may cross again one day or you find the one in your later life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great writing and also am very sorry to hear that her parents where the ones to end it before it even started to go places. I can only hope your guys path may cross again one day or you find the one in your later life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcrapf", "score_hidden": false, "stickied": false, "created": 1492414398.0, "created_utc": 1492385598.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcufmy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgctvbz", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "I feel you man, I feel you. I truly do. I remember walking with this one girl every day at the end of school when we were kinda-dating-but-not-really ('twas complicated) and all I can remember is that I had SO much trouble keeping a conversation with her. And a million other different situations I always try to follow the various advice I'm given. But they've hardly ever worked.\n\nThe thing that worked for me in this situation was using our mutual interest (in this case debate and cats) as a launching pad of sorts. I know this doesn't help as much (or at all really) but it really depends on the other person. It really does. The girls I've talked to before all had similar interests, to a certain extent, as I did. \n\n\nI've been in your shoes before (I still am tbh) and I understand. I truly do. Again, I know this doesn't really help but it's the most I can do. You just gotta talk and see what happens. Even if you don't, sometimes opportunities just happen. And you'll never know if it's worth it or not until you try. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel you man, I feel you. I truly do. I remember walking with this one girl every day at the end of school when we were kinda-dating-but-not-really (&amp;#39;twas complicated) and all I can remember is that I had SO much trouble keeping a conversation with her. And a million other different situations I always try to follow the various advice I&amp;#39;m given. But they&amp;#39;ve hardly ever worked.&lt;/p&gt;\n\n&lt;p&gt;The thing that worked for me in this situation was using our mutual interest (in this case debate and cats) as a launching pad of sorts. I know this doesn&amp;#39;t help as much (or at all really) but it really depends on the other person. It really does. The girls I&amp;#39;ve talked to before all had similar interests, to a certain extent, as I did. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in your shoes before (I still am tbh) and I understand. I truly do. Again, I know this doesn&amp;#39;t really help but it&amp;#39;s the most I can do. You just gotta talk and see what happens. Even if you don&amp;#39;t, sometimes opportunities just happen. And you&amp;#39;ll never know if it&amp;#39;s worth it or not until you try. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcufmy", "score_hidden": false, "stickied": false, "created": 1492418631.0, "created_utc": 1492389831.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctvbz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AES512", "parent_id": "t1_dgctl5h", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "How the whole natural conversation goes. With friends it's no problem. But if it's with a girl I like, I feel like I can't talk about anything reasonable. I kinda stall. Not as bad as not literally knowing what to say, but no idea how to make it a good time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How the whole natural conversation goes. With friends it&amp;#39;s no problem. But if it&amp;#39;s with a girl I like, I feel like I can&amp;#39;t talk about anything reasonable. I kinda stall. Not as bad as not literally knowing what to say, but no idea how to make it a good time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgctvbz", "score_hidden": false, "stickied": false, "created": 1492417869.0, "created_utc": 1492389069.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctl5h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgct447", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Out of curiosity, what do you feel confused about?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Out of curiosity, what do you feel confused about?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgctl5h", "score_hidden": false, "stickied": false, "created": 1492417485.0, "created_utc": 1492388685.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgct447", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AES512", "parent_id": "t1_dgcsovb", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "This was perfect. Thank you a lot. I still feel as confused,but I am reassured it normal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was perfect. Thank you a lot. I still feel as confused,but I am reassured it normal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgct447", "score_hidden": false, "stickied": false, "created": 1492416862.0, "created_utc": 1492388062.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsovb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgcs3rn", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Haha I was going to include all that in the main post but I didn't want it to be longer than it had to.\n\nThe thing that started it all was me DMing her about something she posted and how I thought it was kinda funny bc we both love cats. And from there, it just snowballed. Keep in mind though, we both knew who each other were for a little while so it's not like I started talking about cats to someone I never met although it was kinda out of the blue. if that makes sense. \n\nI dunno, whenever I was interested in a girl, I would try to ask all these things to get to know her, ya know, standard stuff. The only difference was, in retrospect, she was WAYYY more into me than I was into her (at the time) so she was the one that was leading the convo. \n\nWhen we finally met up for those fateful two days, we mostly talked about debate since that's what we were there for. But I dunno, it just spiraled out from there.\n\nI get what you're trying to ask, since whenever I've been on \"dates\" before, I would never really know what to ask, what to say. I would try to implement tips that I hear from my friends or the internet, to limited success. \n\nLike I said previously, I thought that relationships were ALWAYS bound to be awkward even if there is mutual attraction. The difference with this was that even though we didn't know each other that well, we just \"vibed\" so well, ya know? It really doesn't make sense until you experience it. So much about relationships was hypothetical in my head before this. It is so much different than what I imagined.\n\n\"Vibing\" has nothing to do with the amount of physical attraction between two people, it just happens. Even then, it starts off a bit awkward and intimidating. I remember the first little while with her in person was a bit nervewracking. Only slightly though. \n\nBoth of us were some of the most awkward people (we're both nerdy af. In fact she was nerdy to the point that she was good enough to be in the top 12 in the Scripps national spelling bee a few years back XD); so don't think that finding that vibe with someone depends on being the most sociable or outgoing person. It helps, but it's not necessary. But going forward does take some leaps of faith. At least for me it did. But those leaps of faith were nowhere near as scary as when I took them with other girls in the past.\n\nSorry if this was a bit rambly but I hoped I helped ya out a bit. Just ask if anything was a bit vague or something\n", "edited": 1492388101.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha I was going to include all that in the main post but I didn&amp;#39;t want it to be longer than it had to.&lt;/p&gt;\n\n&lt;p&gt;The thing that started it all was me DMing her about something she posted and how I thought it was kinda funny bc we both love cats. And from there, it just snowballed. Keep in mind though, we both knew who each other were for a little while so it&amp;#39;s not like I started talking about cats to someone I never met although it was kinda out of the blue. if that makes sense. &lt;/p&gt;\n\n&lt;p&gt;I dunno, whenever I was interested in a girl, I would try to ask all these things to get to know her, ya know, standard stuff. The only difference was, in retrospect, she was WAYYY more into me than I was into her (at the time) so she was the one that was leading the convo. &lt;/p&gt;\n\n&lt;p&gt;When we finally met up for those fateful two days, we mostly talked about debate since that&amp;#39;s what we were there for. But I dunno, it just spiraled out from there.&lt;/p&gt;\n\n&lt;p&gt;I get what you&amp;#39;re trying to ask, since whenever I&amp;#39;ve been on &amp;quot;dates&amp;quot; before, I would never really know what to ask, what to say. I would try to implement tips that I hear from my friends or the internet, to limited success. &lt;/p&gt;\n\n&lt;p&gt;Like I said previously, I thought that relationships were ALWAYS bound to be awkward even if there is mutual attraction. The difference with this was that even though we didn&amp;#39;t know each other that well, we just &amp;quot;vibed&amp;quot; so well, ya know? It really doesn&amp;#39;t make sense until you experience it. So much about relationships was hypothetical in my head before this. It is so much different than what I imagined.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Vibing&amp;quot; has nothing to do with the amount of physical attraction between two people, it just happens. Even then, it starts off a bit awkward and intimidating. I remember the first little while with her in person was a bit nervewracking. Only slightly though. &lt;/p&gt;\n\n&lt;p&gt;Both of us were some of the most awkward people (we&amp;#39;re both nerdy af. In fact she was nerdy to the point that she was good enough to be in the top 12 in the Scripps national spelling bee a few years back XD); so don&amp;#39;t think that finding that vibe with someone depends on being the most sociable or outgoing person. It helps, but it&amp;#39;s not necessary. But going forward does take some leaps of faith. At least for me it did. But those leaps of faith were nowhere near as scary as when I took them with other girls in the past.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this was a bit rambly but I hoped I helped ya out a bit. Just ask if anything was a bit vague or something&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcsovb", "score_hidden": false, "stickied": false, "created": 1492416272.0, "created_utc": 1492387472.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcs3rn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AES512", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "That was a nice read. I hope you don't mind me asking some questions.\n\nHow did you start talking? How did it all begin? How were the conversations, how do you know about what to talk?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That was a nice read. I hope you don&amp;#39;t mind me asking some questions.&lt;/p&gt;\n\n&lt;p&gt;How did you start talking? How did it all begin? How were the conversations, how do you know about what to talk?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcs3rn", "score_hidden": false, "stickied": false, "created": 1492415465.0, "created_utc": 1492386665.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgcuce5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Junk-Bot_7", "parent_id": "t1_dgctkms", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "yeah anytime. You may get some advice a bit more useful there, but sometimes the advice isn't exactly stellar.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah anytime. You may get some advice a bit more useful there, but sometimes the advice isn&amp;#39;t exactly stellar.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgcuce5", "score_hidden": false, "stickied": false, "created": 1492418514.0, "created_utc": 1492389714.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctkms", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sgulls", "parent_id": "t1_dgctitl", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Ah, thank you! I knew this wasn't the best sub but I didn't know where else I could go lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, thank you! I knew this wasn&amp;#39;t the best sub but I didn&amp;#39;t know where else I could go lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgctkms", "score_hidden": false, "stickied": false, "created": 1492417464.0, "created_utc": 1492388664.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctitl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Junk-Bot_7", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Not to be rude but you could also post to r/Relationships if you want so (possibly) sound advice", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to be rude but you could also post to &lt;a href=\"/r/Relationships\"&gt;r/Relationships&lt;/a&gt; if you want so (possibly) sound advice&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgctitl", "score_hidden": false, "stickied": false, "created": 1492417400.0, "created_utc": 1492388600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_323oy", "removal_reason": null, "link_id": "t3_65po9o", "likes": null, "replies": "", "user_reports": [], "id": "dgdmt9l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AfroMan98", "parent_id": "t3_65po9o", "subreddit_name_prefixed": "r/CasualConversation", "controversiality": 0, "body": "Check out the song Ivy by frank ocean, i feel like that song would speak to you regarding how you feel", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Check out the song Ivy by frank ocean, i feel like that song would speak to you regarding how you feel&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "CasualConversation", "name": "t1_dgdmt9l", "score_hidden": false, "stickied": false, "created": 1492472182.0, "created_utc": 1492443382.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]