[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "dayz", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s been a while since I felt enough blood loss that my vision was fading in and out like this. I don&amp;#39;t like this feeling.You know, when you&amp;#39;re on the verge of death to the point you feel warm and euphoric. Almost like you&amp;#39;re body is saying it&amp;#39;s time to give up. Problem is I&amp;#39;m not ready for death yet. When I go, it&amp;#39;s going to be on my terms.&lt;/p&gt;\n\n&lt;p&gt;Karma brought me here to this point in my journey. Karma has been paying out quite frequently since the new world order of things. I got greedy and now I&amp;#39;m paying the price. I coughed up blood as I re-positioned myself to look into my bag. Unzipping a first aid kit I stuffed with supplies I pulled out the rubbing alcohol I found and doused my wounds. I&amp;#39;m losing blood fast from these lacerations. Damned wolves. I&amp;#39;m going to have to sew myself shut or I may as well roll over and die now. I pulled out my sewing kit and got to work.&lt;/p&gt;\n\n&lt;p&gt;Those bastards got me good. My shoulder, left arm, and my side were wide open and bruised. It&amp;#39;s a wonder I&amp;#39;m even alive right now to sew my dumb ass up. All this for a tent. Cant really give the gun hoarders shit anymore, because here I am knocking on deaths door over a damned tent. Huge upgrade for me too. Military grade tent with thick canvas to really keep me through the winter. Where does my Karma come in to play you ask? Well, this wasn&amp;#39;t my tent. I stole it from a camp.&lt;/p&gt;\n\n&lt;p&gt;They seemed well enough off that this wont break them. They had at least 20 tents set up. Looked like they were hoarding supplies. Regardless, I stole something from the cover of night and now I&amp;#39;m half dead for it in a farm house. Never been much of a &amp;#39;Universe works and Mysterious Ways&amp;#39; or a &amp;#39;Karma&amp;#39; type of guy, but the world today has people doing bad things to one another. All the bleeding heart &amp;#39;give peace a chance&amp;#39; fools are dead now. So now when someone gets their ass in a jam, you can be sure he did something to deserve it. If I wasn&amp;#39;t paying for stealing this tent now, then I&amp;#39;m paying for killing that man back at the Complex.&lt;/p&gt;\n\n&lt;p&gt;I felt nauseous, but had to get something in me to keep my strength up until I recovered from my blood loss. I pulled out a chicken breast I cooked a few hours earlier and slowly ate it so I didn&amp;#39;t shock my stomach into puking it up. I washed it down with a few mouth fulls of water and a Multi-Vitamin. The wolves were still outside scratching at the door trying to get in. Don&amp;#39;t know how I&amp;#39;m going to get my ass out of this one. If I survive the night I&amp;#39;ll have to figure something out tomorrow. My head is cloudy, now. No way I could think up a decent plan.&lt;/p&gt;\n\n&lt;p&gt;I had a few sticks and some bark in my bag to start a fire with. I set it up in the corner of the room and lit it with a match. I usually use a hand drill, but I collect match boxes for emergency situations. This seems like as good a time as any to use an emergency match. Once I got the fire going I used the rest of my alcohol to douse some cloth I cut into bandages and patched over my freshly sewn wounds. Hopefully this will keep me safe from infection through the night. I pulled my bag closer to the fire to rest my head.&lt;/p&gt;\n\n&lt;p&gt;So here I am. Lonely, bitten, bleeding out, and scared. Surrounded by a pack of wolves; and I&amp;#39;m still not ready to give up and die. I cant. I&amp;#39;m living now for the family I buried over my stupidity. I promised them; and I can&amp;#39;t die yet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's been a while since I felt enough blood loss that my vision was fading in and out like this. I don't like this feeling.You know, when you're on the verge of death to the point you feel warm and euphoric. Almost like you're body is saying it's time to give up. Problem is I'm not ready for death yet. When I go, it's going to be on my terms.\n\nKarma brought me here to this point in my journey. Karma has been paying out quite frequently since the new world order of things. I got greedy and now I'm paying the price. I coughed up blood as I re-positioned myself to look into my bag. Unzipping a first aid kit I stuffed with supplies I pulled out the rubbing alcohol I found and doused my wounds. I'm losing blood fast from these lacerations. Damned wolves. I'm going to have to sew myself shut or I may as well roll over and die now. I pulled out my sewing kit and got to work.\n\nThose bastards got me good. My shoulder, left arm, and my side were wide open and bruised. It's a wonder I'm even alive right now to sew my dumb ass up. All this for a tent. Cant really give the gun hoarders shit anymore, because here I am knocking on deaths door over a damned tent. Huge upgrade for me too. Military grade tent with thick canvas to really keep me through the winter. Where does my Karma come in to play you ask? Well, this wasn't my tent. I stole it from a camp.\n\nThey seemed well enough off that this wont break them. They had at least 20 tents set up. Looked like they were hoarding supplies. Regardless, I stole something from the cover of night and now I'm half dead for it in a farm house. Never been much of a 'Universe works and Mysterious Ways' or a 'Karma' type of guy, but the world today has people doing bad things to one another. All the bleeding heart 'give peace a chance' fools are dead now. So now when someone gets their ass in a jam, you can be sure he did something to deserve it. If I wasn't paying for stealing this tent now, then I'm paying for killing that man back at the Complex.\n\nI felt nauseous, but had to get something in me to keep my strength up until I recovered from my blood loss. I pulled out a chicken breast I cooked a few hours earlier and slowly ate it so I didn't shock my stomach into puking it up. I washed it down with a few mouth fulls of water and a Multi-Vitamin. The wolves were still outside scratching at the door trying to get in. Don't know how I'm going to get my ass out of this one. If I survive the night I'll have to figure something out tomorrow. My head is cloudy, now. No way I could think up a decent plan.\n\nI had a few sticks and some bark in my bag to start a fire with. I set it up in the corner of the room and lit it with a match. I usually use a hand drill, but I collect match boxes for emergency situations. This seems like as good a time as any to use an emergency match. Once I got the fire going I used the rest of my alcohol to douse some cloth I cut into bandages and patched over my freshly sewn wounds. Hopefully this will keep me safe from infection through the night. I pulled my bag closer to the fire to rest my head.\n\nSo here I am. Lonely, bitten, bleeding out, and scared. Surrounded by a pack of wolves; and I'm still not ready to give up and die. I cant. I'm living now for the family I buried over my stupidity. I promised them; and I can't die yet.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "discussion", "id": "6593o0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Bheda", "saved": false, "mod_reports": [], "name": "t3_6593o0", "subreddit_name_prefixed": "r/dayz", "approved_by": null, "over_18": false, "domain": "self.dayz", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2ty3s", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": "user", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/dayz/comments/6593o0/bitten_bleeding_and_scared/", "num_reports": null, "locked": false, "stickied": false, "created": 1492154758.0, "url": "https://www.reddit.com/r/dayz/comments/6593o0/bitten_bleeding_and_scared/", "author_flair_text": "Lohn Wolf", "quarantine": false, "title": "Bitten, Bleeding, and Scared.", "created_utc": 1492125958.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ty3s", "removal_reason": null, "link_id": "t3_6593o0", "likes": null, "replies": "", "user_reports": [], "id": "dg8gi7r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "x7xNeighborx7x", "parent_id": "t3_6593o0", "subreddit_name_prefixed": "r/dayz", "controversiality": 0, "body": "Nice story man, you should be making youtubes with this roleplay imagination. you would do good narrating your actions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice story man, you should be making youtubes with this roleplay imagination. you would do good narrating your actions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "dayz", "name": "t1_dg8gi7r", "score_hidden": false, "stickied": false, "created": 1492157191.0, "created_utc": 1492128391.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]