[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "svenskpolitik", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I Sverige skall genusvetenskapen genomsyra verksamheten på alla universitet och andra offentliga institutioner. Det är därför väldigt anmärkningsvärt att fria medier och övriga institutioner som &lt;em&gt;inte&lt;/em&gt; är en del av staten i väldigt liten utsträckning väljer att förutsättningslöst undersöka vad genusvetenskapen är för någon vetenskap. När man börjar gräva står det nämligen klart att genusvetenskapen bygger varken på empiri eller logisk härledning, det är snarare en överbyggnad på en ideologi än vetenskap. Genusvetenskap skall alltså inte sammanblandas med feminism eller jämställdhet. Det finns ingen motsättning mellan att förespråka jämställdhet och att förkasta det pseudovetenskapliga forskningsfältet genusvetenskap, snarare tvärtom.&lt;/p&gt;\n\n&lt;p&gt;I Norge visades för några år sedan en mycket uppmärksammad dokumentär kallad &amp;quot;Hjernevask&amp;quot; om genusvetenskap på tv. Resultatet av dokumentären blev att anslagen till genusvetenskap i Norge krymptes kraftigt. Den svenska psykiatern David Eberhard och journalisten Erik Högstadius har föreslagit att göra ett liknande program för SVT, men de har blivit nobbade. Komikern Aron Flam, som har fått rättigheterna till det norska programmet, har även undersökt om SVT vore intresserade av att sända den norska versionen av programmet, men SVT var inte intresserade av detta heller.&lt;/p&gt;\n\n&lt;p&gt;Ingen kan kräva att SVT skall sända något program. Dock så är det svenska medborgares licensavgifter som bekostar SVT, dessutom står det säkert något i SR:s stadgar om att de skall arbeta normkritiskt. Kunde det finnas något mer normkritiskt än att sända en dokumentär som förde fram kritik mot den vetenskapliga teori som skall genomsyra all statlig verksamhet?&lt;/p&gt;\n\n&lt;p&gt;Hur skall man skapa momentum för ett sådant krav? Om tillräckligt många människor &lt;em&gt;på ett civiliserat sätt&lt;/em&gt; framför önskningen att SVT skall bekosta en nyinspelning av Hjernevask, fast för svenska förhållanden, så hade folkstormen blivit en nyhet i sig själv. När det blir en tillräckligt stor nyhet så måste de stora medieaktörerna rapportera om det för att inte upplevas som akterseglade av alternativa media (det finns bra alternativa medier, och det finns dåliga). Det kan skapa en positiv spiral som i slutändan leder till att genusvetenskapen synas på samma premisser som andra vetenskaper.&lt;/p&gt;\n\n&lt;p&gt;Inspiration till detta inlägg: &lt;a href=\"https://soundcloud.com/aronflam/aron-flam-s-dekonstruktiv-kritik-666-david-eberhard-konsmaktsordningen\"&gt;https://soundcloud.com/aronflam/aron-flam-s-dekonstruktiv-kritik-666-david-eberhard-konsmaktsordningen&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Hjernevask: &lt;a href=\"https://www.youtube.com/watch?v=E577jhf25t4&amp;amp;list=PLd9_g7lAICxtlGbxh4_z8ik178o8CDPnv\"&gt;https://www.youtube.com/watch?v=E577jhf25t4&amp;amp;list=PLd9_g7lAICxtlGbxh4_z8ik178o8CDPnv&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I Sverige skall genusvetenskapen genomsyra verksamheten på alla universitet och andra offentliga institutioner. Det är därför väldigt anmärkningsvärt att fria medier och övriga institutioner som *inte* är en del av staten i väldigt liten utsträckning väljer att förutsättningslöst undersöka vad genusvetenskapen är för någon vetenskap. När man börjar gräva står det nämligen klart att genusvetenskapen bygger varken på empiri eller logisk härledning, det är snarare en överbyggnad på en ideologi än vetenskap. Genusvetenskap skall alltså inte sammanblandas med feminism eller jämställdhet. Det finns ingen motsättning mellan att förespråka jämställdhet och att förkasta det pseudovetenskapliga forskningsfältet genusvetenskap, snarare tvärtom.\n\nI Norge visades för några år sedan en mycket uppmärksammad dokumentär kallad \"Hjernevask\" om genusvetenskap på tv. Resultatet av dokumentären blev att anslagen till genusvetenskap i Norge krymptes kraftigt. Den svenska psykiatern David Eberhard och journalisten Erik Högstadius har föreslagit att göra ett liknande program för SVT, men de har blivit nobbade. Komikern Aron Flam, som har fått rättigheterna till det norska programmet, har även undersökt om SVT vore intresserade av att sända den norska versionen av programmet, men SVT var inte intresserade av detta heller.\n\nIngen kan kräva att SVT skall sända något program. Dock så är det svenska medborgares licensavgifter som bekostar SVT, dessutom står det säkert något i SR:s stadgar om att de skall arbeta normkritiskt. Kunde det finnas något mer normkritiskt än att sända en dokumentär som förde fram kritik mot den vetenskapliga teori som skall genomsyra all statlig verksamhet?\n\nHur skall man skapa momentum för ett sådant krav? Om tillräckligt många människor *på ett civiliserat sätt* framför önskningen att SVT skall bekosta en nyinspelning av Hjernevask, fast för svenska förhållanden, så hade folkstormen blivit en nyhet i sig själv. När det blir en tillräckligt stor nyhet så måste de stora medieaktörerna rapportera om det för att inte upplevas som akterseglade av alternativa media (det finns bra alternativa medier, och det finns dåliga). Det kan skapa en positiv spiral som i slutändan leder till att genusvetenskapen synas på samma premisser som andra vetenskaper.\n\nInspiration till detta inlägg: https://soundcloud.com/aronflam/aron-flam-s-dekonstruktiv-kritik-666-david-eberhard-konsmaktsordningen\n\nHjernevask: https://www.youtube.com/watch?v=E577jhf25t4&amp;list=PLd9_g7lAICxtlGbxh4_z8ik178o8CDPnv\n", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65rqzo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 117, "report_reasons": null, "author": "madamswadam", "saved": false, "mod_reports": [], "name": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "approved_by": null, "over_18": false, "domain": "self.svenskpolitik", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/P5l_79GvcjElZ60UPVbhFudLqKRYNLCP6ZSuM-HJCa0.jpg?s=7aa0b186268e0a6d364aac4f30573cf3", "width": 500, "height": 500}, "resolutions": [{"url": "https://i.redditmedia.com/P5l_79GvcjElZ60UPVbhFudLqKRYNLCP6ZSuM-HJCa0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=4a1894336dffc4555674f65e28780a2a", "width": 108, "height": 108}, {"url": "https://i.redditmedia.com/P5l_79GvcjElZ60UPVbhFudLqKRYNLCP6ZSuM-HJCa0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=56320dfa9b06632e2f07ac50ad390db7", "width": 216, "height": 216}, {"url": "https://i.redditmedia.com/P5l_79GvcjElZ60UPVbhFudLqKRYNLCP6ZSuM-HJCa0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=3652cc64f3e8223ccb046ae507f8540d", "width": 320, "height": 320}], "variants": {}, "id": "J-ncHCcf42TeuHNCfUuWtxnYHOS1T2lSjWLsrQS8j-Y"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2twun", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/svenskpolitik/comments/65rqzo/hur_får_man_svt_att_sända_en_svensk_version_av/", "num_reports": null, "locked": false, "stickied": false, "created": 1492409479.0, "url": "https://www.reddit.com/r/svenskpolitik/comments/65rqzo/hur_får_man_svt_att_sända_en_svensk_version_av/", "author_flair_text": null, "quarantine": false, "title": "Hur får man SVT att sända en svensk version av \"Hjernevask\"?", "created_utc": 1492380679.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 30, "visited": false, "subreddit_type": "public", "ups": 117}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgd7j43", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "acathode", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "&gt; Kunde det finnas något mer normkritiskt än att sända en dokumentär som förde fram kritik mot den vetenskapliga teori som skall genomsyra all statlig verksamhet?\n\nDu är medveten om att när en arbetare på UR kom med [förslaget att kanske de skulle testa vara lite normkritiska mot normerna som rådde på UR, speciellt normen om normkritik, blev han mer eller mindre kickad](http://sverigesradio.se/sida/artikel.aspx?programid=1637&amp;artikel=6521602)? :)\n\nInte för att UR och SVT är exakt samma sak - men i mångt och mycket är de två sidor av samma mynt...\n\nAtt SVT skulle sända Hjernevask eller något liknande finns inte på kartan, det ligger helt enkelt inte i linje med den ideologi som gäller på redaktionerna där... speciellt inte de som har hand om vetenskap osv... SVTs \"Vetenskapens Värld\" sände för fan ett program där de påstod att kvinnor var mindre än män eftersom de var förtryckta och fått mindre mat, och därför evolutionärt anpassat sig... bl.a. anförde man som bevis för denna tes att det egentligen borde vara kvinnorna som är störst, för de föder barn, och inom vissa andra däggdjursarter så var honorna större än hanarna, exempelvis var blåvalshonor större än blåvalshanar! (Det krävs ju inte så mycket biologiskt kunskap för att inse hur jävla vilse ett sånt argument är... men sen visade det ju sig också att programmet var producerat av en genusvetare, något som man praktiskt nog \"glömde av\" att berätta för tittarna).\n\nProgrammet var såpass illa att flera svenska professorer gick ut och väldigt starkt fördömde programmet - \"Så dumt så man inte tror det är sant\", \"Trams\", ”Befängt”, osv. - [Forskarstrid om kvinnors längd](http://www.svt.se/nyheter/vetenskap/trams-enligt-svensk-evolutionsbiolog).\n\nEtt program som Hjerjevask skulle dessutom leda till väldigt högljudda protester från intressegrupper och div. genusvetare - det är väldigt tveksamt om de ens skulle lyckas få någon genusvetare att ställa upp, de är vid det här laget fullt medvetna om att om allmänheten faktiskt råkar få närmare inblick i vad de egentligen producerar för sorts \"forskning\" så skulle det ta hus i helvete (enligt dem så är allmänheten helt enkelt för dum för att förstå deras forskning och skulle \"tolka den fel\"...). \n\nJag menar den otvättade pöbeln skulle ju kunna börja fundera om det inte är dags att dra in anslagen för den svenska genusforskningen också, om de får reda på att man kan [doktorera i genus genom att sitta på en tågstation och notera hur rasistisk/misogyn en man är eftersom han ber om ursäkt och inte kan hjälpa en rumänsk tiggarkvinna på en perrong eftersom han 'måste gå på muggen'](http://www.gp.se/susanna-mannelin-ursp%C3%A5rad-genusvetenskap-1.108751?).\n\nDet finns idag mer eller mindre en liten industri av genusakademiker och div. feministiska organisationer som lever på denna sortens strunt, som har väldigt bra kontakter till både media och politiker. \n\nDe är fullt medvetna vilken skada undersökande journalistik har orsakat - Hjernevask körde anseendet för genusvetenskap i botten i Norge, och några år innan så slog Dokument Inifråns program \"Könskriget\" undan benen för den svenska feminismen genom att visa vilka sorters tokstollar som faktiskt satt som t.ex. ordförande i ROKS. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Kunde det finnas något mer normkritiskt än att sända en dokumentär som förde fram kritik mot den vetenskapliga teori som skall genomsyra all statlig verksamhet?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Du är medveten om att när en arbetare på UR kom med &lt;a href=\"http://sverigesradio.se/sida/artikel.aspx?programid=1637&amp;amp;artikel=6521602\"&gt;förslaget att kanske de skulle testa vara lite normkritiska mot normerna som rådde på UR, speciellt normen om normkritik, blev han mer eller mindre kickad&lt;/a&gt;? :)&lt;/p&gt;\n\n&lt;p&gt;Inte för att UR och SVT är exakt samma sak - men i mångt och mycket är de två sidor av samma mynt...&lt;/p&gt;\n\n&lt;p&gt;Att SVT skulle sända Hjernevask eller något liknande finns inte på kartan, det ligger helt enkelt inte i linje med den ideologi som gäller på redaktionerna där... speciellt inte de som har hand om vetenskap osv... SVTs &amp;quot;Vetenskapens Värld&amp;quot; sände för fan ett program där de påstod att kvinnor var mindre än män eftersom de var förtryckta och fått mindre mat, och därför evolutionärt anpassat sig... bl.a. anförde man som bevis för denna tes att det egentligen borde vara kvinnorna som är störst, för de föder barn, och inom vissa andra däggdjursarter så var honorna större än hanarna, exempelvis var blåvalshonor större än blåvalshanar! (Det krävs ju inte så mycket biologiskt kunskap för att inse hur jävla vilse ett sånt argument är... men sen visade det ju sig också att programmet var producerat av en genusvetare, något som man praktiskt nog &amp;quot;glömde av&amp;quot; att berätta för tittarna).&lt;/p&gt;\n\n&lt;p&gt;Programmet var såpass illa att flera svenska professorer gick ut och väldigt starkt fördömde programmet - &amp;quot;Så dumt så man inte tror det är sant&amp;quot;, &amp;quot;Trams&amp;quot;, ”Befängt”, osv. - &lt;a href=\"http://www.svt.se/nyheter/vetenskap/trams-enligt-svensk-evolutionsbiolog\"&gt;Forskarstrid om kvinnors längd&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Ett program som Hjerjevask skulle dessutom leda till väldigt högljudda protester från intressegrupper och div. genusvetare - det är väldigt tveksamt om de ens skulle lyckas få någon genusvetare att ställa upp, de är vid det här laget fullt medvetna om att om allmänheten faktiskt råkar få närmare inblick i vad de egentligen producerar för sorts &amp;quot;forskning&amp;quot; så skulle det ta hus i helvete (enligt dem så är allmänheten helt enkelt för dum för att förstå deras forskning och skulle &amp;quot;tolka den fel&amp;quot;...). &lt;/p&gt;\n\n&lt;p&gt;Jag menar den otvättade pöbeln skulle ju kunna börja fundera om det inte är dags att dra in anslagen för den svenska genusforskningen också, om de får reda på att man kan &lt;a href=\"http://www.gp.se/susanna-mannelin-ursp%C3%A5rad-genusvetenskap-1.108751?\"&gt;doktorera i genus genom att sitta på en tågstation och notera hur rasistisk/misogyn en man är eftersom han ber om ursäkt och inte kan hjälpa en rumänsk tiggarkvinna på en perrong eftersom han &amp;#39;måste gå på muggen&amp;#39;&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Det finns idag mer eller mindre en liten industri av genusakademiker och div. feministiska organisationer som lever på denna sortens strunt, som har väldigt bra kontakter till både media och politiker. &lt;/p&gt;\n\n&lt;p&gt;De är fullt medvetna vilken skada undersökande journalistik har orsakat - Hjernevask körde anseendet för genusvetenskap i botten i Norge, och några år innan så slog Dokument Inifråns program &amp;quot;Könskriget&amp;quot; undan benen för den svenska feminismen genom att visa vilka sorters tokstollar som faktiskt satt som t.ex. ordförande i ROKS. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgd7j43", "score_hidden": false, "stickied": false, "created": 1492439429.0, "created_utc": 1492410629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dge11um", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Rygerts", "parent_id": "t1_dgdz8q6", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Grunda, gå med i eller ge stöd till organisationer som direkt eller indirekt kan påverka SVT. Du kan prenumerera på tidsskrifter som skriver artiklar som du tycker påverkar debatten i en positiv riktning. Ge pengar till tankesmedjor som lobbar för en mediapolitik som du kan ställa dig bakom. Aktivera dig politiskt, demonstrera, skriv insändare, bli aktiv inom facket, blogga, gör en podcast. Hitta något som passar dig och satsa på det helt enkelt.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Grunda, gå med i eller ge stöd till organisationer som direkt eller indirekt kan påverka SVT. Du kan prenumerera på tidsskrifter som skriver artiklar som du tycker påverkar debatten i en positiv riktning. Ge pengar till tankesmedjor som lobbar för en mediapolitik som du kan ställa dig bakom. Aktivera dig politiskt, demonstrera, skriv insändare, bli aktiv inom facket, blogga, gör en podcast. Hitta något som passar dig och satsa på det helt enkelt.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dge11um", "score_hidden": false, "stickied": false, "created": 1492488164.0, "created_utc": 1492459364.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdz8q6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MauseRR", "parent_id": "t1_dgd788m", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Hur står man upp? Betalar inte TV-avgift längre då jag sålde min TV", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hur står man upp? Betalar inte TV-avgift längre då jag sålde min TV&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdz8q6", "score_hidden": false, "stickied": false, "created": 1492486128.0, "created_utc": 1492457328.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd788m", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Rygerts", "parent_id": "t1_dgcv3rq", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Du har rätt i att SVT är en trög monolit som är för pretentiös och självgod för sitt eget bästa, men om förändring ska ske måste folk säga ifrån. Ta historiska protester som exempel, Ghandi hade det brittiska imperiet mot sig. Nelson Mandela satt 27 år i fängelse och terrorstämplades av USA men blev president när han släpptes fri. Rosa Parks' fredliga protest mot segregation på bussar var en milstolpe i kampen mot rasism i USA. Att ändra på SVT är en barnlek i jämförelse. \n\nSå länge folk står upp för det som är rätt och kräver att SVT på ett bättre sätt reflekterar folkets vilja går det åt rätt håll. ", "edited": 1492450626.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Du har rätt i att SVT är en trög monolit som är för pretentiös och självgod för sitt eget bästa, men om förändring ska ske måste folk säga ifrån. Ta historiska protester som exempel, Ghandi hade det brittiska imperiet mot sig. Nelson Mandela satt 27 år i fängelse och terrorstämplades av USA men blev president när han släpptes fri. Rosa Parks&amp;#39; fredliga protest mot segregation på bussar var en milstolpe i kampen mot rasism i USA. Att ändra på SVT är en barnlek i jämförelse. &lt;/p&gt;\n\n&lt;p&gt;Så länge folk står upp för det som är rätt och kräver att SVT på ett bättre sätt reflekterar folkets vilja går det åt rätt håll. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgd788m", "score_hidden": false, "stickied": false, "created": 1492438759.0, "created_utc": 1492409959.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv3rq", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "MauseRR", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Hörde programmet, såg serien och blev inte besviken. Alltid kul att se akademiker få sina bubblor spräckta av internationella experter.\n\nTror inte man kan påverka SVT att göra en sådan serie, för mycket står på spel, för många skulle få skämmas och bli av med jobbet. Det man kan försöka göra är väl att skriva en arg lapp på deras facebooksida eller via något formulär", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hörde programmet, såg serien och blev inte besviken. Alltid kul att se akademiker få sina bubblor spräckta av internationella experter.&lt;/p&gt;\n\n&lt;p&gt;Tror inte man kan påverka SVT att göra en sådan serie, för mycket står på spel, för många skulle få skämmas och bli av med jobbet. Det man kan försöka göra är väl att skriva en arg lapp på deras facebooksida eller via något formulär&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgcv3rq", "score_hidden": false, "stickied": false, "created": 1492419526.0, "created_utc": 1492390726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgd5ksl", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "leftoversn", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Såg serien för något år sedan och tyckte den var väldigt sevärd. Inte för att jag håller med om allt men för att den faktiskt försöker neutralt undersöka saker utan förutfattade meningar. Detta ledde till att de så kallade genusexperterna ställdes mot väggen med frågor som de inte är vana att få.\n\nDet är synd att den inte göras tillgänglig på till exempel SVT. Kanske är den för kontroversiell för deras agenda. Kanske är titeln för aggressiv. Men tekniskt sett är titeln väldigt passande, då det belyser hur många saker tagits som fakta just pga hjärntvätt.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Såg serien för något år sedan och tyckte den var väldigt sevärd. Inte för att jag håller med om allt men för att den faktiskt försöker neutralt undersöka saker utan förutfattade meningar. Detta ledde till att de så kallade genusexperterna ställdes mot väggen med frågor som de inte är vana att få.&lt;/p&gt;\n\n&lt;p&gt;Det är synd att den inte göras tillgänglig på till exempel SVT. Kanske är den för kontroversiell för deras agenda. Kanske är titeln för aggressiv. Men tekniskt sett är titeln väldigt passande, då det belyser hur många saker tagits som fakta just pga hjärntvätt.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgd5ksl", "score_hidden": false, "stickied": false, "created": 1492435269.0, "created_utc": 1492406469.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgdtnpf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Zyxos2", "parent_id": "t1_dgda6az", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Det är bara att fortsätta skriva, de har egentligen en skyldighet att visa det som folket vill se.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Det är bara att fortsätta skriva, de har egentligen en skyldighet att visa det som folket vill se.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdtnpf", "score_hidden": false, "stickied": false, "created": 1492479848.0, "created_utc": 1492451048.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda6az", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "orientalis", "parent_id": "t1_dgd86ha", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Jag gjorde en likadan tråd som denna för ett år sen på /r/sweden och skrev sen till SVT tittarservice. Det slutade med att dom skrev att dom just nu inte hade några planer på att visa den. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jag gjorde en likadan tråd som denna för ett år sen på &lt;a href=\"/r/sweden\"&gt;/r/sweden&lt;/a&gt; och skrev sen till SVT tittarservice. Det slutade med att dom skrev att dom just nu inte hade några planer på att visa den. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgda6az", "score_hidden": false, "stickied": false, "created": 1492446702.0, "created_utc": 1492417902.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd86ha", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "cismannen", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Man kan börjar med att ställa frågan till [SVT tittarservice](https://kundo.se/org/svt-tittarservice/posts/synpunkter/?&amp;filters=sort:comments)\n\n\nLänkar tillbaka hit så vi alla kan skratta.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man kan börjar med att ställa frågan till &lt;a href=\"https://kundo.se/org/svt-tittarservice/posts/synpunkter/?&amp;amp;filters=sort:comments\"&gt;SVT tittarservice&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Länkar tillbaka hit så vi alla kan skratta.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgd86ha", "score_hidden": false, "stickied": false, "created": 1492440964.0, "created_utc": 1492412164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgdab3r", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "BainthaBrakk", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Finns väl ingen anledning att göra en ny version av Hjernevask. Den duger ju utmärkt att sändas som den är. Men som sagt tidigare, det lär aldrig hända. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Finns väl ingen anledning att göra en ny version av Hjernevask. Den duger ju utmärkt att sändas som den är. Men som sagt tidigare, det lär aldrig hända. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdab3r", "score_hidden": false, "stickied": false, "created": 1492447155.0, "created_utc": 1492418355.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgda5u6", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "madamswadam", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Uppdatering: Alltså jag är medveten om att det i dagsläget är nästan omöjligt att få SVT att sända en dokumentär som granskar genusvetenskapen kritiskt. Poängen är att om man kan skapa medial uppmärksamhet kring en kampanj för att de ska göra det så kommer det att exponera deras hyckleri och få fler människor att tänka till. Åsiktsklimatet i Sverige kan ju som bekant svänga ganska fort, när tillräckligt många vågar ifrågasätta någonting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uppdatering: Alltså jag är medveten om att det i dagsläget är nästan omöjligt att få SVT att sända en dokumentär som granskar genusvetenskapen kritiskt. Poängen är att om man kan skapa medial uppmärksamhet kring en kampanj för att de ska göra det så kommer det att exponera deras hyckleri och få fler människor att tänka till. Åsiktsklimatet i Sverige kan ju som bekant svänga ganska fort, när tillräckligt många vågar ifrågasätta någonting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgda5u6", "score_hidden": false, "stickied": false, "created": 1492446658.0, "created_utc": 1492417858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgdavh5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "analsexpert", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Byt ut hela lednignen så ska det nog gå bra!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Byt ut hela lednignen så ska det nog gå bra!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdavh5", "score_hidden": false, "stickied": false, "created": 1492449143.0, "created_utc": 1492420343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgdl0zs", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "madamswadam", "parent_id": "t1_dgdjnz4", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Jag tycker att följande exempel, från Germund Hesslow, Lunds universitet rymmer både orimliga försök till karaktärsmord och krav på avsked. Håller du med?\n\n&gt; Den 19 februari publicerade jag på DN debatt en artikel som argumenterade emot vissa vanliga antaganden i debatten om feminismen. Artikeln och några efterföljande föredrag väckte ganska stor uppmärksamhet, men inte så mycket egentlig debatt i sakfrågan.  Ganska många inlägg har publicerats på olika bloggsidor på internet. Att några personer skulle tycka annorlunda var väntat, men jag är förvånad över att så få har försökt argumentera i sakfrågan och att så många finner det lämpligt att använda internet till att offentligt framföra invektiv och rent personliga påhopp. Någon som heter  Helena Bergman tycker att jag är ”ett jävla arsle” och ”vill ställa upp Hesslow mot en vägg och skjuta honom”. Av inlägget framgår också att en lärare vid Malmö högskola uppmanat studenter att bojkotta en föreläsning jag nyligen höll där. En journalist vid namn Pierre Andersson, på sidan obunden.se, menar att jag är ”en av alla dessa reaktionära 'gubbar' som inte vill något annat än att behålla sin priviligerade ställning.”  (Jag måste dock tillägga att jag tidigare på den här sidan orättvist har tillskrivit bloggaren LouiseP ett uttalande som hon inte ställt sig bakom.)\n \n&gt; En person som rimligen borde veta bättre, Ann Numhauser-Henning, anser det vara förenligt med sitt uppdrag som prorektor vid Lunds universitet, att offentligt sympatisera med studenter som vill stänga av mig från akademisk undervisning (Sydsvenska Dagbladet 05-05-02). Min replik finns här.\n\n(...)\n\n&gt; Docenten i evolutionsbiologi här i Lund, Erik Svensson, har på websidan obunden.se har författat en replik på min artikel. Sidan är sedan en tid otillgänglig, men jag har lyckligtvis räddat Svenssons text åt eftervärlden och har inte kunnat avhålla mig från en kort kommentar. Erik Svensson tycks vara besatt av min person och har senare återkommit med ett antal alltmer bisarra och personliga påhopp som jag nog inte behöver kommentera. De talar tydligt för sig själva. \n\n(Från http://www.hesslow.com/germund/, -&gt; Non-academic)", "edited": 1492442219.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jag tycker att följande exempel, från Germund Hesslow, Lunds universitet rymmer både orimliga försök till karaktärsmord och krav på avsked. Håller du med?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Den 19 februari publicerade jag på DN debatt en artikel som argumenterade emot vissa vanliga antaganden i debatten om feminismen. Artikeln och några efterföljande föredrag väckte ganska stor uppmärksamhet, men inte så mycket egentlig debatt i sakfrågan.  Ganska många inlägg har publicerats på olika bloggsidor på internet. Att några personer skulle tycka annorlunda var väntat, men jag är förvånad över att så få har försökt argumentera i sakfrågan och att så många finner det lämpligt att använda internet till att offentligt framföra invektiv och rent personliga påhopp. Någon som heter  Helena Bergman tycker att jag är ”ett jävla arsle” och ”vill ställa upp Hesslow mot en vägg och skjuta honom”. Av inlägget framgår också att en lärare vid Malmö högskola uppmanat studenter att bojkotta en föreläsning jag nyligen höll där. En journalist vid namn Pierre Andersson, på sidan obunden.se, menar att jag är ”en av alla dessa reaktionära &amp;#39;gubbar&amp;#39; som inte vill något annat än att behålla sin priviligerade ställning.”  (Jag måste dock tillägga att jag tidigare på den här sidan orättvist har tillskrivit bloggaren LouiseP ett uttalande som hon inte ställt sig bakom.)&lt;/p&gt;\n\n&lt;p&gt;En person som rimligen borde veta bättre, Ann Numhauser-Henning, anser det vara förenligt med sitt uppdrag som prorektor vid Lunds universitet, att offentligt sympatisera med studenter som vill stänga av mig från akademisk undervisning (Sydsvenska Dagbladet 05-05-02). Min replik finns här.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;(...)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Docenten i evolutionsbiologi här i Lund, Erik Svensson, har på websidan obunden.se har författat en replik på min artikel. Sidan är sedan en tid otillgänglig, men jag har lyckligtvis räddat Svenssons text åt eftervärlden och har inte kunnat avhålla mig från en kort kommentar. Erik Svensson tycks vara besatt av min person och har senare återkommit med ett antal alltmer bisarra och personliga påhopp som jag nog inte behöver kommentera. De talar tydligt för sig själva. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;(Från &lt;a href=\"http://www.hesslow.com/germund/\"&gt;http://www.hesslow.com/germund/&lt;/a&gt;, -&amp;gt; Non-academic)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdl0zs", "score_hidden": false, "stickied": false, "created": 1492470041.0, "created_utc": 1492441241.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgdq9sy", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "bjourne2", "parent_id": "t1_dgdn0gh", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Fast Pär Ström är ingen forskare. Det är sant att debattörer på internet (Pär Ström bloggade mestadels) går hårt åt varandra. Per Ström har kallats för medelålders vit kränkt man, ful snuskgubbe och mycket annat. Men det är skillnad på det och det du skriver \"helt orimliga försök till karaktärsmord och krav på avsked.\"\n\nJag kan dessutom, utan problem, länka till ett dussintal artiklar där genusvetenskapen kritiseras. De som har skrivit de artiklarna har inte drabbats av någon förföljelse. Du målar upp bilden av ett åsiktsförtryck av oliktänkande i Sverige som inte stämmer överens med verkligheten. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fast Pär Ström är ingen forskare. Det är sant att debattörer på internet (Pär Ström bloggade mestadels) går hårt åt varandra. Per Ström har kallats för medelålders vit kränkt man, ful snuskgubbe och mycket annat. Men det är skillnad på det och det du skriver &amp;quot;helt orimliga försök till karaktärsmord och krav på avsked.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Jag kan dessutom, utan problem, länka till ett dussintal artiklar där genusvetenskapen kritiseras. De som har skrivit de artiklarna har inte drabbats av någon förföljelse. Du målar upp bilden av ett åsiktsförtryck av oliktänkande i Sverige som inte stämmer överens med verkligheten. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdq9sy", "score_hidden": false, "stickied": false, "created": 1492476097.0, "created_utc": 1492447297.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdn0gh", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "madamswadam", "parent_id": "t1_dgdjnz4", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Och även om jag tycker att Pär Ström kanske var lite för ömhudad för att ge sig in i genusdebatten till att börja med så får man väl säga att han har utsatts för en ansenlig mängd orimliga försök till karaktärsmord?\nJag tycker inte att Ström var någon föredömlig förespråkare av jämställdhet, men han debatterade oftast sakligt och fick mängder med personangrepp tillbaks.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Och även om jag tycker att Pär Ström kanske var lite för ömhudad för att ge sig in i genusdebatten till att börja med så får man väl säga att han har utsatts för en ansenlig mängd orimliga försök till karaktärsmord?\nJag tycker inte att Ström var någon föredömlig förespråkare av jämställdhet, men han debatterade oftast sakligt och fick mängder med personangrepp tillbaks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdn0gh", "score_hidden": false, "stickied": false, "created": 1492472414.0, "created_utc": 1492443614.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgennuj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madamswadam", "parent_id": "t1_dge8pqs", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Det är lite oklart vad du är ute efter, mer än att nagelfara mitt påstående om de få forskare jag känner till (ja, alla forskare jag känner till som gör detta). Som sagt så tycker jag att de exempel jag tagit upp är bra bevis på vad jag menade, men det är en subjektiv bedömning som står för mig. Och det finns mer belägg i tidningsarkiv etc för den som vill gräva ned sig i detta. Men det är fortfarande en subjektiv bedömning.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Det är lite oklart vad du är ute efter, mer än att nagelfara mitt påstående om de få forskare jag känner till (ja, alla forskare jag känner till som gör detta). Som sagt så tycker jag att de exempel jag tagit upp är bra bevis på vad jag menade, men det är en subjektiv bedömning som står för mig. Och det finns mer belägg i tidningsarkiv etc för den som vill gräva ned sig i detta. Men det är fortfarande en subjektiv bedömning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgennuj", "score_hidden": true, "stickied": false, "created": 1492516220.0, "created_utc": 1492487420.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8pqs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bjourne2", "parent_id": "t1_dge3cpz", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "&gt; Jag tror inte vi kommer någon vart, fast jag tycker att det börjar bli roligt så jag skriver ett svar till.\n\nJag förstår att det är svårt att medge att man har fel ibland. \n\n&gt; &gt; De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte 'får' kritisera.\n\n&gt; Läs mitt påstående igen. Var har jag påstått att rätten är kraftigt begränsad Vad indikerar det när jag sätter citationstecken kring 'får' ?\n\nDet följer av påståendet att de som kritiserar genusvetenskap får utstå orimliga repressalier. Begränsningen består i vetskapen om de påstådda otrevliga påföljderna för nyttjandet av rätten. Du skrev faktiskt det om *alla* forskare som du känner till som kritiserar genusvetenskap.\n\n&gt; Jag tycker att Germund Hesslow och Annica Dahlberg är bra exempel. \n\nFast det är de inte eftersom de varken blivit utsatta för karaktärsmord eller orimliga avskedskrav. Och båda är fortfarande aktiva vid sina institutioner osv. \n\n&gt; Gissningsvis kommer du nu, istället för att försöka göra en rimlig tolkning av min text och skriva ett svar på den centrala tesen i det jag skrivit, återigen göra en illvillig tolkning och bemöta argument jag inte ens framfört. Men bring it on ;)\n\nNej tack. Jag kan bara säga att i internetdebatter är det bara dumt att överdriva för ens poäng kan gå förlorad om ens överdrift blir avslöjad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Jag tror inte vi kommer någon vart, fast jag tycker att det börjar bli roligt så jag skriver ett svar till.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Jag förstår att det är svårt att medge att man har fel ibland. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;blockquote&gt;\n&lt;p&gt;De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte &amp;#39;får&amp;#39; kritisera.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Läs mitt påstående igen. Var har jag påstått att rätten är kraftigt begränsad Vad indikerar det när jag sätter citationstecken kring &amp;#39;får&amp;#39; ?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Det följer av påståendet att de som kritiserar genusvetenskap får utstå orimliga repressalier. Begränsningen består i vetskapen om de påstådda otrevliga påföljderna för nyttjandet av rätten. Du skrev faktiskt det om &lt;em&gt;alla&lt;/em&gt; forskare som du känner till som kritiserar genusvetenskap.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Jag tycker att Germund Hesslow och Annica Dahlberg är bra exempel. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Fast det är de inte eftersom de varken blivit utsatta för karaktärsmord eller orimliga avskedskrav. Och båda är fortfarande aktiva vid sina institutioner osv. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Gissningsvis kommer du nu, istället för att försöka göra en rimlig tolkning av min text och skriva ett svar på den centrala tesen i det jag skrivit, återigen göra en illvillig tolkning och bemöta argument jag inte ens framfört. Men bring it on ;)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nej tack. Jag kan bara säga att i internetdebatter är det bara dumt att överdriva för ens poäng kan gå förlorad om ens överdrift blir avslöjad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dge8pqs", "score_hidden": true, "stickied": false, "created": 1492497267.0, "created_utc": 1492468467.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge3cpz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "madamswadam", "parent_id": "t1_dgdy6yb", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Jag tror inte vi kommer någon vart, fast jag tycker att det börjar bli roligt så jag skriver ett svar till. Det är lite svårt att se för alla halmdockor bara.\n\n&gt; Den här deltråden handlar om rätten för forskare i Sverige att kritisera genusvetenskap. Du påstod att den rätten var starkt begränsad:\n&gt;&gt; De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte 'får' kritisera.\n\nLäs mitt påstående igen. Var har jag påstått att rätten är kraftigt begränsad? Vad indikerar det när jag sätter citationstecken kring 'får' ?\n\n&gt;Därefter begärde jag från dig bevis för dessa påståenden. Du har inte presenterat några bevis. Det närmaste du kommer är Germud Hesslow (vilket jag missade) och prorektor Ann Numhauser-Henning som \"förstår\" en students upprördhet och menar att hon inte kan ingripa mot en professor. Det är inte ett bevis på ett orimligt försök till karaktärsmord eller (orimligt) krav på avsked.\n\nJag tycker att Germund Hesslow och Annica Dahlberg är bra exempel. Om jag börjar ett påstående med 'de *få* forskare *jag känner till*' så är det lite förmätet av dig att förvänta sig att jag skall kunna verifiera alla detaljer kring vad de har varit med om med hänvisning till tredjepartskällor. Om du inte håller med så får vi nog agree to disagree.\n\n&gt;Samtidigt har jag erbjudit mig att visa att massor med forskare har kritiserat genusvetenskap utan att bli karaktärsmördade för det.\n\nMed tanke på att du mest hänger upp dig på mitt uttalande om 'de få forskare jag känner till' så är det lite otippat att du plötsligt vill lyfta blicken och tala i generella termer. Förslagsvis startar du en egen tråd om detta ämne, så kan du räkna upp dessa forskare.\n\n&gt; Du får tycka att det här är en tangent, vilket jag håller med om. Att det är oväsentligt, vilket jag absolut inte håller med om. \n\nVar har jag skrivit att det är oväsentligt? Off-topic betyder inte oväsentligt.\n\n&gt; Det finns massor med folk som sitter i stugorna och tror att svenska forskare inte vågar skriva vad de vet av rädsla för repressalier. Det är inte sant och det är oroväckande att den bilden sprids.\n\nDet här var ju också helt irrelevant för vad vi diskuterade.\n\nGissningsvis kommer du nu, istället för att försöka göra en rimlig tolkning av min text och skriva ett svar på den centrala tesen i det jag skrivit, återigen göra en illvillig tolkning och bemöta argument jag inte ens framfört. Men bring it on ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jag tror inte vi kommer någon vart, fast jag tycker att det börjar bli roligt så jag skriver ett svar till. Det är lite svårt att se för alla halmdockor bara.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Den här deltråden handlar om rätten för forskare i Sverige att kritisera genusvetenskap. Du påstod att den rätten var starkt begränsad:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte &amp;#39;får&amp;#39; kritisera.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Läs mitt påstående igen. Var har jag påstått att rätten är kraftigt begränsad? Vad indikerar det när jag sätter citationstecken kring &amp;#39;får&amp;#39; ?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Därefter begärde jag från dig bevis för dessa påståenden. Du har inte presenterat några bevis. Det närmaste du kommer är Germud Hesslow (vilket jag missade) och prorektor Ann Numhauser-Henning som &amp;quot;förstår&amp;quot; en students upprördhet och menar att hon inte kan ingripa mot en professor. Det är inte ett bevis på ett orimligt försök till karaktärsmord eller (orimligt) krav på avsked.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Jag tycker att Germund Hesslow och Annica Dahlberg är bra exempel. Om jag börjar ett påstående med &amp;#39;de &lt;em&gt;få&lt;/em&gt; forskare &lt;em&gt;jag känner till&lt;/em&gt;&amp;#39; så är det lite förmätet av dig att förvänta sig att jag skall kunna verifiera alla detaljer kring vad de har varit med om med hänvisning till tredjepartskällor. Om du inte håller med så får vi nog agree to disagree.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Samtidigt har jag erbjudit mig att visa att massor med forskare har kritiserat genusvetenskap utan att bli karaktärsmördade för det.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Med tanke på att du mest hänger upp dig på mitt uttalande om &amp;#39;de få forskare jag känner till&amp;#39; så är det lite otippat att du plötsligt vill lyfta blicken och tala i generella termer. Förslagsvis startar du en egen tråd om detta ämne, så kan du räkna upp dessa forskare.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Du får tycka att det här är en tangent, vilket jag håller med om. Att det är oväsentligt, vilket jag absolut inte håller med om. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Var har jag skrivit att det är oväsentligt? Off-topic betyder inte oväsentligt.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Det finns massor med folk som sitter i stugorna och tror att svenska forskare inte vågar skriva vad de vet av rädsla för repressalier. Det är inte sant och det är oroväckande att den bilden sprids.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Det här var ju också helt irrelevant för vad vi diskuterade.&lt;/p&gt;\n\n&lt;p&gt;Gissningsvis kommer du nu, istället för att försöka göra en rimlig tolkning av min text och skriva ett svar på den centrala tesen i det jag skrivit, återigen göra en illvillig tolkning och bemöta argument jag inte ens framfört. Men bring it on ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dge3cpz", "score_hidden": false, "stickied": false, "created": 1492490735.0, "created_utc": 1492461935.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy6yb", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "bjourne2", "parent_id": "t1_dgdvnel", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Den här deltråden handlar om rätten för forskare i Sverige att kritisera genusvetenskap. Du påstod att den rätten var starkt begränsad:\n\n&gt; De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte 'får' kritisera. \n\nDärefter begärde jag från dig bevis för dessa påståenden. Du har inte presenterat några bevis. Det närmaste du kommer är Germud Hesslow (vilket jag missade) och prorektor [Ann Numhauser-Henning](http://www.hesslow.com/germund/POPMEDIA/Politik/pdf_filer/Repliktillprorektor.htm) som \"förstår\" en students upprördhet och menar att hon inte kan ingripa mot en professor. Det är inte ett bevis på ett orimligt försök till karaktärsmord eller (orimligt) krav på avsked.\n\nSamtidigt har jag erbjudit mig att visa att massor med forskare har kritiserat genusvetenskap utan att bli karaktärsmördade för det.\n\nDu får tycka att det här är en tangent, vilket jag håller med om. Att det är oväsentligt, vilket jag absolut inte håller med om. Det finns massor med folk som sitter i stugorna och tror att svenska forskare inte vågar skriva vad de vet av rädsla för repressalier. Det är inte sant och det är oroväckande att den bilden sprids.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Den här deltråden handlar om rätten för forskare i Sverige att kritisera genusvetenskap. Du påstod att den rätten var starkt begränsad:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte &amp;#39;får&amp;#39; kritisera. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Därefter begärde jag från dig bevis för dessa påståenden. Du har inte presenterat några bevis. Det närmaste du kommer är Germud Hesslow (vilket jag missade) och prorektor &lt;a href=\"http://www.hesslow.com/germund/POPMEDIA/Politik/pdf_filer/Repliktillprorektor.htm\"&gt;Ann Numhauser-Henning&lt;/a&gt; som &amp;quot;förstår&amp;quot; en students upprördhet och menar att hon inte kan ingripa mot en professor. Det är inte ett bevis på ett orimligt försök till karaktärsmord eller (orimligt) krav på avsked.&lt;/p&gt;\n\n&lt;p&gt;Samtidigt har jag erbjudit mig att visa att massor med forskare har kritiserat genusvetenskap utan att bli karaktärsmördade för det.&lt;/p&gt;\n\n&lt;p&gt;Du får tycka att det här är en tangent, vilket jag håller med om. Att det är oväsentligt, vilket jag absolut inte håller med om. Det finns massor med folk som sitter i stugorna och tror att svenska forskare inte vågar skriva vad de vet av rädsla för repressalier. Det är inte sant och det är oroväckande att den bilden sprids.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdy6yb", "score_hidden": false, "stickied": false, "created": 1492484929.0, "created_utc": 1492456129.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvnel", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "madamswadam", "parent_id": "t1_dgdpkvx", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Jag tycker du verkar oseriös. Jag skall ge svar på dina kommentarer, men låt mig bara först rekapitulera vad den här tråden handlar om:\n\n1. Genusvetenskap ingår i styrdokumenten för mer eller mindre samtliga offentliga myndigheter\n\n2. Det vetenskapliga underlaget för genusvetenskap är betydligt svagare än för de flesta andra vetenskaper\n\n3. Det är anmärkningsvärt att public service inte regelbundet ger mer plats åt seriös kritik av genusvetenskapen, då den förväntas prägla allt från dagisverksamhet till universitetsutbildning.\n\n4. Därför vill jag skapa opinion för att public service ger mer utrymme åt öppen debatt kring genusvetenskapen\n\nDu skrev först \"Att serien skulle utgöra något slags bombsäkert bevis för att feministerna har fel är inte sant\". Jag anser alltså inte det, och har än mindre påstått det. Sedan ber du mig exemplifiera med någon (det vill säga minst en) forskare som utsatts för orimliga försök till karaktärsmord och krav på avsked. Jag ger tre exempel, varav en faller bort för att det inte var en forskare. Av de andra två kunde jag endast anekdotiskt belägga att hon blivit utsatt för orimliga försök till karaktärsmord, däremot har hon avgått till följd av just krav på hennes avgång. Jag medgav alltså redan i mitt inlägg att det var baserat på anekdotisk bevisföring. Hade det här varit huvudfrågan kunde jag ha skrivit till Dahlström och frågat om hon kunde ge några konkreta bevis på orimliga försök till karaktärsmord, men det är som sagt inte det tråden handlar om. Kanske sitter du fortfarande och filar på ett svar angående den andra forskaren, i annat fall så har jag väl givit något exempel på en sådan forskare som verkar i Sverige?\n\nOm jag i ett parallellt universum inte hade kunnat ge exempel på en forskare som blev utsatt för orimliga försök till karaktärsmord eller krav på avgång så hade det alltså inte påverkat huvudfrågan som den här tråden handlar om i vilket fall.\n\nAvslutningsvis kommer några allmänna kommentarer:\n\n&gt; Jag kan dessutom, utan problem, länka till ett dussintal artiklar där genusvetenskapen kritiseras. De som har skrivit de artiklarna har inte drabbats av någon förföljelse. Du målar upp bilden av ett åsiktsförtryck av oliktänkande i Sverige som inte stämmer överens med verkligheten.\n\nJag har aldrig använt ordet åsiktsförtryck.\n\n&gt; Forskare har mer skinn på näsan än vad du tror. \n\nTack för den klappen på huvudet. Jag är nog mer insatt i akademisk forskning (inklusive neurovetenskap) än vad du tror.\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jag tycker du verkar oseriös. Jag skall ge svar på dina kommentarer, men låt mig bara först rekapitulera vad den här tråden handlar om:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Genusvetenskap ingår i styrdokumenten för mer eller mindre samtliga offentliga myndigheter&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Det vetenskapliga underlaget för genusvetenskap är betydligt svagare än för de flesta andra vetenskaper&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Det är anmärkningsvärt att public service inte regelbundet ger mer plats åt seriös kritik av genusvetenskapen, då den förväntas prägla allt från dagisverksamhet till universitetsutbildning.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Därför vill jag skapa opinion för att public service ger mer utrymme åt öppen debatt kring genusvetenskapen&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Du skrev först &amp;quot;Att serien skulle utgöra något slags bombsäkert bevis för att feministerna har fel är inte sant&amp;quot;. Jag anser alltså inte det, och har än mindre påstått det. Sedan ber du mig exemplifiera med någon (det vill säga minst en) forskare som utsatts för orimliga försök till karaktärsmord och krav på avsked. Jag ger tre exempel, varav en faller bort för att det inte var en forskare. Av de andra två kunde jag endast anekdotiskt belägga att hon blivit utsatt för orimliga försök till karaktärsmord, däremot har hon avgått till följd av just krav på hennes avgång. Jag medgav alltså redan i mitt inlägg att det var baserat på anekdotisk bevisföring. Hade det här varit huvudfrågan kunde jag ha skrivit till Dahlström och frågat om hon kunde ge några konkreta bevis på orimliga försök till karaktärsmord, men det är som sagt inte det tråden handlar om. Kanske sitter du fortfarande och filar på ett svar angående den andra forskaren, i annat fall så har jag väl givit något exempel på en sådan forskare som verkar i Sverige?&lt;/p&gt;\n\n&lt;p&gt;Om jag i ett parallellt universum inte hade kunnat ge exempel på en forskare som blev utsatt för orimliga försök till karaktärsmord eller krav på avgång så hade det alltså inte påverkat huvudfrågan som den här tråden handlar om i vilket fall.&lt;/p&gt;\n\n&lt;p&gt;Avslutningsvis kommer några allmänna kommentarer:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Jag kan dessutom, utan problem, länka till ett dussintal artiklar där genusvetenskapen kritiseras. De som har skrivit de artiklarna har inte drabbats av någon förföljelse. Du målar upp bilden av ett åsiktsförtryck av oliktänkande i Sverige som inte stämmer överens med verkligheten.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Jag har aldrig använt ordet åsiktsförtryck.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Forskare har mer skinn på näsan än vad du tror. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tack för den klappen på huvudet. Jag är nog mer insatt i akademisk forskning (inklusive neurovetenskap) än vad du tror.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdvnel", "score_hidden": false, "stickied": false, "created": 1492482054.0, "created_utc": 1492453254.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpkvx", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "bjourne2", "parent_id": "t1_dgdmfpe", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "&gt; men jag såg själv vilka orimliga anklagelser hon utsattes för i bekantas facebookflöden\n\nDet som skrivs i dina bekantas facebookflöden räknas faktiskt inte... \n\n&gt; Kirurgen Nisse Simonsson har skrivit i en av sina böcker om hur en högt uppsatt professor (anonymiserad i boken) ringde upp Dahlström ... (denna bok läste jag för 7-8 år sedan så jag citerar fritt ur minnet)\n\nDet är inte ett exempel på ett \"orimligt försök till karaktärsmord eller krav på avsked.\" Det är också svårt att bemöta då jag varken vet namnet på professorn eller titeln på boken som du läst.\n\n&gt; Krav på avsked har hon ju bevisligen utsatts för: http://www.gp.se/nyheter/g%C3%B6teborg/professor-avg%C3%A5r-efter-pappadrev-1.690009\n\nKorrekt. Är man kontroversiell är det alltid någon som tycker att man ska avgå. Även Dan Eliasson har vid ett fåtal tillfällen drabbats av krav på avsked. Men det du skrev \n\n&gt; De få forskare jag känner till som kritiserar genusvetenskap idag får utstå **helt orimliga** försök till karaktärsmord och krav på avsked\n\nFrågan är då om det Annica Dahlström har \"utsatts för\" är orimligt. Svaret är nej, det är det inte. Hon har inte blivit hindrad från att bedriva sin forskning, publicera böcker eller uttrycka sina åsikter. \n\nHon har blivit kritiserad eftersom hennes åsikter är kontroversiella. Det är fullständigt normalt i den akademiska världen då svidande kritik är normen. Karaktärsmord har hon, mig veterligt, inte blivit utsatt för även om sådant också förekommer i den akademiska världen. Forskare har mer skinn på näsan än vad du tror. \n\nOm du är intresserad av akademisk boxning så läs på om DAMP-debatten. Där kan vi snacka om karaktärsmord och fulspel mångfalt värre än vad Dahlström fått utstå. \n\nSåvitt jag vet är Annica Dahlström den forskare i Sverige som gått mest mot strömmen, men hon har inte blivit utsatt för något orimligt försök till karaktärsmord eller krav på avsked. Därför tror jag det blir svårt för dig att hitta något exempel på någon annan forskare som har blivit det.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;men jag såg själv vilka orimliga anklagelser hon utsattes för i bekantas facebookflöden&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Det som skrivs i dina bekantas facebookflöden räknas faktiskt inte... &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Kirurgen Nisse Simonsson har skrivit i en av sina böcker om hur en högt uppsatt professor (anonymiserad i boken) ringde upp Dahlström ... (denna bok läste jag för 7-8 år sedan så jag citerar fritt ur minnet)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Det är inte ett exempel på ett &amp;quot;orimligt försök till karaktärsmord eller krav på avsked.&amp;quot; Det är också svårt att bemöta då jag varken vet namnet på professorn eller titeln på boken som du läst.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Krav på avsked har hon ju bevisligen utsatts för: &lt;a href=\"http://www.gp.se/nyheter/g%C3%B6teborg/professor-avg%C3%A5r-efter-pappadrev-1.690009\"&gt;http://www.gp.se/nyheter/g%C3%B6teborg/professor-avg%C3%A5r-efter-pappadrev-1.690009&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Korrekt. Är man kontroversiell är det alltid någon som tycker att man ska avgå. Även Dan Eliasson har vid ett fåtal tillfällen drabbats av krav på avsked. Men det du skrev &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;De få forskare jag känner till som kritiserar genusvetenskap idag får utstå &lt;strong&gt;helt orimliga&lt;/strong&gt; försök till karaktärsmord och krav på avsked&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Frågan är då om det Annica Dahlström har &amp;quot;utsatts för&amp;quot; är orimligt. Svaret är nej, det är det inte. Hon har inte blivit hindrad från att bedriva sin forskning, publicera böcker eller uttrycka sina åsikter. &lt;/p&gt;\n\n&lt;p&gt;Hon har blivit kritiserad eftersom hennes åsikter är kontroversiella. Det är fullständigt normalt i den akademiska världen då svidande kritik är normen. Karaktärsmord har hon, mig veterligt, inte blivit utsatt för även om sådant också förekommer i den akademiska världen. Forskare har mer skinn på näsan än vad du tror. &lt;/p&gt;\n\n&lt;p&gt;Om du är intresserad av akademisk boxning så läs på om DAMP-debatten. Där kan vi snacka om karaktärsmord och fulspel mångfalt värre än vad Dahlström fått utstå. &lt;/p&gt;\n\n&lt;p&gt;Såvitt jag vet är Annica Dahlström den forskare i Sverige som gått mest mot strömmen, men hon har inte blivit utsatt för något orimligt försök till karaktärsmord eller krav på avsked. Därför tror jag det blir svårt för dig att hitta något exempel på någon annan forskare som har blivit det.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdpkvx", "score_hidden": false, "stickied": false, "created": 1492475326.0, "created_utc": 1492446526.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmfpe", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "madamswadam", "parent_id": "t1_dgdjnz4", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Angående Annica Dahlström så kan jag inte gå i god för exakt vilka anklagelser hon har utsatts för, men jag såg själv vilka orimliga anklagelser hon utsattes för i bekantas facebookflöden (obs, jag är medveten om att det är anekdotisk bevisföring att hänvisa till det). Kirurgen Nisse Simonsson har skrivit i en av sina böcker om hur en högt uppsatt professor (anonymiserad i boken) ringde upp Dahlström och sa att hon skulle sluta säga att det var skillnad på mäns och kvinnors hjärnor, inte för att det inte var sant utan för att det var politiskt olämpligt (denna bok läste jag för 7-8 år sedan så jag citerar fritt ur minnet).\n\nKrav på avsked har hon ju bevisligen utsatts för:\n\nhttp://www.gp.se/nyheter/g%C3%B6teborg/professor-avg%C3%A5r-efter-pappadrev-1.690009\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Angående Annica Dahlström så kan jag inte gå i god för exakt vilka anklagelser hon har utsatts för, men jag såg själv vilka orimliga anklagelser hon utsattes för i bekantas facebookflöden (obs, jag är medveten om att det är anekdotisk bevisföring att hänvisa till det). Kirurgen Nisse Simonsson har skrivit i en av sina böcker om hur en högt uppsatt professor (anonymiserad i boken) ringde upp Dahlström och sa att hon skulle sluta säga att det var skillnad på mäns och kvinnors hjärnor, inte för att det inte var sant utan för att det var politiskt olämpligt (denna bok läste jag för 7-8 år sedan så jag citerar fritt ur minnet).&lt;/p&gt;\n\n&lt;p&gt;Krav på avsked har hon ju bevisligen utsatts för:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.gp.se/nyheter/g%C3%B6teborg/professor-avg%C3%A5r-efter-pappadrev-1.690009\"&gt;http://www.gp.se/nyheter/g%C3%B6teborg/professor-avg%C3%A5r-efter-pappadrev-1.690009&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdmfpe", "score_hidden": false, "stickied": false, "created": 1492471746.0, "created_utc": 1492442946.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgdl2ps", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgdjnz4", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdl2ps", "score_hidden": false, "stickied": false, "created": 1492470102.0, "created_utc": 1492441302.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjnz4", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "bjourne2", "parent_id": "t1_dgdijhb", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 1, "body": "&gt; De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte 'får' kritisera.\n\nHar du något exempel på en sådan forskare som verkar i Sverige? Anledningen till att jag vill se ett exempel från Sverige är att det är underförstått att din tråd handlar om situationen i landet. \n\nVilka \"*orimliga* försök till karaktärsmord och krav på avsked\" har [Annica Dahlström](http://www.bokus.com/bok/9789197603300/konet-sitter-i-hjarnan/) fått utstå?\n\nOm du inte har det, varför tror du att det är på det viset när du inte har tillräckliga kunskaper?", "edited": 1492440072.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte &amp;#39;får&amp;#39; kritisera.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Har du något exempel på en sådan forskare som verkar i Sverige? Anledningen till att jag vill se ett exempel från Sverige är att det är underförstått att din tråd handlar om situationen i landet. &lt;/p&gt;\n\n&lt;p&gt;Vilka &amp;quot;&lt;em&gt;orimliga&lt;/em&gt; försök till karaktärsmord och krav på avsked&amp;quot; har &lt;a href=\"http://www.bokus.com/bok/9789197603300/konet-sitter-i-hjarnan/\"&gt;Annica Dahlström&lt;/a&gt; fått utstå?&lt;/p&gt;\n\n&lt;p&gt;Om du inte har det, varför tror du att det är på det viset när du inte har tillräckliga kunskaper?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdjnz4", "score_hidden": false, "stickied": false, "created": 1492468295.0, "created_utc": 1492439495.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdijhb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "madamswadam", "parent_id": "t1_dgdhqw2", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Jag ska se den så snart jag har tid. Det är dock ett missförstånd att jag skulle tro att den utgör något oantastligt bevis för att genusvetenskapen är 'fel'. Det handlar om att föra fram flera perspektiv på genusvetenskapen, inklusive öppet kritiska. De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte 'får' kritisera. Hela poängen med att försöka få SVT att visa den är att i) SVT är en del av den offentliga maktapparat som har köpt denna teori med hull och hår, ii) saker som sänds på SVT tenderar att resultera i öppen debatt i högre utsträckning än något som sänds på någon mer obskyr kanal, och iii) om det visar sig att en stor andel av licensbetalarna (som är tvingade att betala licens enligt lag) vill se en dylik dokumentär så känns det som ett fullt legitimt krav.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jag ska se den så snart jag har tid. Det är dock ett missförstånd att jag skulle tro att den utgör något oantastligt bevis för att genusvetenskapen är &amp;#39;fel&amp;#39;. Det handlar om att föra fram flera perspektiv på genusvetenskapen, inklusive öppet kritiska. De få forskare jag känner till som kritiserar genusvetenskap idag får utstå helt orimliga försök till karaktärsmord och krav på avsked. Det är ovärdigt ett fritt samhälle att staten baserar sin myndighetsövning på en vetenskaplig teori som man inte &amp;#39;får&amp;#39; kritisera. Hela poängen med att försöka få SVT att visa den är att i) SVT är en del av den offentliga maktapparat som har köpt denna teori med hull och hår, ii) saker som sänds på SVT tenderar att resultera i öppen debatt i högre utsträckning än något som sänds på någon mer obskyr kanal, och iii) om det visar sig att en stor andel av licensbetalarna (som är tvingade att betala licens enligt lag) vill se en dylik dokumentär så känns det som ett fullt legitimt krav.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdijhb", "score_hidden": false, "stickied": false, "created": 1492466745.0, "created_utc": 1492437945.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhqw2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bjourne2", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Jag har sett Hjernevask och det är en mycket bra serie. Men den skrapar bara på ytan i frågor som arv kontra miljö och kön kontra genus. Att serien skulle utgöra något slags bombsäkert bevis för att feministerna har fel är inte sant. Seriens titel Hjernevask = Hjärntvätt stämmer inte heller eftersom ingen hjärntvätt påvisas. \n\nOm du nödvändigtvis vill att en karbonkopia av serien skall sändas i Sverige, då finns det ett dussintal produktionsbolag förutom SVT du kan pitcha idén till. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jag har sett Hjernevask och det är en mycket bra serie. Men den skrapar bara på ytan i frågor som arv kontra miljö och kön kontra genus. Att serien skulle utgöra något slags bombsäkert bevis för att feministerna har fel är inte sant. Seriens titel Hjernevask = Hjärntvätt stämmer inte heller eftersom ingen hjärntvätt påvisas. &lt;/p&gt;\n\n&lt;p&gt;Om du nödvändigtvis vill att en karbonkopia av serien skall sändas i Sverige, då finns det ett dussintal produktionsbolag förutom SVT du kan pitcha idén till. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdhqw2", "score_hidden": false, "stickied": false, "created": 1492465557.0, "created_utc": 1492436757.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2twun", "removal_reason": null, "link_id": "t3_65rqzo", "likes": null, "replies": "", "user_reports": [], "id": "dgdwjju", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madamswadam", "parent_id": "t1_dgdvdcj", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "Tack, det var bra information. Jag mindes inte exakt hur Eberhard uttryckte det i podcasten, men om din länk stämmer så var det alltså inte på grund av dokumentären som anslagen krymptes. Jag kan inte gå i god för någon tolkning här, men ska kolla upp länkarna som bloggförfattaren länkar till.\n\nCitat:\n&gt; För det tredje, och nu blir det riktigt spännande, ska all forskning som får medel från Forskningsrådet numera ta upp jämställdhets- och könsaspekter i sin ansökan, skriver den administrativa direktören Arvid Hallén på Forskningsrådets blogg.\n\nOvanstående länk är död, kanske går att googla sig fram till. Men om det stämmer så är det ju i princip som i Sverige, där genusvetenskap skall genomsyra *all* offentlig verksamhet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tack, det var bra information. Jag mindes inte exakt hur Eberhard uttryckte det i podcasten, men om din länk stämmer så var det alltså inte på grund av dokumentären som anslagen krymptes. Jag kan inte gå i god för någon tolkning här, men ska kolla upp länkarna som bloggförfattaren länkar till.&lt;/p&gt;\n\n&lt;p&gt;Citat:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;För det tredje, och nu blir det riktigt spännande, ska all forskning som får medel från Forskningsrådet numera ta upp jämställdhets- och könsaspekter i sin ansökan, skriver den administrativa direktören Arvid Hallén på Forskningsrådets blogg.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ovanstående länk är död, kanske går att googla sig fram till. Men om det stämmer så är det ju i princip som i Sverige, där genusvetenskap skall genomsyra &lt;em&gt;all&lt;/em&gt; offentlig verksamhet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdwjju", "score_hidden": false, "stickied": false, "created": 1492483060.0, "created_utc": 1492454260.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvdcj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Kiyuya", "parent_id": "t3_65rqzo", "subreddit_name_prefixed": "r/svenskpolitik", "controversiality": 0, "body": "&gt;Resultatet av dokumentären blev att anslagen till genusvetenskap i Norge krymptes kraftigt. \n\nDet där stämmer väl inte? Så vitt jag vill minnas slutade en specialsatsning på genusvetenskap runt samma tid och Norge valde att inte förnya den eftersom genusvetenskap inte behövde den längre. \n\nEn artikel med till synes goda källhänvisningar till norska källor, skriven av någon som inte är genusvetare, kan läsas [här](http://socalledscience.blogspot.se/2011/12/om-forskningskvalitet-indragna-anslag.html).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Resultatet av dokumentären blev att anslagen till genusvetenskap i Norge krymptes kraftigt. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Det där stämmer väl inte? Så vitt jag vill minnas slutade en specialsatsning på genusvetenskap runt samma tid och Norge valde att inte förnya den eftersom genusvetenskap inte behövde den längre. &lt;/p&gt;\n\n&lt;p&gt;En artikel med till synes goda källhänvisningar till norska källor, skriven av någon som inte är genusvetare, kan läsas &lt;a href=\"http://socalledscience.blogspot.se/2011/12/om-forskningskvalitet-indragna-anslag.html\"&gt;här&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "svenskpolitik", "name": "t1_dgdvdcj", "score_hidden": false, "stickied": false, "created": 1492481742.0, "created_utc": 1492452942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]