[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Coffee", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sug1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 130, "report_reasons": null, "author": "Hooblah2u2", "saved": false, "mod_reports": [], "name": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "approved_by": null, "over_18": false, "domain": "nytimes.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhze", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/Coffee/comments/64sug1/the_1_cup_of_intelligentsia_coffee_curious_what/", "num_reports": null, "locked": false, "stickied": false, "created": 1491965436.0, "url": "https://www.nytimes.com/2017/04/10/dining/coffee-locol-restaurant-one-dollar-cup.html", "author_flair_text": null, "quarantine": false, "title": "The $1 Cup of Intelligentsia Coffee - Curious what you all think about this NYT article on a new coffee service model", "created_utc": 1491936636.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 52, "visited": false, "subreddit_type": "public", "ups": 130}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg55dwo", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "TOMMMMMM", "parent_id": "t1_dg4vqwr", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I don't have much to add other than I agree with your points and as always, appreciate your well thought out responses here at r/coffee. Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have much to add other than I agree with your points and as always, appreciate your well thought out responses here at &lt;a href=\"/r/coffee\"&gt;r/coffee&lt;/a&gt;. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg55dwo", "score_hidden": false, "stickied": false, "created": 1491983951.0, "created_utc": 1491955151.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg4vrot", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "Anomander", "parent_id": "t1_dg4vqwr", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Exclusivity, though.  Let's change gears to assuming good faith and not talking about Locol very much further.  \n\nPricing and *perceived* exclusivity are closely linked, but not synonymous.  \n\nThis community takes extensive pride in not being exclusive, not being (very) pretentious, and in general not living up to many of the negative coffee-culture stereotypes.  \n\nSo, first off, it's worth understanding that \"being unable to afford something\" often results in that person feeling left out - like the pricing is a barrier that's keeping them from something the rest of us have.  And this feeling gets louder and more frustrated the less *easily apparent* the distinctions being drawn are to that outsider.  If they don't understand why This Grinder is bad but That Other Grinder is good, and there's a gulf of pricing between them (Black &amp; Decker Burr Coffee Grinder vs. Baratza Encore) ... they feel like we're either holding out - or keeping out.  \n\nMaybe it's due to my role here, but I've had some really quite vitrolic responses from people for not recommending an electric grinder below the Bistro - because 'we' are holding out on them and being exclusive and exclusionary by not giving them reviews on grinders they can afford.  By simply advising everyone to not buy a $50 electric burr, *the entire coffee community* is letting them personally down because we won't tell them which $50 burr is best.  \n\nThe assumptions present in gear make a fantastic parallel here: the assumption is that *one* of those products in that price point has to be good, and that at the very least, 'the best' $50 burr is the exact purchase they should be making - because they have $52 and want a coffee grinder tomorrow.  The assumption is that it's our fault for not guiding them towards making a least-awful purchase, rather than that it's a larger marketplace &amp; economic fault for failing to produce a grinder in that price point worth recommending - largely, because at the moment, it's not possible.  \n\nSimilarly coffee.  Because there is a desire for cheaper *and* better coffee, the assumption is that it must be out there, and that the coffee community is either holding out or lining its pockets by pushing the more expensive stuff.  And the very things that coffee does to try and justify the prices that we need to charge often get understood as pretentious and snobby because, well, they're practices we engage in to justify a price point that is keeping some people out.  \n\nThis is some of my objection to water standardization, to tangent briefly.  As useful as water tuning can be in some narrow situations, I still feel standardization is a practice in optical self-sabotage - to start telling newcomers that even their water is inadequate and needs a (available for purchase!!) solution is placing a barrier that just won't connect for the bulk of new entrants.  During the big \"HOLY SHIT WATER\" trend, there was a ton of questions that were simple extraction problems being offered water customization as a solution.  Nah, having perfect water don't do shit if you're hovering at 16% extractions.  \n\nSo yes, \"expensive\" is a barrier to people without the means.  But I don't feel excluded because I can't buy a Morgan.  I don't feel excluded because I can't afford to do wintersports, or because I don't have the cash for travel.  \n\nIn large part because I already understand those things simply cost more than I have.  And (specialty, especially) coffee, sadly, is at a point where it simply costs more than some people have.  Labour costs make the cheapo cuppa nearly impossible for most small business.  Home coffee makes the cheapo cuppa nearly impossible for most small business as well - they can't make up price on volume that doesn't exist.  \n\nAnd as long as we're still talking good coffee from ethical producers ... those prices are only going to keep going up.  As living standards in those develping nations ... develop ... their cost of living, their livable wage, the costs on the farm ... they all go up.  Shitty, boring Kona is $20-35 a bag because Hawaii pays American wages.  If we genuinely want the developing world to develop, if we want things to improve for the people and nations producing our coffees ... that improvement is going to make coffee expensive for us.  \n\nWhile there's absolutely legitimacy and space in the marketplace to de-pretentious, re-culture away from exclusivity and performance - and while I absolutely support that making a 'cheaper' coffee is not always selling out  or even a guaranteed loss of quality (For a very easy example: if I sell mine for $15+$10 shipping - it's the same net cost and quality inside the bag as selling it $25, free shipping.)\n\nI do agree that Coffee can be awful hasty to dismiss or discredit new things.  But that in all those cases, and this one too - that needs to be handled on a per-case basis, not as some sort of general culture complaint.  Like, if *your* claims are bogus, don't bitch about how coffee culture hates marketplace newcomers, in general.  Some of the pricing rules I've seen tossed around are kinda ridiculous - that it 'needs' to be $20+ or someone 'needs' this $50 piece of supplimental hardware ... but again, *specific cases*.  No, you don't always need to spend $20+, but ... yes, if it sounds too cheap to true, it probably is.  \n\n'We' as a culture need to look long and hard at pretty much every case where we're consuming something exclusively produced in the developing world - and prioritizing cheapness.  Because in contributing to market assumptions and perceptions that coffee \"should\" be this cheap - Locol might be doing nice things for its neighborhood, but they're fucking over the developing world.  \n\nIf marketplace pressure starts trending cheaper again - even if Locol actually is and can continue doing everything it both says and implies about itself ... not everyone can.  Creating larger, massive-er demand for cheap coffee while undermining those portions of the market paying more realistic and fair-er pricing is only going to add pressure to the industry side of things to move towards more exploitative practices solely to stay afloat.  \n\nYou can't have \"cheap\" without the many, many, downsides that come with it.  And in coffee, most of those are borne by someone on the far side of the planet.", "edited": 1491943750.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exclusivity, though.  Let&amp;#39;s change gears to assuming good faith and not talking about Locol very much further.  &lt;/p&gt;\n\n&lt;p&gt;Pricing and &lt;em&gt;perceived&lt;/em&gt; exclusivity are closely linked, but not synonymous.  &lt;/p&gt;\n\n&lt;p&gt;This community takes extensive pride in not being exclusive, not being (very) pretentious, and in general not living up to many of the negative coffee-culture stereotypes.  &lt;/p&gt;\n\n&lt;p&gt;So, first off, it&amp;#39;s worth understanding that &amp;quot;being unable to afford something&amp;quot; often results in that person feeling left out - like the pricing is a barrier that&amp;#39;s keeping them from something the rest of us have.  And this feeling gets louder and more frustrated the less &lt;em&gt;easily apparent&lt;/em&gt; the distinctions being drawn are to that outsider.  If they don&amp;#39;t understand why This Grinder is bad but That Other Grinder is good, and there&amp;#39;s a gulf of pricing between them (Black &amp;amp; Decker Burr Coffee Grinder vs. Baratza Encore) ... they feel like we&amp;#39;re either holding out - or keeping out.  &lt;/p&gt;\n\n&lt;p&gt;Maybe it&amp;#39;s due to my role here, but I&amp;#39;ve had some really quite vitrolic responses from people for not recommending an electric grinder below the Bistro - because &amp;#39;we&amp;#39; are holding out on them and being exclusive and exclusionary by not giving them reviews on grinders they can afford.  By simply advising everyone to not buy a $50 electric burr, &lt;em&gt;the entire coffee community&lt;/em&gt; is letting them personally down because we won&amp;#39;t tell them which $50 burr is best.  &lt;/p&gt;\n\n&lt;p&gt;The assumptions present in gear make a fantastic parallel here: the assumption is that &lt;em&gt;one&lt;/em&gt; of those products in that price point has to be good, and that at the very least, &amp;#39;the best&amp;#39; $50 burr is the exact purchase they should be making - because they have $52 and want a coffee grinder tomorrow.  The assumption is that it&amp;#39;s our fault for not guiding them towards making a least-awful purchase, rather than that it&amp;#39;s a larger marketplace &amp;amp; economic fault for failing to produce a grinder in that price point worth recommending - largely, because at the moment, it&amp;#39;s not possible.  &lt;/p&gt;\n\n&lt;p&gt;Similarly coffee.  Because there is a desire for cheaper &lt;em&gt;and&lt;/em&gt; better coffee, the assumption is that it must be out there, and that the coffee community is either holding out or lining its pockets by pushing the more expensive stuff.  And the very things that coffee does to try and justify the prices that we need to charge often get understood as pretentious and snobby because, well, they&amp;#39;re practices we engage in to justify a price point that is keeping some people out.  &lt;/p&gt;\n\n&lt;p&gt;This is some of my objection to water standardization, to tangent briefly.  As useful as water tuning can be in some narrow situations, I still feel standardization is a practice in optical self-sabotage - to start telling newcomers that even their water is inadequate and needs a (available for purchase!!) solution is placing a barrier that just won&amp;#39;t connect for the bulk of new entrants.  During the big &amp;quot;HOLY SHIT WATER&amp;quot; trend, there was a ton of questions that were simple extraction problems being offered water customization as a solution.  Nah, having perfect water don&amp;#39;t do shit if you&amp;#39;re hovering at 16% extractions.  &lt;/p&gt;\n\n&lt;p&gt;So yes, &amp;quot;expensive&amp;quot; is a barrier to people without the means.  But I don&amp;#39;t feel excluded because I can&amp;#39;t buy a Morgan.  I don&amp;#39;t feel excluded because I can&amp;#39;t afford to do wintersports, or because I don&amp;#39;t have the cash for travel.  &lt;/p&gt;\n\n&lt;p&gt;In large part because I already understand those things simply cost more than I have.  And (specialty, especially) coffee, sadly, is at a point where it simply costs more than some people have.  Labour costs make the cheapo cuppa nearly impossible for most small business.  Home coffee makes the cheapo cuppa nearly impossible for most small business as well - they can&amp;#39;t make up price on volume that doesn&amp;#39;t exist.  &lt;/p&gt;\n\n&lt;p&gt;And as long as we&amp;#39;re still talking good coffee from ethical producers ... those prices are only going to keep going up.  As living standards in those develping nations ... develop ... their cost of living, their livable wage, the costs on the farm ... they all go up.  Shitty, boring Kona is $20-35 a bag because Hawaii pays American wages.  If we genuinely want the developing world to develop, if we want things to improve for the people and nations producing our coffees ... that improvement is going to make coffee expensive for us.  &lt;/p&gt;\n\n&lt;p&gt;While there&amp;#39;s absolutely legitimacy and space in the marketplace to de-pretentious, re-culture away from exclusivity and performance - and while I absolutely support that making a &amp;#39;cheaper&amp;#39; coffee is not always selling out  or even a guaranteed loss of quality (For a very easy example: if I sell mine for $15+$10 shipping - it&amp;#39;s the same net cost and quality inside the bag as selling it $25, free shipping.)&lt;/p&gt;\n\n&lt;p&gt;I do agree that Coffee can be awful hasty to dismiss or discredit new things.  But that in all those cases, and this one too - that needs to be handled on a per-case basis, not as some sort of general culture complaint.  Like, if &lt;em&gt;your&lt;/em&gt; claims are bogus, don&amp;#39;t bitch about how coffee culture hates marketplace newcomers, in general.  Some of the pricing rules I&amp;#39;ve seen tossed around are kinda ridiculous - that it &amp;#39;needs&amp;#39; to be $20+ or someone &amp;#39;needs&amp;#39; this $50 piece of supplimental hardware ... but again, &lt;em&gt;specific cases&lt;/em&gt;.  No, you don&amp;#39;t always need to spend $20+, but ... yes, if it sounds too cheap to true, it probably is.  &lt;/p&gt;\n\n&lt;p&gt;&amp;#39;We&amp;#39; as a culture need to look long and hard at pretty much every case where we&amp;#39;re consuming something exclusively produced in the developing world - and prioritizing cheapness.  Because in contributing to market assumptions and perceptions that coffee &amp;quot;should&amp;quot; be this cheap - Locol might be doing nice things for its neighborhood, but they&amp;#39;re fucking over the developing world.  &lt;/p&gt;\n\n&lt;p&gt;If marketplace pressure starts trending cheaper again - even if Locol actually is and can continue doing everything it both says and implies about itself ... not everyone can.  Creating larger, massive-er demand for cheap coffee while undermining those portions of the market paying more realistic and fair-er pricing is only going to add pressure to the industry side of things to move towards more exploitative practices solely to stay afloat.  &lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t have &amp;quot;cheap&amp;quot; without the many, many, downsides that come with it.  And in coffee, most of those are borne by someone on the far side of the planet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg4vrot", "score_hidden": false, "stickied": false, "created": 1491971839.0, "created_utc": 1491943039.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5tcsm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ReAnimatorCoffee", "parent_id": "t1_dg4vqwr", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Great reply, and yes, I was thrilled to see Charles' quote with that response. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great reply, and yes, I was thrilled to see Charles&amp;#39; quote with that response. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5tcsm", "score_hidden": false, "stickied": false, "created": 1492030381.0, "created_utc": 1492001581.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg6pfdk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sfo2", "parent_id": "t1_dg4vqwr", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I have doubts about the general ability of Locol to stay solvent, and also whether or not it matters if they are generating positive cash flow.\n\nAs far as I can tell, Locol's primary selling point is nobility.  They're taking healthy food to under-served areas.  It's very noble.  I believe this is a labor of love, from two successful chefs, who are trying to \"give back\" with their new venture.\n\nWhen Pete Wells from NYT wrote his review of Locol, he was pretty clear that the food sucked.  And he caught a ton of flak for that - people were questioning the ethics of critiquing such a noble venture.  I recall Choi responding something to the tune of \"well it's really hard to make decent quality food taste good at these price points.  We are doing something good here, so why are you picking on us?\"\n\nThat sounds to me a lot like a business that is being run less as a going concern, and more as a no/low profit labor of love.\n\nNow, with this preachy coffee article, where they've pulled in another successful guy to do the labor of love thing, the message is the same - they are \"solving\" the issue that high-quality stuff is only for wealthy people.\n\nI have to disagree with the basic premise, though - everyone knows that restaurants generally don't make much money, so it's not like there is some margin to be reduced, or some fatcat investor or middleman that can be cut out to get good food to the people at lower prices.  Locol's idea of using high quality ingredients at low prices doesn't really jive with economics.  Either 1) they're making very little/no/negative profit, 2) they're not doing what they say they're doing, or 3) in order to be marginally profitable, they've made a whole bunch of tradeoffs and ended up with mediocre food in the service of making it healthy.  My money is on some combination of (1) and (3).\n\nI'm not sure the coffee is subsidized by the fast food, because I have doubts the food makes much margin itself.  I could be wrong, but I see Locol more as a well-capitalized startup, rather than a typical business run for cash flow.  They might lose money on each $1 cup, but it doesn't matter because they're running a startup and trying to get traction.  (The upshot here, if my hypothesis is true, is that the preachy \"high quality coffee doesn't need to be fussy or expensive!\" is a conceit because it's not a repeatable or scalable idea.)", "edited": 1492037612.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have doubts about the general ability of Locol to stay solvent, and also whether or not it matters if they are generating positive cash flow.&lt;/p&gt;\n\n&lt;p&gt;As far as I can tell, Locol&amp;#39;s primary selling point is nobility.  They&amp;#39;re taking healthy food to under-served areas.  It&amp;#39;s very noble.  I believe this is a labor of love, from two successful chefs, who are trying to &amp;quot;give back&amp;quot; with their new venture.&lt;/p&gt;\n\n&lt;p&gt;When Pete Wells from NYT wrote his review of Locol, he was pretty clear that the food sucked.  And he caught a ton of flak for that - people were questioning the ethics of critiquing such a noble venture.  I recall Choi responding something to the tune of &amp;quot;well it&amp;#39;s really hard to make decent quality food taste good at these price points.  We are doing something good here, so why are you picking on us?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That sounds to me a lot like a business that is being run less as a going concern, and more as a no/low profit labor of love.&lt;/p&gt;\n\n&lt;p&gt;Now, with this preachy coffee article, where they&amp;#39;ve pulled in another successful guy to do the labor of love thing, the message is the same - they are &amp;quot;solving&amp;quot; the issue that high-quality stuff is only for wealthy people.&lt;/p&gt;\n\n&lt;p&gt;I have to disagree with the basic premise, though - everyone knows that restaurants generally don&amp;#39;t make much money, so it&amp;#39;s not like there is some margin to be reduced, or some fatcat investor or middleman that can be cut out to get good food to the people at lower prices.  Locol&amp;#39;s idea of using high quality ingredients at low prices doesn&amp;#39;t really jive with economics.  Either 1) they&amp;#39;re making very little/no/negative profit, 2) they&amp;#39;re not doing what they say they&amp;#39;re doing, or 3) in order to be marginally profitable, they&amp;#39;ve made a whole bunch of tradeoffs and ended up with mediocre food in the service of making it healthy.  My money is on some combination of (1) and (3).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure the coffee is subsidized by the fast food, because I have doubts the food makes much margin itself.  I could be wrong, but I see Locol more as a well-capitalized startup, rather than a typical business run for cash flow.  They might lose money on each $1 cup, but it doesn&amp;#39;t matter because they&amp;#39;re running a startup and trying to get traction.  (The upshot here, if my hypothesis is true, is that the preachy &amp;quot;high quality coffee doesn&amp;#39;t need to be fussy or expensive!&amp;quot; is a conceit because it&amp;#39;s not a repeatable or scalable idea.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg6pfdk", "score_hidden": false, "stickied": false, "created": 1492066228.0, "created_utc": 1492037428.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5ww00", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GreeenCoffeee", "parent_id": "t1_dg5svwx", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "It really depends. You can get really nice coffees for under $3-4 pretty easily. The margins are pretty thing which is why they mention huge volume. And that margin is based only the coffee itself and not taking any other costs into consideration so it'd be an even smaller margin. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really depends. You can get really nice coffees for under $3-4 pretty easily. The margins are pretty thing which is why they mention huge volume. And that margin is based only the coffee itself and not taking any other costs into consideration so it&amp;#39;d be an even smaller margin. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5ww00", "score_hidden": false, "stickied": false, "created": 1492035306.0, "created_utc": 1492006506.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg8q5w4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elli-ya", "parent_id": "t1_dg63t4r", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "You don't have to pay rent, wages, electricity and so on from that coffee though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t have to pay rent, wages, electricity and so on from that coffee though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg8q5w4", "score_hidden": false, "stickied": false, "created": 1492171038.0, "created_utc": 1492142238.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg74rxb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wine-o-saur", "parent_id": "t1_dg6hfuz", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "He said \"even before overheads\", so you just wasted a lot of time writing about overheads.  \n\nI'm not sure if you read the article or the earlier comments in this discussion,, but the context is a fast food restaurant serving black batch-brewed coffee from (allegedly) specialty beans.  So overheads are essentially covered by the fast food trade.  The discussion at hand is about whether the coffee *costs* money to sell at $1, or whether it just has a slim margin.   ", "edited": 1492057634.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He said &amp;quot;even before overheads&amp;quot;, so you just wasted a lot of time writing about overheads.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if you read the article or the earlier comments in this discussion,, but the context is a fast food restaurant serving black batch-brewed coffee from (allegedly) specialty beans.  So overheads are essentially covered by the fast food trade.  The discussion at hand is about whether the coffee &lt;em&gt;costs&lt;/em&gt; money to sell at $1, or whether it just has a slim margin.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg74rxb", "score_hidden": false, "stickied": false, "created": 1492085914.0, "created_utc": 1492057114.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hfuz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TheTapeDeck", "parent_id": "t1_dg67r8o", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "But then why are you comparing what you can do at home to what they do at the shop? It's the same problem you're accusing u/RedWarFour of. \n\nYou aren't spending money on paper cups, lids, napkins, stirring sticks, whatever. You aren't looking at the price per cup and trying to find the margin between what it cost and that $1 figure, to conclude how you'll keep the lights on. Do you have a barista drawing a wage at home?  \n\nI'm spending $0.30 before I even grind the coffee, when I sell a pourover. Then there's the cost of the coffee and the costs of doing business. I suggest that the idea that you can make a cup of coffee for around $1 is not remarkable, and is totally irrelevant to whether or not a business can do so. It SHOULD be cheaper to make the coffee at home... regardless of the fact that I get my coffee for less than you do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But then why are you comparing what you can do at home to what they do at the shop? It&amp;#39;s the same problem you&amp;#39;re accusing &lt;a href=\"/u/RedWarFour\"&gt;u/RedWarFour&lt;/a&gt; of. &lt;/p&gt;\n\n&lt;p&gt;You aren&amp;#39;t spending money on paper cups, lids, napkins, stirring sticks, whatever. You aren&amp;#39;t looking at the price per cup and trying to find the margin between what it cost and that $1 figure, to conclude how you&amp;#39;ll keep the lights on. Do you have a barista drawing a wage at home?  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m spending $0.30 before I even grind the coffee, when I sell a pourover. Then there&amp;#39;s the cost of the coffee and the costs of doing business. I suggest that the idea that you can make a cup of coffee for around $1 is not remarkable, and is totally irrelevant to whether or not a business can do so. It SHOULD be cheaper to make the coffee at home... regardless of the fact that I get my coffee for less than you do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg6hfuz", "score_hidden": false, "stickied": false, "created": 1492056993.0, "created_utc": 1492028193.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67r8o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wine-o-saur", "parent_id": "t1_dg66yuf", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Why would you use consumer pricing to determine costs for a wholesaler? Especially when they roast their own beans, this is going to massively inflate the actual cost. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would you use consumer pricing to determine costs for a wholesaler? Especially when they roast their own beans, this is going to massively inflate the actual cost. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg67r8o", "score_hidden": false, "stickied": false, "created": 1492047072.0, "created_utc": 1492018272.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66yuf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RedWarFour", "parent_id": "t1_dg66n0v", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I meant the $15 as a consumer. You're paying $10 a bag for your coffee. That's pretty good, considering you can't find any single-origin on Intelligentsia for less than $18. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I meant the $15 as a consumer. You&amp;#39;re paying $10 a bag for your coffee. That&amp;#39;s pretty good, considering you can&amp;#39;t find any single-origin on Intelligentsia for less than $18. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg66yuf", "score_hidden": false, "stickied": false, "created": 1492046287.0, "created_utc": 1492017487.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66n0v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wine-o-saur", "parent_id": "t1_dg660xo", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I pay about $30 per kilo for single origin, well-sourced, roasted-to-order coffee.  As a consumer.  There is no way that $15/340g is the low end for wholesale.  \n\nEdit: to the second point, a loss-leader is a product sold at a loss to attract customers.  This is different than a product sold at a thin margin because customers are already there for the main product.  ", "edited": 1492017594.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I pay about $30 per kilo for single origin, well-sourced, roasted-to-order coffee.  As a consumer.  There is no way that $15/340g is the low end for wholesale.  &lt;/p&gt;\n\n&lt;p&gt;Edit: to the second point, a loss-leader is a product sold at a loss to attract customers.  This is different than a product sold at a thin margin because customers are already there for the main product.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg66n0v", "score_hidden": false, "stickied": false, "created": 1492045952.0, "created_utc": 1492017152.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg660xo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedWarFour", "parent_id": "t1_dg63t4r", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I said probably, so I wasn't being definitive. It depends on the price they can get from their suppliers. \n\nI think $15 / 340 grams is on the low end *for a consumer. For a 12 oz cup, you'll need 350 ml of water. At a 16:1 water to coffee, you'll need 22 grams of coffee at $0.044 a gram. That's $0.97 for just the coffee. \n\n*Another thing to note is that the margin on the coffee Locol sells is likely so thin that they couldn't cover labor and overhead costs by just selling at that price. They make up for it with their other products. That is what OP meant by subsidizing it. A third wave shop has to charge $3-4 to cover the overhead and labor.", "edited": 1492017682.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I said probably, so I wasn&amp;#39;t being definitive. It depends on the price they can get from their suppliers. &lt;/p&gt;\n\n&lt;p&gt;I think $15 / 340 grams is on the low end *for a consumer. For a 12 oz cup, you&amp;#39;ll need 350 ml of water. At a 16:1 water to coffee, you&amp;#39;ll need 22 grams of coffee at $0.044 a gram. That&amp;#39;s $0.97 for just the coffee. &lt;/p&gt;\n\n&lt;p&gt;*Another thing to note is that the margin on the coffee Locol sells is likely so thin that they couldn&amp;#39;t cover labor and overhead costs by just selling at that price. They make up for it with their other products. That is what OP meant by subsidizing it. A third wave shop has to charge $3-4 to cover the overhead and labor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg660xo", "score_hidden": false, "stickied": false, "created": 1492045330.0, "created_utc": 1492016530.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63t4r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wine-o-saur", "parent_id": "t1_dg5svwx", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I make coffee for less than this at home from specialty beans as a consumer, so I'm not sure how you can say this so definitely.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I make coffee for less than this at home from specialty beans as a consumer, so I&amp;#39;m not sure how you can say this so definitely.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg63t4r", "score_hidden": false, "stickied": false, "created": 1492043028.0, "created_utc": 1492014228.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5svwx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "RedWarFour", "parent_id": "t1_dg5kmzw", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "$1.00 per brew for the kind of coffee the article is implying is probably a loss even before allocating overhead. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;$1.00 per brew for the kind of coffee the article is implying is probably a loss even before allocating overhead. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5svwx", "score_hidden": false, "stickied": false, "created": 1492029620.0, "created_utc": 1492000820.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5kmzw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wine-o-saur", "parent_id": "t1_dg4vqwr", "subreddit_name_prefixed": "r/Coffee", "controversiality": 1, "body": "\n&gt;At this point, the Locol $1 coffee is sounding like it's one of two things: decent commodity dressed up as craft ... or *heavily* subsidized by Locol's fast food business lines as a loss-lead product offering.\n\nI don't disagree with a lot of what you're saying, but this bit strikes me as a little disingenuous.  The fact that it is more profitable to run a fast food business doesn't make the coffee a loss-leader.  They specifically mention in the article that Locol isn't focusing on decor, is in lower-rent venues, and that the model wouldn't work selling only coffee, except in the case of the 'window' sites.  So I think that explains quite well how they are able to cut costs.  Lower overheads, more volume (from fast food traffic and the greater speed/convenience of serving a quick-to-prepare drink), and a lower proportion of the rent having to be paid for by coffee profits.  That doesn't mean the coffee isn't making money, it means it's under less pressure to make as much.  \n\nAnyway, you clearly know more about the industry than I do and this doesn't undermine your central complaints, I just didn't think it was entirely fair to suggest that either they are passing off lower quality coffee as better than it is or they are losing money thereby damaging competitors to promote their own brand.  You may be right, but there is a plausible alternative explanation of the pricing, which I don't see an immediate reason to dismiss. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;At this point, the Locol $1 coffee is sounding like it&amp;#39;s one of two things: decent commodity dressed up as craft ... or &lt;em&gt;heavily&lt;/em&gt; subsidized by Locol&amp;#39;s fast food business lines as a loss-lead product offering.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t disagree with a lot of what you&amp;#39;re saying, but this bit strikes me as a little disingenuous.  The fact that it is more profitable to run a fast food business doesn&amp;#39;t make the coffee a loss-leader.  They specifically mention in the article that Locol isn&amp;#39;t focusing on decor, is in lower-rent venues, and that the model wouldn&amp;#39;t work selling only coffee, except in the case of the &amp;#39;window&amp;#39; sites.  So I think that explains quite well how they are able to cut costs.  Lower overheads, more volume (from fast food traffic and the greater speed/convenience of serving a quick-to-prepare drink), and a lower proportion of the rent having to be paid for by coffee profits.  That doesn&amp;#39;t mean the coffee isn&amp;#39;t making money, it means it&amp;#39;s under less pressure to make as much.  &lt;/p&gt;\n\n&lt;p&gt;Anyway, you clearly know more about the industry than I do and this doesn&amp;#39;t undermine your central complaints, I just didn&amp;#39;t think it was entirely fair to suggest that either they are passing off lower quality coffee as better than it is or they are losing money thereby damaging competitors to promote their own brand.  You may be right, but there is a plausible alternative explanation of the pricing, which I don&amp;#39;t see an immediate reason to dismiss. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5kmzw", "score_hidden": false, "stickied": false, "created": 1492007793.0, "created_utc": 1491978993.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vqwr", "gilded": 0, "archived": false, "score": 140, "report_reasons": null, "author": "Anomander", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I've seen this article doing the rounds on twitter, to the usual twitter-sized responses from the coffee community.  Yet again Strand wants to circlejerk to the consuming public that coffee is just too fancy, complicated, and not nearly as down-home as he'd like it to be. \n\nI've read this a few times now, and my end impression is that Locol and Strand are a match made in heaven.  Strand wants to bitch about coffee culture some more, and Locol wants to use that bitching to advertise how they're 'not like that'.  \n\nThis is something that really is just a long-form advert and press release for Locol.  It's dressed up as a critique of coffee culture, but ... are 'we' actually that stupid?  There's a lot of that here.  Shade tossed at the competition, shitty market positioning, and massive pandering and pander apologia.  And it's a particularly hamfisted article about 'fanciness' because Strand has softpitched every possible hard question to participants while making sure to toss the tough balls towards people not in the article.  Hella shady.  \n\n**I want to acknowledge that there's some very good, worthy, points about exclusivity in coffee culture in this article; I'll get there later.  Just that this particular article is a ridiculously tacky venue for Strand/Locol to bring them up - and it's gauche to play it out like that conversation is what they came for.**\n\nSo first, while I recognize it's just the submission title here, not a claim made through the link - but this is not \"$1 Intelligentsia coffee\" : it's $1 coffee.  From a different company.  From a different roaster.  From different lots.  Possibly from the same green supplier.  \n\nThe incredibly tenuous connection drawn in the article is \"Obtained and roasted according to the same lofty standards found at Intelligentsia Coffee, Stumptown Coffee Roasters or any of the small\" which is, honestly, effectively meaningless except to try and make them sound better to someone not reading carefully.  Similarly, that they buy from a green supplier someone credible also uses.  If you don't know a ton about the market, maybe that makes for a glowing endorsement - for myself, I know that my supplier also carries very cheap shitty beans if we really wanted some.  \"A good supplier\" says nothing about what's actually inside the bags.  \n\nBut 'shade' yo.  \n\nWhat does \"fancy\" mean here?  Not really 'fancy' in the traditional sense - no little umbrellas, no gold flakes, no saucers with little cookies and doilies and shit ... \"Fancy\" is just a keyword for \"expensive.\"  And as ever, we're taking \"expensive\" at face value, just assuming everyone agrees on what it means.  And even once we get into 'fancy' ... \n\n&gt;He has no patience for what he calls the “culinary burlesque” of pour-over bars, with their solemn baristas and potted succulents. “It’s dress-up,” he said.  [...]  “We have become overly focused on this ingredient preciousness, single-origin puritanism,” he said. As a result, he added, coffee just keeps getting “fancier and fancier.”  [...] That’s why there is no gastro-sermonizing at Locol, no talk of farms or varieties. The coffee on the menu is either hot or cold, and served with a cheerful lack of ceremony.\n\nAnd no one is terribly surprised when \"fancy\" ends up being a armwavingly vague straw-man.  It's just 'those hipsters' over there.  \n\n&gt;Still, the information is there for those who want it: A dedicated Twitter feed will relay details of that week’s coffees. “People who want to go down the rabbit hole can, but it’s not what we put on the bag,” he said. “You don’t have to buy into a set of conceits about how to buy or understand coffee to enjoy it.”\n\nBecause this is literally how all those people he just shit on as 'fancy' pretty much all already do it.  Its not crammed down customers throats - but still available for customers that want to engage that way.  Actually, they're going a little further than most of us by having a weekly rotating lineup and needing to provide that much updating in the first place.  \n\n&gt;Colby Barr, a founder of Verve Coffee Roasters, said he supported Locol’s mission but *felt there was a value in highlighting some of the wonkier aspects of coffee*, just as it made sense to ask customers to pay more for something that required care to produce.\n\nWhat the fuck, man.  \"Wonkier\"?  I hope that's a literal quote, and you just forgot the punctuation.  Because otherwise that's a hell of a lot of editorial narrative - and judgement - added onto a quoted source's contribution to your article.  \n\nLastly in criticial quote soup from this article, Mr Babinsky of course says relatively clever and intelligent things, and names the single most frustrating thing both in the article and in Locol's market positioning.\n\n&gt;But does the $1 price go too far? “**My worry is that this will reinforce the idea that specialty coffee is inherently overpriced, when it’s the opposite,**” said Charles Babinski, a co-owner of G&amp;amp;B Coffee and Go Get Em Tiger, in Los Angeles. “The best coffees in the world cost nothing when you compare it to the best beers or a fancy glass of wine, and the margins that businesses take on coffee are smaller than you’re going to find in a bar.”\n\nBecause that's Locol's marketing pitch: validating consumer preconceptions that coffee 'costs too much' and offering themselves as a solution.  Then ... talking about themselves like they're still delivering \"high quality coffees\" while shitting all over the core accountability mechanisms that our culture has developed to make sure high quality coffees aren't being sourced exploitatively.  Are they really, actually, delivering craft cafe coffee at $1/cup, with the same integrity and standards that I would define craft cafe coffee - without a price attached?  I really doubt it, and I have *hella* flexible standards.  \n\nAre they going to compete on quality alone with either of their owners' old businesses?  Not at those prices.  Are they going to compete on quality with their price-point competition?  Yeah, they'll stack up fine against McDonalds and beat the pants off Tims.  \n\n&gt;“A lot of my colleagues don’t understand what I’m doing here,” he said.\n\nI'd suggest that's a backhanded response to criticism, not a literal statement.  Because \"oh well they just don't understand\" is the pitchline for \"Hey customers, don't listen to those critics - whatever they say is just because they don't get it\" rather than handle the actual criticisms he's faced so far.  \n\n...Like \"economy of scale\" is dope, but it's not that amazing.  **Where are those savings coming from?**  \n\nEventually, you either have to pay more, or buy shittier coffee, because there is a price floor even at massive bulk orders - and the lower your price floor, the less and less likely that your savings aren't coming off the back of exploitative developing world labour.  Serving black and bidding up for condiments is not a $2 price difference either, nor is having a full fast-food joint staff turning into labour savings.  Are they roasting it in 180KG batches or something?  \n\nAt this point, the Locol $1 coffee is sounding like it's one of two things: decent commodity dressed up as craft ... or *heavily* subsidized by Locol's fast food business lines as a loss-lead product offering.  \n\nEither way, spinning it out like they're the future of coffee for setting a market pricing expectation the entire rest of the industry has no meaningful hope of meeting without either buying substantially shitter coffee or simply being a totally different business entirely ... Fuck that noise. \n\n**Edit**: \"Strand\" not \"Stroud\"", "edited": 1492041692.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen this article doing the rounds on twitter, to the usual twitter-sized responses from the coffee community.  Yet again Strand wants to circlejerk to the consuming public that coffee is just too fancy, complicated, and not nearly as down-home as he&amp;#39;d like it to be. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve read this a few times now, and my end impression is that Locol and Strand are a match made in heaven.  Strand wants to bitch about coffee culture some more, and Locol wants to use that bitching to advertise how they&amp;#39;re &amp;#39;not like that&amp;#39;.  &lt;/p&gt;\n\n&lt;p&gt;This is something that really is just a long-form advert and press release for Locol.  It&amp;#39;s dressed up as a critique of coffee culture, but ... are &amp;#39;we&amp;#39; actually that stupid?  There&amp;#39;s a lot of that here.  Shade tossed at the competition, shitty market positioning, and massive pandering and pander apologia.  And it&amp;#39;s a particularly hamfisted article about &amp;#39;fanciness&amp;#39; because Strand has softpitched every possible hard question to participants while making sure to toss the tough balls towards people not in the article.  Hella shady.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I want to acknowledge that there&amp;#39;s some very good, worthy, points about exclusivity in coffee culture in this article; I&amp;#39;ll get there later.  Just that this particular article is a ridiculously tacky venue for Strand/Locol to bring them up - and it&amp;#39;s gauche to play it out like that conversation is what they came for.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So first, while I recognize it&amp;#39;s just the submission title here, not a claim made through the link - but this is not &amp;quot;$1 Intelligentsia coffee&amp;quot; : it&amp;#39;s $1 coffee.  From a different company.  From a different roaster.  From different lots.  Possibly from the same green supplier.  &lt;/p&gt;\n\n&lt;p&gt;The incredibly tenuous connection drawn in the article is &amp;quot;Obtained and roasted according to the same lofty standards found at Intelligentsia Coffee, Stumptown Coffee Roasters or any of the small&amp;quot; which is, honestly, effectively meaningless except to try and make them sound better to someone not reading carefully.  Similarly, that they buy from a green supplier someone credible also uses.  If you don&amp;#39;t know a ton about the market, maybe that makes for a glowing endorsement - for myself, I know that my supplier also carries very cheap shitty beans if we really wanted some.  &amp;quot;A good supplier&amp;quot; says nothing about what&amp;#39;s actually inside the bags.  &lt;/p&gt;\n\n&lt;p&gt;But &amp;#39;shade&amp;#39; yo.  &lt;/p&gt;\n\n&lt;p&gt;What does &amp;quot;fancy&amp;quot; mean here?  Not really &amp;#39;fancy&amp;#39; in the traditional sense - no little umbrellas, no gold flakes, no saucers with little cookies and doilies and shit ... &amp;quot;Fancy&amp;quot; is just a keyword for &amp;quot;expensive.&amp;quot;  And as ever, we&amp;#39;re taking &amp;quot;expensive&amp;quot; at face value, just assuming everyone agrees on what it means.  And even once we get into &amp;#39;fancy&amp;#39; ... &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He has no patience for what he calls the “culinary burlesque” of pour-over bars, with their solemn baristas and potted succulents. “It’s dress-up,” he said.  [...]  “We have become overly focused on this ingredient preciousness, single-origin puritanism,” he said. As a result, he added, coffee just keeps getting “fancier and fancier.”  [...] That’s why there is no gastro-sermonizing at Locol, no talk of farms or varieties. The coffee on the menu is either hot or cold, and served with a cheerful lack of ceremony.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And no one is terribly surprised when &amp;quot;fancy&amp;quot; ends up being a armwavingly vague straw-man.  It&amp;#39;s just &amp;#39;those hipsters&amp;#39; over there.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Still, the information is there for those who want it: A dedicated Twitter feed will relay details of that week’s coffees. “People who want to go down the rabbit hole can, but it’s not what we put on the bag,” he said. “You don’t have to buy into a set of conceits about how to buy or understand coffee to enjoy it.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because this is literally how all those people he just shit on as &amp;#39;fancy&amp;#39; pretty much all already do it.  Its not crammed down customers throats - but still available for customers that want to engage that way.  Actually, they&amp;#39;re going a little further than most of us by having a weekly rotating lineup and needing to provide that much updating in the first place.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Colby Barr, a founder of Verve Coffee Roasters, said he supported Locol’s mission but &lt;em&gt;felt there was a value in highlighting some of the wonkier aspects of coffee&lt;/em&gt;, just as it made sense to ask customers to pay more for something that required care to produce.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What the fuck, man.  &amp;quot;Wonkier&amp;quot;?  I hope that&amp;#39;s a literal quote, and you just forgot the punctuation.  Because otherwise that&amp;#39;s a hell of a lot of editorial narrative - and judgement - added onto a quoted source&amp;#39;s contribution to your article.  &lt;/p&gt;\n\n&lt;p&gt;Lastly in criticial quote soup from this article, Mr Babinsky of course says relatively clever and intelligent things, and names the single most frustrating thing both in the article and in Locol&amp;#39;s market positioning.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But does the $1 price go too far? “&lt;strong&gt;My worry is that this will reinforce the idea that specialty coffee is inherently overpriced, when it’s the opposite,&lt;/strong&gt;” said Charles Babinski, a co-owner of G&amp;amp;B Coffee and Go Get Em Tiger, in Los Angeles. “The best coffees in the world cost nothing when you compare it to the best beers or a fancy glass of wine, and the margins that businesses take on coffee are smaller than you’re going to find in a bar.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Because that&amp;#39;s Locol&amp;#39;s marketing pitch: validating consumer preconceptions that coffee &amp;#39;costs too much&amp;#39; and offering themselves as a solution.  Then ... talking about themselves like they&amp;#39;re still delivering &amp;quot;high quality coffees&amp;quot; while shitting all over the core accountability mechanisms that our culture has developed to make sure high quality coffees aren&amp;#39;t being sourced exploitatively.  Are they really, actually, delivering craft cafe coffee at $1/cup, with the same integrity and standards that I would define craft cafe coffee - without a price attached?  I really doubt it, and I have &lt;em&gt;hella&lt;/em&gt; flexible standards.  &lt;/p&gt;\n\n&lt;p&gt;Are they going to compete on quality alone with either of their owners&amp;#39; old businesses?  Not at those prices.  Are they going to compete on quality with their price-point competition?  Yeah, they&amp;#39;ll stack up fine against McDonalds and beat the pants off Tims.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“A lot of my colleagues don’t understand what I’m doing here,” he said.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;d suggest that&amp;#39;s a backhanded response to criticism, not a literal statement.  Because &amp;quot;oh well they just don&amp;#39;t understand&amp;quot; is the pitchline for &amp;quot;Hey customers, don&amp;#39;t listen to those critics - whatever they say is just because they don&amp;#39;t get it&amp;quot; rather than handle the actual criticisms he&amp;#39;s faced so far.  &lt;/p&gt;\n\n&lt;p&gt;...Like &amp;quot;economy of scale&amp;quot; is dope, but it&amp;#39;s not that amazing.  &lt;strong&gt;Where are those savings coming from?&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;Eventually, you either have to pay more, or buy shittier coffee, because there is a price floor even at massive bulk orders - and the lower your price floor, the less and less likely that your savings aren&amp;#39;t coming off the back of exploitative developing world labour.  Serving black and bidding up for condiments is not a $2 price difference either, nor is having a full fast-food joint staff turning into labour savings.  Are they roasting it in 180KG batches or something?  &lt;/p&gt;\n\n&lt;p&gt;At this point, the Locol $1 coffee is sounding like it&amp;#39;s one of two things: decent commodity dressed up as craft ... or &lt;em&gt;heavily&lt;/em&gt; subsidized by Locol&amp;#39;s fast food business lines as a loss-lead product offering.  &lt;/p&gt;\n\n&lt;p&gt;Either way, spinning it out like they&amp;#39;re the future of coffee for setting a market pricing expectation the entire rest of the industry has no meaningful hope of meeting without either buying substantially shitter coffee or simply being a totally different business entirely ... Fuck that noise. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit&lt;/strong&gt;: &amp;quot;Strand&amp;quot; not &amp;quot;Stroud&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg4vqwr", "score_hidden": false, "stickied": false, "created": 1491971814.0, "created_utc": 1491943014.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 140}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5ub4b", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "rockydbull", "parent_id": "t1_dg5rdby", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "&gt; Eh...I think its more like opening a bar and saying you'll only serve a few inexpensively priced craft beers, no wine list.\n\nWe have one beer. It is quite good. Just won blue ribbon at the World's Fair!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Eh...I think its more like opening a bar and saying you&amp;#39;ll only serve a few inexpensively priced craft beers, no wine list.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We have one beer. It is quite good. Just won blue ribbon at the World&amp;#39;s Fair!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5ub4b", "score_hidden": false, "stickied": false, "created": 1492031853.0, "created_utc": 1492003053.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rdby", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reasondefies", "parent_id": "t1_dg50zgc", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "&gt; That's like saying you're going to open a bar and only offer one beer because the rest is just for sissies. \n\nEh...I think its more like opening a bar and saying you'll only serve a few inexpensively priced craft beers, no wine list.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s like saying you&amp;#39;re going to open a bar and only offer one beer because the rest is just for sissies. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Eh...I think its more like opening a bar and saying you&amp;#39;ll only serve a few inexpensively priced craft beers, no wine list.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5rdby", "score_hidden": false, "stickied": false, "created": 1492026776.0, "created_utc": 1491997976.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5i8f2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_keen", "parent_id": "t1_dg50zgc", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I think offering a coffee made with freshly roasted beans and a high quality grinder is something nobody is doing at $1, and that's the whole draw of the business model. To many people, that is the difference they're tasting between Intelligentsia coffee and Starbucks or Circle K. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think offering a coffee made with freshly roasted beans and a high quality grinder is something nobody is doing at $1, and that&amp;#39;s the whole draw of the business model. To many people, that is the difference they&amp;#39;re tasting between Intelligentsia coffee and Starbucks or Circle K. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5i8f2", "score_hidden": false, "stickied": false, "created": 1492002557.0, "created_utc": 1491973757.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5jvie", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "psk_coffee", "parent_id": "t1_dg50zgc", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Quite a few 'pourover bars' are actually not manual by now, only made-to-order, single serving, beans of your choice. Not unlike McDonalds which switched from selling burgers off the shelf to making them to order. Two examples I'm sure of are Saint Frank at Polk Street in SF and Temple near the Capitol in Sacramento.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Quite a few &amp;#39;pourover bars&amp;#39; are actually not manual by now, only made-to-order, single serving, beans of your choice. Not unlike McDonalds which switched from selling burgers off the shelf to making them to order. Two examples I&amp;#39;m sure of are Saint Frank at Polk Street in SF and Temple near the Capitol in Sacramento.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5jvie", "score_hidden": false, "stickied": false, "created": 1492005949.0, "created_utc": 1491977149.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50zgc", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "HarryManilow", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "kind of lost me at the \"there is no talk of farms or varietals, the coffee is either hot or cold.\"  Not everyone is going to care, but you can't just chalk it up to \"fanciness\" that people care and can tell the difference and between coffees and roasts. That's like saying you're going to open a bar and only offer one beer because the rest is just for sissies. Some of the \"hipsterisms\" of coffee are annoying and there are probably more streamlined ways of serving good coffee than manual pourovers, but quality has to be the priority.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;kind of lost me at the &amp;quot;there is no talk of farms or varietals, the coffee is either hot or cold.&amp;quot;  Not everyone is going to care, but you can&amp;#39;t just chalk it up to &amp;quot;fanciness&amp;quot; that people care and can tell the difference and between coffees and roasts. That&amp;#39;s like saying you&amp;#39;re going to open a bar and only offer one beer because the rest is just for sissies. Some of the &amp;quot;hipsterisms&amp;quot; of coffee are annoying and there are probably more streamlined ways of serving good coffee than manual pourovers, but quality has to be the priority.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg50zgc", "score_hidden": false, "stickied": false, "created": 1491978095.0, "created_utc": 1491949295.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg539zo", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "amcgavisk", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "No different from the \"Two Buck Chuck\" idea that Trader Joe's did with wine.  It allows the introductory person to have a better product at a great price, but there will always be those with more refined tastes that want the choices and consistency that the pricier options provide", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No different from the &amp;quot;Two Buck Chuck&amp;quot; idea that Trader Joe&amp;#39;s did with wine.  It allows the introductory person to have a better product at a great price, but there will always be those with more refined tastes that want the choices and consistency that the pricier options provide&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg539zo", "score_hidden": false, "stickied": false, "created": 1491981080.0, "created_utc": 1491952280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg688ok", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nikcoffee", "parent_id": "t1_dg5pn8b", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "This is a key point as well, because they are actually subsidizing their hot coffee by making poor iced coffee by mixing in what should be waste.\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a key point as well, because they are actually subsidizing their hot coffee by making poor iced coffee by mixing in what should be waste.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg688ok", "score_hidden": false, "stickied": false, "created": 1492047558.0, "created_utc": 1492018758.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg7vvx9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShinyTile", "parent_id": "t1_dg5pn8b", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Well apparently exactly zero.none customers in the US can understand that cold brew doesn't mean 'iced coffee' at this point, so...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well apparently exactly zero.none customers in the US can understand that cold brew doesn&amp;#39;t mean &amp;#39;iced coffee&amp;#39; at this point, so...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg7vvx9", "score_hidden": false, "stickied": false, "created": 1492132998.0, "created_utc": 1492104198.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pn8b", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Jurph", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "&gt; The coffee is brewed by Locol’s kitchen staff, and when a new batch is prepared the **old batch is cooled and mixed in with cold-brew coffee** to be served on ice: There is no waste. Black coffee is easy to scale up; stand-alone coffee shops, with their **intricate menus** (cortados, almond milk lattes, iced matcha spritzers) **can’t compete.**\n\nIf it takes an \"intricate menu\" to understand that chilling down drip coffee doesn't make it cold brew, then I'll take one intricate menu, please.  Ugh.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The coffee is brewed by Locol’s kitchen staff, and when a new batch is prepared the &lt;strong&gt;old batch is cooled and mixed in with cold-brew coffee&lt;/strong&gt; to be served on ice: There is no waste. Black coffee is easy to scale up; stand-alone coffee shops, with their &lt;strong&gt;intricate menus&lt;/strong&gt; (cortados, almond milk lattes, iced matcha spritzers) &lt;strong&gt;can’t compete.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If it takes an &amp;quot;intricate menu&amp;quot; to understand that chilling down drip coffee doesn&amp;#39;t make it cold brew, then I&amp;#39;ll take one intricate menu, please.  Ugh.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5pn8b", "score_hidden": false, "stickied": false, "created": 1492022618.0, "created_utc": 1491993818.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5izc7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "iwishmynamewasbrian", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "If anyone cares, I've been to Locol and the hot coffee was fine, better than Starbucks but not even close to Intelligentsia. The iced coffee was subpar. Served in a fast food environment. I was also charged $2 per cup, that was never explained. All in all it is comparable in both price and taste to batch drip from literally any small roaster/cafe who puts a little effort into it. Short version: Locol ain't nothing special. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If anyone cares, I&amp;#39;ve been to Locol and the hot coffee was fine, better than Starbucks but not even close to Intelligentsia. The iced coffee was subpar. Served in a fast food environment. I was also charged $2 per cup, that was never explained. All in all it is comparable in both price and taste to batch drip from literally any small roaster/cafe who puts a little effort into it. Short version: Locol ain&amp;#39;t nothing special. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5izc7", "score_hidden": false, "stickied": false, "created": 1492004017.0, "created_utc": 1491975217.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5dq7d", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "thin_wild_duke", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "My background is newspaper journalism: I can only imagine trying to tell my news editor that I was going to produce a couple of thousand words on a fast food joint running coffee as a loss leader. . . Really, this piece was saved by the headline - and even then, when you can't think of anything to say you dress it up as a question. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My background is newspaper journalism: I can only imagine trying to tell my news editor that I was going to produce a couple of thousand words on a fast food joint running coffee as a loss leader. . . Really, this piece was saved by the headline - and even then, when you can&amp;#39;t think of anything to say you dress it up as a question. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5dq7d", "score_hidden": false, "stickied": false, "created": 1491995078.0, "created_utc": 1491966278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg53k30", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "personalist", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "This is roy choi (and Daniel Patterson)'s company, right? I like what they're doing with locol and I've always enjoyed a-frame and his food trucks but this is a bit...out of their area of expertise, it seems ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is roy choi (and Daniel Patterson)&amp;#39;s company, right? I like what they&amp;#39;re doing with locol and I&amp;#39;ve always enjoyed a-frame and his food trucks but this is a bit...out of their area of expertise, it seems &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg53k30", "score_hidden": false, "stickied": false, "created": 1491981467.0, "created_utc": 1491952667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5voz4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "menschmaschine5", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "First of all, I have little patience for the \"anti-circlejerk circlejerk.\" That is, making a snobby strawman out of anyone who cares about quality and is interested in where their coffee was grown, how it was roasted, etc, and reinforcing people's notions that all that stuff is needlessly pretentious and you can get something \"just as good\" for less fuss and less money. \n\nThe problem is, there's no way they're actually slinging specialty coffee unless they're operating the coffee side of their business at a loss. Reinforcing the notion that specialty coffee is overpriced when, in fact, it's a pretty low-profit venture is ultimately harmful to the industry. Enough people already think that coffee *should* be cheaper based on nothing but their own feelings and the fact that they can get a drinkable-but-unimpressive cup at McDonald's for $1.\n\nAlso, Betteridge's law of headlines.", "edited": 1492005559.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, I have little patience for the &amp;quot;anti-circlejerk circlejerk.&amp;quot; That is, making a snobby strawman out of anyone who cares about quality and is interested in where their coffee was grown, how it was roasted, etc, and reinforcing people&amp;#39;s notions that all that stuff is needlessly pretentious and you can get something &amp;quot;just as good&amp;quot; for less fuss and less money. &lt;/p&gt;\n\n&lt;p&gt;The problem is, there&amp;#39;s no way they&amp;#39;re actually slinging specialty coffee unless they&amp;#39;re operating the coffee side of their business at a loss. Reinforcing the notion that specialty coffee is overpriced when, in fact, it&amp;#39;s a pretty low-profit venture is ultimately harmful to the industry. Enough people already think that coffee &lt;em&gt;should&lt;/em&gt; be cheaper based on nothing but their own feelings and the fact that they can get a drinkable-but-unimpressive cup at McDonald&amp;#39;s for $1.&lt;/p&gt;\n\n&lt;p&gt;Also, Betteridge&amp;#39;s law of headlines.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5voz4", "score_hidden": false, "stickied": false, "created": 1492033782.0, "created_utc": 1492004982.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg54k6u", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "TheTapeDeck", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "This is the same snake oil as \"low micotoxin coffee\" or \"no carcinogenic smoke\" coffee, etc. Just a different method of sales pitch nonsense.\n\nThere will always be the customer who comes in for the first time after being a lifelong Dunkin' Donuts coffee drinker... and they see your prices are much higher... HOW COULD THIS BE??? You must be trying to rip them off. \"I can buy a bag of beans at the Walmart for $7.99 for a lb...\" because the average coffee drinker can not be assumed to be a coffee aficionado. The average beer drinker can not be assumed to know what the late addition hops were, etc. It's the same kind of information issue. \n\nYou drink coffee, so you presume you know good coffee when you taste it. \n\nTo that customer, seeing \"we roast our own coffee\" and \"$1 for a cup of black coffee\" means \"these guys are stand up fellas.\"\n\nTo anyone who likes to go look for different coffee, there are so many alarms going off, it's hard to choose where to start. But the most obvious one is that the costs of the operation have to be covered somewhere. You can GIVE coffee away if you can sink the expense of that coffee into the price of the meal... or you can siphon some sort of discount on your rent and utilities, or some sort of government assistance. But failing all that... keeping coffee down to $1 per 12oz. cup means that you're probably buying coffee for about half the average price for specialty coffee. \n\nYou can buy LAST YEAR'S coffee. It's cheap. You can blend a little bit of specialty coffee with a whole lot of trashy coffee. You can get the price way down. But there is NO WAY you can do that and make something, on the regular, that shares similar nuance to what great coffee has to offer. And you'd better get there when it's been freshly brewed, or you might as well be buying gas station coffee.\n\nThe thing that weirds me out the most is the backlash against information. Perhaps the most important thing (apart from climate change,) for the sustainability of coffee, is connecting the end user to origin. It's the only way we eventually assure that the farms are going to get compensated for their work, and the quality of coffee trends up, as opposed to the world of 30 years ago. There are only highly questionable reasons why one would want to hide origin information. Turd polishing is probably the biggest one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the same snake oil as &amp;quot;low micotoxin coffee&amp;quot; or &amp;quot;no carcinogenic smoke&amp;quot; coffee, etc. Just a different method of sales pitch nonsense.&lt;/p&gt;\n\n&lt;p&gt;There will always be the customer who comes in for the first time after being a lifelong Dunkin&amp;#39; Donuts coffee drinker... and they see your prices are much higher... HOW COULD THIS BE??? You must be trying to rip them off. &amp;quot;I can buy a bag of beans at the Walmart for $7.99 for a lb...&amp;quot; because the average coffee drinker can not be assumed to be a coffee aficionado. The average beer drinker can not be assumed to know what the late addition hops were, etc. It&amp;#39;s the same kind of information issue. &lt;/p&gt;\n\n&lt;p&gt;You drink coffee, so you presume you know good coffee when you taste it. &lt;/p&gt;\n\n&lt;p&gt;To that customer, seeing &amp;quot;we roast our own coffee&amp;quot; and &amp;quot;$1 for a cup of black coffee&amp;quot; means &amp;quot;these guys are stand up fellas.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;To anyone who likes to go look for different coffee, there are so many alarms going off, it&amp;#39;s hard to choose where to start. But the most obvious one is that the costs of the operation have to be covered somewhere. You can GIVE coffee away if you can sink the expense of that coffee into the price of the meal... or you can siphon some sort of discount on your rent and utilities, or some sort of government assistance. But failing all that... keeping coffee down to $1 per 12oz. cup means that you&amp;#39;re probably buying coffee for about half the average price for specialty coffee. &lt;/p&gt;\n\n&lt;p&gt;You can buy LAST YEAR&amp;#39;S coffee. It&amp;#39;s cheap. You can blend a little bit of specialty coffee with a whole lot of trashy coffee. You can get the price way down. But there is NO WAY you can do that and make something, on the regular, that shares similar nuance to what great coffee has to offer. And you&amp;#39;d better get there when it&amp;#39;s been freshly brewed, or you might as well be buying gas station coffee.&lt;/p&gt;\n\n&lt;p&gt;The thing that weirds me out the most is the backlash against information. Perhaps the most important thing (apart from climate change,) for the sustainability of coffee, is connecting the end user to origin. It&amp;#39;s the only way we eventually assure that the farms are going to get compensated for their work, and the quality of coffee trends up, as opposed to the world of 30 years ago. There are only highly questionable reasons why one would want to hide origin information. Turd polishing is probably the biggest one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg54k6u", "score_hidden": false, "stickied": false, "created": 1491982820.0, "created_utc": 1491954020.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5kwq1", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "peditto", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I drove over to Locol in Watts today after reading this. Was pleasantly surprised how good the coffee was. No, it's not as good as a nuanced pour over -- but it's by faaaaaaar the best $1 cup of coffee you'll ever have (as the other redditor said, on par with the batch brews of other smaller roasters -- which are around $2.50/3 per cup). \n\nBought a bag of beans for $8 and made it on a V60 at home and it came out great. Again, you're not going to get a super complex cup, but it's a solid light roasted blend. \n\nNot sure if they can scale with this model. But maybe with a name like \"the mix\", they can vary the taste profile by roasting session and consumers won't be upset.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I drove over to Locol in Watts today after reading this. Was pleasantly surprised how good the coffee was. No, it&amp;#39;s not as good as a nuanced pour over -- but it&amp;#39;s by faaaaaaar the best $1 cup of coffee you&amp;#39;ll ever have (as the other redditor said, on par with the batch brews of other smaller roasters -- which are around $2.50/3 per cup). &lt;/p&gt;\n\n&lt;p&gt;Bought a bag of beans for $8 and made it on a V60 at home and it came out great. Again, you&amp;#39;re not going to get a super complex cup, but it&amp;#39;s a solid light roasted blend. &lt;/p&gt;\n\n&lt;p&gt;Not sure if they can scale with this model. But maybe with a name like &amp;quot;the mix&amp;quot;, they can vary the taste profile by roasting session and consumers won&amp;#39;t be upset.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5kwq1", "score_hidden": false, "stickied": false, "created": 1492008476.0, "created_utc": 1491979676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg62f3s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "raffiki77", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "This is all just marketing hype. Any restaurant can buy 5 lb bags of specialty coffee from a local roaster and sell them at $1/cup if they have other food items they can markup to a higher price. My local coffee shop has  their 12 oz drip coffee listed at $1.85 a cup and that is a reasonable price for the quality of beans they're using. Some people choose to pay $5+ for pour-overs but that's just a luxury some people can afford and it's not something anyone would do on a daily basis.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is all just marketing hype. Any restaurant can buy 5 lb bags of specialty coffee from a local roaster and sell them at $1/cup if they have other food items they can markup to a higher price. My local coffee shop has  their 12 oz drip coffee listed at $1.85 a cup and that is a reasonable price for the quality of beans they&amp;#39;re using. Some people choose to pay $5+ for pour-overs but that&amp;#39;s just a luxury some people can afford and it&amp;#39;s not something anyone would do on a daily basis.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg62f3s", "score_hidden": false, "stickied": false, "created": 1492041541.0, "created_utc": 1492012741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg53k69", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "TheTapeDeck", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Just read Anomander's post. There are lots of words. But they're the right words. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just read Anomander&amp;#39;s post. There are lots of words. But they&amp;#39;re the right words. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg53k69", "score_hidden": false, "stickied": false, "created": 1491981470.0, "created_utc": 1491952670.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg6hscl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TheTapeDeck", "parent_id": "t1_dg69ydp", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Because coffee is unfortunately still an exploitative industry from the farm, to the processing, to the end user. Barista is still largely a minimum wage job. Green coffee buyers routinely try to screw down coffee prices, treating farmers like rubes. It is radically underpriced.\n\nI can absolutely tolerate working with the margins of the industry, currently, but in reality, high quality coffee should be going up in price, significantly. I don't think you can find another industry with the same type of supply and demand, where the prices haven't continually equalized upward.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because coffee is unfortunately still an exploitative industry from the farm, to the processing, to the end user. Barista is still largely a minimum wage job. Green coffee buyers routinely try to screw down coffee prices, treating farmers like rubes. It is radically underpriced.&lt;/p&gt;\n\n&lt;p&gt;I can absolutely tolerate working with the margins of the industry, currently, but in reality, high quality coffee should be going up in price, significantly. I don&amp;#39;t think you can find another industry with the same type of supply and demand, where the prices haven&amp;#39;t continually equalized upward.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg6hscl", "score_hidden": false, "stickied": false, "created": 1492057344.0, "created_utc": 1492028544.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg6jqqt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bluejams", "parent_id": "t1_dg6j3wk", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Higher end user cost only means better prices for farmers if it's industry wide.  The gap between diner coffee, this mid range coffee and the high end stuff we all like would need to move up in tandem for it to affect farmers. \n\nI've personally witnessed the same coffee (same imported lot, similar volume purchased / price paid) sell for $22 / lb and $13 /lb respectively....the producer did not benefit from the higher cost.\n\nThe things that will really help are supply chain reform, stricter producing country laws (and enforcing them), stronger internal infrastructure, market structure and most importantly world supply /volume that affects what farmers are paid.  IF coffee is so cheap they'll move on to other products en mass, the price of coffee will go up.\n\n\n", "edited": 1492032094.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Higher end user cost only means better prices for farmers if it&amp;#39;s industry wide.  The gap between diner coffee, this mid range coffee and the high end stuff we all like would need to move up in tandem for it to affect farmers. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve personally witnessed the same coffee (same imported lot, similar volume purchased / price paid) sell for $22 / lb and $13 /lb respectively....the producer did not benefit from the higher cost.&lt;/p&gt;\n\n&lt;p&gt;The things that will really help are supply chain reform, stricter producing country laws (and enforcing them), stronger internal infrastructure, market structure and most importantly world supply /volume that affects what farmers are paid.  IF coffee is so cheap they&amp;#39;ll move on to other products en mass, the price of coffee will go up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg6jqqt", "score_hidden": false, "stickied": false, "created": 1492059400.0, "created_utc": 1492030600.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6j3wk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Localbearexpert", "parent_id": "t1_dg69ydp", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "If were not paying farmers and farmers can not pay their workers they will eventually move on to grow something more profitable. 99% of coffee farmers do it for the money, not the love of coffee. Most of them probably never even had a cup.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If were not paying farmers and farmers can not pay their workers they will eventually move on to grow something more profitable. 99% of coffee farmers do it for the money, not the love of coffee. Most of them probably never even had a cup.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg6j3wk", "score_hidden": false, "stickied": false, "created": 1492058717.0, "created_utc": 1492029917.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69ydp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bluejams", "parent_id": "t1_dg5az5w", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Why is that what we should be doing?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why is that what we should be doing?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg69ydp", "score_hidden": false, "stickied": false, "created": 1492049297.0, "created_utc": 1492020497.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5az5w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Localbearexpert", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "What we should be doing is trying to make the consumer pay more. \nThis is the opposite, I guess that's what happens when you're owned by an investment banker.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What we should be doing is trying to make the consumer pay more. \nThis is the opposite, I guess that&amp;#39;s what happens when you&amp;#39;re owned by an investment banker.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5az5w", "score_hidden": false, "stickied": false, "created": 1491991268.0, "created_utc": 1491962468.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5r1x9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RollSkers", "parent_id": "t1_dg5knz7", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Depending on what cafes you go to drip can be really cheap. One of the shops I used to frequent was somewhere around $1.75 for a mug plus 1 refill. Espresso drinks and food prices were more in line with other shops though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depending on what cafes you go to drip can be really cheap. One of the shops I used to frequent was somewhere around $1.75 for a mug plus 1 refill. Espresso drinks and food prices were more in line with other shops though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5r1x9", "score_hidden": false, "stickied": false, "created": 1492026102.0, "created_utc": 1491997302.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5knz7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FrenchFryCattaneo", "parent_id": "t1_dg53c9a", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "The cheapest I can get a decent 12oz coffee for is about 1.80 these days. Even gas stations charge (slightly) over a buck for a cup of coffee. And I live in a rural area.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The cheapest I can get a decent 12oz coffee for is about 1.80 these days. Even gas stations charge (slightly) over a buck for a cup of coffee. And I live in a rural area.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5knz7", "score_hidden": false, "stickied": false, "created": 1492007860.0, "created_utc": 1491979060.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg53c9a", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HarryManilow", "parent_id": "t1_dg5311v", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "yeah kind of weird when the article doesn't seem to mention what's so special about the $1 coffee. plenty of good roasters also serve $1 (or so) drip coffee for those who don't want a pourover.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah kind of weird when the article doesn&amp;#39;t seem to mention what&amp;#39;s so special about the $1 coffee. plenty of good roasters also serve $1 (or so) drip coffee for those who don&amp;#39;t want a pourover.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg53c9a", "score_hidden": false, "stickied": false, "created": 1491981167.0, "created_utc": 1491952367.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5311v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CRIMExPNSHMNT", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Am I missing something? Looks like $1 for 10oz? Maybe 12oz? Dollar per once that's not much better than Starbucks (especially if you take cream and sugar).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Am I missing something? Looks like $1 for 10oz? Maybe 12oz? Dollar per once that&amp;#39;s not much better than Starbucks (especially if you take cream and sugar).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5311v", "score_hidden": false, "stickied": false, "created": 1491980743.0, "created_utc": 1491951943.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg5ufks", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ReAnimatorCoffee", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "This article is very frustrating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This article is very frustrating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5ufks", "score_hidden": false, "stickied": false, "created": 1492032039.0, "created_utc": 1492003239.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64sug1", "likes": null, "replies": "", "user_reports": [], "id": "dg4r0zg", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "AmNotLost", "parent_id": "t3_64sug1", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I'd start this in my home town. This sounds like a great model. There's even a local roaster that I think would be the one I'd ask to provide the roasts. #bemyownbossdreams", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d start this in my home town. This sounds like a great model. There&amp;#39;s even a local roaster that I think would be the one I&amp;#39;d ask to provide the roasts. #bemyownbossdreams&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg4r0zg", "score_hidden": false, "stickied": false, "created": 1491966639.0, "created_utc": 1491937839.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}]