[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Coffee", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to get a new, good, electric grinder for home use. I&amp;#39;ll use it for drip, V60, cold brew and aeropress initially, plan to get a chemex at some point. I don&amp;#39;t make espresso. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen that the Baratza Encore usually is highly recommended here, but would like to hear what you all recommend given a budget that allows up to around the cost of a Forte BG. Should I just go with the Forte, or will the Virtuoso be equally good for my use, what&amp;#39;s the difference between them? What about the Sette 30? Which brands apart from Baratza should I look at?&lt;/p&gt;\n\n&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I want to get a new, good, electric grinder for home use. I'll use it for drip, V60, cold brew and aeropress initially, plan to get a chemex at some point. I don't make espresso. \n\nI've seen that the Baratza Encore usually is highly recommended here, but would like to hear what you all recommend given a budget that allows up to around the cost of a Forte BG. Should I just go with the Forte, or will the Virtuoso be equally good for my use, what's the difference between them? What about the Sette 30? Which brands apart from Baratza should I look at?\n\nThanks!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64wp1e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "einie", "saved": false, "mod_reports": [], "name": "t3_64wp1e", "subreddit_name_prefixed": "r/Coffee", "approved_by": null, "over_18": false, "domain": "self.Coffee", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhze", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Coffee/comments/64wp1e/yet_another_grinder_recommendation_post/", "num_reports": null, "locked": false, "stickied": false, "created": 1492010396.0, "url": "https://www.reddit.com/r/Coffee/comments/64wp1e/yet_another_grinder_recommendation_post/", "author_flair_text": null, "quarantine": false, "title": "Yet another Grinder recommendation post", "created_utc": 1491981596.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64wp1e", "likes": null, "replies": "", "user_reports": [], "id": "dg602i5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bicktrav", "parent_id": "t3_64wp1e", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "My experience with Baratza has involved an Encore and a Vario with steel burrs. The Encore was tremendous for the price. It's well built, and a great buy. I don't think the Vario warrants the hefty price jump from the Encore. I found it better, but not an earth-shattering difference. I can't speak to the Forte. By all accounts it's supposed to be very good, but unless I'm mistaken it's got the same burr set as the Vario so I don't imagine there's a world of difference. I had a mediocre cup from a Forte at a shop once, but there was a technique issue on the part of the employee. She pre-wet a Kalita filter while holding it in her hand, destroyed the wave pattern; then shoved it into the cup all mangled--definitely can't blame the grinder in that case. For what it's worth, my favorite grinder is the Lido 3, but since you want electric that's probably out of the running.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My experience with Baratza has involved an Encore and a Vario with steel burrs. The Encore was tremendous for the price. It&amp;#39;s well built, and a great buy. I don&amp;#39;t think the Vario warrants the hefty price jump from the Encore. I found it better, but not an earth-shattering difference. I can&amp;#39;t speak to the Forte. By all accounts it&amp;#39;s supposed to be very good, but unless I&amp;#39;m mistaken it&amp;#39;s got the same burr set as the Vario so I don&amp;#39;t imagine there&amp;#39;s a world of difference. I had a mediocre cup from a Forte at a shop once, but there was a technique issue on the part of the employee. She pre-wet a Kalita filter while holding it in her hand, destroyed the wave pattern; then shoved it into the cup all mangled--definitely can&amp;#39;t blame the grinder in that case. For what it&amp;#39;s worth, my favorite grinder is the Lido 3, but since you want electric that&amp;#39;s probably out of the running.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg602i5", "score_hidden": false, "stickied": false, "created": 1492038968.0, "created_utc": 1492010168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64wp1e", "likes": null, "replies": "", "user_reports": [], "id": "dg5v7nt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "menschmaschine5", "parent_id": "t3_64wp1e", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "The Forte BG, by all accounts, is fantastic. I'm not sure of much else for drip grinding in the same range other than a Bunnzilla (Bunn commercial grinder modified with Ditting burrs).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Forte BG, by all accounts, is fantastic. I&amp;#39;m not sure of much else for drip grinding in the same range other than a Bunnzilla (Bunn commercial grinder modified with Ditting burrs).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5v7nt", "score_hidden": false, "stickied": false, "created": 1492033136.0, "created_utc": 1492004336.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64wp1e", "likes": null, "replies": "", "user_reports": [], "id": "dg66rmn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheLobito", "parent_id": "t3_64wp1e", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I have had both an Encore and a Virtuoso and would recommend both.  The Virtuoso has a more consistent grind, especially at the coarse end and is much better built and more solid feeling on account of the extra metal parts.  It's also faster for what that's worth.\n\nI think the Virtuoso is easily worth the extra and even more so if you make a lot of coffee.  Can't comment on the others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have had both an Encore and a Virtuoso and would recommend both.  The Virtuoso has a more consistent grind, especially at the coarse end and is much better built and more solid feeling on account of the extra metal parts.  It&amp;#39;s also faster for what that&amp;#39;s worth.&lt;/p&gt;\n\n&lt;p&gt;I think the Virtuoso is easily worth the extra and even more so if you make a lot of coffee.  Can&amp;#39;t comment on the others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg66rmn", "score_hidden": false, "stickied": false, "created": 1492046083.0, "created_utc": 1492017283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64wp1e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64wp1e", "likes": null, "replies": "", "user_reports": [], "id": "dg5w41z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kharakim", "parent_id": "t1_dg5qnoe", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "My experience with the Oxo grinder (which I've previously posted here) has not been particularly good. Oxo finally replaced my first unit under warranty, but it took a lot of back-and-forth with them to get the warranty coverage. And I'm still not happy with the accuracy of the scale on the replacement unit. I rely instead on my AWS scale.\nGrind consistency for use with my Oxo auto-drip brewer is okay, but nothing to write home about. Depending on one's standards in this respect, it may or may not be adequate. Unless I'm doing more than six cups-worth of grinding, I much prefer to rely on my Lido 3.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My experience with the Oxo grinder (which I&amp;#39;ve previously posted here) has not been particularly good. Oxo finally replaced my first unit under warranty, but it took a lot of back-and-forth with them to get the warranty coverage. And I&amp;#39;m still not happy with the accuracy of the scale on the replacement unit. I rely instead on my AWS scale.\nGrind consistency for use with my Oxo auto-drip brewer is okay, but nothing to write home about. Depending on one&amp;#39;s standards in this respect, it may or may not be adequate. Unless I&amp;#39;m doing more than six cups-worth of grinding, I much prefer to rely on my Lido 3.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5w41z", "score_hidden": false, "stickied": false, "created": 1492034331.0, "created_utc": 1492005531.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64wp1e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_64wp1e", "likes": null, "replies": "", "user_reports": [], "id": "dg7268j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "masonjarcoffee", "parent_id": "t1_dg71gvs", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Yes, I use my Forte daily and the virtuoso is in the cupboard. Definitely a slight difference but the virtuoso is a totally capable machine for daily brewing also. Mine is over 12 years old and I upgraded the gears and burrs a year and a half ago. \nOnce I brought the Forte home though there wasn't any reason for anything else ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I use my Forte daily and the virtuoso is in the cupboard. Definitely a slight difference but the virtuoso is a totally capable machine for daily brewing also. Mine is over 12 years old and I upgraded the gears and burrs a year and a half ago. \nOnce I brought the Forte home though there wasn&amp;#39;t any reason for anything else &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg7268j", "score_hidden": false, "stickied": false, "created": 1492082090.0, "created_utc": 1492053290.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71gvs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "einie", "parent_id": "t1_dg5qnoe", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Thanks!\n\nHave you tried the Virtuoso? I'm now deciding between that and the Forte, if there's a noticeable difference in result I'll go with the Forte, but if it's simply a matter of capacity and durability, the Virtuoso should be plenty for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks!&lt;/p&gt;\n\n&lt;p&gt;Have you tried the Virtuoso? I&amp;#39;m now deciding between that and the Forte, if there&amp;#39;s a noticeable difference in result I&amp;#39;ll go with the Forte, but if it&amp;#39;s simply a matter of capacity and durability, the Virtuoso should be plenty for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg71gvs", "score_hidden": false, "stickied": false, "created": 1492081141.0, "created_utc": 1492052341.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qnoe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "masonjarcoffee", "parent_id": "t3_64wp1e", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "I have a Forte BG. I love it. It's solid, easy to adjust and the touchscreen with the built in scale is so easy to use. I think the biggest differences are the touchscreen and that the fortehas a solid metal build. The Vario was made for home use andthe Forte was made for cafe use. I think Baratza recommends something like up to 5 pounds per day with the Forte and no more than one pound per day with most of their other grinders\nI have a Sette 270 with both burrs. I have used the 270 for brewing but as noted throughout this sub it's mostly geared towards espresso. You can absolutely use it for brewing, but it doesn't get very coarse. \nI don't have the Sette 30 yet. I do think they've addressed the coarseness issues with it though because I believe it's set to replace and phase out the virtuoso grinder. \n\nHonestly there isn't much else in the way of grinder manufacturers worth checking out besides Baratza in the same price range. \nYou could check out the Eureka mignon. OXO has a grinder with a built in scale. I had one for a while and gave it to a friend that uses it daily and loves it. I thought it did a pretty good job but kept my virtuoso in favor of the OXO. \n\nIf you're really into having some fun and don't mind having a beast on the counter. You could browse some classifieds for a cheap Bunn bulk grinder. Try to find one for around $100 and then spend some money to convert it to a bunnzilla (bunn with ditting burrs) that will also get you up into the vario Forte price range. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a Forte BG. I love it. It&amp;#39;s solid, easy to adjust and the touchscreen with the built in scale is so easy to use. I think the biggest differences are the touchscreen and that the fortehas a solid metal build. The Vario was made for home use andthe Forte was made for cafe use. I think Baratza recommends something like up to 5 pounds per day with the Forte and no more than one pound per day with most of their other grinders\nI have a Sette 270 with both burrs. I have used the 270 for brewing but as noted throughout this sub it&amp;#39;s mostly geared towards espresso. You can absolutely use it for brewing, but it doesn&amp;#39;t get very coarse. \nI don&amp;#39;t have the Sette 30 yet. I do think they&amp;#39;ve addressed the coarseness issues with it though because I believe it&amp;#39;s set to replace and phase out the virtuoso grinder. &lt;/p&gt;\n\n&lt;p&gt;Honestly there isn&amp;#39;t much else in the way of grinder manufacturers worth checking out besides Baratza in the same price range. \nYou could check out the Eureka mignon. OXO has a grinder with a built in scale. I had one for a while and gave it to a friend that uses it daily and loves it. I thought it did a pretty good job but kept my virtuoso in favor of the OXO. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re really into having some fun and don&amp;#39;t mind having a beast on the counter. You could browse some classifieds for a cheap Bunn bulk grinder. Try to find one for around $100 and then spend some money to convert it to a bunnzilla (bunn with ditting burrs) that will also get you up into the vario Forte price range. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dg5qnoe", "score_hidden": false, "stickied": false, "created": 1492025218.0, "created_utc": 1491996418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]