[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Coffee", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Dear Coffee Aficionados of Reddit!&lt;/p&gt;\n\n&lt;p&gt;I love Reddit. I love that there is a community of people who love coffee and are experts in coffee. I&amp;#39;d like to pick your community&amp;#39;s collective brain, please. &lt;/p&gt;\n\n&lt;p&gt;We have an office with about 60 people in it. When we had a lot fewer people we bought a: &lt;/p&gt;\n\n&lt;p&gt;De&amp;#39;Longhi MAGNIFICA SUPER AUTOMATIC ECAM 22.110.SB&lt;/p&gt;\n\n&lt;p&gt;It has recently ceased performing well and is gradually dying a slow death. So, I&amp;#39;m looking for something to replace this machine. &lt;/p&gt;\n\n&lt;p&gt;I started reading online and then I realized I was going to make a huge mistake and buy some shiny piece&amp;#39;o&amp;#39;crap, which is why I turn to you for help!&lt;/p&gt;\n\n&lt;p&gt;Thank you!\nLeo&lt;/p&gt;\n\n&lt;p&gt;Note: We also have a Nespresso commercial machine but the pods aren&amp;#39;t as good as fresh ground beans. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Dear Coffee Aficionados of Reddit!\n\nI love Reddit. I love that there is a community of people who love coffee and are experts in coffee. I'd like to pick your community's collective brain, please. \n\nWe have an office with about 60 people in it. When we had a lot fewer people we bought a: \n\nDe'Longhi MAGNIFICA SUPER AUTOMATIC ECAM 22.110.SB\n\nIt has recently ceased performing well and is gradually dying a slow death. So, I'm looking for something to replace this machine. \n\nI started reading online and then I realized I was going to make a huge mistake and buy some shiny piece'o'crap, which is why I turn to you for help!\n\nThank you!\nLeo\n\nNote: We also have a Nespresso commercial machine but the pods aren't as good as fresh ground beans. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wugd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Havage", "saved": false, "mod_reports": [], "name": "t3_65wugd", "subreddit_name_prefixed": "r/Coffee", "approved_by": null, "over_18": false, "domain": "self.Coffee", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhze", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Coffee/comments/65wugd/need_recommendation_please_beantocoffeeespresso/", "num_reports": null, "locked": false, "stickied": false, "created": 1492477603.0, "url": "https://www.reddit.com/r/Coffee/comments/65wugd/need_recommendation_please_beantocoffeeespresso/", "author_flair_text": null, "quarantine": false, "title": "Need Recommendation Please: Bean-to-Coffee/Espresso Machine for Office [Budget: $2500]", "created_utc": 1492448803.0, "distinguished": null, "media": null, "upvote_ratio": 0.61, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_65wugd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_65wugd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_65wugd", "likes": null, "replies": "", "user_reports": [], "id": "dge3g5i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "caffitulate", "parent_id": "t1_dgdyp8x", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Double reply!\n\nWe've moved a lot of the Bunn drip brewers and they are rock solid. Even harder to break than the SG200. Unfortunately I don't have any experience with the Crescendo, but if it's anything like Bunn's other offerings it will be tough as hell, not very exciting or gourmet, and will Just Work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Double reply!&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve moved a lot of the Bunn drip brewers and they are rock solid. Even harder to break than the SG200. Unfortunately I don&amp;#39;t have any experience with the Crescendo, but if it&amp;#39;s anything like Bunn&amp;#39;s other offerings it will be tough as hell, not very exciting or gourmet, and will Just Work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dge3g5i", "score_hidden": false, "stickied": false, "created": 1492490843.0, "created_utc": 1492462043.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_65wugd", "likes": null, "replies": "", "user_reports": [], "id": "dge1xb3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "caffitulate", "parent_id": "t1_dgdyp8x", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Full disclosure: I'm able to talk about these guys with some authority because where I work sells them. That said, what I'm telling you is informational and I'm not trying to troll for sales ;)\n\nThe Monza is kind of unique, and unfortunately there isn't a step \"up\" on it since it's already a one of a kind: an Italian stainless steel super automatic. That uniqueness is a bit of a double edged sword, since it's not really part of a lineup of machines like the Juras where you can pick and choose functionality. \n\nI hear ya on the SG200, I kind of think of it as \"yesterday's really tough machine\", it works but there's been so much cool stuff out since it was introduced.\n\nThe Royal OTC is kind of \"frozen\" right now; they're still making it because it's possibly the best machine for it's capacity and price in the small office sector. I believe they've spun off a line called the Aulika to eventually replace it, but I have never seen one in North America. The Aulika Top is probably what the beefier brother would be (can be plumbed in, larger bean hoppers) but I don't know if A)they are europe/australia only or B)they haven't rolled them out in north america yet.\n\nFor Jura you're going to have answer one question: Do you want plumbed in, or water tank? The majority of the medium line Jura are largish water tank machines, and plumbed in is only a feature on the top line machines (Giga x8c, Giga 9 with a kit). As for Jura vendors, they are mostly interchangeable because of Jura's aforementioned control over pricing, parts, etc. They're a bit more of a commodity product, even at the high end. The more important question for Jura is going to be service; you are going to want them to be local, and be certified to do Jura work. As I said, they're maintenance hungry machines, so you don't want to be shipping it off to the wrong coast every year. However, they're so popular there's usually an authorized reseller/service in most big cities. Assuming you're in the US I couldn't really endorse one over the other due to lack of experience with them.\n\nThe Carimali machines are... pretty hard to find, but really cool. You'll find lots of Office Coffee Service places offering to lease/rent them, but very few straight up selling them. They're very boutique and unique; the people we sell them to are usually offices that want to differentiate themselves, or impress high-end prospective clients in their waiting area, so they're definitely not your standard OCS setup. If you're serious about them maybe take it to PMs so I'm not blabbing about our business/other people's business. I know 2 guys in the states who might have them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Full disclosure: I&amp;#39;m able to talk about these guys with some authority because where I work sells them. That said, what I&amp;#39;m telling you is informational and I&amp;#39;m not trying to troll for sales ;)&lt;/p&gt;\n\n&lt;p&gt;The Monza is kind of unique, and unfortunately there isn&amp;#39;t a step &amp;quot;up&amp;quot; on it since it&amp;#39;s already a one of a kind: an Italian stainless steel super automatic. That uniqueness is a bit of a double edged sword, since it&amp;#39;s not really part of a lineup of machines like the Juras where you can pick and choose functionality. &lt;/p&gt;\n\n&lt;p&gt;I hear ya on the SG200, I kind of think of it as &amp;quot;yesterday&amp;#39;s really tough machine&amp;quot;, it works but there&amp;#39;s been so much cool stuff out since it was introduced.&lt;/p&gt;\n\n&lt;p&gt;The Royal OTC is kind of &amp;quot;frozen&amp;quot; right now; they&amp;#39;re still making it because it&amp;#39;s possibly the best machine for it&amp;#39;s capacity and price in the small office sector. I believe they&amp;#39;ve spun off a line called the Aulika to eventually replace it, but I have never seen one in North America. The Aulika Top is probably what the beefier brother would be (can be plumbed in, larger bean hoppers) but I don&amp;#39;t know if A)they are europe/australia only or B)they haven&amp;#39;t rolled them out in north america yet.&lt;/p&gt;\n\n&lt;p&gt;For Jura you&amp;#39;re going to have answer one question: Do you want plumbed in, or water tank? The majority of the medium line Jura are largish water tank machines, and plumbed in is only a feature on the top line machines (Giga x8c, Giga 9 with a kit). As for Jura vendors, they are mostly interchangeable because of Jura&amp;#39;s aforementioned control over pricing, parts, etc. They&amp;#39;re a bit more of a commodity product, even at the high end. The more important question for Jura is going to be service; you are going to want them to be local, and be certified to do Jura work. As I said, they&amp;#39;re maintenance hungry machines, so you don&amp;#39;t want to be shipping it off to the wrong coast every year. However, they&amp;#39;re so popular there&amp;#39;s usually an authorized reseller/service in most big cities. Assuming you&amp;#39;re in the US I couldn&amp;#39;t really endorse one over the other due to lack of experience with them.&lt;/p&gt;\n\n&lt;p&gt;The Carimali machines are... pretty hard to find, but really cool. You&amp;#39;ll find lots of Office Coffee Service places offering to lease/rent them, but very few straight up selling them. They&amp;#39;re very boutique and unique; the people we sell them to are usually offices that want to differentiate themselves, or impress high-end prospective clients in their waiting area, so they&amp;#39;re definitely not your standard OCS setup. If you&amp;#39;re serious about them maybe take it to PMs so I&amp;#39;m not blabbing about our business/other people&amp;#39;s business. I know 2 guys in the states who might have them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dge1xb3", "score_hidden": false, "stickied": false, "created": 1492489141.0, "created_utc": 1492460341.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdyp8x", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Havage", "parent_id": "t1_dgdvdj3", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Thank you very much for the incredibly detailed and thoughtful response. I have the ability to increase my budget if there is good justification. What would be a good \"medium office\" budget/machine combo?\n\nIs there a beefier version of the Quick Mill Monza that would work for a medium office? I would estimate 100 cups a day today and maybe even going up from there on a busy day. \n\nThe SG200 - though functional - may be too industrial for us. \n\nThe Royal OTC is really nice - does it have a beefier brother?\n\nDo you have a recommended vendor I can check out for the Carimali or the Jura? \n\nThank you very much again!\n\nedit: Someone else recommended: http://www.bunn.com/crescendo\nDo you have an opinion on it? ", "edited": 1492457327.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much for the incredibly detailed and thoughtful response. I have the ability to increase my budget if there is good justification. What would be a good &amp;quot;medium office&amp;quot; budget/machine combo?&lt;/p&gt;\n\n&lt;p&gt;Is there a beefier version of the Quick Mill Monza that would work for a medium office? I would estimate 100 cups a day today and maybe even going up from there on a busy day. &lt;/p&gt;\n\n&lt;p&gt;The SG200 - though functional - may be too industrial for us. &lt;/p&gt;\n\n&lt;p&gt;The Royal OTC is really nice - does it have a beefier brother?&lt;/p&gt;\n\n&lt;p&gt;Do you have a recommended vendor I can check out for the Carimali or the Jura? &lt;/p&gt;\n\n&lt;p&gt;Thank you very much again!&lt;/p&gt;\n\n&lt;p&gt;edit: Someone else recommended: &lt;a href=\"http://www.bunn.com/crescendo\"&gt;http://www.bunn.com/crescendo&lt;/a&gt;\nDo you have an opinion on it? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dgdyp8x", "score_hidden": false, "stickied": false, "created": 1492485508.0, "created_utc": 1492456708.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvdj3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "caffitulate", "parent_id": "t3_65wugd", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "The 22.110.SB is waaaaay under spec for that many people. I'm surprised it hasn't simply fallen over from fatigue.\n\nYou're in a bit of a weird place, because your price range is small office, but your demand level is medium office.\n\nI often recommend the Quick Mill Monza (assuming $2500 USD) because it is hands down an incredible machine, but your demand (60 ppl assuming at least each of them drink once a day) might even outstrip that chufty monster. At the very least, it would be higher maintenance (Monza is good but requires some fiddly maintenance probably every 6mos to 1 year at that level of use).\n\nIf the Monza is super smexy, the opposite is the Saeco SG200 (which oddly, is like the second time I'm reccoing it in 10 minutes). It looks like an unglamorous, stripped down vending machine, but it's ruled the low-end industrial coffee roost for close to a decade, and is available in many places used.\n\nIf you're cups per day is less than 60 (e.g. not all those people drink coffee all the time) you might want to consider another Saeco, the Saeco Royal OTC, but 60 is right at the limit of its serving ceiling, so if you're growing further it might not be the best idea. It's in your budget though; hell if you bumped up the budget you could get two and save time waiting in line. Like the SG200 it's not sexy, but it is a workhorse.\n\nSo after that you get into either the purpose-built Jura ($$$, Jura XS9 if you're lucky, Jura XJ9 if you're not). The Jura's are very nice, especially at commercial end, but they too are maintenance hungry. Jura kind of maintains a monopoly over their service and parts, and the majority of their kit isn't end-user maintainable. That means about once a year, if you're doing commercial level traffic, you have to take it in have them replace seals/membrane/other bustables. \n\nLastly are super-boutique offerings like the Carimali Blue Dot (100 drinks/day, plumbable, fresh milk, 2 bean hoppers, 2 powder containers, fully programmable) which is crazy good but I'm not even sure if anyone in the states is carrying them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The 22.110.SB is waaaaay under spec for that many people. I&amp;#39;m surprised it hasn&amp;#39;t simply fallen over from fatigue.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re in a bit of a weird place, because your price range is small office, but your demand level is medium office.&lt;/p&gt;\n\n&lt;p&gt;I often recommend the Quick Mill Monza (assuming $2500 USD) because it is hands down an incredible machine, but your demand (60 ppl assuming at least each of them drink once a day) might even outstrip that chufty monster. At the very least, it would be higher maintenance (Monza is good but requires some fiddly maintenance probably every 6mos to 1 year at that level of use).&lt;/p&gt;\n\n&lt;p&gt;If the Monza is super smexy, the opposite is the Saeco SG200 (which oddly, is like the second time I&amp;#39;m reccoing it in 10 minutes). It looks like an unglamorous, stripped down vending machine, but it&amp;#39;s ruled the low-end industrial coffee roost for close to a decade, and is available in many places used.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re cups per day is less than 60 (e.g. not all those people drink coffee all the time) you might want to consider another Saeco, the Saeco Royal OTC, but 60 is right at the limit of its serving ceiling, so if you&amp;#39;re growing further it might not be the best idea. It&amp;#39;s in your budget though; hell if you bumped up the budget you could get two and save time waiting in line. Like the SG200 it&amp;#39;s not sexy, but it is a workhorse.&lt;/p&gt;\n\n&lt;p&gt;So after that you get into either the purpose-built Jura ($$$, Jura XS9 if you&amp;#39;re lucky, Jura XJ9 if you&amp;#39;re not). The Jura&amp;#39;s are very nice, especially at commercial end, but they too are maintenance hungry. Jura kind of maintains a monopoly over their service and parts, and the majority of their kit isn&amp;#39;t end-user maintainable. That means about once a year, if you&amp;#39;re doing commercial level traffic, you have to take it in have them replace seals/membrane/other bustables. &lt;/p&gt;\n\n&lt;p&gt;Lastly are super-boutique offerings like the Carimali Blue Dot (100 drinks/day, plumbable, fresh milk, 2 bean hoppers, 2 powder containers, fully programmable) which is crazy good but I&amp;#39;m not even sure if anyone in the states is carrying them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dgdvdj3", "score_hidden": false, "stickied": false, "created": 1492481748.0, "created_utc": 1492452948.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_65wugd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhze", "removal_reason": null, "link_id": "t3_65wugd", "likes": null, "replies": "", "user_reports": [], "id": "dgdyboo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Havage", "parent_id": "t1_dgdvggo", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "Thank you for the recommendation. I can definitely increase the budget if there is good reason to do so. I'll take a look at the machine you recommend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the recommendation. I can definitely increase the budget if there is good reason to do so. I&amp;#39;ll take a look at the machine you recommend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dgdyboo", "score_hidden": false, "stickied": false, "created": 1492485079.0, "created_utc": 1492456279.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdvggo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GreeenCoffeee", "parent_id": "t3_65wugd", "subreddit_name_prefixed": "r/Coffee", "controversiality": 0, "body": "It is above your budget buy about 7-800 dollars but a bunn crescendo might be perfect for you. http://www.bunn.com/crescendo\n\n60 people is a lot, so you'll need a good machine and you really should consider a higher budget. even at 3600 (which is higher than the actual price. just makes math easy) it's a 60/person investment on day one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is above your budget buy about 7-800 dollars but a bunn crescendo might be perfect for you. &lt;a href=\"http://www.bunn.com/crescendo\"&gt;http://www.bunn.com/crescendo&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;60 people is a lot, so you&amp;#39;ll need a good machine and you really should consider a higher budget. even at 3600 (which is higher than the actual price. just makes math easy) it&amp;#39;s a 60/person investment on day one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Coffee", "name": "t1_dgdvggo", "score_hidden": false, "stickied": false, "created": 1492481836.0, "created_utc": 1492453036.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]