[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "SubredditDrama", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657ptd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "Aimless_Drifter", "saved": false, "mod_reports": [], "name": "t3_657ptd", "subreddit_name_prefixed": "r/SubredditDrama", "approved_by": null, "over_18": false, "domain": "np.reddit.com", "hidden": false, "thumbnail": "default", "subreddit_id": "t5_2ss5b", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "", "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/SubredditDrama/comments/657ptd/caste_drama_in_rindia_entries_not_reserved/", "num_reports": null, "locked": false, "stickied": false, "created": 1492140628.0, "url": "https://np.reddit.com/r/india/comments/654n2x/yogi_adityanath_ends_reservation_for_sc_st_obc/dg7dqpy/", "author_flair_text": "9 11 (2001 or 2016?)", "quarantine": false, "title": "Caste Drama in /r/India; Entries Not Reserved", "created_utc": 1492111828.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": "", "user_reports": [], "id": "dg85q9q", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "InVelluVeritas", "parent_id": "t1_dg83bfd", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "Short answer : you don't, and you call the advocates for Affirmative Action the \"real racists\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Short answer : you don&amp;#39;t, and you call the advocates for Affirmative Action the &amp;quot;real racists&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg85q9q", "score_hidden": false, "stickied": false, "created": 1492143602.0, "created_utc": 1492114802.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": "", "user_reports": [], "id": "dg8byat", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "orangitu", "parent_id": "t1_dg83bfd", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "Generally speaking AFAICT the main issue Indians have with caste-based reservations is the way they ignore actual socio-economic need. I'm not saying that someone from a disadvantaged caste is going to have the same opportunities even if they're well-off as say a well-off Brahmin, but at the same time there are plenty of stories about people using the reservations to go far when they have much more in the way of means than most Indians. I think it's honestly kind of incomparable between India and the US given that in the former you literally have tens of millions with no prospects of ever getting an education who have to watch people who could afford it in the first place get special treatment. It doesn't help that scheduled castes and scheduled tribes make up about 1/4 of the country's population.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Generally speaking AFAICT the main issue Indians have with caste-based reservations is the way they ignore actual socio-economic need. I&amp;#39;m not saying that someone from a disadvantaged caste is going to have the same opportunities even if they&amp;#39;re well-off as say a well-off Brahmin, but at the same time there are plenty of stories about people using the reservations to go far when they have much more in the way of means than most Indians. I think it&amp;#39;s honestly kind of incomparable between India and the US given that in the former you literally have tens of millions with no prospects of ever getting an education who have to watch people who could afford it in the first place get special treatment. It doesn&amp;#39;t help that scheduled castes and scheduled tribes make up about 1/4 of the country&amp;#39;s population.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg8byat", "score_hidden": false, "stickied": false, "created": 1492151104.0, "created_utc": 1492122304.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": "", "user_reports": [], "id": "dg8nlzt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MegasusPegasus", "parent_id": "t1_dg8f67q", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "I'll admit, for a time I didn't agree with the concept. I think a lot of young people lack the experience to add in a dose of reality to ideology in these kinds of things. That's not to say an experienced adult will always agree with AA or that my side is 'right.' But...I think there are young people who just don't realize quite yet that a huge amount of life is out of your control, and almost all of us will experience average obstructions in life. It's fine and dandy to say that a business should have a right to fire you no matter what until you have a sudden death in the family and realize that without those legal protections, you'd either be out a job or the market would only 'correct' for it years after you missed the funeral. \n\nI guess what I mean is that before we realize these things, moments wherein we need some protection or help, are not rare, but happen to everyone, we can argue rapidly about ideology. And ideology is important, but less so when the 'help' has little appreciable effect on said ideology. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll admit, for a time I didn&amp;#39;t agree with the concept. I think a lot of young people lack the experience to add in a dose of reality to ideology in these kinds of things. That&amp;#39;s not to say an experienced adult will always agree with AA or that my side is &amp;#39;right.&amp;#39; But...I think there are young people who just don&amp;#39;t realize quite yet that a huge amount of life is out of your control, and almost all of us will experience average obstructions in life. It&amp;#39;s fine and dandy to say that a business should have a right to fire you no matter what until you have a sudden death in the family and realize that without those legal protections, you&amp;#39;d either be out a job or the market would only &amp;#39;correct&amp;#39; for it years after you missed the funeral. &lt;/p&gt;\n\n&lt;p&gt;I guess what I mean is that before we realize these things, moments wherein we need some protection or help, are not rare, but happen to everyone, we can argue rapidly about ideology. And ideology is important, but less so when the &amp;#39;help&amp;#39; has little appreciable effect on said ideology. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg8nlzt", "score_hidden": false, "stickied": false, "created": 1492167076.0, "created_utc": 1492138276.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8f67q", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "allamacalledcarl", "parent_id": "t1_dg8f007", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "I've heard these arguments multiple times from people who I'd assumed better of. I've heard similar arguments from undergrads I teach, regarding AA here in the US, which cracks me up a bit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve heard these arguments multiple times from people who I&amp;#39;d assumed better of. I&amp;#39;ve heard similar arguments from undergrads I teach, regarding AA here in the US, which cracks me up a bit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg8f67q", "score_hidden": false, "stickied": false, "created": 1492155369.0, "created_utc": 1492126569.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8f007", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MegasusPegasus", "parent_id": "t1_dg8ejsl", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "I don't know a whole lot about the caste system, but I trust your judgement here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know a whole lot about the caste system, but I trust your judgement here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg8f007", "score_hidden": false, "stickied": false, "created": 1492155149.0, "created_utc": 1492126349.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ejsl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "allamacalledcarl", "parent_id": "t1_dg8d5lc", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "Going off on your tangent, the easiest way for someone from the US to understand this is to compare people who're taking advantage of the system to the notion of people getting rich off welfare. It's an overblown problem for something that's statistically very minor. All those guys in there crying about how someone with a reservation got a better deal on exams despite zipping around in fancy cars? They're literally using outliers to generalise the entire lot of people who avail of reservation, who also, btw make up more than 50% of the population.  \n\n\nI agree with you about making more resources available to people from much lower ages, but you have to remember that the caste tag hangs tight even after you graduate. Private companies assume that if you're from *those* categories, you're an incompetent person who got by due to reservation and often pass you over. Hiring managers are not without their biases. Another thing these guys ignore is the fact that higher caste folks have tons of connections, and their names often open doors, which are super useful professionally. I've personally seen those play out in internships. Person A is an upper caste person who's poor but whose family is well educated. Person B is a second gen, so called well off person in the reserved category. They have similar profiles, and yet when it came to summer internships, Person A had an extensive network of contacts in universities by the sheer fact that their family was an old high caste one. They had a pick of Professors who could get them a leg up in great colleges across the world. Person B had no such advantages despite being nominally richer than A. Guess who gets hired in better places after graduating?      \n\nEdit: typos and some more thoughts", "edited": 1492126347.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Going off on your tangent, the easiest way for someone from the US to understand this is to compare people who&amp;#39;re taking advantage of the system to the notion of people getting rich off welfare. It&amp;#39;s an overblown problem for something that&amp;#39;s statistically very minor. All those guys in there crying about how someone with a reservation got a better deal on exams despite zipping around in fancy cars? They&amp;#39;re literally using outliers to generalise the entire lot of people who avail of reservation, who also, btw make up more than 50% of the population.  &lt;/p&gt;\n\n&lt;p&gt;I agree with you about making more resources available to people from much lower ages, but you have to remember that the caste tag hangs tight even after you graduate. Private companies assume that if you&amp;#39;re from &lt;em&gt;those&lt;/em&gt; categories, you&amp;#39;re an incompetent person who got by due to reservation and often pass you over. Hiring managers are not without their biases. Another thing these guys ignore is the fact that higher caste folks have tons of connections, and their names often open doors, which are super useful professionally. I&amp;#39;ve personally seen those play out in internships. Person A is an upper caste person who&amp;#39;s poor but whose family is well educated. Person B is a second gen, so called well off person in the reserved category. They have similar profiles, and yet when it came to summer internships, Person A had an extensive network of contacts in universities by the sheer fact that their family was an old high caste one. They had a pick of Professors who could get them a leg up in great colleges across the world. Person B had no such advantages despite being nominally richer than A. Guess who gets hired in better places after graduating?      &lt;/p&gt;\n\n&lt;p&gt;Edit: typos and some more thoughts&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg8ejsl", "score_hidden": false, "stickied": false, "created": 1492154553.0, "created_utc": 1492125753.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8d5lc", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "MegasusPegasus", "parent_id": "t1_dg83bfd", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "Not to promote the caste system or the inequity in the US, but I *do* think there are other ways than affirmative action. That's not a criticism of the concept of affirmative action, don't get me wrong, but just hear me out. \n\nSo, from a US perspective because I can't speak for how it is in India. I think that it doesn't do enough-for college, or for certain jobs, a criterion is that the minority applicant be as qualified as prospective majority candidates. But that there is a lessened access to education, resources, food, experiences, internships, volunteering, etc leads to having a harder time becoming as qualified of an applicant, ensuring that mainly only the most privileged of minorities really benefit from such things. I'm not saying that standards should be lessened for affirmative action applications, I am more saying that we need more focus on getting people up to the point of applications. More enrichment for kids in school like going to museums, more focus on getting free pre-k for all kids so some of them don't start off school already behind, more allocation for kids to have internships, volunteer, go abroad, actually participate in extracurriculars. Those are all things that many can't afford, particularly in inner city schools which are where the densest populations of racial and ethnic minorities are.\n\nI really didn't mean to go off on a tangent about it, but I'm just saying I would like more and different ways of addressing inequality because I don't think AA is very effective. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to promote the caste system or the inequity in the US, but I &lt;em&gt;do&lt;/em&gt; think there are other ways than affirmative action. That&amp;#39;s not a criticism of the concept of affirmative action, don&amp;#39;t get me wrong, but just hear me out. &lt;/p&gt;\n\n&lt;p&gt;So, from a US perspective because I can&amp;#39;t speak for how it is in India. I think that it doesn&amp;#39;t do enough-for college, or for certain jobs, a criterion is that the minority applicant be as qualified as prospective majority candidates. But that there is a lessened access to education, resources, food, experiences, internships, volunteering, etc leads to having a harder time becoming as qualified of an applicant, ensuring that mainly only the most privileged of minorities really benefit from such things. I&amp;#39;m not saying that standards should be lessened for affirmative action applications, I am more saying that we need more focus on getting people up to the point of applications. More enrichment for kids in school like going to museums, more focus on getting free pre-k for all kids so some of them don&amp;#39;t start off school already behind, more allocation for kids to have internships, volunteer, go abroad, actually participate in extracurriculars. Those are all things that many can&amp;#39;t afford, particularly in inner city schools which are where the densest populations of racial and ethnic minorities are.&lt;/p&gt;\n\n&lt;p&gt;I really didn&amp;#39;t mean to go off on a tangent about it, but I&amp;#39;m just saying I would like more and different ways of addressing inequality because I don&amp;#39;t think AA is very effective. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg8d5lc", "score_hidden": false, "stickied": false, "created": 1492152695.0, "created_utc": 1492123895.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83bfd", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "Felinomancy", "parent_id": "t3_657ptd", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "*Another* caste drama? \n\nI'm all for egalitarianism, but if you remove positive discrimination (e.g., caste reservation in India, Affirmative Action in the US, etc.), then how are you going to address the current inequality other than telling the disadvantaged to pull their bootstraps?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Another&lt;/em&gt; caste drama? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m all for egalitarianism, but if you remove positive discrimination (e.g., caste reservation in India, Affirmative Action in the US, etc.), then how are you going to address the current inequality other than telling the disadvantaged to pull their bootstraps?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg83bfd", "score_hidden": false, "stickied": false, "created": 1492140962.0, "created_utc": 1492112162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ss5b", "removal_reason": null, "link_id": "t3_657ptd", "likes": null, "replies": "", "user_reports": [], "id": "dg831ta", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SnapshillBot", "parent_id": "t3_657ptd", "subreddit_name_prefixed": "r/SubredditDrama", "controversiality": 0, "body": "You're oversimplifying a complex situation to the point of adding nothing to the discussion.\n\nSnapshots:\n\n1. *This Post* - [archive.org](https://web.archive.org/20170413193109/http://www.reddit.com/r/india/comments/654n2x/yogi_adityanath_ends_reservation_for_sc_st_obc/dg7dqpy/), [_megalodon.jp\\*_](http://megalodon.jp/?url=http://www.reddit.com/r/india/comments/654n2x/yogi_adityanath_ends_reservation_for_sc_st_obc/dg7dqpy/ \"could not auto-archive; click to resubmit it!\"), [ceddit.com](http://www.ceddit.com//r/india/comments/654n2x/yogi_adityanath_ends_reservation_for_sc_st_obc/dg7dqpy/), [_archive.is\\*_](https://archive.is/?url=http%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F654n2x%2Fyogi_adityanath_ends_reservation_for_sc_st_obc%2Fdg7dqpy%2F&amp;run=1 \"could not auto-archive; click to resubmit it!\")\n\n*^(I am a bot.) ^\\([*Info*](/r/SnapshillBot) ^/ ^[*Contact*](/message/compose?to=\\/r\\/SnapshillBot))*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re oversimplifying a complex situation to the point of adding nothing to the discussion.&lt;/p&gt;\n\n&lt;p&gt;Snapshots:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;em&gt;This Post&lt;/em&gt; - &lt;a href=\"https://web.archive.org/20170413193109/http://www.reddit.com/r/india/comments/654n2x/yogi_adityanath_ends_reservation_for_sc_st_obc/dg7dqpy/\"&gt;archive.org&lt;/a&gt;, &lt;a href=\"http://megalodon.jp/?url=http://www.reddit.com/r/india/comments/654n2x/yogi_adityanath_ends_reservation_for_sc_st_obc/dg7dqpy/\" title=\"could not auto-archive; click to resubmit it!\"&gt;&lt;em&gt;megalodon.jp*&lt;/em&gt;&lt;/a&gt;, &lt;a href=\"http://www.ceddit.com//r/india/comments/654n2x/yogi_adityanath_ends_reservation_for_sc_st_obc/dg7dqpy/\"&gt;ceddit.com&lt;/a&gt;, &lt;a href=\"https://archive.is/?url=http%3A%2F%2Fwww.reddit.com%2Fr%2Findia%2Fcomments%2F654n2x%2Fyogi_adityanath_ends_reservation_for_sc_st_obc%2Fdg7dqpy%2F&amp;amp;run=1\" title=\"could not auto-archive; click to resubmit it!\"&gt;&lt;em&gt;archive.is*&lt;/em&gt;&lt;/a&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;em&gt;&lt;sup&gt;I am a bot.&lt;/sup&gt; &lt;sup&gt;(&lt;a href=\"/r/SnapshillBot\"&gt;&lt;em&gt;Info&lt;/em&gt;&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;/&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"/message/compose?to=/r/SnapshillBot\"&gt;&lt;em&gt;Contact&lt;/em&gt;&lt;/a&gt;)&lt;/sup&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "SubredditDrama", "name": "t1_dg831ta", "score_hidden": false, "stickied": false, "created": 1492140671.0, "created_utc": 1492111871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]