[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "loseit", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Long post will be long, but:&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been overweight for a long, long time. When I was a kiddo I was overweight--not a super huge amount, but still enough to make me weigh far more than other kids my age. My parents said they never saw me as overweight, but at some point I could tell, since I was bigger than my older brother and sister. I&amp;#39;m pretty sure my BMI has never been in the normal range since age 5. &lt;/p&gt;\n\n&lt;p&gt;Ever since I can remember I&amp;#39;ve loved food. All food. Fruits, veggies, carbs, fats, home-cooked foods, 5-star restaurant foods, greasy take-out--it really doesn&amp;#39;t matter, and I still love these foods. But when I was young, there were times when I&amp;#39;d eat so much I became physically sick. There were times when I&amp;#39;d watch my brother and sister pick at their plates and I&amp;#39;d already inhaled 2 servings of the dinner my mom made and I&amp;#39;d be sitting there, staring at their plates, willing their food to appear on mine. I&amp;#39;d sneak into the pantry late at night and eat from the family-size jar of peanut butter while sitting on the couch. When my friends at school would go to throw away their lunches, I&amp;#39;d stop them and offer to eat their remnants--even after I&amp;#39;d already eaten mine. When I saw someone eat only a small meal I would chide them and tell them they should eat more so they can be healthy. Whenever there was a school event like Valentines or Christmas in the classrooms and food was brought, most of it would end up in my stomach. I would eat butter and frosting out of the cartons because they tasted good and surely no one would notice several spoonfuls missing.&lt;/p&gt;\n\n&lt;p&gt;When I turned 12 my parents went on a diet called SugarBusters, and subsequently put me and my siblings on it too. But I took it one step further because I wanted to be thin like my siblings. I tried to stop eating junk food--this lasted all of 2 weeks. I tried eating nothing but salads--that lasted maybe a month. I tried this and that, Curves, Weight Watchers, calorie counting, etc. nothing really did any good, and I&amp;#39;d gain the weight back anyway. Every Diet I tried was unfair--why aren&amp;#39;t I losing weight even though I&amp;#39;m depriving myself? My brother and sister get to eat whatever they want and don&amp;#39;t gain weight! Each diet would fail within the year, and I would yo-yo between 180 and 224.&lt;/p&gt;\n\n&lt;p&gt;My highest weight was 224 pounds (101kg). My height is 5&amp;#39;4&amp;#39;&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;But no, I wasn&amp;#39;t obese, just a little chubby. Everyone said so. &lt;/p&gt;\n\n&lt;p&gt;Eventually I fell into the &amp;quot;If I can&amp;#39;t be thin, then it doesn&amp;#39;t matter and screw everyone else I&amp;#39;m beautiful.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That was the wrong thinking for me, because it turned me into an entitled little tart. And I was mean to &amp;quot;Skinny bitches&amp;quot; and others who weren&amp;#39;t as big. I did mental leaps to convince myself that I was ok with who I was, that I was healthy at my weight and nothing was wrong with my size.&lt;/p&gt;\n\n&lt;p&gt;So imagine my surprise when I&amp;#39;m told I have 44% of my kidney function left at age 21.&lt;/p&gt;\n\n&lt;p&gt;Imagine my surprise when I&amp;#39;m told that being overweight puts me at risk for surgery should I need a transplant soon.&lt;/p&gt;\n\n&lt;p&gt;Imagine my surprise when I&amp;#39;m told my weight is affecting the health of my organs.&lt;/p&gt;\n\n&lt;p&gt;Alright, fine then. I&amp;#39;ll get serious.&lt;/p&gt;\n\n&lt;p&gt;For about 1 year this lasted, and I got down to my lowest at the time: 166lbs. I altered my food intake to match that of what would put the least amount of stress on my internal organs, stopped drinking soda and milk, cut down on my protein, potassium, sodium, and phosphorus intake (which is stupidly hard. I think I subsisted off of bell peppers and onions for the most part), and I started drinking more water. But it was so hard to &amp;quot;eat right&amp;quot; when others around you don&amp;#39;t, so yet again, I fell off the wagon. &lt;/p&gt;\n\n&lt;p&gt;Kidney function now down to 22%, I start the Haylie Pomroy Fast Metabolism Diet at age 23, and get down to my then lowest, 164lbs. I also attempt Shawn-T&amp;#39;s Insanity and actually manage to make it the entire program. The FM diet was great! The portion sizes I ate were massive and yet the weight was still falling off of me! But the way this diet works is very strict and restricts many food groups completely, and also requires tremendous amounts of food and constant cooking. The workout program ended and the structure I had was gone, so I fell off of both.&lt;/p&gt;\n\n&lt;p&gt;The weight began building back up and I lied to myself, convinced that it was bloating, or muscle, anything to keep myself from believing that I was undoing my hard work and effort AGAIN. &lt;/p&gt;\n\n&lt;p&gt;A friend introduces me to Bouldering (like rock climbing, without harnesses). I&amp;#39;m pretty good at it considering my size and lack of muscle mass and complete and utter terror of heights. I start &amp;quot;eating healthy&amp;quot; again and I get down to 177lbs and maintain it for a while. It feels nice, but I miss being at 164lbs.&lt;/p&gt;\n\n&lt;p&gt;Flash forward September 16, 2016, age 24, nearly 25: +1 kidney obtained, dialysis averted. Feeling pretty good.&lt;/p&gt;\n\n&lt;p&gt;Recovery is hell, I eat whatever is quick and easy and doesn&amp;#39;t require me to get up and feel like my organs are trying to spill out. I can&amp;#39;t go back to Bouldering because it&amp;#39;s a high impact activity which is too intense for me at the moment.&lt;/p&gt;\n\n&lt;p&gt;Three weeks later it feels like the circulation in my right leg gets cut off and I feel swollen. My right leg increases in size, and decreases in flexibility; it feels full and gross and I hate moving it. I have to go back to the hospital because it seems that during the transplant surgery, several lymph nodes were cut open and leaking lymph into the kidney pocket that was made to house my new organ. &lt;/p&gt;\n\n&lt;p&gt;I remember stepping onto a scale so they could get my body weight and script out pain meds because I&amp;#39;m in so much discomfort. &lt;/p&gt;\n\n&lt;p&gt;The scale read 191. I cried openly.&lt;/p&gt;\n\n&lt;p&gt;They tried to tell me it was only water weight, but that wasn&amp;#39;t it. I had seen my future in that moment. &lt;/p&gt;\n\n&lt;p&gt;That if I didn&amp;#39;t get my shit together, I would go back up in weight. I would be swollen and uncomfortable in my own skin. I wouldn&amp;#39;t be able to move like I wanted to. I would be ruining the organ some stranger gave so that I would have a second chance at a normal life because I couldn&amp;#39;t stop eating. I would continue this trend of lose, gain, lose, gain, and so on. I can&amp;#39;t keep doing that to myself.&lt;/p&gt;\n\n&lt;p&gt;I took the rest of the week to finish recovering (I had to be reopened up to route that lymph fluid out of my kidney-pocket), and then booted up my old Loseit app from forever ago. The last weight recorded in there was 200lbs. &lt;/p&gt;\n\n&lt;p&gt;Before I tried this next round of dieting, I had to take a step back and set a few ground rules for myself:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I will count calories, but I will not let the numbers destroy me.\nthis means, essentially, I will have good days where I eat to my limit and no more, and I will have bad days where I overeat. I refuse to feel guilty about it unless it happens every day for a week. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It&amp;#39;s not a race.\nDieting before had always been a &amp;quot;I NEED TO LOSE WEIGHT AS FAST AS POSSIBLE&amp;quot; and when I stopped losing weight, I gave up and began eating. This time, I will not lose my mind when the scale stays the same, or even increases a little. If it takes 5 years to get down to my goal weight and I can stay there for the next 50 years, great.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It&amp;#39;s not a Diet\nIt&amp;#39;s not a diet that I can quit later when I&amp;#39;ve lost all the weight. This is a lifestyle change because I want to make good choices for the rest of my life and try to keep my kidney as long as I can.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Moderation\nThis should be a no-brainer, but in other diets I have been on, they have been all about restriction: no dairy, no carbs, fruit only in the morning, no sugar, etc. One of the reasons why I fell off the bandwagon so many times is because I was tired of depriving myself. This time, if I want to eat Ice cream, I&amp;#39;ll eat it. If I want to eat that 800-cal burger, I will. But I need to understand that these are treats and not to eat them all the time.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Learn that I have issues with food.\nMy brain tells me I&amp;#39;m hungry constantly. I impulse eat, I binge eat, and it seems like my stomach never knows when it&amp;#39;s full and I rarely get the signal from it to stop eating because there is no space left for food. I&amp;#39;ve had to figure this stuff out because no one told me food addiction was a thing. I will constantly be working toward learning healthy behaviors regarding food, because I will face a battle with it every day until I die.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;This sub and others were great inspiration. Especially with CICO and everyone&amp;#39;s advice. &lt;/p&gt;\n\n&lt;p&gt;I go bouldering at least 3 times a week for 30-40 minute sessions. It&amp;#39;s great for building self-esteem and also facing my fear of heights (and social anxiety). If I don&amp;#39;t go bouldering, I&amp;#39;ll go on a walk/jog with my dog and use the Zombies, Run! or ReQ walk apps to help motivate me. I&amp;#39;m slowly trying to introduce some yoga/stretching into my week just because some of the methods used to climb make me twist my body into weird shapes and require balance. My calorie limit was about 1000, but it&amp;#39;s up to 1300 now just to give me some wiggle room with my foods. I&amp;#39;m still having some issues with impulse and binge eating, but it is better than it was. (Though not today. I ate an entire bag of kettle corn and a bunch of sunflower seeds. my calorie intake was 1943 all said and done, but it&amp;#39;s right around my BMR, so I don&amp;#39;t feel as bad about it. But tomorrow will be better.)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been tracking my food (yes, all of them, even the smallest bites and nibbles on food)for 185 days straight (my longest streak) and I&amp;#39;m now down to 147, just 2 pounds left to go until I&amp;#39;ll finally have a normal BMI for the first time. The scale has been stuck like that for a month, but I&amp;#39;m not deterred. I will get down to 124 eventually.&lt;/p&gt;\n\n&lt;p&gt;But I can tell all of you, I&amp;#39;m so much happier with myself. I&amp;#39;m able to move better, I can control myself around food more (not perfect, but still working on it), I can actually climb on things, like actually physically move my own body with my own strength. I haven&amp;#39;t ever seen muscles on myself before now and it scared me because I thought that maybe they were malignant growths or something because I&amp;#39;m an idiot, and I&amp;#39;ve never been able to feel my own muscles without a thick layer of fat hiding them. My transplant doctors are all super proud of me and impressed with my bloodwork and everything. &lt;/p&gt;\n\n&lt;p&gt;Thanks for reading! Sorry it was so long, I just had a lot to get off my chest, and I have a lot to be proud of.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Long post will be long, but:\n\nI've been overweight for a long, long time. When I was a kiddo I was overweight--not a super huge amount, but still enough to make me weigh far more than other kids my age. My parents said they never saw me as overweight, but at some point I could tell, since I was bigger than my older brother and sister. I'm pretty sure my BMI has never been in the normal range since age 5. \n\nEver since I can remember I've loved food. All food. Fruits, veggies, carbs, fats, home-cooked foods, 5-star restaurant foods, greasy take-out--it really doesn't matter, and I still love these foods. But when I was young, there were times when I'd eat so much I became physically sick. There were times when I'd watch my brother and sister pick at their plates and I'd already inhaled 2 servings of the dinner my mom made and I'd be sitting there, staring at their plates, willing their food to appear on mine. I'd sneak into the pantry late at night and eat from the family-size jar of peanut butter while sitting on the couch. When my friends at school would go to throw away their lunches, I'd stop them and offer to eat their remnants--even after I'd already eaten mine. When I saw someone eat only a small meal I would chide them and tell them they should eat more so they can be healthy. Whenever there was a school event like Valentines or Christmas in the classrooms and food was brought, most of it would end up in my stomach. I would eat butter and frosting out of the cartons because they tasted good and surely no one would notice several spoonfuls missing.\n\nWhen I turned 12 my parents went on a diet called SugarBusters, and subsequently put me and my siblings on it too. But I took it one step further because I wanted to be thin like my siblings. I tried to stop eating junk food--this lasted all of 2 weeks. I tried eating nothing but salads--that lasted maybe a month. I tried this and that, Curves, Weight Watchers, calorie counting, etc. nothing really did any good, and I'd gain the weight back anyway. Every Diet I tried was unfair--why aren't I losing weight even though I'm depriving myself? My brother and sister get to eat whatever they want and don't gain weight! Each diet would fail within the year, and I would yo-yo between 180 and 224.\n\nMy highest weight was 224 pounds (101kg). My height is 5'4''.\n\nBut no, I wasn't obese, just a little chubby. Everyone said so. \n\nEventually I fell into the \"If I can't be thin, then it doesn't matter and screw everyone else I'm beautiful.\"\n\nThat was the wrong thinking for me, because it turned me into an entitled little tart. And I was mean to \"Skinny bitches\" and others who weren't as big. I did mental leaps to convince myself that I was ok with who I was, that I was healthy at my weight and nothing was wrong with my size.\n\nSo imagine my surprise when I'm told I have 44% of my kidney function left at age 21.\n\nImagine my surprise when I'm told that being overweight puts me at risk for surgery should I need a transplant soon.\n\nImagine my surprise when I'm told my weight is affecting the health of my organs.\n\nAlright, fine then. I'll get serious.\n\nFor about 1 year this lasted, and I got down to my lowest at the time: 166lbs. I altered my food intake to match that of what would put the least amount of stress on my internal organs, stopped drinking soda and milk, cut down on my protein, potassium, sodium, and phosphorus intake (which is stupidly hard. I think I subsisted off of bell peppers and onions for the most part), and I started drinking more water. But it was so hard to \"eat right\" when others around you don't, so yet again, I fell off the wagon. \n\nKidney function now down to 22%, I start the Haylie Pomroy Fast Metabolism Diet at age 23, and get down to my then lowest, 164lbs. I also attempt Shawn-T's Insanity and actually manage to make it the entire program. The FM diet was great! The portion sizes I ate were massive and yet the weight was still falling off of me! But the way this diet works is very strict and restricts many food groups completely, and also requires tremendous amounts of food and constant cooking. The workout program ended and the structure I had was gone, so I fell off of both.\n\nThe weight began building back up and I lied to myself, convinced that it was bloating, or muscle, anything to keep myself from believing that I was undoing my hard work and effort AGAIN. \n\nA friend introduces me to Bouldering (like rock climbing, without harnesses). I'm pretty good at it considering my size and lack of muscle mass and complete and utter terror of heights. I start \"eating healthy\" again and I get down to 177lbs and maintain it for a while. It feels nice, but I miss being at 164lbs.\n\nFlash forward September 16, 2016, age 24, nearly 25: +1 kidney obtained, dialysis averted. Feeling pretty good.\n\nRecovery is hell, I eat whatever is quick and easy and doesn't require me to get up and feel like my organs are trying to spill out. I can't go back to Bouldering because it's a high impact activity which is too intense for me at the moment.\n\nThree weeks later it feels like the circulation in my right leg gets cut off and I feel swollen. My right leg increases in size, and decreases in flexibility; it feels full and gross and I hate moving it. I have to go back to the hospital because it seems that during the transplant surgery, several lymph nodes were cut open and leaking lymph into the kidney pocket that was made to house my new organ. \n\nI remember stepping onto a scale so they could get my body weight and script out pain meds because I'm in so much discomfort. \n\nThe scale read 191. I cried openly.\n\nThey tried to tell me it was only water weight, but that wasn't it. I had seen my future in that moment. \n\nThat if I didn't get my shit together, I would go back up in weight. I would be swollen and uncomfortable in my own skin. I wouldn't be able to move like I wanted to. I would be ruining the organ some stranger gave so that I would have a second chance at a normal life because I couldn't stop eating. I would continue this trend of lose, gain, lose, gain, and so on. I can't keep doing that to myself.\n\nI took the rest of the week to finish recovering (I had to be reopened up to route that lymph fluid out of my kidney-pocket), and then booted up my old Loseit app from forever ago. The last weight recorded in there was 200lbs. \n\nBefore I tried this next round of dieting, I had to take a step back and set a few ground rules for myself:\n\n1. I will count calories, but I will not let the numbers destroy me.\nthis means, essentially, I will have good days where I eat to my limit and no more, and I will have bad days where I overeat. I refuse to feel guilty about it unless it happens every day for a week. \n\n2. It's not a race.\nDieting before had always been a \"I NEED TO LOSE WEIGHT AS FAST AS POSSIBLE\" and when I stopped losing weight, I gave up and began eating. This time, I will not lose my mind when the scale stays the same, or even increases a little. If it takes 5 years to get down to my goal weight and I can stay there for the next 50 years, great.\n\n3. It's not a Diet\nIt's not a diet that I can quit later when I've lost all the weight. This is a lifestyle change because I want to make good choices for the rest of my life and try to keep my kidney as long as I can.\n\n4. Moderation\nThis should be a no-brainer, but in other diets I have been on, they have been all about restriction: no dairy, no carbs, fruit only in the morning, no sugar, etc. One of the reasons why I fell off the bandwagon so many times is because I was tired of depriving myself. This time, if I want to eat Ice cream, I'll eat it. If I want to eat that 800-cal burger, I will. But I need to understand that these are treats and not to eat them all the time.\n\n5. Learn that I have issues with food.\nMy brain tells me I'm hungry constantly. I impulse eat, I binge eat, and it seems like my stomach never knows when it's full and I rarely get the signal from it to stop eating because there is no space left for food. I've had to figure this stuff out because no one told me food addiction was a thing. I will constantly be working toward learning healthy behaviors regarding food, because I will face a battle with it every day until I die.\n\nThis sub and others were great inspiration. Especially with CICO and everyone's advice. \n\nI go bouldering at least 3 times a week for 30-40 minute sessions. It's great for building self-esteem and also facing my fear of heights (and social anxiety). If I don't go bouldering, I'll go on a walk/jog with my dog and use the Zombies, Run! or ReQ walk apps to help motivate me. I'm slowly trying to introduce some yoga/stretching into my week just because some of the methods used to climb make me twist my body into weird shapes and require balance. My calorie limit was about 1000, but it's up to 1300 now just to give me some wiggle room with my foods. I'm still having some issues with impulse and binge eating, but it is better than it was. (Though not today. I ate an entire bag of kettle corn and a bunch of sunflower seeds. my calorie intake was 1943 all said and done, but it's right around my BMR, so I don't feel as bad about it. But tomorrow will be better.)\n\nI've been tracking my food (yes, all of them, even the smallest bites and nibbles on food)for 185 days straight (my longest streak) and I'm now down to 147, just 2 pounds left to go until I'll finally have a normal BMI for the first time. The scale has been stuck like that for a month, but I'm not deterred. I will get down to 124 eventually.\n\nBut I can tell all of you, I'm so much happier with myself. I'm able to move better, I can control myself around food more (not perfect, but still working on it), I can actually climb on things, like actually physically move my own body with my own strength. I haven't ever seen muscles on myself before now and it scared me because I thought that maybe they were malignant growths or something because I'm an idiot, and I've never been able to feel my own muscles without a thick layer of fat hiding them. My transplant doctors are all super proud of me and impressed with my bloodwork and everything. \n\nThanks for reading! Sorry it was so long, I just had a lot to get off my chest, and I have a lot to be proud of.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "", "id": "64whxr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 85, "report_reasons": null, "author": "VetTechnicallyNotYet", "saved": false, "mod_reports": [], "name": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "approved_by": null, "over_18": false, "domain": "self.loseit", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rz8w", "edited": false, "link_flair_css_class": "", "author_flair_css_class": "-080lbs", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/loseit/comments/64whxr/ive_been_a_chronic_dieter_since_i_was_12_im/", "num_reports": null, "locked": false, "stickied": false, "created": 1492006930.0, "url": "https://www.reddit.com/r/loseit/comments/64whxr/ive_been_a_chronic_dieter_since_i_was_12_im/", "author_flair_text": "+1 Kidney, -80lbs. ", "quarantine": false, "title": "I've been a chronic dieter since I was 12. I'm finally at my lowest weight.", "created_utc": 1491978130.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 85}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5lk02", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "poopymcpooperpants11", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Wow! What a hard time you've been through. I admire all your hard work and dedication. You don't need me to say it bc you already know it, but you*will* get there and the scale *will* budge!\n\nMany congrats. Here's to hoping you won't need any more surgeries in the future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow! What a hard time you&amp;#39;ve been through. I admire all your hard work and dedication. You don&amp;#39;t need me to say it bc you already know it, but you&lt;em&gt;will&lt;/em&gt; get there and the scale &lt;em&gt;will&lt;/em&gt; budge!&lt;/p&gt;\n\n&lt;p&gt;Many congrats. Here&amp;#39;s to hoping you won&amp;#39;t need any more surgeries in the future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5lk02", "score_hidden": false, "stickied": false, "created": 1492010186.0, "created_utc": 1491981386.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5tu2y", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "strranger101", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I normally wouldn't read a post this long, but this one was phenomenal. A lot about your childhood sounds familiar, likely to a lot of people on this sub. I weighed over 200 when I graduated high school, that was a few years ago but around 190 last August, when I lost 30 pounds to get down to 160 in late November, which has been my lowest weight since middle school! That being said, after New Years' I started eating my old diet. And since then I've just been trying to suppress my urge to eat and failing, if I hadn't suppressed it at all I'd weigh well over 200 again right now, but I did somewhat so I weighed myself this morning at 174.2. Which put me in a mood, naturally. I read your post and realized that i miss the excitement of looking at the scale in the mornings as \"let's see how much my effort yesterday helped\" and with fluctuations in water weight your weight drops and rises and etc, but I was at a point where I could guess almost to a decimal place what my weight would be. It was exhilarating, and I wanted that every day. The thing is though, now that I've gained back 15 pounds, I still treat the scale with that kind of reverence. So I eat an awful diet, and then in the mornings don't weigh myself because it's a choice, I don't have to make it, and if I don't make it I don't have to see the number and know with numerical clarity, the consequences of my decisions. So, everything you said about stuff honesty is true here, I need brutality with myself to kick myself back into the place where I want to weigh myself every day just to smile even when I know it's just water weight that I've lost. Sorry to make the whole comment about me, I appreciate your post a lot, and I just wanted to relate why, because I'm an egotist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I normally wouldn&amp;#39;t read a post this long, but this one was phenomenal. A lot about your childhood sounds familiar, likely to a lot of people on this sub. I weighed over 200 when I graduated high school, that was a few years ago but around 190 last August, when I lost 30 pounds to get down to 160 in late November, which has been my lowest weight since middle school! That being said, after New Years&amp;#39; I started eating my old diet. And since then I&amp;#39;ve just been trying to suppress my urge to eat and failing, if I hadn&amp;#39;t suppressed it at all I&amp;#39;d weigh well over 200 again right now, but I did somewhat so I weighed myself this morning at 174.2. Which put me in a mood, naturally. I read your post and realized that i miss the excitement of looking at the scale in the mornings as &amp;quot;let&amp;#39;s see how much my effort yesterday helped&amp;quot; and with fluctuations in water weight your weight drops and rises and etc, but I was at a point where I could guess almost to a decimal place what my weight would be. It was exhilarating, and I wanted that every day. The thing is though, now that I&amp;#39;ve gained back 15 pounds, I still treat the scale with that kind of reverence. So I eat an awful diet, and then in the mornings don&amp;#39;t weigh myself because it&amp;#39;s a choice, I don&amp;#39;t have to make it, and if I don&amp;#39;t make it I don&amp;#39;t have to see the number and know with numerical clarity, the consequences of my decisions. So, everything you said about stuff honesty is true here, I need brutality with myself to kick myself back into the place where I want to weigh myself every day just to smile even when I know it&amp;#39;s just water weight that I&amp;#39;ve lost. Sorry to make the whole comment about me, I appreciate your post a lot, and I just wanted to relate why, because I&amp;#39;m an egotist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5tu2y", "score_hidden": false, "stickied": false, "created": 1492031140.0, "created_utc": 1492002340.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5nwrq", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "curiousblueleo", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "You have so much to be proud of!! I'm super proud of you too, even though I'm a complete stranger :) An inspirational read, congratulations for battling through it all and making it out the other side a happier person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have so much to be proud of!! I&amp;#39;m super proud of you too, even though I&amp;#39;m a complete stranger :) An inspirational read, congratulations for battling through it all and making it out the other side a happier person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5nwrq", "score_hidden": false, "stickied": false, "created": 1492017304.0, "created_utc": 1491988504.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5u8w8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ashnjaco", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "You have clearly overcame sooo much! Your story was very interesting to read- I kept wanting to read more and more. You are a wonderful writer. \nAlso, I gasped when I saw how low you are down to- GREAT JOB! You have made a ton of progress and will be to your goal weight before you know it! \nI think it’s so important that you realize a day here or there at maintenance (or above) won’t derail your progress! I know that I’m in this for the long haul and working on healthy life changes, but I still feel guilty even eating at maintenance. It’s a good reminder that it doesn’t matter much in the grand scheme of things. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have clearly overcame sooo much! Your story was very interesting to read- I kept wanting to read more and more. You are a wonderful writer. \nAlso, I gasped when I saw how low you are down to- GREAT JOB! You have made a ton of progress and will be to your goal weight before you know it! \nI think it’s so important that you realize a day here or there at maintenance (or above) won’t derail your progress! I know that I’m in this for the long haul and working on healthy life changes, but I still feel guilty even eating at maintenance. It’s a good reminder that it doesn’t matter much in the grand scheme of things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5u8w8", "score_hidden": false, "stickied": false, "created": 1492031763.0, "created_utc": 1492002963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5qm3r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Senor-Foggy-Law", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Congrats! Zombie, Run! is the best, isn't it? :)\n\nI don't usually read posts this long, but the whole thing was very inspiring and well-written, and I and a lot of other people are very happy for you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats! Zombie, Run! is the best, isn&amp;#39;t it? :)&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t usually read posts this long, but the whole thing was very inspiring and well-written, and I and a lot of other people are very happy for you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5qm3r", "score_hidden": false, "stickied": false, "created": 1492025117.0, "created_utc": 1491996317.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5v6dj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "emmawriter", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "What an amazing story! I'm so proud of you for coming up on top after all your ups and downs, and the lymph node horrors. I'm off to check out that ResQ app now, first time I've heard of it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What an amazing story! I&amp;#39;m so proud of you for coming up on top after all your ups and downs, and the lymph node horrors. I&amp;#39;m off to check out that ResQ app now, first time I&amp;#39;ve heard of it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5v6dj", "score_hidden": false, "stickied": false, "created": 1492033088.0, "created_utc": 1492004288.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5o2w8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LosingTheWeight9", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "This was amazing. I hope you keep up what you're doing. Looks like you're never going back. Congrats!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was amazing. I hope you keep up what you&amp;#39;re doing. Looks like you&amp;#39;re never going back. Congrats!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5o2w8", "score_hidden": false, "stickied": false, "created": 1492017844.0, "created_utc": 1491989044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5t3ki", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "polishium", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I'm so proud of you!! I really enjoyed reading this, it made me so happy for all your progress and I respect the vulnerability you've shown in sharing this. Keep on kicking butt, this is just the beginning of your awesome healthy future :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so proud of you!! I really enjoyed reading this, it made me so happy for all your progress and I respect the vulnerability you&amp;#39;ve shown in sharing this. Keep on kicking butt, this is just the beginning of your awesome healthy future :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5t3ki", "score_hidden": false, "stickied": false, "created": 1492029970.0, "created_utc": 1492001170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5xlt6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TruCh4inz", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "&gt; My height is 5'4''.\n&gt; \n&gt; My calorie limit was about 1000, but it's up to 1300 now just to give me some wiggle room with my foods.\n\ni'm glad you boosted your calories up. unless you're around 5 feet or below it generally isn't advisable to be eating below 1200 calories. anyway, in addition to fantastic weight progress, you've clearly demonstrated an amazing amount of grit that is a victory in and of itself. i've been bouldering once, and it was brutal! for what it's worth: i'm very impressed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;My height is 5&amp;#39;4&amp;#39;&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;My calorie limit was about 1000, but it&amp;#39;s up to 1300 now just to give me some wiggle room with my foods.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;i&amp;#39;m glad you boosted your calories up. unless you&amp;#39;re around 5 feet or below it generally isn&amp;#39;t advisable to be eating below 1200 calories. anyway, in addition to fantastic weight progress, you&amp;#39;ve clearly demonstrated an amazing amount of grit that is a victory in and of itself. i&amp;#39;ve been bouldering once, and it was brutal! for what it&amp;#39;s worth: i&amp;#39;m very impressed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5xlt6", "score_hidden": false, "stickied": false, "created": 1492036164.0, "created_utc": 1492007364.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg5xzfk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ChickadeeShoes", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Congratulations! This is an incredible story, and you should be so, so proud of yourself. I'm so happy for you! 😊", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congratulations! This is an incredible story, and you should be so, so proud of yourself. I&amp;#39;m so happy for you! 😊&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg5xzfk", "score_hidden": false, "stickied": false, "created": 1492036607.0, "created_utc": 1492007807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg60nhu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Annatolia", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Proud of you, dude! You've come a long way in such a short time, and I'm happy for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Proud of you, dude! You&amp;#39;ve come a long way in such a short time, and I&amp;#39;m happy for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg60nhu", "score_hidden": false, "stickied": false, "created": 1492039609.0, "created_utc": 1492010809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg6sajx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SparksAfterTheSunset", "parent_id": "t1_dg6s7gr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "You are awesome! Way to get through those cravings. Climb on!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are awesome! Way to get through those cravings. Climb on!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg6sajx", "score_hidden": false, "stickied": false, "created": 1492069773.0, "created_utc": 1492040973.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6s7gr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "VetTechnicallyNotYet", "parent_id": "t1_dg67pfp", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I'll be honest, lately it's been hard ignoring those impulses. \n\nIt helps to not be around food, and not have foods that are impulse-foods around. \n\nLike, right now there's nothing in my pantry I can binge eat unless I want to go through the trouble of cooking pasta and beans (that's all I have in addition to flour and sugar). \n\nFor me, it also helps to look at numbers to see what I can and can't eat. Like right now, I've been at a car dealership for 6 hours and I'm sitting right next to the coffee bar which has crackers, oat bars, and my own personal Achilles heel, trail mix. \n\nI had some trail mix, I had a fig newton bar. With my breakfast and exercise logged, I have 303 cal left until I'm done. Knowing this, I'm not going to eat anything else until I get home because everything on the coffee bar is going to be too small to be a meal, and too full of calories to make it worthwhile eating. (Plus I already had some). It also helps that I had coffee, so my appetite is a little suppressed right now. \n\nSecondly, a lot of my meals are 180-350 calories each, so even if I have a small binge, I'll still be within my calorie limit. \n\n(And omg yes bouldering is awesome!!! I've never committed to an exercise longer than I have until Bouldering! I'm still terrified of heights, but the fact that I can cling to the wall for dear life is a consolation)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be honest, lately it&amp;#39;s been hard ignoring those impulses. &lt;/p&gt;\n\n&lt;p&gt;It helps to not be around food, and not have foods that are impulse-foods around. &lt;/p&gt;\n\n&lt;p&gt;Like, right now there&amp;#39;s nothing in my pantry I can binge eat unless I want to go through the trouble of cooking pasta and beans (that&amp;#39;s all I have in addition to flour and sugar). &lt;/p&gt;\n\n&lt;p&gt;For me, it also helps to look at numbers to see what I can and can&amp;#39;t eat. Like right now, I&amp;#39;ve been at a car dealership for 6 hours and I&amp;#39;m sitting right next to the coffee bar which has crackers, oat bars, and my own personal Achilles heel, trail mix. &lt;/p&gt;\n\n&lt;p&gt;I had some trail mix, I had a fig newton bar. With my breakfast and exercise logged, I have 303 cal left until I&amp;#39;m done. Knowing this, I&amp;#39;m not going to eat anything else until I get home because everything on the coffee bar is going to be too small to be a meal, and too full of calories to make it worthwhile eating. (Plus I already had some). It also helps that I had coffee, so my appetite is a little suppressed right now. &lt;/p&gt;\n\n&lt;p&gt;Secondly, a lot of my meals are 180-350 calories each, so even if I have a small binge, I&amp;#39;ll still be within my calorie limit. &lt;/p&gt;\n\n&lt;p&gt;(And omg yes bouldering is awesome!!! I&amp;#39;ve never committed to an exercise longer than I have until Bouldering! I&amp;#39;m still terrified of heights, but the fact that I can cling to the wall for dear life is a consolation)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg6s7gr", "score_hidden": false, "stickied": false, "created": 1492069666.0, "created_utc": 1492040866.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67pfp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SparksAfterTheSunset", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "So very impressive! Congratulations. You absolutely should be proud. I'm especially impressed that you were able to do this in spite of your binge impulses and issues with food. My similar issues have been keeping me at Day 1 for the entire year now :( - I stick to my calorie count for about 2 weeks max before destroying progress with some monstrous binges. I'm not overweight, but my BMI is like 24, so I guess I'm near it (though I do have a fair bit of muscle from climbing and lifting) How did you do ignore those impulses?!\n\nPS: Isn't bouldering awesome!?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So very impressive! Congratulations. You absolutely should be proud. I&amp;#39;m especially impressed that you were able to do this in spite of your binge impulses and issues with food. My similar issues have been keeping me at Day 1 for the entire year now :( - I stick to my calorie count for about 2 weeks max before destroying progress with some monstrous binges. I&amp;#39;m not overweight, but my BMI is like 24, so I guess I&amp;#39;m near it (though I do have a fair bit of muscle from climbing and lifting) How did you do ignore those impulses?!&lt;/p&gt;\n\n&lt;p&gt;PS: Isn&amp;#39;t bouldering awesome!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg67pfp", "score_hidden": false, "stickied": false, "created": 1492047022.0, "created_utc": 1492018222.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_64whxr", "likes": null, "replies": "", "user_reports": [], "id": "dg6qbcr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lifecriziz", "parent_id": "t3_64whxr", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Yes we can imagine your surprise lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes we can imagine your surprise lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg6qbcr", "score_hidden": false, "stickied": false, "created": 1492067342.0, "created_utc": 1492038542.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]