[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "loseit", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Good Morning!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen this post here many, many times:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m going to a (insert meal/occasion) buffet on X date, how do I survive?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Buffets are a natural part of life (at least in America) and cannot be avoided forever.  But the good news is, you don&amp;#39;t have to avoid them.  Part of this sub is re-learning how to feed ourselves, for the rest of our lives.  So on that note, here are some helpful tips to get you through those super stressful buffets that will occasionally pop up on your social calendar.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Eat before you go.  If you&amp;#39;re a control freak, then you let your freak flag fly!  Eat your normally portioned meal and log it. Bring a Nalgene or other bottle of water or tea and sip while everyone else is eating.  You don&amp;#39;t owe it to anyone to indulge in a high calorie buffet.  Obviously this works for weddings, birthday parties, or other special occasion gatherings, not so much at Thanksgiving or other &amp;quot;eating&amp;quot; holidays.   Still.  No one can force you to eat.  If you&amp;#39;re not comfortable eating food you didn&amp;#39;t prepare and can&amp;#39;t accurately log, eat first.  No one wants to be that guy/gal having a panic attack staring at chafing dishes.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Eat.  I know this sounds counter-intuitive, but one day cannot and will not make or break your weight loss.  Unless you eat 4000 calories or more, the most you&amp;#39;ll do is gain 1 lb.  You&amp;#39;ll set your progress back by 1 or 2 weeks.  Forgive yourself, but understand that special occasions arise in life, and enjoying yourself with reckless abandon is perfectly normal in moderation.  If you can handle cutting loose for a day, and then getting right back on track tomorrow, then don&amp;#39;t beat yourself up over a special occasion meal.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you&amp;#39;re going with choice #1, you can increase your daily deficit on the 4 days leading up to the buffet and 4 days after by 100 or more calories each, effectively giving you an 800-1000 calorie buffer to go over your calories and still keep your progress relatively intact.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you want to be good (and you can!) there are a few veteran buffet tricks you can deploy.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;grab the smallest plate available.  Most buffets will have salad plates/bowls, large dinner plates, and smaller appetizer/dessert plates available at the various stations.  I always grab the smallest plate.  Helps keep the temptation to &amp;quot;load up&amp;quot; at bay.  Since plate space is at a minimum, you&amp;#39;ll grab smaller portions of everything naturally, and skip things you don&amp;#39;t really want because you don&amp;#39;t have room for them.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Eat a salad or plate of veggies first.  Load a plate with salad or fresh vegetables and then SIT BACK DOWN.  Enjoy your healthy plate first and wait 10 full minutes before returning to the buffet.  Use the same small salad plate and take smaller entrée portions.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Use the hand ruler.  A portion for a good cut of lean meat should be the size of your fist.  Don&amp;#39;t take more than that.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Use the 50/25/25 method if you are only having one plate.  50% veggies, 25% starch/carbs and %25 meat/fish/protein.  Mess with the carb/protein ratio at your leisure, but your buffet plate should always be 50% vegetables.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Don&amp;#39;t eat the rolls/bread on the table.  IT&amp;#39;S A TRAP.  Both filling and calorie dense, these should be avoided at any buffet.  Save your precious calories for the mains.  No one ever returns from a wedding saying &amp;quot;OMG that dinner roll!  EXQUISITE.&amp;quot;  Skip it.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;No one said you can&amp;#39;t bring your pocket scale!  Weigh your food and log it.  You might get one or two odd looks and maybe one genuine question, but this is your health.  Awkwardness takes a backseat to your goals.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Read the labels on the buffet stations.  With allergies the way they are today, 90% of buffet style meals are required to list their ingredients on the placard.  Pass on the cream sauces and pasta dishes.  Same for any dishes containing oils, butter, sauces, and any other high calorie fillers.  Think before grabbing that spoonful.  Look for keywords like:  &lt;em&gt;Baked&lt;/em&gt;, &lt;em&gt;Steamed&lt;/em&gt;,  &lt;em&gt;Pan Seared&lt;/em&gt;,  or &lt;em&gt;Broiled&lt;/em&gt; and avoid &lt;em&gt;Fried&lt;/em&gt; or &lt;em&gt;Sautéed&lt;/em&gt; as these have high oil contents due to cooking method.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Skip dessert if you can, and if you absolutely must, bring your knife with you and cut an existing portion in half or more.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;USE YOUR JUDGEMENT.  You know by now what foods you should be eating.  If you want to try those fried scallops in lemon butter, then try ONE and then grab some extra steamed veggies.  If you must have a piece of Tiramisu or Peanut Butter Ice Cream Cake, then have half a piece at most.  Try to wait 10 minutes between courses to really let the food settle.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Above all else, HAVE FUN.  Special occasions are just that:  Special.  No one wants to be a nervous wreck at a party, so if trying to control yourself at a buffet is going to stress you out, then just understand that one day won&amp;#39;t ultimately hurt you, and relax and enjoy.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Post your tips/tricks in the comments!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Good Morning!\n\nI've seen this post here many, many times:\n\n&gt;I'm going to a (insert meal/occasion) buffet on X date, how do I survive?\n\nBuffets are a natural part of life (at least in America) and cannot be avoided forever.  But the good news is, you don't have to avoid them.  Part of this sub is re-learning how to feed ourselves, for the rest of our lives.  So on that note, here are some helpful tips to get you through those super stressful buffets that will occasionally pop up on your social calendar.\n\n1.  Eat before you go.  If you're a control freak, then you let your freak flag fly!  Eat your normally portioned meal and log it. Bring a Nalgene or other bottle of water or tea and sip while everyone else is eating.  You don't owe it to anyone to indulge in a high calorie buffet.  Obviously this works for weddings, birthday parties, or other special occasion gatherings, not so much at Thanksgiving or other \"eating\" holidays.   Still.  No one can force you to eat.  If you're not comfortable eating food you didn't prepare and can't accurately log, eat first.  No one wants to be that guy/gal having a panic attack staring at chafing dishes.\n\n2.  Eat.  I know this sounds counter-intuitive, but one day cannot and will not make or break your weight loss.  Unless you eat 4000 calories or more, the most you'll do is gain 1 lb.  You'll set your progress back by 1 or 2 weeks.  Forgive yourself, but understand that special occasions arise in life, and enjoying yourself with reckless abandon is perfectly normal in moderation.  If you can handle cutting loose for a day, and then getting right back on track tomorrow, then don't beat yourself up over a special occasion meal.\n\n3.  If you're going with choice #1, you can increase your daily deficit on the 4 days leading up to the buffet and 4 days after by 100 or more calories each, effectively giving you an 800-1000 calorie buffer to go over your calories and still keep your progress relatively intact.\n\n3.  If you want to be good (and you can!) there are a few veteran buffet tricks you can deploy.\n\n* grab the smallest plate available.  Most buffets will have salad plates/bowls, large dinner plates, and smaller appetizer/dessert plates available at the various stations.  I always grab the smallest plate.  Helps keep the temptation to \"load up\" at bay.  Since plate space is at a minimum, you'll grab smaller portions of everything naturally, and skip things you don't really want because you don't have room for them.\n\n*  Eat a salad or plate of veggies first.  Load a plate with salad or fresh vegetables and then SIT BACK DOWN.  Enjoy your healthy plate first and wait 10 full minutes before returning to the buffet.  Use the same small salad plate and take smaller entrée portions.\n\n*  Use the hand ruler.  A portion for a good cut of lean meat should be the size of your fist.  Don't take more than that.  \n\n*  Use the 50/25/25 method if you are only having one plate.  50% veggies, 25% starch/carbs and %25 meat/fish/protein.  Mess with the carb/protein ratio at your leisure, but your buffet plate should always be 50% vegetables.\n\n*  Don't eat the rolls/bread on the table.  IT'S A TRAP.  Both filling and calorie dense, these should be avoided at any buffet.  Save your precious calories for the mains.  No one ever returns from a wedding saying \"OMG that dinner roll!  EXQUISITE.\"  Skip it.  \n\n*  No one said you can't bring your pocket scale!  Weigh your food and log it.  You might get one or two odd looks and maybe one genuine question, but this is your health.  Awkwardness takes a backseat to your goals.\n\n4.  Read the labels on the buffet stations.  With allergies the way they are today, 90% of buffet style meals are required to list their ingredients on the placard.  Pass on the cream sauces and pasta dishes.  Same for any dishes containing oils, butter, sauces, and any other high calorie fillers.  Think before grabbing that spoonful.  Look for keywords like:  *Baked*, *Steamed*,  *Pan Seared*,  or *Broiled* and avoid *Fried* or *Sautéed* as these have high oil contents due to cooking method.\n\n5.  Skip dessert if you can, and if you absolutely must, bring your knife with you and cut an existing portion in half or more.\n\n6.  USE YOUR JUDGEMENT.  You know by now what foods you should be eating.  If you want to try those fried scallops in lemon butter, then try ONE and then grab some extra steamed veggies.  If you must have a piece of Tiramisu or Peanut Butter Ice Cream Cake, then have half a piece at most.  Try to wait 10 minutes between courses to really let the food settle.\n\n7.  Above all else, HAVE FUN.  Special occasions are just that:  Special.  No one wants to be a nervous wreck at a party, so if trying to control yourself at a buffet is going to stress you out, then just understand that one day won't ultimately hurt you, and relax and enjoy.\n\nPost your tips/tricks in the comments!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "★", "id": "656s91", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 51, "report_reasons": null, "author": "CapnDonkey", "saved": false, "mod_reports": [], "name": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "approved_by": null, "over_18": false, "domain": "self.loseit", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rz8w", "edited": false, "link_flair_css_class": "Starred", "author_flair_css_class": "-055lbs", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/loseit/comments/656s91/a_handy_guide_for_surviving_a_buffet/", "num_reports": null, "locked": false, "stickied": false, "created": 1492131918.0, "url": "https://www.reddit.com/r/loseit/comments/656s91/a_handy_guide_for_surviving_a_buffet/", "author_flair_text": "M40 | 6'2\" | SW: 374, CW: 319 GW: 265", "quarantine": false, "title": "A Handy Guide for Surviving a Buffet", "created_utc": 1492103118.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 51}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg94ln1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bitchface_bartender", "parent_id": "t1_dg92mz6", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I don't know if I would eat before either. It think it would be weird for me to sit with tiny portions as well or not eat at all. Maybe rather get some veggies and meat. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if I would eat before either. It think it would be weird for me to sit with tiny portions as well or not eat at all. Maybe rather get some veggies and meat. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg94ln1", "score_hidden": false, "stickied": false, "created": 1492205491.0, "created_utc": 1492176691.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92mz6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "IAmThe0neWhoKn0cks", "parent_id": "t1_dg91grj", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": " It's definitely not easy, no, but it is doable with a couple tries and some practice I think. Everybody is different though, if you personally can't stop, then perhaps it is better to avoid then. I wasn't sure if I would be able to or not so I walked into the buffet assuming I'd be over maintenance for the day (and honestly not giving a flying fuck because everything looked so good)\n\nOP said to eat before you go, but how does that help someone like you who can't stop eating the pasta and cake? For that, just enjoy your buffet without the calories of an extra meal. \n\nI didn't mean to sound like it was a breeze and I conquered in a way no one else can... trust me I was dying a little on the inside when I didn't get ice cream or brownies with my dessert with the excuse that it was my birthday lol.. but I tried to practice portion control and it did work. It mostly helped too that the carbs had me full quickly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s definitely not easy, no, but it is doable with a couple tries and some practice I think. Everybody is different though, if you personally can&amp;#39;t stop, then perhaps it is better to avoid then. I wasn&amp;#39;t sure if I would be able to or not so I walked into the buffet assuming I&amp;#39;d be over maintenance for the day (and honestly not giving a flying fuck because everything looked so good)&lt;/p&gt;\n\n&lt;p&gt;OP said to eat before you go, but how does that help someone like you who can&amp;#39;t stop eating the pasta and cake? For that, just enjoy your buffet without the calories of an extra meal. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t mean to sound like it was a breeze and I conquered in a way no one else can... trust me I was dying a little on the inside when I didn&amp;#39;t get ice cream or brownies with my dessert with the excuse that it was my birthday lol.. but I tried to practice portion control and it did work. It mostly helped too that the carbs had me full quickly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg92mz6", "score_hidden": false, "stickied": false, "created": 1492202075.0, "created_utc": 1492173275.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91grj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bitchface_bartender", "parent_id": "t1_dg7x0wg", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I don't know, It's not always easy. I avoid fatty and sugary foods altogether because I have no self control and if I start, I won't be able to stop. Then I'll do the whole weeeeell, since I already ate the pasta, I might as well eat the cake you know... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know, It&amp;#39;s not always easy. I avoid fatty and sugary foods altogether because I have no self control and if I start, I won&amp;#39;t be able to stop. Then I&amp;#39;ll do the whole weeeeell, since I already ate the pasta, I might as well eat the cake you know... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg91grj", "score_hidden": false, "stickied": false, "created": 1492199563.0, "created_utc": 1492170763.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7x0wg", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "IAmThe0neWhoKn0cks", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Just went to a buffet last week as part of a 3 day multi-birthday celebration. I ate what I wanted, was full, and still lost 2.8lbs that week.\n\nI admire your long write up, but it's really not that complicated, honestly. Just use common sense. Don't eat until you stuff yourself silly. Eat less of each food if there's one you really want the most. \n\nI ate whatever I wanted: salad with lots of dressing, lo mein, fried rice, garlic bread, meatballs + pasta, chips, mashed potatoes and a hot cinnamon roll for dessert. The real trick was to just eat a few bites of each. I was super full from the carbs, and definitely satisfied. I still got to taste and enjoy each item, and even estimated my meal to be under my daily goal. Proof is in my weight loss from that week: right on track if not MORE than I anticipated. Which was awesome because I stressed about it for weeks. Portion control is the main key here. I absolutely would not recommend eating before you go, because a lot of people have problems with total portion control and restricting items that are right in front of them ... that extra meal just adds calories to your day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just went to a buffet last week as part of a 3 day multi-birthday celebration. I ate what I wanted, was full, and still lost 2.8lbs that week.&lt;/p&gt;\n\n&lt;p&gt;I admire your long write up, but it&amp;#39;s really not that complicated, honestly. Just use common sense. Don&amp;#39;t eat until you stuff yourself silly. Eat less of each food if there&amp;#39;s one you really want the most. &lt;/p&gt;\n\n&lt;p&gt;I ate whatever I wanted: salad with lots of dressing, lo mein, fried rice, garlic bread, meatballs + pasta, chips, mashed potatoes and a hot cinnamon roll for dessert. The real trick was to just eat a few bites of each. I was super full from the carbs, and definitely satisfied. I still got to taste and enjoy each item, and even estimated my meal to be under my daily goal. Proof is in my weight loss from that week: right on track if not MORE than I anticipated. Which was awesome because I stressed about it for weeks. Portion control is the main key here. I absolutely would not recommend eating before you go, because a lot of people have problems with total portion control and restricting items that are right in front of them ... that extra meal just adds calories to your day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg7x0wg", "score_hidden": false, "stickied": false, "created": 1492134210.0, "created_utc": 1492105410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg7wy2l", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Keeeva", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Be the first one in line if possible if it's a wedding or something similar. Fewer people around to judge and make dumb comments about what you are and are not eating. And by the time you start thinking about going a second time, the line will be packed and the dishes will be picked over and it will sound less appealing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be the first one in line if possible if it&amp;#39;s a wedding or something similar. Fewer people around to judge and make dumb comments about what you are and are not eating. And by the time you start thinking about going a second time, the line will be packed and the dishes will be picked over and it will sound less appealing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg7wy2l", "score_hidden": false, "stickied": false, "created": 1492134127.0, "created_utc": 1492105327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg7x5gv", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "cenosillicaphobiac", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Great write up.  I've seen similar, but this is more inclusive.  Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great write up.  I&amp;#39;ve seen similar, but this is more inclusive.  Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg7x5gv", "score_hidden": false, "stickied": false, "created": 1492134346.0, "created_utc": 1492105546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg83b6t", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Deacalum", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "Your second point is so correct. I recently went to a Brazillian Steakhouse for my birthday and felt a little guilty afterwards but then thought it through and realized that while I was not positive of the exact calories, it was still less than 3500 calories so was likely only a one gain and not the end of the world. The first few days the scale was a few pounds up due to the water retention that also came with the increased food consumption, but after a few days it all leveled off and by the next \"official\" weigh in (I weigh myself daily but only track the Saturday weigh in) I was down a pound for the week despite the birthday dinner. I typically lose 2 pounds a week, so i still lost and it only cost me one pound. It was definitely worth it for a one off. The key is making sure those one offs don't become the norm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your second point is so correct. I recently went to a Brazillian Steakhouse for my birthday and felt a little guilty afterwards but then thought it through and realized that while I was not positive of the exact calories, it was still less than 3500 calories so was likely only a one gain and not the end of the world. The first few days the scale was a few pounds up due to the water retention that also came with the increased food consumption, but after a few days it all leveled off and by the next &amp;quot;official&amp;quot; weigh in (I weigh myself daily but only track the Saturday weigh in) I was down a pound for the week despite the birthday dinner. I typically lose 2 pounds a week, so i still lost and it only cost me one pound. It was definitely worth it for a one off. The key is making sure those one offs don&amp;#39;t become the norm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg83b6t", "score_hidden": false, "stickied": false, "created": 1492140955.0, "created_utc": 1492112155.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg94kco", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Duncanconstruction", "parent_id": "t1_dg84ja0", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "&gt;I don't go out very often, but being pinoy means my family loves Seafood and Chinese buffets.\n\nOh man I'm so glad I lost the weight **before** I met my Filipino partner. It's not just that filipino food is freaking delicious, but the whole culture revolves so much around food that it's so difficult to get through social events without being pressured into eating everything in sight. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t go out very often, but being pinoy means my family loves Seafood and Chinese buffets.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oh man I&amp;#39;m so glad I lost the weight &lt;strong&gt;before&lt;/strong&gt; I met my Filipino partner. It&amp;#39;s not just that filipino food is freaking delicious, but the whole culture revolves so much around food that it&amp;#39;s so difficult to get through social events without being pressured into eating everything in sight. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg94kco", "score_hidden": false, "stickied": false, "created": 1492205436.0, "created_utc": 1492176636.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84ja0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SeeRealBox", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I've done a few all-you-can-eat Korean BBQs since the start of my journey. Perhaps my following tips will be more helpful for some more than others.\n\nI don't go out very often, but being pinoy means my family loves Seafood and Chinese buffets. And being invited to a buffet dinner is usually more for socializing and getting together rather than eating delicious food. In essence, remember you're there to enjoy company of others in a place that happens to have a lot of food. Do you have to stuff your face? No. Do you have to pass on the foods you want to try/eat? No. The sooner you understand that you're there to hang out rather than \"get my money's worth\" the easier it is to not stress about buffets (unless you have social anxiety like me..lol)\n\nBy personal choice, I wouldn't spend $20+ to go to a buffet just to stuff my face with mediocre food. I'd rather go enjoy better quality food or cook something nice for myself. And that is with calories completely out of the picture. I'd rather spend $20 stuffing my face at my favorite hot wing or sushi joint.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve done a few all-you-can-eat Korean BBQs since the start of my journey. Perhaps my following tips will be more helpful for some more than others.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t go out very often, but being pinoy means my family loves Seafood and Chinese buffets. And being invited to a buffet dinner is usually more for socializing and getting together rather than eating delicious food. In essence, remember you&amp;#39;re there to enjoy company of others in a place that happens to have a lot of food. Do you have to stuff your face? No. Do you have to pass on the foods you want to try/eat? No. The sooner you understand that you&amp;#39;re there to hang out rather than &amp;quot;get my money&amp;#39;s worth&amp;quot; the easier it is to not stress about buffets (unless you have social anxiety like me..lol)&lt;/p&gt;\n\n&lt;p&gt;By personal choice, I wouldn&amp;#39;t spend $20+ to go to a buffet just to stuff my face with mediocre food. I&amp;#39;d rather go enjoy better quality food or cook something nice for myself. And that is with calories completely out of the picture. I&amp;#39;d rather spend $20 stuffing my face at my favorite hot wing or sushi joint.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg84ja0", "score_hidden": false, "stickied": false, "created": 1492142279.0, "created_utc": 1492113479.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg8aic9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MollyThenAndNow", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I've only done one since losing weight, and I loaded up on steamed white rice and asked one of the servers if I could get steamed veggies. He disappeared and came back about 15 minutes later with a huge plate of steamed bok choy, celery, carrots, broccoli, and zucchini.  I couldn't finish it all. I probably put two cups of white rice on my plate (just eyeballing it), which is 400 calories.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve only done one since losing weight, and I loaded up on steamed white rice and asked one of the servers if I could get steamed veggies. He disappeared and came back about 15 minutes later with a huge plate of steamed bok choy, celery, carrots, broccoli, and zucchini.  I couldn&amp;#39;t finish it all. I probably put two cups of white rice on my plate (just eyeballing it), which is 400 calories.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg8aic9", "score_hidden": false, "stickied": false, "created": 1492149238.0, "created_utc": 1492120438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg8hmno", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CapnDonkey", "parent_id": "t1_dg8hbjz", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "True.  I just got back from an all inclusive resort where most of the food options were buffet style and it really helped me stay on track that week", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True.  I just got back from an all inclusive resort where most of the food options were buffet style and it really helped me stay on track that week&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg8hmno", "score_hidden": false, "stickied": false, "created": 1492158746.0, "created_utc": 1492129946.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8hbjz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Animatethis", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "They can actually be (and should be) avoided most of the time, honestly. I go to a buffet twice a year. If you want to maintain a healthy weight, buffets really shouldn't be a very common occurrence in your life.  \n\nHowever, a lot of these rules can be applied to parties/get togethers, which can definitely be a more common situation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They can actually be (and should be) avoided most of the time, honestly. I go to a buffet twice a year. If you want to maintain a healthy weight, buffets really shouldn&amp;#39;t be a very common occurrence in your life.  &lt;/p&gt;\n\n&lt;p&gt;However, a lot of these rules can be applied to parties/get togethers, which can definitely be a more common situation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg8hbjz", "score_hidden": false, "stickied": false, "created": 1492158320.0, "created_utc": 1492129520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg8mclu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TeacherOfWildThings", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I love it all, but I have definitely come back from dinners raving about the dinner rolls. I love bread over anything else. \n\nIn all seriousness, I think it's perfectly okay to let loose around special occasions, as long as you're not having a special occasion every other day. This is a good chance to get used to being intuitive and using discipline in your daily life after deficit--use it as such. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love it all, but I have definitely come back from dinners raving about the dinner rolls. I love bread over anything else. &lt;/p&gt;\n\n&lt;p&gt;In all seriousness, I think it&amp;#39;s perfectly okay to let loose around special occasions, as long as you&amp;#39;re not having a special occasion every other day. This is a good chance to get used to being intuitive and using discipline in your daily life after deficit--use it as such. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg8mclu", "score_hidden": false, "stickied": false, "created": 1492165249.0, "created_utc": 1492136449.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg82gwl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NordWitcher", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "The best guide for surviving a buffet is to just honestly avoid a buffet.\n\nI don't know if its just me, but since I've always felt like I've had to eat a lot or actually try everything so as to rationalize the price. Sure some places do offer cheaper buffets, but when you are paying $30+ a person on a buffet, you clearly ain't thinking about portion control.\n\nThough I guess that only works if you have that kind of mindset. If you honestly don't care about paying $20+ for a buffet and walking out after only 1 round, full props to you. \n\nI've only been to a buffet twice in the last 15 months since I've been serious about losing weight. Both those times I was on kinda of a semi break so to say. \n\nWhile previously, buffets were always are go to places whenever we went out for dinner. We just realized that it just isn't worth the price of admission if you ain't going to be eating a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best guide for surviving a buffet is to just honestly avoid a buffet.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if its just me, but since I&amp;#39;ve always felt like I&amp;#39;ve had to eat a lot or actually try everything so as to rationalize the price. Sure some places do offer cheaper buffets, but when you are paying $30+ a person on a buffet, you clearly ain&amp;#39;t thinking about portion control.&lt;/p&gt;\n\n&lt;p&gt;Though I guess that only works if you have that kind of mindset. If you honestly don&amp;#39;t care about paying $20+ for a buffet and walking out after only 1 round, full props to you. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve only been to a buffet twice in the last 15 months since I&amp;#39;ve been serious about losing weight. Both those times I was on kinda of a semi break so to say. &lt;/p&gt;\n\n&lt;p&gt;While previously, buffets were always are go to places whenever we went out for dinner. We just realized that it just isn&amp;#39;t worth the price of admission if you ain&amp;#39;t going to be eating a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg82gwl", "score_hidden": false, "stickied": false, "created": 1492140043.0, "created_utc": 1492111243.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg95ku5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Duncanconstruction", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I really struggled with buffets for a while, but my trick now is to just load up 3/4 of the plate with veggies, and then the remaining 1/4 with two or three little servings of \"bad\" things per plate. That way I fill myself up after only a few plates, still get to enjoy a little of everything, and still feel like I'm getting my moneys worth by going back for 4-5 plates.\n\n Thankfully Ontario recently implemented laws on required calorie labeling on the menus, which also apply to buffets, and that has made it 500X easier. I knew how many calories I'm getting when I go get a big mac, but it was impossible to tell how many were in random assorted items at the buffet. It makes it way easier to avoid/limit the super high calorie stuff (looking at you, general tso chicken...)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really struggled with buffets for a while, but my trick now is to just load up 3/4 of the plate with veggies, and then the remaining 1/4 with two or three little servings of &amp;quot;bad&amp;quot; things per plate. That way I fill myself up after only a few plates, still get to enjoy a little of everything, and still feel like I&amp;#39;m getting my moneys worth by going back for 4-5 plates.&lt;/p&gt;\n\n&lt;p&gt;Thankfully Ontario recently implemented laws on required calorie labeling on the menus, which also apply to buffets, and that has made it 500X easier. I knew how many calories I&amp;#39;m getting when I go get a big mac, but it was impossible to tell how many were in random assorted items at the buffet. It makes it way easier to avoid/limit the super high calorie stuff (looking at you, general tso chicken...)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg95ku5", "score_hidden": false, "stickied": false, "created": 1492206935.0, "created_utc": 1492178135.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rz8w", "removal_reason": null, "link_id": "t3_656s91", "likes": null, "replies": "", "user_reports": [], "id": "dg965yl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greeneyedwench", "parent_id": "t3_656s91", "subreddit_name_prefixed": "r/loseit", "controversiality": 0, "body": "I can manage a sane amount of food at a 'Murican food buffet, but dear god, Indian buffets. I might as well just log a million calories and dig in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can manage a sane amount of food at a &amp;#39;Murican food buffet, but dear god, Indian buffets. I might as well just log a million calories and dig in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "loseit", "name": "t1_dg965yl", "score_hidden": false, "stickied": false, "created": 1492207768.0, "created_utc": 1492178968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]