[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "adventuretime", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Have your feelings for the series varied through the years? Mine certainly have! Tell us your story. Here&amp;#39;s mine:&lt;br/&gt;\nSeasons 6 and 7 were weird for me. I felt like I was enjoying the series way less and also I was a bit more focused on other stuff. I watched everything but it felt like a chore. I wasn&amp;#39;t really interested and aparently I wasn&amp;#39;t even paying that much attention. But when season 8 arrived and I watched Islands, everything went back to normal. That series was so good that it made me fall back in love with AT. I immediatly decided to re-watch the entire series from the start. I had already watched seasons 1-5 twice (a few episodes even more times), so this was the third for that part. And when I got to 6 and 7 I realized that they were actully pretty good. And I didn&amp;#39;t even remember most of details of the episodes. There was a lot of info that felt totally new to me! I remember liking Stakes but this time it was even better. And when I got to Islands again, it was better too. And now here I am, once again a super fan of the series. And super hyped for Elements and the end that is sadly so near.&lt;br/&gt;\nI strongly recommend that everybody that kind of feels like they forgot things along the way to watch it all over again. It was a great experience. But then again, I think it&amp;#39;s unlikely that casual fans would be reading this sub, so... yeah.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Have your feelings for the series varied through the years? Mine certainly have! Tell us your story. Here's mine:    \nSeasons 6 and 7 were weird for me. I felt like I was enjoying the series way less and also I was a bit more focused on other stuff. I watched everything but it felt like a chore. I wasn't really interested and aparently I wasn't even paying that much attention. But when season 8 arrived and I watched Islands, everything went back to normal. That series was so good that it made me fall back in love with AT. I immediatly decided to re-watch the entire series from the start. I had already watched seasons 1-5 twice (a few episodes even more times), so this was the third for that part. And when I got to 6 and 7 I realized that they were actully pretty good. And I didn't even remember most of details of the episodes. There was a lot of info that felt totally new to me! I remember liking Stakes but this time it was even better. And when I got to Islands again, it was better too. And now here I am, once again a super fan of the series. And super hyped for Elements and the end that is sadly so near.    \nI strongly recommend that everybody that kind of feels like they forgot things along the way to watch it all over again. It was a great experience. But then again, I think it's unlikely that casual fans would be reading this sub, so... yeah.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64t5c9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "sameljota", "saved": false, "mod_reports": [], "name": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "approved_by": null, "over_18": false, "domain": "self.adventuretime", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s54g", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "zz08rootbeer", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/adventuretime/comments/64t5c9/your_relationship_with_the_series/", "num_reports": null, "locked": false, "stickied": false, "created": 1491968120.0, "url": "https://www.reddit.com/r/adventuretime/comments/64t5c9/your_relationship_with_the_series/", "author_flair_text": "", "quarantine": false, "title": "Your relationship with the series", "created_utc": 1491939320.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_64t5c9", "likes": null, "replies": "", "user_reports": [], "id": "dg4uys9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "LilPotato911", "parent_id": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Kind of similar to you myself. Mind you, ever since I got into it it's been my #1 show, and it never budged from that spot. \n\nHowever, while I actually liked 6 and 7 a lot more than the early series, I wasn't as \"into\" the show as I once was because of the weird hiatuses, on top of being into other shows. But recently a couple of my college friends have been getting into it - it's making me go back and rewatch the show, and now I'm in love with it all over again. \n\nOf course interest has waned by and large over time, primarily due to how polarizing season 6 was, the hiatuses, and the (incredibly whiny) overreaction to 'Breezy.' I think when the series is almost over, or the finale looms, a lot of people will see what they've been missing. \n\nI think it's a good sign that Islands has revitalized some series popularity, and because of that Elements is actually being advertised. Maybe the show is making a small comeback - I've noticed the amount of subcribers here have increased by, like, 5,000 in the last couple weeks or so. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kind of similar to you myself. Mind you, ever since I got into it it&amp;#39;s been my #1 show, and it never budged from that spot. &lt;/p&gt;\n\n&lt;p&gt;However, while I actually liked 6 and 7 a lot more than the early series, I wasn&amp;#39;t as &amp;quot;into&amp;quot; the show as I once was because of the weird hiatuses, on top of being into other shows. But recently a couple of my college friends have been getting into it - it&amp;#39;s making me go back and rewatch the show, and now I&amp;#39;m in love with it all over again. &lt;/p&gt;\n\n&lt;p&gt;Of course interest has waned by and large over time, primarily due to how polarizing season 6 was, the hiatuses, and the (incredibly whiny) overreaction to &amp;#39;Breezy.&amp;#39; I think when the series is almost over, or the finale looms, a lot of people will see what they&amp;#39;ve been missing. &lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s a good sign that Islands has revitalized some series popularity, and because of that Elements is actually being advertised. Maybe the show is making a small comeback - I&amp;#39;ve noticed the amount of subcribers here have increased by, like, 5,000 in the last couple weeks or so. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg4uys9", "score_hidden": false, "stickied": false, "created": 1491970931.0, "created_utc": 1491942131.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_64t5c9", "likes": null, "replies": "", "user_reports": [], "id": "dg55mon", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "samhadj01", "parent_id": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "for me the show has shown me a completely different perspective of story telling,when I was 7-11( during 2004-09 mostly in 2006 during the second dark age of animation) I grew up with stuff that was safe and by the numbers with small exceptions like ed edd n eddy,and some shows from early cartoon network and a lot of pixar and a few experimental era disney movies,so overall I never really had much developed taste but when I first watched adventure time I was always surprised by every twist and turn that came to our duo's way.However when I thought that there was nothing left the show could do I was surprised of the many twist and turns the series has provided me and gave me this sense of deeper meaning something I could grasp onto better quality show's and helped more form more of my own personal opinion on shows, I could go on but to sum it up the series helped me reach out in life more ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;for me the show has shown me a completely different perspective of story telling,when I was 7-11( during 2004-09 mostly in 2006 during the second dark age of animation) I grew up with stuff that was safe and by the numbers with small exceptions like ed edd n eddy,and some shows from early cartoon network and a lot of pixar and a few experimental era disney movies,so overall I never really had much developed taste but when I first watched adventure time I was always surprised by every twist and turn that came to our duo&amp;#39;s way.However when I thought that there was nothing left the show could do I was surprised of the many twist and turns the series has provided me and gave me this sense of deeper meaning something I could grasp onto better quality show&amp;#39;s and helped more form more of my own personal opinion on shows, I could go on but to sum it up the series helped me reach out in life more &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg55mon", "score_hidden": false, "stickied": false, "created": 1491984274.0, "created_utc": 1491955474.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_64t5c9", "likes": null, "replies": "", "user_reports": [], "id": "dg4wt2f", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AshTheWolf", "parent_id": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Adventure time has stayed as my favorite show since I saw the first episode air. I was pretty young (same age as Finn when it aired) so my interests in what I want to see in a show kept changing as I aged. Personally the age I was I think stuck well with the show and how it changed. As Finn aged the show got more plot heavy and in turn I was more interested in plot than jokes. Season 6, 7 and so far 8 have all been some of my favorites. They came out in very hard important time for myself in my growing teen years and with the problems Finn faced in those seasons I found that I connected on an extremely personal level. \nThe most memorable seasons for me were the plot heavy ones, the serious ones. I'll always remember the plot arcs. So overall, the show has become 'better' to me in the sense that I feel like I'm able to feel episodes more now than before. The only thing that's caused my connection to falter are the weird hiatuses. They always kill my hype even after a good episode bomb. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Adventure time has stayed as my favorite show since I saw the first episode air. I was pretty young (same age as Finn when it aired) so my interests in what I want to see in a show kept changing as I aged. Personally the age I was I think stuck well with the show and how it changed. As Finn aged the show got more plot heavy and in turn I was more interested in plot than jokes. Season 6, 7 and so far 8 have all been some of my favorites. They came out in very hard important time for myself in my growing teen years and with the problems Finn faced in those seasons I found that I connected on an extremely personal level. \nThe most memorable seasons for me were the plot heavy ones, the serious ones. I&amp;#39;ll always remember the plot arcs. So overall, the show has become &amp;#39;better&amp;#39; to me in the sense that I feel like I&amp;#39;m able to feel episodes more now than before. The only thing that&amp;#39;s caused my connection to falter are the weird hiatuses. They always kill my hype even after a good episode bomb. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg4wt2f", "score_hidden": false, "stickied": false, "created": 1491973003.0, "created_utc": 1491944203.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_64t5c9", "likes": null, "replies": "", "user_reports": [], "id": "dg56nr9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "PartyPorpoise", "parent_id": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I didn't watch the show until a few seasons in. Heard it was good, watched it, it was all random and crazy. But early on, I watch the Holly Jolly Secrets episodes, and that's when I realized that this show was special.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t watch the show until a few seasons in. Heard it was good, watched it, it was all random and crazy. But early on, I watch the Holly Jolly Secrets episodes, and that&amp;#39;s when I realized that this show was special.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg56nr9", "score_hidden": false, "stickied": false, "created": 1491985629.0, "created_utc": 1491956829.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_64t5c9", "likes": null, "replies": "", "user_reports": [], "id": "dg4yced", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "emmeka", "parent_id": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I started watching AT in about 2011, when the the 2nd season was coming to a close. I was in my senior year of high school then so I approached the series a lot older than many fans and it's remained my go-to de-stressing series over the years.\n\nSeason 1 I watched retroactively for the sake of completion after season 2, and so it didn't make that much of an impact. Seasons 2-5 were really the peak of it for me, and were the height of what Adventure Time could be: a cutesy, fun kid's cartoon that could be aesthetically and narratively touching to adults. The wait between The Lich and Finn the Human was killer for me, I must've spent that what, 3 weeks doing nothing but obsessively re-watching the series. And after that we got a bunch of stuff on Marcy + more Fionna and Cake, it was great.\n\nSeason 6 wasn't all a wash for me because I was really into Fionna &amp; Cake episodes and we got another one, plus I feel they really delved into pushing the aesthetic boundaries of the series there. But I was definitely paying less attention to the series for most of it, and even into Season 7. And then Stakes aired and I got right back into it.\n\nI have no idea what I'm going to do when Adventure Time finally ends, nothing I've ever watched has come anywhere near as close to impacting me. I feel like the lessons of the show about family, growing up, and dealing with relationships really helped make me the person I am today and it'll be really sad to say goodbye to Ooo.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started watching AT in about 2011, when the the 2nd season was coming to a close. I was in my senior year of high school then so I approached the series a lot older than many fans and it&amp;#39;s remained my go-to de-stressing series over the years.&lt;/p&gt;\n\n&lt;p&gt;Season 1 I watched retroactively for the sake of completion after season 2, and so it didn&amp;#39;t make that much of an impact. Seasons 2-5 were really the peak of it for me, and were the height of what Adventure Time could be: a cutesy, fun kid&amp;#39;s cartoon that could be aesthetically and narratively touching to adults. The wait between The Lich and Finn the Human was killer for me, I must&amp;#39;ve spent that what, 3 weeks doing nothing but obsessively re-watching the series. And after that we got a bunch of stuff on Marcy + more Fionna and Cake, it was great.&lt;/p&gt;\n\n&lt;p&gt;Season 6 wasn&amp;#39;t all a wash for me because I was really into Fionna &amp;amp; Cake episodes and we got another one, plus I feel they really delved into pushing the aesthetic boundaries of the series there. But I was definitely paying less attention to the series for most of it, and even into Season 7. And then Stakes aired and I got right back into it.&lt;/p&gt;\n\n&lt;p&gt;I have no idea what I&amp;#39;m going to do when Adventure Time finally ends, nothing I&amp;#39;ve ever watched has come anywhere near as close to impacting me. I feel like the lessons of the show about family, growing up, and dealing with relationships really helped make me the person I am today and it&amp;#39;ll be really sad to say goodbye to Ooo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg4yced", "score_hidden": false, "stickied": false, "created": 1491974833.0, "created_utc": 1491946033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_64t5c9", "likes": null, "replies": "", "user_reports": [], "id": "dg5hnk9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Stuped1811", "parent_id": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I forget when I started watching exactly. I was aware of its existence in 2010, was watching at some point in 2011, and by the time Too Young aired I was watching and way into it. When Incendium aired I started hanging out in Internet communities (mainly Tumblr and 4chan) and started interacting with other fans.\n\nLoved it, still love it. I've always adored the show, though there were lots of bumpy spots on the way. The show has monumentally disappointed me on many occasions. Jake the Dad, Betty, Red Throne, Breezy, others on lesser levels. I've come to terms with them over time, some I'm more or less okay with now others I still dislike. To use a tasteless analogy, sometimes I feel like AT is the abusive lover to my battered spouse; they keep beating me down and I keep coming back. But even when it screws up I can't stay too mad at it because I think there's just so much good to come out of it.\n\nI tend to love the earlier seasons more than the later ones (you'll notice all the disappointments I've listed are from season 5+) not necessarily because I like light heartedness over seriousness, but because I feel like AT had made lots of missteps in its more ambitious efforts. I give them credit for trying though. Sometimes this leads me to feel really ambivalent about the show, I can go from loving every thing about it then thinking stuff like \"In my opinion every character has gotten worse over time\" or other junk like that. I'm pretty sympathetic to ex fans who now hate the series because I feel like I agree with some of the major criticisms to a degree (but fuck people who say Finn and Jake are boring, my boys are great). I can be its biggest fan and harshest critic (angle or yuor devil baby) but there's always an underlying foundation of me deeply appreciating the series. I think these odd feelings may have helped keep me so interested, if I just totally loved the show I'm not sure my enthusiasm could have remained after all this time. \n\nReally no idea what the hell I'm gonna do with myself when it ends, been my main interest for the past 5 years. Always been watching it, talking about it, thinking about it, consuming fan content about it, all that shit. Its gonna be a hard endeavor for me to find something else to get crazy over to this degree, media's gonna have to step up their game. I so, So, SO, SO! hope that the show has a fantastic ending, or at least a good one (I'll also accept a merely serviceable one). I'm a softie so I'll be willing to forgive a vast majority of my qualms with the series if they nail the ending, send Finn off with a satisfying, interesting goodbye and wrap up the biggest remaining plot threads. \n\nLove the shit out of this show, even with its myriad of problems. Its just too good man, too interesting and funny and heartfelt for me to dislike it no matter how fed up I get at times. Islands was like a 9/10 miniseries and I hope Elements is good as well, and that they wrap the rest up in a good way. Gonna miss this gang of weirdos a whole lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I forget when I started watching exactly. I was aware of its existence in 2010, was watching at some point in 2011, and by the time Too Young aired I was watching and way into it. When Incendium aired I started hanging out in Internet communities (mainly Tumblr and 4chan) and started interacting with other fans.&lt;/p&gt;\n\n&lt;p&gt;Loved it, still love it. I&amp;#39;ve always adored the show, though there were lots of bumpy spots on the way. The show has monumentally disappointed me on many occasions. Jake the Dad, Betty, Red Throne, Breezy, others on lesser levels. I&amp;#39;ve come to terms with them over time, some I&amp;#39;m more or less okay with now others I still dislike. To use a tasteless analogy, sometimes I feel like AT is the abusive lover to my battered spouse; they keep beating me down and I keep coming back. But even when it screws up I can&amp;#39;t stay too mad at it because I think there&amp;#39;s just so much good to come out of it.&lt;/p&gt;\n\n&lt;p&gt;I tend to love the earlier seasons more than the later ones (you&amp;#39;ll notice all the disappointments I&amp;#39;ve listed are from season 5+) not necessarily because I like light heartedness over seriousness, but because I feel like AT had made lots of missteps in its more ambitious efforts. I give them credit for trying though. Sometimes this leads me to feel really ambivalent about the show, I can go from loving every thing about it then thinking stuff like &amp;quot;In my opinion every character has gotten worse over time&amp;quot; or other junk like that. I&amp;#39;m pretty sympathetic to ex fans who now hate the series because I feel like I agree with some of the major criticisms to a degree (but fuck people who say Finn and Jake are boring, my boys are great). I can be its biggest fan and harshest critic (angle or yuor devil baby) but there&amp;#39;s always an underlying foundation of me deeply appreciating the series. I think these odd feelings may have helped keep me so interested, if I just totally loved the show I&amp;#39;m not sure my enthusiasm could have remained after all this time. &lt;/p&gt;\n\n&lt;p&gt;Really no idea what the hell I&amp;#39;m gonna do with myself when it ends, been my main interest for the past 5 years. Always been watching it, talking about it, thinking about it, consuming fan content about it, all that shit. Its gonna be a hard endeavor for me to find something else to get crazy over to this degree, media&amp;#39;s gonna have to step up their game. I so, So, SO, SO! hope that the show has a fantastic ending, or at least a good one (I&amp;#39;ll also accept a merely serviceable one). I&amp;#39;m a softie so I&amp;#39;ll be willing to forgive a vast majority of my qualms with the series if they nail the ending, send Finn off with a satisfying, interesting goodbye and wrap up the biggest remaining plot threads. &lt;/p&gt;\n\n&lt;p&gt;Love the shit out of this show, even with its myriad of problems. Its just too good man, too interesting and funny and heartfelt for me to dislike it no matter how fed up I get at times. Islands was like a 9/10 miniseries and I hope Elements is good as well, and that they wrap the rest up in a good way. Gonna miss this gang of weirdos a whole lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg5hnk9", "score_hidden": false, "stickied": false, "created": 1492001454.0, "created_utc": 1491972654.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_64t5c9", "likes": null, "replies": "", "user_reports": [], "id": "dg5nrg7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "amhpanther", "parent_id": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I personally think Adventure Time is a modern classic and the crowning jewel of the current era of western cartoons. It's so deep in every aspect, the characters are complex, the lore/world building is broad and sweeping, the comedy is fantastic and so forth.\n\nI still remember things like the pure terror the Lich brought in his first appearance, or the bittersweet loneliness from I Remember You, as well as how much of a mind-blow it was to see the Simon and Marcy mini-arc or the power of the Crown in Finn the Human/Jake the Dog\n\nI was hooked on in it for the comedy when Adventure Time first started airing on Cartoon Network in Australia (can't remember what year it was but I was around for the Australian premiere). I've been watching it ever since. \n\nI do miss having a new episode every week. It's a shame we never got a reason for this strange hiatus. At the same time though I never *really* minded the current format because suddenly getting an entire week's worth of episodes at once was always a really nice surprise. Overall I'd prefer the old schedule though.\n\nMe and a friend used to be right into it together. We've drifted apart but Adventure Time was great fun as something to watch and a topic of discussion. I do honestly kind of miss having someone to talk about it with, not that that's a major problem at the moment due to the wack airing schedule though.\n\nIf there was a point that it kind of lulled for me it would be Relationship Time. That's what me and him called the period of Adventure Time after his breakup with Flame Princess where it was all about Finn's relationships and less about the comedy/adventures.\n\nPersonally I can't wait for it to end. I love the show and I'm excited to see how it ties it all together into a climax. I am a huge fan of the intricate philosophical and abstract piece that this simple show has evolved into, I liked it at the start and I adore it now.\n", "edited": 1492003088.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally think Adventure Time is a modern classic and the crowning jewel of the current era of western cartoons. It&amp;#39;s so deep in every aspect, the characters are complex, the lore/world building is broad and sweeping, the comedy is fantastic and so forth.&lt;/p&gt;\n\n&lt;p&gt;I still remember things like the pure terror the Lich brought in his first appearance, or the bittersweet loneliness from I Remember You, as well as how much of a mind-blow it was to see the Simon and Marcy mini-arc or the power of the Crown in Finn the Human/Jake the Dog&lt;/p&gt;\n\n&lt;p&gt;I was hooked on in it for the comedy when Adventure Time first started airing on Cartoon Network in Australia (can&amp;#39;t remember what year it was but I was around for the Australian premiere). I&amp;#39;ve been watching it ever since. &lt;/p&gt;\n\n&lt;p&gt;I do miss having a new episode every week. It&amp;#39;s a shame we never got a reason for this strange hiatus. At the same time though I never &lt;em&gt;really&lt;/em&gt; minded the current format because suddenly getting an entire week&amp;#39;s worth of episodes at once was always a really nice surprise. Overall I&amp;#39;d prefer the old schedule though.&lt;/p&gt;\n\n&lt;p&gt;Me and a friend used to be right into it together. We&amp;#39;ve drifted apart but Adventure Time was great fun as something to watch and a topic of discussion. I do honestly kind of miss having someone to talk about it with, not that that&amp;#39;s a major problem at the moment due to the wack airing schedule though.&lt;/p&gt;\n\n&lt;p&gt;If there was a point that it kind of lulled for me it would be Relationship Time. That&amp;#39;s what me and him called the period of Adventure Time after his breakup with Flame Princess where it was all about Finn&amp;#39;s relationships and less about the comedy/adventures.&lt;/p&gt;\n\n&lt;p&gt;Personally I can&amp;#39;t wait for it to end. I love the show and I&amp;#39;m excited to see how it ties it all together into a climax. I am a huge fan of the intricate philosophical and abstract piece that this simple show has evolved into, I liked it at the start and I adore it now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg5nrg7", "score_hidden": false, "stickied": false, "created": 1492016829.0, "created_utc": 1491988029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_64t5c9", "likes": null, "replies": "", "user_reports": [], "id": "dg8rv93", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JVF123", "parent_id": "t3_64t5c9", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I started watching AT by chance and because one friend recommended it to me when it first aired in Spain in 2011 but without a specific order but I got bored and I even began to hate the series for some reason xD but IDKH last year I gave it another opportunity (to add some information about censorship of the series in Spain at the AT wiki) but I never paid attention to the plot and all that.\n\nSo about one or two months ago I started re-watching AT again this time in order and in English (I personally don't like very much the Spanish dub, specially Finn's voice, -always- often original version is much better) and now I'm enjoying much more than before, I prefer the deepest plots about the characters and the universe overall, than the rude and dumb humor featured in the first seasons, this make it all more adult and unique (this doesn't mean all of them are good, there are better and worse episodes like in every show, but anyway). It helps that there's still a very huge fanbase there even it's seven years from the series' premiere and I hope that one day I can catch you so we can watch the finale together (I also don't want to a series like this come to an end but it's the necessary for its own good).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started watching AT by chance and because one friend recommended it to me when it first aired in Spain in 2011 but without a specific order but I got bored and I even began to hate the series for some reason xD but IDKH last year I gave it another opportunity (to add some information about censorship of the series in Spain at the AT wiki) but I never paid attention to the plot and all that.&lt;/p&gt;\n\n&lt;p&gt;So about one or two months ago I started re-watching AT again this time in order and in English (I personally don&amp;#39;t like very much the Spanish dub, specially Finn&amp;#39;s voice, -always- often original version is much better) and now I&amp;#39;m enjoying much more than before, I prefer the deepest plots about the characters and the universe overall, than the rude and dumb humor featured in the first seasons, this make it all more adult and unique (this doesn&amp;#39;t mean all of them are good, there are better and worse episodes like in every show, but anyway). It helps that there&amp;#39;s still a very huge fanbase there even it&amp;#39;s seven years from the series&amp;#39; premiere and I hope that one day I can catch you so we can watch the finale together (I also don&amp;#39;t want to a series like this come to an end but it&amp;#39;s the necessary for its own good).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8rv93", "score_hidden": false, "stickied": false, "created": 1492173914.0, "created_utc": 1492145114.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]