[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "adventuretime", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For instance, were you really butthurt about The Red Throne when it first came out, but now, three years later, realize its value and how not-that-bad it is? &lt;/p&gt;\n\n&lt;p&gt;For me, a particular instance is the episode &amp;#39;Betty.&amp;#39; When I first saw it, like everyone else I felt like it was rushed - Marceline hardly got to interact with Simon and Betty adjusting to Ooo practically in an instant are two points of contention for many, even to this day. &lt;/p&gt;\n\n&lt;p&gt;Now, though, I understand that this was all done intentionally. Or at least, that&amp;#39;s how I see it. It was meant to be too fast, Simon would die without the crown&amp;#39;s magic sustaining his life. Thus, his interactions with his loved ones were appropriately brief, but still held meaning and weight. &lt;/p&gt;\n\n&lt;p&gt;This wasn&amp;#39;t meant to be Simon&amp;#39;s happy reunion with his loved ones, it was a frantic race against time. &lt;/p&gt;\n\n&lt;p&gt;Plus I loved all the little details crammed into this episode, like the the wizard po-po actually throwing their boots at Bella Noche, the Ice Kingdom looking like it was crying as it was melting, paralleling Simon&amp;#39;s predicament beautifully, and Jake&amp;#39;s... interesting form as he ran there. &lt;/p&gt;\n\n&lt;p&gt;Plus, the fact that Death had a mixtape especially made for when Ice King would die is hilarious (speaking of which, anyone else think he was outright telling the audience Simon would never be cured? He emphasized that this would be his &amp;quot;one chance&amp;quot;) &lt;/p&gt;\n\n&lt;p&gt;Also this episode has two of the best fight scenes in the show&amp;#39;s history: &lt;/p&gt;\n\n&lt;p&gt;Simon punching the fuck out of Ash, and Betty thrashing the all-powerful elder god, Bella Noche, in like two seconds. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For instance, were you really butthurt about The Red Throne when it first came out, but now, three years later, realize its value and how not-that-bad it is? \n\nFor me, a particular instance is the episode 'Betty.' When I first saw it, like everyone else I felt like it was rushed - Marceline hardly got to interact with Simon and Betty adjusting to Ooo practically in an instant are two points of contention for many, even to this day. \n\nNow, though, I understand that this was all done intentionally. Or at least, that's how I see it. It was meant to be too fast, Simon would die without the crown's magic sustaining his life. Thus, his interactions with his loved ones were appropriately brief, but still held meaning and weight. \n\nThis wasn't meant to be Simon's happy reunion with his loved ones, it was a frantic race against time. \n\nPlus I loved all the little details crammed into this episode, like the the wizard po-po actually throwing their boots at Bella Noche, the Ice Kingdom looking like it was crying as it was melting, paralleling Simon's predicament beautifully, and Jake's... interesting form as he ran there. \n\nPlus, the fact that Death had a mixtape especially made for when Ice King would die is hilarious (speaking of which, anyone else think he was outright telling the audience Simon would never be cured? He emphasized that this would be his \"one chance\") \n\nAlso this episode has two of the best fight scenes in the show's history: \n\nSimon punching the fuck out of Ash, and Betty thrashing the all-powerful elder god, Bella Noche, in like two seconds. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659z3m", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "LilPotato911", "saved": false, "mod_reports": [], "name": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "approved_by": null, "over_18": false, "domain": "self.adventuretime", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s54g", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "quietbottom", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/adventuretime/comments/659z3m/has_your_opinion_about_an_event_in_the_show/", "num_reports": null, "locked": false, "stickied": false, "created": 1492165217.0, "url": "https://www.reddit.com/r/adventuretime/comments/659z3m/has_your_opinion_about_an_event_in_the_show/", "author_flair_text": "", "quarantine": false, "title": "Has your opinion about an event in the show become positive over time?", "created_utc": 1492136417.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dg8opq2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LilPotato911", "parent_id": "t1_dg8oevw", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Lately I've been rewatching the series with a buddy who's never seen the show before, and I noticed something incredibly sad about that episode. \n\nIn pretty much all their scenes together, except the very first, Ash tricks Marceline and says/does some pretty degrading things to her. Yet she takes it all in stride. It's only when he sells her beloved Hambo that she breaks up with him. So, what this tells me is Marceline blinded herself to Ash's behavior because she didn't want to lose him (the whole memory sequence demonstrates that Marceline has been alone for a greater part of her life). \n\nCan you imagine the ending from her perspective? Finn just suddenly tells her that Ash did this horrible thing, and then manipulated her into forgetting about it within a single sentence, and she had no idea this happened. It explains why she's really quiet by the end of the episode. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lately I&amp;#39;ve been rewatching the series with a buddy who&amp;#39;s never seen the show before, and I noticed something incredibly sad about that episode. &lt;/p&gt;\n\n&lt;p&gt;In pretty much all their scenes together, except the very first, Ash tricks Marceline and says/does some pretty degrading things to her. Yet she takes it all in stride. It&amp;#39;s only when he sells her beloved Hambo that she breaks up with him. So, what this tells me is Marceline blinded herself to Ash&amp;#39;s behavior because she didn&amp;#39;t want to lose him (the whole memory sequence demonstrates that Marceline has been alone for a greater part of her life). &lt;/p&gt;\n\n&lt;p&gt;Can you imagine the ending from her perspective? Finn just suddenly tells her that Ash did this horrible thing, and then manipulated her into forgetting about it within a single sentence, and she had no idea this happened. It explains why she&amp;#39;s really quiet by the end of the episode. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8opq2", "score_hidden": false, "stickied": false, "created": 1492168733.0, "created_utc": 1492139933.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8oevw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "JumpinJamnamz", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I dunno, for big *event* events, nothing is coming to mind. For those, my opinions have stayed more or less the same (maybe amplified, but the overall opinion would be the same)\n\nThough this is a minor thing, my thoughts on Marceline's interactions with Ash in \"Memory of a Memory\" have changed since I was younger. My thoughts when first watching it was that she was out of character, so I thought the writers were being a bunch of dummies (I especially didn't like that she, as a powerful demon-vampire thing, stayed inside while Ash pursued his neighbour's \"attacker).\n\nRewatching it years later, I realized that it's \"out of character\" but in a way that's realistic. Ash was a manipulative dude (e.g. controlling what kind of friends his girlfriend hangs out with) so it makes sense that Marceline would act different when she was dating him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dunno, for big &lt;em&gt;event&lt;/em&gt; events, nothing is coming to mind. For those, my opinions have stayed more or less the same (maybe amplified, but the overall opinion would be the same)&lt;/p&gt;\n\n&lt;p&gt;Though this is a minor thing, my thoughts on Marceline&amp;#39;s interactions with Ash in &amp;quot;Memory of a Memory&amp;quot; have changed since I was younger. My thoughts when first watching it was that she was out of character, so I thought the writers were being a bunch of dummies (I especially didn&amp;#39;t like that she, as a powerful demon-vampire thing, stayed inside while Ash pursued his neighbour&amp;#39;s &amp;quot;attacker).&lt;/p&gt;\n\n&lt;p&gt;Rewatching it years later, I realized that it&amp;#39;s &amp;quot;out of character&amp;quot; but in a way that&amp;#39;s realistic. Ash was a manipulative dude (e.g. controlling what kind of friends his girlfriend hangs out with) so it makes sense that Marceline would act different when she was dating him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8oevw", "score_hidden": false, "stickied": false, "created": 1492168284.0, "created_utc": 1492139484.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dg8qdh9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Puzzlem00n", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "The Red Throne is a pretty good example--as a fan of Finn and FP, I wasn't mad so much as disappointed, but now that I'm a bit older Finn's breakup arc really resonates. Finn getting his arm back was a bit of a shock, but I was cool with it after a Redditor pointed out the thorn in his palm and I knew it would be coming back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Red Throne is a pretty good example--as a fan of Finn and FP, I wasn&amp;#39;t mad so much as disappointed, but now that I&amp;#39;m a bit older Finn&amp;#39;s breakup arc really resonates. Finn getting his arm back was a bit of a shock, but I was cool with it after a Redditor pointed out the thorn in his palm and I knew it would be coming back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8qdh9", "score_hidden": false, "stickied": false, "created": 1492171374.0, "created_utc": 1492142574.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dg8s620", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GrAdmThrwn", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "My first impression of Sir Slicer...I mean, here's this guy who would later go on to become a critical component of the entire story as a whole, and he can't even get off his horse!? What's with that? Since when is armour THAT heavy?\n\nBut now that I look back, I realize that he was handled with the finesse and depth befitting so integral a character on the show and I'm glad they gave him a humbling moment to offset his overwhelming \"*CHk CHk!*\"\n\n(*Came here to say stuff about stuff that the rest of the sub pretty much covered.*)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My first impression of Sir Slicer...I mean, here&amp;#39;s this guy who would later go on to become a critical component of the entire story as a whole, and he can&amp;#39;t even get off his horse!? What&amp;#39;s with that? Since when is armour THAT heavy?&lt;/p&gt;\n\n&lt;p&gt;But now that I look back, I realize that he was handled with the finesse and depth befitting so integral a character on the show and I&amp;#39;m glad they gave him a humbling moment to offset his overwhelming &amp;quot;&lt;em&gt;CHk CHk!&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(&lt;em&gt;Came here to say stuff about stuff that the rest of the sub pretty much covered.&lt;/em&gt;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8s620", "score_hidden": false, "stickied": false, "created": 1492174473.0, "created_utc": 1492145673.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dg8wgwv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Darkanine", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "\"Is that You?\" left me with a really bad taste in my mouth in the initial viewing. Upon my original watch of Season 6, I was largely negative towards it as it seemed to undue a lot of the bigger plot points of Season 5. However, the more I think about it, the more intelligent the episode is. Prismo is a super powerful cosmic entity who complete control over time, so the fact that he did what he did is logical in it's own way and the episode set up a ton of future stories with the advent of Finn Sword and ushered in \"Crossover\", which is a fantastic episode IMO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Is that You?&amp;quot; left me with a really bad taste in my mouth in the initial viewing. Upon my original watch of Season 6, I was largely negative towards it as it seemed to undue a lot of the bigger plot points of Season 5. However, the more I think about it, the more intelligent the episode is. Prismo is a super powerful cosmic entity who complete control over time, so the fact that he did what he did is logical in it&amp;#39;s own way and the episode set up a ton of future stories with the advent of Finn Sword and ushered in &amp;quot;Crossover&amp;quot;, which is a fantastic episode IMO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8wgwv", "score_hidden": false, "stickied": false, "created": 1492184388.0, "created_utc": 1492155588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dg8su5u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yellowfellow378", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Finn's arm. I thought how they brought back his arm during \"Breezy\" was a bit of a cop out, but slowly started appreciating it more with the Grass Sword curse tie in and the eventual replacement bionic arm (which had been foreshadowed since early on).\n\nAnd while I never disliked the Martin saga, it always left a weird feeling that he just vanished at the end of \"The Comet\". It felt like there could have been a better way to resolve his story. But Islands really put Martin's actions into perspective and I can empathize with why he decided to put his reality behind him. \"When you burn enough bridges, the only way is to move forward.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Finn&amp;#39;s arm. I thought how they brought back his arm during &amp;quot;Breezy&amp;quot; was a bit of a cop out, but slowly started appreciating it more with the Grass Sword curse tie in and the eventual replacement bionic arm (which had been foreshadowed since early on).&lt;/p&gt;\n\n&lt;p&gt;And while I never disliked the Martin saga, it always left a weird feeling that he just vanished at the end of &amp;quot;The Comet&amp;quot;. It felt like there could have been a better way to resolve his story. But Islands really put Martin&amp;#39;s actions into perspective and I can empathize with why he decided to put his reality behind him. &amp;quot;When you burn enough bridges, the only way is to move forward.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8su5u", "score_hidden": false, "stickied": false, "created": 1492175760.0, "created_utc": 1492146960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dg8w5qy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Grey--man", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I thought Finn and FP braking up was a pretty bad thing, but I love how the show goes to such length to prove how short-sited Finn was through the entire relationship", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I thought Finn and FP braking up was a pretty bad thing, but I love how the show goes to such length to prove how short-sited Finn was through the entire relationship&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8w5qy", "score_hidden": false, "stickied": false, "created": 1492183499.0, "created_utc": 1492154699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dg9gf48", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Way_Moby", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Since late season five and early season six, I've been a defender of both \"The Red Throne\" and \"Breezy\". I liked what they both had to say, but I understand why fans were mad. With the new reveals in season 7 and 8, both of these episodes are much, much easier to watch even though I liked 'em. Finn's apology in \"Bun Bun\", for instance, really repaired any lingering distaste I might've had for \"The Red Throne\". And Finn's grass-sword-curse-bionic-arm saga has proven me right in thinking that \"Breezy\" was not the end of that story.\n\nI remember being really, really disappointed in \"Betty\". I thought it was OK, but was really hoping for something bigger and better. But now I realize it was a set-up episode and not, as you said, a \"happy reunion\". And with \"Elements\" promising much more of the Betty/Simon story, I can watch \"Betty\" and be happy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since late season five and early season six, I&amp;#39;ve been a defender of both &amp;quot;The Red Throne&amp;quot; and &amp;quot;Breezy&amp;quot;. I liked what they both had to say, but I understand why fans were mad. With the new reveals in season 7 and 8, both of these episodes are much, much easier to watch even though I liked &amp;#39;em. Finn&amp;#39;s apology in &amp;quot;Bun Bun&amp;quot;, for instance, really repaired any lingering distaste I might&amp;#39;ve had for &amp;quot;The Red Throne&amp;quot;. And Finn&amp;#39;s grass-sword-curse-bionic-arm saga has proven me right in thinking that &amp;quot;Breezy&amp;quot; was not the end of that story.&lt;/p&gt;\n\n&lt;p&gt;I remember being really, really disappointed in &amp;quot;Betty&amp;quot;. I thought it was OK, but was really hoping for something bigger and better. But now I realize it was a set-up episode and not, as you said, a &amp;quot;happy reunion&amp;quot;. And with &amp;quot;Elements&amp;quot; promising much more of the Betty/Simon story, I can watch &amp;quot;Betty&amp;quot; and be happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg9gf48", "score_hidden": false, "stickied": false, "created": 1492219934.0, "created_utc": 1492191134.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dgd8s8v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rantonels", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I think and always thought \"Betty\" is one of the best episodes ever. It's frantic and crazy. And that scene with Death is incredible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think and always thought &amp;quot;Betty&amp;quot; is one of the best episodes ever. It&amp;#39;s frantic and crazy. And that scene with Death is incredible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dgd8s8v", "score_hidden": false, "stickied": false, "created": 1492442381.0, "created_utc": 1492413581.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_659z3m", "likes": null, "replies": "", "user_reports": [], "id": "dg8rhzd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LilPotato911", "parent_id": "t1_dg8r39q", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "What is satisfying is in the eye of the beholder, I suppose. AT's interest in being subversive is an undeniable, though not driving, factor. I actually like how this show decides to tell its stories, because it never dramatizes or inflates the scope of what is happening. Everything in Adventure Time always feels genuine - the story progression, the world building, the atmosphere, dialogue and characters; it's why I love this show so much. Everything that happens feels natural, even with all the mania that surrounds us it truly feels like we're seeing just a glimpse in the everyday lives of these characters. This is true, even in the earliest episodes - it's impressive they manage to maintain this for the show's entire run.  \n\nI sincerely doubt the writers would discard character development just to give Finn's arm back, because I've seen enough of these people's behind-the-scenes work to know they love this show as much as we do, and put a lot of care into each and every episode. It's also why I approach everything that happens with an open mind, because I know the writers do these things deliberately. \n\nOf course, the majority of the people don't feel the same. They expect the expected and are disappointed when that never happens. This show is full of instances like that, always, not just with moments that truly riled viewers: see Betty punching out Bella Noche in an anticlimactic way, the Lich being baby-fied after his grand speech, Lemonhope being a shit and Betty failing tragically in her efforts to save Simon.\n\n And to be honest, I'm fine with that; Adventure Time was never meant to be like other shows, and that, too, is what I like about it. ", "edited": 1492144636.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is satisfying is in the eye of the beholder, I suppose. AT&amp;#39;s interest in being subversive is an undeniable, though not driving, factor. I actually like how this show decides to tell its stories, because it never dramatizes or inflates the scope of what is happening. Everything in Adventure Time always feels genuine - the story progression, the world building, the atmosphere, dialogue and characters; it&amp;#39;s why I love this show so much. Everything that happens feels natural, even with all the mania that surrounds us it truly feels like we&amp;#39;re seeing just a glimpse in the everyday lives of these characters. This is true, even in the earliest episodes - it&amp;#39;s impressive they manage to maintain this for the show&amp;#39;s entire run.  &lt;/p&gt;\n\n&lt;p&gt;I sincerely doubt the writers would discard character development just to give Finn&amp;#39;s arm back, because I&amp;#39;ve seen enough of these people&amp;#39;s behind-the-scenes work to know they love this show as much as we do, and put a lot of care into each and every episode. It&amp;#39;s also why I approach everything that happens with an open mind, because I know the writers do these things deliberately. &lt;/p&gt;\n\n&lt;p&gt;Of course, the majority of the people don&amp;#39;t feel the same. They expect the expected and are disappointed when that never happens. This show is full of instances like that, always, not just with moments that truly riled viewers: see Betty punching out Bella Noche in an anticlimactic way, the Lich being baby-fied after his grand speech, Lemonhope being a shit and Betty failing tragically in her efforts to save Simon.&lt;/p&gt;\n\n&lt;p&gt;And to be honest, I&amp;#39;m fine with that; Adventure Time was never meant to be like other shows, and that, too, is what I like about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8rhzd", "score_hidden": false, "stickied": false, "created": 1492173252.0, "created_utc": 1492144452.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8r39q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stuped1811", "parent_id": "t1_dg8qkx0", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Yeah, ultimately neither of us are more right than the other. Just have different interests in storytelling. At times I feel like AT is more interested in being \"subversive\" with its storytelling decisions over telling satisfying stories, but that's me.\n\nThing with the arm is, its a constant thing that sticks with Finn- the show can't forget about it. With character development they could always chose to not care about it if it clashes with their desires. I feel like that was the main thing that annoyed people- they saw something undeniably showing change pushed aside in favor of things they (the creators) could stick with or discard at their leisure. That's how I've always thought of it at least.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, ultimately neither of us are more right than the other. Just have different interests in storytelling. At times I feel like AT is more interested in being &amp;quot;subversive&amp;quot; with its storytelling decisions over telling satisfying stories, but that&amp;#39;s me.&lt;/p&gt;\n\n&lt;p&gt;Thing with the arm is, its a constant thing that sticks with Finn- the show can&amp;#39;t forget about it. With character development they could always chose to not care about it if it clashes with their desires. I feel like that was the main thing that annoyed people- they saw something undeniably showing change pushed aside in favor of things they (the creators) could stick with or discard at their leisure. That&amp;#39;s how I&amp;#39;ve always thought of it at least.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8r39q", "score_hidden": false, "stickied": false, "created": 1492172551.0, "created_utc": 1492143751.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8qkx0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LilPotato911", "parent_id": "t1_dg8qaeh", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Eh, I'm just explaining my perspective, friend. You have your's - there is no real right answer, and I think that's what is so great about this show. It's so different from anything else; it doesn't follow typical storytelling tropes, and it takes a certain type of individual to appreciate them. \n\nYeah, I understand the Breezy thing would have been a huge shitfit the instant I saw it, but what surprised me were two things, both linking to a lack of observation on the fans' part: \n\n1 - The thorn made it blatantly obvious that subplot wasn't going anywhere\n\n2 - People were not paying attention to The Tower, when any prosthetic arm was blown up by the grass curse. \n\nAnd to top it all off, it showed people cared more about an aesthetic change than actual character development, because it's clear that the events of the premiere had stuck with Finn long after. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, I&amp;#39;m just explaining my perspective, friend. You have your&amp;#39;s - there is no real right answer, and I think that&amp;#39;s what is so great about this show. It&amp;#39;s so different from anything else; it doesn&amp;#39;t follow typical storytelling tropes, and it takes a certain type of individual to appreciate them. &lt;/p&gt;\n\n&lt;p&gt;Yeah, I understand the Breezy thing would have been a huge shitfit the instant I saw it, but what surprised me were two things, both linking to a lack of observation on the fans&amp;#39; part: &lt;/p&gt;\n\n&lt;p&gt;1 - The thorn made it blatantly obvious that subplot wasn&amp;#39;t going anywhere&lt;/p&gt;\n\n&lt;p&gt;2 - People were not paying attention to The Tower, when any prosthetic arm was blown up by the grass curse. &lt;/p&gt;\n\n&lt;p&gt;And to top it all off, it showed people cared more about an aesthetic change than actual character development, because it&amp;#39;s clear that the events of the premiere had stuck with Finn long after. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8qkx0", "score_hidden": false, "stickied": false, "created": 1492171708.0, "created_utc": 1492142908.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8qaeh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stuped1811", "parent_id": "t1_dg8pxeq", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Hey, just because Jake is disappointed doesn't mean everything's fine. From some perspective it could make things worse since that means they knew that what they were doing would be disappointing but went with it anyway. I don't know, is it better to follow your own artistic hopes and dreams and do what you want as an artist or try to do things that please the fans you have? Shit man, all I know is the way Jake's little ones were handled still seems way poor to me.\n\nIt's not really \"I wish the show did what I wanted (though that totally comes into it, I suppose)\" but more \"What the show did was wasteful and disappointing\" I guess. I don't know man, I've been having discussions like this about Jake's babes for like 4 years and I think I'll always think they were a huge missed opportunity. Or a waste of an opportunity? Ones of those.\n\nAnd I feel like they had it coming with Breezy. People were REALLY hype for Finn's arm and the way they handled it just made it seem like \"Hey audience, you know story progression and character development? Well, fuck those, here's magic bee ejaculate and no lasting consequences.\" Damn, did they expect people to not be up in arms over that? It seemed like such a spiteful thing to do to your viewers. I don't much blame people for walking away after that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, just because Jake is disappointed doesn&amp;#39;t mean everything&amp;#39;s fine. From some perspective it could make things worse since that means they knew that what they were doing would be disappointing but went with it anyway. I don&amp;#39;t know, is it better to follow your own artistic hopes and dreams and do what you want as an artist or try to do things that please the fans you have? Shit man, all I know is the way Jake&amp;#39;s little ones were handled still seems way poor to me.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not really &amp;quot;I wish the show did what I wanted (though that totally comes into it, I suppose)&amp;quot; but more &amp;quot;What the show did was wasteful and disappointing&amp;quot; I guess. I don&amp;#39;t know man, I&amp;#39;ve been having discussions like this about Jake&amp;#39;s babes for like 4 years and I think I&amp;#39;ll always think they were a huge missed opportunity. Or a waste of an opportunity? Ones of those.&lt;/p&gt;\n\n&lt;p&gt;And I feel like they had it coming with Breezy. People were REALLY hype for Finn&amp;#39;s arm and the way they handled it just made it seem like &amp;quot;Hey audience, you know story progression and character development? Well, fuck those, here&amp;#39;s magic bee ejaculate and no lasting consequences.&amp;quot; Damn, did they expect people to not be up in arms over that? It seemed like such a spiteful thing to do to your viewers. I don&amp;#39;t much blame people for walking away after that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8qaeh", "score_hidden": false, "stickied": false, "created": 1492171241.0, "created_utc": 1492142441.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pxeq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LilPotato911", "parent_id": "t1_dg8piqb", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "&gt; And of course they have to dedicate a few episodes a season to the kids so no one can say that they totally dropped the children plotline and brushed them under the rug.\n\nI think that's a crude way of looking at it. Of course we don't know what's actually going through the writers' heads, but I'm pretty sure it wasn't this. \n\nYou're right - it would have truly changed Jake's character. In fact, he was entirely open to that. He was all about being a dad - heck, he's always wanted to be one. But it was suddenly and unexpectedly torn away from him, and while everyone around him, even Finn, seems to be growing up, Jake has remained stagnant. The show is aware of this (take 'Skate' for instance) and I think this was the intent from the beginning. \n\nI don't think it's fair to curse the show for not doing what we wanted it to do, you know? That's how I feel about young-PB and Finn getting his \"arm\" back in Breezy (holy shmow people were so mad about that it instantly shrunk the fanbase by a sizable percentage). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And of course they have to dedicate a few episodes a season to the kids so no one can say that they totally dropped the children plotline and brushed them under the rug.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think that&amp;#39;s a crude way of looking at it. Of course we don&amp;#39;t know what&amp;#39;s actually going through the writers&amp;#39; heads, but I&amp;#39;m pretty sure it wasn&amp;#39;t this. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right - it would have truly changed Jake&amp;#39;s character. In fact, he was entirely open to that. He was all about being a dad - heck, he&amp;#39;s always wanted to be one. But it was suddenly and unexpectedly torn away from him, and while everyone around him, even Finn, seems to be growing up, Jake has remained stagnant. The show is aware of this (take &amp;#39;Skate&amp;#39; for instance) and I think this was the intent from the beginning. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think it&amp;#39;s fair to curse the show for not doing what we wanted it to do, you know? That&amp;#39;s how I feel about young-PB and Finn getting his &amp;quot;arm&amp;quot; back in Breezy (holy shmow people were so mad about that it instantly shrunk the fanbase by a sizable percentage). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8pxeq", "score_hidden": false, "stickied": false, "created": 1492170653.0, "created_utc": 1492141853.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8piqb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Stuped1811", "parent_id": "t1_dg8p9qt", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "I'm at basically the opposite end- felt pretty dishonest of how things were portrayed and that they stomped all over what would have been the best way to give Jake character development and shake up his and Finn's relationship only to keep the main duo's status quo in shape. And of course they have to dedicate a few episodes a season to the kids so no one can say that they totally dropped the children plotline and brushed them under the rug.\n\nI mean, having the secondary main character have children seems like a roundabout way to get a few more recurring characters into the show. If they were gonna do that I wish they were MORE casual about it- like Jake suddenly goes to Lady's house one day and whoops oh crap I have five children now? What a wacky scenario this is. Then I would be cool with the way the show's handling them because they were never implied to be more significant than that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m at basically the opposite end- felt pretty dishonest of how things were portrayed and that they stomped all over what would have been the best way to give Jake character development and shake up his and Finn&amp;#39;s relationship only to keep the main duo&amp;#39;s status quo in shape. And of course they have to dedicate a few episodes a season to the kids so no one can say that they totally dropped the children plotline and brushed them under the rug.&lt;/p&gt;\n\n&lt;p&gt;I mean, having the secondary main character have children seems like a roundabout way to get a few more recurring characters into the show. If they were gonna do that I wish they were MORE casual about it- like Jake suddenly goes to Lady&amp;#39;s house one day and whoops oh crap I have five children now? What a wacky scenario this is. Then I would be cool with the way the show&amp;#39;s handling them because they were never implied to be more significant than that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8piqb", "score_hidden": false, "stickied": false, "created": 1492169999.0, "created_utc": 1492141199.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8p9qt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LilPotato911", "parent_id": "t1_dg8ortz", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "You know, I actually love what they did with the rainicorn pups. Everyone thought they were going to be this huge change to the status quo, it was advertised that way for sure, and then by the end they grow up within a day and there's just this air of, \"Damn. That sucked and was unexpected.\" I laughed my ass off when I first saw it. Plus the effect it had on Jake was obvious - I like the stories that deal with his relationship with them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, I actually love what they did with the rainicorn pups. Everyone thought they were going to be this huge change to the status quo, it was advertised that way for sure, and then by the end they grow up within a day and there&amp;#39;s just this air of, &amp;quot;Damn. That sucked and was unexpected.&amp;quot; I laughed my ass off when I first saw it. Plus the effect it had on Jake was obvious - I like the stories that deal with his relationship with them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8p9qt", "score_hidden": false, "stickied": false, "created": 1492169602.0, "created_utc": 1492140802.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ortz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stuped1811", "parent_id": "t3_659z3m", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Ha ha, I thought both episodes you listed were kind of shit and mostly still think that (though I'm becoming less hard on Betty as her storyline continues).\n\nThis has sort of happened with a lot of things. I thought Jake's kids were horrendously wasted and still think that to some extent, but the more character they're given the more okay I become with it. I thought Finn getting his arm back in Breezy was awful, but now that he finally got that sweet prosthetic I'm generally a little more positive to it. \n\nEven when Adventure Time fucks something up bigtime, over time it usually does damage control and makes those fuck ups more bearable. However I never really think they totally fix things- I still consider things like Jake's kids to have been wasted to an extent and Betty's existence to be kind of fan fiction-ey wank. So they repair some of the damage but never manage to retrieve all the lost potential, in my eyes.\n\nOne thing I'm totally fine with is Too Young. There's still a decent amount of people who are still dissatisfied in how they created young PB to instantly poof her back, and I understand where they're coming from and in the past may have been similarly dissatisfied, but I'm okay with it for one reason; the episode completely shifted the Finn/Bubblegum dynamic to a situation where PB will never reciprocate Finn's feelings. Going from a \"will they or won't they but they probably will\" to a situation like that is just enough of a status quo change that I'm cool with it, though if they ever go back to Fubblegum (which would be absolutely fucking bonkers at this point) all the goodwill they earned with that will be washed down the drain. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ha ha, I thought both episodes you listed were kind of shit and mostly still think that (though I&amp;#39;m becoming less hard on Betty as her storyline continues).&lt;/p&gt;\n\n&lt;p&gt;This has sort of happened with a lot of things. I thought Jake&amp;#39;s kids were horrendously wasted and still think that to some extent, but the more character they&amp;#39;re given the more okay I become with it. I thought Finn getting his arm back in Breezy was awful, but now that he finally got that sweet prosthetic I&amp;#39;m generally a little more positive to it. &lt;/p&gt;\n\n&lt;p&gt;Even when Adventure Time fucks something up bigtime, over time it usually does damage control and makes those fuck ups more bearable. However I never really think they totally fix things- I still consider things like Jake&amp;#39;s kids to have been wasted to an extent and Betty&amp;#39;s existence to be kind of fan fiction-ey wank. So they repair some of the damage but never manage to retrieve all the lost potential, in my eyes.&lt;/p&gt;\n\n&lt;p&gt;One thing I&amp;#39;m totally fine with is Too Young. There&amp;#39;s still a decent amount of people who are still dissatisfied in how they created young PB to instantly poof her back, and I understand where they&amp;#39;re coming from and in the past may have been similarly dissatisfied, but I&amp;#39;m okay with it for one reason; the episode completely shifted the Finn/Bubblegum dynamic to a situation where PB will never reciprocate Finn&amp;#39;s feelings. Going from a &amp;quot;will they or won&amp;#39;t they but they probably will&amp;quot; to a situation like that is just enough of a status quo change that I&amp;#39;m cool with it, though if they ever go back to Fubblegum (which would be absolutely fucking bonkers at this point) all the goodwill they earned with that will be washed down the drain. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dg8ortz", "score_hidden": false, "stickied": false, "created": 1492168822.0, "created_utc": 1492140022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]