[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "adventuretime", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Link to part 1: &lt;a href=\"https://www.reddit.com/r/adventuretime/comments/5y3s5n/very_distant_lands_part_1_what_time_is_it/\"&gt;https://www.reddit.com/r/adventuretime/comments/5y3s5n/very_distant_lands_part_1_what_time_is_it/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Link to part 2: &lt;a href=\"https://www.reddit.com/r/adventuretime/comments/5zgglb/very_distant_lands_part_2_if_sweetness_can_win/\"&gt;https://www.reddit.com/r/adventuretime/comments/5zgglb/very_distant_lands_part_2_if_sweetness_can_win/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Shall I liken thee to a rose, &lt;em&gt;Adventure Time&lt;/em&gt;? I shall, briefly. If season one, the slight, but unbreakable source of all that was to come, was a seed, and season two, the upwards development from that origin, was a stem, then season three is where the pedals of &lt;em&gt;Adventure Time&lt;/em&gt; begin to bloom. No longer merely &lt;em&gt;upwards&lt;/em&gt;, but &lt;em&gt;outwards&lt;/em&gt;; this is when the show starts to flex its experimental muscles, trying out all sorts of new, exciting possibilities yet untapped by the eleven-minute cartoon format. Season three is when it becomes apparent just how much freedom this television show really has.&lt;/p&gt;\n\n&lt;p&gt;Season two ended with the first change in status quo the show had weathered, with Princess Bubblegum being aged down to thirteen years old after her possession by the Lich, and season three almost immediately sets a precedent for how the show will handle such developments. For many, that precedent seemed to amount to “We&amp;#39;ll go back on them pretty quickly,” as PB regains her former status in a matter of five episodes in “Too Young”, disappointing viewers who were looking forward to a new character dynamic between her and Finn. But there is another principle laid down by the show&amp;#39;s treatment of that event: “Neither plot progressions, nor plot regressions, will leave any of the characters involved completely unchanged”. The time Finn spent with PB while she was thirteen clarified his romantic feelings for her, and her regrowth denied him any further relationship with her. That kind of loss is new to Finn, and his longing for PB colors his actions throughout the season, and long afterwards.&lt;/p&gt;\n\n&lt;p&gt;(The changes Princess Bubblegum herself undergoes after the Lich&amp;#39;s escape will become more apparent in the next season).&lt;/p&gt;\n\n&lt;p&gt;So, Finn is still largely innocent of true anguish, but is learning new things about himself and his world, which often surprise and confuse him. How does the show respond? &lt;em&gt;Adventure Time&lt;/em&gt;&amp;#39;s general tone always mirrors the point Finn is at in his development: season one was silly and joyful, season two showed that developing into a profound sense of love and caring, so season three must continue with wherever Finn is at now. Finn, however, isn&amp;#39;t exactly sure where he is now, so the show begins to play dress-up, picking up all manner of new modes and guises, only to toss them off in favor of something else. The restrictions on the show&amp;#39;s tonal range, already tested by “Mortal Folly/Mortal Recoil”, begin to give way all over the place.&lt;/p&gt;\n\n&lt;p&gt;Some experiments are more important than others. Some will go on to help define the show&amp;#39;s identity going forward, others are momentary asides and detours. The frequency of such detours &lt;em&gt;does&lt;/em&gt; become a part of the show&amp;#39;s tapestry, but most of them individually don&amp;#39;t have much of an impact; that doesn&amp;#39;t keep them from being wonderful, though. There is the introduction of the beloved (In some circles) gender-swapped versions of the cast in “Adventure Time with Fionna and Cake”, an excellent romp with a great punchline. The real, unironic horror if “No One Can Hear You” was absolutely baffling at the time; in retrospect it&amp;#39;s rather portentous. “The New Frontier” is an unsung gem, giving us a bit of world-building by introducing the concept of prophetic dreams featuring the Cosmic Owl, starting the long-running (And distinctly worrying) trend of references to Jake&amp;#39;s mortality, and shows the bond between Finn and Jake in a more heartfelt, powerful way than ever before (“Finn. Let me go.” “Please...”). “Ghost Princess” concludes a subdued detective story with a sublime and beautiful ending, “Marceline&amp;#39;s Closet” gives us a clearer view of how our favorite undead trickster actually lives (Immensely important later on), “Beautopia” revisits the mystery of Susan Strong and leaves us on an even more bittersweet note, and “Another Way” stretches Finn&amp;#39;s character to account for real anger and lack of forethought, setting him up for many a fall to come. Each of these little vignettes seem to exist independently of each other, but taken together depict a world in flux and growth; strange days have come to the Land of Ooo, and to Finn the Human.&lt;/p&gt;\n\n&lt;p&gt;To understand how season three represents a massive turning point in the show&amp;#39;s life, however, there are five episodes that we need to focus on. These stories, out of the numerous and endlessly fractal stories contained within the show&amp;#39;s multitudes, are the most radical elaborations on the show&amp;#39;s original free and heroic spirit that the show had given us up to this point. In the epic sojourn into unknown realms of storytelling that is &lt;em&gt;Adventure Time&lt;/em&gt;, these five stand as mark-stones, signs of how far the journey has gone and where it&amp;#39;s headed. The future of the show, the future of animated television, was determined by a mind game, a musical, a bedtime story, a tearjerker, and a quest.&lt;/p&gt;\n\n&lt;p&gt;First, the mind game. “Memory of a Memory”. Like its fellow animated landmark &lt;em&gt;Cowboy Bebop&lt;/em&gt;, &lt;em&gt;Adventure Time&lt;/em&gt; is largely about people dealing with their pasts, and trying to move on from them. This was hinted at in the first two seasons, with the strange debris lying everywhere gradually cluing us in to Ooo&amp;#39;s post-apocalyptic nature, and the looming shadow of the Lich rearing its head is the horror of that long-gone time returning to menace the present. Ooo definitely had a past, one it had not entirely buried. With this episode, however, we begin to see characters struggling with their personal pasts, as Finn and Jake deliberately dig into someone&amp;#39;s history for the first time, sifting through the memories of a much, much older friend in order to find the one they need.&lt;/p&gt;\n\n&lt;p&gt;Not just any friend, of course: Marceline, the Vampire Queen, a title we will learn much later is quite possibly just as lonely as “Finn the Human”. The long, troubled history of Marceline&amp;#39;s life has been so integral to the development of &lt;em&gt;Adventure Time&lt;/em&gt; that some have declared it the true heart of the show. I do not agree, but the importance of her character cannot be overestimated. It is the answers she possess which provoke the questions which begin to gnaw at the viewers&amp;#39; minds, giving the show&amp;#39;s world a mysterious edge and tinging it with tragedy. We only get a few pieces in “Memory of a Memory”; a scene of a solitary child with a stuffed animal among the ruins of a city, a young teenager infuriated by her father&amp;#39;s callous consumption of her french fries, the early days of her relationship with Ash, not much beyond. But for the first time, the stray pieces begin to hint at a larger whole; we know something happened in between each of those points on the timeline, just not exactly what. Marceline becomes the first character whose personality clearly did not simply spring unbidden into being; it was forged by events she weathered, things she may still be defined by, knowingly or not.&lt;/p&gt;\n\n&lt;p&gt;This episode, like many this season, is an experiment in style as well as substance; the unique structure and visual style recalls &lt;em&gt;Eternal Sunshine of the Spotless Mind&lt;/em&gt; more than anything else, but the real contribution it makes to the show&amp;#39;s ethos is its treatment of the past: the past exists, people have to deal with it, and most importantly, it &lt;em&gt;must&lt;/em&gt; be retained in order for it to be learned from. Finn and Jake&amp;#39;s trek into Marceline&amp;#39;s memory is a trick, put in motion by Ash into order to destroy Marceline&amp;#39;s knowledge of her breakup with him. That is a crime the show cannot abide, and Marceline is particularly outraged when she learns of it. Anyone would be, of course, but still, there is something noteworthy in retrospect about Marceline&amp;#39;s ire being raised by the theft of a memory. We may wish to be free of our past, but it is vital that we do not forget. That&amp;#39;s a lesson many characters take to heart, and it applies to the planet they live on as well.&lt;/p&gt;\n\n&lt;p&gt;Next, the musical. “What Was Missing”, one of the most beloved episodes the show has ever done, is a bit harder to get a handle on than “Memory of a Memory”. It&amp;#39;s a point where a lot of the show&amp;#39;s most important running threads all cross. Marceline&amp;#39;s past is brought up again, as is Finn&amp;#39;s infatuation with PB, the early hints of PB&amp;#39;s often cold, distant nature, Finn and Jake&amp;#39;s bond and how they both test it, basically everything the four central characters are going through is touched on in their quest to retrieve their stolen articles from the thieving Door Lord. Character development had always been present in small moments ever since the first season, but here, for the first time, it&amp;#39;s the entire story. The Door Lord is a distant and nonthreatening antagonist, and all of the real conflict in the episode is internal, among our heroes. It is their own flaws, not a monster or a disaster, that they must contend with.&lt;/p&gt;\n\n&lt;p&gt;I could analyze the details and nuances of the inter-personal dramas in this episode; Marceline&amp;#39;s resentment of PB, PB&amp;#39;s incensement at being so insulted, the complex (And possibly formerly romantic) relationship these spats indicate they posses, and Finn&amp;#39;s quiet, continuing obsession with an older woman who is also one of his dearest friends. But all of these things are dealt with in future episodes in greater detail, and the really vital thing this episode gives us is more of a philosophy than a concrete revelation. These characters&amp;#39; issues matter, and will continue to matter as they continue to tackle them, but what matters more in “What Was Missing” is how they manage to put aside those issues for the sake of each other. Friendship, honesty, and song, these are capable of smoothing over any enmity or fault, uniting all present in a glorious, celebratory burst of joy and cooperation.&lt;/p&gt;\n\n&lt;p&gt;It is here, in Finn&amp;#39;s final song, that &lt;em&gt;Adventure Time&lt;/em&gt; opens its heart, revealing depths immeasurable, finally capitalizing on the noticeable lack of cynicism that had colored it from the start, and creating a moment of utterly untroubled happiness, owed to Finn&amp;#39;s forthrightness about his feelings, both the ones he is conflicted about and the ones he&amp;#39;s more sure of than anything in the world. He may not know what he is to PB, a joke, her knight, or her brother, but he knows that she, Marceline, and Jake (And Bmo!) are his best friends in the world, and the courage he summons to sing out that question and that answer aloud for all to hear is how the day is saved. The missed objects are regained, Marceline becomes a bit more comfortable with wanting to spend time with others, she and PB begin to mend their friendship, and Finn gains a bit of perspective on his teenage crush. Cap in one hand, flag in the other, &lt;em&gt;Adventure Time&lt;/em&gt; plants its feet in the dirt and makes a stand for communication, persistence, openness, and fun.&lt;/p&gt;\n\n&lt;p&gt;Moving on, we have the bedtime story. “What Was Missing”&amp;#39;s more subdued tone seemed strange coming on the heals of the show&amp;#39;s raucous first two years, but “Thank You” stands out even more. It plays more like a classic picture book than an episode of the show which gave us the phrase “Imagination is for turbo-nerds who can&amp;#39;t handle how kick-butt reality is!” Its story is simple, and it does not appear to be concealing any hidden depths: it&amp;#39;s just the story of two species who have trouble coexisting learning to get along. A firedog pup follows a solitary snow-golem home, they live together for a bit, the snow-golem goes to great lengths to get the firepup home to his family, and then they&amp;#39;re reunited at the end. That&amp;#39;s really the whole thing; it&amp;#39;s the way this story is presented which challenges yet again our understanding of what this show is and what it&amp;#39;s trying to do. There are echoes of Miyazaki, Raymond Briggs, Shaun Tan, Pixar, and other influences nobody would have associated with a cartoon built on D&amp;amp;D logic and fart jokes. Stripping away the veil of psychedelic imagery and hyper-kinetic style, we can see how much thought, effort, and love really go into making &lt;em&gt;Adventure Time&lt;/em&gt; what it is.&lt;/p&gt;\n\n&lt;p&gt;The fourth of season three&amp;#39;s great experiments is “Holly Jolly Secrets”. In discussing a work as ever-shifting and eternally searching as &lt;em&gt;Adventure Time&lt;/em&gt;, it can be easy to overdose on superlatives regarding how drastically any given “Important” episode impacts the show as a whole. “This is the episode where everything changed! No, &lt;em&gt;this&lt;/em&gt; is the episode where everything changed! No, this one, no, &lt;em&gt;this&lt;/em&gt; one, no...” etc, etc. So, for the moment, let&amp;#39;s set aside what “Holly Jolly Secrets” represents for the show and just look at it on its own merits. It&amp;#39;s a very slow episode, filling up most of its doubled time with pointless nothings, conveying just how bored and annoyed Finn and Jake are with pouring over Ice King&amp;#39;s secret stash of tapes. The joke seems to be that this is just the video diary of a miserable old wackjob, with none of the significance the treehouse duo are looking for. The final three minutes of the episode, in that context, are a typical &lt;em&gt;Adventure Time&lt;/em&gt; non-punchline, where everything we thought the episode—and, breaking my rule for a moment, the show itself—was going to be is ripped out from under us.&lt;/p&gt;\n\n&lt;p&gt;Shelby describes what happens by saying “It was a miracle.” There certainly is a miraculous quality to the leap of faith the show makes into the world of pain and tragedy with that final montage. As I have outlined throughout this piece, &lt;em&gt;Adventure Time&lt;/em&gt; did not get here in a day, and the progression of developments from the pure fun and games of the first episodes to the heartbreaking material tackled here can be seen clearly in retrospect. But however many hints of this potential there had been along the way, it&amp;#39;s still astonishing to see it realized to this degree; poetic waxings aside, at the time, this is still a children&amp;#39;s cartoon, and for all the groundwork laid by &lt;em&gt;Avatar: The Last Airbender&lt;/em&gt; and &lt;em&gt;Batman: The Animated Series&lt;/em&gt;, the horror and sorrow with which the senseless origins of the Ice King are depicted is still uncharted territory. There&amp;#39;s pushing boundaries, and there&amp;#39;s this.&lt;/p&gt;\n\n&lt;p&gt;In fact, the end of “Holly Jolly Secrets” is so powerful that it doesn&amp;#39;t really require much further analysis. Looking up from our navels, taking a step back, and looking at &lt;em&gt;Adventure Time&lt;/em&gt; as the story of a boy and his friends growing up together, teleological statements about existence and relation be hanged, this episode&amp;#39;s place is obvious: Finn&amp;#39;s arc is, broadly, the journey from innocent to experienced, and learning of the sad history of Simon Petrikov is an experience which deepens his capacity to relate to others, especially his enemies. He can be a better hero, because he understands better who and what he&amp;#39;s fighting for. As did with its introduction of The Lich, the show itself gives its heroic, deceptively simple perspective on life-and-how-to-live-it more credibility by showcasing an awareness of how difficult that perspective can be to hold onto, when confronted with the darkness and bleakness of the world. A few episodes prior to this one, Bmo said to Jake “When bad things happen, I know you want to believe they are a joke. But sometimes, life is scary and dark. That is why we must find the light.” That is what this episode does: it finds the light, the light of the empathy Finn and Jake feel for Ooo&amp;#39;s greatest outcast, and the celebration of that connection they return to every year afterwards, amid the darkness of the ongoing fallout from the Mushroom War.&lt;/p&gt;\n\n&lt;p&gt;The fifth tentpole of season three is not as obviously groundbreaking as the other four. It has weight to it, but nothing like emotional wallop of “Holly Jolly Secrets”. It is interesting stylistically, but not to the extent of the dynamically structured “Memory of a Memory” or the beautifully restrained “Thank You”. It sheds light on important character dynamics, but not in the endlessly intruging way that “What Was Missing” did. It destroys no preconceived notions of what cartoons can be, or even really push the boundaries of its own show. It could have come before all these fascinating innovations, placed somewhere around the end of season two, perhaps. It is the episode called “Dad&amp;#39;s Dungeon”.&lt;/p&gt;\n\n&lt;p&gt;“Dad&amp;#39;s Dungeon” is a terrifically fun and creative episode, giving us some quirky monsters and some refreshing updates on the familiar dungeon-crawl template we&amp;#39;ve known since the first season. On the surface, that&amp;#39;s all it is; there&amp;#39;s some interesting stuff about Finn and Jake&amp;#39;s feelings about their dead (And in Finn&amp;#39;s case, adoptive) father Joshua, but it isn&amp;#39;t really given the same thematic heft as Simon Petrikov&amp;#39;s backstory or PB and Marceline&amp;#39;s arguments. What makes this episode a necessary part of the show is how it depicts the dynamic between Finn and Jake.&lt;/p&gt;\n\n&lt;p&gt;You may have noticed this chapter being pretty light on things to say about Finn and Jake, ostensibly our main characters, our rocks in this stormy sea of madness (“I am a rock, I am an Island...”). It is true that during this explosion of possibilities opening up for the show, the treehouse duo are often left in the dust, Finn&amp;#39;s yet-present childishness and Jake&amp;#39;s comfort in his own skin preventing them from keeping up will all the change happening around them. At this point, there are simply more interesting things to focus on. “Dad&amp;#39;s Dungeon”, the penultimate episode of this season, refocuses on our leads in preparation for the golden days of season four: just as The Lich counter-balanced the first two seasons&amp;#39; comparative innocence, the strength of Finn and Jake&amp;#39;s bond counter-balances the dark, strange territory explored by the third. Jake&amp;#39;s careful, utterly compassionate and loving handling of Finn&amp;#39;s crisis brought on by the taunting video messages left by Joshua is beyond touching, and it shows a level of care never really shown before between these two, especially Jake, given his propensity for distraction and laziness. These two aren&amp;#39;t just buds, they&amp;#39;re &lt;em&gt;brothers&lt;/em&gt;, willing to do anything and everything for each other, to go the extra mile or fifty to make sure the other one is alright, and with that kind of surety on our side, it seems as though we can conquer anything this crazy universe throws at us.&lt;/p&gt;\n\n&lt;p&gt;Classically, &lt;em&gt;Adventure Time&lt;/em&gt;&amp;#39;s season finales set the tone for the season to follow. “Mortal Folly/Mortal Recoil” hinted at the bold, brilliant, and sometimes harrowing days of this magnificent third season, and “Incendium” gives us a taste of the more character-focused fourth. Having reestablished the adventurous brothers as the center of the whole enterprise just one episode prior, “Incendium” finally deals with that hopeless crush Finn has for PB. PB&amp;#39;s lack of interest finally drives Finn into a weeping stupor, and Jake, ever the caring (If ultimately misguided) big brother, sets about finding him somebody to loooooove. Most of the episode is setup for the upcoming “Hot to the Touch”, but there is one particularly noteworthy shot: the first time we see Flame Princess, as Jake enters the evil Fire Kingdom. She is beautiful, and captive, and the shot zooms out from her face to depict the whole absurd, distressing setting. She sits trapped in a gigantic kerosene lamp, hoisted above a court worthy of Wonderland, full of sneering, sycophantic fire-people, and above all the pompous, mercenary Flame King, voiced by the impeccable Keith David. Events involving this person and this place will change the shape of things to come, and this shot feels like the first nudge that rolling stone is given.&lt;/p&gt;\n\n&lt;p&gt;“Incendium” cuts off mid-scene, after Flame Princess meets Finn, mistakes him for an enemy, and leaves Finn hopelessly love-struck yet again. One more new thing to try, a last-minute squeezing in of one final experiment before the season wraps up, a fitting end to a block of episodes positively bursting with ideas and departures from standard practice. Season three is not the most even or unified season of &lt;em&gt;Adventure Time&lt;/em&gt;, but it is where the show rises to its calling as a genre-defying kaleidoscope, beginning to elevate its wonderful play-pretend games into something more, something overwhelmingly brave and positive. It brings to a close the early years of this big, big show, emerging with a deep back of tricks and a talent for reality to be reckoned with. Time now, to tie it all together.&lt;/p&gt;\n\n&lt;p&gt;Further reading: &lt;a href=\"https://www.reddit.com/r/adventuretime/comments/5iy0ww/i_wrote_a_thing_about_holly_jolly_secrets/\"&gt;https://www.reddit.com/r/adventuretime/comments/5iy0ww/i_wrote_a_thing_about_holly_jolly_secrets/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Link to part 1: https://www.reddit.com/r/adventuretime/comments/5y3s5n/very_distant_lands_part_1_what_time_is_it/\n\nLink to part 2: https://www.reddit.com/r/adventuretime/comments/5zgglb/very_distant_lands_part_2_if_sweetness_can_win/\n\nShall I liken thee to a rose, *Adventure Time*? I shall, briefly. If season one, the slight, but unbreakable source of all that was to come, was a seed, and season two, the upwards development from that origin, was a stem, then season three is where the pedals of *Adventure Time* begin to bloom. No longer merely *upwards*, but *outwards*; this is when the show starts to flex its experimental muscles, trying out all sorts of new, exciting possibilities yet untapped by the eleven-minute cartoon format. Season three is when it becomes apparent just how much freedom this television show really has.\n\n\nSeason two ended with the first change in status quo the show had weathered, with Princess Bubblegum being aged down to thirteen years old after her possession by the Lich, and season three almost immediately sets a precedent for how the show will handle such developments. For many, that precedent seemed to amount to “We'll go back on them pretty quickly,” as PB regains her former status in a matter of five episodes in “Too Young”, disappointing viewers who were looking forward to a new character dynamic between her and Finn. But there is another principle laid down by the show's treatment of that event: “Neither plot progressions, nor plot regressions, will leave any of the characters involved completely unchanged”. The time Finn spent with PB while she was thirteen clarified his romantic feelings for her, and her regrowth denied him any further relationship with her. That kind of loss is new to Finn, and his longing for PB colors his actions throughout the season, and long afterwards.\n\n\n(The changes Princess Bubblegum herself undergoes after the Lich's escape will become more apparent in the next season).\n\n\nSo, Finn is still largely innocent of true anguish, but is learning new things about himself and his world, which often surprise and confuse him. How does the show respond? *Adventure Time*'s general tone always mirrors the point Finn is at in his development: season one was silly and joyful, season two showed that developing into a profound sense of love and caring, so season three must continue with wherever Finn is at now. Finn, however, isn't exactly sure where he is now, so the show begins to play dress-up, picking up all manner of new modes and guises, only to toss them off in favor of something else. The restrictions on the show's tonal range, already tested by “Mortal Folly/Mortal Recoil”, begin to give way all over the place.\n\n\nSome experiments are more important than others. Some will go on to help define the show's identity going forward, others are momentary asides and detours. The frequency of such detours *does* become a part of the show's tapestry, but most of them individually don't have much of an impact; that doesn't keep them from being wonderful, though. There is the introduction of the beloved (In some circles) gender-swapped versions of the cast in “Adventure Time with Fionna and Cake”, an excellent romp with a great punchline. The real, unironic horror if “No One Can Hear You” was absolutely baffling at the time; in retrospect it's rather portentous. “The New Frontier” is an unsung gem, giving us a bit of world-building by introducing the concept of prophetic dreams featuring the Cosmic Owl, starting the long-running (And distinctly worrying) trend of references to Jake's mortality, and shows the bond between Finn and Jake in a more heartfelt, powerful way than ever before (“Finn. Let me go.” “Please...”). “Ghost Princess” concludes a subdued detective story with a sublime and beautiful ending, “Marceline's Closet” gives us a clearer view of how our favorite undead trickster actually lives (Immensely important later on), “Beautopia” revisits the mystery of Susan Strong and leaves us on an even more bittersweet note, and “Another Way” stretches Finn's character to account for real anger and lack of forethought, setting him up for many a fall to come. Each of these little vignettes seem to exist independently of each other, but taken together depict a world in flux and growth; strange days have come to the Land of Ooo, and to Finn the Human.\n\n\nTo understand how season three represents a massive turning point in the show's life, however, there are five episodes that we need to focus on. These stories, out of the numerous and endlessly fractal stories contained within the show's multitudes, are the most radical elaborations on the show's original free and heroic spirit that the show had given us up to this point. In the epic sojourn into unknown realms of storytelling that is *Adventure Time*, these five stand as mark-stones, signs of how far the journey has gone and where it's headed. The future of the show, the future of animated television, was determined by a mind game, a musical, a bedtime story, a tearjerker, and a quest.\n\n\nFirst, the mind game. “Memory of a Memory”. Like its fellow animated landmark *Cowboy Bebop*, *Adventure Time* is largely about people dealing with their pasts, and trying to move on from them. This was hinted at in the first two seasons, with the strange debris lying everywhere gradually cluing us in to Ooo's post-apocalyptic nature, and the looming shadow of the Lich rearing its head is the horror of that long-gone time returning to menace the present. Ooo definitely had a past, one it had not entirely buried. With this episode, however, we begin to see characters struggling with their personal pasts, as Finn and Jake deliberately dig into someone's history for the first time, sifting through the memories of a much, much older friend in order to find the one they need.\n\n\nNot just any friend, of course: Marceline, the Vampire Queen, a title we will learn much later is quite possibly just as lonely as “Finn the Human”. The long, troubled history of Marceline's life has been so integral to the development of *Adventure Time* that some have declared it the true heart of the show. I do not agree, but the importance of her character cannot be overestimated. It is the answers she possess which provoke the questions which begin to gnaw at the viewers' minds, giving the show's world a mysterious edge and tinging it with tragedy. We only get a few pieces in “Memory of a Memory”; a scene of a solitary child with a stuffed animal among the ruins of a city, a young teenager infuriated by her father's callous consumption of her french fries, the early days of her relationship with Ash, not much beyond. But for the first time, the stray pieces begin to hint at a larger whole; we know something happened in between each of those points on the timeline, just not exactly what. Marceline becomes the first character whose personality clearly did not simply spring unbidden into being; it was forged by events she weathered, things she may still be defined by, knowingly or not.\n\n\nThis episode, like many this season, is an experiment in style as well as substance; the unique structure and visual style recalls *Eternal Sunshine of the Spotless Mind* more than anything else, but the real contribution it makes to the show's ethos is its treatment of the past: the past exists, people have to deal with it, and most importantly, it *must* be retained in order for it to be learned from. Finn and Jake's trek into Marceline's memory is a trick, put in motion by Ash into order to destroy Marceline's knowledge of her breakup with him. That is a crime the show cannot abide, and Marceline is particularly outraged when she learns of it. Anyone would be, of course, but still, there is something noteworthy in retrospect about Marceline's ire being raised by the theft of a memory. We may wish to be free of our past, but it is vital that we do not forget. That's a lesson many characters take to heart, and it applies to the planet they live on as well.\n\n\nNext, the musical. “What Was Missing”, one of the most beloved episodes the show has ever done, is a bit harder to get a handle on than “Memory of a Memory”. It's a point where a lot of the show's most important running threads all cross. Marceline's past is brought up again, as is Finn's infatuation with PB, the early hints of PB's often cold, distant nature, Finn and Jake's bond and how they both test it, basically everything the four central characters are going through is touched on in their quest to retrieve their stolen articles from the thieving Door Lord. Character development had always been present in small moments ever since the first season, but here, for the first time, it's the entire story. The Door Lord is a distant and nonthreatening antagonist, and all of the real conflict in the episode is internal, among our heroes. It is their own flaws, not a monster or a disaster, that they must contend with.\n\n\nI could analyze the details and nuances of the inter-personal dramas in this episode; Marceline's resentment of PB, PB's incensement at being so insulted, the complex (And possibly formerly romantic) relationship these spats indicate they posses, and Finn's quiet, continuing obsession with an older woman who is also one of his dearest friends. But all of these things are dealt with in future episodes in greater detail, and the really vital thing this episode gives us is more of a philosophy than a concrete revelation. These characters' issues matter, and will continue to matter as they continue to tackle them, but what matters more in “What Was Missing” is how they manage to put aside those issues for the sake of each other. Friendship, honesty, and song, these are capable of smoothing over any enmity or fault, uniting all present in a glorious, celebratory burst of joy and cooperation.\n\n\nIt is here, in Finn's final song, that *Adventure Time* opens its heart, revealing depths immeasurable, finally capitalizing on the noticeable lack of cynicism that had colored it from the start, and creating a moment of utterly untroubled happiness, owed to Finn's forthrightness about his feelings, both the ones he is conflicted about and the ones he's more sure of than anything in the world. He may not know what he is to PB, a joke, her knight, or her brother, but he knows that she, Marceline, and Jake (And Bmo!) are his best friends in the world, and the courage he summons to sing out that question and that answer aloud for all to hear is how the day is saved. The missed objects are regained, Marceline becomes a bit more comfortable with wanting to spend time with others, she and PB begin to mend their friendship, and Finn gains a bit of perspective on his teenage crush. Cap in one hand, flag in the other, *Adventure Time* plants its feet in the dirt and makes a stand for communication, persistence, openness, and fun.\n\n\nMoving on, we have the bedtime story. “What Was Missing”'s more subdued tone seemed strange coming on the heals of the show's raucous first two years, but “Thank You” stands out even more. It plays more like a classic picture book than an episode of the show which gave us the phrase “Imagination is for turbo-nerds who can't handle how kick-butt reality is!” Its story is simple, and it does not appear to be concealing any hidden depths: it's just the story of two species who have trouble coexisting learning to get along. A firedog pup follows a solitary snow-golem home, they live together for a bit, the snow-golem goes to great lengths to get the firepup home to his family, and then they're reunited at the end. That's really the whole thing; it's the way this story is presented which challenges yet again our understanding of what this show is and what it's trying to do. There are echoes of Miyazaki, Raymond Briggs, Shaun Tan, Pixar, and other influences nobody would have associated with a cartoon built on D&amp;D logic and fart jokes. Stripping away the veil of psychedelic imagery and hyper-kinetic style, we can see how much thought, effort, and love really go into making *Adventure Time* what it is.\n\n\nThe fourth of season three's great experiments is “Holly Jolly Secrets”. In discussing a work as ever-shifting and eternally searching as *Adventure Time*, it can be easy to overdose on superlatives regarding how drastically any given “Important” episode impacts the show as a whole. “This is the episode where everything changed! No, *this* is the episode where everything changed! No, this one, no, *this* one, no...” etc, etc. So, for the moment, let's set aside what “Holly Jolly Secrets” represents for the show and just look at it on its own merits. It's a very slow episode, filling up most of its doubled time with pointless nothings, conveying just how bored and annoyed Finn and Jake are with pouring over Ice King's secret stash of tapes. The joke seems to be that this is just the video diary of a miserable old wackjob, with none of the significance the treehouse duo are looking for. The final three minutes of the episode, in that context, are a typical *Adventure Time* non-punchline, where everything we thought the episode—and, breaking my rule for a moment, the show itself—was going to be is ripped out from under us.\n\n\nShelby describes what happens by saying “It was a miracle.” There certainly is a miraculous quality to the leap of faith the show makes into the world of pain and tragedy with that final montage. As I have outlined throughout this piece, *Adventure Time* did not get here in a day, and the progression of developments from the pure fun and games of the first episodes to the heartbreaking material tackled here can be seen clearly in retrospect. But however many hints of this potential there had been along the way, it's still astonishing to see it realized to this degree; poetic waxings aside, at the time, this is still a children's cartoon, and for all the groundwork laid by *Avatar: The Last Airbender* and *Batman: The Animated Series*, the horror and sorrow with which the senseless origins of the Ice King are depicted is still uncharted territory. There's pushing boundaries, and there's this.\n\n\nIn fact, the end of “Holly Jolly Secrets” is so powerful that it doesn't really require much further analysis. Looking up from our navels, taking a step back, and looking at *Adventure Time* as the story of a boy and his friends growing up together, teleological statements about existence and relation be hanged, this episode's place is obvious: Finn's arc is, broadly, the journey from innocent to experienced, and learning of the sad history of Simon Petrikov is an experience which deepens his capacity to relate to others, especially his enemies. He can be a better hero, because he understands better who and what he's fighting for. As did with its introduction of The Lich, the show itself gives its heroic, deceptively simple perspective on life-and-how-to-live-it more credibility by showcasing an awareness of how difficult that perspective can be to hold onto, when confronted with the darkness and bleakness of the world. A few episodes prior to this one, Bmo said to Jake “When bad things happen, I know you want to believe they are a joke. But sometimes, life is scary and dark. That is why we must find the light.” That is what this episode does: it finds the light, the light of the empathy Finn and Jake feel for Ooo's greatest outcast, and the celebration of that connection they return to every year afterwards, amid the darkness of the ongoing fallout from the Mushroom War.\n\n\nThe fifth tentpole of season three is not as obviously groundbreaking as the other four. It has weight to it, but nothing like emotional wallop of “Holly Jolly Secrets”. It is interesting stylistically, but not to the extent of the dynamically structured “Memory of a Memory” or the beautifully restrained “Thank You”. It sheds light on important character dynamics, but not in the endlessly intruging way that “What Was Missing” did. It destroys no preconceived notions of what cartoons can be, or even really push the boundaries of its own show. It could have come before all these fascinating innovations, placed somewhere around the end of season two, perhaps. It is the episode called “Dad's Dungeon”.\n\n\n“Dad's Dungeon” is a terrifically fun and creative episode, giving us some quirky monsters and some refreshing updates on the familiar dungeon-crawl template we've known since the first season. On the surface, that's all it is; there's some interesting stuff about Finn and Jake's feelings about their dead (And in Finn's case, adoptive) father Joshua, but it isn't really given the same thematic heft as Simon Petrikov's backstory or PB and Marceline's arguments. What makes this episode a necessary part of the show is how it depicts the dynamic between Finn and Jake.\n\n\nYou may have noticed this chapter being pretty light on things to say about Finn and Jake, ostensibly our main characters, our rocks in this stormy sea of madness (“I am a rock, I am an Island...”). It is true that during this explosion of possibilities opening up for the show, the treehouse duo are often left in the dust, Finn's yet-present childishness and Jake's comfort in his own skin preventing them from keeping up will all the change happening around them. At this point, there are simply more interesting things to focus on. “Dad's Dungeon”, the penultimate episode of this season, refocuses on our leads in preparation for the golden days of season four: just as The Lich counter-balanced the first two seasons' comparative innocence, the strength of Finn and Jake's bond counter-balances the dark, strange territory explored by the third. Jake's careful, utterly compassionate and loving handling of Finn's crisis brought on by the taunting video messages left by Joshua is beyond touching, and it shows a level of care never really shown before between these two, especially Jake, given his propensity for distraction and laziness. These two aren't just buds, they're *brothers*, willing to do anything and everything for each other, to go the extra mile or fifty to make sure the other one is alright, and with that kind of surety on our side, it seems as though we can conquer anything this crazy universe throws at us.\n\n\nClassically, *Adventure Time*'s season finales set the tone for the season to follow. “Mortal Folly/Mortal Recoil” hinted at the bold, brilliant, and sometimes harrowing days of this magnificent third season, and “Incendium” gives us a taste of the more character-focused fourth. Having reestablished the adventurous brothers as the center of the whole enterprise just one episode prior, “Incendium” finally deals with that hopeless crush Finn has for PB. PB's lack of interest finally drives Finn into a weeping stupor, and Jake, ever the caring (If ultimately misguided) big brother, sets about finding him somebody to loooooove. Most of the episode is setup for the upcoming “Hot to the Touch”, but there is one particularly noteworthy shot: the first time we see Flame Princess, as Jake enters the evil Fire Kingdom. She is beautiful, and captive, and the shot zooms out from her face to depict the whole absurd, distressing setting. She sits trapped in a gigantic kerosene lamp, hoisted above a court worthy of Wonderland, full of sneering, sycophantic fire-people, and above all the pompous, mercenary Flame King, voiced by the impeccable Keith David. Events involving this person and this place will change the shape of things to come, and this shot feels like the first nudge that rolling stone is given.\n\n\n“Incendium” cuts off mid-scene, after Flame Princess meets Finn, mistakes him for an enemy, and leaves Finn hopelessly love-struck yet again. One more new thing to try, a last-minute squeezing in of one final experiment before the season wraps up, a fitting end to a block of episodes positively bursting with ideas and departures from standard practice. Season three is not the most even or unified season of *Adventure Time*, but it is where the show rises to its calling as a genre-defying kaleidoscope, beginning to elevate its wonderful play-pretend games into something more, something overwhelmingly brave and positive. It brings to a close the early years of this big, big show, emerging with a deep back of tricks and a talent for reality to be reckoned with. Time now, to tie it all together.\n\nFurther reading: https://www.reddit.com/r/adventuretime/comments/5iy0ww/i_wrote_a_thing_about_holly_jolly_secrets/", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65xpbl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "magusmirificus", "saved": false, "mod_reports": [], "name": "t3_65xpbl", "subreddit_name_prefixed": "r/adventuretime", "approved_by": null, "over_18": false, "domain": "self.adventuretime", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s54g", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "simon", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/adventuretime/comments/65xpbl/very_distant_lands_part_3_it_was_a_miracle/", "num_reports": null, "locked": false, "stickied": false, "created": 1492485651.0, "url": "https://www.reddit.com/r/adventuretime/comments/65xpbl/very_distant_lands_part_3_it_was_a_miracle/", "author_flair_text": "", "quarantine": false, "title": "Very Distant Lands, part 3: \"It was a Miracle. Goodnight.\"", "created_utc": 1492456851.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s54g", "removal_reason": null, "link_id": "t3_65xpbl", "likes": null, "replies": "", "user_reports": [], "id": "dge3f8u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "time-traveling-ninja", "parent_id": "t3_65xpbl", "subreddit_name_prefixed": "r/adventuretime", "controversiality": 0, "body": "Always love reading your stuff, dude! Great analysis. Can't wait for the next one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Always love reading your stuff, dude! Great analysis. Can&amp;#39;t wait for the next one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "adventuretime", "name": "t1_dge3f8u", "score_hidden": false, "stickied": false, "created": 1492490815.0, "created_utc": 1492462015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]