[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "bestof", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[videos]", "id": "651sov", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 48, "report_reasons": null, "author": "fitbrah", "saved": false, "mod_reports": [], "name": "t3_651sov", "subreddit_name_prefixed": "r/bestof", "approved_by": null, "over_18": false, "domain": "np.reddit.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3v", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/bestof/comments/651sov/uheirtopendragon_explains_why_he_would_never_move/", "num_reports": null, "locked": false, "stickied": false, "created": 1492067841.0, "url": "https://np.reddit.com/r/videos/comments/64yqvu/guy_makes_his_own_iphone_from_individual_parts/dg6h83q/", "author_flair_text": null, "quarantine": false, "title": "/u/HeirToPendragon explains why he would never move back to China", "created_utc": 1492039041.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 48}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": "", "user_reports": [], "id": "dg7xyr8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PIP_SHORT", "parent_id": "t1_dg7cuvh", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "I just went to China a couple months ago, with a blonde woman. She thought she had it bad with being mobbed and photographed, then we met a black guy.\n\nI just thanked my lucky stars I'm short and dark haired.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just went to China a couple months ago, with a blonde woman. She thought she had it bad with being mobbed and photographed, then we met a black guy.&lt;/p&gt;\n\n&lt;p&gt;I just thanked my lucky stars I&amp;#39;m short and dark haired.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7xyr8", "score_hidden": false, "stickied": false, "created": 1492135203.0, "created_utc": 1492106403.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cuvh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "kinder_teach", "parent_id": "t1_dg6tp0l", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "I'm in china on holiday visiting the in laws. Small town in zhejiang (300k people). Climbed a mountain with my Bro in law and wife, got to the top and met some professional climbers pushing for photos with a drone. \n\nThe done operator signals to me that he wants a picture, I say sure and we pose. Because this is a highlight for him apparently (foreigner on my mountain?) but his buddy just walks up and snaps a shot of me without even making eye contact. Felt like being in a zoo. \n\nAnd this was just this holiday, I loved in this for 2 years feeling like a circus performance. It's not always a very welcoming culture.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in china on holiday visiting the in laws. Small town in zhejiang (300k people). Climbed a mountain with my Bro in law and wife, got to the top and met some professional climbers pushing for photos with a drone. &lt;/p&gt;\n\n&lt;p&gt;The done operator signals to me that he wants a picture, I say sure and we pose. Because this is a highlight for him apparently (foreigner on my mountain?) but his buddy just walks up and snaps a shot of me without even making eye contact. Felt like being in a zoo. &lt;/p&gt;\n\n&lt;p&gt;And this was just this holiday, I loved in this for 2 years feeling like a circus performance. It&amp;#39;s not always a very welcoming culture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7cuvh", "score_hidden": false, "stickied": false, "created": 1492105341.0, "created_utc": 1492076541.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6tp0l", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "nerbovig", "parent_id": "t3_651sov", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Four year China resident here.  He's pretty spot on with most of it.  My opinion waffles a bit more as we approach the last few months of our stay.  While there are of course many nice things about China, and in particular our city of Zhuhai, there are many things we won't miss.  \n\nI like to tell people that China isn't a \"me first\" society, it's a \"screw everyone that isn't me\" society.  Besides close friends or family, you treat everyone like NPCs for you gamers that understand the reference. In other words, they're not really people.  Oh look, there's someone with a baby in a stroller trying to get on an elevator = easy pickings to cut off, even though there's an escalator 30 meters away (Chinese people *love* elevators).  \n\nYou're also a novelty, and there is very real difference between China and foreigners (\"wai guo ren\" or literally \"people from outside the country\") in the perception of most people.  It's more common than not that if I'm out in public with my daughter, she'll be the target of photographs, and not always in the \"aww cute, can I take a picture?\" way. Just last week we were eating at a nice restaurant, seated outside, when some lady, about 25, walks up to within a meter of us and starts taking photos of my daughter eating. I don't say anything, assuming that eventually she'll see staring at her and feel some shame.  But no, she took a few photos of my child without permission and then walked away without even an acknowledgement of the parent like she was in a zoo.  \n\nI could go on and on, and if this takes off I'm sure you'll see many other people in China expressing similar sentiments.  \n\nThat being said, there are some very wonderful people here and I feel horrible for them in that they have to deal with the crap the government creates (we can escape, they can't), as well as having to be associated with so many short-sighted, selfish people.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Four year China resident here.  He&amp;#39;s pretty spot on with most of it.  My opinion waffles a bit more as we approach the last few months of our stay.  While there are of course many nice things about China, and in particular our city of Zhuhai, there are many things we won&amp;#39;t miss.  &lt;/p&gt;\n\n&lt;p&gt;I like to tell people that China isn&amp;#39;t a &amp;quot;me first&amp;quot; society, it&amp;#39;s a &amp;quot;screw everyone that isn&amp;#39;t me&amp;quot; society.  Besides close friends or family, you treat everyone like NPCs for you gamers that understand the reference. In other words, they&amp;#39;re not really people.  Oh look, there&amp;#39;s someone with a baby in a stroller trying to get on an elevator = easy pickings to cut off, even though there&amp;#39;s an escalator 30 meters away (Chinese people &lt;em&gt;love&lt;/em&gt; elevators).  &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re also a novelty, and there is very real difference between China and foreigners (&amp;quot;wai guo ren&amp;quot; or literally &amp;quot;people from outside the country&amp;quot;) in the perception of most people.  It&amp;#39;s more common than not that if I&amp;#39;m out in public with my daughter, she&amp;#39;ll be the target of photographs, and not always in the &amp;quot;aww cute, can I take a picture?&amp;quot; way. Just last week we were eating at a nice restaurant, seated outside, when some lady, about 25, walks up to within a meter of us and starts taking photos of my daughter eating. I don&amp;#39;t say anything, assuming that eventually she&amp;#39;ll see staring at her and feel some shame.  But no, she took a few photos of my child without permission and then walked away without even an acknowledgement of the parent like she was in a zoo.  &lt;/p&gt;\n\n&lt;p&gt;I could go on and on, and if this takes off I&amp;#39;m sure you&amp;#39;ll see many other people in China expressing similar sentiments.  &lt;/p&gt;\n\n&lt;p&gt;That being said, there are some very wonderful people here and I feel horrible for them in that they have to deal with the crap the government creates (we can escape, they can&amp;#39;t), as well as having to be associated with so many short-sighted, selfish people.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg6tp0l", "score_hidden": false, "stickied": false, "created": 1492071525.0, "created_utc": 1492042725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": "", "user_reports": [], "id": "dg6wjpo", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "nerbovig", "parent_id": "t1_dg6tjz7", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "And you're being insulated with American culture and employees.  If you were in China, well, you don't want to go to China.  Imagine going into work and finding out it's cancelled that week, or being called on a Saturday at 5 pm and them demanding you be there in 10 minutes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And you&amp;#39;re being insulated with American culture and employees.  If you were in China, well, you don&amp;#39;t want to go to China.  Imagine going into work and finding out it&amp;#39;s cancelled that week, or being called on a Saturday at 5 pm and them demanding you be there in 10 minutes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg6wjpo", "score_hidden": false, "stickied": false, "created": 1492074952.0, "created_utc": 1492046152.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6tjz7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "PastelFlamingo150", "parent_id": "t3_651sov", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Oh my God, this explains why I hate my job so much.  I'm working for a Chinese owned company in America and nothing ever gets changed or improved.  Every idea anyone has gets shot down with some vague dismissal, to the point that the company is stagnant and rotting.  All ideas have to come from the executives, but they're too busy doing their jobs to know anything about the details of the product or process, so we just randomly change course based on some suit's half baked idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my God, this explains why I hate my job so much.  I&amp;#39;m working for a Chinese owned company in America and nothing ever gets changed or improved.  Every idea anyone has gets shot down with some vague dismissal, to the point that the company is stagnant and rotting.  All ideas have to come from the executives, but they&amp;#39;re too busy doing their jobs to know anything about the details of the product or process, so we just randomly change course based on some suit&amp;#39;s half baked idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg6tjz7", "score_hidden": false, "stickied": false, "created": 1492071358.0, "created_utc": 1492042558.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": "", "user_reports": [], "id": "dg8k58l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "darksideclown", "parent_id": "t1_dg7ji74", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Yes this is certainly an issue, and leads to a lot of inefficiency. Typically the face issue you mentioned here requires a lot of side stepping and delicate language to handle without pissing people off, which is an annoyance certainly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes this is certainly an issue, and leads to a lot of inefficiency. Typically the face issue you mentioned here requires a lot of side stepping and delicate language to handle without pissing people off, which is an annoyance certainly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg8k58l", "score_hidden": false, "stickied": false, "created": 1492162187.0, "created_utc": 1492133387.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ji74", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Fronzel", "parent_id": "t1_dg7a16l", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "It is an alien concept to some people. Like me. I've caused issues because I corrected a statement said by a client in front of his underlings. Which is my job to educate the client about what I do,  but since I showed he didn't know everything,  I was asked to never come back. \n\nAnd things in a similar way. Never disrespectful, but you can't tell people above you anything because you might embarrass them or embarrass your coworkers in front of their boss. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is an alien concept to some people. Like me. I&amp;#39;ve caused issues because I corrected a statement said by a client in front of his underlings. Which is my job to educate the client about what I do,  but since I showed he didn&amp;#39;t know everything,  I was asked to never come back. &lt;/p&gt;\n\n&lt;p&gt;And things in a similar way. Never disrespectful, but you can&amp;#39;t tell people above you anything because you might embarrass them or embarrass your coworkers in front of their boss. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7ji74", "score_hidden": false, "stickied": false, "created": 1492119121.0, "created_utc": 1492090321.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7a16l", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "darksideclown", "parent_id": "t3_651sov", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "I don't think the poster understands what \"face\" is, and are trying to use it as a blanket term for incompetence in the service sector. It's true a ton of them probably hate their job and provide shitty service, I imagine most of us would too if you were making 200 USD a month for a high stress and long hour job. They probably aren't in any mood to have some foreigner come in and demand they deviate from standard protocol to accommodate him. There's shitty service everywhere around the world, and you often hear people blame it on the culture of the place, when more likely than not they're disgruntled for somewhat universal reasons. Just look at all the people bitching about minimum wage service sector jobs in America / and the other people bitching about service quality for an example; just a parallel set in another country.\n\nSimilarly, people have experiences with shitty Chinese individuals and attribute it to Confucianism / the government / the culture as the cause. When people describe their China experience, typically with a condescending as fuck \"not ALL of them are bad, too bad they're repressed by the culture/government\" or a \"I have a Chinese friend, and they totally agree with me\", I always feel like they're letting some shitty experiences push them into casual racism, and that just feeds into a cycle of negativity.\n\nShit happens and people can suck. I've had stuff stolen in America and witnessed a ton of discrimination against people of various races/backgrounds, someone spit gum at me and shouted (what I assume were obscenities) at me in Spain, a British jogger once pushed my 5 year old cousin nearly off a steep hill and didn't even stop to see if he was ok. Does it matter where they were from, and was their shitty behavior a result of their race/country? I don't really think so. Everyone has their own shitty experiences with people from everywhere in the world, it's when you start to shit on an entire people / culture for it you start to be part of the problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think the poster understands what &amp;quot;face&amp;quot; is, and are trying to use it as a blanket term for incompetence in the service sector. It&amp;#39;s true a ton of them probably hate their job and provide shitty service, I imagine most of us would too if you were making 200 USD a month for a high stress and long hour job. They probably aren&amp;#39;t in any mood to have some foreigner come in and demand they deviate from standard protocol to accommodate him. There&amp;#39;s shitty service everywhere around the world, and you often hear people blame it on the culture of the place, when more likely than not they&amp;#39;re disgruntled for somewhat universal reasons. Just look at all the people bitching about minimum wage service sector jobs in America / and the other people bitching about service quality for an example; just a parallel set in another country.&lt;/p&gt;\n\n&lt;p&gt;Similarly, people have experiences with shitty Chinese individuals and attribute it to Confucianism / the government / the culture as the cause. When people describe their China experience, typically with a condescending as fuck &amp;quot;not ALL of them are bad, too bad they&amp;#39;re repressed by the culture/government&amp;quot; or a &amp;quot;I have a Chinese friend, and they totally agree with me&amp;quot;, I always feel like they&amp;#39;re letting some shitty experiences push them into casual racism, and that just feeds into a cycle of negativity.&lt;/p&gt;\n\n&lt;p&gt;Shit happens and people can suck. I&amp;#39;ve had stuff stolen in America and witnessed a ton of discrimination against people of various races/backgrounds, someone spit gum at me and shouted (what I assume were obscenities) at me in Spain, a British jogger once pushed my 5 year old cousin nearly off a steep hill and didn&amp;#39;t even stop to see if he was ok. Does it matter where they were from, and was their shitty behavior a result of their race/country? I don&amp;#39;t really think so. Everyone has their own shitty experiences with people from everywhere in the world, it&amp;#39;s when you start to shit on an entire people / culture for it you start to be part of the problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7a16l", "score_hidden": false, "stickied": false, "created": 1492096924.0, "created_utc": 1492068124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_651sov", "likes": null, "replies": "", "user_reports": [], "id": "dg7dwug", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "princeofropes", "parent_id": "t3_651sov", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Lived for 2 years in china, apart from the pollution, its as good and as bad as any other place I've lived. If people have such a negative reaction to a place, it usually says as much about the person as it does about the place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lived for 2 years in china, apart from the pollution, its as good and as bad as any other place I&amp;#39;ve lived. If people have such a negative reaction to a place, it usually says as much about the person as it does about the place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7dwug", "score_hidden": false, "stickied": false, "created": 1492108489.0, "created_utc": 1492079689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}]