[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "bestof", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[movies]", "id": "655dux", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 184, "report_reasons": null, "author": "everyonelikesupvotes", "saved": false, "mod_reports": [], "name": "t3_655dux", "subreddit_name_prefixed": "r/bestof", "approved_by": null, "over_18": false, "domain": "np.reddit.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3v", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/bestof/comments/655dux/redditor_gives_a_brief_and_short_explanation/", "num_reports": null, "locked": false, "stickied": false, "created": 1492118079.0, "url": "https://np.reddit.com/r/movies/comments/64xzqq/detroit_official_trailer_director_kathryn_bigelow/dg75tqf", "author_flair_text": null, "quarantine": false, "title": "Redditor gives a brief and short explanation about how 1967 Detroit Riots might have changed Detroit into what it is today.", "created_utc": 1492089279.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 184}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg8n83k", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "r4ndpaulsbrilloballs", "parent_id": "t3_655dux", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "I hear this a lot.  And I know the Detroit riots mattered.  But, there are a number of reasons why I don't think the Detroit riots were the main causal factor for the decline of the city.  They are: \n\n1. [Race riots were happening everywhere in the 1960s](https://en.wikipedia.org/wiki/Urban_riots#1960s), the Watts Riot in LA being the best known.    \n\n2. [Detroit had already lost 10% of its population between the 1950 and the 1960 censuses](https://en.wikipedia.org/wiki/Demographic_history_of_Detroit). \n \n3. [White flight was real, but was in response to the Second Great Migration](https://en.wikipedia.org/wiki/Second_Great_Migration_(African_American\\)), not to riots.  That is, after WWII, millions of African-Americans who were treated like equals in the Army and in Asia and in Europe came home to the South where they couldn't vote or eat at the same counter or get any respect.  So millions of African Americans fled to northern and western cities between 1947 and 1965.  About 300,000 people went to Detroit, seeking freedom and a vote.\n\n4. But between 1950 and 1960, for every black person who moved into Detroit, 2 white people moved out.  In NYC, the ratio was closer to 1:1, so NYC never collapsed.  White flight continued at about 15% of the city population per decade from 1940 until 2000, when it leveled off.\n\n5. Despite that, since 1990, Detroit has been losing black population, and fast.  The city continues to shrink by a bit over 1% per year, which is about it's average population shrinking rate since decline began in 1950.  Asians have been fleeing the city since 2000.  Only the Hispanic population has grown at all, and it is basically flat for 15 years.\n\n6. Despite all that the metro area continues to grow at a good clip, and is now double the size of what it was in 1950, even though Detroit proper is about a third of the size it was at its peak.\n\n7. LA is about 5 times the size of Detroit geographically.  Detroit is in terrible financial shape.  Basically, it's a downtown to a region where the downtown collapsed.  But it still has to pay the bills from back when it was big.  So property taxes are ridiculous.  You pay a tiny fraction of Detroit rates if you move up the road to Rochester or wherever.  \n\n8. There is an obvious solution here, and one that comes with a come-back: Re-organize Detroit.  Let the old one die.  Rename it or don't, but make it a new entity.  Combine it with other towns in the greater Detroit area, so that tax revenue from the wealthy exurbs can help fund the dying downtown.  And try to re-build a prosperous central city again.\n\n9. But wealthy people will never go for that, so things are stuck the way they are.\n\n10. The hollowing out of manufacturing / auto employment didn't help either, obviously.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hear this a lot.  And I know the Detroit riots mattered.  But, there are a number of reasons why I don&amp;#39;t think the Detroit riots were the main causal factor for the decline of the city.  They are: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Urban_riots#1960s\"&gt;Race riots were happening everywhere in the 1960s&lt;/a&gt;, the Watts Riot in LA being the best known.    &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Demographic_history_of_Detroit\"&gt;Detroit had already lost 10% of its population between the 1950 and the 1960 censuses&lt;/a&gt;. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Second_Great_Migration_(African_American)\"&gt;White flight was real, but was in response to the Second Great Migration&lt;/a&gt;, not to riots.  That is, after WWII, millions of African-Americans who were treated like equals in the Army and in Asia and in Europe came home to the South where they couldn&amp;#39;t vote or eat at the same counter or get any respect.  So millions of African Americans fled to northern and western cities between 1947 and 1965.  About 300,000 people went to Detroit, seeking freedom and a vote.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;But between 1950 and 1960, for every black person who moved into Detroit, 2 white people moved out.  In NYC, the ratio was closer to 1:1, so NYC never collapsed.  White flight continued at about 15% of the city population per decade from 1940 until 2000, when it leveled off.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Despite that, since 1990, Detroit has been losing black population, and fast.  The city continues to shrink by a bit over 1% per year, which is about it&amp;#39;s average population shrinking rate since decline began in 1950.  Asians have been fleeing the city since 2000.  Only the Hispanic population has grown at all, and it is basically flat for 15 years.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Despite all that the metro area continues to grow at a good clip, and is now double the size of what it was in 1950, even though Detroit proper is about a third of the size it was at its peak.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;LA is about 5 times the size of Detroit geographically.  Detroit is in terrible financial shape.  Basically, it&amp;#39;s a downtown to a region where the downtown collapsed.  But it still has to pay the bills from back when it was big.  So property taxes are ridiculous.  You pay a tiny fraction of Detroit rates if you move up the road to Rochester or wherever.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There is an obvious solution here, and one that comes with a come-back: Re-organize Detroit.  Let the old one die.  Rename it or don&amp;#39;t, but make it a new entity.  Combine it with other towns in the greater Detroit area, so that tax revenue from the wealthy exurbs can help fund the dying downtown.  And try to re-build a prosperous central city again.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;But wealthy people will never go for that, so things are stuck the way they are.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The hollowing out of manufacturing / auto employment didn&amp;#39;t help either, obviously.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg8n83k", "score_hidden": false, "stickied": false, "created": 1492166521.0, "created_utc": 1492137721.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg7u4xz", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "ducatimechanic", "parent_id": "t3_655dux", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "As someone who actually lives in the Detroit area, and has a friend who is 80 (and she actually grew up riding street cars in Detroit), I'm going to say that this is actually a pretty even-handed review of race-relations in this area.\n\nAlso having served in the Army for a number of years, and having spoken to WW2 Veterans (black ones) who served in the segregated Army, then returned home to be reminded, basically, \"We don't care what you did, Nigger, you're back home and nothing has changed.\"\n\nBlacks in America have been promised progress, more than once, but it hasn't happened.\n\nThe \"white flight\" was accompanied by something called \"redlining\" to deny blacks the ability to get home loans (among other services), so they couldn't buy the houses that whites were leaving behind; instead they had to rely on landlords.\n\nSo as whites left Detroit, it wasn't just that the economy stalled, the actual prices of goods went up... and people didn't own their homes... they couldn't get mortgages.\n\nSo they rented... and those homes fell apart.\n\nThe cycle of poverty, that's what it's called.\n\nhttps://en.wikipedia.org/wiki/Cycle_of_poverty\n\n&gt;The cycle of poverty has been defined as a phenomenon where poor families become impoverished for at least three generations, i.e. for enough time that the family includes no surviving ancestors who possess and can transmit the intellectual, social, and cultural capital necessary to stay out of or change their impoverished condition\n\nAll you need it 3 generations, and you can destroy an entire people.", "edited": 1492116944.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who actually lives in the Detroit area, and has a friend who is 80 (and she actually grew up riding street cars in Detroit), I&amp;#39;m going to say that this is actually a pretty even-handed review of race-relations in this area.&lt;/p&gt;\n\n&lt;p&gt;Also having served in the Army for a number of years, and having spoken to WW2 Veterans (black ones) who served in the segregated Army, then returned home to be reminded, basically, &amp;quot;We don&amp;#39;t care what you did, Nigger, you&amp;#39;re back home and nothing has changed.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Blacks in America have been promised progress, more than once, but it hasn&amp;#39;t happened.&lt;/p&gt;\n\n&lt;p&gt;The &amp;quot;white flight&amp;quot; was accompanied by something called &amp;quot;redlining&amp;quot; to deny blacks the ability to get home loans (among other services), so they couldn&amp;#39;t buy the houses that whites were leaving behind; instead they had to rely on landlords.&lt;/p&gt;\n\n&lt;p&gt;So as whites left Detroit, it wasn&amp;#39;t just that the economy stalled, the actual prices of goods went up... and people didn&amp;#39;t own their homes... they couldn&amp;#39;t get mortgages.&lt;/p&gt;\n\n&lt;p&gt;So they rented... and those homes fell apart.&lt;/p&gt;\n\n&lt;p&gt;The cycle of poverty, that&amp;#39;s what it&amp;#39;s called.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Cycle_of_poverty\"&gt;https://en.wikipedia.org/wiki/Cycle_of_poverty&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The cycle of poverty has been defined as a phenomenon where poor families become impoverished for at least three generations, i.e. for enough time that the family includes no surviving ancestors who possess and can transmit the intellectual, social, and cultural capital necessary to stay out of or change their impoverished condition&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;All you need it 3 generations, and you can destroy an entire people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7u4xz", "score_hidden": false, "stickied": false, "created": 1492131143.0, "created_utc": 1492102343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg91tap", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MilesLetum", "parent_id": "t3_655dux", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "This is some seriously revisionist history. Let me give you a perspective of someone who's family has lived in the Detroit area since they immigrated to this country.\n\n**What were the preconditions?** First and foremost, its important to understand Detroit had two major periods of black migration into the city - pre and post WW2. This makes a world of difference, because the two different group had very different experiences with the city. The Pre-migration group was able to find a great amount of success in the city, opening businesses, rising to the middle class, and owning land. The Post-migration group suffered from the nation-wide trend of increasing racism that we saw in the Second Great Migration era. This group slowly moved up to Detroit looking for the middle-class lifestyle that the auto industry provided in the post-war period. It was a long, slow burn of mass movement that continued over a couple decades. As mentioned, this group did not find the success of the pre-migration group, suffering from racism, lack of opportunities, and generally unfair treatment. It's critically important to understand that this isn't simply a white-vs-black issue. This is middle class white vs middle class blacks vs lower class whites vs lower class blacks. There's a class element that cannot be separated from this time period.\n\n**What happened during the riots?** The riots started when the police raided an unlicensed speakeasy. They came out, got pelted with some rocks and bottles, fled as a mob formed, and then the mob went and started to grow and get out of control. But despite what you may have heard, this wasn't a race riot in the way you may have been told. When it started the riot more akin to people partying in the streets, and no one was even arrested the first night. The next morning when fires broke out, the police reported the rioters were mixed between black and white. Rioters didn't attack whites walking down the street, nor did they move to go destroy predominantly white areas. About 1/3 of all the people arrested for participating in the riots were white. It's also important to understand this wasn't two groups attacking each other, this one just one rowdy mob destroying things together. I don't think I need to get into the police/national guard response, as that's well documented.\n\n**So why did this happen?** A lot of reasons. First, it's impossible to take race out of the issue. There was a very large group of black Detroiters who were clearly being discriminated against, and wanted to have their voice heard. Additionally, there was a very real resentment within the black community between the middle and lower class blacks. The middle class contingent had done quite well, and was living relatively comfortably. As such, they didn't really want to stick their necks out to speak up about the plight of the blacks who were stuck in a cycle of poverty. This obviously divided the community, as the lower class blacks ended up feeling betrayed that the middle class was relatively uninterested in helping them get on their feet. It's not a coincidence that the majority of damage done during the riots was in predominantly black areas. \n\nHowever, there's also a major class element that, to some extent, bridged the racial gap between lower class blacks and whites. The city was hemorrhaging jobs to the suburbs in the post-war period. The auto industry continued to move both plants and offices out to the suburbs, resulting in a loss of 200k in population for the city from 1950 to 1960, and about another 150k from 1960 to 1970. The loss of taxpayers also had a downstream effect on the city's education. No taxpayers means no government funding. Education was hit particularly hard by this.\n\n**What effect did the riots have?** The riots were really the last straw for the middle class. The upper class had fled the city long ago, taking up residence in Oakland County, to the north. The middle class continued to flee the city for better jobs in the suburbs and for better security. Middle class blacks left as well, settling largely in areas like Inkster, Garden City, and Redford, just outside the city. You can piece together the rest. A major city loses its one major industry to the suburbs. It has already lost its major wage-earners to the ritzy suburbs in the north. It now loses its tax base to suburbs in the west. A city with no tax revenue and no job growth cannot sustain itself. Without the middle and upper classes living in the city, the city collapsed in on itself as government programs/services shut down or received a major loss in quality. This became a positive feedback loop of shit, as the lower quality in  services led to less companies coming to Detroit, which leads to a further drop in services, etc etc.\n\n\nDetroit is additionally hit hard by stagflation and the oil crisis in the 70s. Expensive gas means less people buying cars. Less people buying cars means Detroit isn't going to do so well. The city bottomed-out in the 80s, really hitting its low in crime, drugs, and lack of opportunities. Recovery slowly began, but trade deals in the 90s like NAFTA made things... complicated. The deals were great for the bottomline, and white-collar jobs started move back into the city accordingly. However, blue-collar jobs didn't grow at the rate they would have otherwise, thus not really doing much to remedy Detroit's problems. The white-collar workers go to work then commute home. Detroit needed blue-collar workers to live in the city, pay taxes there, etc. The 08 recession was a mess, as it dragged down GM/Chrysler in 09, leading to Detroit bankruptcy in '10. There are a lot of reasons for the bankruptcy, but many of them are external issues unrelated to the riots. I'll leave that for another post.\n\nThe city seems to be on its way back up now, but we'll see what happens. Once again the city is suffering from a white-collar / blue-collar divide. Downtown is pretty nice. The Pistons and Wings are moving back downtown to the new Little Caesars Arena. The Ilitch and Gilbert dynasties are dumping money into the downtown areas left and right. But the city itself is still horrid. As I said, white-collar works come downtown to work, spend some money, then leave. That ultimately doesn't help the city get back on its feet. We need people to actually move to the city and work here. A lot of young people are starting to move down into the Midtown / Cass Corridor areas, but I don't see this as a long-term solution. Young people move in for the downtown nightlive and jobs, get married, and then will inevitably move to the suburbs. Detroit Public Schools may be the worst public school system in the nation, and as soon as these young people want to have kids, they'll move away in order to send their children to a school system that can function on even a basic level. Detroit has a lot of issues. The riot contributed to them, but didn't cause them.  ", "edited": 1492199467.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is some seriously revisionist history. Let me give you a perspective of someone who&amp;#39;s family has lived in the Detroit area since they immigrated to this country.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What were the preconditions?&lt;/strong&gt; First and foremost, its important to understand Detroit had two major periods of black migration into the city - pre and post WW2. This makes a world of difference, because the two different group had very different experiences with the city. The Pre-migration group was able to find a great amount of success in the city, opening businesses, rising to the middle class, and owning land. The Post-migration group suffered from the nation-wide trend of increasing racism that we saw in the Second Great Migration era. This group slowly moved up to Detroit looking for the middle-class lifestyle that the auto industry provided in the post-war period. It was a long, slow burn of mass movement that continued over a couple decades. As mentioned, this group did not find the success of the pre-migration group, suffering from racism, lack of opportunities, and generally unfair treatment. It&amp;#39;s critically important to understand that this isn&amp;#39;t simply a white-vs-black issue. This is middle class white vs middle class blacks vs lower class whites vs lower class blacks. There&amp;#39;s a class element that cannot be separated from this time period.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What happened during the riots?&lt;/strong&gt; The riots started when the police raided an unlicensed speakeasy. They came out, got pelted with some rocks and bottles, fled as a mob formed, and then the mob went and started to grow and get out of control. But despite what you may have heard, this wasn&amp;#39;t a race riot in the way you may have been told. When it started the riot more akin to people partying in the streets, and no one was even arrested the first night. The next morning when fires broke out, the police reported the rioters were mixed between black and white. Rioters didn&amp;#39;t attack whites walking down the street, nor did they move to go destroy predominantly white areas. About 1/3 of all the people arrested for participating in the riots were white. It&amp;#39;s also important to understand this wasn&amp;#39;t two groups attacking each other, this one just one rowdy mob destroying things together. I don&amp;#39;t think I need to get into the police/national guard response, as that&amp;#39;s well documented.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So why did this happen?&lt;/strong&gt; A lot of reasons. First, it&amp;#39;s impossible to take race out of the issue. There was a very large group of black Detroiters who were clearly being discriminated against, and wanted to have their voice heard. Additionally, there was a very real resentment within the black community between the middle and lower class blacks. The middle class contingent had done quite well, and was living relatively comfortably. As such, they didn&amp;#39;t really want to stick their necks out to speak up about the plight of the blacks who were stuck in a cycle of poverty. This obviously divided the community, as the lower class blacks ended up feeling betrayed that the middle class was relatively uninterested in helping them get on their feet. It&amp;#39;s not a coincidence that the majority of damage done during the riots was in predominantly black areas. &lt;/p&gt;\n\n&lt;p&gt;However, there&amp;#39;s also a major class element that, to some extent, bridged the racial gap between lower class blacks and whites. The city was hemorrhaging jobs to the suburbs in the post-war period. The auto industry continued to move both plants and offices out to the suburbs, resulting in a loss of 200k in population for the city from 1950 to 1960, and about another 150k from 1960 to 1970. The loss of taxpayers also had a downstream effect on the city&amp;#39;s education. No taxpayers means no government funding. Education was hit particularly hard by this.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What effect did the riots have?&lt;/strong&gt; The riots were really the last straw for the middle class. The upper class had fled the city long ago, taking up residence in Oakland County, to the north. The middle class continued to flee the city for better jobs in the suburbs and for better security. Middle class blacks left as well, settling largely in areas like Inkster, Garden City, and Redford, just outside the city. You can piece together the rest. A major city loses its one major industry to the suburbs. It has already lost its major wage-earners to the ritzy suburbs in the north. It now loses its tax base to suburbs in the west. A city with no tax revenue and no job growth cannot sustain itself. Without the middle and upper classes living in the city, the city collapsed in on itself as government programs/services shut down or received a major loss in quality. This became a positive feedback loop of shit, as the lower quality in  services led to less companies coming to Detroit, which leads to a further drop in services, etc etc.&lt;/p&gt;\n\n&lt;p&gt;Detroit is additionally hit hard by stagflation and the oil crisis in the 70s. Expensive gas means less people buying cars. Less people buying cars means Detroit isn&amp;#39;t going to do so well. The city bottomed-out in the 80s, really hitting its low in crime, drugs, and lack of opportunities. Recovery slowly began, but trade deals in the 90s like NAFTA made things... complicated. The deals were great for the bottomline, and white-collar jobs started move back into the city accordingly. However, blue-collar jobs didn&amp;#39;t grow at the rate they would have otherwise, thus not really doing much to remedy Detroit&amp;#39;s problems. The white-collar workers go to work then commute home. Detroit needed blue-collar workers to live in the city, pay taxes there, etc. The 08 recession was a mess, as it dragged down GM/Chrysler in 09, leading to Detroit bankruptcy in &amp;#39;10. There are a lot of reasons for the bankruptcy, but many of them are external issues unrelated to the riots. I&amp;#39;ll leave that for another post.&lt;/p&gt;\n\n&lt;p&gt;The city seems to be on its way back up now, but we&amp;#39;ll see what happens. Once again the city is suffering from a white-collar / blue-collar divide. Downtown is pretty nice. The Pistons and Wings are moving back downtown to the new Little Caesars Arena. The Ilitch and Gilbert dynasties are dumping money into the downtown areas left and right. But the city itself is still horrid. As I said, white-collar works come downtown to work, spend some money, then leave. That ultimately doesn&amp;#39;t help the city get back on its feet. We need people to actually move to the city and work here. A lot of young people are starting to move down into the Midtown / Cass Corridor areas, but I don&amp;#39;t see this as a long-term solution. Young people move in for the downtown nightlive and jobs, get married, and then will inevitably move to the suburbs. Detroit Public Schools may be the worst public school system in the nation, and as soon as these young people want to have kids, they&amp;#39;ll move away in order to send their children to a school system that can function on even a basic level. Detroit has a lot of issues. The riot contributed to them, but didn&amp;#39;t cause them.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg91tap", "score_hidden": false, "stickied": false, "created": 1492200358.0, "created_utc": 1492171558.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg8yvwx", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Sybs", "parent_id": "t3_655dux", "subreddit_name_prefixed": "r/bestof", "controversiality": 1, "body": "A great example of how racism is a massive anchor that holds your nation from progressing, even now, so many years later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A great example of how racism is a massive anchor that holds your nation from progressing, even now, so many years later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg8yvwx", "score_hidden": false, "stickied": false, "created": 1492192034.0, "created_utc": 1492163234.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg7ykr9", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "No_Fudge", "parent_id": "t1_dg7yidb", "subreddit_name_prefixed": "r/bestof", "controversiality": 1, "body": "Well at least in that synopsis you included the decline of the auto industry.\n\nThis is important stuff if you actually want to talk about how to help Detroit here and now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well at least in that synopsis you included the decline of the auto industry.&lt;/p&gt;\n\n&lt;p&gt;This is important stuff if you actually want to talk about how to help Detroit here and now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7ykr9", "score_hidden": false, "stickied": false, "created": 1492135856.0, "created_utc": 1492107056.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yidb", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "tetra0", "parent_id": "t1_dg7xoic", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Detriot's collapse is closely linked to both the decline of the auto industry and it's shameful treatment of minority populations, both of which contributed to white flight in direct and indirect ways.\n\n\"left-wing spending boondoggles\" sounds more like an AM talk radio narrative than any kind of serious or honest analysis.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Detriot&amp;#39;s collapse is closely linked to both the decline of the auto industry and it&amp;#39;s shameful treatment of minority populations, both of which contributed to white flight in direct and indirect ways.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;left-wing spending boondoggles&amp;quot; sounds more like an AM talk radio narrative than any kind of serious or honest analysis.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7yidb", "score_hidden": false, "stickied": false, "created": 1492135785.0, "created_utc": 1492106985.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xoic", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "No_Fudge", "parent_id": "t1_dg7xiue", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "I think talking about the collapse of Detroit *without* mentioning it's decent into a regressive economy is dishonest.\n\nPeople flee regressive economies all the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think talking about the collapse of Detroit &lt;em&gt;without&lt;/em&gt; mentioning it&amp;#39;s decent into a regressive economy is dishonest.&lt;/p&gt;\n\n&lt;p&gt;People flee regressive economies all the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7xoic", "score_hidden": false, "stickied": false, "created": 1492134905.0, "created_utc": 1492106105.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xiue", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "clickerbait", "parent_id": "t1_dg7v16p", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Blaming white flight on a city becoming \"too left wing\" is some pretty blatant revisionism. Did you take history classes from Hannity?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Blaming white flight on a city becoming &amp;quot;too left wing&amp;quot; is some pretty blatant revisionism. Did you take history classes from Hannity?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7xiue", "score_hidden": false, "stickied": false, "created": 1492134739.0, "created_utc": 1492105939.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg9311q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sketchy_at_best", "parent_id": "t1_dg7v16p", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Yeah, one thing always remains true...money makes the world go 'round. Huge companies and manufacturers can't just pick up and move without spending an assload of money, and when that assload of money is coming out of your pocket, your first instinct is going to be to rationalize staying put any way you can. \n\nWithout having any knowledge of the history of racism in Detroit, I don't doubt that it was one factor of many, but these types of decisions usually come down to money at the end of the day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, one thing always remains true...money makes the world go &amp;#39;round. Huge companies and manufacturers can&amp;#39;t just pick up and move without spending an assload of money, and when that assload of money is coming out of your pocket, your first instinct is going to be to rationalize staying put any way you can. &lt;/p&gt;\n\n&lt;p&gt;Without having any knowledge of the history of racism in Detroit, I don&amp;#39;t doubt that it was one factor of many, but these types of decisions usually come down to money at the end of the day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg9311q", "score_hidden": false, "stickied": false, "created": 1492202817.0, "created_utc": 1492174017.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7v16p", "gilded": 0, "archived": false, "score": -17, "report_reasons": null, "author": "No_Fudge", "parent_id": "t3_655dux", "subreddit_name_prefixed": "r/bestof", "controversiality": 1, "body": "Sorry but there's some things that have to be mentioned.\n\nThat massive riot he's talking about started when a black mob *assumed* white cops used excessive force when they didn't.\n\nAnd businesses left because of changing economic situations in the city. Detroit was becoming massively left wing. \n\nMassive spending. Massive unpaid for mandatory. Huge unbreakable unions. \n\nWhite people started leaving because they raised taxes on the rich. So white people packed up to live somewhere cheaper. \n\nAnd then they raised taxes again on the now lower population.\n\nThis is why Detroit is shit. Because Lyndon B Johnsons \"Model city\" program. And more left-wing spending boondoggles. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry but there&amp;#39;s some things that have to be mentioned.&lt;/p&gt;\n\n&lt;p&gt;That massive riot he&amp;#39;s talking about started when a black mob &lt;em&gt;assumed&lt;/em&gt; white cops used excessive force when they didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;And businesses left because of changing economic situations in the city. Detroit was becoming massively left wing. &lt;/p&gt;\n\n&lt;p&gt;Massive spending. Massive unpaid for mandatory. Huge unbreakable unions. &lt;/p&gt;\n\n&lt;p&gt;White people started leaving because they raised taxes on the rich. So white people packed up to live somewhere cheaper. &lt;/p&gt;\n\n&lt;p&gt;And then they raised taxes again on the now lower population.&lt;/p&gt;\n\n&lt;p&gt;This is why Detroit is shit. Because Lyndon B Johnsons &amp;quot;Model city&amp;quot; program. And more left-wing spending boondoggles. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7v16p", "score_hidden": false, "stickied": false, "created": 1492132086.0, "created_utc": 1492103286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg7q721", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "cantlurkanymore", "parent_id": "t1_dg7m96x", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "actually, i believe it is your conclusion which is asinine, not to mention willfully ignorant of the context of the riots.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;actually, i believe it is your conclusion which is asinine, not to mention willfully ignorant of the context of the riots.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7q721", "score_hidden": false, "stickied": false, "created": 1492126941.0, "created_utc": 1492098141.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg7sw4y", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "joozian_", "parent_id": "t1_dg7m96x", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Attributing something as a cause and assigning it blame have two very different implications.  OP was addressing the former, not the latter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Attributing something as a cause and assigning it blame have two very different implications.  OP was addressing the former, not the latter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7sw4y", "score_hidden": false, "stickied": false, "created": 1492129806.0, "created_utc": 1492101006.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg7ssph", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Kaarous", "parent_id": "t1_dg7sd1h", "subreddit_name_prefixed": "r/bestof", "controversiality": 1, "body": "&gt; Op blamed the riots that took place \n\nSo you just didn't read the post you submitted then.  Because he outright said this.\n\n&gt;As you can imagine, this was the last straw for the white people who already were scared of the \"nasty ol thugs\". \n\nHe's mocking the people who left Detroit after that rampage.  He goes on further to say that it's the fault of all the white people who left for what the city council did.  \n\nSo you either knowingly submitted a shitbag, or you didn't even read what he said.  To be quite frank, fuck that guy and his bullshit attitude.  I left the Baltimore area for a very similar reason, because I don't want my family to be around crime, drugs, gangs and unreasoning, animalistic violence.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Op blamed the riots that took place &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So you just didn&amp;#39;t read the post you submitted then.  Because he outright said this.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As you can imagine, this was the last straw for the white people who already were scared of the &amp;quot;nasty ol thugs&amp;quot;. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He&amp;#39;s mocking the people who left Detroit after that rampage.  He goes on further to say that it&amp;#39;s the fault of all the white people who left for what the city council did.  &lt;/p&gt;\n\n&lt;p&gt;So you either knowingly submitted a shitbag, or you didn&amp;#39;t even read what he said.  To be quite frank, fuck that guy and his bullshit attitude.  I left the Baltimore area for a very similar reason, because I don&amp;#39;t want my family to be around crime, drugs, gangs and unreasoning, animalistic violence.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7ssph", "score_hidden": false, "stickied": false, "created": 1492129704.0, "created_utc": 1492100904.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7sd1h", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "everyonelikesupvotes", "parent_id": "t1_dg7rys2", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Op blamed the riots that took place for the current condition of the place and the riots that caused people to leave and thus lead to a situation were people who could have worked for the betterment for the society and improved Detroit. Op never said because that they left the place they lead to downfall of Detriot, the riots lead to them leaving and caused the downfall. \n\nEven I fell I would have left a place where I feel my life has no postive effect. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Op blamed the riots that took place for the current condition of the place and the riots that caused people to leave and thus lead to a situation were people who could have worked for the betterment for the society and improved Detroit. Op never said because that they left the place they lead to downfall of Detriot, the riots lead to them leaving and caused the downfall. &lt;/p&gt;\n\n&lt;p&gt;Even I fell I would have left a place where I feel my life has no postive effect. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7sd1h", "score_hidden": false, "stickied": false, "created": 1492129246.0, "created_utc": 1492100446.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7rys2", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Kaarous", "parent_id": "t1_dg7o826", "subreddit_name_prefixed": "r/bestof", "controversiality": 1, "body": "&gt; Op ever blamed them for the attack.\n\nHe repeatedly blamed them for the current state of Detroit.  Apparently it is unreasonable for people to leave a place they don't feel safe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Op ever blamed them for the attack.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He repeatedly blamed them for the current state of Detroit.  Apparently it is unreasonable for people to leave a place they don&amp;#39;t feel safe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7rys2", "score_hidden": false, "stickied": false, "created": 1492128827.0, "created_utc": 1492100027.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7o826", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "everyonelikesupvotes", "parent_id": "t1_dg7m96x", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Op ever blamed them for the attack. I am not saying what Op states is perfectly correct and undeniable but what where has the Op blamed the people who left for the attack. ", "edited": 1492098151.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Op ever blamed them for the attack. I am not saying what Op states is perfectly correct and undeniable but what where has the Op blamed the people who left for the attack. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7o826", "score_hidden": false, "stickied": false, "created": 1492124815.0, "created_utc": 1492096015.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_655dux", "likes": null, "replies": "", "user_reports": [], "id": "dg7wg8r", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Drake02", "parent_id": "t1_dg7m96x", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "Yeah, when my city starts making bone headed decision that help lead to a collapse. I'll just hang tight and lose everything and go down like a captain with his ship, because the city is more important than my financial stability and families safety. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, when my city starts making bone headed decision that help lead to a collapse. I&amp;#39;ll just hang tight and lose everything and go down like a captain with his ship, because the city is more important than my financial stability and families safety. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7wg8r", "score_hidden": false, "stickied": false, "created": 1492133598.0, "created_utc": 1492104798.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7m96x", "gilded": 0, "archived": false, "score": -23, "report_reasons": null, "author": "Kaarous", "parent_id": "t3_655dux", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "It's awesome how he blames the people that left after the murderous rampage.  Because it's really their fault for not staying in a city like that after all, how dare they.\n\nWhat an asinine conclusion.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s awesome how he blames the people that left after the murderous rampage.  Because it&amp;#39;s really their fault for not staying in a city like that after all, how dare they.&lt;/p&gt;\n\n&lt;p&gt;What an asinine conclusion.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg7m96x", "score_hidden": false, "stickied": false, "created": 1492122575.0, "created_utc": 1492093775.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -23}}], "after": null, "before": null}}]