[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "bestof", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[LifeProTips]", "id": "659w6q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 41, "report_reasons": null, "author": "w0mpum", "saved": false, "mod_reports": [], "name": "t3_659w6q", "subreddit_name_prefixed": "r/bestof", "approved_by": null, "over_18": false, "domain": "np.reddit.com", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh3v", "edited": false, "link_flair_css_class": "", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/bestof/comments/659w6q/an_inspirational_plea_to_not_talk_down_to_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492164194.0, "url": "https://np.reddit.com/r/LifeProTips/comments/656c0g/lpt_try_and_spend_time_with_the_elderly_if/dg87xag/", "author_flair_text": null, "quarantine": false, "title": "An inspirational plea to not talk down to the elderly reaffirms that the real protip is always in the comments", "created_utc": 1492135394.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 41}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3v", "removal_reason": null, "link_id": "t3_659w6q", "likes": null, "replies": "", "user_reports": [], "id": "dg8roei", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "seink", "parent_id": "t3_659w6q", "subreddit_name_prefixed": "r/bestof", "controversiality": 0, "body": "This is why I hate the LPT sub. One third of LPT is ok, one-third is just common sense and one third is just plain garbage like this one. \n\nFrom the guy who wrote the comment to the people who read that sub &amp; upvotes this crap to the guy who bestof this comment, nobody has any idea what they are talking about. That comment is clearly from someone who lives away from his elderly and talks to them occasionally like during easter/christmas or something like that. \n\nFirst of all, not every elder is in good mental condition. If they are perfectly capable of holding conversations like the rest of us, their family would talk to them. It is when the elderly hits that 80-90 year mark that makes talking to them challenging and becomes a chore. \n\nSecondly, there is a reason why you have to talk to them in simplistic ways . A lot of them have hearing problems and when you ask them a long question, they either can't hear you or they don't understand the question very much because of their reduced hearing and mental capacity. (That's why there is this movie trope where old people goes 'WHAT? Men? WHAT? Pen? WHAT?hen?')\n\nBesides from their diminished hearing, many have mental conditions. Do you know why I keep telling my grandma today's weather is nice/hot/rainy? It's because she asked me 5 times already before lunch. A lot of elderly have short term memory problems. They can't remember the day, date or year and will repeat those questions a lot of times. Talking to them requires patience. \n\nFurthermore, you don't talk to the elderly because you want to talk to them. You 'talk' to them to make them use their brain so they don't deteriorate as fast. That's why you often see people asking them about the weather, the date or what they just ate. It makes them use their brain and actually helps them. \n\nThe part about elderly is a time machine is both good and bad. They remember the old times but they can also be racist, sexist and homophobic because they didn't spend their best years in a progressive society. Not all elderly will have fond memories and some have pretty fucked up attitude and stories.  \n\nLastly, a lot people stopped talking to the elderly because they have seen them progressively get worse. Your parents will probably remember a time when your grandparents are good-looking, energetic, funny.... people. As time goes on they witness their old folks become a former husk of themselves. They may have to go to the bathroom 20 times, have constant back pain, couldn't chew and split out their food, you may have to bath them and change their diapers. It is not easy for anyone to adjust. \n\nThere is no LPT for the elderly. Their body and mind is constantly breaking down and you can only help slow down their condition. Your just need to be grateful that they once taken care of you and created a place where you don't have to go through all the war, famine, depression they have been through. ", "edited": 1492144997.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why I hate the LPT sub. One third of LPT is ok, one-third is just common sense and one third is just plain garbage like this one. &lt;/p&gt;\n\n&lt;p&gt;From the guy who wrote the comment to the people who read that sub &amp;amp; upvotes this crap to the guy who bestof this comment, nobody has any idea what they are talking about. That comment is clearly from someone who lives away from his elderly and talks to them occasionally like during easter/christmas or something like that. &lt;/p&gt;\n\n&lt;p&gt;First of all, not every elder is in good mental condition. If they are perfectly capable of holding conversations like the rest of us, their family would talk to them. It is when the elderly hits that 80-90 year mark that makes talking to them challenging and becomes a chore. &lt;/p&gt;\n\n&lt;p&gt;Secondly, there is a reason why you have to talk to them in simplistic ways . A lot of them have hearing problems and when you ask them a long question, they either can&amp;#39;t hear you or they don&amp;#39;t understand the question very much because of their reduced hearing and mental capacity. (That&amp;#39;s why there is this movie trope where old people goes &amp;#39;WHAT? Men? WHAT? Pen? WHAT?hen?&amp;#39;)&lt;/p&gt;\n\n&lt;p&gt;Besides from their diminished hearing, many have mental conditions. Do you know why I keep telling my grandma today&amp;#39;s weather is nice/hot/rainy? It&amp;#39;s because she asked me 5 times already before lunch. A lot of elderly have short term memory problems. They can&amp;#39;t remember the day, date or year and will repeat those questions a lot of times. Talking to them requires patience. &lt;/p&gt;\n\n&lt;p&gt;Furthermore, you don&amp;#39;t talk to the elderly because you want to talk to them. You &amp;#39;talk&amp;#39; to them to make them use their brain so they don&amp;#39;t deteriorate as fast. That&amp;#39;s why you often see people asking them about the weather, the date or what they just ate. It makes them use their brain and actually helps them. &lt;/p&gt;\n\n&lt;p&gt;The part about elderly is a time machine is both good and bad. They remember the old times but they can also be racist, sexist and homophobic because they didn&amp;#39;t spend their best years in a progressive society. Not all elderly will have fond memories and some have pretty fucked up attitude and stories.  &lt;/p&gt;\n\n&lt;p&gt;Lastly, a lot people stopped talking to the elderly because they have seen them progressively get worse. Your parents will probably remember a time when your grandparents are good-looking, energetic, funny.... people. As time goes on they witness their old folks become a former husk of themselves. They may have to go to the bathroom 20 times, have constant back pain, couldn&amp;#39;t chew and split out their food, you may have to bath them and change their diapers. It is not easy for anyone to adjust. &lt;/p&gt;\n\n&lt;p&gt;There is no LPT for the elderly. Their body and mind is constantly breaking down and you can only help slow down their condition. Your just need to be grateful that they once taken care of you and created a place where you don&amp;#39;t have to go through all the war, famine, depression they have been through. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bestof", "name": "t1_dg8roei", "score_hidden": false, "stickied": false, "created": 1492173573.0, "created_utc": 1492144773.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]