[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My doc diagnosed me with polycystic ovaries several months ago.&lt;/p&gt;\n\n&lt;p&gt;Everyone I tell acts like it&amp;#39;s a death sentence for my future children, because the condition commonly leaves you infertile. &lt;/p&gt;\n\n&lt;p&gt;This is despite me being transgender and saying I never want to give birth, ever. I&amp;#39;m sick of the pity over an organ I never even wanted in the first place. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of having two week long periods in which I bleed so much I can&amp;#39;t even leave the house for longer than an hour, because I&amp;#39;ll bleed through a tampon meant to last 6 hours. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of the pain which is so debilitating I can&amp;#39;t even take care of myself, in which I have to take double the recommended painkiller dose to put the pain at manageable levels. I&amp;#39;m so scared of being addicted. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of the dizziness, the nausea, the tiredness, the &amp;quot;women&amp;#39;s health&amp;quot; pills.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of smelling blood. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of every self-help and medical site referring to the reader as a woman, because &amp;quot;only&amp;quot; women get periods.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of being too considered too fat to be allowed contraception, when this is killing me far quicker than the risks associated with it. I&amp;#39;m sick of being told every woman needs a gynecologist. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of gender dysphoria, I&amp;#39;m sick of the medical profession making it ten times worse. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of the hoops I&amp;#39;ll have to jump through if I tell them I&amp;#39;m transgender. It would take years for me to be allowed to transition, years before I even saw a gender therapist, years before they prescribed me testosterone or stopped my periods.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of myself being too scared to start the process, to have to sit in that doctors office and to hear him tell me why I&amp;#39;m wrong about myself, to ask me if this is just because of my condition. &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s even the point? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of knowing that it doesn&amp;#39;t matter how I feel, because it&amp;#39;s always going to be this way, I&amp;#39;m part of such a small minority it makes no sense to consider us when talking about these things.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My doc diagnosed me with polycystic ovaries several months ago.\n\nEveryone I tell acts like it's a death sentence for my future children, because the condition commonly leaves you infertile. \n\nThis is despite me being transgender and saying I never want to give birth, ever. I'm sick of the pity over an organ I never even wanted in the first place. \n\nI'm sick of having two week long periods in which I bleed so much I can't even leave the house for longer than an hour, because I'll bleed through a tampon meant to last 6 hours. \n\nI'm sick of the pain which is so debilitating I can't even take care of myself, in which I have to take double the recommended painkiller dose to put the pain at manageable levels. I'm so scared of being addicted. \n\nI'm sick of the dizziness, the nausea, the tiredness, the \"women's health\" pills.\n\nI'm sick of smelling blood. \n\nI'm sick of every self-help and medical site referring to the reader as a woman, because \"only\" women get periods.\n\nI'm sick of being too considered too fat to be allowed contraception, when this is killing me far quicker than the risks associated with it. I'm sick of being told every woman needs a gynecologist. \n\nI'm sick of gender dysphoria, I'm sick of the medical profession making it ten times worse. \n\nI'm sick of the hoops I'll have to jump through if I tell them I'm transgender. It would take years for me to be allowed to transition, years before I even saw a gender therapist, years before they prescribed me testosterone or stopped my periods.\n\nI'm sick of myself being too scared to start the process, to have to sit in that doctors office and to hear him tell me why I'm wrong about myself, to ask me if this is just because of my condition. \n\nWhat's even the point? \n\nI'm sick of knowing that it doesn't matter how I feel, because it's always going to be this way, I'm part of such a small minority it makes no sense to consider us when talking about these things.\n\n ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qnq5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "Neonnie", "saved": false, "mod_reports": [], "name": "t3_64qnq5", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/64qnq5/my_doctor_diagnosed_me_with_polycystic_ovaries/", "num_reports": null, "locked": false, "stickied": false, "created": 1491944410.0, "url": "https://www.reddit.com/r/offmychest/comments/64qnq5/my_doctor_diagnosed_me_with_polycystic_ovaries/", "author_flair_text": null, "quarantine": false, "title": "My doctor diagnosed me with polycystic ovaries several months ago.", "created_utc": 1491915610.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64qnq5", "likes": null, "replies": "", "user_reports": [], "id": "dg4cj1j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fadedpurple", "parent_id": "t3_64qnq5", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm sorry you feel so terrible. Having PCOS(Intersex?) while being a transman must be horrible. Does testosterone(HRT) help with the symptoms ?\n\nIt's so sad when medical professionals trying to relate being trans with anything. This even has a name. \"Trans broken arm syndrome\".\n\nI wish you all luck and strenght.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you feel so terrible. Having PCOS(Intersex?) while being a transman must be horrible. Does testosterone(HRT) help with the symptoms ?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s so sad when medical professionals trying to relate being trans with anything. This even has a name. &amp;quot;Trans broken arm syndrome&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I wish you all luck and strenght.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg4cj1j", "score_hidden": false, "stickied": false, "created": 1491950744.0, "created_utc": 1491921944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]