[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: Meant to write &amp;quot;WAS a heroin addict&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I just don&amp;#39;t know what to do, every single time I think &amp;quot;okay, what I have now is currently manageable, I can live my life&amp;quot; another thing comes and tears it all down and then I am dealing with the horror of a new problem. &lt;/p&gt;\n\n&lt;p&gt;I am from Azerbaijan, I lived through the Chechen war as a kid and my parents and sister died, I went to live with aunt in Brooklyn. I was a heroin addict, it took me all of my willpower to quit. I saw atrocious things in Grozny. The memories of my mother dying and everything else scar me.&lt;/p&gt;\n\n&lt;p&gt;I lived in horrible poverty in brooklyn, never knowing where to get my next meal or where to sleep that night. I got IBS at 17 years old. This is irritable bowel syndrome, one of the worst things on the planet. It basically means when your in a nervous situation you feel like you are going to shit your pants and you get gassy. Long car rides, tests, appointments and meetings, anything. It is a CONSTANT source of anxiety. &lt;/p&gt;\n\n&lt;p&gt;I have psoriasis, I have hidrenitis (very painful boils appear all over body), I have TMJ, and last Monday I woke up with the most horrific pain imaginable. I&amp;#39;ve been to every damn doctor, they all say it&amp;#39;s cluster headaches. &lt;/p&gt;\n\n&lt;p&gt;It is the feeling of something pulling your eye out. It is the worst pain i have ever felt. Every damn day, for the rest of my life. &lt;/p&gt;\n\n&lt;p&gt;Why have I been chosen to lead this life of intense, excruciating agony? I live my life on the outside of that of normalcy and advancing my career and sex and partying and drugs but the reality is that I have suffered from these painful, anxiety inducing health problems for my whole life. I can sleep with so many girls, I have so many friends, on the outside my life looks like this perfect life of a young guy in brooklyn. But Every night I look in the mirror and see a broken man. And now the cluster headaches? This is worse than all the other stuff combined. &lt;/p&gt;\n\n&lt;p&gt;I used to ration it off with &amp;quot;other people have problems too!&amp;quot; but... this isn&amp;#39;t true, not like mine. These recent doctors visits have made me realize the extent of how painful and horribly agonizing my day-to-day life is. A doctor told me that I face more agony in a single day than most people do in a year with my IBS and Cluster headaches and ptsd and hidrenitis... and he&amp;#39;s right. I look around st the people around me and I feel such immense jealousy. I have not had a SINGLE DAY without agony, I havent had a &amp;#39;good day&amp;#39; theoretically in years, every day my various diseases crush me. &lt;/p&gt;\n\n&lt;p&gt;I just can&amp;#39;t go on like this anymore. I feel like god is using me as a science experiment to see what fucked up life-changing disease he could give me next. I feel like a punching bag. I am only 31 years old, and I feel older than the 93 year old man down the block. &lt;/p&gt;\n\n&lt;p&gt;Before I had enough strength to power through my diseases, IBS is bad but i dealt with it. Cluster headaches... they are the worst known pain to man. I don&amp;#39;t know if I can go on. At all. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Edit: Meant to write \"WAS a heroin addict\"\n\n\nI just don't know what to do, every single time I think \"okay, what I have now is currently manageable, I can live my life\" another thing comes and tears it all down and then I am dealing with the horror of a new problem. \n\nI am from Azerbaijan, I lived through the Chechen war as a kid and my parents and sister died, I went to live with aunt in Brooklyn. I was a heroin addict, it took me all of my willpower to quit. I saw atrocious things in Grozny. The memories of my mother dying and everything else scar me.\n\nI lived in horrible poverty in brooklyn, never knowing where to get my next meal or where to sleep that night. I got IBS at 17 years old. This is irritable bowel syndrome, one of the worst things on the planet. It basically means when your in a nervous situation you feel like you are going to shit your pants and you get gassy. Long car rides, tests, appointments and meetings, anything. It is a CONSTANT source of anxiety. \n\nI have psoriasis, I have hidrenitis (very painful boils appear all over body), I have TMJ, and last Monday I woke up with the most horrific pain imaginable. I've been to every damn doctor, they all say it's cluster headaches. \n\nIt is the feeling of something pulling your eye out. It is the worst pain i have ever felt. Every damn day, for the rest of my life. \n\nWhy have I been chosen to lead this life of intense, excruciating agony? I live my life on the outside of that of normalcy and advancing my career and sex and partying and drugs but the reality is that I have suffered from these painful, anxiety inducing health problems for my whole life. I can sleep with so many girls, I have so many friends, on the outside my life looks like this perfect life of a young guy in brooklyn. But Every night I look in the mirror and see a broken man. And now the cluster headaches? This is worse than all the other stuff combined. \n\nI used to ration it off with \"other people have problems too!\" but... this isn't true, not like mine. These recent doctors visits have made me realize the extent of how painful and horribly agonizing my day-to-day life is. A doctor told me that I face more agony in a single day than most people do in a year with my IBS and Cluster headaches and ptsd and hidrenitis... and he's right. I look around st the people around me and I feel such immense jealousy. I have not had a SINGLE DAY without agony, I havent had a 'good day' theoretically in years, every day my various diseases crush me. \n\nI just can't go on like this anymore. I feel like god is using me as a science experiment to see what fucked up life-changing disease he could give me next. I feel like a punching bag. I am only 31 years old, and I feel older than the 93 year old man down the block. \n\nBefore I had enough strength to power through my diseases, IBS is bad but i dealt with it. Cluster headaches... they are the worst known pain to man. I don't know if I can go on. At all. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64smvy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "wilmaster123", "saved": false, "mod_reports": [], "name": "t3_64smvy", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/64smvy/i_am_a_war_orphan_with_ptsd_a_heroin_addict_i/", "num_reports": null, "locked": false, "stickied": false, "created": 1491963546.0, "url": "https://www.reddit.com/r/offmychest/comments/64smvy/i_am_a_war_orphan_with_ptsd_a_heroin_addict_i/", "author_flair_text": null, "quarantine": false, "title": "I am a war orphan with PTSD, a heroin addict, I have IBS, and now I have Cluster Headaches all of the sudden. When will it end?? Why have I been chosen to receive such horrific agony???", "created_utc": 1491934746.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64smvy", "likes": null, "replies": "", "user_reports": [], "id": "dg4thct", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ILuvMyLilTurtles", "parent_id": "t3_64smvy", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "First off, I'm so sorry that you've had to deal with so much heartache during your life. The good news is you've managed to power through, and even kicked a heroin addiction, which is simply a HUGE accomplishment. \n\nI wanted to reassure you about the cluster headache situation you are facing. Yes, they are mind-blowingly (pun intended) horrible. They're called suicide headaches for a reason. That being said, while they often reoccur at the same time of day for weeks or even months at a time, they do eventually go into a remission of sorts. Some people get a series of them several times a year, some are like me and get them every few years. \n\nI don't know what your doctor's have recommended for you, as cluster headache is a totally different animal from a migraine. I ran the gamut of virtually every headache med and ended up just using Lortab as that was all that helped, even if just Abit.\n\nI'm not going to openly advocate for illegal substance use, especially as all I know is anecdotal and not personal experience, but I have read and seen documentaries where it is stated magic mushrooms (psilocybin) can either prohibit the formation of a cluster headache, or can arrest the headache once it starts. I'm just throwing that out there for you to research, it's seriously the only thing I've ever seen that seems to actually address the pain.\n\nI hope this helps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First off, I&amp;#39;m so sorry that you&amp;#39;ve had to deal with so much heartache during your life. The good news is you&amp;#39;ve managed to power through, and even kicked a heroin addiction, which is simply a HUGE accomplishment. &lt;/p&gt;\n\n&lt;p&gt;I wanted to reassure you about the cluster headache situation you are facing. Yes, they are mind-blowingly (pun intended) horrible. They&amp;#39;re called suicide headaches for a reason. That being said, while they often reoccur at the same time of day for weeks or even months at a time, they do eventually go into a remission of sorts. Some people get a series of them several times a year, some are like me and get them every few years. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what your doctor&amp;#39;s have recommended for you, as cluster headache is a totally different animal from a migraine. I ran the gamut of virtually every headache med and ended up just using Lortab as that was all that helped, even if just Abit.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to openly advocate for illegal substance use, especially as all I know is anecdotal and not personal experience, but I have read and seen documentaries where it is stated magic mushrooms (psilocybin) can either prohibit the formation of a cluster headache, or can arrest the headache once it starts. I&amp;#39;m just throwing that out there for you to research, it&amp;#39;s seriously the only thing I&amp;#39;ve ever seen that seems to actually address the pain.&lt;/p&gt;\n\n&lt;p&gt;I hope this helps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg4thct", "score_hidden": false, "stickied": false, "created": 1491969283.0, "created_utc": 1491940483.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]