[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At 27, I never:  &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Graduated High School, or got my GED. Because of this, I never went to college. I&amp;#39;m pretty stupid, untalented, unskilled.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Got my driver&amp;#39;s license. Spent most of my life in big cities where public transportation is used often and then I just never got around to it.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Had a career, obviously. I have a job but it pays little.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Had a family. My dad is in and out of jail and we haven&amp;#39;t spoken in years (abusive alcoholic). My mom/sisters live across the country and my relationships with them are turbulent at best. We don&amp;#39;t talk, when we do it isn&amp;#39;t on friendly terms and they have told me I am worthless and they&amp;#39;re better off without me. All extended family I haven&amp;#39;t spoken to since I was maybe 10 years old.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Had good friends. Lost many (death, grown apart, broken up, ditched for drugs, fallen out), but never had really good friends I could count on. I have some kinda friends these days, but no one I am at all close with. No one would care if I wasn&amp;#39;t here, nor would they miss me.&lt;br/&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;As a woman, I feel like it&amp;#39;s too late for me to make anything of my life. I&amp;#39;m old, unattractive, over-the-hill, untalented, unskilled, unintelligent, mediocre. Severely depressed/anxious/who knows what else.. and 3 therapists and 6 different medications haven&amp;#39;t helped.  &lt;/p&gt;\n\n&lt;p&gt;I plan to kill myself when I turn 30. I think at that point if I haven&amp;#39;t done anything with my life I don&amp;#39;t deserve to live. And I know I won&amp;#39;t, because I&amp;#39;m garbage. All of this is my fault and I have no one to blame but myself. The least I can do is rid the world of my worthlessness because I bring nothing good to it. Not looking for pity, I just literally have no one to say any of this to.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "At 27, I never:  \n\n1. Graduated High School, or got my GED. Because of this, I never went to college. I'm pretty stupid, untalented, unskilled.  \n2. Got my driver's license. Spent most of my life in big cities where public transportation is used often and then I just never got around to it.  \n3. Had a career, obviously. I have a job but it pays little.  \n4. Had a family. My dad is in and out of jail and we haven't spoken in years (abusive alcoholic). My mom/sisters live across the country and my relationships with them are turbulent at best. We don't talk, when we do it isn't on friendly terms and they have told me I am worthless and they're better off without me. All extended family I haven't spoken to since I was maybe 10 years old.  \n5. Had good friends. Lost many (death, grown apart, broken up, ditched for drugs, fallen out), but never had really good friends I could count on. I have some kinda friends these days, but no one I am at all close with. No one would care if I wasn't here, nor would they miss me.   \n\nAs a woman, I feel like it's too late for me to make anything of my life. I'm old, unattractive, over-the-hill, untalented, unskilled, unintelligent, mediocre. Severely depressed/anxious/who knows what else.. and 3 therapists and 6 different medications haven't helped.  \n\nI plan to kill myself when I turn 30. I think at that point if I haven't done anything with my life I don't deserve to live. And I know I won't, because I'm garbage. All of this is my fault and I have no one to blame but myself. The least I can do is rid the world of my worthlessness because I bring nothing good to it. Not looking for pity, I just literally have no one to say any of this to.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sots", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "worldprincesspartii", "saved": false, "mod_reports": [], "name": "t3_64sots", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/64sots/at_27_i_feel_old_over_the_hill_useless_worthless/", "num_reports": null, "locked": false, "stickied": false, "created": 1491964024.0, "url": "https://www.reddit.com/r/offmychest/comments/64sots/at_27_i_feel_old_over_the_hill_useless_worthless/", "author_flair_text": null, "quarantine": false, "title": "At 27, I feel: old, over the hill, useless, worthless, hopeless, at rock bottom. And it's all my fault. So, I know I will kill myself at 30.", "created_utc": 1491935224.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sots", "likes": null, "replies": "", "user_reports": [], "id": "dg4pf5k", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "havetothrowawaythis1", "parent_id": "t3_64sots", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I don't mean this to come across as invalidating, because I know how overpowering those feelings can be. HOWEVER. You just wrote a very clear and coherent post with proper punctuation and spelling and more than acceptable grammar. You're clearly not unintelligent :) nor are you garbage!\n\nI'm going back to school, I'm 29, and I am SO happy. Abusive broken home, chronic illness and unhappy marriage later... I'm here. It took going into that valley and a brush with alcoholism for me to wake up and realize I get one life and EACH DAY is a chance. Even if it feels impossible. \n\nI'm glad you're here OP, and I believe in you. If I can climb out then I want to let you know, you can climb out too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t mean this to come across as invalidating, because I know how overpowering those feelings can be. HOWEVER. You just wrote a very clear and coherent post with proper punctuation and spelling and more than acceptable grammar. You&amp;#39;re clearly not unintelligent :) nor are you garbage!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going back to school, I&amp;#39;m 29, and I am SO happy. Abusive broken home, chronic illness and unhappy marriage later... I&amp;#39;m here. It took going into that valley and a brush with alcoholism for me to wake up and realize I get one life and EACH DAY is a chance. Even if it feels impossible. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad you&amp;#39;re here OP, and I believe in you. If I can climb out then I want to let you know, you can climb out too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg4pf5k", "score_hidden": false, "stickied": false, "created": 1491964954.0, "created_utc": 1491936154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sots", "likes": null, "replies": "", "user_reports": [], "id": "dg51231", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "PhillyPhenom", "parent_id": "t3_64sots", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "No pity here.\n\nYou are the only person who can decide your own worth.\n\nAnd 27 is not at all too old to start a family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No pity here.&lt;/p&gt;\n\n&lt;p&gt;You are the only person who can decide your own worth.&lt;/p&gt;\n\n&lt;p&gt;And 27 is not at all too old to start a family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg51231", "score_hidden": false, "stickied": false, "created": 1491978191.0, "created_utc": 1491949391.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sots", "likes": null, "replies": "", "user_reports": [], "id": "dg5ag2g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ngc44312", "parent_id": "t3_64sots", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Hey cars are overrated. Insurance is too much, cars crumple up when some idiot forgets how to drive, and car doctors are out there to bleed every dollar out of you. \n\nFamily is just a group of people you happened to be born into. There's no need to insist on maintaining connections with them (from my perspective).\n\nSincerely, \na teenager who wishes she was in her 20's. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey cars are overrated. Insurance is too much, cars crumple up when some idiot forgets how to drive, and car doctors are out there to bleed every dollar out of you. &lt;/p&gt;\n\n&lt;p&gt;Family is just a group of people you happened to be born into. There&amp;#39;s no need to insist on maintaining connections with them (from my perspective).&lt;/p&gt;\n\n&lt;p&gt;Sincerely, \na teenager who wishes she was in her 20&amp;#39;s. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5ag2g", "score_hidden": false, "stickied": false, "created": 1491990567.0, "created_utc": 1491961767.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sots", "likes": null, "replies": "", "user_reports": [], "id": "dg5aqtr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bri-Wei", "parent_id": "t3_64sots", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sometimes just writing it out, even for strangers to see, can be helpful on its own. \n\nI can't say I know where you're coming from, but there's always chances. Always a chance to keep trying, to give the GED another shot, to go out and meet new people and friends and potentially that person you'll start a family with. But you won't know if you don't take that chance. \n\nI'm just some rando on the internet, but if you need a person to vent to I'll offer myself up. Just take care op. Keep trying. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes just writing it out, even for strangers to see, can be helpful on its own. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t say I know where you&amp;#39;re coming from, but there&amp;#39;s always chances. Always a chance to keep trying, to give the GED another shot, to go out and meet new people and friends and potentially that person you&amp;#39;ll start a family with. But you won&amp;#39;t know if you don&amp;#39;t take that chance. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just some rando on the internet, but if you need a person to vent to I&amp;#39;ll offer myself up. Just take care op. Keep trying. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5aqtr", "score_hidden": false, "stickied": false, "created": 1491990960.0, "created_utc": 1491962160.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sots", "likes": null, "replies": "", "user_reports": [], "id": "dg5bzrg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tftm11", "parent_id": "t3_64sots", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You're 27, that's far from too old (and that's coming from a woman who is older than you). I mean, look, things aren't just going to suddenly all turn around for the better at the same time, you'll have to take steps to improve things if you want them to improve - but you don't have to make big, completely life-changing steps, either. You can pick one goal you have, maybe getting a GED, and start taking little steps to get it done. Even making little steps, you can do a good bit in three years!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re 27, that&amp;#39;s far from too old (and that&amp;#39;s coming from a woman who is older than you). I mean, look, things aren&amp;#39;t just going to suddenly all turn around for the better at the same time, you&amp;#39;ll have to take steps to improve things if you want them to improve - but you don&amp;#39;t have to make big, completely life-changing steps, either. You can pick one goal you have, maybe getting a GED, and start taking little steps to get it done. Even making little steps, you can do a good bit in three years!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5bzrg", "score_hidden": false, "stickied": false, "created": 1491992651.0, "created_utc": 1491963851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sots", "likes": null, "replies": "", "user_reports": [], "id": "dg5ehum", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "allofthembile", "parent_id": "t3_64sots", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's really so awful. I'm sorry things are like this for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s really so awful. I&amp;#39;m sorry things are like this for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5ehum", "score_hidden": false, "stickied": false, "created": 1491996202.0, "created_utc": 1491967402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sots", "likes": null, "replies": "", "user_reports": [], "id": "dg5fq7y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Veritaste", "parent_id": "t3_64sots", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I hope you feel better. I know you're down about not attaining certain things, but just want to point out something: you are exceedingly introspective. Introspection is a wellspring for many talents, and those few that possess your level of introspection often don't realize this because they are consumed by their self criticism. \n\nTalent is inner energy turned outward, in a positive fashion. Some examples of upsides to introspective personality types are empathy, discernment, groundedness, dark humor, and a knack for writing. \n\nI hope you can foster an understanding of, and appreciation for, the upsides to your internal monologue of self awareness, self criticism and self analysis. Those upsides are your talents. And for all I know they may be just a few of the many. But for sure, they are very real and significant. Find them, and channel some of that significant internal energy outward and into them. If you practice this stuff enough you will find your balance. And that's the goal. Because balance is really what happiness is, you know? Staying true to yourself, listening to yourself, learning your nature, and also connecting outwardly, positively, to others, and sharing your gifts....Balance. \n\nAs an aside...and you probably know this, but just in case: Introspection - like depression, and like good grammar, and like good writing - is also a mark of above average intelligence. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you feel better. I know you&amp;#39;re down about not attaining certain things, but just want to point out something: you are exceedingly introspective. Introspection is a wellspring for many talents, and those few that possess your level of introspection often don&amp;#39;t realize this because they are consumed by their self criticism. &lt;/p&gt;\n\n&lt;p&gt;Talent is inner energy turned outward, in a positive fashion. Some examples of upsides to introspective personality types are empathy, discernment, groundedness, dark humor, and a knack for writing. &lt;/p&gt;\n\n&lt;p&gt;I hope you can foster an understanding of, and appreciation for, the upsides to your internal monologue of self awareness, self criticism and self analysis. Those upsides are your talents. And for all I know they may be just a few of the many. But for sure, they are very real and significant. Find them, and channel some of that significant internal energy outward and into them. If you practice this stuff enough you will find your balance. And that&amp;#39;s the goal. Because balance is really what happiness is, you know? Staying true to yourself, listening to yourself, learning your nature, and also connecting outwardly, positively, to others, and sharing your gifts....Balance. &lt;/p&gt;\n\n&lt;p&gt;As an aside...and you probably know this, but just in case: Introspection - like depression, and like good grammar, and like good writing - is also a mark of above average intelligence. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5fq7y", "score_hidden": false, "stickied": false, "created": 1491998122.0, "created_utc": 1491969322.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]