[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Growing up, I&amp;#39;ve never really liked my mom because of multiple reasons especially during elementary school. I was beat almost everyday for dumb reasons like not waking up, not finishing my food, for expressing that I want my dad more than my mom, etc. A lot of the times, she&amp;#39;ll express her anger from something else at me. Another thing she has done was calling me the b-word (八婆 or 死八婆) in her language and saying that it doesn&amp;#39;t mean the b-word. My family is from hong kong. She&amp;#39;ll call me that in front of my family or other chinese people. My family finds it amusing that I&amp;#39;ll reply to not call me that in cantonese. Other people said that it&amp;#39;s very mean to call me that. My mom literally said she was just playing. Luckily she hasn&amp;#39;t beat me or called me a the b-word since I was in high school. From that point on, my hatred for her has calmed down. During my first year of college, I was at the peak of my depression. My mom was definitely part of the reason for my depression. However, this women knew I was suffering from depression and didn&amp;#39;t bother helping me. After sometime has past, I didn&amp;#39;t think much of her. I certainly don&amp;#39;t hate her as much, but more of a bearable dislike. From the start of December 2016, I wanted to have a better relationship with my parents. Honestly, I kinda gave up with my mom after talking to her 3 weeks ago.&lt;/p&gt;\n\n&lt;p&gt;Last month, my boyfriend and I had a serious conversation about how his life with college and work is going so far. After this, we concluded that he might move in with us for a short period of time. My dad was completely okay with it, because he understood the struggles of attending college and having a full time job at the same time. On the other hand, my mom said no. After sometime of talking to her, she said maybe IF we meet her demands. Some of these demands are reasonable like my boyfriend had to ask her personally and have a conversation about this in person. One demand that we cannot meet is her meeting his parents and having a conversation about this. I can&amp;#39;t be the only person who thinks that this is a terrible idea. My boyfriend&amp;#39;s parents might kick him out of the house and yet you want to talk to them about this. Also, knowing my mom, trying to have a conversation with her is like having a conversation with a rock. She make jokes at a super serious conversations, she&amp;#39;ll talk about something off topic, or she&amp;#39;ll blame things on me. &lt;/p&gt;\n\n&lt;p&gt;A week after this serious conversation with my boyfriend, I had a really long conversation with my mom. Towards the end, I was talking about my depression with her. I asked her why she didn&amp;#39;t help when I was suffering so hard. She literally said that she didn&amp;#39;t think I was suffering from depression AND that I was too young to suffer from depression. From that point on, I just gave up trying to improve my relationship with her. I told my boyfriend this and expressed my frustrations with my mom.&lt;/p&gt;\n\n&lt;p&gt;Interestingly enough, I talked to my dad about my boyfriend staying over. He expressed that he was okay with it and he could relate to him. At this time, my dad opened up about his depression too. The interesting part was that my mom is the reason why he suffered from depression. My mom has done a lot of things that caused my dad&amp;#39;s depression. One of them is following her sister&amp;#39;s orders. My dad wanted to marry my mom a few weeks later because of financial reasons. But my mom expressed angrily and aggressively that she wants to get married now. She wanted to get married, then immediately fly to the united states to help my aunt move to the u.s. There are a lot of reasons, but those are too personal. &lt;/p&gt;\n\n&lt;p&gt;A couple nights ago, my boyfriend texted me and asked if I wanted to move out and live together. I said yes in a heartbeat. After that night, I recalled my memories with my mom. And the more I think about her, the more I hate her. After I move out, I honestly don&amp;#39;t have plans to talk to her. I would talk to my dad, but not my mom.&lt;/p&gt;\n\n&lt;p&gt;I need to get this off my chest because I feel like she is bringing me down on so many levels. She has said so many messed up things to me that I don&amp;#39;t really want to share. Honestly, I feel better after typing ALL of this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Growing up, I've never really liked my mom because of multiple reasons especially during elementary school. I was beat almost everyday for dumb reasons like not waking up, not finishing my food, for expressing that I want my dad more than my mom, etc. A lot of the times, she'll express her anger from something else at me. Another thing she has done was calling me the b-word (八婆 or 死八婆) in her language and saying that it doesn't mean the b-word. My family is from hong kong. She'll call me that in front of my family or other chinese people. My family finds it amusing that I'll reply to not call me that in cantonese. Other people said that it's very mean to call me that. My mom literally said she was just playing. Luckily she hasn't beat me or called me a the b-word since I was in high school. From that point on, my hatred for her has calmed down. During my first year of college, I was at the peak of my depression. My mom was definitely part of the reason for my depression. However, this women knew I was suffering from depression and didn't bother helping me. After sometime has past, I didn't think much of her. I certainly don't hate her as much, but more of a bearable dislike. From the start of December 2016, I wanted to have a better relationship with my parents. Honestly, I kinda gave up with my mom after talking to her 3 weeks ago.\n\nLast month, my boyfriend and I had a serious conversation about how his life with college and work is going so far. After this, we concluded that he might move in with us for a short period of time. My dad was completely okay with it, because he understood the struggles of attending college and having a full time job at the same time. On the other hand, my mom said no. After sometime of talking to her, she said maybe IF we meet her demands. Some of these demands are reasonable like my boyfriend had to ask her personally and have a conversation about this in person. One demand that we cannot meet is her meeting his parents and having a conversation about this. I can't be the only person who thinks that this is a terrible idea. My boyfriend's parents might kick him out of the house and yet you want to talk to them about this. Also, knowing my mom, trying to have a conversation with her is like having a conversation with a rock. She make jokes at a super serious conversations, she'll talk about something off topic, or she'll blame things on me. \n\nA week after this serious conversation with my boyfriend, I had a really long conversation with my mom. Towards the end, I was talking about my depression with her. I asked her why she didn't help when I was suffering so hard. She literally said that she didn't think I was suffering from depression AND that I was too young to suffer from depression. From that point on, I just gave up trying to improve my relationship with her. I told my boyfriend this and expressed my frustrations with my mom.\n\nInterestingly enough, I talked to my dad about my boyfriend staying over. He expressed that he was okay with it and he could relate to him. At this time, my dad opened up about his depression too. The interesting part was that my mom is the reason why he suffered from depression. My mom has done a lot of things that caused my dad's depression. One of them is following her sister's orders. My dad wanted to marry my mom a few weeks later because of financial reasons. But my mom expressed angrily and aggressively that she wants to get married now. She wanted to get married, then immediately fly to the united states to help my aunt move to the u.s. There are a lot of reasons, but those are too personal. \n\nA couple nights ago, my boyfriend texted me and asked if I wanted to move out and live together. I said yes in a heartbeat. After that night, I recalled my memories with my mom. And the more I think about her, the more I hate her. After I move out, I honestly don't have plans to talk to her. I would talk to my dad, but not my mom.\n\nI need to get this off my chest because I feel like she is bringing me down on so many levels. She has said so many messed up things to me that I don't really want to share. Honestly, I feel better after typing ALL of this.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sumo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 20, "report_reasons": null, "author": "blossomlovergirl", "saved": false, "mod_reports": [], "name": "t3_64sumo", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/64sumo/i_hate_my_mom/", "num_reports": null, "locked": false, "stickied": false, "created": 1491965482.0, "url": "https://www.reddit.com/r/offmychest/comments/64sumo/i_hate_my_mom/", "author_flair_text": null, "quarantine": false, "title": "I hate my mom", "created_utc": 1491936682.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sumo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sumo", "likes": null, "replies": "", "user_reports": [], "id": "dg5lkti", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blossomlovergirl", "parent_id": "t1_dg5b719", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5lkti", "score_hidden": false, "stickied": false, "created": 1492010249.0, "created_utc": 1491981449.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5b719", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PM_ME_CAT_PAWS", "parent_id": "t3_64sumo", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": ":( 抱歉\n\n她是一八婆 lol\n\nI'm glad you feel a little better getting this off your chest. Your boyfriend sounds wonderful!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:( 抱歉&lt;/p&gt;\n\n&lt;p&gt;她是一八婆 lol&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad you feel a little better getting this off your chest. Your boyfriend sounds wonderful!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5b719", "score_hidden": false, "stickied": false, "created": 1491991559.0, "created_utc": 1491962759.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sumo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64sumo", "likes": null, "replies": "", "user_reports": [], "id": "dg67sj4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blossomlovergirl", "parent_id": "t1_dg5nrrm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg67sj4", "score_hidden": false, "stickied": false, "created": 1492047107.0, "created_utc": 1492018307.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nrrm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheGoodhell", "parent_id": "t3_64sumo", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Wow. Almost sounds like you're talking about my mom. She likes to insult me and blame for every little tiny fuck up. Only difference is shes korean and likes to wave a fucking knife around in my face while I'm backed into a corner  so I don't talk back. Can't wait to move out. I won't miss her one bit. And I used to feel bad about feeling this way because it's Asian culture to stick through tooth and nail with your parents no matter how shitty of a person they are. Well fuck that. If you do feel even a little guilty, don't. You don't choose your parents, so if they're shitty people, then that's how you treat them. I'm so done now lol I don't even get mad anymore when she's telling at my face I just think it's funny and even laugh which provokes her even more which makes it funnier for me, and the cycle repeats.\n\nGlad you got out of that emotional hell hole with your mom though. Sounds like you found a loving partner. I'm happy for you (: good luck on your future endeavors        ", "edited": 1491988302.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. Almost sounds like you&amp;#39;re talking about my mom. She likes to insult me and blame for every little tiny fuck up. Only difference is shes korean and likes to wave a fucking knife around in my face while I&amp;#39;m backed into a corner  so I don&amp;#39;t talk back. Can&amp;#39;t wait to move out. I won&amp;#39;t miss her one bit. And I used to feel bad about feeling this way because it&amp;#39;s Asian culture to stick through tooth and nail with your parents no matter how shitty of a person they are. Well fuck that. If you do feel even a little guilty, don&amp;#39;t. You don&amp;#39;t choose your parents, so if they&amp;#39;re shitty people, then that&amp;#39;s how you treat them. I&amp;#39;m so done now lol I don&amp;#39;t even get mad anymore when she&amp;#39;s telling at my face I just think it&amp;#39;s funny and even laugh which provokes her even more which makes it funnier for me, and the cycle repeats.&lt;/p&gt;\n\n&lt;p&gt;Glad you got out of that emotional hell hole with your mom though. Sounds like you found a loving partner. I&amp;#39;m happy for you (: good luck on your future endeavors        &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5nrrm", "score_hidden": false, "stickied": false, "created": 1492016860.0, "created_utc": 1491988060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]