[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Went home to visit my Dad who&amp;#39;s dealing with a heap of medical trouble (a story for another time) and out of nowhere, we got on the topic of immigrants, the current political clime, and his experience, which left me fucking enraged.  I had no idea he had such rich knowledge of the immigrant community.  I&amp;#39;ve been wanting to grab people in the street and tell them about it ever since... but I guess this will have to do.  Someone just needs to hear.  Or read.  Whatever.&lt;/p&gt;\n\n&lt;p&gt;The thing I remember most about my Old Man from my youth was that his hands felt like &lt;em&gt;rocks&lt;/em&gt; from the work he did, straight up &lt;em&gt;rocks.&lt;/em&gt;  Drywall, plumbing, construction, electric, painting - you name it, he did it. He worked with a variety of guys, busting his ass for years - Many of those guys were Mexican, and most would fight tooth and nail to be able to work with, and under, my Dad.  When I asked him why, he wasn&amp;#39;t really sure.  He said maybe it was because he bought them espresso sometimes - said they missed how good it was back home, but it was $4 a cup in the U.S., and that was too much luxury.  &amp;quot;Christ,&amp;quot; he&amp;#39;d said, &amp;quot;You&amp;#39;d have thought I bought them each a steak every time, just &lt;em&gt;thank you thank you thank you.&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Another time, one of them genuinely asked him why he works so much.  My old man just says he&amp;#39;s got bills to pay, family to take care of (the reality is he&amp;#39;s got two kids he wants to send to college on a minimum wage job and a mountain of medical bills - again, story for another time).  His coworker didn&amp;#39;t know much English, but he said &amp;quot;You the only guy I meet work hard as me.  I work.  Send money home.  Maybe I have one beer.  Back to work.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The day my old man lost his job, they all walked off the job with him.  They said &amp;quot;We no work for them, we work for you.&amp;quot;  No one was more surprised than my old man, but he said he knew most of the other guys treated them like shit.&lt;/p&gt;\n\n&lt;p&gt;And just... Once my old man started telling stories, I got angrier and angrier at all of the entitled people I&amp;#39;ve known, at my ignorant American friends who don&amp;#39;t know shit about hard work, let alone the type of work my old man had to do with these guys.  He mowed lawns, he dunged out busted septic with a shovel, he nearly got robbed and beaten in the roughest of neighborhoods, shot at, blowing though a bottle of Hydrogen peroxide a week just on random wounds from screws, hammers, nails, who knows - none of it was glorious, all of it was hard on his body, but he did what he needed to for his family, and I&amp;#39;m thankful for it every day - That&amp;#39;s all any of these guys were, hard working men, busting their asses, hands like rocks, to take care of their families, and &lt;em&gt;why the fuck are people mad about that??&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Because &amp;quot;they don&amp;#39;t pay taxes?&amp;quot;  &lt;strong&gt;Bullshit&lt;/strong&gt;.  Green card holders pay, visa holders do if they stay too long, and, hey, fun fact according to my Dad, most illegals don&amp;#39;t work under the table.  Most use a bogus ss# and their employers take out taxes perfectly normally - but the hell if the guys ever &lt;em&gt;file for a tax return.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Oh, so, it&amp;#39;s because &amp;quot;they take our jobs??&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the biggest load of entitled bullshit I&amp;#39;ve heard in a long time.  What makes them &amp;quot;our&amp;quot; jobs?  The fact that we came squealing into this world on &lt;em&gt;this&lt;/em&gt; side of some shitty river beneath Texas?  And who&amp;#39;s &amp;quot;they,&amp;quot; a hard working guy who was born on the other side?  Why is he any different than my Dad?  My Dad&amp;#39;s ancestors once came here for a better life, we&amp;#39;re Americans, all of ours did (Barring our black friends, of course).  So who the fuck are we to bar someone else from doing the goddamn same?? \n Who are we to &lt;em&gt;let&lt;/em&gt; someone bar them from doing the same?  I thought we learned in elementary school that treating people different based on looks or language or where they&amp;#39;re from is fucking wrong - but hey, if we wanna go there, lets talk about how my Dad was the only white guy on their crew, because he was the only white guy within 10 miles of the place who could swallow his pride enough to dung shit out of a hole for $10 an hour so his kids could have a better life - &lt;em&gt;Dad&lt;/em&gt; didn&amp;#39;t want that job, &lt;em&gt;they&lt;/em&gt; didn&amp;#39;t want that job, but they did it, they did it while paying fucking taxes, and trust me when I tell you, they didn&amp;#39;t fucking &lt;em&gt;take&lt;/em&gt; that job, from &lt;em&gt;anyone.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;What hit me the hardest was realizing that those guys didn&amp;#39;t walk off of the job with my old man because he bought them fucking &lt;em&gt;espresso,&lt;/em&gt; they did it because he was the only guy there that treated them with any amount of fucking &lt;em&gt;respect.&lt;/em&gt;  Like the hard working guys they were.  Like humans, instead of second class citizens, and that&amp;#39;s what this is really all about.  People don&amp;#39;t want Mexicans out of the country because &amp;quot;they&amp;#39;re illegal, and you should follow the law&amp;quot; or &amp;quot;they don&amp;#39;t pay taxes,&amp;quot;  or &amp;quot;they&amp;#39;re taking our jobs,&amp;quot; none of that shit holds any water.  They want them out because they&amp;#39;re different, and brown, and speak a different language, and they&amp;#39;re from somewhere else, and that&amp;#39;s icky.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know where those guys are now, but god dammit I wish them well during this politically induced shit storm, busting their asses to take care of their families, just like my Dad did, only difference is they were born on the other side of a shitty river in Texas, meanwhile my country is trying to spend trillions on a fucking wall while kids in schools can&amp;#39;t afford pencils.&lt;/p&gt;\n\n&lt;p&gt;Wherever they are, I hope people are treating them like decent, hard working human beings, but I doubt it, and it breaks my heart.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit: the fact that this blew up some and so many people feel the same way has given me more hope than I ever realized it could. Thank you all. It&amp;#39;s exactly what I needed.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Went home to visit my Dad who's dealing with a heap of medical trouble (a story for another time) and out of nowhere, we got on the topic of immigrants, the current political clime, and his experience, which left me fucking enraged.  I had no idea he had such rich knowledge of the immigrant community.  I've been wanting to grab people in the street and tell them about it ever since... but I guess this will have to do.  Someone just needs to hear.  Or read.  Whatever.\n  \nThe thing I remember most about my Old Man from my youth was that his hands felt like *rocks* from the work he did, straight up *rocks.*  Drywall, plumbing, construction, electric, painting - you name it, he did it. He worked with a variety of guys, busting his ass for years - Many of those guys were Mexican, and most would fight tooth and nail to be able to work with, and under, my Dad.  When I asked him why, he wasn't really sure.  He said maybe it was because he bought them espresso sometimes - said they missed how good it was back home, but it was $4 a cup in the U.S., and that was too much luxury.  \"Christ,\" he'd said, \"You'd have thought I bought them each a steak every time, just *thank you thank you thank you.*\"\n  \nAnother time, one of them genuinely asked him why he works so much.  My old man just says he's got bills to pay, family to take care of (the reality is he's got two kids he wants to send to college on a minimum wage job and a mountain of medical bills - again, story for another time).  His coworker didn't know much English, but he said \"You the only guy I meet work hard as me.  I work.  Send money home.  Maybe I have one beer.  Back to work.\"\n  \nThe day my old man lost his job, they all walked off the job with him.  They said \"We no work for them, we work for you.\"  No one was more surprised than my old man, but he said he knew most of the other guys treated them like shit.\n  \nAnd just... Once my old man started telling stories, I got angrier and angrier at all of the entitled people I've known, at my ignorant American friends who don't know shit about hard work, let alone the type of work my old man had to do with these guys.  He mowed lawns, he dunged out busted septic with a shovel, he nearly got robbed and beaten in the roughest of neighborhoods, shot at, blowing though a bottle of Hydrogen peroxide a week just on random wounds from screws, hammers, nails, who knows - none of it was glorious, all of it was hard on his body, but he did what he needed to for his family, and I'm thankful for it every day - That's all any of these guys were, hard working men, busting their asses, hands like rocks, to take care of their families, and *why the fuck are people mad about that??*\n  \nBecause \"they don't pay taxes?\"  **Bullshit**.  Green card holders pay, visa holders do if they stay too long, and, hey, fun fact according to my Dad, most illegals don't work under the table.  Most use a bogus ss# and their employers take out taxes perfectly normally - but the hell if the guys ever *file for a tax return.*\n  \nOh, so, it's because \"they take our jobs??\"  \n  \nThat's the biggest load of entitled bullshit I've heard in a long time.  What makes them \"our\" jobs?  The fact that we came squealing into this world on *this* side of some shitty river beneath Texas?  And who's \"they,\" a hard working guy who was born on the other side?  Why is he any different than my Dad?  My Dad's ancestors once came here for a better life, we're Americans, all of ours did (Barring our black friends, of course).  So who the fuck are we to bar someone else from doing the goddamn same?? \n Who are we to *let* someone bar them from doing the same?  I thought we learned in elementary school that treating people different based on looks or language or where they're from is fucking wrong - but hey, if we wanna go there, lets talk about how my Dad was the only white guy on their crew, because he was the only white guy within 10 miles of the place who could swallow his pride enough to dung shit out of a hole for $10 an hour so his kids could have a better life - *Dad* didn't want that job, *they* didn't want that job, but they did it, they did it while paying fucking taxes, and trust me when I tell you, they didn't fucking *take* that job, from *anyone.*\n  \nWhat hit me the hardest was realizing that those guys didn't walk off of the job with my old man because he bought them fucking *espresso,* they did it because he was the only guy there that treated them with any amount of fucking *respect.*  Like the hard working guys they were.  Like humans, instead of second class citizens, and that's what this is really all about.  People don't want Mexicans out of the country because \"they're illegal, and you should follow the law\" or \"they don't pay taxes,\"  or \"they're taking our jobs,\" none of that shit holds any water.  They want them out because they're different, and brown, and speak a different language, and they're from somewhere else, and that's icky.\n  \nI don't know where those guys are now, but god dammit I wish them well during this politically induced shit storm, busting their asses to take care of their families, just like my Dad did, only difference is they were born on the other side of a shitty river in Texas, meanwhile my country is trying to spend trillions on a fucking wall while kids in schools can't afford pencils.\n  \nWherever they are, I hope people are treating them like decent, hard working human beings, but I doubt it, and it breaks my heart.\n  \n**Edit: the fact that this blew up some and so many people feel the same way has given me more hope than I ever realized it could. Thank you all. It's exactly what I needed.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64u7np", "gilded": 2, "secure_media_embed": {}, "clicked": false, "score": 1547, "report_reasons": null, "author": "Justice_Man", "saved": false, "mod_reports": [], "name": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": 1492012121.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/64u7np/my_dad_worked_with_many_mexican_folks_over_the/", "num_reports": null, "locked": true, "stickied": false, "created": 1491978484.0, "url": "https://www.reddit.com/r/offmychest/comments/64u7np/my_dad_worked_with_many_mexican_folks_over_the/", "author_flair_text": null, "quarantine": false, "title": "My Dad worked with many Mexican folks over the years, both legal and illegal, and his story breaks my heart.", "created_utc": 1491949684.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 70, "visited": false, "subreddit_type": "public", "ups": 1547}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg6f91l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheYellowRose", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 1, "body": "This is not the place to discuss immigration, machismo, whatever. Locked. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not the place to discuss immigration, machismo, whatever. Locked. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6f91l", "score_hidden": true, "stickied": true, "created": 1492054747.0, "created_utc": 1492025947.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg63vj1", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Justice_Man", "parent_id": "t1_dg5go2o", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thanks for sharing. I wish I could go back in time and smack my young, ignorant face for complaining about not getting a game boy for my birthday when my parents worked so goddamn hard all my life. \n  \nStill years later they get all emotional about all the things they \"weren't able to give me.\"\n  \nTruth is they gave me everything I have, and they didn't have to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for sharing. I wish I could go back in time and smack my young, ignorant face for complaining about not getting a game boy for my birthday when my parents worked so goddamn hard all my life. &lt;/p&gt;\n\n&lt;p&gt;Still years later they get all emotional about all the things they &amp;quot;weren&amp;#39;t able to give me.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Truth is they gave me everything I have, and they didn&amp;#39;t have to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg63vj1", "score_hidden": false, "stickied": false, "created": 1492043098.0, "created_utc": 1492014298.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5go2o", "gilded": 0, "archived": false, "score": 208, "report_reasons": null, "author": "carpenoctum0517", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I was an undocumented immigrant until I was 18 years old. My mom works as a housekeeper and my dad works in construction doing brick masonry. They paid for my college education, my apartment rent, and even put in a little extra so I could go out and have fun. All while taking care of a mortgage, bills, and my other siblings. The majority of my friends have always been wealthy white people and my mom is well aware. She would make little comments that would break my heart like \"I'm sorry I can't afford to give you what their parents give them.\" Or the worst one \"Sometimes I wonder if you're embarrassed that I clean other people's toilets for a living.\" You have no idea how many times I would have to tell her how fucking proud I am to be their daughter. I have absolutely no shame in what my parents do because I know they worked their asses off to get me to where I am today, an IT Sys Admin. \n\nPlease tell your father that he is an amazing man. At the end of the day, all we want is what other people receive without question...respect. And if his workers acted the way they did, its because they respect the fuck out of your dad because he has shown them respect too. Mexicans are all about honor. And let me tell you, your dad is as honorable as they come.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was an undocumented immigrant until I was 18 years old. My mom works as a housekeeper and my dad works in construction doing brick masonry. They paid for my college education, my apartment rent, and even put in a little extra so I could go out and have fun. All while taking care of a mortgage, bills, and my other siblings. The majority of my friends have always been wealthy white people and my mom is well aware. She would make little comments that would break my heart like &amp;quot;I&amp;#39;m sorry I can&amp;#39;t afford to give you what their parents give them.&amp;quot; Or the worst one &amp;quot;Sometimes I wonder if you&amp;#39;re embarrassed that I clean other people&amp;#39;s toilets for a living.&amp;quot; You have no idea how many times I would have to tell her how fucking proud I am to be their daughter. I have absolutely no shame in what my parents do because I know they worked their asses off to get me to where I am today, an IT Sys Admin. &lt;/p&gt;\n\n&lt;p&gt;Please tell your father that he is an amazing man. At the end of the day, all we want is what other people receive without question...respect. And if his workers acted the way they did, its because they respect the fuck out of your dad because he has shown them respect too. Mexicans are all about honor. And let me tell you, your dad is as honorable as they come.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5go2o", "score_hidden": false, "stickied": false, "created": 1491999693.0, "created_utc": 1491970893.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 208}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5dnz7", "gilded": 0, "archived": false, "score": 138, "report_reasons": null, "author": "Aworthyopponent", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I am a Hispanic and I worked recently with immigrant children. The crime, poverty and helplessness they are escaping is unbelievable. It's a truly humbling experience to speak to those families many of them parents/grandparents sending their kids alone to the US because their siblings were either killed or threatened and it's literally their only chance for survival. They kids get visas and go to school and many even college. I completely agree with you and great post. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a Hispanic and I worked recently with immigrant children. The crime, poverty and helplessness they are escaping is unbelievable. It&amp;#39;s a truly humbling experience to speak to those families many of them parents/grandparents sending their kids alone to the US because their siblings were either killed or threatened and it&amp;#39;s literally their only chance for survival. They kids get visas and go to school and many even college. I completely agree with you and great post. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5dnz7", "score_hidden": false, "stickied": false, "created": 1491994986.0, "created_utc": 1491966186.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 138}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5e4n1", "gilded": 0, "archived": false, "score": 93, "report_reasons": null, "author": "gnome_census", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "In all the shit jobs I've worked, hell even in general, Mexicans have been the hardest workers and the nicest people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In all the shit jobs I&amp;#39;ve worked, hell even in general, Mexicans have been the hardest workers and the nicest people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5e4n1", "score_hidden": false, "stickied": false, "created": 1491995658.0, "created_utc": 1491966858.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 93}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg658b0", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "khazhak", "parent_id": "t1_dg5vvr1", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "\"It's the religious beliefs\" is the same type of excuse as \"it's about ethics in game journalism.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;It&amp;#39;s the religious beliefs&amp;quot; is the same type of excuse as &amp;quot;it&amp;#39;s about ethics in game journalism.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg658b0", "score_hidden": false, "stickied": false, "created": 1492044506.0, "created_utc": 1492015706.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vvr1", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "Beastender_Tartine", "parent_id": "t1_dg5oqri", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I think it's interesting to note that the people that dislike Muslims because of their religious beliefs only really seem to dislike the brown ones. Indonesia is heavily Muslim, but people don't seem as racist to them. There are a lot of different Muslims out there, but people really only seem to have a problem with Muslims with certain skin tones and from certain countries. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s interesting to note that the people that dislike Muslims because of their religious beliefs only really seem to dislike the brown ones. Indonesia is heavily Muslim, but people don&amp;#39;t seem as racist to them. There are a lot of different Muslims out there, but people really only seem to have a problem with Muslims with certain skin tones and from certain countries. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5vvr1", "score_hidden": false, "stickied": false, "created": 1492034026.0, "created_utc": 1492005226.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5rp7s", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "TheFuturist47", "parent_id": "t1_dg5oqri", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I think you got downvoted because you seemed to imply that Muslims are disliked categorically because of their religion. Which is actually what you said. I'm not sure if you meant to phrase it differently or what. You're right though people hate the religion, but thats because they never bothered to learn anything about it or meet anyone who practices it.\n\nIslam is like Christianity and Judaism - there are many many interpretations of it, with varying severity, and those interpretations are often steeped in a country or region's particular culture. And just like what happens with Christianity, and has had for centuries, a really gross subset of extremist Muslims is using religion as a political tool. There's nothing inherently wrong with Islam and most Muslims are utterly normal. But people have bought into media scare tactics and fearmongering, and it's sad.   \n\nPeople generalize Islam and stereotype Muslims because of media exposure to terrorists and nightmare stories about places like Saudi, because that is all they ever hear.\n\nEdit: I'm appreciative of everyone who has upvoted this comment... normally when I say anything remotely supportive of Islam or Muslims I get downvoted and argued with.", "edited": 1492011393.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you got downvoted because you seemed to imply that Muslims are disliked categorically because of their religion. Which is actually what you said. I&amp;#39;m not sure if you meant to phrase it differently or what. You&amp;#39;re right though people hate the religion, but thats because they never bothered to learn anything about it or meet anyone who practices it.&lt;/p&gt;\n\n&lt;p&gt;Islam is like Christianity and Judaism - there are many many interpretations of it, with varying severity, and those interpretations are often steeped in a country or region&amp;#39;s particular culture. And just like what happens with Christianity, and has had for centuries, a really gross subset of extremist Muslims is using religion as a political tool. There&amp;#39;s nothing inherently wrong with Islam and most Muslims are utterly normal. But people have bought into media scare tactics and fearmongering, and it&amp;#39;s sad.   &lt;/p&gt;\n\n&lt;p&gt;People generalize Islam and stereotype Muslims because of media exposure to terrorists and nightmare stories about places like Saudi, because that is all they ever hear.&lt;/p&gt;\n\n&lt;p&gt;Edit: I&amp;#39;m appreciative of everyone who has upvoted this comment... normally when I say anything remotely supportive of Islam or Muslims I get downvoted and argued with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5rp7s", "score_hidden": false, "stickied": false, "created": 1492027448.0, "created_utc": 1491998648.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oqri", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Broekn_English", "parent_id": "t1_dg5oo84", "subreddit_name_prefixed": "r/offmychest", "controversiality": 1, "body": "A lot of hatred I see is based on opposition to the religion, but I could be wrong. Either way, I'm not in support of it.\n\n(Off topic: reddit loves to downvote anything that's not a circlejerk)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of hatred I see is based on opposition to the religion, but I could be wrong. Either way, I&amp;#39;m not in support of it.&lt;/p&gt;\n\n&lt;p&gt;(Off topic: reddit loves to downvote anything that&amp;#39;s not a circlejerk)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5oqri", "score_hidden": false, "stickied": false, "created": 1492019917.0, "created_utc": 1491991117.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oo84", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Sjollema", "parent_id": "t1_dg5lfrk", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You're very wrong in saying muslims get shit because of their religious lessons, they get shit because a tiny minority of what can barely be called true muslims are extremist terrorists. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re very wrong in saying muslims get shit because of their religious lessons, they get shit because a tiny minority of what can barely be called true muslims are extremist terrorists. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5oo84", "score_hidden": false, "stickied": false, "created": 1492019698.0, "created_utc": 1491990898.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5lfrk", "gilded": 0, "archived": false, "score": -31, "report_reasons": null, "author": "Broekn_English", "parent_id": "t1_dg59dfq", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I would like to point out that there's a difference between hating **people** and an **ideology**, but I'm not here to imply you meant just the ideas of Islam.\n\nMuslims get a lot of shit, and I know this as an immigrant myself, but that's partly down to their religion's lessons, and I can understand that.\n\nI come from a very Catholic country, and I know how it feels to be judged for belonging to a group of people, but that doesn't stop me from avoiding blind hatred on everyone who says \"I'm not racist, but..\"\n\nHate comes out of fear and perceived threats to people's safety, identity and livelihood. As much as I wish people could safely coexist to solve issues, I sort of empathise with people who hold such views.\n\nSorry for the rant, this is kind of irrelevant anecdotal stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would like to point out that there&amp;#39;s a difference between hating &lt;strong&gt;people&lt;/strong&gt; and an &lt;strong&gt;ideology&lt;/strong&gt;, but I&amp;#39;m not here to imply you meant just the ideas of Islam.&lt;/p&gt;\n\n&lt;p&gt;Muslims get a lot of shit, and I know this as an immigrant myself, but that&amp;#39;s partly down to their religion&amp;#39;s lessons, and I can understand that.&lt;/p&gt;\n\n&lt;p&gt;I come from a very Catholic country, and I know how it feels to be judged for belonging to a group of people, but that doesn&amp;#39;t stop me from avoiding blind hatred on everyone who says &amp;quot;I&amp;#39;m not racist, but..&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Hate comes out of fear and perceived threats to people&amp;#39;s safety, identity and livelihood. As much as I wish people could safely coexist to solve issues, I sort of empathise with people who hold such views.&lt;/p&gt;\n\n&lt;p&gt;Sorry for the rant, this is kind of irrelevant anecdotal stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5lfrk", "score_hidden": false, "stickied": false, "created": 1492009872.0, "created_utc": 1491981072.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -31}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59dfq", "gilded": 0, "archived": false, "score": 207, "report_reasons": null, "author": "TheFuturist47", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Fantastic post. I agree completely. The ignorance surrounding immigrants is just astounding. I get on the same level jag about islamopbobia. Just fucking ignorance. I'm disgusted with the hate in this country. People who get it need to talk about it as much as possible. Good for you OP, thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fantastic post. I agree completely. The ignorance surrounding immigrants is just astounding. I get on the same level jag about islamopbobia. Just fucking ignorance. I&amp;#39;m disgusted with the hate in this country. People who get it need to talk about it as much as possible. Good for you OP, thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg59dfq", "score_hidden": false, "stickied": false, "created": 1491989159.0, "created_utc": 1491960359.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 207}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg65rvx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "khazhak", "parent_id": "t1_dg5i19d", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "There's a donut shop near me, part of a chain, but it's \"family run\" and only two employees speak English fluently. One lovely woman confuses red for blue and vise versa.\n\nI wouldn't call them friendly (quite honestly they're never too happy to see me since most of their clientele speaks Spanish but I don't), but if they get my order right they look so dang proud of themselves. If they turn out to be here illegally and get run off for some white dropouts with terrible attitudes and drug problems like my local Subway, I would be very upset.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a donut shop near me, part of a chain, but it&amp;#39;s &amp;quot;family run&amp;quot; and only two employees speak English fluently. One lovely woman confuses red for blue and vise versa.&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t call them friendly (quite honestly they&amp;#39;re never too happy to see me since most of their clientele speaks Spanish but I don&amp;#39;t), but if they get my order right they look so dang proud of themselves. If they turn out to be here illegally and get run off for some white dropouts with terrible attitudes and drug problems like my local Subway, I would be very upset.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg65rvx", "score_hidden": false, "stickied": false, "created": 1492045073.0, "created_utc": 1492016273.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5i19d", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "ac3dsthrowaway", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I can't speak for any Mexican's work ethic because I've never worked with them. But down the street from my job there is a mexican restaurant. We all park in the same parking lot and get there at the same time. Every single day they wave at me and smile and say things like \"good morning! Beautiful day!\" Most of them speak very little English--but here they are just spreading happiness. And it makes my heart smile every time. \n\nI have heard that most of them that work there are illegal immigrants and that they are paid under the table. I hope every day that no one turns them in and the business gets shut down. This happened to another Mexican restaurant in my town a few years back. It makes me sad. These people are just like me and you. And my ancestors certainly didn't come here 'legally'. My father's ancestors came in 1736--so I'm 100% sure they probably took what wasn't theirs at one point or another. But for some reason, as Americans, we feel *entitled*. We feel we *earned* what we stole and that anyone else who tries is just trying to take something away from us. Imagine that.... people taking away from those who took everything they have away from others. And that's IF they are taking things away--most of them aren't because no one wants to do a lot of the jobs they take just to feed their families.\n\nIt's sad. Really sad. And it hurts my heart to see how horrible we are in this country to people who are from \"the outside\". As if they are somehow a different species that doesn't belong. *We* are the monsters, not them. *We* need to fix ourselves and our country instead of blaming our problems on people who have no stake in the game.\n\nThanks for sharing--good luck to your Dad. He sounds like a really great guy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t speak for any Mexican&amp;#39;s work ethic because I&amp;#39;ve never worked with them. But down the street from my job there is a mexican restaurant. We all park in the same parking lot and get there at the same time. Every single day they wave at me and smile and say things like &amp;quot;good morning! Beautiful day!&amp;quot; Most of them speak very little English--but here they are just spreading happiness. And it makes my heart smile every time. &lt;/p&gt;\n\n&lt;p&gt;I have heard that most of them that work there are illegal immigrants and that they are paid under the table. I hope every day that no one turns them in and the business gets shut down. This happened to another Mexican restaurant in my town a few years back. It makes me sad. These people are just like me and you. And my ancestors certainly didn&amp;#39;t come here &amp;#39;legally&amp;#39;. My father&amp;#39;s ancestors came in 1736--so I&amp;#39;m 100% sure they probably took what wasn&amp;#39;t theirs at one point or another. But for some reason, as Americans, we feel &lt;em&gt;entitled&lt;/em&gt;. We feel we &lt;em&gt;earned&lt;/em&gt; what we stole and that anyone else who tries is just trying to take something away from us. Imagine that.... people taking away from those who took everything they have away from others. And that&amp;#39;s IF they are taking things away--most of them aren&amp;#39;t because no one wants to do a lot of the jobs they take just to feed their families.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s sad. Really sad. And it hurts my heart to see how horrible we are in this country to people who are from &amp;quot;the outside&amp;quot;. As if they are somehow a different species that doesn&amp;#39;t belong. &lt;em&gt;We&lt;/em&gt; are the monsters, not them. &lt;em&gt;We&lt;/em&gt; need to fix ourselves and our country instead of blaming our problems on people who have no stake in the game.&lt;/p&gt;\n\n&lt;p&gt;Thanks for sharing--good luck to your Dad. He sounds like a really great guy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5i19d", "score_hidden": false, "stickied": false, "created": 1492002173.0, "created_utc": 1491973373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg64qn0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "srarky", "parent_id": "t1_dg5ucz2", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I love that, haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love that, haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg64qn0", "score_hidden": false, "stickied": false, "created": 1492044000.0, "created_utc": 1492015200.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ucz2", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "crusadingAquila", "parent_id": "t1_dg58u5v", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "There's a sticker on a lamppost near me that says \"Illegal immigration started with Columbus\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a sticker on a lamppost near me that says &amp;quot;Illegal immigration started with Columbus&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5ucz2", "score_hidden": false, "stickied": false, "created": 1492031932.0, "created_utc": 1492003132.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58u5v", "gilded": 0, "archived": false, "score": 107, "report_reasons": null, "author": "srarky", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This really speaks to me. The level of ignorance and hatred against our fellow human beings is disgusting. \n\nMy brothers girlfriend is an illegal immigrant from Asia. She's one of the sweetest people I know. She works hard and puts herself through college, and gives money to her parents as well. She's a wonderful sister, and if there's one girl I'd want to be my SIL, it'd be her. \n\nAnd then there's all these people talking all sorts of trash about illegal immigrants. They aren't lazy. They came here to work, to give a better life to their children. They take the jobs no one else wants. They do this to SURVIVE, while so many privileged people sit on their asses and whine and complain about them. People like Donald Trump disgust me. Immigrants are just like us. \n\nAnd anyway, would they call the European immigration legal? Murdering thousands of people and stealing their home is legal? It just enrages me how people can say such awful, ignorant things against other human beings. We're all human, we all go through the same struggles and the same experiences, so why does being an immigrant make them any different? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This really speaks to me. The level of ignorance and hatred against our fellow human beings is disgusting. &lt;/p&gt;\n\n&lt;p&gt;My brothers girlfriend is an illegal immigrant from Asia. She&amp;#39;s one of the sweetest people I know. She works hard and puts herself through college, and gives money to her parents as well. She&amp;#39;s a wonderful sister, and if there&amp;#39;s one girl I&amp;#39;d want to be my SIL, it&amp;#39;d be her. &lt;/p&gt;\n\n&lt;p&gt;And then there&amp;#39;s all these people talking all sorts of trash about illegal immigrants. They aren&amp;#39;t lazy. They came here to work, to give a better life to their children. They take the jobs no one else wants. They do this to SURVIVE, while so many privileged people sit on their asses and whine and complain about them. People like Donald Trump disgust me. Immigrants are just like us. &lt;/p&gt;\n\n&lt;p&gt;And anyway, would they call the European immigration legal? Murdering thousands of people and stealing their home is legal? It just enrages me how people can say such awful, ignorant things against other human beings. We&amp;#39;re all human, we all go through the same struggles and the same experiences, so why does being an immigrant make them any different? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg58u5v", "score_hidden": false, "stickied": false, "created": 1491988480.0, "created_utc": 1491959680.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 107}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg6e9h5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheYellowRose", "parent_id": "t1_dg5lcy5", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "no slurs, even in spanish", "edited": 1492025972.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no slurs, even in spanish&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6e9h5", "score_hidden": false, "stickied": false, "created": 1492053732.0, "created_utc": 1492024932.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5lcy5", "gilded": 0, "archived": false, "score": 59, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": 1491981245.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5lcy5", "score_hidden": false, "stickied": false, "created": 1492009656.0, "created_utc": 1491980856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 59}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5exrx", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "icantenglishtoday", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Dude. For real, from the bottom of my heart, thank you. It's people like you and your father who help make things better for all of the hard working immigrants in this country. It is so huge for a white person to really know about immigrants on a real level and not just what they say on Fox News. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude. For real, from the bottom of my heart, thank you. It&amp;#39;s people like you and your father who help make things better for all of the hard working immigrants in this country. It is so huge for a white person to really know about immigrants on a real level and not just what they say on Fox News. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5exrx", "score_hidden": false, "stickied": false, "created": 1491996875.0, "created_utc": 1491968075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg58ydy", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "BiffDangles80", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Fuckin A man. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuckin A man. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg58ydy", "score_hidden": false, "stickied": false, "created": 1491988631.0, "created_utc": 1491959831.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg62ne7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Justice_Man", "parent_id": "t1_dg5tq6z", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thanks a ton. The fact that this resonates with you means so much to me. That's why I typed it all up. \n  \nJust. Thanks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks a ton. The fact that this resonates with you means so much to me. That&amp;#39;s why I typed it all up. &lt;/p&gt;\n\n&lt;p&gt;Just. Thanks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg62ne7", "score_hidden": false, "stickied": false, "created": 1492041788.0, "created_utc": 1492012988.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tq6z", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Wjb97", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "We live in a pretty shitty world. And our country is far from perfect. But god damn, it would be a fucking shit hole of it weren't for people like your dad, or those guys working with him. \n\nLike you said, no one wants to work those jobs. They're hard work, little pay, little respect from other people. No one is clambering to live that life. But the people who suck it up and do those jobs are the ones that make this country a working one. The sad thing is how they're also completely dicked over. They're not making extreme amounts of money, but they're still giving a shit ton of their pay check to the government who couldn't give two fucks about them. \n\nAnd for the immigrants coming over to work, legal or not. They help just as much as any other working person. They're doing a job. They're providing for a family. They're trying to survive. They're just like anyone else. If you're so hurt that they're \"taking jobs\" why don't you get off your ass and go dig out septic tanks, why don't you go and do roofing in the middle of summer or the dead of winter? You're not going to though because it's hard and pretty shitty work. These guys are the fucking back bone of our country. Help and respect them. We're all in this together! \n\nI'm glad you see how fucked it is and I hope you're willing to continue treating everyone with respect regardless of who they are or what they do. Get your dad a beer (if he drinks) he deserves it man. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We live in a pretty shitty world. And our country is far from perfect. But god damn, it would be a fucking shit hole of it weren&amp;#39;t for people like your dad, or those guys working with him. &lt;/p&gt;\n\n&lt;p&gt;Like you said, no one wants to work those jobs. They&amp;#39;re hard work, little pay, little respect from other people. No one is clambering to live that life. But the people who suck it up and do those jobs are the ones that make this country a working one. The sad thing is how they&amp;#39;re also completely dicked over. They&amp;#39;re not making extreme amounts of money, but they&amp;#39;re still giving a shit ton of their pay check to the government who couldn&amp;#39;t give two fucks about them. &lt;/p&gt;\n\n&lt;p&gt;And for the immigrants coming over to work, legal or not. They help just as much as any other working person. They&amp;#39;re doing a job. They&amp;#39;re providing for a family. They&amp;#39;re trying to survive. They&amp;#39;re just like anyone else. If you&amp;#39;re so hurt that they&amp;#39;re &amp;quot;taking jobs&amp;quot; why don&amp;#39;t you get off your ass and go dig out septic tanks, why don&amp;#39;t you go and do roofing in the middle of summer or the dead of winter? You&amp;#39;re not going to though because it&amp;#39;s hard and pretty shitty work. These guys are the fucking back bone of our country. Help and respect them. We&amp;#39;re all in this together! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad you see how fucked it is and I hope you&amp;#39;re willing to continue treating everyone with respect regardless of who they are or what they do. Get your dad a beer (if he drinks) he deserves it man. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5tq6z", "score_hidden": false, "stickied": false, "created": 1492030970.0, "created_utc": 1492002170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5jpgo", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "Heydudeinspace", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It's simple. The first Americans who came here were explorers and built the foundations of America. They shed sweat and blood to make America the industrial hub of the world. Great economies bring great comforts with it. Comfort brings out entitlement. The economy post-WWII was unique in the sense that other industrial powers were fatigued. We had free reign.\n\nThe people you talk about just want someone to blame for their failures. There's no way around it. They want the jobs that the unique economy post-WWII created for their parents and grandparents, but it's simply NO LONGER THERE, but it's not their fault that they didn't keep with the times or have basic knowledge of how the economy work -- no -- it's because of that Mexican who works a job they won't do.\n\nI am an immigrant who has an engineering degree (electro-mechanical). I have managed to pass all the board engineering tests (including the licensing test), and going back to school to pursue a masters degree (couldn't find a job due to lack of internships), and I worked as a **dishwasher** when I first got here in the US. I have friends with high-school diplomas to show for themselves who have told me straight that they aren't willing to dish wash or dig up ditches (after months of being unemployed).\n\nThose people want $25 union jobs with a high-school diploma. Those jobs are simply gone because of automation and globalization. The market is much more competitive now. You get an education (a decent one with a good degree) and hope that you get hired.", "edited": 1491978311.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s simple. The first Americans who came here were explorers and built the foundations of America. They shed sweat and blood to make America the industrial hub of the world. Great economies bring great comforts with it. Comfort brings out entitlement. The economy post-WWII was unique in the sense that other industrial powers were fatigued. We had free reign.&lt;/p&gt;\n\n&lt;p&gt;The people you talk about just want someone to blame for their failures. There&amp;#39;s no way around it. They want the jobs that the unique economy post-WWII created for their parents and grandparents, but it&amp;#39;s simply NO LONGER THERE, but it&amp;#39;s not their fault that they didn&amp;#39;t keep with the times or have basic knowledge of how the economy work -- no -- it&amp;#39;s because of that Mexican who works a job they won&amp;#39;t do.&lt;/p&gt;\n\n&lt;p&gt;I am an immigrant who has an engineering degree (electro-mechanical). I have managed to pass all the board engineering tests (including the licensing test), and going back to school to pursue a masters degree (couldn&amp;#39;t find a job due to lack of internships), and I worked as a &lt;strong&gt;dishwasher&lt;/strong&gt; when I first got here in the US. I have friends with high-school diplomas to show for themselves who have told me straight that they aren&amp;#39;t willing to dish wash or dig up ditches (after months of being unemployed).&lt;/p&gt;\n\n&lt;p&gt;Those people want $25 union jobs with a high-school diploma. Those jobs are simply gone because of automation and globalization. The market is much more competitive now. You get an education (a decent one with a good degree) and hope that you get hired.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5jpgo", "score_hidden": false, "stickied": false, "created": 1492005555.0, "created_utc": 1491976755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5yst8", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "plz2meatyu", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "&gt;Oh, so, it's because \"they take our jobs??\"\n\nI watched a Vice news report on farming in CA last night.  It said farmers can't get help.  For a variety of reasons, one of which was more people staying *in Mexico* due to jobs and a better social safety net.  One farmer couldn't pick their fruit last year due to lack of farm hands.  Another farmer is raising wages 20% to keep his farmhands, whether documented or not, because they will be poached.  \n\nBut Mexicans are taking white people's jerbs! No, they are not, you just don't want Mexicans to have those jobs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Oh, so, it&amp;#39;s because &amp;quot;they take our jobs??&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I watched a Vice news report on farming in CA last night.  It said farmers can&amp;#39;t get help.  For a variety of reasons, one of which was more people staying &lt;em&gt;in Mexico&lt;/em&gt; due to jobs and a better social safety net.  One farmer couldn&amp;#39;t pick their fruit last year due to lack of farm hands.  Another farmer is raising wages 20% to keep his farmhands, whether documented or not, because they will be poached.  &lt;/p&gt;\n\n&lt;p&gt;But Mexicans are taking white people&amp;#39;s jerbs! No, they are not, you just don&amp;#39;t want Mexicans to have those jobs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5yst8", "score_hidden": false, "stickied": false, "created": 1492037539.0, "created_utc": 1492008739.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg66uy5", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "gravitationaltim", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I worked with a Peruvian man at a coffee shop. They had him working bake and dishes because his English wasn't great, but he spoke well enough that he wasn't hard to work with. He was always so nice and never complained even though fast food is shitty work (Tim Hortons), and all the other employees were kids in school that would always only last a month or two before leaving. Or drug addicts. It's not like it was a fun job, but he was the only one of us who never complained. \n\nMy boyfriend spoke good Spanish, so they became friends since they could communicate better. He figures out that this guy is print himself through college and stoppering hours family back home in hopes of moving them here some day. Boyfriend helps him sign up for FAFSA and the guy is soooooo happy, it saves him a bunch of money. He invites bf over for some beers and talk about life. \n\nI hope he's doing well. Hard workers like that, genuine good people, I want my country to be somewhere where people like that can live and thrive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I worked with a Peruvian man at a coffee shop. They had him working bake and dishes because his English wasn&amp;#39;t great, but he spoke well enough that he wasn&amp;#39;t hard to work with. He was always so nice and never complained even though fast food is shitty work (Tim Hortons), and all the other employees were kids in school that would always only last a month or two before leaving. Or drug addicts. It&amp;#39;s not like it was a fun job, but he was the only one of us who never complained. &lt;/p&gt;\n\n&lt;p&gt;My boyfriend spoke good Spanish, so they became friends since they could communicate better. He figures out that this guy is print himself through college and stoppering hours family back home in hopes of moving them here some day. Boyfriend helps him sign up for FAFSA and the guy is soooooo happy, it saves him a bunch of money. He invites bf over for some beers and talk about life. &lt;/p&gt;\n\n&lt;p&gt;I hope he&amp;#39;s doing well. Hard workers like that, genuine good people, I want my country to be somewhere where people like that can live and thrive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg66uy5", "score_hidden": false, "stickied": false, "created": 1492046178.0, "created_utc": 1492017378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg69420", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "thealphateam", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "When my father in law died a couple of his old employees came in to pay their respects. One was a guy from Latin America and told his story. My FIL asked the foreman a complex question and he said \"Just a minute\", ran to talk to someone and came back with the answer. 4 or 5 times this happened over the course of a couple days and my FIL finally asked what he was doing. \"I had to go ask Miguel for the answer\", to which my FIL said \"Why am I paying you when he has all the answers?\". And promptly promoted the guy and kept on doing it for  years. My FIL had retired 15 years before he died that that guy remembered when someone treated him for his hard work. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When my father in law died a couple of his old employees came in to pay their respects. One was a guy from Latin America and told his story. My FIL asked the foreman a complex question and he said &amp;quot;Just a minute&amp;quot;, ran to talk to someone and came back with the answer. 4 or 5 times this happened over the course of a couple days and my FIL finally asked what he was doing. &amp;quot;I had to go ask Miguel for the answer&amp;quot;, to which my FIL said &amp;quot;Why am I paying you when he has all the answers?&amp;quot;. And promptly promoted the guy and kept on doing it for  years. My FIL had retired 15 years before he died that that guy remembered when someone treated him for his hard work. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg69420", "score_hidden": false, "stickied": false, "created": 1492048432.0, "created_utc": 1492019632.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg58pev", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Perrone123", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "What a man he is. A true samaritan thank you  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a man he is. A true samaritan thank you  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg58pev", "score_hidden": false, "stickied": false, "created": 1491988310.0, "created_utc": 1491959510.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5gor4", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "tvreverie", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "wow thank you so much for sharing this. i couldn't agree more. i hope at least one person reads this and rethinks their stance on immigration. well said.. this deserves so many more upvotes than it has", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;wow thank you so much for sharing this. i couldn&amp;#39;t agree more. i hope at least one person reads this and rethinks their stance on immigration. well said.. this deserves so many more upvotes than it has&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5gor4", "score_hidden": false, "stickied": false, "created": 1491999726.0, "created_utc": 1491970926.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5qjds", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "LadyGrizabella", "parent_id": "t1_dg5q544", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's essentially what a coworker (who is here on a permanent resident visa) and I said the other day. Shitty jobs that white people are too proud to take or don't want because they're considered 'low class' or 'beneath them'--immigrants will take those jobs all damn day long.\n\nMy coworker is afraid to go back to Monterrey (which she usually does every summer for a few weeks) because she's afraid she won't be able to come back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s essentially what a coworker (who is here on a permanent resident visa) and I said the other day. Shitty jobs that white people are too proud to take or don&amp;#39;t want because they&amp;#39;re considered &amp;#39;low class&amp;#39; or &amp;#39;beneath them&amp;#39;--immigrants will take those jobs all damn day long.&lt;/p&gt;\n\n&lt;p&gt;My coworker is afraid to go back to Monterrey (which she usually does every summer for a few weeks) because she&amp;#39;s afraid she won&amp;#39;t be able to come back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5qjds", "score_hidden": false, "stickied": false, "created": 1492024938.0, "created_utc": 1491996138.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5q544", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "InfamousCthulu", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Don't take this the wrong way op, I have nothing but respect for your father and anyone who does manual labor. But on the whole \"they're taking our jobs\" bullshit, nobody wants those shitty jobs for the most part. The people that do work those jobs are typically immigrants. You want to cripple the South West economy. Kick the immigrants out, because no one else will do their jobs for the bullshit wages they get paid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t take this the wrong way op, I have nothing but respect for your father and anyone who does manual labor. But on the whole &amp;quot;they&amp;#39;re taking our jobs&amp;quot; bullshit, nobody wants those shitty jobs for the most part. The people that do work those jobs are typically immigrants. You want to cripple the South West economy. Kick the immigrants out, because no one else will do their jobs for the bullshit wages they get paid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5q544", "score_hidden": false, "stickied": false, "created": 1492023964.0, "created_utc": 1491995164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5ulyo", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "__Danimal__", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I once work at a deli for a while, we actually had a couple folks Guatemala who spoke very little english but the conversations we had always went like this:\n\n\"Mucho trabajo?\"\n\"Si, Si\"\n\"Mucho dinero??\"\n\"No...\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I once work at a deli for a while, we actually had a couple folks Guatemala who spoke very little english but the conversations we had always went like this:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Mucho trabajo?&amp;quot;\n&amp;quot;Si, Si&amp;quot;\n&amp;quot;Mucho dinero??&amp;quot;\n&amp;quot;No...&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5ulyo", "score_hidden": false, "stickied": false, "created": 1492032292.0, "created_utc": 1492003492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg68vkv", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ke1ly", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Ugh, I completely agree. I hate the entitlement I see all around me.. The only entitlement I wouldn't mind seeing is from Native Americans. Everyone else needs a reality check. The immigrants I know are some of the hardest working people I know. The fact that they gather at the local Home Depots begging for WORK while I see non immigrants on corners begging for MONEY says a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh, I completely agree. I hate the entitlement I see all around me.. The only entitlement I wouldn&amp;#39;t mind seeing is from Native Americans. Everyone else needs a reality check. The immigrants I know are some of the hardest working people I know. The fact that they gather at the local Home Depots begging for WORK while I see non immigrants on corners begging for MONEY says a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg68vkv", "score_hidden": false, "stickied": false, "created": 1492048193.0, "created_utc": 1492019393.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg6bfhf", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Onatu", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Your father is an exemplary human being.  He treated people like people and worked his butt off to provide for his family, just like immigrants do each day.  That's something to be proud of your old man for.  I only wish the majority of people would wake up and realize the lazy ones are the people comfortably living in riches, not these people that work to exhaustion, putting in longer hours and harder labor than most of us would even dare.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your father is an exemplary human being.  He treated people like people and worked his butt off to provide for his family, just like immigrants do each day.  That&amp;#39;s something to be proud of your old man for.  I only wish the majority of people would wake up and realize the lazy ones are the people comfortably living in riches, not these people that work to exhaustion, putting in longer hours and harder labor than most of us would even dare.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6bfhf", "score_hidden": false, "stickied": false, "created": 1492050805.0, "created_utc": 1492022005.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5gzx8", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "JackalopesExist", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I wish everyone would see this post. People who complain about immigrants fail to realize they're human just like any of the rest of us :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish everyone would see this post. People who complain about immigrants fail to realize they&amp;#39;re human just like any of the rest of us :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5gzx8", "score_hidden": false, "stickied": false, "created": 1492000272.0, "created_utc": 1491971472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5et16", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "wickly95", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This exact perspective is how I showed my husband that they're not the bad people that his family convinced them to be. \n\nThank you. I hope people see this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This exact perspective is how I showed my husband that they&amp;#39;re not the bad people that his family convinced them to be. &lt;/p&gt;\n\n&lt;p&gt;Thank you. I hope people see this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5et16", "score_hidden": false, "stickied": false, "created": 1491996673.0, "created_utc": 1491967873.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5ep7d", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "SuckMyAssmar", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This is a really powerful post. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a really powerful post. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5ep7d", "score_hidden": false, "stickied": false, "created": 1491996511.0, "created_utc": 1491967711.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5df6l", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "248_RPA", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Well said.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well said.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5df6l", "score_hidden": false, "stickied": false, "created": 1491994639.0, "created_utc": 1491965839.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5jw48", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "the_crustybastard", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This is a beautiful tribute to your father, and a splendid explanation how decency and respect is how we'll really make America great again.\n\nBecause right now, we're just dumb and racist as fuck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a beautiful tribute to your father, and a splendid explanation how decency and respect is how we&amp;#39;ll really make America great again.&lt;/p&gt;\n\n&lt;p&gt;Because right now, we&amp;#39;re just dumb and racist as fuck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5jw48", "score_hidden": false, "stickied": false, "created": 1492005989.0, "created_utc": 1491977189.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5pjj7", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "121mhz", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Nice post.  I can, honestly, tell you I don't think it has anything to do with real people like your dad.  The hatred for \"Mexicans\" (which often includes anyone south of that shitty rIver you speak of), muslims, or anyone else who wasn't born here has little to do with actual people and much more to do with politicians wanting to get elected.  Look back in history and you'll see that most world leaders get to that position but motivating the masses AGAINST a group.  Find a group of people, give them something to hate and they'll let you be their leader.  Americans just aren't smart enough to realize that's what's happening.\n\n(and no, I'm not just talking about the President, most senators, congressmen, and state representatives use the same tactic.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice post.  I can, honestly, tell you I don&amp;#39;t think it has anything to do with real people like your dad.  The hatred for &amp;quot;Mexicans&amp;quot; (which often includes anyone south of that shitty rIver you speak of), muslims, or anyone else who wasn&amp;#39;t born here has little to do with actual people and much more to do with politicians wanting to get elected.  Look back in history and you&amp;#39;ll see that most world leaders get to that position but motivating the masses AGAINST a group.  Find a group of people, give them something to hate and they&amp;#39;ll let you be their leader.  Americans just aren&amp;#39;t smart enough to realize that&amp;#39;s what&amp;#39;s happening.&lt;/p&gt;\n\n&lt;p&gt;(and no, I&amp;#39;m not just talking about the President, most senators, congressmen, and state representatives use the same tactic.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5pjj7", "score_hidden": false, "stickied": false, "created": 1492022327.0, "created_utc": 1491993527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg6d6jw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mijnkalverliefde", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "In Canada I haven't met many Mexican or Latinos but I hate it when people say \"they're stealing our jobs.\" Please tell me how much you want to be a housekeeper, cook or day laborer ? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In Canada I haven&amp;#39;t met many Mexican or Latinos but I hate it when people say &amp;quot;they&amp;#39;re stealing our jobs.&amp;quot; Please tell me how much you want to be a housekeeper, cook or day laborer ? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6d6jw", "score_hidden": false, "stickied": false, "created": 1492052615.0, "created_utc": 1492023815.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5fqkg", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "eggsbachs", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Fuck yes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck yes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5fqkg", "score_hidden": false, "stickied": false, "created": 1491998139.0, "created_utc": 1491969339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5sx00", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "csgirlta971", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "From the bottom of my heart, thank you so much for this!!! My mom and dad worked illegally as dishwashers for horrible hours just to save enough money for me to go to school. My heart breaks every time I saw them going home late at night with their hands shaking. They lost a lot of weight. They are doing better now but I cannot forget how we use to be in poverty and struggle like crazy and constantly feeling very ashamed for being immigrants. I got into a good college with full scholarship now and I can never thank them enough for  helping me with food and rent. I dream for a world where people wouldn't be hated or treated as second class citizens for simply trying to survive and helping their sons and daughters to be the first in the family to receive higher education. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From the bottom of my heart, thank you so much for this!!! My mom and dad worked illegally as dishwashers for horrible hours just to save enough money for me to go to school. My heart breaks every time I saw them going home late at night with their hands shaking. They lost a lot of weight. They are doing better now but I cannot forget how we use to be in poverty and struggle like crazy and constantly feeling very ashamed for being immigrants. I got into a good college with full scholarship now and I can never thank them enough for  helping me with food and rent. I dream for a world where people wouldn&amp;#39;t be hated or treated as second class citizens for simply trying to survive and helping their sons and daughters to be the first in the family to receive higher education. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5sx00", "score_hidden": false, "stickied": false, "created": 1492029672.0, "created_utc": 1492000872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5r1oq", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "cgsur", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "The purpose of the wall is to milk money through kickbacks. \n\nBy thieves to steal from the needy, because that is the where the money is coming from. \n\n\nAnyone backing that stuff is a thief stealing from the needy to buy luxury items.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The purpose of the wall is to milk money through kickbacks. &lt;/p&gt;\n\n&lt;p&gt;By thieves to steal from the needy, because that is the where the money is coming from. &lt;/p&gt;\n\n&lt;p&gt;Anyone backing that stuff is a thief stealing from the needy to buy luxury items.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5r1oq", "score_hidden": false, "stickied": false, "created": 1492026088.0, "created_utc": 1491997288.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg61qfg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "voyagedufou", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I wish I could have a father figure like him... I really wish.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could have a father figure like him... I really wish.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg61qfg", "score_hidden": false, "stickied": false, "created": 1492040797.0, "created_utc": 1492011997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg6dp28", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "xseiber", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This post needs more likes and views. Spot-on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post needs more likes and views. Spot-on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6dp28", "score_hidden": false, "stickied": false, "created": 1492053149.0, "created_utc": 1492024349.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg6eji7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "m_nieto", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Just wanted to say thank you for writing this.  It can be hard hearing that only Mexicans are here illegally and they are all criminals.  Even though I know most people do not think this way it can be very taxing hearing people shout out stereotypes like they are solid fact.  So once again thank you, much love to you and your hard working dad.  \n  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just wanted to say thank you for writing this.  It can be hard hearing that only Mexicans are here illegally and they are all criminals.  Even though I know most people do not think this way it can be very taxing hearing people shout out stereotypes like they are solid fact.  So once again thank you, much love to you and your hard working dad.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6eji7", "score_hidden": false, "stickied": false, "created": 1492054024.0, "created_utc": 1492025224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5nlnv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Isa_belle_", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you for sharing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for sharing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5nlnv", "score_hidden": false, "stickied": false, "created": 1492016311.0, "created_utc": 1491987511.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5o041", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "larhavoc", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you for sharing this. Thank you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for sharing this. Thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5o041", "score_hidden": false, "stickied": false, "created": 1492017602.0, "created_utc": 1491988802.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5odgs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ants46", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Great post, thank you for sharing it. So many people need to hear this and understand that all any of us want is the opportunity to build our lives, to live, work and contribute in dignity and respect. Our society is so much stronger for the richness of experience, culture and diversity that immigration brings. Your Dad sounds like such an amazing guy, please pass on my thanks for all his hard work &amp; for being such a decent man to those that worked for him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post, thank you for sharing it. So many people need to hear this and understand that all any of us want is the opportunity to build our lives, to live, work and contribute in dignity and respect. Our society is so much stronger for the richness of experience, culture and diversity that immigration brings. Your Dad sounds like such an amazing guy, please pass on my thanks for all his hard work &amp;amp; for being such a decent man to those that worked for him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5odgs", "score_hidden": false, "stickied": false, "created": 1492018764.0, "created_utc": 1491989964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg6ayv7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg68w99", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6ayv7", "score_hidden": false, "stickied": false, "created": 1492050335.0, "created_utc": 1492021535.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg6a1ek", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg69tbp", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6a1ek", "score_hidden": false, "stickied": false, "created": 1492049384.0, "created_utc": 1492020584.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69tbp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6995x", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg69tbp", "score_hidden": false, "stickied": false, "created": 1492049151.0, "created_utc": 1492020351.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6995x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg68w99", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6995x", "score_hidden": false, "stickied": false, "created": 1492048576.0, "created_utc": 1492019776.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68w99", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg68l8z", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg68w99", "score_hidden": false, "stickied": false, "created": 1492048211.0, "created_utc": 1492019411.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68l8z", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg688y8", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg68l8z", "score_hidden": false, "stickied": false, "created": 1492047908.0, "created_utc": 1492019108.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg688y8", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg652fz", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": 1492020488.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg688y8", "score_hidden": false, "stickied": false, "created": 1492047566.0, "created_utc": 1492018766.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg652fz", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg61v6e", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": 1492015728.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg652fz", "score_hidden": false, "stickied": false, "created": 1492044337.0, "created_utc": 1492015537.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61v6e", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5tkve", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg61v6e", "score_hidden": false, "stickied": false, "created": 1492040942.0, "created_utc": 1492012142.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg67xga", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg663rs", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": 1492018880.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg67xga", "score_hidden": false, "stickied": false, "created": 1492047243.0, "created_utc": 1492018443.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg663rs", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5tkve", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg663rs", "score_hidden": false, "stickied": false, "created": 1492045408.0, "created_utc": 1492016608.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tkve", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 1, "body": "[removed]", "edited": 1492002178.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5tkve", "score_hidden": false, "stickied": false, "created": 1492030736.0, "created_utc": 1492001936.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg65m2x", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "myballsyourchin", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 1, "body": "You're romanticising the issue a bit here. It is true that there are good people both legally and illegally who've immigrated to this country. The subset of people you're describing who are willing to do demanding work doesn't necessarily represent the group as a whole. I live in a place that has seen a huge demographic change in the last couple of decades due to mass immigration, having lived here since the early 90s I can tell you it isn't all good.  \n\nCrime and poverty have increased, and the overall culture has shifted quite a bit here. People often seem to forget (and some look the other way) about the negative effects on the people already living here, and that's a shame because it further polarizes the issue. There are people who've been murdered/robbed/etc etc in my county by people who are illegal immigrants, but no one on the other side of the immigration argument seems to care about it. I personally know people who've had crimes committed against them and their families by immigrants. If you pretend that it's just an issue of good people wanting better lives, you're being disingenuous or just ignorant of the truth of the matter. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re romanticising the issue a bit here. It is true that there are good people both legally and illegally who&amp;#39;ve immigrated to this country. The subset of people you&amp;#39;re describing who are willing to do demanding work doesn&amp;#39;t necessarily represent the group as a whole. I live in a place that has seen a huge demographic change in the last couple of decades due to mass immigration, having lived here since the early 90s I can tell you it isn&amp;#39;t all good.  &lt;/p&gt;\n\n&lt;p&gt;Crime and poverty have increased, and the overall culture has shifted quite a bit here. People often seem to forget (and some look the other way) about the negative effects on the people already living here, and that&amp;#39;s a shame because it further polarizes the issue. There are people who&amp;#39;ve been murdered/robbed/etc etc in my county by people who are illegal immigrants, but no one on the other side of the immigration argument seems to care about it. I personally know people who&amp;#39;ve had crimes committed against them and their families by immigrants. If you pretend that it&amp;#39;s just an issue of good people wanting better lives, you&amp;#39;re being disingenuous or just ignorant of the truth of the matter. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg65m2x", "score_hidden": false, "stickied": false, "created": 1492044906.0, "created_utc": 1492016106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64u7np", "likes": null, "replies": "", "user_reports": [], "id": "dg5m1sz", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "iamtoastshayna69", "parent_id": "t3_64u7np", "subreddit_name_prefixed": "r/offmychest", "controversiality": 1, "body": "This makes me hate that I live in an area with little to no immigrants. I want nothing more than to be like your father. I love everyone, I LOVE other cultures. It is almost an obsession for me. Sure I have a hard time understanding people with english as a second language sometimes, (I also have a hard time understanding people with a strong southern drawl too, is it is not only people from other countries) I work in customer service and if an immigrant was to get hired. I'd be more upset at my boss for hiring someone else when I already don't get enough hours. But I wouldn't be upset at the person trying to make a life for themselves or their families. I've never understood this whole hatred against immigrants. I did a DNA test not too long ago. Every part of my blood is from Europe (And 1% from the Iran/Iraq area) This means 100% of my ancestors are immigrants. Why would I get mad at people for trying to have the life I have (However shitty it may be)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This makes me hate that I live in an area with little to no immigrants. I want nothing more than to be like your father. I love everyone, I LOVE other cultures. It is almost an obsession for me. Sure I have a hard time understanding people with english as a second language sometimes, (I also have a hard time understanding people with a strong southern drawl too, is it is not only people from other countries) I work in customer service and if an immigrant was to get hired. I&amp;#39;d be more upset at my boss for hiring someone else when I already don&amp;#39;t get enough hours. But I wouldn&amp;#39;t be upset at the person trying to make a life for themselves or their families. I&amp;#39;ve never understood this whole hatred against immigrants. I did a DNA test not too long ago. Every part of my blood is from Europe (And 1% from the Iran/Iraq area) This means 100% of my ancestors are immigrants. Why would I get mad at people for trying to have the life I have (However shitty it may be)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5m1sz", "score_hidden": false, "stickied": false, "created": 1492011578.0, "created_utc": 1491982778.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]