[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Where to begin? I&amp;#39;m not looking for attention or rescue, I&amp;#39;m writing this to finally get everything out, and with no one to talk to, having never fit in anywhere at all, I want to finally say things I&amp;#39;ve never been able. So this WILL be long, as it&amp;#39;s the last bit of communication I intend on having.&lt;/p&gt;\n\n&lt;p&gt;On Thursday evening, I will kill myself. I&amp;#39;ve several dozen Pristiq tabs saved up (antidepressant, go figure) and will take them all. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 25 and I have no job, no money, am nearly homeless and entirely alone. I&amp;#39;ve tried so many times throughout the years to hold pieces of my life together and yet have never had any success. My father left when I was 4, I remember the day vividly, it&amp;#39;s my first memory. He was strangling my mother in the kitchen, having just punched through the wall, and I knocked over the gate separating the living room from the kitchen and yelled at him to, in my mother&amp;#39;s recollection, &amp;quot;leave my mom alone.&amp;quot; He turned around and punched me in the face, rearranging my upper pallet for life. He fled, she called the cops, and it was over. Then my mother met my future stepfather about 2 years later, and so she began to manipulate me and force me to visit my father on the weekends so that she could go on dates with my stepfather. Cue years of further physical, sexual and emotional/psychological abuse, during which I had terrible behavioural troubles in school my mother claimed not to know the causation of, painting herself to faculty and therapists as the victim of my behaviour during meetings to discuss my troubled state.\nDuring the summer, I would be left with my grandfather, who would make me kneel in the pantry facing the wall until my mother came back from work, so roughly 7 or 8 hours a day. Or I would be left with my uncle, who would make me walk up and down the driveway all day with a backpack filled with bricks and stones. Then on the weekends, I would be sent back to my dad&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;And then everything elevated severity when I was 9 and my father, a diagnosed, unmedicated schizophrenic with severe addiction issues, tried to kill me after being convinced that I was going to kill HIM. He held me down on the bed, held a pillow over my face and I believed my life was over. I woke up some time later and spent hours vomiting. That&amp;#39;s as far as I want to touch that memory.&lt;/p&gt;\n\n&lt;p&gt;A few months later, believing I was bad and deserved to die, I made my first suicide attempt, at the age of 9. I smashed open a picture of him and slashed at myself with the glass, then strangled myself with a belt on the kitchen floor. My mother looked on, hysterical, and called mobile crisis. For years after, the cycle continued--my mother played victim and gained the sympathy of professionals and teachers at my expense, refusing to listen to me when I tried to talk to her about what was happening at my father&amp;#39;s--she would lay on the couch from the time she came home from work until bed, and would stare at the television, telling me, when I tried to talk to her, that she was &amp;quot;too busy&amp;quot; and that we could talk later, but later never came, and the more I pressed, she would become angry and aggressive towards me. &lt;/p&gt;\n\n&lt;p&gt;All those years, she never looked me in the eyes, hugged me or told me she loved me. In fact, my therapist once asked her to say something nice about me and she stared blankly at the wall. My therapist asked her to tell me she loved me and she refused. But that&amp;#39;s another tangent. &lt;/p&gt;\n\n&lt;p&gt;This continued into my teens, and my behavioural problems worsened, until my mother requested juvenile court to become involved due to me running away so often. I was put on house arrest and eventually put in juvenile detention for a total of 9 months due to violating the probation I was put on, as requested by my mother, for my string of runaways that resulted from the situation she continued to force me into by guilting me into seeing my father every weekend (&amp;quot;he&amp;#39;s the only dad you&amp;#39;ll ever have, what if something happens to him, you&amp;#39;ll regret not seeing him&amp;quot;) that she refused to let me talk about in therapy, at home or at school. Effectively, she turned everyone against me, not only forcing me into abuse but actively portraiying herself as the victim of the anger and resentment I had DUE to the abuse I was being forced into. &lt;/p&gt;\n\n&lt;p&gt;Until I was finally kicked out, and forced to live with my father. I won&amp;#39;t get into what it was like living with him for 7 months, but at the end, I saw the same look in his eyes from when he tried to kill me when I was 9 and I called and asked DCF to take me into custody. &lt;/p&gt;\n\n&lt;p&gt;According to my then probation officer, I was an unsalvageable little shit trying to work the system, and he hoped I would rot one day.&lt;/p&gt;\n\n&lt;p&gt;I spent the next 3 years in DCF, bounced from place to place, even shortly living with Charles Wilson who murdered 3 store clerks 2 years later in failed robberies. I met a woman who was finally like a parent to me, who worked at the group home I was living in, and just as we were waiting on paperwork for adoption, at 17 years old, I was uncerimoniously discharged back to my mother and stepfather​, where no matter how well I did, nothing was ever good enough.  &lt;/p&gt;\n\n&lt;p&gt;I was alone, with no friends and no support after finally finding someone who treated me with love and caring. I was no longer allowed to contact her. &lt;/p&gt;\n\n&lt;p&gt;I barely made it through highschool, but I did, though it was at cost of developing an extremely abnormal eating disorder that caused me to go 3 years without being able to eat a solid food. Which was manageable Because I went immediately into freelance writing. I could escape everything while writing. But the loneliness, anxiety and depression caught up to me eventually, by the age of 21. I couldn&amp;#39;t eat food, my weight was fluctuating dangerously, I couldn&amp;#39;t sleep or focus. &lt;/p&gt;\n\n&lt;p&gt;I begged my mother to talk to me and she refused, time and again, while staring at the television and telling me she was &amp;quot;too busy.&amp;quot; I knew there was always something wrong with me but it was building more and more and I was thinking about killing myself constantly. I needed help, I was scaring myself, but she wouldn&amp;#39;t listen. Her and my sister and stepfather would mock me for my eating disorder, constantly tell me how much they wanted me gone, but I couldn&amp;#39;t go due to not making enough due to the things I was asking for help with that no one would help me with.&lt;/p&gt;\n\n&lt;p&gt;So in September of 2013, I hospitalised myself. I met someone who seemed to understand me and sometimes listened. Treatment went well. I was starting to feel hopeful. &lt;/p&gt;\n\n&lt;p&gt;And then, in December 2013, my father died of cancer. &lt;/p&gt;\n\n&lt;p&gt;I was given the call at 940am, and expected to relay the information to my family. I was home alone. I called my mother, who just didn&amp;#39;t seem to know what to do, my sister who hung up on me, and then I spent the next two hours hysterically panicking and sobbing in the shower. My girlfriend, when she finally returned my call, rushed to be with me in the middle of a snow storm. My mother, when she was home, watched me sob in the kitchen with her arms folded and, after 10 minutes, asked, &amp;quot;are you done?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So I moved out.&lt;/p&gt;\n\n&lt;p&gt;For the next 3 years, I barely survived as every bit of trauma resurfaced. 10 more family members died. I ruined the relationship with my girlfriend, it ended just last fall, I tried twice to kill myself, spent two years unable to stop drinking or crying. My stepmother forced me to buy the few belongings of my father&amp;#39;s that I wanted, then turned around and sued me claiming I had stolen them. My sister openly blamed me for my father&amp;#39;s death. I rarely showered, rarely ate, barely slept, for 3 years. My eating disorder resurfaced and I couldn&amp;#39;t eat solid foods again for almost a year.&lt;/p&gt;\n\n&lt;p&gt;Honestly, the last few years, I don&amp;#39;t even want to revisit beyond saying that. I don&amp;#39;t want to revisit any of it anymore. That&amp;#39;s why I&amp;#39;ve made my choice. &lt;/p&gt;\n\n&lt;p&gt;I live in a place where I&amp;#39;ve never fit in, have no means of supporting myself or of moving OR of bettering my situation. I can&amp;#39;t date because after my upbringing, each and every relationship leaves such a deep, gaping wound after it ends that I can&amp;#39;t seem to heal enough to walk forward anymore, and I&amp;#39;m so conditioned to sympathise with abusers that I manipulate myself into dating women who have extremely aggressive, toxic and abusive traits. &lt;/p&gt;\n\n&lt;p&gt;But what makes it all so pointless and so hopeless is that it all comes down to luck. I was born in the wrong place, to the wrong family. I found somewhere I fit in this year, for the first time in my life, but I can never go there again, I&amp;#39;ll never have the means or the capability, and that&amp;#39;s what kills me. I didn&amp;#39;t do anything particular to receive the shitty fucking cards I&amp;#39;ve gotten, it all comes down to getting a bad hand, and I&amp;#39;ve tried to make it, I&amp;#39;ve tried work, school, but I always​ end up back in the hospital, and that makes it more and more impossible to get anywhere in life. I&amp;#39;m tired of the circular nature of suffering, and I&amp;#39;m tired of putting everything I am into people and into life and getting nothing positive in return, of ending up alone and incapable while others seem to just be able. I&amp;#39;m tired of having spent my whole life trying to overcome all of my trauma but still being no closer to it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m tired of dating women who are mentally and emotionally abusive, I&amp;#39;m tired of seeing other people have things I know I&amp;#39;ll never taste or touch, of watching my family succeed and ignore every ounce of suffering I&amp;#39;ve been dealt. I&amp;#39;m tired of no one acknowledging all the things that went on, everything that happened, and being unable to look me in the eyes. &lt;/p&gt;\n\n&lt;p&gt;Not a SINGLE family member looks me in the eyes, and hasn&amp;#39;t in years. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just tired of the pain and I&amp;#39;m tired of it never being any better, no matter how I&amp;#39;ve approached it. I don&amp;#39;t want to be here anymore. &lt;/p&gt;\n\n&lt;p&gt;I know this is overly long but I&amp;#39;ve got nothing to lose by letting this out. I needed to get it all off my chest by Thursday, and seeing as I don&amp;#39;t really have anyone, getting it out here seemed best. &lt;/p&gt;\n\n&lt;p&gt;Anyways, I know no one will read something this long, so that&amp;#39;s all I guess.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Where to begin? I'm not looking for attention or rescue, I'm writing this to finally get everything out, and with no one to talk to, having never fit in anywhere at all, I want to finally say things I've never been able. So this WILL be long, as it's the last bit of communication I intend on having.\n\nOn Thursday evening, I will kill myself. I've several dozen Pristiq tabs saved up (antidepressant, go figure) and will take them all. \n\nI'm 25 and I have no job, no money, am nearly homeless and entirely alone. I've tried so many times throughout the years to hold pieces of my life together and yet have never had any success. My father left when I was 4, I remember the day vividly, it's my first memory. He was strangling my mother in the kitchen, having just punched through the wall, and I knocked over the gate separating the living room from the kitchen and yelled at him to, in my mother's recollection, \"leave my mom alone.\" He turned around and punched me in the face, rearranging my upper pallet for life. He fled, she called the cops, and it was over. Then my mother met my future stepfather about 2 years later, and so she began to manipulate me and force me to visit my father on the weekends so that she could go on dates with my stepfather. Cue years of further physical, sexual and emotional/psychological abuse, during which I had terrible behavioural troubles in school my mother claimed not to know the causation of, painting herself to faculty and therapists as the victim of my behaviour during meetings to discuss my troubled state.\nDuring the summer, I would be left with my grandfather, who would make me kneel in the pantry facing the wall until my mother came back from work, so roughly 7 or 8 hours a day. Or I would be left with my uncle, who would make me walk up and down the driveway all day with a backpack filled with bricks and stones. Then on the weekends, I would be sent back to my dad's.\n\nAnd then everything elevated severity when I was 9 and my father, a diagnosed, unmedicated schizophrenic with severe addiction issues, tried to kill me after being convinced that I was going to kill HIM. He held me down on the bed, held a pillow over my face and I believed my life was over. I woke up some time later and spent hours vomiting. That's as far as I want to touch that memory.\n\nA few months later, believing I was bad and deserved to die, I made my first suicide attempt, at the age of 9. I smashed open a picture of him and slashed at myself with the glass, then strangled myself with a belt on the kitchen floor. My mother looked on, hysterical, and called mobile crisis. For years after, the cycle continued--my mother played victim and gained the sympathy of professionals and teachers at my expense, refusing to listen to me when I tried to talk to her about what was happening at my father's--she would lay on the couch from the time she came home from work until bed, and would stare at the television, telling me, when I tried to talk to her, that she was \"too busy\" and that we could talk later, but later never came, and the more I pressed, she would become angry and aggressive towards me. \n\nAll those years, she never looked me in the eyes, hugged me or told me she loved me. In fact, my therapist once asked her to say something nice about me and she stared blankly at the wall. My therapist asked her to tell me she loved me and she refused. But that's another tangent. \n\nThis continued into my teens, and my behavioural problems worsened, until my mother requested juvenile court to become involved due to me running away so often. I was put on house arrest and eventually put in juvenile detention for a total of 9 months due to violating the probation I was put on, as requested by my mother, for my string of runaways that resulted from the situation she continued to force me into by guilting me into seeing my father every weekend (\"he's the only dad you'll ever have, what if something happens to him, you'll regret not seeing him\") that she refused to let me talk about in therapy, at home or at school. Effectively, she turned everyone against me, not only forcing me into abuse but actively portraiying herself as the victim of the anger and resentment I had DUE to the abuse I was being forced into. \n\nUntil I was finally kicked out, and forced to live with my father. I won't get into what it was like living with him for 7 months, but at the end, I saw the same look in his eyes from when he tried to kill me when I was 9 and I called and asked DCF to take me into custody. \n\nAccording to my then probation officer, I was an unsalvageable little shit trying to work the system, and he hoped I would rot one day.\n\nI spent the next 3 years in DCF, bounced from place to place, even shortly living with Charles Wilson who murdered 3 store clerks 2 years later in failed robberies. I met a woman who was finally like a parent to me, who worked at the group home I was living in, and just as we were waiting on paperwork for adoption, at 17 years old, I was uncerimoniously discharged back to my mother and stepfather​, where no matter how well I did, nothing was ever good enough.  \n\nI was alone, with no friends and no support after finally finding someone who treated me with love and caring. I was no longer allowed to contact her. \n\nI barely made it through highschool, but I did, though it was at cost of developing an extremely abnormal eating disorder that caused me to go 3 years without being able to eat a solid food. Which was manageable Because I went immediately into freelance writing. I could escape everything while writing. But the loneliness, anxiety and depression caught up to me eventually, by the age of 21. I couldn't eat food, my weight was fluctuating dangerously, I couldn't sleep or focus. \n\nI begged my mother to talk to me and she refused, time and again, while staring at the television and telling me she was \"too busy.\" I knew there was always something wrong with me but it was building more and more and I was thinking about killing myself constantly. I needed help, I was scaring myself, but she wouldn't listen. Her and my sister and stepfather would mock me for my eating disorder, constantly tell me how much they wanted me gone, but I couldn't go due to not making enough due to the things I was asking for help with that no one would help me with.\n\nSo in September of 2013, I hospitalised myself. I met someone who seemed to understand me and sometimes listened. Treatment went well. I was starting to feel hopeful. \n\nAnd then, in December 2013, my father died of cancer. \n\nI was given the call at 940am, and expected to relay the information to my family. I was home alone. I called my mother, who just didn't seem to know what to do, my sister who hung up on me, and then I spent the next two hours hysterically panicking and sobbing in the shower. My girlfriend, when she finally returned my call, rushed to be with me in the middle of a snow storm. My mother, when she was home, watched me sob in the kitchen with her arms folded and, after 10 minutes, asked, \"are you done?\"\n\nSo I moved out.\n\nFor the next 3 years, I barely survived as every bit of trauma resurfaced. 10 more family members died. I ruined the relationship with my girlfriend, it ended just last fall, I tried twice to kill myself, spent two years unable to stop drinking or crying. My stepmother forced me to buy the few belongings of my father's that I wanted, then turned around and sued me claiming I had stolen them. My sister openly blamed me for my father's death. I rarely showered, rarely ate, barely slept, for 3 years. My eating disorder resurfaced and I couldn't eat solid foods again for almost a year.\n\nHonestly, the last few years, I don't even want to revisit beyond saying that. I don't want to revisit any of it anymore. That's why I've made my choice. \n\nI live in a place where I've never fit in, have no means of supporting myself or of moving OR of bettering my situation. I can't date because after my upbringing, each and every relationship leaves such a deep, gaping wound after it ends that I can't seem to heal enough to walk forward anymore, and I'm so conditioned to sympathise with abusers that I manipulate myself into dating women who have extremely aggressive, toxic and abusive traits. \n\nBut what makes it all so pointless and so hopeless is that it all comes down to luck. I was born in the wrong place, to the wrong family. I found somewhere I fit in this year, for the first time in my life, but I can never go there again, I'll never have the means or the capability, and that's what kills me. I didn't do anything particular to receive the shitty fucking cards I've gotten, it all comes down to getting a bad hand, and I've tried to make it, I've tried work, school, but I always​ end up back in the hospital, and that makes it more and more impossible to get anywhere in life. I'm tired of the circular nature of suffering, and I'm tired of putting everything I am into people and into life and getting nothing positive in return, of ending up alone and incapable while others seem to just be able. I'm tired of having spent my whole life trying to overcome all of my trauma but still being no closer to it.\n\nI'm tired of dating women who are mentally and emotionally abusive, I'm tired of seeing other people have things I know I'll never taste or touch, of watching my family succeed and ignore every ounce of suffering I've been dealt. I'm tired of no one acknowledging all the things that went on, everything that happened, and being unable to look me in the eyes. \n\nNot a SINGLE family member looks me in the eyes, and hasn't in years. \n\nI'm just tired of the pain and I'm tired of it never being any better, no matter how I've approached it. I don't want to be here anymore. \n\nI know this is overly long but I've got nothing to lose by letting this out. I needed to get it all off my chest by Thursday, and seeing as I don't really have anyone, getting it out here seemed best. \n\nAnyways, I know no one will read something this long, so that's all I guess.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64vuu3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 110, "report_reasons": null, "author": "xavaveda", "saved": false, "mod_reports": [], "name": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": 1491969458.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/64vuu3/ive_decided_to_kill_myself_thursday_before_i_do_i/", "num_reports": null, "locked": false, "stickied": false, "created": 1491997411.0, "url": "https://www.reddit.com/r/offmychest/comments/64vuu3/ive_decided_to_kill_myself_thursday_before_i_do_i/", "author_flair_text": null, "quarantine": false, "title": "I've decided to kill myself Thursday, before I do, I need to let some things out", "created_utc": 1491968611.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 46, "visited": false, "subreddit_type": "public", "ups": 110}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg6urqo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xavaveda", "parent_id": "t1_dg672fe", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "My therapist has told me that, with my past, she's surprised I'm not a drug addict or already dead. She knows that I am suicidal, but she agreed that a hospitalisation would only be a very temporary bandaid solution and she trusts that I will stay safe and contact her if I am not able to stay safe. Maybe she trusts me too much. \n\nI'm just tired. I sit in therapy, stare at the floor and barely speak. I have a difficult time moving or doing anything at all, as evidenced by the very few and untimely responses I've even been able to give. I just don't have it in me anymore. I'm sorry, I wish I could even tell MYSELF that I do, but I just don't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My therapist has told me that, with my past, she&amp;#39;s surprised I&amp;#39;m not a drug addict or already dead. She knows that I am suicidal, but she agreed that a hospitalisation would only be a very temporary bandaid solution and she trusts that I will stay safe and contact her if I am not able to stay safe. Maybe she trusts me too much. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just tired. I sit in therapy, stare at the floor and barely speak. I have a difficult time moving or doing anything at all, as evidenced by the very few and untimely responses I&amp;#39;ve even been able to give. I just don&amp;#39;t have it in me anymore. I&amp;#39;m sorry, I wish I could even tell MYSELF that I do, but I just don&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6urqo", "score_hidden": false, "stickied": false, "created": 1492072804.0, "created_utc": 1492044004.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg672fe", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ljcbff", "parent_id": "t1_dg5tal6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "What does your therapist say? Has she been helping? \n\nSounds like you are trying really hard at improving your life. You've put a lot of thought and action into changing things for yourself. There is something to be said for that effort. It says a lot about you as a person, that you didn't just give up. That you kept fighting and trying. That effort may have not produced the result that you wanted, but trust the process. Keep going. You've come this far and it would be a shame if you gave up now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What does your therapist say? Has she been helping? &lt;/p&gt;\n\n&lt;p&gt;Sounds like you are trying really hard at improving your life. You&amp;#39;ve put a lot of thought and action into changing things for yourself. There is something to be said for that effort. It says a lot about you as a person, that you didn&amp;#39;t just give up. That you kept fighting and trying. That effort may have not produced the result that you wanted, but trust the process. Keep going. You&amp;#39;ve come this far and it would be a shame if you gave up now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg672fe", "score_hidden": false, "stickied": false, "created": 1492046387.0, "created_utc": 1492017587.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tal6", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "xavaveda", "parent_id": "t1_dg5grwi", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm actually seeing my therapist Thursday afternoon. Since she's the only person who talks to me, I wanted to have one last but of communication beforehand. I spent the last year trying to convince myself that it gets better, trying to force myself to have a better life. I enrolled in school and within a month dropped out due to being unable to focus, retain information or really do anything at all, not to mention I was in the process​ of selling basically everything I owned to pay rent. After a lifetime of treatment--and the right treatment at that--I've become much less hopeful that \"gets better\" is something everyone experience. After all, if I didn't learn from the patterns of my life, I probably would have stopped years ago. It's how I've tried to make things better--learning what happened and why it happened, how to change it and stop it. But even with all the effort I've still been in the same​ places, facing the same things, and I just don't have the energy anymore. Thank you for replying though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m actually seeing my therapist Thursday afternoon. Since she&amp;#39;s the only person who talks to me, I wanted to have one last but of communication beforehand. I spent the last year trying to convince myself that it gets better, trying to force myself to have a better life. I enrolled in school and within a month dropped out due to being unable to focus, retain information or really do anything at all, not to mention I was in the process​ of selling basically everything I owned to pay rent. After a lifetime of treatment--and the right treatment at that--I&amp;#39;ve become much less hopeful that &amp;quot;gets better&amp;quot; is something everyone experience. After all, if I didn&amp;#39;t learn from the patterns of my life, I probably would have stopped years ago. It&amp;#39;s how I&amp;#39;ve tried to make things better--learning what happened and why it happened, how to change it and stop it. But even with all the effort I&amp;#39;ve still been in the same​ places, facing the same things, and I just don&amp;#39;t have the energy anymore. Thank you for replying though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5tal6", "score_hidden": false, "stickied": false, "created": 1492030284.0, "created_utc": 1492001484.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5grwi", "gilded": 0, "archived": false, "score": 75, "report_reasons": null, "author": "ljcbff", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I want you to know that I read your whole post. I don't know you, and I can't even fathom what you've gone through.\n\nYou have every right to take your life on Thursday, and I don't blame you for wanting to, but I really hope you don't. It can literally only get better from here. Remember that everything is temporary. Everything passes. It will get better. There are resources out there and therapists to talk to.\n\nAlso, I can tell from your post that you're a good writer, have good perspective, and have a story that could help others. There is a lot of potential in you. You have been through Hell.. don't give up now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want you to know that I read your whole post. I don&amp;#39;t know you, and I can&amp;#39;t even fathom what you&amp;#39;ve gone through.&lt;/p&gt;\n\n&lt;p&gt;You have every right to take your life on Thursday, and I don&amp;#39;t blame you for wanting to, but I really hope you don&amp;#39;t. It can literally only get better from here. Remember that everything is temporary. Everything passes. It will get better. There are resources out there and therapists to talk to.&lt;/p&gt;\n\n&lt;p&gt;Also, I can tell from your post that you&amp;#39;re a good writer, have good perspective, and have a story that could help others. There is a lot of potential in you. You have been through Hell.. don&amp;#39;t give up now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5grwi", "score_hidden": false, "stickied": false, "created": 1491999878.0, "created_utc": 1491971078.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 75}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg68prt", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "xavaveda", "parent_id": "t1_dg5gvu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That might be something I try tonight, though writing has been nearly impossible the last few years. It's (not very) strange, when I think back on my childhood to try and do such things (I had to do similar tasks in EMDR therapy), when I'm not detached from my past, I get so much rage and internal hatred for myself as a child that I just can't manage anything productive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That might be something I try tonight, though writing has been nearly impossible the last few years. It&amp;#39;s (not very) strange, when I think back on my childhood to try and do such things (I had to do similar tasks in EMDR therapy), when I&amp;#39;m not detached from my past, I get so much rage and internal hatred for myself as a child that I just can&amp;#39;t manage anything productive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg68prt", "score_hidden": false, "stickied": false, "created": 1492048033.0, "created_utc": 1492019233.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gvu3", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "NoMaDeo", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "A lot of hardship you went through there!! It must feel so tempting to break the cycle and put an end to all of this Misery...But yet...There's actually one more thing you can do. You seem to like writing and you have a lot to tell; Why don't you write an essay \"101 things you can do to destroy your offspring\". Start by describing, in a list, one by one, the steps your parents took to ruin your life. Concise and clear sentences. Once that's done, make a list of all the people who have harmed you, describe them physically and mentally, and try to explain the reasons why you think they acted the way they did. And finally, write a love letter to the child you were at 5, 10, 13, 15 and offer him advice and peace of mind. \n...You still have so much to offer to the rest of the world and people like you are great reference to a better world, because you have seen the Darks and know what it's like on the other side. Please share your knowledge with Us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of hardship you went through there!! It must feel so tempting to break the cycle and put an end to all of this Misery...But yet...There&amp;#39;s actually one more thing you can do. You seem to like writing and you have a lot to tell; Why don&amp;#39;t you write an essay &amp;quot;101 things you can do to destroy your offspring&amp;quot;. Start by describing, in a list, one by one, the steps your parents took to ruin your life. Concise and clear sentences. Once that&amp;#39;s done, make a list of all the people who have harmed you, describe them physically and mentally, and try to explain the reasons why you think they acted the way they did. And finally, write a love letter to the child you were at 5, 10, 13, 15 and offer him advice and peace of mind. \n...You still have so much to offer to the rest of the world and people like you are great reference to a better world, because you have seen the Darks and know what it&amp;#39;s like on the other side. Please share your knowledge with Us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5gvu3", "score_hidden": false, "stickied": false, "created": 1492000069.0, "created_utc": 1491971269.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg7as35", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sunflowertif", "parent_id": "t1_dg5to6n", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Nah don't say sorry. I'm happy to listen :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah don&amp;#39;t say sorry. I&amp;#39;m happy to listen :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7as35", "score_hidden": false, "stickied": false, "created": 1492099037.0, "created_utc": 1492070237.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5to6n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "xavaveda", "parent_id": "t1_dg5pey4", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you. I've always been exceptionally good with other people and animals, i guess because​, according to my therapist, I know what it's like to have literally nothing and no one, and it's true, I'd never want anyone else to feel what I feel on a daily basis. But in the end it means I end up sympathising with people I shouldn't, giving all of myself to people who are bad for others, and using my empathy to excuse it to myself. I used to breed tarantulas and snakes--I've always loved the \"unlovable\" things--and it was one of the few times in my life I was happy. But I no longer have the means to continue any of it, and even if I did, I don't have the desire for things anymore. I'm sorry, I'm rambling, things just come out all too much lately. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I&amp;#39;ve always been exceptionally good with other people and animals, i guess because​, according to my therapist, I know what it&amp;#39;s like to have literally nothing and no one, and it&amp;#39;s true, I&amp;#39;d never want anyone else to feel what I feel on a daily basis. But in the end it means I end up sympathising with people I shouldn&amp;#39;t, giving all of myself to people who are bad for others, and using my empathy to excuse it to myself. I used to breed tarantulas and snakes--I&amp;#39;ve always loved the &amp;quot;unlovable&amp;quot; things--and it was one of the few times in my life I was happy. But I no longer have the means to continue any of it, and even if I did, I don&amp;#39;t have the desire for things anymore. I&amp;#39;m sorry, I&amp;#39;m rambling, things just come out all too much lately. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5to6n", "score_hidden": false, "stickied": false, "created": 1492030881.0, "created_utc": 1492002081.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5pey4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sunflowertif", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I read every word of your post. \nI just want to say that you are a very strong soul. Other humans are sometimes shitty and do inexplicable shitty things. \nIn your life, there are probably, possibly other people you have touched with your kind words and actions too, maybe they just haven't told you about those moments. It could be something as small as making a cashier in a store laugh or smile, making friends' or strangers' lives different just because of your existence on this planet.\nHere's a virtual hug for you! You can't see it but it's there &lt;3\nFeel free to PM if you'd like to talk ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read every word of your post. \nI just want to say that you are a very strong soul. Other humans are sometimes shitty and do inexplicable shitty things. \nIn your life, there are probably, possibly other people you have touched with your kind words and actions too, maybe they just haven&amp;#39;t told you about those moments. It could be something as small as making a cashier in a store laugh or smile, making friends&amp;#39; or strangers&amp;#39; lives different just because of your existence on this planet.\nHere&amp;#39;s a virtual hug for you! You can&amp;#39;t see it but it&amp;#39;s there &amp;lt;3\nFeel free to PM if you&amp;#39;d like to talk &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5pey4", "score_hidden": false, "stickied": false, "created": 1492021954.0, "created_utc": 1491993154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5si7e", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "RestingMurderFace", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "*hug*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;hug&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5si7e", "score_hidden": false, "stickied": false, "created": 1492028964.0, "created_utc": 1492000164.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5gzkx", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "kitcatpaints", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I've read this. I'm so sorry for your shitty hand. You sound like a really caring and strong person. You are SO strong and have had to go through so much more than most.  I agree with the previous commenter. There must be some resources available to you that will actually help; something that hasn't been tried yet. Please give it time and more effort. I know you can. And please keep reaching out. I'm happy to chat too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read this. I&amp;#39;m so sorry for your shitty hand. You sound like a really caring and strong person. You are SO strong and have had to go through so much more than most.  I agree with the previous commenter. There must be some resources available to you that will actually help; something that hasn&amp;#39;t been tried yet. Please give it time and more effort. I know you can. And please keep reaching out. I&amp;#39;m happy to chat too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5gzkx", "score_hidden": false, "stickied": false, "created": 1492000255.0, "created_utc": 1491971455.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5jqfk", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "pm_me_ur_freckles_b", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I know that life as it is currently, feels unbearable and not worth living. I was in your place a year ago... not the same place, but suicidal and subsequently hospitalized. Since then, I got medicated, started therapy, and there are even times now where I don't think of killing my self. It can happen. You can build a life worth living. You are not alone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know that life as it is currently, feels unbearable and not worth living. I was in your place a year ago... not the same place, but suicidal and subsequently hospitalized. Since then, I got medicated, started therapy, and there are even times now where I don&amp;#39;t think of killing my self. It can happen. You can build a life worth living. You are not alone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5jqfk", "score_hidden": false, "stickied": false, "created": 1492005616.0, "created_utc": 1491976816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg69djb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "xavaveda", "parent_id": "t1_dg5g9d6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I've hit dead ends with every resource available to me--the bureau of rehabilitation services, disability, vocational counselors, social workers, 211--it's all come up directionless. I've even had workers tell me that they cannot work with me due to the severity of my case. I'll try to respond to messages, however it's taken me all day thus far just to respond to a handful of comments, so I can't make promises that I know I cannot keep. I've not spoken to anyone besides my therapist in over a month, and that in itself is exhausting because I have to maintain a facade that I no longer have the energy to conjure up. \nMy choice is not from lack of effort and a distinct refusal to better myself, rather from an inability to continue placing all of my energy into bettering a situation that has only seen improvement in short bursts and glimpses that continue to require further and lonelier milage to reach. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve hit dead ends with every resource available to me--the bureau of rehabilitation services, disability, vocational counselors, social workers, 211--it&amp;#39;s all come up directionless. I&amp;#39;ve even had workers tell me that they cannot work with me due to the severity of my case. I&amp;#39;ll try to respond to messages, however it&amp;#39;s taken me all day thus far just to respond to a handful of comments, so I can&amp;#39;t make promises that I know I cannot keep. I&amp;#39;ve not spoken to anyone besides my therapist in over a month, and that in itself is exhausting because I have to maintain a facade that I no longer have the energy to conjure up. \nMy choice is not from lack of effort and a distinct refusal to better myself, rather from an inability to continue placing all of my energy into bettering a situation that has only seen improvement in short bursts and glimpses that continue to require further and lonelier milage to reach. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg69djb", "score_hidden": false, "stickied": false, "created": 1492048700.0, "created_utc": 1492019900.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5g9d6", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "xquetzalli", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Please please please don't do it. I know the past sucks, but you have the future to look forward to and make it the way you want it to be. There's so many resources out there that will help you find a job, eat, and find a place to live at. I wanna help out in whatever way I can, please message me. I was in a similar emotional place to you from age 10 to just recently, and trust me, it does get better. It takes a while and a little work, but you'd be smiling. Please don't do it. Please talk to me. I read everything, and I really want to help out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please please please don&amp;#39;t do it. I know the past sucks, but you have the future to look forward to and make it the way you want it to be. There&amp;#39;s so many resources out there that will help you find a job, eat, and find a place to live at. I wanna help out in whatever way I can, please message me. I was in a similar emotional place to you from age 10 to just recently, and trust me, it does get better. It takes a while and a little work, but you&amp;#39;d be smiling. Please don&amp;#39;t do it. Please talk to me. I read everything, and I really want to help out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5g9d6", "score_hidden": false, "stickied": false, "created": 1491998993.0, "created_utc": 1491970193.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg6v3a8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xavaveda", "parent_id": "t1_dg5sfzx", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you. I've tried to move on, I really have, I just cannot. I don't have any certifications or degrees, besides a NAMI certification that I used to trauma support groups, I've no job, haven't been able to find one in over a year, no vehicle. I just don't see how it's possible to just \"start over.\" I rarely speak to my family but that doesn't give me much relief. I don't know. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I&amp;#39;ve tried to move on, I really have, I just cannot. I don&amp;#39;t have any certifications or degrees, besides a NAMI certification that I used to trauma support groups, I&amp;#39;ve no job, haven&amp;#39;t been able to find one in over a year, no vehicle. I just don&amp;#39;t see how it&amp;#39;s possible to just &amp;quot;start over.&amp;quot; I rarely speak to my family but that doesn&amp;#39;t give me much relief. I don&amp;#39;t know. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6v3a8", "score_hidden": false, "stickied": false, "created": 1492073179.0, "created_utc": 1492044379.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5sfzx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Cnt-rd-ne-mr", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I read it all. You are a fantastic writer. Fuck your family. Fuck how they treat you. Fuck them. You are worth so much more than them, stop giving any of your worth to them. Your life has been shit and your cards have been shit but where you go now is up to you. Stop dealing in those circles and walk away from them. Dont let your past define you any longer. holding on to that past is dragging you down. Step out of that life and make your own future.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read it all. You are a fantastic writer. Fuck your family. Fuck how they treat you. Fuck them. You are worth so much more than them, stop giving any of your worth to them. Your life has been shit and your cards have been shit but where you go now is up to you. Stop dealing in those circles and walk away from them. Dont let your past define you any longer. holding on to that past is dragging you down. Step out of that life and make your own future.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5sfzx", "score_hidden": false, "stickied": false, "created": 1492028855.0, "created_utc": 1492000055.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5nh5z", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "CrayolaWashables", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "First, I read that all. Second, I'm speechless but I feel compelled to at least try to help in some way - which I understand sounds arrogant because who am I to think my advice will be better than anything you already know? The fact that you've gone through all that and survived thus far says a lot about your character. The fact that you haven't retaliated and hurt other people says a lot about you. Life is unfair, you were dealt a really bad card and nothing is your own fault. \n\nSuicide is kind of a strange topic. We're conditioned to avoid it and think it's the worst possible course of action, but is it? I think most of the negative connotation comes from it being a sin in religion. I was watching Louis CK's netflix special the other night, while be anxious about school and exams, and he said something that made most of my anxiety go away. And it was that, you don't have to do anything in life that you don't want it, because you can always kill yourself at any moment and quit. I recommend watching the special, he honestly heals my soul.\n\nYou said you've tried everything to deal with your problems, I'm wondering if you've tried philosophy? Lots of philosophy talks about suffering. I'm currently on a mission to master my attitude toward suffering by detaching myself from the external world through meditation. There's a level of awareness and detachment from the external world you can achieve where you're capable of watching your first born child die in your arms and it have no effect on you. \n\nNietzche also has a really interesting outlook on suffering. He suffered a lot in his life as well, and he famously said:\n\"To those human beings who are of any concern to me I wish suffering, desolation, sickness, ill-treatment, indignities—I wish that they should not remain unfamiliar with profound self-contempt, the torture of self-mistrust, the wretchedness of the vanquished: I have no pity for them, because I wish them the only thing that can prove today whether one is worth anything or not—that one endures.\"\n\nI really recommend listening to this https://www.youtube.com/watch?v=PDNFH-ZNvyw&amp;t=1359s and the other videos on his channel, especially the Kierkegaard ones. \n\nWilliam James was discontent with life and suicidal. He said he would give himself one year to give it his all in order to change his life, or otherwise commit suicide. Would you consider a similar approach? Maybe change the thursday into a year? I think this would also reduce a lot of your anxieties about life - because the worst case scenario is that you're going to commit suicide. So, you only have to improve on that. \n\nI hope this catches you, thanks for sharing your story :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First, I read that all. Second, I&amp;#39;m speechless but I feel compelled to at least try to help in some way - which I understand sounds arrogant because who am I to think my advice will be better than anything you already know? The fact that you&amp;#39;ve gone through all that and survived thus far says a lot about your character. The fact that you haven&amp;#39;t retaliated and hurt other people says a lot about you. Life is unfair, you were dealt a really bad card and nothing is your own fault. &lt;/p&gt;\n\n&lt;p&gt;Suicide is kind of a strange topic. We&amp;#39;re conditioned to avoid it and think it&amp;#39;s the worst possible course of action, but is it? I think most of the negative connotation comes from it being a sin in religion. I was watching Louis CK&amp;#39;s netflix special the other night, while be anxious about school and exams, and he said something that made most of my anxiety go away. And it was that, you don&amp;#39;t have to do anything in life that you don&amp;#39;t want it, because you can always kill yourself at any moment and quit. I recommend watching the special, he honestly heals my soul.&lt;/p&gt;\n\n&lt;p&gt;You said you&amp;#39;ve tried everything to deal with your problems, I&amp;#39;m wondering if you&amp;#39;ve tried philosophy? Lots of philosophy talks about suffering. I&amp;#39;m currently on a mission to master my attitude toward suffering by detaching myself from the external world through meditation. There&amp;#39;s a level of awareness and detachment from the external world you can achieve where you&amp;#39;re capable of watching your first born child die in your arms and it have no effect on you. &lt;/p&gt;\n\n&lt;p&gt;Nietzche also has a really interesting outlook on suffering. He suffered a lot in his life as well, and he famously said:\n&amp;quot;To those human beings who are of any concern to me I wish suffering, desolation, sickness, ill-treatment, indignities—I wish that they should not remain unfamiliar with profound self-contempt, the torture of self-mistrust, the wretchedness of the vanquished: I have no pity for them, because I wish them the only thing that can prove today whether one is worth anything or not—that one endures.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I really recommend listening to this &lt;a href=\"https://www.youtube.com/watch?v=PDNFH-ZNvyw&amp;amp;t=1359s\"&gt;https://www.youtube.com/watch?v=PDNFH-ZNvyw&amp;amp;t=1359s&lt;/a&gt; and the other videos on his channel, especially the Kierkegaard ones. &lt;/p&gt;\n\n&lt;p&gt;William James was discontent with life and suicidal. He said he would give himself one year to give it his all in order to change his life, or otherwise commit suicide. Would you consider a similar approach? Maybe change the thursday into a year? I think this would also reduce a lot of your anxieties about life - because the worst case scenario is that you&amp;#39;re going to commit suicide. So, you only have to improve on that. &lt;/p&gt;\n\n&lt;p&gt;I hope this catches you, thanks for sharing your story :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5nh5z", "score_hidden": false, "stickied": false, "created": 1492015904.0, "created_utc": 1491987104.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5z7yv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BT9154", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Well I read the whole thing, I'll be honest I'm not a people person nor do I don't deal with emotions all that much.  As a rational person giving advice on the internet I see you're able to able to convey your story well so you still have your wits about you, only advice I can think of is to seek people that can sympathize with you.  Only place I know is a religious establishment, pretty sure they'll lend you an ear.\n\n\nWell that just my honest 2 cents as a wandering redditor\n\nTake care of yourself on whatever you choose to do", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I read the whole thing, I&amp;#39;ll be honest I&amp;#39;m not a people person nor do I don&amp;#39;t deal with emotions all that much.  As a rational person giving advice on the internet I see you&amp;#39;re able to able to convey your story well so you still have your wits about you, only advice I can think of is to seek people that can sympathize with you.  Only place I know is a religious establishment, pretty sure they&amp;#39;ll lend you an ear.&lt;/p&gt;\n\n&lt;p&gt;Well that just my honest 2 cents as a wandering redditor&lt;/p&gt;\n\n&lt;p&gt;Take care of yourself on whatever you choose to do&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5z7yv", "score_hidden": false, "stickied": false, "created": 1492038019.0, "created_utc": 1492009219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg63948", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Kiddingmyself", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I wish I could trade lives with you. I also feel helpless, lonely, and that there is nothing else that I can do to get out of this deep depression. I'm 22 and I haven't experienced nearly any trauma in comparison to yours, and I feel like total shit reading your story and still feeling like I want to end my life. I don't deserve the life that I was given, and you deserve so much more. You've already achieved so much in my eyes, just making it to 21 is a great accomplishment. I could never handle being in your shoes and continuing to fight to live the way that you have. You deserve to be free of your pain. I wish you the best and weirdly, even though I don't know you, I feel love for you. You're incredible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could trade lives with you. I also feel helpless, lonely, and that there is nothing else that I can do to get out of this deep depression. I&amp;#39;m 22 and I haven&amp;#39;t experienced nearly any trauma in comparison to yours, and I feel like total shit reading your story and still feeling like I want to end my life. I don&amp;#39;t deserve the life that I was given, and you deserve so much more. You&amp;#39;ve already achieved so much in my eyes, just making it to 21 is a great accomplishment. I could never handle being in your shoes and continuing to fight to live the way that you have. You deserve to be free of your pain. I wish you the best and weirdly, even though I don&amp;#39;t know you, I feel love for you. You&amp;#39;re incredible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg63948", "score_hidden": false, "stickied": false, "created": 1492042443.0, "created_utc": 1492013643.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg687q1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tealeaves123", "parent_id": "t1_dg5sz3f", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It's understandable that you would have difficulty in school and work, you have been through so much.  I'm sure you have considered applying for disability, I know it's a hard process but if it goes through could help provide some cash flow eventually.  \n\nI've been in therapy my entire adult life (I'm in my late 30's) and have tried so many different types of therapy and treatments.  My parents met in a mental hospital, yup, pretty messed up.  I can laugh about it sometimes now and don't mind if you do too because seriously, all I can do is laugh because its so messed up that they had so many kids.  \n I know what you mean when you say being strong feels like when things do no get better that you have more capacity to face further damage.  I know it did feel like that for me for a long time, when I didn't get better and was barely hanging on, it would all feel like things were crashing down on me again and worse than before and that I would be in so much pain forever.  And I would look at my life and compare it to others and feel like I was miles behind and would never catch up.  I did try naturopathic treatment and mindfulness based therapies in addition to standard therapies for awhile, maybe that would be helpful?  I was pretty skeptical but it did help me to some degree, maybe it would be something to try?  Also, I found myptsd.com helpful, it's a peer support forum, it's free and you can post stuff there to people who really get it and want to help.   \n\nYou mentioned in another post that you are going to see your therapist on Thursday, does he or she know that you are feeling this way? Do you feel like they care about you?   What do you think they would say if you told them you were feeling this way and saving up your pristiq to take?   You have every right to feel the way you do, it's up to you but telling your therapist what you have been thinking about may allow them to help you get additional support or resources. \n\nI understand that you don't know how to hope anymore, I feel you, I've been there.   There are a lot of people that do have hope for you though and who are not giving up on you.  We care about you.\n     ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s understandable that you would have difficulty in school and work, you have been through so much.  I&amp;#39;m sure you have considered applying for disability, I know it&amp;#39;s a hard process but if it goes through could help provide some cash flow eventually.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in therapy my entire adult life (I&amp;#39;m in my late 30&amp;#39;s) and have tried so many different types of therapy and treatments.  My parents met in a mental hospital, yup, pretty messed up.  I can laugh about it sometimes now and don&amp;#39;t mind if you do too because seriously, all I can do is laugh because its so messed up that they had so many kids.&lt;br/&gt;\n I know what you mean when you say being strong feels like when things do no get better that you have more capacity to face further damage.  I know it did feel like that for me for a long time, when I didn&amp;#39;t get better and was barely hanging on, it would all feel like things were crashing down on me again and worse than before and that I would be in so much pain forever.  And I would look at my life and compare it to others and feel like I was miles behind and would never catch up.  I did try naturopathic treatment and mindfulness based therapies in addition to standard therapies for awhile, maybe that would be helpful?  I was pretty skeptical but it did help me to some degree, maybe it would be something to try?  Also, I found myptsd.com helpful, it&amp;#39;s a peer support forum, it&amp;#39;s free and you can post stuff there to people who really get it and want to help.   &lt;/p&gt;\n\n&lt;p&gt;You mentioned in another post that you are going to see your therapist on Thursday, does he or she know that you are feeling this way? Do you feel like they care about you?   What do you think they would say if you told them you were feeling this way and saving up your pristiq to take?   You have every right to feel the way you do, it&amp;#39;s up to you but telling your therapist what you have been thinking about may allow them to help you get additional support or resources. &lt;/p&gt;\n\n&lt;p&gt;I understand that you don&amp;#39;t know how to hope anymore, I feel you, I&amp;#39;ve been there.   There are a lot of people that do have hope for you though and who are not giving up on you.  We care about you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg687q1", "score_hidden": false, "stickied": false, "created": 1492047531.0, "created_utc": 1492018731.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5sz3f", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "xavaveda", "parent_id": "t1_dg5ii0y", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I was diagnosed with C-PTSD, treatment resistant major depression, GAD and Dissociative Identity Disorder. I've done ego state work, EMDR therapy, 4 IOP programmes, 5 inpatient stints and about a dozen years of therapy and medication, including gene testing due to highly abnormal psychotic reactions to over a dozen medications. Turned out that my body is only capable of matabalising 2 medications on the market, one of which is the Pristiq I am currently hoarding. Being strong only means that, when things do not get better, you have more capacity to face further damage than others. At least, that's how it feels to me. \n\nThank you for the words, but I just don't know how to hope anymore. I couldn't even last a semester in school due to my issues, couldn't hold and now can't obtain a job for the same reason. \n\nI will respond to everyone when I can. I don't have the easiest means--I've had to sell my computer, guitars (including my father's) and nearly everything I own in the last several months to pay rent, so outlets and means of communication outside this shitty $25 phone I'm using are virtually non-existent. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was diagnosed with C-PTSD, treatment resistant major depression, GAD and Dissociative Identity Disorder. I&amp;#39;ve done ego state work, EMDR therapy, 4 IOP programmes, 5 inpatient stints and about a dozen years of therapy and medication, including gene testing due to highly abnormal psychotic reactions to over a dozen medications. Turned out that my body is only capable of matabalising 2 medications on the market, one of which is the Pristiq I am currently hoarding. Being strong only means that, when things do not get better, you have more capacity to face further damage than others. At least, that&amp;#39;s how it feels to me. &lt;/p&gt;\n\n&lt;p&gt;Thank you for the words, but I just don&amp;#39;t know how to hope anymore. I couldn&amp;#39;t even last a semester in school due to my issues, couldn&amp;#39;t hold and now can&amp;#39;t obtain a job for the same reason. &lt;/p&gt;\n\n&lt;p&gt;I will respond to everyone when I can. I don&amp;#39;t have the easiest means--I&amp;#39;ve had to sell my computer, guitars (including my father&amp;#39;s) and nearly everything I own in the last several months to pay rent, so outlets and means of communication outside this shitty $25 phone I&amp;#39;m using are virtually non-existent. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5sz3f", "score_hidden": false, "stickied": false, "created": 1492029767.0, "created_utc": 1492000967.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ii0y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tealeaves123", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Wow, I read every word of your story and want you to know there are a lot of similarities between what happened to you and what happened to me when I was growing up.  For one thing, what you mentioned about your mother is so similar to how my mother acted, the abuse, neglect, refusal to show emotion, putting me in bad situations where I was abused and having her look the other way.  It was one of the many things that nearly broke me.\n\nI grew up in poverty, was physically, emotionally and sexually abused.  Coped as best I could with an eating disorder, compulsive behaviors.   I had PTSD, depression, anxiety for a very long time.    Google complex PTSD if you aren't already familiar with it.  Somehow I survived, had lots of therapy (my long term therapist said she couldn't believe any of my siblings nor I were still standing after all of the trauma) and there were many many times I wanted to give up, many times I reached out to suicide help lines at the end of my rope, somehow it got better even though I was so close to the edge so many times.   Today I have a good job, a husband and child and even though I still have ups and downs and struggles, I can find some happiness most days.  \"I'm tired of the pain and it never being any better\", I can relate to that a lot.  It gets easier and I have found sometimes when the worst and hardest times happen, things get a little easier after that.      \n\nBack to you, your pain is real and you have every right to kill yourself on Thursday.  I care about you and really hope that you don't though.  You survived so much and it would have broken most people. You are strong and you've got this.  Don't give up hope.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, I read every word of your story and want you to know there are a lot of similarities between what happened to you and what happened to me when I was growing up.  For one thing, what you mentioned about your mother is so similar to how my mother acted, the abuse, neglect, refusal to show emotion, putting me in bad situations where I was abused and having her look the other way.  It was one of the many things that nearly broke me.&lt;/p&gt;\n\n&lt;p&gt;I grew up in poverty, was physically, emotionally and sexually abused.  Coped as best I could with an eating disorder, compulsive behaviors.   I had PTSD, depression, anxiety for a very long time.    Google complex PTSD if you aren&amp;#39;t already familiar with it.  Somehow I survived, had lots of therapy (my long term therapist said she couldn&amp;#39;t believe any of my siblings nor I were still standing after all of the trauma) and there were many many times I wanted to give up, many times I reached out to suicide help lines at the end of my rope, somehow it got better even though I was so close to the edge so many times.   Today I have a good job, a husband and child and even though I still have ups and downs and struggles, I can find some happiness most days.  &amp;quot;I&amp;#39;m tired of the pain and it never being any better&amp;quot;, I can relate to that a lot.  It gets easier and I have found sometimes when the worst and hardest times happen, things get a little easier after that.      &lt;/p&gt;\n\n&lt;p&gt;Back to you, your pain is real and you have every right to kill yourself on Thursday.  I care about you and really hope that you don&amp;#39;t though.  You survived so much and it would have broken most people. You are strong and you&amp;#39;ve got this.  Don&amp;#39;t give up hope.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5ii0y", "score_hidden": false, "stickied": false, "created": 1492003060.0, "created_utc": 1491974260.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5l8xa", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Galagompen", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I've read it all! Can't really say I know how you feel but I can say that you shouldn't do it. Life and the future is full of options death is not.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read it all! Can&amp;#39;t really say I know how you feel but I can say that you shouldn&amp;#39;t do it. Life and the future is full of options death is not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5l8xa", "score_hidden": false, "stickied": false, "created": 1492009364.0, "created_utc": 1491980564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ihkf", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "bnimbla", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Please don't kill yourself. \n\nI know it sounds lame, but choose to be everything you want in the world. \n\nTake care. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please don&amp;#39;t kill yourself. &lt;/p&gt;\n\n&lt;p&gt;I know it sounds lame, but choose to be everything you want in the world. &lt;/p&gt;\n\n&lt;p&gt;Take care. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5ihkf", "score_hidden": false, "stickied": false, "created": 1492003035.0, "created_utc": 1491974235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5yq64", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rui-tan", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I read the whole thing. I am sorry for what you've been through. No one deserves that kind of life. I'm sorry for all the posts that just mindlessly say \"don't kill yourself\". I can see why you want to end it. You've been a through lot. You must be really tired. As others, I do hope everything ends up well for you.  \n  \nHave you thought.. about writing a book about this? Or not straight up about your life if it feels too much, but maybe something that touches the subject of child abuse? More people need to be taught about this. No one should go through what you had to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read the whole thing. I am sorry for what you&amp;#39;ve been through. No one deserves that kind of life. I&amp;#39;m sorry for all the posts that just mindlessly say &amp;quot;don&amp;#39;t kill yourself&amp;quot;. I can see why you want to end it. You&amp;#39;ve been a through lot. You must be really tired. As others, I do hope everything ends up well for you.  &lt;/p&gt;\n\n&lt;p&gt;Have you thought.. about writing a book about this? Or not straight up about your life if it feels too much, but maybe something that touches the subject of child abuse? More people need to be taught about this. No one should go through what you had to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5yq64", "score_hidden": false, "stickied": false, "created": 1492037457.0, "created_utc": 1492008657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg62voo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "McDankMeister", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm sorry this all happened to you. It sounds like you've gone through some real struggles in your life. It's hard to imagine what that must have been like for you, but I feel for you.\n\nI know that it's probably hard to believe people when they tell you that time heals, so I won't trouble you with that. But, would you like to talk? I can always lend an ear.\n\nI really hope you don't go through with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry this all happened to you. It sounds like you&amp;#39;ve gone through some real struggles in your life. It&amp;#39;s hard to imagine what that must have been like for you, but I feel for you.&lt;/p&gt;\n\n&lt;p&gt;I know that it&amp;#39;s probably hard to believe people when they tell you that time heals, so I won&amp;#39;t trouble you with that. But, would you like to talk? I can always lend an ear.&lt;/p&gt;\n\n&lt;p&gt;I really hope you don&amp;#39;t go through with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg62voo", "score_hidden": false, "stickied": false, "created": 1492042039.0, "created_utc": 1492013239.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg63akb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Skaberdi", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Currently I am... speechless. I cant believe what how much you have been through but I know that if it was me in your shoes, I would have broke alot sooner. I admire you as a person and please don't give up. I believe that you can overcome this, you are a strong person. Hopefully, you don't continue on with this plan but all I can do is hope for the best.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Currently I am... speechless. I cant believe what how much you have been through but I know that if it was me in your shoes, I would have broke alot sooner. I admire you as a person and please don&amp;#39;t give up. I believe that you can overcome this, you are a strong person. Hopefully, you don&amp;#39;t continue on with this plan but all I can do is hope for the best.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg63akb", "score_hidden": false, "stickied": false, "created": 1492042485.0, "created_utc": 1492013685.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg64461", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SadNAloneOnChristmas", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Please, please don't do anything bad to yourself. Everyone else has, but you deserve to be happy and not hurting. Go back to writing, freelance writing pays bills and in the meantime you can write about other things for yourself, to fuel happiness. I hope I'll read your works years from now. Just don't let others steal your life from you anymore. You deserve a happy life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please, please don&amp;#39;t do anything bad to yourself. Everyone else has, but you deserve to be happy and not hurting. Go back to writing, freelance writing pays bills and in the meantime you can write about other things for yourself, to fuel happiness. I hope I&amp;#39;ll read your works years from now. Just don&amp;#39;t let others steal your life from you anymore. You deserve a happy life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg64461", "score_hidden": false, "stickied": false, "created": 1492043348.0, "created_utc": 1492014548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg667em", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZacharyBright", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Don't end it here, it's not your time. Pick up, take everything you have, buy a bus ticket, and leave. Go somewhere else, somewhere that you have never been. Go somewhere beautiful and start a new life. You don't need the family that treats you like shit. If you have nothing, find a hippie commune. It might be the game changer for you. You are at the end of your rope, I see that. Maybe the life you've been trying to lead isn't the right one. But there are so many paths you can take in this world, so don't end it just because this one isn't the right one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t end it here, it&amp;#39;s not your time. Pick up, take everything you have, buy a bus ticket, and leave. Go somewhere else, somewhere that you have never been. Go somewhere beautiful and start a new life. You don&amp;#39;t need the family that treats you like shit. If you have nothing, find a hippie commune. It might be the game changer for you. You are at the end of your rope, I see that. Maybe the life you&amp;#39;ve been trying to lead isn&amp;#39;t the right one. But there are so many paths you can take in this world, so don&amp;#39;t end it just because this one isn&amp;#39;t the right one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg667em", "score_hidden": false, "stickied": false, "created": 1492045512.0, "created_utc": 1492016712.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg725in", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PaganMa", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I started tearing up when I saw that you were given such a bad hand in life. I'm so sorry, I wish there was something...anything I could say to help, I understand how hard it is to look at life and just wish to vanish - I'm also a c-ptsd, severe anxiety/depression patient and have lived thru quite a bit of hell but I fought tooth and claw to stay alive, not for myself, but for my son's and daughters. I know a lot of the urges exist in my head and the flashbacks are not real, but it doesnt make it any easier to live with. I just wanted to reach out and virtually hold your hand to let you know that this choice is yours to make but there are people in this world worth living for. Even if they are not born yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I started tearing up when I saw that you were given such a bad hand in life. I&amp;#39;m so sorry, I wish there was something...anything I could say to help, I understand how hard it is to look at life and just wish to vanish - I&amp;#39;m also a c-ptsd, severe anxiety/depression patient and have lived thru quite a bit of hell but I fought tooth and claw to stay alive, not for myself, but for my son&amp;#39;s and daughters. I know a lot of the urges exist in my head and the flashbacks are not real, but it doesnt make it any easier to live with. I just wanted to reach out and virtually hold your hand to let you know that this choice is yours to make but there are people in this world worth living for. Even if they are not born yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg725in", "score_hidden": false, "stickied": false, "created": 1492082063.0, "created_utc": 1492053263.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg7rbkr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KingValdyrI", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "The points don't count until the game is over. If you check out early, your game is over.\n\nYou been dealt a shitty hand. Maybe the shittiest hand I ever read if I read right.\n\nBut you don't know. What if Friday you were supposed to win the lottery. Or Sunday meet the perfect chick? In reality nothing like that will probably happen, but the point is you don't know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The points don&amp;#39;t count until the game is over. If you check out early, your game is over.&lt;/p&gt;\n\n&lt;p&gt;You been dealt a shitty hand. Maybe the shittiest hand I ever read if I read right.&lt;/p&gt;\n\n&lt;p&gt;But you don&amp;#39;t know. What if Friday you were supposed to win the lottery. Or Sunday meet the perfect chick? In reality nothing like that will probably happen, but the point is you don&amp;#39;t know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7rbkr", "score_hidden": false, "stickied": false, "created": 1492128138.0, "created_utc": 1492099338.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ncf8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RenardeNoire", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I read it all.\n\nDude, life sucks, we all know it. I can't argue that you have it harder and shittier than most of us do, but look, you don't have to kill yourself. Death is the ending and all of us will die in due time. And what of life?\nSurely, it sucks, but it is full of opportunities. \n\nDeath will come for all of us, but don't give up on yourself yet. Give yourself another chance. Death will be an option, but I urge you reconsider it. At this point, only you can give yourself another chance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read it all.&lt;/p&gt;\n\n&lt;p&gt;Dude, life sucks, we all know it. I can&amp;#39;t argue that you have it harder and shittier than most of us do, but look, you don&amp;#39;t have to kill yourself. Death is the ending and all of us will die in due time. And what of life?\nSurely, it sucks, but it is full of opportunities. &lt;/p&gt;\n\n&lt;p&gt;Death will come for all of us, but don&amp;#39;t give up on yourself yet. Give yourself another chance. Death will be an option, but I urge you reconsider it. At this point, only you can give yourself another chance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5ncf8", "score_hidden": false, "stickied": false, "created": 1492015491.0, "created_utc": 1491986691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg5x62g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NoMaDeo", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Which country/city do you live in? Have you been in contact with a social worker? I am not knowledgeable in the matter but maybe someone else can direct you towards the right doors to knock on. Sometimes that's all it takes you know. Meeting the right person to guide you... if you live in the same city or state I am in, I might be able to help you. \n Seems to me like the first thing you need to do right now is deal with your health problems and to do that you need serious guidance and assistance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which country/city do you live in? Have you been in contact with a social worker? I am not knowledgeable in the matter but maybe someone else can direct you towards the right doors to knock on. Sometimes that&amp;#39;s all it takes you know. Meeting the right person to guide you... if you live in the same city or state I am in, I might be able to help you. \n Seems to me like the first thing you need to do right now is deal with your health problems and to do that you need serious guidance and assistance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg5x62g", "score_hidden": false, "stickied": false, "created": 1492035643.0, "created_utc": 1492006843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg65t0p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShinigamiLuvApples", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I won't tell you not to. I am not you, and your pain is always the greatest you have ever felt. I am so sorry you have suffered. I wish I could hug you. I just want you to know, I read every​ word. I will listen if you want to talk more, if not I totally understand. We don't know each other, but you matter to me in this way; I have sympathy for you, and respect your choice to end your life. I truly wish you the best, stay as safe as you can. You matter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I won&amp;#39;t tell you not to. I am not you, and your pain is always the greatest you have ever felt. I am so sorry you have suffered. I wish I could hug you. I just want you to know, I read every​ word. I will listen if you want to talk more, if not I totally understand. We don&amp;#39;t know each other, but you matter to me in this way; I have sympathy for you, and respect your choice to end your life. I truly wish you the best, stay as safe as you can. You matter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg65t0p", "score_hidden": false, "stickied": false, "created": 1492045105.0, "created_utc": 1492016305.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg674ad", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tuanicle", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I read it all. I just want you to know that we care. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read it all. I just want you to know that we care. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg674ad", "score_hidden": false, "stickied": false, "created": 1492046438.0, "created_utc": 1492017638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg6b8ju", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "forty4swagnum", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "http://i.imgur.com/BUY7L.jpg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://i.imgur.com/BUY7L.jpg\"&gt;http://i.imgur.com/BUY7L.jpg&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6b8ju", "score_hidden": false, "stickied": false, "created": 1492050608.0, "created_utc": 1492021808.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg6elf3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aeyuth", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "&gt; Anyways, I know no one will read something this long, so that's all I guess\n\nwell, you were wrong about this one. VERY wrong at that, because damn! You are *very* talented.\n\nI hate your mother so much, I wouldn't pee on her if her guts were on fire. She should never have been a mother, but then, nature doesn't have our standards does it... Would you consider not going through with your plan and trucking on if only to see that she is put in the most miserable nursing home ever?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Anyways, I know no one will read something this long, so that&amp;#39;s all I guess&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;well, you were wrong about this one. VERY wrong at that, because damn! You are &lt;em&gt;very&lt;/em&gt; talented.&lt;/p&gt;\n\n&lt;p&gt;I hate your mother so much, I wouldn&amp;#39;t pee on her if her guts were on fire. She should never have been a mother, but then, nature doesn&amp;#39;t have our standards does it... Would you consider not going through with your plan and trucking on if only to see that she is put in the most miserable nursing home ever?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6elf3", "score_hidden": false, "stickied": false, "created": 1492054079.0, "created_utc": 1492025279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg6ftc6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zaid-", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I read it all. You've had a rough life, and I'm sorry for that. You have the right to take your life away but you shouldn't. At least post-pone the day you decide you take your life away to be later down the road. It may seem like there isn't much hope, or there isn't anything that you should look forward to but there is. I don't know what exactly it is, but if you just hang on a little bit longer, you'll find something. Good luck, and if you need someone to talk to I'm here for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read it all. You&amp;#39;ve had a rough life, and I&amp;#39;m sorry for that. You have the right to take your life away but you shouldn&amp;#39;t. At least post-pone the day you decide you take your life away to be later down the road. It may seem like there isn&amp;#39;t much hope, or there isn&amp;#39;t anything that you should look forward to but there is. I don&amp;#39;t know what exactly it is, but if you just hang on a little bit longer, you&amp;#39;ll find something. Good luck, and if you need someone to talk to I&amp;#39;m here for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6ftc6", "score_hidden": false, "stickied": false, "created": 1492055326.0, "created_utc": 1492026526.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg6hxmh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SarahSilversomething", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I read it all.\n\nPlease know that there are people here who care and wish to see you succeed. We may not know you, but we would all like to see you continue to survive. You are brave to share your story and I thank you for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read it all.&lt;/p&gt;\n\n&lt;p&gt;Please know that there are people here who care and wish to see you succeed. We may not know you, but we would all like to see you continue to survive. You are brave to share your story and I thank you for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6hxmh", "score_hidden": false, "stickied": false, "created": 1492057490.0, "created_utc": 1492028690.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg6lgh6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Feminizzle_", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm sorry you've had to endure this traumatic experience. I wish you happiness. Your story has broke my heart. You seem like a wonderful person and I wish the world could give you all the peace and harmony you deserve. I still have hope that it can. I have hope that you can get a job. I have hope that you will be a wonderful parent with a fulfilling family who treats you with kindness. I believe your time is coming and your days of suffering will soon come to an end. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you&amp;#39;ve had to endure this traumatic experience. I wish you happiness. Your story has broke my heart. You seem like a wonderful person and I wish the world could give you all the peace and harmony you deserve. I still have hope that it can. I have hope that you can get a job. I have hope that you will be a wonderful parent with a fulfilling family who treats you with kindness. I believe your time is coming and your days of suffering will soon come to an end. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6lgh6", "score_hidden": false, "stickied": false, "created": 1492061369.0, "created_utc": 1492032569.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg7hv3c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JOEBO4T", "parent_id": "t1_dg72jlj", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Have you thought about applying to Concordia? It's an anglo friendly university there. I feel like that would be the easiest way to stay there for an extended period of time. Tuition is expensive for our of country students, however from my knowledge of american tuition, our fees are not so bad. \n\nIf you're looking for a friendly city that's art-loving, check out Winnipeg. Red River College is a great arts college and living is inexpensive (especially compared to Montreal). I've lived in a lot of cities throughout Canada and I have to say that Winnipeg had the greatest people. The winter is harsh but the city's people really make up for it. \n\nUnfortunately I don't know so much about American cities that would be similar to this (I'm assuming you're American). But if you want to come on up to Canada, going to school here is the easiest way I can think of doing it. \n\nFeel free to message me directly if you want to chat about it. I'm really happy to help out with research and all that jazz :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you thought about applying to Concordia? It&amp;#39;s an anglo friendly university there. I feel like that would be the easiest way to stay there for an extended period of time. Tuition is expensive for our of country students, however from my knowledge of american tuition, our fees are not so bad. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re looking for a friendly city that&amp;#39;s art-loving, check out Winnipeg. Red River College is a great arts college and living is inexpensive (especially compared to Montreal). I&amp;#39;ve lived in a lot of cities throughout Canada and I have to say that Winnipeg had the greatest people. The winter is harsh but the city&amp;#39;s people really make up for it. &lt;/p&gt;\n\n&lt;p&gt;Unfortunately I don&amp;#39;t know so much about American cities that would be similar to this (I&amp;#39;m assuming you&amp;#39;re American). But if you want to come on up to Canada, going to school here is the easiest way I can think of doing it. &lt;/p&gt;\n\n&lt;p&gt;Feel free to message me directly if you want to chat about it. I&amp;#39;m really happy to help out with research and all that jazz :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7hv3c", "score_hidden": false, "stickied": false, "created": 1492116750.0, "created_utc": 1492087950.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72jlj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xavaveda", "parent_id": "t1_dg6va9d", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I spent a month this year in Montréal, Québec. It was the first time I felt I belonged somewhere, and I was happy. Unfortunately it's not feasible to move there--not only is immigration to Montréal extremely difficult to begin with, but seeing as I am not a skilled worker and hold no certifications/degrees, it is nearly impossible. It is the only place I've ever been where people were nice to me, would strike up conversations and actively tried to create friendships with me, despite me being covered in occultish tattoos from the neck down and dressing in a quite an \"extreme\" manner. It was just a very open and accepting place, even with me being an anglophone possessing the French skills of a young child.  It was also one of the only places I've been that a creative-minded individual such as myself could actually make a living. I've never had any luck with\"normal\" jobs, have always been to stressed and depressed by them to the extent that I would eventually be unable to continue my employment and would end up back in the hospital. But it's not a realistic goal unless you're ridiculously successful, have an in-demand degree and/or are fully bilingual with a sponsor. So I cannot go back. C'est la vie. At this point, I feel I'm just whining, and I don't feel good about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I spent a month this year in Montréal, Québec. It was the first time I felt I belonged somewhere, and I was happy. Unfortunately it&amp;#39;s not feasible to move there--not only is immigration to Montréal extremely difficult to begin with, but seeing as I am not a skilled worker and hold no certifications/degrees, it is nearly impossible. It is the only place I&amp;#39;ve ever been where people were nice to me, would strike up conversations and actively tried to create friendships with me, despite me being covered in occultish tattoos from the neck down and dressing in a quite an &amp;quot;extreme&amp;quot; manner. It was just a very open and accepting place, even with me being an anglophone possessing the French skills of a young child.  It was also one of the only places I&amp;#39;ve been that a creative-minded individual such as myself could actually make a living. I&amp;#39;ve never had any luck with&amp;quot;normal&amp;quot; jobs, have always been to stressed and depressed by them to the extent that I would eventually be unable to continue my employment and would end up back in the hospital. But it&amp;#39;s not a realistic goal unless you&amp;#39;re ridiculously successful, have an in-demand degree and/or are fully bilingual with a sponsor. So I cannot go back. C&amp;#39;est la vie. At this point, I feel I&amp;#39;m just whining, and I don&amp;#39;t feel good about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg72jlj", "score_hidden": false, "stickied": false, "created": 1492082608.0, "created_utc": 1492053808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6va9d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JOEBO4T", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Where is it that you feel like you fit in and why can't you get there? Fuck everything and everyone else. Go there by any means necessary. \n\nEveryone deserves to live how they choose. You were dealt a shit card, but I believe you can move forward if you have the conviction to live for yourself. You don't owe anyone else anything. \n\nI hope you don't do it. If Thursday rolls around and you don't feel the strength to make it through, send me a message. I'll listen. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Where is it that you feel like you fit in and why can&amp;#39;t you get there? Fuck everything and everyone else. Go there by any means necessary. &lt;/p&gt;\n\n&lt;p&gt;Everyone deserves to live how they choose. You were dealt a shit card, but I believe you can move forward if you have the conviction to live for yourself. You don&amp;#39;t owe anyone else anything. &lt;/p&gt;\n\n&lt;p&gt;I hope you don&amp;#39;t do it. If Thursday rolls around and you don&amp;#39;t feel the strength to make it through, send me a message. I&amp;#39;ll listen. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6va9d", "score_hidden": false, "stickied": false, "created": 1492073405.0, "created_utc": 1492044605.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg6wxp2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "freeflowers", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "i read your post, you are an incredibly strong person who has overcome many things. I see you and honor your struggle. despite the trauma and absence of love in your family of origin , i send you love and respect and i thank you for your openness on this feed...i bless towards you and hope that you are able to receive at least some amount of compassion from this response. \n\nalexis", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i read your post, you are an incredibly strong person who has overcome many things. I see you and honor your struggle. despite the trauma and absence of love in your family of origin , i send you love and respect and i thank you for your openness on this feed...i bless towards you and hope that you are able to receive at least some amount of compassion from this response. &lt;/p&gt;\n\n&lt;p&gt;alexis&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6wxp2", "score_hidden": false, "stickied": false, "created": 1492075438.0, "created_utc": 1492046638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg8l97u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thec0mpletionist", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I don't know if you're in my time zone or not, but it's almost midnight here. Either way this goes, I will always remember you. If it's Friday and you're reading this, I applaud you for trying another day. Maybe one will turn into another, and another. Maybe I'm just naive and hopelessly optimistic. I have no idea who you are, but I DO know that I'll miss you. Never thought the moment would come where I would know the day someone has destined themselves to die. I have no advice for you. I genuinely wish I could take away your pain and sadness, even if I had to carry that weight myself. \n\nGood luck.\n\nI love you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if you&amp;#39;re in my time zone or not, but it&amp;#39;s almost midnight here. Either way this goes, I will always remember you. If it&amp;#39;s Friday and you&amp;#39;re reading this, I applaud you for trying another day. Maybe one will turn into another, and another. Maybe I&amp;#39;m just naive and hopelessly optimistic. I have no idea who you are, but I DO know that I&amp;#39;ll miss you. Never thought the moment would come where I would know the day someone has destined themselves to die. I have no advice for you. I genuinely wish I could take away your pain and sadness, even if I had to carry that weight myself. &lt;/p&gt;\n\n&lt;p&gt;Good luck.&lt;/p&gt;\n\n&lt;p&gt;I love you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8l97u", "score_hidden": false, "stickied": false, "created": 1492163721.0, "created_utc": 1492134921.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64vuu3", "likes": null, "replies": "", "user_reports": [], "id": "dg92iya", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HydroPlume", "parent_id": "t3_64vuu3", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I know that I'm probably too late now to write this, but I care. I read your whole post, and if you've decided against for any reason, you can message me or reply or anything you need, I'll do my best to help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know that I&amp;#39;m probably too late now to write this, but I care. I read your whole post, and if you&amp;#39;ve decided against for any reason, you can message me or reply or anything you need, I&amp;#39;ll do my best to help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg92iya", "score_hidden": false, "stickied": false, "created": 1492201857.0, "created_utc": 1492173057.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]