[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You know, you&amp;#39;re right, its ugly and gross. And here I thought, as someone who supposedly &amp;quot;loves&amp;quot; me, that I would find solace in knowing that you wouldn&amp;#39;t throw it back in my face.&lt;/p&gt;\n\n&lt;p&gt;But here we are. It hurts, and my intrusive thoughts are screaming &amp;quot;I told you so.&amp;quot; And they&amp;#39;re right, I should have never opened up to you or anyone else in this world. It brings me nothing but pain in return. I was doing great, too! My moods were elevated, feeling the love after doing some volunteer work, and here you are to just take a huge shit on me. Just because you&amp;#39;re not man enough to admit to your mistakes. Seriously, just a &amp;quot;Hey I fucked up, let me try and fix things&amp;quot; would have sufficed. Nope. Have some verbal abuse you annoying pigheaded b-!&lt;/p&gt;\n\n&lt;p&gt;So thanks for that. Thanks for showing me that its best if I keep all the negativity to myself to let it die. Thanks for showing me that I am always a second priority to you. Thanks for reminding me that anyone who offers a helping hand, can and always use whats said for malicious intentions. I was starting to believe otherwise, boy what a mistake that was.&lt;/p&gt;\n\n&lt;p&gt;So here I am, putting on the mask. The mask of what people want to see, never the real me. Par the course till freedom in May.&lt;/p&gt;\n\n&lt;p&gt;*resubmitted omitting a word. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "You know, you're right, its ugly and gross. And here I thought, as someone who supposedly \"loves\" me, that I would find solace in knowing that you wouldn't throw it back in my face.\n\nBut here we are. It hurts, and my intrusive thoughts are screaming \"I told you so.\" And they're right, I should have never opened up to you or anyone else in this world. It brings me nothing but pain in return. I was doing great, too! My moods were elevated, feeling the love after doing some volunteer work, and here you are to just take a huge shit on me. Just because you're not man enough to admit to your mistakes. Seriously, just a \"Hey I fucked up, let me try and fix things\" would have sufficed. Nope. Have some verbal abuse you annoying pigheaded b-!\n\nSo thanks for that. Thanks for showing me that its best if I keep all the negativity to myself to let it die. Thanks for showing me that I am always a second priority to you. Thanks for reminding me that anyone who offers a helping hand, can and always use whats said for malicious intentions. I was starting to believe otherwise, boy what a mistake that was.\n\nSo here I am, putting on the mask. The mask of what people want to see, never the real me. Par the course till freedom in May.\n\n*resubmitted omitting a word. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ylxd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 42, "report_reasons": null, "author": "wellcoolaid2", "saved": false, "mod_reports": [], "name": "t3_64ylxd", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/64ylxd/your_self_pitty_is_gross/", "num_reports": null, "locked": false, "stickied": false, "created": 1492037385.0, "url": "https://www.reddit.com/r/offmychest/comments/64ylxd/your_self_pitty_is_gross/", "author_flair_text": null, "quarantine": false, "title": "\"Your Self Pitty is Gross\"", "created_utc": 1492008585.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 42}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64ylxd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64ylxd", "likes": null, "replies": "", "user_reports": [], "id": "dg7mbft", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wellcoolaid2", "parent_id": "t1_dg6bgm7", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thanks for the kind words! This actually was said to me by my SO, rather than a friend, so it hurts a little more. I rarely ever talk to anyone else about my feelings for this exact reason. I have a lot of baggage, and a personality disorder that makes me apathetic, so I don't like to include outsiders into that world. Hence the mask. \n\nIt just sucks, because I feel like I support others, but can't seem to find anyone who wants to hear my problems. However, I understand that what was said, was in the heat of the moment of an argument, but its hard to gain back that broken trust. Maybe a few days, I'll feel up to opening up to him again, but it will most definitely be filtered. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the kind words! This actually was said to me by my SO, rather than a friend, so it hurts a little more. I rarely ever talk to anyone else about my feelings for this exact reason. I have a lot of baggage, and a personality disorder that makes me apathetic, so I don&amp;#39;t like to include outsiders into that world. Hence the mask. &lt;/p&gt;\n\n&lt;p&gt;It just sucks, because I feel like I support others, but can&amp;#39;t seem to find anyone who wants to hear my problems. However, I understand that what was said, was in the heat of the moment of an argument, but its hard to gain back that broken trust. Maybe a few days, I&amp;#39;ll feel up to opening up to him again, but it will most definitely be filtered. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7mbft", "score_hidden": false, "stickied": false, "created": 1492122650.0, "created_utc": 1492093850.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bgm7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DokiAngel", "parent_id": "t3_64ylxd", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Goodness. You see, I had trouble growing up, and so I was taught to bottle everything in.\n\nI then made a friend, whom at the time was my best friend. I would trust in them that I would tell my problems, not to make them feel bad or pity me, but for the sake of getting it off my chest and sharing it with a good friend who I did trust. \n\nI would always ask them if it was ok for me to do so, and they aid it was. Apparently that was a lie, and later on told me \"all you do is spread your negativity onto me\". \n\nSo I feel you. But hey. You didn't deserve that! Be careful, and if you need to tell people, do it with someone who truly DOES care and will let you get it out of your system. Doing so isn't being \"negative\", if anything, it's a way of letting off any weights in order to feel better and have a positive vibe. I hope you know that! Some people sadly, simply aren't meant for that stuff. They treat it as more of \"ugh, I have to deal with this again, I hope it ends soon\".\n\nPeople have many ways of coping. And you have good intentions with doing so. It's the people who use it for PURELY attention that are in the wrong. But I feel that is certainly not your intention. You just wanted someone to open up to for once. \n\nI hope you find someone who truly cares! Stay strong! \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Goodness. You see, I had trouble growing up, and so I was taught to bottle everything in.&lt;/p&gt;\n\n&lt;p&gt;I then made a friend, whom at the time was my best friend. I would trust in them that I would tell my problems, not to make them feel bad or pity me, but for the sake of getting it off my chest and sharing it with a good friend who I did trust. &lt;/p&gt;\n\n&lt;p&gt;I would always ask them if it was ok for me to do so, and they aid it was. Apparently that was a lie, and later on told me &amp;quot;all you do is spread your negativity onto me&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;So I feel you. But hey. You didn&amp;#39;t deserve that! Be careful, and if you need to tell people, do it with someone who truly DOES care and will let you get it out of your system. Doing so isn&amp;#39;t being &amp;quot;negative&amp;quot;, if anything, it&amp;#39;s a way of letting off any weights in order to feel better and have a positive vibe. I hope you know that! Some people sadly, simply aren&amp;#39;t meant for that stuff. They treat it as more of &amp;quot;ugh, I have to deal with this again, I hope it ends soon&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;People have many ways of coping. And you have good intentions with doing so. It&amp;#39;s the people who use it for PURELY attention that are in the wrong. But I feel that is certainly not your intention. You just wanted someone to open up to for once. &lt;/p&gt;\n\n&lt;p&gt;I hope you find someone who truly cares! Stay strong! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6bgm7", "score_hidden": false, "stickied": false, "created": 1492050838.0, "created_utc": 1492022038.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64ylxd", "likes": null, "replies": "", "user_reports": [], "id": "dg70856", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fanhitstheshit", "parent_id": "t3_64ylxd", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "People should never avoid listening to a friend in need. I know sometimes we don't feel like listening to problems, but life is a roller-coaster: sometimes you're up, sometimes you're down. Sorry this happened to you. Someday that person will be in your shoes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People should never avoid listening to a friend in need. I know sometimes we don&amp;#39;t feel like listening to problems, but life is a roller-coaster: sometimes you&amp;#39;re up, sometimes you&amp;#39;re down. Sorry this happened to you. Someday that person will be in your shoes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg70856", "score_hidden": false, "stickied": false, "created": 1492079522.0, "created_utc": 1492050722.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64ylxd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64ylxd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64ylxd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_64ylxd", "likes": null, "replies": "", "user_reports": [], "id": "dg72p6x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fanhitstheshit", "parent_id": "t1_dg70bqe", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's alright...I've been around people who would suck anyone close into their lives in the most manipulative way. Sometimes it wasn't even something negative, they just needed to be the center of the world. It seems that someone prayed on your good nature and did exactly that. I'm glad you managed to establish some boundaries. Just try not to run for the hills next time someone vents their problems to you :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s alright...I&amp;#39;ve been around people who would suck anyone close into their lives in the most manipulative way. Sometimes it wasn&amp;#39;t even something negative, they just needed to be the center of the world. It seems that someone prayed on your good nature and did exactly that. I&amp;#39;m glad you managed to establish some boundaries. Just try not to run for the hills next time someone vents their problems to you :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg72p6x", "score_hidden": false, "stickied": false, "created": 1492082827.0, "created_utc": 1492054027.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70bqe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vickylovesims", "parent_id": "t1_dg700q6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Yeah, I don't know, I might just delete the comment. I wrote it and realized I was projecting my experience with this friend onto OP because OP is using some of the same language my friend did like wearing a mask for the rest of the world. OP has reasons to be pissed off at this friend... this friend sounds selfish and I just read the situation the wrong way the first time because I assumed OP was judging a good person too harshly. I didn't realize the title was a quote. Anybody who tells you your self-pity is gross is a shitty person. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I don&amp;#39;t know, I might just delete the comment. I wrote it and realized I was projecting my experience with this friend onto OP because OP is using some of the same language my friend did like wearing a mask for the rest of the world. OP has reasons to be pissed off at this friend... this friend sounds selfish and I just read the situation the wrong way the first time because I assumed OP was judging a good person too harshly. I didn&amp;#39;t realize the title was a quote. Anybody who tells you your self-pity is gross is a shitty person. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg70bqe", "score_hidden": false, "stickied": false, "created": 1492079650.0, "created_utc": 1492050850.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg700q6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fanhitstheshit", "parent_id": "t1_dg6t0n1", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "&gt;You also have to be mindful of how long you talk about the same problem for. If you spin around in circles and don't accept any of the help or advice your friend is offering you, that can also be hard on your friend. \n\nSorry to push back, but you're assuming waaaay too much here, and quite frankly, being a bit judgemental. Some people just cannot stand others at their low moments. I've had plenty of \"close\" friends changing the subject every time the conversation got a bit depressing. \nIt seems like your \"friend in need\" was actually a narcissist. OP does not, though. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You also have to be mindful of how long you talk about the same problem for. If you spin around in circles and don&amp;#39;t accept any of the help or advice your friend is offering you, that can also be hard on your friend. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sorry to push back, but you&amp;#39;re assuming waaaay too much here, and quite frankly, being a bit judgemental. Some people just cannot stand others at their low moments. I&amp;#39;ve had plenty of &amp;quot;close&amp;quot; friends changing the subject every time the conversation got a bit depressing. \nIt seems like your &amp;quot;friend in need&amp;quot; was actually a narcissist. OP does not, though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg700q6", "score_hidden": false, "stickied": false, "created": 1492079268.0, "created_utc": 1492050468.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6t0n1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64ylxd", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[deleted]", "edited": 1492050210.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6t0n1", "score_hidden": false, "stickied": false, "created": 1492070683.0, "created_utc": 1492041883.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]