[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Trigger warning.&lt;/p&gt;\n\n&lt;p&gt;When I was 18, I was friends with one of my classmates. When I was sleeping over at his house, he had sex with me against my will. None of us were drunk. I don&amp;#39;t really want to go into details. I continued to be friends with him for some time after...I guess I was trying to convince myself that nothing wrong had happened.&lt;/p&gt;\n\n&lt;p&gt;Anyways, it&amp;#39;s been 3 years.&lt;/p&gt;\n\n&lt;p&gt;I just moved to a new city and have made some new friends. One of my friends is a girl my age named &amp;quot;Lou&amp;quot;. Lou and I have gotten really close over the months, and I would consider her my best friend here. Yesterday, we were talking about the issue of domestic violence. I thought it was a chance to share my personal story with her, because we were on that level of friendship.&lt;/p&gt;\n\n&lt;p&gt;So I told Lou how my former close friend had sexually assaulted me. She was very sympathetic, and held my hand through it all. When I showed her a picture of him, though, her response was, &amp;quot;Really? He doesn&amp;#39;t look like that kinda guy--he&amp;#39;s too handsome.&lt;/p&gt;\n\n&lt;p&gt;I was speechless. Yes, he was good looking: tall, dark-haired, athletic physique. He could have been a male model. But that doesn&amp;#39;t mean that he wasn&amp;#39;t also a evil person. I told her this and she shrugged, replying, &amp;quot;Sorry, I just was expecting a fat loser or something...this dude is so sexy, damn.&lt;/p&gt;\n\n&lt;p&gt;After I showed Lou the picture of him, I could tell she was taking my situation less seriously. She probably couldn&amp;#39;t understand how such a good lookin&amp;#39; guy would have trouble with the ladies. And this annoyed me. I thought she was more mature than that...&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know, this whole interaction just rubbed me the wrong way and I don&amp;#39;t really want to spend time with her anymore. Seriously, what on earth is wrong with her?&lt;/p&gt;\n\n&lt;p&gt;TL;DR: I opened up about my sexual assault issue to my best friend, who then brushed it off and said &amp;quot;He&amp;#39;s so handsome!&amp;quot; when I showed her a picture of my assaulter. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Trigger warning.\n\nWhen I was 18, I was friends with one of my classmates. When I was sleeping over at his house, he had sex with me against my will. None of us were drunk. I don't really want to go into details. I continued to be friends with him for some time after...I guess I was trying to convince myself that nothing wrong had happened.\n\nAnyways, it's been 3 years.\n\nI just moved to a new city and have made some new friends. One of my friends is a girl my age named \"Lou\". Lou and I have gotten really close over the months, and I would consider her my best friend here. Yesterday, we were talking about the issue of domestic violence. I thought it was a chance to share my personal story with her, because we were on that level of friendship.\n\nSo I told Lou how my former close friend had sexually assaulted me. She was very sympathetic, and held my hand through it all. When I showed her a picture of him, though, her response was, \"Really? He doesn't look like that kinda guy--he's too handsome.\n\nI was speechless. Yes, he was good looking: tall, dark-haired, athletic physique. He could have been a male model. But that doesn't mean that he wasn't also a evil person. I told her this and she shrugged, replying, \"Sorry, I just was expecting a fat loser or something...this dude is so sexy, damn.\n\nAfter I showed Lou the picture of him, I could tell she was taking my situation less seriously. She probably couldn't understand how such a good lookin' guy would have trouble with the ladies. And this annoyed me. I thought she was more mature than that...\n\nI don't know, this whole interaction just rubbed me the wrong way and I don't really want to spend time with her anymore. Seriously, what on earth is wrong with her?\n\nTL;DR: I opened up about my sexual assault issue to my best friend, who then brushed it off and said \"He's so handsome!\" when I showed her a picture of my assaulter. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652fih", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "ohmygodwhatt", "saved": false, "mod_reports": [], "name": "t3_652fih", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": 1492049752.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/652fih/my_best_friend_said_my_abuser_was_too_handsome_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492075043.0, "url": "https://www.reddit.com/r/offmychest/comments/652fih/my_best_friend_said_my_abuser_was_too_handsome_to/", "author_flair_text": null, "quarantine": false, "title": "My best friend said my abuser was \"too handsome\" to have assaulted me...", "created_utc": 1492046243.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652fih", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652fih", "likes": null, "replies": "", "user_reports": [], "id": "dg708sc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kalcif", "parent_id": "t1_dg6z412", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "100%\n\nHave also been in this same situation, a couple times, and everything you've said is spot on. Amen!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;100%&lt;/p&gt;\n\n&lt;p&gt;Have also been in this same situation, a couple times, and everything you&amp;#39;ve said is spot on. Amen!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg708sc", "score_hidden": false, "stickied": false, "created": 1492079544.0, "created_utc": 1492050744.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6z412", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Soupageddon", "parent_id": "t3_652fih", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Oh HELL no.\n\nFirst, internet hugs if you want them, because I've been there, and I'm sorry. Really, honestly, terribly sorry. That is a horrible thing to go through.\n\nSecond, though... In my experience, it's honestly the attractive ones that usually have the guts to actually DO something. I've had far less trouble with those considered by society to be unattractive than attractive, and I feel I have a significant enough sample size to make a judgement like that (ugh).\n\nPeople who haven't been through an experience like that tend not to understand the fear, the shame, any of it, and they like to weigh in on why you shouldn't feel the way you do. What happened, happened, there's no changing it, no matter what she says. That being said, there are people in your corner.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh HELL no.&lt;/p&gt;\n\n&lt;p&gt;First, internet hugs if you want them, because I&amp;#39;ve been there, and I&amp;#39;m sorry. Really, honestly, terribly sorry. That is a horrible thing to go through.&lt;/p&gt;\n\n&lt;p&gt;Second, though... In my experience, it&amp;#39;s honestly the attractive ones that usually have the guts to actually DO something. I&amp;#39;ve had far less trouble with those considered by society to be unattractive than attractive, and I feel I have a significant enough sample size to make a judgement like that (ugh).&lt;/p&gt;\n\n&lt;p&gt;People who haven&amp;#39;t been through an experience like that tend not to understand the fear, the shame, any of it, and they like to weigh in on why you shouldn&amp;#39;t feel the way you do. What happened, happened, there&amp;#39;s no changing it, no matter what she says. That being said, there are people in your corner.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg6z412", "score_hidden": false, "stickied": false, "created": 1492078144.0, "created_utc": 1492049344.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652fih", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652fih", "likes": null, "replies": "", "user_reports": [], "id": "dg7g7y8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RopeTuned", "parent_id": "t1_dg70utf", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Honestly the best thing I've seen on the internet this morning.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly the best thing I&amp;#39;ve seen on the internet this morning.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7g7y8", "score_hidden": false, "stickied": false, "created": 1492113946.0, "created_utc": 1492085146.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70utf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "fanhitstheshit", "parent_id": "t3_652fih", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "OMG, is she freaking serious?!? I COMPLETELY share your outrage. Ice her out and when she asks why, just say \"oh, sorry, but you're too pretty to be this dumb. I mean, I would expect it from someone ugly, more like a fat loser, but someone sexy like you should know what you did\". Honestly!!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OMG, is she freaking serious?!? I COMPLETELY share your outrage. Ice her out and when she asks why, just say &amp;quot;oh, sorry, but you&amp;#39;re too pretty to be this dumb. I mean, I would expect it from someone ugly, more like a fat loser, but someone sexy like you should know what you did&amp;quot;. Honestly!!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg70utf", "score_hidden": false, "stickied": false, "created": 1492080332.0, "created_utc": 1492051532.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652fih", "likes": null, "replies": "", "user_reports": [], "id": "dg7bjo7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "keichunyan", "parent_id": "t3_652fih", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "The fact she was ''expecting a fat loser or something'' speaks volumes on how society views predators. Fat, ugly, no social skills, weird, no friends. It makes creeps like the one who assaulted roam freely without the justice they deserve because nobody expects them. If anything, the more 'handsome' one is perceived by society, are the ones who are more likely to try something, because they have the confidence to do it and fall back on society's expectations of a rapist to protect them.\n\nYour friend needs a good slapping of common sense. If she can't support you based on her own warped ideals, then she's not worth having as a friend. Talk about it with her - how fucked up that was, and if she still refuses to see things how they happened, well, then it's time to bump her off. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact she was &amp;#39;&amp;#39;expecting a fat loser or something&amp;#39;&amp;#39; speaks volumes on how society views predators. Fat, ugly, no social skills, weird, no friends. It makes creeps like the one who assaulted roam freely without the justice they deserve because nobody expects them. If anything, the more &amp;#39;handsome&amp;#39; one is perceived by society, are the ones who are more likely to try something, because they have the confidence to do it and fall back on society&amp;#39;s expectations of a rapist to protect them.&lt;/p&gt;\n\n&lt;p&gt;Your friend needs a good slapping of common sense. If she can&amp;#39;t support you based on her own warped ideals, then she&amp;#39;s not worth having as a friend. Talk about it with her - how fucked up that was, and if she still refuses to see things how they happened, well, then it&amp;#39;s time to bump her off. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7bjo7", "score_hidden": false, "stickied": false, "created": 1492101307.0, "created_utc": 1492072507.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]