[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My mom started her new job today. She was being mistreated in her other place of work because customers weren&amp;#39;t being distributed fairly so she had to quit.&lt;/p&gt;\n\n&lt;p&gt;She works as a nail technician. She is uneducated, the daughter of an American military man but she grew up in Vietnam (she doesn&amp;#39;t know him), doesn&amp;#39;t speak English well, and admittedly isn&amp;#39;t attractive. I mention that because I think people judge you by your looks. I personally think she can be gorgeous, but she doesn&amp;#39;t have the money or time to look her best. Her skin isn&amp;#39;t the best, she is overweight, and she is weathered. &lt;/p&gt;\n\n&lt;p&gt;I am also overweight and the little period when I lost a lot of it, the difference in the way people treated you was absolutely startling. I mean, omg. It&amp;#39;s really like night and day. I&amp;#39;m not exaggerating. I&amp;#39;m trying to lose it now and I&amp;#39;ve been on a diet for the last few days. She is also too. Anyways, I digress.&lt;/p&gt;\n\n&lt;p&gt;My mom pretty much has all of the qualities that people mistreat you for in the world. &lt;/p&gt;\n\n&lt;p&gt;My mom looked very distressed tonight coming home from work. I can always tell when she is unhappy. She was telling me a story about a horrible customer complaining and refusing to pay her. I kept asking her questions because I wanted to understand. I wanted to paint a picture and know what this customer looked like, how her new boss reacted, and whether her new coworkers helped her. She didn&amp;#39;t seem like she wanted to talk anymore, so she yelled at me a little bit.&lt;/p&gt;\n\n&lt;p&gt;She immediately apologized, which I literally waved off and dismissed because I was angry. I had to text her a heart emoji to tell her I love her because I knew her yelling came from another place and it wasn&amp;#39;t about me. She doesn&amp;#39;t need more on her plate. She came back and apologized again and she almost cried. She bottles her emotions like I do. &lt;/p&gt;\n\n&lt;p&gt;Let me be clear: my mom handles her own, and anytime she isn&amp;#39;t strong enough to handle with the emotional baggage, she has me. We are partners in crime. She is not a pushover. She stands up her herself. But there&amp;#39;s only so much a person can do when they have to deal with so much. Besides her work issues, we have a horrible family situation that we deal with on a daily basis. There are so much more layers to this fuck up.&lt;/p&gt;\n\n&lt;p&gt;The beauty service industry is the worst. I don&amp;#39;t even know where to start. Gosh, my mom has stories for days. Most people don&amp;#39;t even have their license (my mom does). They don&amp;#39;t pay their employees enough. Long hours. Low pay. Mistreatment. Backstabbing. Horrible customers. Horrible bosses and coworkers. And it&amp;#39;s also not good for your health with the chemicals in the air. &lt;/p&gt;\n\n&lt;p&gt;My mom was so stressed out at one point a year ago that she developed eczema and couldn&amp;#39;t work. When she stopped working for a while to deal with it, her eczema &amp;quot;magically&amp;quot; went away.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want her to work anymore, not in this industry. I&amp;#39;m starting a business this year from a successful Kickstarter campaign. With the profits off of that, I hope to build it and turn it into a successful business. I hope to make a living to where she can afford to work only part times or make enough money so that we can buy a salon and she can be her own boss.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just so sad. I love her very much. I don&amp;#39;t want her to only have a relaxing life when she is 60 and very old. I want her to be happy NOW.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My mom started her new job today. She was being mistreated in her other place of work because customers weren't being distributed fairly so she had to quit.\n\nShe works as a nail technician. She is uneducated, the daughter of an American military man but she grew up in Vietnam (she doesn't know him), doesn't speak English well, and admittedly isn't attractive. I mention that because I think people judge you by your looks. I personally think she can be gorgeous, but she doesn't have the money or time to look her best. Her skin isn't the best, she is overweight, and she is weathered. \n\nI am also overweight and the little period when I lost a lot of it, the difference in the way people treated you was absolutely startling. I mean, omg. It's really like night and day. I'm not exaggerating. I'm trying to lose it now and I've been on a diet for the last few days. She is also too. Anyways, I digress.\n\nMy mom pretty much has all of the qualities that people mistreat you for in the world. \n\nMy mom looked very distressed tonight coming home from work. I can always tell when she is unhappy. She was telling me a story about a horrible customer complaining and refusing to pay her. I kept asking her questions because I wanted to understand. I wanted to paint a picture and know what this customer looked like, how her new boss reacted, and whether her new coworkers helped her. She didn't seem like she wanted to talk anymore, so she yelled at me a little bit.\n\nShe immediately apologized, which I literally waved off and dismissed because I was angry. I had to text her a heart emoji to tell her I love her because I knew her yelling came from another place and it wasn't about me. She doesn't need more on her plate. She came back and apologized again and she almost cried. She bottles her emotions like I do. \n\nLet me be clear: my mom handles her own, and anytime she isn't strong enough to handle with the emotional baggage, she has me. We are partners in crime. She is not a pushover. She stands up her herself. But there's only so much a person can do when they have to deal with so much. Besides her work issues, we have a horrible family situation that we deal with on a daily basis. There are so much more layers to this fuck up.\n\nThe beauty service industry is the worst. I don't even know where to start. Gosh, my mom has stories for days. Most people don't even have their license (my mom does). They don't pay their employees enough. Long hours. Low pay. Mistreatment. Backstabbing. Horrible customers. Horrible bosses and coworkers. And it's also not good for your health with the chemicals in the air. \n\nMy mom was so stressed out at one point a year ago that she developed eczema and couldn't work. When she stopped working for a while to deal with it, her eczema \"magically\" went away.\n\nI don't want her to work anymore, not in this industry. I'm starting a business this year from a successful Kickstarter campaign. With the profits off of that, I hope to build it and turn it into a successful business. I hope to make a living to where she can afford to work only part times or make enough money so that we can buy a salon and she can be her own boss.\n\nI'm just so sad. I love her very much. I don't want her to only have a relaxing life when she is 60 and very old. I want her to be happy NOW.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "652gra", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 183, "report_reasons": null, "author": "regretsihavefew", "saved": false, "mod_reports": [], "name": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/652gra/my_mom_is_uneducated_unattractive_poor_doesnt/", "num_reports": null, "locked": false, "stickied": false, "created": 1492075448.0, "url": "https://www.reddit.com/r/offmychest/comments/652gra/my_mom_is_uneducated_unattractive_poor_doesnt/", "author_flair_text": null, "quarantine": false, "title": "My mom is uneducated, unattractive, poor, doesn't speak English well, works in the beauty service industry, has a backstabbing family, and she is depressed. All the reasons people mistreat her for and I feel very sad about it.", "created_utc": 1492046648.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 183}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87bkq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg71441", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you! I appreciate your kind words!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I appreciate your kind words!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87bkq", "score_hidden": false, "stickied": false, "created": 1492145396.0, "created_utc": 1492116596.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg71441", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "MyLouBear", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You sound like a wonderful daughter. Working in the service industry is difficult in the best of circumstances, never mind when English is not your first language and youre being under appreciated.\nBest of luck with your business ventures, I hope it works out for you both. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like a wonderful daughter. Working in the service industry is difficult in the best of circumstances, never mind when English is not your first language and youre being under appreciated.\nBest of luck with your business ventures, I hope it works out for you both. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg71441", "score_hidden": false, "stickied": false, "created": 1492080672.0, "created_utc": 1492051872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 37}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87b0i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg77896", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you so much!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87b0i", "score_hidden": false, "stickied": false, "created": 1492145379.0, "created_utc": 1492116579.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77896", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "the_great_unknown", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This made my eyes tear up. I am so sorry. I hope that something changes and your Mom gets to live the life you want for her. She raised you to be a thoughtful adult. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This made my eyes tear up. I am so sorry. I hope that something changes and your Mom gets to live the life you want for her. She raised you to be a thoughtful adult. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg77896", "score_hidden": false, "stickied": false, "created": 1492090157.0, "created_utc": 1492061357.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87a7l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg77ozj", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Yeah, it's definitely illegal. A lot of these salons need workers so whoever can do the job, they'll just hire. My mom has personally worked for salons that have gotten in trouble for hiring workers with no license. At the last salon my mom worked, I think most of the nail technicians didn't even have their license. Because my mom has one, the owner plastered it up on the wall to brag to customers that the workers there are legal (when in reality, only my mom, the owners, and maybe one of two other workers there have their license). It's a shady business.\n\nThank you so much for your kind words! I sincerely appreciate it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, it&amp;#39;s definitely illegal. A lot of these salons need workers so whoever can do the job, they&amp;#39;ll just hire. My mom has personally worked for salons that have gotten in trouble for hiring workers with no license. At the last salon my mom worked, I think most of the nail technicians didn&amp;#39;t even have their license. Because my mom has one, the owner plastered it up on the wall to brag to customers that the workers there are legal (when in reality, only my mom, the owners, and maybe one of two other workers there have their license). It&amp;#39;s a shady business.&lt;/p&gt;\n\n&lt;p&gt;Thank you so much for your kind words! I sincerely appreciate it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87a7l", "score_hidden": false, "stickied": false, "created": 1492145354.0, "created_utc": 1492116554.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg77ozj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "justminnie", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You sound so wonderful and caring towards your mother! It was crazy reading your post because I can relate a lot! I love my mom very much, she's very poor and also dealing with family issues at her house and it stresses me out! My mom is very prone to stress too, and it affects her health.\n\nYour mother is very lucky to have you. My advice is to not take on her stress, that won't help. Sometimes she will need to rant, please let her and help her manage her stress.\n \nI used to work in a nail salon(front desk) and those clients can be FUCKING HELL. I'm confused why you said most people don't have their license though, how can they work in a nail salon without their license? That's illegal? \n\nAnyway, I hope things get better for you and your family! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound so wonderful and caring towards your mother! It was crazy reading your post because I can relate a lot! I love my mom very much, she&amp;#39;s very poor and also dealing with family issues at her house and it stresses me out! My mom is very prone to stress too, and it affects her health.&lt;/p&gt;\n\n&lt;p&gt;Your mother is very lucky to have you. My advice is to not take on her stress, that won&amp;#39;t help. Sometimes she will need to rant, please let her and help her manage her stress.&lt;/p&gt;\n\n&lt;p&gt;I used to work in a nail salon(front desk) and those clients can be FUCKING HELL. I&amp;#39;m confused why you said most people don&amp;#39;t have their license though, how can they work in a nail salon without their license? That&amp;#39;s illegal? &lt;/p&gt;\n\n&lt;p&gt;Anyway, I hope things get better for you and your family! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg77ozj", "score_hidden": false, "stickied": false, "created": 1492091148.0, "created_utc": 1492062348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87clj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg79l7v", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you! I hope all is well with you and your loved ones as well!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! I hope all is well with you and your loved ones as well!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87clj", "score_hidden": false, "stickied": false, "created": 1492145430.0, "created_utc": 1492116630.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79l7v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ericsistible", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Reading the title alone made me think I somehow posted without knowing it. Definitely hit home and I can empathize with you. I'm glad your mom has you and you're incredibly caring and understanding. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading the title alone made me think I somehow posted without knowing it. Definitely hit home and I can empathize with you. I&amp;#39;m glad your mom has you and you&amp;#39;re incredibly caring and understanding. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg79l7v", "score_hidden": false, "stickied": false, "created": 1492095725.0, "created_utc": 1492066925.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87cwz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg7bj3p", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87cwz", "score_hidden": false, "stickied": false, "created": 1492145440.0, "created_utc": 1492116640.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bj3p", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "-Lady-Nyx-", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's so awful that your mom has to deal with all of that. It sounds incredibly stressful for you too. I wish the best for the both of you and sending good thoughts your way. You sound like a terrific daughter. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s so awful that your mom has to deal with all of that. It sounds incredibly stressful for you too. I wish the best for the both of you and sending good thoughts your way. You sound like a terrific daughter. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7bj3p", "score_hidden": false, "stickied": false, "created": 1492101256.0, "created_utc": 1492072456.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87yc6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Aduke1122", "parent_id": "t1_dg87gl0", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you , they said times heals all wounds but not these kinds 😢", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you , they said times heals all wounds but not these kinds 😢&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87yc6", "score_hidden": false, "stickied": false, "created": 1492146112.0, "created_utc": 1492117312.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87gl0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg7bjk1", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Wow, I'm so so sorry to hear that. I sincerely hope everything is well with you and your family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, I&amp;#39;m so so sorry to hear that. I sincerely hope everything is well with you and your family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87gl0", "score_hidden": false, "stickied": false, "created": 1492145557.0, "created_utc": 1492116757.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bjk1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Aduke1122", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm so sorry for the way your mom is treated . My Mom had a rough life also , really bad but she worked and worked and worked her self into the ground bc she was a single mom of four girls . My Mom passed away four years back , she had just won her disability case one month bf she passed . She never got to enjoy not working , it makes me so sad she was only 51", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry for the way your mom is treated . My Mom had a rough life also , really bad but she worked and worked and worked her self into the ground bc she was a single mom of four girls . My Mom passed away four years back , she had just won her disability case one month bf she passed . She never got to enjoy not working , it makes me so sad she was only 51&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7bjk1", "score_hidden": false, "stickied": false, "created": 1492101298.0, "created_utc": 1492072498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87kcl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg7dlso", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you so much for your offer! I will send a PM! &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for your offer! I will send a PM! &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87kcl", "score_hidden": false, "stickied": false, "created": 1492145676.0, "created_utc": 1492116876.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dlso", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "riderkicker", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "A young one always having the back of their family is a good thing. :)\n\nCan you PM me what your Kickstarter campaign or the business you're setting up? Depending on what it is, and if it's something I can amplify across to my US friends (Filipino in the Philippines here), I will do so. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A young one always having the back of their family is a good thing. :)&lt;/p&gt;\n\n&lt;p&gt;Can you PM me what your Kickstarter campaign or the business you&amp;#39;re setting up? Depending on what it is, and if it&amp;#39;s something I can amplify across to my US friends (Filipino in the Philippines here), I will do so. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7dlso", "score_hidden": false, "stickied": false, "created": 1492107588.0, "created_utc": 1492078788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87ogs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg7fjdq", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's definitely something we have discussed! We just have to do a lot of planning. I've started a business plan a while ago, and it looks like I have to start back at it again. Thank you for your words and advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s definitely something we have discussed! We just have to do a lot of planning. I&amp;#39;ve started a business plan a while ago, and it looks like I have to start back at it again. Thank you for your words and advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87ogs", "score_hidden": false, "stickied": false, "created": 1492145803.0, "created_utc": 1492117003.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fjdq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "trowaway2552", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm so sorry to hear that, you and your mom sound like such wonderful people. The beauty industry is awful, I used to work it and quit after 2 years and work in the fast food industry now because of that. I hope your mom is doing ok and if there's anything I can do to help I'd be more then happy to :) \nAlso has your mom ever considered renting a spot in a salon? I know a lot of salons in my area do that so they can also offer aesthetic services and you get to be your own boss.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry to hear that, you and your mom sound like such wonderful people. The beauty industry is awful, I used to work it and quit after 2 years and work in the fast food industry now because of that. I hope your mom is doing ok and if there&amp;#39;s anything I can do to help I&amp;#39;d be more then happy to :) \nAlso has your mom ever considered renting a spot in a salon? I know a lot of salons in my area do that so they can also offer aesthetic services and you get to be your own boss.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7fjdq", "score_hidden": false, "stickied": false, "created": 1492112550.0, "created_utc": 1492083750.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87or9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg7qklc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you! Best of luck to you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! Best of luck to you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87or9", "score_hidden": false, "stickied": false, "created": 1492145812.0, "created_utc": 1492117012.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qklc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TurtleBeansforAll", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It sounds like your mother raised a wonderful child. Best of luck to both of you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like your mother raised a wonderful child. Best of luck to both of you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7qklc", "score_hidden": false, "stickied": false, "created": 1492127340.0, "created_utc": 1492098540.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg87p5b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "regretsihavefew", "parent_id": "t1_dg82fgc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you so much!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87p5b", "score_hidden": false, "stickied": false, "created": 1492145824.0, "created_utc": 1492117024.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82fgc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pola_Xray", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm really sorry about what your mom is going through, but she has you on her side and you sound *amazing*. So in that, she is very lucky.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really sorry about what your mom is going through, but she has you on her side and you sound &lt;em&gt;amazing&lt;/em&gt;. So in that, she is very lucky.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg82fgc", "score_hidden": false, "stickied": false, "created": 1492139997.0, "created_utc": 1492111197.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_652gra", "likes": null, "replies": "", "user_reports": [], "id": "dg98cwp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "toodlesmn", "parent_id": "t3_652gra", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You are a good kid. You should check in with the county you live in for free ESL classes for your mom. Also schooling so she can get a different job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are a good kid. You should check in with the county you live in for free ESL classes for your mom. Also schooling so she can get a different job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg98cwp", "score_hidden": false, "stickied": false, "created": 1492210652.0, "created_utc": 1492181852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]