[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I found out today that three years ago, when my sister was 16 and I was at work, my husband (then of 7 years, and who was 26 years old) got my little sister drunk and raped her in my bed while our (then 4 year old) son was in the next room.&lt;/p&gt;\n\n&lt;p&gt;Obviously I am filing for divorce immediately, but I don&amp;#39;t know how to handle the crushing weight of disgust and guilt.&lt;/p&gt;\n\n&lt;p&gt;I feel like this is my fault because I was so adamant that he was a good person, that he loved me, that he was someone safe. I never believed he could do something like this. To me - a rape and molestation survivor - to her - who had already been raped once at that age - to our son - who is too young to fully explain this to.&lt;/p&gt;\n\n&lt;p&gt;My sister - my sweet baby girl - was scared that I would choose him over her and she kept it to herself because she was afraid of losing me and her nephew. I would never have chosen him over her.&lt;/p&gt;\n\n&lt;p&gt;I feel so disgusted with myself for not knowing. For sleeping in this bed, with him, every day for the last 3 years. For trying to have another child with this person.&lt;/p&gt;\n\n&lt;p&gt;I hurt down to my soul. I can&amp;#39;t eat. I can&amp;#39;t sleep. I have this guilt for not being able to immediately turn off my love for him - we&amp;#39;ve been together 10 years and all of my adult life. He was my first everything. How can I still not hate him with all that I am after what he did? How can there be any little piece of me that doesn&amp;#39;t want him dead, burning in hell?&lt;/p&gt;\n\n&lt;p&gt;I want to hurt myself, but that would only hurt my little boy. I don&amp;#39;t know what to do. I feel like I&amp;#39;m not worth loving and that&amp;#39;s why he would do that to my sister. I feel like I&amp;#39;m stupid for not noticing that he was secretly a fucking monster. I feel like the worst big sister in the world that my baby girl couldn&amp;#39;t tell me and that she forced herself to interact with him in a positive way - THAT HE FUCKING PERSUADED ME TO TRY TO CONVINCE HER TO SPEND MORE TIME WITH HIM JUST AFTER IT HAPPENED.&lt;/p&gt;\n\n&lt;p&gt;I feel like I don&amp;#39;t deserve to be happy. I don&amp;#39;t deserve to be loved. I don&amp;#39;t deserve my son or my sister. I feel like nothing will ever make me feel less hollowed out and empty - like a scraped gourd - again.&lt;/p&gt;\n\n&lt;p&gt;EDIT:\nI emailed his parents and told them what he did so that they understand it&amp;#39;s not in anyone&amp;#39;s best interest to push him to try for custody or anything like that, and I BCCed him to make sure he knows exactly what I told his mother and father so that he can&amp;#39;t weasel out of the consequences if his parents are as ashamed of who he turned out to be as I am.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I found out today that three years ago, when my sister was 16 and I was at work, my husband (then of 7 years, and who was 26 years old) got my little sister drunk and raped her in my bed while our (then 4 year old) son was in the next room.\n\nObviously I am filing for divorce immediately, but I don't know how to handle the crushing weight of disgust and guilt.\n\nI feel like this is my fault because I was so adamant that he was a good person, that he loved me, that he was someone safe. I never believed he could do something like this. To me - a rape and molestation survivor - to her - who had already been raped once at that age - to our son - who is too young to fully explain this to.\n\nMy sister - my sweet baby girl - was scared that I would choose him over her and she kept it to herself because she was afraid of losing me and her nephew. I would never have chosen him over her.\n\nI feel so disgusted with myself for not knowing. For sleeping in this bed, with him, every day for the last 3 years. For trying to have another child with this person.\n\nI hurt down to my soul. I can't eat. I can't sleep. I have this guilt for not being able to immediately turn off my love for him - we've been together 10 years and all of my adult life. He was my first everything. How can I still not hate him with all that I am after what he did? How can there be any little piece of me that doesn't want him dead, burning in hell?\n\nI want to hurt myself, but that would only hurt my little boy. I don't know what to do. I feel like I'm not worth loving and that's why he would do that to my sister. I feel like I'm stupid for not noticing that he was secretly a fucking monster. I feel like the worst big sister in the world that my baby girl couldn't tell me and that she forced herself to interact with him in a positive way - THAT HE FUCKING PERSUADED ME TO TRY TO CONVINCE HER TO SPEND MORE TIME WITH HIM JUST AFTER IT HAPPENED.\n\nI feel like I don't deserve to be happy. I don't deserve to be loved. I don't deserve my son or my sister. I feel like nothing will ever make me feel less hollowed out and empty - like a scraped gourd - again.\n\nEDIT:\nI emailed his parents and told them what he did so that they understand it's not in anyone's best interest to push him to try for custody or anything like that, and I BCCed him to make sure he knows exactly what I told his mother and father so that he can't weasel out of the consequences if his parents are as ashamed of who he turned out to be as I am.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653jsl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1230, "report_reasons": null, "author": "ReservateThatRoom", "saved": false, "mod_reports": [], "name": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": 1492078721.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/653jsl/my_husband_raped_my_sister/", "num_reports": null, "locked": false, "stickied": false, "created": 1492089081.0, "url": "https://www.reddit.com/r/offmychest/comments/653jsl/my_husband_raped_my_sister/", "author_flair_text": null, "quarantine": false, "title": "My husband raped my sister.", "created_utc": 1492060281.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 110, "visited": false, "subreddit_type": "public", "ups": 1230}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg85f4j", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg8354c", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you so much for this. I am crying and I can't even process how much I appreciate you saying this and sharing. Luckily I already have my son in therapy for unrelated reasons, but he was asking questions and I didn't know how to explain it without cracking him open and sharing things best not shared with a little kid. I don't want to let him down, or let him feel like he is any less loved because of this.\n\nI'm glad to know there is another side to this. That at the end, you may not be perfect or happy all the time, but that there is something after this pain and this confusion and everything. Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for this. I am crying and I can&amp;#39;t even process how much I appreciate you saying this and sharing. Luckily I already have my son in therapy for unrelated reasons, but he was asking questions and I didn&amp;#39;t know how to explain it without cracking him open and sharing things best not shared with a little kid. I don&amp;#39;t want to let him down, or let him feel like he is any less loved because of this.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad to know there is another side to this. That at the end, you may not be perfect or happy all the time, but that there is something after this pain and this confusion and everything. Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg85f4j", "score_hidden": false, "stickied": false, "created": 1492143267.0, "created_utc": 1492114467.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg855r4", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "torsmork", "parent_id": "t1_dg8354c", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Listen to this OP. Rock solid advice. I wish I had someone who told me this when I went through my own abuse. But she is 1000% right and knows what she is talking about. Follow her advice and you will heal. We all love you and are here to help in any way we can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Listen to this OP. Rock solid advice. I wish I had someone who told me this when I went through my own abuse. But she is 1000% right and knows what she is talking about. Follow her advice and you will heal. We all love you and are here to help in any way we can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg855r4", "score_hidden": false, "stickied": false, "created": 1492142974.0, "created_utc": 1492114174.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8354c", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "lafindublonde", "parent_id": "t1_dg7chz0", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I was in a pretty rough head space right before I read your story (my post history will confirm this) and hearing your voice snapped me right out of my funk. \n\nLady I have felt that terror and isolation down in my marrow. I have looked at my babies and not been able to explain any of it to them, I have had to live my trauma right the fuck in front of everyone...all of them just WATCHING the worst tragedy of my life.\n\nIt is a nightmare. This really IS that bad. You are in crisis, falling apart is pretty much neccessary. \n\nI'm here to let you know that you are not alone and you're going to get through it, even though it seems like the worst shit just will not stop. I remember ranting, kind of maniacally, on more than one occasion to anyone who would listen, \"There are trap doors! I keep thinking it is rock bottom and holy shit another trap door! It will not end! What the fuck?!\"\n\nThat's going to happen, too.\n\nYou're going to get through it.\n\nI suggest journaling. All the honest, embarrassing, pathetic, angry stuff that you can't say to other people and barely want to admit to yourself. \n\nYou're also going to need a family therapist sooner rather than later. I waited too long to find help for my kids during the crisis we were having and I was so overwhelmed trying to care for them and care for myself. All the advice out there is about how to co-parent respectfully or how to sit down with your kids and your spouse and explain that mommy and daddy love them very much but aren't going to be together anymore...but?? \n\nHow in the fuck do you explain to a child that their dad, their hero, their DAD, is a bad guy and is going to jail?\n\nHow do you say that to your kids and hold them while they process it in their tiny little hearts?\n\nI sure as hell didn't know, and I dropped the ball on that. I found a social worker through their pediatrician as soon as I could but god, I have so many regrets with how I handled that.\n\n\nOK too much logistics talk. You can PM me anytime you want to talk or just wail or mash your keyboard with your fists. Please, please do. \n\nAnd for your heart:  try your very best to not let this experience rob you of your goodness and your big heart. Don't lose faith in people. Work hard on learning how to trust yourself and your choices and know that you are worthy of a good life filled with good, kind people. \n\nThey are everywhere. This bad apple is not representative of humanity. You might feel small and afraid to let someone see you, or know you, or hold you.  But oh my god be vulnerable. Crack wide open, you and your baby sister. You will be so amazed at the love that can pour in. And you will be so amazed at your own strength in recognizing the people who share your same heart, and dismissing the people who no longer serve you. \n\nThis is one of the moments in your life which will show you who you truly are. \n\nYou're going to be OK. \n\nI don't know you, but I love you. Sending big glowy care-bear style hearts right to you from my perch here sitting on top of my kids' mountain of laundry that I haven't folded. A year ago I was in shambles. Today I just have a list of chores to do. It's all going to be OK (then horrible, then OK, then horrible, then OK and eventually you'll be a pro).\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in a pretty rough head space right before I read your story (my post history will confirm this) and hearing your voice snapped me right out of my funk. &lt;/p&gt;\n\n&lt;p&gt;Lady I have felt that terror and isolation down in my marrow. I have looked at my babies and not been able to explain any of it to them, I have had to live my trauma right the fuck in front of everyone...all of them just WATCHING the worst tragedy of my life.&lt;/p&gt;\n\n&lt;p&gt;It is a nightmare. This really IS that bad. You are in crisis, falling apart is pretty much neccessary. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m here to let you know that you are not alone and you&amp;#39;re going to get through it, even though it seems like the worst shit just will not stop. I remember ranting, kind of maniacally, on more than one occasion to anyone who would listen, &amp;quot;There are trap doors! I keep thinking it is rock bottom and holy shit another trap door! It will not end! What the fuck?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s going to happen, too.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re going to get through it.&lt;/p&gt;\n\n&lt;p&gt;I suggest journaling. All the honest, embarrassing, pathetic, angry stuff that you can&amp;#39;t say to other people and barely want to admit to yourself. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re also going to need a family therapist sooner rather than later. I waited too long to find help for my kids during the crisis we were having and I was so overwhelmed trying to care for them and care for myself. All the advice out there is about how to co-parent respectfully or how to sit down with your kids and your spouse and explain that mommy and daddy love them very much but aren&amp;#39;t going to be together anymore...but?? &lt;/p&gt;\n\n&lt;p&gt;How in the fuck do you explain to a child that their dad, their hero, their DAD, is a bad guy and is going to jail?&lt;/p&gt;\n\n&lt;p&gt;How do you say that to your kids and hold them while they process it in their tiny little hearts?&lt;/p&gt;\n\n&lt;p&gt;I sure as hell didn&amp;#39;t know, and I dropped the ball on that. I found a social worker through their pediatrician as soon as I could but god, I have so many regrets with how I handled that.&lt;/p&gt;\n\n&lt;p&gt;OK too much logistics talk. You can PM me anytime you want to talk or just wail or mash your keyboard with your fists. Please, please do. &lt;/p&gt;\n\n&lt;p&gt;And for your heart:  try your very best to not let this experience rob you of your goodness and your big heart. Don&amp;#39;t lose faith in people. Work hard on learning how to trust yourself and your choices and know that you are worthy of a good life filled with good, kind people. &lt;/p&gt;\n\n&lt;p&gt;They are everywhere. This bad apple is not representative of humanity. You might feel small and afraid to let someone see you, or know you, or hold you.  But oh my god be vulnerable. Crack wide open, you and your baby sister. You will be so amazed at the love that can pour in. And you will be so amazed at your own strength in recognizing the people who share your same heart, and dismissing the people who no longer serve you. &lt;/p&gt;\n\n&lt;p&gt;This is one of the moments in your life which will show you who you truly are. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re going to be OK. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know you, but I love you. Sending big glowy care-bear style hearts right to you from my perch here sitting on top of my kids&amp;#39; mountain of laundry that I haven&amp;#39;t folded. A year ago I was in shambles. Today I just have a list of chores to do. It&amp;#39;s all going to be OK (then horrible, then OK, then horrible, then OK and eventually you&amp;#39;ll be a pro).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8354c", "score_hidden": false, "stickied": false, "created": 1492140772.0, "created_utc": 1492111972.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7p0p9", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "esca6angel", "parent_id": "t1_dg7chz0", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Don't ever think you're crazy, you are a good mother and sister and you feel this way because you are a good person. We can't change the past, but we can fight for our future. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t ever think you&amp;#39;re crazy, you are a good mother and sister and you feel this way because you are a good person. We can&amp;#39;t change the past, but we can fight for our future. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7p0p9", "score_hidden": false, "stickied": false, "created": 1492125691.0, "created_utc": 1492096891.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8dwy3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tealparadise", "parent_id": "t1_dg7chz0", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You've been shoved into a crazy situation.  You are allowed to feel crazy.  You have a right to feel however you feel- you are not responsible for this.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve been shoved into a crazy situation.  You are allowed to feel crazy.  You have a right to feel however you feel- you are not responsible for this.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8dwy3", "score_hidden": false, "stickied": false, "created": 1492153709.0, "created_utc": 1492124909.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7chz0", "gilded": 0, "archived": false, "score": 184, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7bw7i", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you so much for this. I am sitting here crying because I think I really needed someone to put into words that I'm not crazy for feeling this way, and that I am not a bad person for not being able to reconcile what he's done with who I thought he was.\n\nI'm sorry that you had to experience a similar pain, and thank you for letting your experience give you the words to make mine feel a little less confusing for the moment. I really appreciate you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for this. I am sitting here crying because I think I really needed someone to put into words that I&amp;#39;m not crazy for feeling this way, and that I am not a bad person for not being able to reconcile what he&amp;#39;s done with who I thought he was.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry that you had to experience a similar pain, and thank you for letting your experience give you the words to make mine feel a little less confusing for the moment. I really appreciate you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7chz0", "score_hidden": false, "stickied": false, "created": 1492104237.0, "created_utc": 1492075437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 184}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7sylx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BigPinkPanther", "parent_id": "t1_dg7mrrr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Second that.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Second that.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7sylx", "score_hidden": false, "stickied": false, "created": 1492129879.0, "created_utc": 1492101079.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mrrr", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Durbee", "parent_id": "t1_dg7bw7i", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Beautifully said.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Beautifully said.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7mrrr", "score_hidden": false, "stickied": false, "created": 1492123182.0, "created_utc": 1492094382.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bw7i", "gilded": 1, "archived": false, "score": 391, "report_reasons": null, "author": "lafindublonde", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This is his shame and his guilt and his rot that you are wearing, love. It is not yours. It is not your sister's. You're both going to take it on because you're good, loving people and I can tell that just from this post. You're going to both try to absorb all kinds of hurt and pain and blame from one another and the circumstances around you.\n\nTherapy, therapy, therapy. For you both as individuals and together so you can start to move forward and have support during the fallout of this awful, awful revelation.\n\nAnd it's OK to still love someone that has done horrible things. It's OK to not understand it and to feel disgusted and wounded and also want to run to that person for comfort, the way you have been doing for years and imagined you would be doing for the rest of your life. It is not all going to heal in an instant, the love and disgust will coexist and smash up against each other. \n\nIt is like floating outside your own body when your trust gets betrayed like that. My situation wasn't the same, but my ex spouse had a life in secret that I never knew about, and he was more dangerous and vile and reckless and frightening than I ever thought possible. I couldn't reconcile it with the man I (thought) I knew. \n\nAt times I'd think *Who will hold me? Who will hold me?* when everything blew up and he was in jail. It felt pathetic to think that way, but I still let myself feel it because it was real. \n\n\nIt will take time and therapy and more time to snap you back into yourself. It's OK to float in anguish for awhile. That's the only thing for it. \n\nYou will learn to hold yourself. \n\n\n\nThe only thing you did was trust the person that you loved- and that isn't a mistake. That's what you're supposed to do. You are a healthy, normal and good person. \n\nYou are showing your sister just how much you love her by charging at this situation with your full force. Even with your broken heart and your confusion and your feelings of unworthiness, you are going to battle for her. That is exactly who she needs you to be.\n\n&amp;nbsp;\nEdit: Oh my gosh, thank you for the gold! This is unexpected and really validating. Cool. What a bunch of great people hanging around in this sub. Goodness. ", "edited": 1492252011.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is his shame and his guilt and his rot that you are wearing, love. It is not yours. It is not your sister&amp;#39;s. You&amp;#39;re both going to take it on because you&amp;#39;re good, loving people and I can tell that just from this post. You&amp;#39;re going to both try to absorb all kinds of hurt and pain and blame from one another and the circumstances around you.&lt;/p&gt;\n\n&lt;p&gt;Therapy, therapy, therapy. For you both as individuals and together so you can start to move forward and have support during the fallout of this awful, awful revelation.&lt;/p&gt;\n\n&lt;p&gt;And it&amp;#39;s OK to still love someone that has done horrible things. It&amp;#39;s OK to not understand it and to feel disgusted and wounded and also want to run to that person for comfort, the way you have been doing for years and imagined you would be doing for the rest of your life. It is not all going to heal in an instant, the love and disgust will coexist and smash up against each other. &lt;/p&gt;\n\n&lt;p&gt;It is like floating outside your own body when your trust gets betrayed like that. My situation wasn&amp;#39;t the same, but my ex spouse had a life in secret that I never knew about, and he was more dangerous and vile and reckless and frightening than I ever thought possible. I couldn&amp;#39;t reconcile it with the man I (thought) I knew. &lt;/p&gt;\n\n&lt;p&gt;At times I&amp;#39;d think &lt;em&gt;Who will hold me? Who will hold me?&lt;/em&gt; when everything blew up and he was in jail. It felt pathetic to think that way, but I still let myself feel it because it was real. &lt;/p&gt;\n\n&lt;p&gt;It will take time and therapy and more time to snap you back into yourself. It&amp;#39;s OK to float in anguish for awhile. That&amp;#39;s the only thing for it. &lt;/p&gt;\n\n&lt;p&gt;You will learn to hold yourself. &lt;/p&gt;\n\n&lt;p&gt;The only thing you did was trust the person that you loved- and that isn&amp;#39;t a mistake. That&amp;#39;s what you&amp;#39;re supposed to do. You are a healthy, normal and good person. &lt;/p&gt;\n\n&lt;p&gt;You are showing your sister just how much you love her by charging at this situation with your full force. Even with your broken heart and your confusion and your feelings of unworthiness, you are going to battle for her. That is exactly who she needs you to be.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;\nEdit: Oh my gosh, thank you for the gold! This is unexpected and really validating. Cool. What a bunch of great people hanging around in this sub. Goodness. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7bw7i", "score_hidden": false, "stickied": false, "created": 1492102371.0, "created_utc": 1492073571.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 391}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7zf3f", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "Incomplete_Jigsaw", "parent_id": "t1_dg7e3kk", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "&gt;I don't know how he can live with himself after what he did.\n\nWell, he raped a 16 year old kid.. I don't think he has the same standards you and I might have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t know how he can live with himself after what he did.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, he raped a 16 year old kid.. I don&amp;#39;t think he has the same standards you and I might have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7zf3f", "score_hidden": false, "stickied": false, "created": 1492136749.0, "created_utc": 1492107949.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e3kk", "gilded": 0, "archived": false, "score": 272, "report_reasons": null, "author": "LauraEvangeline", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'd press charges. What he did is so disgusting. You let him into your life and he betrayed you, he betrayed your little sister. He hurt her, a child at the time. It wasn't \"oh, I'm going to have an affair,\" it was \"I'm going to force my power onto my wife's child sister.\" \n\nYou shouldn't be the one wanting to harm your self. You did nothing wrong.\n\nIt should be the other way around. I don't know how he can live with himself after what he did. I'm glad you let his parents know, I hope the whole world knows what kind of monster he is. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d press charges. What he did is so disgusting. You let him into your life and he betrayed you, he betrayed your little sister. He hurt her, a child at the time. It wasn&amp;#39;t &amp;quot;oh, I&amp;#39;m going to have an affair,&amp;quot; it was &amp;quot;I&amp;#39;m going to force my power onto my wife&amp;#39;s child sister.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;You shouldn&amp;#39;t be the one wanting to harm your self. You did nothing wrong.&lt;/p&gt;\n\n&lt;p&gt;It should be the other way around. I don&amp;#39;t know how he can live with himself after what he did. I&amp;#39;m glad you let his parents know, I hope the whole world knows what kind of monster he is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7e3kk", "score_hidden": false, "stickied": false, "created": 1492109014.0, "created_utc": 1492080214.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 272}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8mhth", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "panornia", "parent_id": "t1_dg7mbxr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "There is a lot of excellent advice in this thread, OP, but please, please, please listen to this person. Call an attorney. Call the police.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a lot of excellent advice in this thread, OP, but please, please, please listen to this person. Call an attorney. Call the police.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8mhth", "score_hidden": false, "stickied": false, "created": 1492165457.0, "created_utc": 1492136657.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mbxr", "gilded": 0, "archived": false, "score": 83, "report_reasons": null, "author": "tbarnes472", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "&gt;I have an appointment with my psychiatrist tomorrow morning &amp; plan to request an emergency appointment with my therapist.\n\n&gt;Right now we're discussing whether or not to press charges against him. \n\nI would be afraid you would lose custody if you dont. \n\nPeople make all kinds of wild accusations during a divorce as a tactic. Divorce courts rarely even issue restraining orders because they are used as a tool. \n\nI would stop talking to ANYONE but my attorney and then the police. \n\nIf he pulled this off he can start lying and try to turn this around on you. \n\n**Call an attorney NOW. EVEN BEFORE YOUR THERAPIST. You have yourself a very very deliberate and controlled husband.** \n\n**When people use the words sociopath or psychopath or narcicisst..Your husband and how he did this and pulled it off is the type of person they mean.**", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have an appointment with my psychiatrist tomorrow morning &amp;amp; plan to request an emergency appointment with my therapist.&lt;/p&gt;\n\n&lt;p&gt;Right now we&amp;#39;re discussing whether or not to press charges against him. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would be afraid you would lose custody if you dont. &lt;/p&gt;\n\n&lt;p&gt;People make all kinds of wild accusations during a divorce as a tactic. Divorce courts rarely even issue restraining orders because they are used as a tool. &lt;/p&gt;\n\n&lt;p&gt;I would stop talking to ANYONE but my attorney and then the police. &lt;/p&gt;\n\n&lt;p&gt;If he pulled this off he can start lying and try to turn this around on you. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Call an attorney NOW. EVEN BEFORE YOUR THERAPIST. You have yourself a very very deliberate and controlled husband.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;When people use the words sociopath or psychopath or narcicisst..Your husband and how he did this and pulled it off is the type of person they mean.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7mbxr", "score_hidden": false, "stickied": false, "created": 1492122666.0, "created_utc": 1492093866.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 83}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7ocsd", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Woodguy2012", "parent_id": "t1_dg7gpwf", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "He NEEDS to be charged. \n\nFtfy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He NEEDS to be charged. &lt;/p&gt;\n\n&lt;p&gt;Ftfy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7ocsd", "score_hidden": false, "stickied": false, "created": 1492124958.0, "created_utc": 1492096158.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8dtep", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "tealparadise", "parent_id": "t1_dg7gpwf", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm not a lawyer, but I'm guessing having an official report and investigation going during the divorce will help OP with any custody issues.  Whereas if nothing official is done it would be he said / she said when they're making arguments for custody.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not a lawyer, but I&amp;#39;m guessing having an official report and investigation going during the divorce will help OP with any custody issues.  Whereas if nothing official is done it would be he said / she said when they&amp;#39;re making arguments for custody.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8dtep", "score_hidden": false, "stickied": false, "created": 1492153576.0, "created_utc": 1492124776.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7s0xh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "magaloo202", "parent_id": "t1_dg7gpwf", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Especially for their child's sake.. as sick as it is to think about, it doesn't seem to be an outrageous concern about this guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Especially for their child&amp;#39;s sake.. as sick as it is to think about, it doesn&amp;#39;t seem to be an outrageous concern about this guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7s0xh", "score_hidden": false, "stickied": false, "created": 1492128889.0, "created_utc": 1492100089.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7gpwf", "gilded": 0, "archived": false, "score": 68, "report_reasons": null, "author": "Everest1986", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "He needs to be charged. You really don't want to chance him doing this to someone else. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He needs to be charged. You really don&amp;#39;t want to chance him doing this to someone else. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7gpwf", "score_hidden": false, "stickied": false, "created": 1492114862.0, "created_utc": 1492086062.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 68}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7j2xc", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "torsmork", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I think you should do a print out of this post and bring along to show your therapist. You express your self in a way the therapist is able to help you.Thank you for getting help for your self.\n\nPressing charges could be a way of you showing your sister that you are there for her, but I'm no psychologist.\n\nAnd it really hurts to say this, but I would also check your young for child abuse. If he was able to do something this horrible, I would assume there would be no stop to his evil.\n\nProtect you, your child and your sister. I'm so sorry this happened. It was out of your hands as you where manipulated. You did not know. Stick to therapy as this sadly will take time. I wish you the very best in life for you and the ones you love.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should do a print out of this post and bring along to show your therapist. You express your self in a way the therapist is able to help you.Thank you for getting help for your self.&lt;/p&gt;\n\n&lt;p&gt;Pressing charges could be a way of you showing your sister that you are there for her, but I&amp;#39;m no psychologist.&lt;/p&gt;\n\n&lt;p&gt;And it really hurts to say this, but I would also check your young for child abuse. If he was able to do something this horrible, I would assume there would be no stop to his evil.&lt;/p&gt;\n\n&lt;p&gt;Protect you, your child and your sister. I&amp;#39;m so sorry this happened. It was out of your hands as you where manipulated. You did not know. Stick to therapy as this sadly will take time. I wish you the very best in life for you and the ones you love.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7j2xc", "score_hidden": false, "stickied": false, "created": 1492118545.0, "created_utc": 1492089745.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg76w21", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "DenMother8", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Im glad to hear that.Good luck to you and may all turn out for the best for all involved - it helps to write it all out :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im glad to hear that.Good luck to you and may all turn out for the best for all involved - it helps to write it all out :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg76w21", "score_hidden": false, "stickied": false, "created": 1492089489.0, "created_utc": 1492060689.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7oq9k", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "KingMidasFingering", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I hope y'all decide to press charges. What an awful human being", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope y&amp;#39;all decide to press charges. What an awful human being&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7oq9k", "score_hidden": false, "stickied": false, "created": 1492125372.0, "created_utc": 1492096572.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7lq5k", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "creature_aether", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Yes press charges. He took advantage of a young vulnerable girl, especially your sister who probably trusted him at the time. He committed adultery. He had no intention of coming clean and no qualms about it. And the cherry on top is that he neglected parenting for this heinous act. \rDisregard your feelings as much as possible bec it sounds like you love someone different than who he really is. \rI pray you and your family can begin healing and pick up a healthy new life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes press charges. He took advantage of a young vulnerable girl, especially your sister who probably trusted him at the time. He committed adultery. He had no intention of coming clean and no qualms about it. And the cherry on top is that he neglected parenting for this heinous act. \nDisregard your feelings as much as possible bec it sounds like you love someone different than who he really is. \nI pray you and your family can begin healing and pick up a healthy new life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7lq5k", "score_hidden": false, "stickied": false, "created": 1492121957.0, "created_utc": 1492093157.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8mk9v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "panornia", "parent_id": "t1_dg80ht9", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Press charges. He deserves to rot in prison for what he did to your sister. Do everything you can to make sure he cannot do it to another woman or child. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Press charges. He deserves to rot in prison for what he did to your sister. Do everything you can to make sure he cannot do it to another woman or child. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8mk9v", "score_hidden": false, "stickied": false, "created": 1492165559.0, "created_utc": 1492136759.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80ht9", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7djy8", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "10 years here, since she was a minor. We checked last night to make sure that we could press charges if that's what our family decides to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;10 years here, since she was a minor. We checked last night to make sure that we could press charges if that&amp;#39;s what our family decides to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg80ht9", "score_hidden": false, "stickied": false, "created": 1492137899.0, "created_utc": 1492109099.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7kvlo", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "highheelcyanide", "parent_id": "t1_dg7kb1z", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I think in most it's 5 years after they come of age. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think in most it&amp;#39;s 5 years after they come of age. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7kvlo", "score_hidden": false, "stickied": false, "created": 1492120910.0, "created_utc": 1492092110.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kb1z", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "clockwerkman", "parent_id": "t1_dg7djy8", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It actually varies a lot by state, and since this involved a minor, most states have either no statute of limitations, or a very long one.\n\nBut yeah, the dude needs to be in jail.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It actually varies a lot by state, and since this involved a minor, most states have either no statute of limitations, or a very long one.&lt;/p&gt;\n\n&lt;p&gt;But yeah, the dude needs to be in jail.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7kb1z", "score_hidden": false, "stickied": false, "created": 1492120179.0, "created_utc": 1492091379.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7djy8", "gilded": 0, "archived": false, "score": 68, "report_reasons": null, "author": "PatrickPlan8", "parent_id": "t1_dg7cwkt", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Statue of limitations on rape is 5 years in most states. Call the cops asap!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Statue of limitations on rape is 5 years in most states. Call the cops asap!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7djy8", "score_hidden": false, "stickied": false, "created": 1492107433.0, "created_utc": 1492078633.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 68}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg817yh", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "UnicornPlus", "parent_id": "t1_dg7yyop", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Im so glad to hear that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im so glad to hear that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg817yh", "score_hidden": false, "stickied": false, "created": 1492138678.0, "created_utc": 1492109878.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yyop", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7una2", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I won't let anything stop me from filing for divorce.\n\nMy sister is much younger than me - I helped raise her and am her \"second mom.\" She's more like my daughter than my sister.\n\nThere is nothing that could ever make me take him back. Nothing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I won&amp;#39;t let anything stop me from filing for divorce.&lt;/p&gt;\n\n&lt;p&gt;My sister is much younger than me - I helped raise her and am her &amp;quot;second mom.&amp;quot; She&amp;#39;s more like my daughter than my sister.&lt;/p&gt;\n\n&lt;p&gt;There is nothing that could ever make me take him back. Nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7yyop", "score_hidden": false, "stickied": false, "created": 1492136268.0, "created_utc": 1492107468.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7una2", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "UnicornPlus", "parent_id": "t1_dg7cwkt", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Don't believe that sick fuck. If he did it to your little sister, he maybe/probably did it to other girls. He will try to manipulate you into staying and not filing for divorce. Stay strong. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t believe that sick fuck. If he did it to your little sister, he maybe/probably did it to other girls. He will try to manipulate you into staying and not filing for divorce. Stay strong. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7una2", "score_hidden": false, "stickied": false, "created": 1492131677.0, "created_utc": 1492102877.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg813gh", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "chasing_cheerios", "parent_id": "t1_dg7cwkt", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "When I was 16 my non blood Uncle molested me and insinuated that I \"wanted it as much as him\". Clearly I didn't. I was scared and intimidated. I'm sure your sister was too. But even if- in the minds of twisted people like my uncle and your soon to be ex we did \"want it\" THEY are the adults. THEY are the ones who know that it is wrong on every level, including legally. It can't be intercourse, it's statutory rape and they know that they just don't fucking care. I'm so sorry you're all going through this.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was 16 my non blood Uncle molested me and insinuated that I &amp;quot;wanted it as much as him&amp;quot;. Clearly I didn&amp;#39;t. I was scared and intimidated. I&amp;#39;m sure your sister was too. But even if- in the minds of twisted people like my uncle and your soon to be ex we did &amp;quot;want it&amp;quot; THEY are the adults. THEY are the ones who know that it is wrong on every level, including legally. It can&amp;#39;t be intercourse, it&amp;#39;s statutory rape and they know that they just don&amp;#39;t fucking care. I&amp;#39;m so sorry you&amp;#39;re all going through this.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg813gh", "score_hidden": false, "stickied": false, "created": 1492138542.0, "created_utc": 1492109742.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7oex6", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "mydaddyisadrunkass", "parent_id": "t1_dg7d8g7", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It is a myth that we believe children must maintain a relationship with a shitty parent. There are studies now showing that children are better off not having any contact with an abusive or addicted parent- even if the child is not a target. \n\nIf a stranger who raped your sister filed for custody of your son you would raise  holy hell, right? This man is a stranger. He lied and manipulated every woman in his world FOR YEARS. Fight for all your sakes. \n\nYour son will suffer in the short term but he will not suffer his whole life with more years of his dad misleading him about what is ok when it comes to power over others. \n\nAnd fight for your sister's sake. Letting her nephew continue contact with him send a twisted message I know you don't  mean to send. Protecting him IS protecting her healing process too. \n\nHumans hate being fooled by a dangerous person. It fills us with horrible feelings. What you do NEXT is the most important thing at this point. Cut him off completely, lawyer up, report this shit so there is a record, and get on with your lives. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is a myth that we believe children must maintain a relationship with a shitty parent. There are studies now showing that children are better off not having any contact with an abusive or addicted parent- even if the child is not a target. &lt;/p&gt;\n\n&lt;p&gt;If a stranger who raped your sister filed for custody of your son you would raise  holy hell, right? This man is a stranger. He lied and manipulated every woman in his world FOR YEARS. Fight for all your sakes. &lt;/p&gt;\n\n&lt;p&gt;Your son will suffer in the short term but he will not suffer his whole life with more years of his dad misleading him about what is ok when it comes to power over others. &lt;/p&gt;\n\n&lt;p&gt;And fight for your sister&amp;#39;s sake. Letting her nephew continue contact with him send a twisted message I know you don&amp;#39;t  mean to send. Protecting him IS protecting her healing process too. &lt;/p&gt;\n\n&lt;p&gt;Humans hate being fooled by a dangerous person. It fills us with horrible feelings. What you do NEXT is the most important thing at this point. Cut him off completely, lawyer up, report this shit so there is a record, and get on with your lives. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7oex6", "score_hidden": false, "stickied": false, "created": 1492125025.0, "created_utc": 1492096225.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d8g7", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7d1yj", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It absolutely is devastating and crushing and exhausting and awful. The betrayal, the guilt, the rage, the grief, the horrible feeling that I just can't convey in words is encompassing and it makes it hard to breathe.\n\nI've already told my stbx that when our son is old enough to understand I will give him all the information and let him decide what to do. My sister and I agreed that we would make sure he knows that we don't have a bias either way - it's his choice to terminate or continue a relationship with his father when he's old enough to understand.\n\nIronically that date is not far off. As I myself am a childhood sexual abuse and rape survivor I have always been very vigilant about explaining consent and the concept of sexual abuse to my child. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It absolutely is devastating and crushing and exhausting and awful. The betrayal, the guilt, the rage, the grief, the horrible feeling that I just can&amp;#39;t convey in words is encompassing and it makes it hard to breathe.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve already told my stbx that when our son is old enough to understand I will give him all the information and let him decide what to do. My sister and I agreed that we would make sure he knows that we don&amp;#39;t have a bias either way - it&amp;#39;s his choice to terminate or continue a relationship with his father when he&amp;#39;s old enough to understand.&lt;/p&gt;\n\n&lt;p&gt;Ironically that date is not far off. As I myself am a childhood sexual abuse and rape survivor I have always been very vigilant about explaining consent and the concept of sexual abuse to my child. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7d8g7", "score_hidden": false, "stickied": false, "created": 1492106487.0, "created_utc": 1492077687.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 50}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7d1yj", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "stjarnlax", "parent_id": "t1_dg7cwkt", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Wow okay \nI cant even begin to imagine how Id feel if my boyfriend did that to my sister- I think murderously angry, but also as you say hurt in some ways with regards to yourself and not being good enough, and the betrayal of his love but all confused by the fact that you love in and in an instance of finding out all that love is supposed to go away cause they committed this awful crime. \nI really dont know the situation but I would think, perhaps, depending on how remorseful he is- but as he has not told you for so long and encouraged you to make her spend more time with him, and tried to deny or or twist it now perhaps it is best to press charges. \nAlthough I dont know because then you are dragged into this big legal process. \nI think its important, so sadly, for your child to know when he is old enough. \nThis whole situaiton and all the emotional havoc must be completely exhausting and devastating", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow okay \nI cant even begin to imagine how Id feel if my boyfriend did that to my sister- I think murderously angry, but also as you say hurt in some ways with regards to yourself and not being good enough, and the betrayal of his love but all confused by the fact that you love in and in an instance of finding out all that love is supposed to go away cause they committed this awful crime. \nI really dont know the situation but I would think, perhaps, depending on how remorseful he is- but as he has not told you for so long and encouraged you to make her spend more time with him, and tried to deny or or twist it now perhaps it is best to press charges. \nAlthough I dont know because then you are dragged into this big legal process. \nI think its important, so sadly, for your child to know when he is old enough. \nThis whole situaiton and all the emotional havoc must be completely exhausting and devastating&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7d1yj", "score_hidden": false, "stickied": false, "created": 1492105937.0, "created_utc": 1492077137.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7cwkt", "gilded": 0, "archived": false, "score": 112, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7clkx", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "First he lied and spun a story that painted him as much more innocent.\n\nAfter confronted with evidence to the contrary he finally, grudgingly, admitted that there had been \"intercourse\" but firmly insisted that it wasn't rape.\n\nHe said he was sorry, like it means fucking anything.\n\nI asked him if he even had a fucking soul because he's a monster.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First he lied and spun a story that painted him as much more innocent.&lt;/p&gt;\n\n&lt;p&gt;After confronted with evidence to the contrary he finally, grudgingly, admitted that there had been &amp;quot;intercourse&amp;quot; but firmly insisted that it wasn&amp;#39;t rape.&lt;/p&gt;\n\n&lt;p&gt;He said he was sorry, like it means fucking anything.&lt;/p&gt;\n\n&lt;p&gt;I asked him if he even had a fucking soul because he&amp;#39;s a monster.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7cwkt", "score_hidden": false, "stickied": false, "created": 1492105485.0, "created_utc": 1492076685.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 112}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7clkx", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "stjarnlax", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "oh man what a choice \nThat must be extremely difficult\nWhat has your husband said when you confronted him about this?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh man what a choice \nThat must be extremely difficult\nWhat has your husband said when you confronted him about this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7clkx", "score_hidden": false, "stickied": false, "created": 1492104535.0, "created_utc": 1492075735.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7sldy", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "baconmastah", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Do it. The guy's a fucking pedo. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do it. The guy&amp;#39;s a fucking pedo. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7sldy", "score_hidden": false, "stickied": false, "created": 1492129488.0, "created_utc": 1492100688.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7sn28", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "WinterCharm", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Get your sister therapy too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get your sister therapy too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7sn28", "score_hidden": false, "stickied": false, "created": 1492129537.0, "created_utc": 1492100737.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8eui7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sewallthethings", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You absolutely must press charges. It will be a difficult process for both you and your sister, but it has to happen. If you don't press charges, nothing will stop him from doing this to someone else. It is highly likely that he *has* done this to someone else-rapists are often not one-time monsters. What happened to your sister was not your fault and you could not have prevented it, but now you have the extraordinary power to protect other children by making sure this monster goes to jail. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You absolutely must press charges. It will be a difficult process for both you and your sister, but it has to happen. If you don&amp;#39;t press charges, nothing will stop him from doing this to someone else. It is highly likely that he &lt;em&gt;has&lt;/em&gt; done this to someone else-rapists are often not one-time monsters. What happened to your sister was not your fault and you could not have prevented it, but now you have the extraordinary power to protect other children by making sure this monster goes to jail. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8eui7", "score_hidden": false, "stickied": false, "created": 1492154957.0, "created_utc": 1492126157.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dgdl3ps", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thatswhatpamsaid", "parent_id": "t1_dg76tze", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "My best friend was in a relationship with a dude who was emotionally abusive. Her last day in their apartment they had with a roommate and her boyfriend was about to leave to go out with some friends and she was about to head to work, and he was waiting for her to finish cooking. Their roommate was at work during this time and they were in need of a grocery trip, so the only thing they had left in the house was a box of Kraft macaroni and cheese that she was making. Her and her boyfriend ended up getting into a fight and he got so mad at her her took the pot of noodles (it has cooled down to be under boiling) and threw the water at her and threw the noodles in the trash. Her purse and stuff was in the car, so he took the car with all her money in it and left, and she had to walk 4 miles to work in a city at 11 in the afternoon in 100 degree weather. \n\nWhen she got home a few hours later (roommate still at work) her boyfriend was leaving to go out and party with friends, and still mad at her he grabbed her and started shaking her violently and threw her on the bed. After calling me and her mom and us three arranging a ride (she was three hours away) her roommate got home and saw her crying and asked why, so she explained the situation to him and said she's leaving. \n\nShe didn't know if her boyfriend would come back that night so she asked her roommate to wait up with her. He asked her if she was going to press charges and she replied she can't because there wasn't anyone who saw or heard anything and she didn't have any marks. Well, what he said to her always stuck with her and me and I think it would really help in this situation. \n\nHe said, \"Just because you can prove to THEM a crime happened, doesn't mean it didn't happened. If a crime happened, you should report it because if you don't you run the risk of the crime happening again to your or to someone else, and you or them may not be so lucky. And you may regret not reporting it.\"\n\nShe ended up reporting the crime and, even though they couldn't DO anything, they told her that if he does anything like that to her or anyone else they have a record of the report that could help if they have to deal with him again. It also helped her move on. It may help you guys move on, and it may help the police and anyone else who may be or has been a victim. \n\nAnd I am not religious in any way, but just know that you are in my thoughts and that I really hope you guys get through this. I love you and your courage and strength, and I hope that if there is a God that you, your sister, and your son are under his protection. And I hope you find peace after this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My best friend was in a relationship with a dude who was emotionally abusive. Her last day in their apartment they had with a roommate and her boyfriend was about to leave to go out with some friends and she was about to head to work, and he was waiting for her to finish cooking. Their roommate was at work during this time and they were in need of a grocery trip, so the only thing they had left in the house was a box of Kraft macaroni and cheese that she was making. Her and her boyfriend ended up getting into a fight and he got so mad at her her took the pot of noodles (it has cooled down to be under boiling) and threw the water at her and threw the noodles in the trash. Her purse and stuff was in the car, so he took the car with all her money in it and left, and she had to walk 4 miles to work in a city at 11 in the afternoon in 100 degree weather. &lt;/p&gt;\n\n&lt;p&gt;When she got home a few hours later (roommate still at work) her boyfriend was leaving to go out and party with friends, and still mad at her he grabbed her and started shaking her violently and threw her on the bed. After calling me and her mom and us three arranging a ride (she was three hours away) her roommate got home and saw her crying and asked why, so she explained the situation to him and said she&amp;#39;s leaving. &lt;/p&gt;\n\n&lt;p&gt;She didn&amp;#39;t know if her boyfriend would come back that night so she asked her roommate to wait up with her. He asked her if she was going to press charges and she replied she can&amp;#39;t because there wasn&amp;#39;t anyone who saw or heard anything and she didn&amp;#39;t have any marks. Well, what he said to her always stuck with her and me and I think it would really help in this situation. &lt;/p&gt;\n\n&lt;p&gt;He said, &amp;quot;Just because you can prove to THEM a crime happened, doesn&amp;#39;t mean it didn&amp;#39;t happened. If a crime happened, you should report it because if you don&amp;#39;t you run the risk of the crime happening again to your or to someone else, and you or them may not be so lucky. And you may regret not reporting it.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She ended up reporting the crime and, even though they couldn&amp;#39;t DO anything, they told her that if he does anything like that to her or anyone else they have a record of the report that could help if they have to deal with him again. It also helped her move on. It may help you guys move on, and it may help the police and anyone else who may be or has been a victim. &lt;/p&gt;\n\n&lt;p&gt;And I am not religious in any way, but just know that you are in my thoughts and that I really hope you guys get through this. I love you and your courage and strength, and I hope that if there is a God that you, your sister, and your son are under his protection. And I hope you find peace after this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdl3ps", "score_hidden": false, "stickied": false, "created": 1492470136.0, "created_utc": 1492441336.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76tze", "gilded": 0, "archived": false, "score": 265, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg76s8e", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I have an appointment with my psychiatrist tomorrow morning &amp; plan to request an emergency appointment with my therapist.\n\nRight now we're discussing whether or not to press charges against him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have an appointment with my psychiatrist tomorrow morning &amp;amp; plan to request an emergency appointment with my therapist.&lt;/p&gt;\n\n&lt;p&gt;Right now we&amp;#39;re discussing whether or not to press charges against him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg76tze", "score_hidden": false, "stickied": false, "created": 1492089378.0, "created_utc": 1492060578.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 265}}], "after": null, "before": null}}, "user_reports": [], "id": "dg76s8e", "gilded": 0, "archived": false, "score": 333, "report_reasons": null, "author": "DenMother8", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Therapy may help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Therapy may help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg76s8e", "score_hidden": false, "stickied": false, "created": 1492089287.0, "created_utc": 1492060487.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 333}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7b9bo", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg79xa7", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you for saying that. I appreciate your kind words.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for saying that. I appreciate your kind words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7b9bo", "score_hidden": false, "stickied": false, "created": 1492100449.0, "created_utc": 1492071649.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 34}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79xa7", "gilded": 0, "archived": false, "score": 79, "report_reasons": null, "author": "AliceRat", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Wow. Thus is so so so not your fault, and what you're feeling is so natural. You've been with him for a long time. That's not going to go away in a day. Your sister will heal, and so will you. Stay strong for your sis and your son. Good luck to you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. Thus is so so so not your fault, and what you&amp;#39;re feeling is so natural. You&amp;#39;ve been with him for a long time. That&amp;#39;s not going to go away in a day. Your sister will heal, and so will you. Stay strong for your sis and your son. Good luck to you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg79xa7", "score_hidden": false, "stickied": false, "created": 1492096627.0, "created_utc": 1492067827.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 79}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg82q6m", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "rainbowtwinkies", "parent_id": "t1_dg80c12", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Dont forget that youre allowed to hurt too. Im glad you can cry together. Stay strong, but let yourself heal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dont forget that youre allowed to hurt too. Im glad you can cry together. Stay strong, but let yourself heal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg82q6m", "score_hidden": false, "stickied": false, "created": 1492140320.0, "created_utc": 1492111520.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80c12", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7eatr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "She says she's okay. She's coping.\n\nI think she's trying to be strong for me because she knows I'm hurting, but I don't want her to carry my pain too so I'm trying to give her what she needs and it's creating this kind of... feedback loop where we just cry at each other a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She says she&amp;#39;s okay. She&amp;#39;s coping.&lt;/p&gt;\n\n&lt;p&gt;I think she&amp;#39;s trying to be strong for me because she knows I&amp;#39;m hurting, but I don&amp;#39;t want her to carry my pain too so I&amp;#39;m trying to give her what she needs and it&amp;#39;s creating this kind of... feedback loop where we just cry at each other a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg80c12", "score_hidden": false, "stickied": false, "created": 1492137727.0, "created_utc": 1492108927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7mll9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Suvtropics", "parent_id": "t1_dg7eatr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I second this. You need to make sure she's healing properly. That's what she needs the most. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I second this. You need to make sure she&amp;#39;s healing properly. That&amp;#39;s what she needs the most. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7mll9", "score_hidden": false, "stickied": false, "created": 1492122979.0, "created_utc": 1492094179.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7eatr", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "MarieMerck", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Is your sis ok? How she handles it? \nYou need to focus on your boy and her. Its not your fault, but it should be your duty to help them heal. I believe you will heal together. And you should do everything you can to keep that monster away from them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is your sis ok? How she handles it? \nYou need to focus on your boy and her. Its not your fault, but it should be your duty to help them heal. I believe you will heal together. And you should do everything you can to keep that monster away from them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7eatr", "score_hidden": false, "stickied": false, "created": 1492109575.0, "created_utc": 1492080775.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg77hlq", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "the_great_unknown", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I hope you do press charges. You didn't do anything wrong here. So sorry for your family. Eff that guy though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you do press charges. You didn&amp;#39;t do anything wrong here. So sorry for your family. Eff that guy though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg77hlq", "score_hidden": false, "stickied": false, "created": 1492090704.0, "created_utc": 1492061904.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7b8cr", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7akez", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "She was and is. I'm so grateful that she knows she can trust me - even if she thought she was protecting me by not telling me before.\n\nThank you for your kind words.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She was and is. I&amp;#39;m so grateful that she knows she can trust me - even if she thought she was protecting me by not telling me before.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your kind words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7b8cr", "score_hidden": false, "stickied": false, "created": 1492100368.0, "created_utc": 1492071568.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7akez", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "PoeticMilk", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm so sorry you are going through this...but remember it's not your fault, he's the rapist. And your sister was so brave by telling you instead of letting it go. You (and your sister and your son) will make it through this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry you are going through this...but remember it&amp;#39;s not your fault, he&amp;#39;s the rapist. And your sister was so brave by telling you instead of letting it go. You (and your sister and your son) will make it through this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7akez", "score_hidden": false, "stickied": false, "created": 1492098423.0, "created_utc": 1492069623.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7dh3c", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7dfdl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I hope that place exists and that we all find our way there soon.\n\nThank you. &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope that place exists and that we all find our way there soon.&lt;/p&gt;\n\n&lt;p&gt;Thank you. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7dh3c", "score_hidden": false, "stickied": false, "created": 1492107200.0, "created_utc": 1492078400.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dfdl", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "suspiciouselipsis", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I. Can't even begin to fathom the pain you all must be going through.\nAnd I'm so sorry for that.\nI'm so glad to hear you have a therapist to help you through this\nSo I won't address every point. I'm far too long winded, if I let myself go down that rabbit hole no one will be able to put themselves through reading my supportive tirade.\nInstead I'll just say that I'm sending you and your beautiful family all the love I can from the bottom of my heart!\nYou know this isn't your fault, in spite of how it feels. You're going to stick together and help each other through this, and as long as you do there's nothing in this universe you can't face down!\nOne day you'll be on the other side. What happened will never be undone. But one day, you will all be OK.\nAnd I hope we all get to hear from you when you're in that place. Where everything is perfect and nothing hurts. In the quiet moments between together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I. Can&amp;#39;t even begin to fathom the pain you all must be going through.\nAnd I&amp;#39;m so sorry for that.\nI&amp;#39;m so glad to hear you have a therapist to help you through this\nSo I won&amp;#39;t address every point. I&amp;#39;m far too long winded, if I let myself go down that rabbit hole no one will be able to put themselves through reading my supportive tirade.\nInstead I&amp;#39;ll just say that I&amp;#39;m sending you and your beautiful family all the love I can from the bottom of my heart!\nYou know this isn&amp;#39;t your fault, in spite of how it feels. You&amp;#39;re going to stick together and help each other through this, and as long as you do there&amp;#39;s nothing in this universe you can&amp;#39;t face down!\nOne day you&amp;#39;ll be on the other side. What happened will never be undone. But one day, you will all be OK.\nAnd I hope we all get to hear from you when you&amp;#39;re in that place. Where everything is perfect and nothing hurts. In the quiet moments between together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7dfdl", "score_hidden": false, "stickied": false, "created": 1492107061.0, "created_utc": 1492078261.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7e5q1", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "Aemerson1992", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I've been with my husband my entire adult life as well and would have no idea what to do if something like this came up. Wow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been with my husband my entire adult life as well and would have no idea what to do if something like this came up. Wow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7e5q1", "score_hidden": false, "stickied": false, "created": 1492109182.0, "created_utc": 1492080382.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7ek1d", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "m1n1m388", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I am so sorry for what happened to you. I can not speak on much of it, .uy i believe í can approach why you are unable to just instantly hate him. \n\nThe vile acts he did aside, he was a part of your life for a over a have a decade. He has become an constant, a habit. Think of it like trying to quit smoking (as a former smoker):\nOne when you wake up, after every Time you eat, before work, every break, after work, when you get home, before bed, etc. When you quit smoking, all these moments feel empty, you feel a void. You dont know what to do because what you normally do is gone.\nThe same goes for him. He was there when you woke, went to work, called on breaks, greeted when you went home, ate breakfast, lunch, ame dinner with, said goodnight to.\nIts never easy to replace a habit, or a constant. And that is what he had become. So please, sweety, don't beat yourself up because you don't instantly fully loath him. Its biological. Just get you and your son out of the his presence, ban him from your home, and surround yourself with close friends. They will help you find who you are and gain independence.\nGood luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry for what happened to you. I can not speak on much of it, .uy i believe í can approach why you are unable to just instantly hate him. &lt;/p&gt;\n\n&lt;p&gt;The vile acts he did aside, he was a part of your life for a over a have a decade. He has become an constant, a habit. Think of it like trying to quit smoking (as a former smoker):\nOne when you wake up, after every Time you eat, before work, every break, after work, when you get home, before bed, etc. When you quit smoking, all these moments feel empty, you feel a void. You dont know what to do because what you normally do is gone.\nThe same goes for him. He was there when you woke, went to work, called on breaks, greeted when you went home, ate breakfast, lunch, ame dinner with, said goodnight to.\nIts never easy to replace a habit, or a constant. And that is what he had become. So please, sweety, don&amp;#39;t beat yourself up because you don&amp;#39;t instantly fully loath him. Its biological. Just get you and your son out of the his presence, ban him from your home, and surround yourself with close friends. They will help you find who you are and gain independence.\nGood luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7ek1d", "score_hidden": false, "stickied": false, "created": 1492110257.0, "created_utc": 1492081457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7i51j", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Iwanttomakeyousmile2", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sadly to say I was in a similar situation.  It rips you to shreds for sure BUT you're not alone in something like this happening to you and you're not to blame in anyway.  It's awful the way that some people will take advantage.  I was with my ex for 17 years and for me to truly move forward I had to turn what I learned in all of that into helping someone else.  But that was after a year of healing first, I personally had very little luck finding a good therapist for being in this kind of situation so I turned to friends and faith but depending on the support you have working through it with therapy might be a good way to try.  I think maybe it helps to know that you aren't alone too, so just wanted to make sure to let you know that you're not alone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sadly to say I was in a similar situation.  It rips you to shreds for sure BUT you&amp;#39;re not alone in something like this happening to you and you&amp;#39;re not to blame in anyway.  It&amp;#39;s awful the way that some people will take advantage.  I was with my ex for 17 years and for me to truly move forward I had to turn what I learned in all of that into helping someone else.  But that was after a year of healing first, I personally had very little luck finding a good therapist for being in this kind of situation so I turned to friends and faith but depending on the support you have working through it with therapy might be a good way to try.  I think maybe it helps to know that you aren&amp;#39;t alone too, so just wanted to make sure to let you know that you&amp;#39;re not alone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7i51j", "score_hidden": false, "stickied": false, "created": 1492117166.0, "created_utc": 1492088366.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7khsj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "djfinbar", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This is not your fault. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not your fault. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7khsj", "score_hidden": false, "stickied": false, "created": 1492120418.0, "created_utc": 1492091618.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8p9lu", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Odd_craving", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You deserve none of this. You didn't do it and you didn't know. And once you found out, you acted decisively. I understand your feelings, I received a heart transplannt once and someone had to die for me to live. Once I carefully walked through it, I realized that I have no guilt in this. My donor is already dead when he gave up his organs.\n\nYou need to accept your own lack of guilt here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You deserve none of this. You didn&amp;#39;t do it and you didn&amp;#39;t know. And once you found out, you acted decisively. I understand your feelings, I received a heart transplannt once and someone had to die for me to live. Once I carefully walked through it, I realized that I have no guilt in this. My donor is already dead when he gave up his organs.&lt;/p&gt;\n\n&lt;p&gt;You need to accept your own lack of guilt here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8p9lu", "score_hidden": false, "stickied": false, "created": 1492169596.0, "created_utc": 1492140796.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg83kqe", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "pelter345", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Press charges against him. Make sure that all of his coworkers and friends know about this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Press charges against him. Make sure that all of his coworkers and friends know about this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg83kqe", "score_hidden": false, "stickied": false, "created": 1492141244.0, "created_utc": 1492112444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7n42o", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "wltndd", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "A lot of people already said this, but it's worthy saying again: it's not your fault. You deserve to be happy. You deserve to be loved. Stay strong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people already said this, but it&amp;#39;s worthy saying again: it&amp;#39;s not your fault. You deserve to be happy. You deserve to be loved. Stay strong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7n42o", "score_hidden": false, "stickied": false, "created": 1492123576.0, "created_utc": 1492094776.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8fgu6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "lovelystrange", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I would be proud to call you my sister. \n-from a little sister", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would be proud to call you my sister. \n-from a little sister&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8fgu6", "score_hidden": false, "stickied": false, "created": 1492155761.0, "created_utc": 1492126961.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7fejp", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "batterydyingagain", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "One big thing: none of this is your fault. I understand that you feel like it is, but it's not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One big thing: none of this is your fault. I understand that you feel like it is, but it&amp;#39;s not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7fejp", "score_hidden": false, "stickied": false, "created": 1492112259.0, "created_utc": 1492083459.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7iukr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Chloe182", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I was sexually assaulted by my step father quite young and this was a common feeling for me.\nI blamed myself and I was angry that someone close to me could do such a thing.\nThe two main things that helped me over this was therapy/counselling and music. \nYou should know that it wasn't your fault what happened to your sister. You didn't tell your (ex?) husband to do that. \n\nThink about this, \nIf you hurt yourself or feel like it's your fault, he wins. \n\nBe happy for yourself, your son and your sister. \n\nYour (ex?) husband should be living with guilt, not you. \n\n\nI couldn't tell you much about the legal side of things, but if your ex) husband is taken to court and prosecuted it can be a hard time. It took quite a few months before my step-father was sentenced. No matter what sentencing your ex husband gets, he has to live with it.\n\nJail- Not good for anyone. Even if your there for a short amount of time, he will constantly be reminded of what he has done.\n\nCommunity service- he still has to get up and work, I guarantee the one thing on his mind will be what happened. \n\nHe most likely will be put on a sex offenders list where he will be monitored and he'all live with a record. Won't be allowed near schools and won't get a job... \nhe will pay one way or another. \nI would definitely press charges against him, it would feel like closure to know he's paying. \n\n\nAs for custody, he wouldn't be allowed to have any child if charges were pressed against him...\n\nI'm so very sorry for what happened. I totally understand every feeling.\n\nI still loved my step father when it happened to me, I got over that because if he loved me it wouldn't have happened. \n\n\n", "edited": 1492090065.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was sexually assaulted by my step father quite young and this was a common feeling for me.\nI blamed myself and I was angry that someone close to me could do such a thing.\nThe two main things that helped me over this was therapy/counselling and music. \nYou should know that it wasn&amp;#39;t your fault what happened to your sister. You didn&amp;#39;t tell your (ex?) husband to do that. &lt;/p&gt;\n\n&lt;p&gt;Think about this, \nIf you hurt yourself or feel like it&amp;#39;s your fault, he wins. &lt;/p&gt;\n\n&lt;p&gt;Be happy for yourself, your son and your sister. &lt;/p&gt;\n\n&lt;p&gt;Your (ex?) husband should be living with guilt, not you. &lt;/p&gt;\n\n&lt;p&gt;I couldn&amp;#39;t tell you much about the legal side of things, but if your ex) husband is taken to court and prosecuted it can be a hard time. It took quite a few months before my step-father was sentenced. No matter what sentencing your ex husband gets, he has to live with it.&lt;/p&gt;\n\n&lt;p&gt;Jail- Not good for anyone. Even if your there for a short amount of time, he will constantly be reminded of what he has done.&lt;/p&gt;\n\n&lt;p&gt;Community service- he still has to get up and work, I guarantee the one thing on his mind will be what happened. &lt;/p&gt;\n\n&lt;p&gt;He most likely will be put on a sex offenders list where he will be monitored and he&amp;#39;all live with a record. Won&amp;#39;t be allowed near schools and won&amp;#39;t get a job... \nhe will pay one way or another. \nI would definitely press charges against him, it would feel like closure to know he&amp;#39;s paying. &lt;/p&gt;\n\n&lt;p&gt;As for custody, he wouldn&amp;#39;t be allowed to have any child if charges were pressed against him...&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so very sorry for what happened. I totally understand every feeling.&lt;/p&gt;\n\n&lt;p&gt;I still loved my step father when it happened to me, I got over that because if he loved me it wouldn&amp;#39;t have happened. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7iukr", "score_hidden": false, "stickied": false, "created": 1492118218.0, "created_utc": 1492089418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7zbt9", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Incomplete_Jigsaw", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "&gt;I feel like I'm not worth loving and that's why he would do that to my sister.\n\nOh, no. You're definitely worth loving. You're doing the right thing here because you care about yourself and your little sister. You obviously love and care for her a lot. That makes you worthwhile.\n\n&gt;I feel like the worst big sister in the world\n\nYou're not. You're doing something that is difficult (divorce and separation can not be easy, even from a monster I imagine) because you know that you, your sister, and your son deserve to be rid of him.\n\nGet away from him. Go love your baby sister up. Heal together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I feel like I&amp;#39;m not worth loving and that&amp;#39;s why he would do that to my sister.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oh, no. You&amp;#39;re definitely worth loving. You&amp;#39;re doing the right thing here because you care about yourself and your little sister. You obviously love and care for her a lot. That makes you worthwhile.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I feel like the worst big sister in the world&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re not. You&amp;#39;re doing something that is difficult (divorce and separation can not be easy, even from a monster I imagine) because you know that you, your sister, and your son deserve to be rid of him.&lt;/p&gt;\n\n&lt;p&gt;Get away from him. Go love your baby sister up. Heal together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7zbt9", "score_hidden": false, "stickied": false, "created": 1492136654.0, "created_utc": 1492107854.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7mhdj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Suvtropics", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Reading this made my hair stand up physically. I can't fully feel the crushing weight that's on you. I don't know how to move on after something of that sort. Well best wishes for you and for your sister. You're fighting a very very difficult fight.   \n\n... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading this made my hair stand up physically. I can&amp;#39;t fully feel the crushing weight that&amp;#39;s on you. I don&amp;#39;t know how to move on after something of that sort. Well best wishes for you and for your sister. You&amp;#39;re fighting a very very difficult fight.   &lt;/p&gt;\n\n&lt;p&gt;... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7mhdj", "score_hidden": false, "stickied": false, "created": 1492122848.0, "created_utc": 1492094048.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8we53", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "truenoise", "parent_id": "t1_dg7z9b8", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "There's a national resource for sexual assault victims at http://www.rainn.org/ \n\nI am so sorry that this happened to your family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a national resource for sexual assault victims at &lt;a href=\"http://www.rainn.org/\"&gt;http://www.rainn.org/&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;I am so sorry that this happened to your family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8we53", "score_hidden": false, "stickied": false, "created": 1492184165.0, "created_utc": 1492155365.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7z9b8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7scbr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you. I will look into that - it sounds like it would be very helpful in sorting through everything right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I will look into that - it sounds like it would be very helpful in sorting through everything right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7z9b8", "score_hidden": false, "stickied": false, "created": 1492136578.0, "created_utc": 1492107778.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7scbr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "coffeecup_", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Hey there. I'm so sorry this has happened to you and your family. I cannot even imagine what you are going through. I just wanted to let you know that there are (hopefully) services in your area to help. If you have a crisis line and/or victim centered advocacy group, you can reach out to them, as most of them also serve secondary victims. They are trained with the survivor in mind so the care you receive (or you sister or child) will likely be a bit different than with a psychologist. If you need to, please PM me and I can help you find something in your area. Love to you ❤. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there. I&amp;#39;m so sorry this has happened to you and your family. I cannot even imagine what you are going through. I just wanted to let you know that there are (hopefully) services in your area to help. If you have a crisis line and/or victim centered advocacy group, you can reach out to them, as most of them also serve secondary victims. They are trained with the survivor in mind so the care you receive (or you sister or child) will likely be a bit different than with a psychologist. If you need to, please PM me and I can help you find something in your area. Love to you ❤. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7scbr", "score_hidden": false, "stickied": false, "created": 1492129225.0, "created_utc": 1492100425.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8gl3c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ThatNiceGuyOnReddit", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "What a terrible thing for your sister to have to suffer though, must have been extremely hard for her over the years. You've done the right thing, and sound like an amazing person. You didn't know what he had done, and left him upon finding out. That was all you could do in the immediate situation. \n\nJust keep moving forward with what your doing, protect your child, sister and yourself. Emotion may still be there, mixed with other emotions and confusion. That is only natural, you were with this man you loved, and only now are you finding all this out. So those feeling will not pass right away, but they will become easier to deal with as I can see you're already handling the situation in a logical and healthy manner.\n\nI wish you and your family the best, and that you all may find happiness in the future when these issues have been put to rest. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a terrible thing for your sister to have to suffer though, must have been extremely hard for her over the years. You&amp;#39;ve done the right thing, and sound like an amazing person. You didn&amp;#39;t know what he had done, and left him upon finding out. That was all you could do in the immediate situation. &lt;/p&gt;\n\n&lt;p&gt;Just keep moving forward with what your doing, protect your child, sister and yourself. Emotion may still be there, mixed with other emotions and confusion. That is only natural, you were with this man you loved, and only now are you finding all this out. So those feeling will not pass right away, but they will become easier to deal with as I can see you&amp;#39;re already handling the situation in a logical and healthy manner.&lt;/p&gt;\n\n&lt;p&gt;I wish you and your family the best, and that you all may find happiness in the future when these issues have been put to rest. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8gl3c", "score_hidden": false, "stickied": false, "created": 1492157298.0, "created_utc": 1492128498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7help", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "keatonpotat0es", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Fuck, I'm so sorry. I'm sorry you're feeling so confused - that's not your fault. He had you completely manipulated into thinking he was a good person, and naturally, you loved this person and didn't think he was capable of being evil. It sounds like you are doing everything right. You have so much courage to immediately leave him - SO MANY people cannot muster this even when they know they are with an abuser. It's something I couldn't do for a long time when I was younger and your situation is much, much more serious. I'm proud of you. \n\nYour sister is lucky to have you. You believed her and immediately took action. From now on, keep choosing your sister EVERY time and it will help the two of you heal. I'm so very sorry for both of you, and I hope that soon you never have to have contact with that monster again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck, I&amp;#39;m so sorry. I&amp;#39;m sorry you&amp;#39;re feeling so confused - that&amp;#39;s not your fault. He had you completely manipulated into thinking he was a good person, and naturally, you loved this person and didn&amp;#39;t think he was capable of being evil. It sounds like you are doing everything right. You have so much courage to immediately leave him - SO MANY people cannot muster this even when they know they are with an abuser. It&amp;#39;s something I couldn&amp;#39;t do for a long time when I was younger and your situation is much, much more serious. I&amp;#39;m proud of you. &lt;/p&gt;\n\n&lt;p&gt;Your sister is lucky to have you. You believed her and immediately took action. From now on, keep choosing your sister EVERY time and it will help the two of you heal. I&amp;#39;m so very sorry for both of you, and I hope that soon you never have to have contact with that monster again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7help", "score_hidden": false, "stickied": false, "created": 1492116023.0, "created_utc": 1492087223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8gp3n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "otitropanit", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This is the total mind-fuck of abusers: they are not totally monsters.  They are part monster and part wonderful, loving husband.  They have to be or they would be ostracized and shunned.  And they also people, so they will have many sides.\n\nForgive yourself for not knowing what you didn't know.  You couldn't have, so release that guilt.  It will not help your sister or your son for you to spend energy hating yourself.\n\nI'm so sorry, and cannot recommend therapy enough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the total mind-fuck of abusers: they are not totally monsters.  They are part monster and part wonderful, loving husband.  They have to be or they would be ostracized and shunned.  And they also people, so they will have many sides.&lt;/p&gt;\n\n&lt;p&gt;Forgive yourself for not knowing what you didn&amp;#39;t know.  You couldn&amp;#39;t have, so release that guilt.  It will not help your sister or your son for you to spend energy hating yourself.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so sorry, and cannot recommend therapy enough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8gp3n", "score_hidden": false, "stickied": false, "created": 1492157446.0, "created_utc": 1492128646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8if6q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RichieLikesRice", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Wow this actually makes me fucking livid. What a disgusting individual your husband is. I'm glad your sister was able to tell you. I wish you the best, sister. I believe you will persevere. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow this actually makes me fucking livid. What a disgusting individual your husband is. I&amp;#39;m glad your sister was able to tell you. I wish you the best, sister. I believe you will persevere. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8if6q", "score_hidden": false, "stickied": false, "created": 1492159822.0, "created_utc": 1492131022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7lvil", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "the_crustybastard", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I am very sorry for your sister, you and your family.\n\nIf this guy is capable of getting drunk and raping your underage sister, he should never **EVER** be allowed to be alone with your son.\n\nIt is up to you to protect your son and your family. You and your sister need to take this to the police, *posthaste*. \n\nGloves off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am very sorry for your sister, you and your family.&lt;/p&gt;\n\n&lt;p&gt;If this guy is capable of getting drunk and raping your underage sister, he should never &lt;strong&gt;EVER&lt;/strong&gt; be allowed to be alone with your son.&lt;/p&gt;\n\n&lt;p&gt;It is up to you to protect your son and your family. You and your sister need to take this to the police, &lt;em&gt;posthaste&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;Gloves off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7lvil", "score_hidden": false, "stickied": false, "created": 1492122131.0, "created_utc": 1492093331.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7m4jz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xRantzyy", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Its not your fault. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its not your fault. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7m4jz", "score_hidden": false, "stickied": false, "created": 1492122424.0, "created_utc": 1492093624.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7o4xl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shimaken", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I hope you lawyered up before emailing him and his parents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you lawyered up before emailing him and his parents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7o4xl", "score_hidden": false, "stickied": false, "created": 1492124721.0, "created_utc": 1492095921.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7psyt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pommax", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I am so sorry for you and your sister to go through this hell. Please stay strong and find someone safe to talk to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry for you and your sister to go through this hell. Please stay strong and find someone safe to talk to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7psyt", "score_hidden": false, "stickied": false, "created": 1492126528.0, "created_utc": 1492097728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7zhlo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7qaux", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you for that. I am trying to remember that I have to feel well to make sure I can be what my son needs.\n\nI'm a recovering self harm addict, so I do have the tools and resources to find alternate relief. As you know, when there is major emotional turmoil it can be hard to push those automatic thoughts away. I thank you for the offer and the support.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for that. I am trying to remember that I have to feel well to make sure I can be what my son needs.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a recovering self harm addict, so I do have the tools and resources to find alternate relief. As you know, when there is major emotional turmoil it can be hard to push those automatic thoughts away. I thank you for the offer and the support.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7zhlo", "score_hidden": false, "stickied": false, "created": 1492136820.0, "created_utc": 1492108020.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qaux", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jamaicanoproblem", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You and your sister will be sharing a very difficult and emotional experience for a while as you deal with the fallout if your husband's unconscionable decisions. Remember that you are both hurting but in very different ways. Do not forget self care in the dark times, your son will need you to be there for him more than ever now that the job of parenting will lie only on you. Like the flight attendants say, secure your own oxygen mask before assisting others. \n\nI understand the urge to hurt yourself. I've combatted self harm for most of my life. It's not a path that leads to relief. Just more problems and complications. It can become addicting and compulsive surprisingly quickly. If you feel like you are struggling with this feel free to pm and I can share some suggestions on how to cope and redirect those urges. Best of luck to you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You and your sister will be sharing a very difficult and emotional experience for a while as you deal with the fallout if your husband&amp;#39;s unconscionable decisions. Remember that you are both hurting but in very different ways. Do not forget self care in the dark times, your son will need you to be there for him more than ever now that the job of parenting will lie only on you. Like the flight attendants say, secure your own oxygen mask before assisting others. &lt;/p&gt;\n\n&lt;p&gt;I understand the urge to hurt yourself. I&amp;#39;ve combatted self harm for most of my life. It&amp;#39;s not a path that leads to relief. Just more problems and complications. It can become addicting and compulsive surprisingly quickly. If you feel like you are struggling with this feel free to pm and I can share some suggestions on how to cope and redirect those urges. Best of luck to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7qaux", "score_hidden": false, "stickied": false, "created": 1492127054.0, "created_utc": 1492098254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7z4nd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7tkpn", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7z4nd", "score_hidden": false, "stickied": false, "created": 1492136446.0, "created_utc": 1492107646.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tkpn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SanMaximon", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm so sorry this monster deceived you.  He took advantage of your basic decency. You are not bad or worthless or any of the things you keep repeating to yourself. My heart hurts for you and your family. Please know that you are not to blame. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry this monster deceived you.  He took advantage of your basic decency. You are not bad or worthless or any of the things you keep repeating to yourself. My heart hurts for you and your family. Please know that you are not to blame. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7tkpn", "score_hidden": false, "stickied": false, "created": 1492130546.0, "created_utc": 1492101746.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg88kg7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HeyHeyJG", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You do deserve love and you are loved. I'm sorry that you're going through this. I'm thinking about you ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You do deserve love and you are loved. I&amp;#39;m sorry that you&amp;#39;re going through this. I&amp;#39;m thinking about you &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg88kg7", "score_hidden": false, "stickied": false, "created": 1492146845.0, "created_utc": 1492118045.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8e0e0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DaveTheRoper", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I've been sitting here for 30 minutes thinking of what to say, and I'm still a bit at a loss, but here's more or less what I want to say:\n\nI'm sorry you're hurting. :( Just remember that you're not the evil one here. He is. No matter what *could've* been done, the fact remains that he was the one who committed the crime, not you. I know the \"what if?\" questions are yanking violently at your brain right now, but it does no good to put any blame on yourself. You didn't do anything wrong, you didn't *intend* to do anything wrong, and thus you absolutely do not deserve to bear the weight of that monster's crimes.\n\nI really do feel for you right now. You're in mourning - the man you loved is gone. And not only are you in mourning, you've been betrayed. And you're in shock. And you feel guilty. It's difficult to deal with even one of those emotions, and here you are, having to battle these demons all at once! Please try to get some help if you can, for you and your sister.\n\nI hope everything gets better for you two. You seem like an amazing person. Your love and concern for your sister shows that you are much better than that monster who hurt her. You're not a monster; you don't deserve to bear the guilt of his crime. You deserve love, you deserve your son and sister, and you deserve happiness. Don't let him take that away from you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been sitting here for 30 minutes thinking of what to say, and I&amp;#39;m still a bit at a loss, but here&amp;#39;s more or less what I want to say:&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry you&amp;#39;re hurting. :( Just remember that you&amp;#39;re not the evil one here. He is. No matter what &lt;em&gt;could&amp;#39;ve&lt;/em&gt; been done, the fact remains that he was the one who committed the crime, not you. I know the &amp;quot;what if?&amp;quot; questions are yanking violently at your brain right now, but it does no good to put any blame on yourself. You didn&amp;#39;t do anything wrong, you didn&amp;#39;t &lt;em&gt;intend&lt;/em&gt; to do anything wrong, and thus you absolutely do not deserve to bear the weight of that monster&amp;#39;s crimes.&lt;/p&gt;\n\n&lt;p&gt;I really do feel for you right now. You&amp;#39;re in mourning - the man you loved is gone. And not only are you in mourning, you&amp;#39;ve been betrayed. And you&amp;#39;re in shock. And you feel guilty. It&amp;#39;s difficult to deal with even one of those emotions, and here you are, having to battle these demons all at once! Please try to get some help if you can, for you and your sister.&lt;/p&gt;\n\n&lt;p&gt;I hope everything gets better for you two. You seem like an amazing person. Your love and concern for your sister shows that you are much better than that monster who hurt her. You&amp;#39;re not a monster; you don&amp;#39;t deserve to bear the guilt of his crime. You deserve love, you deserve your son and sister, and you deserve happiness. Don&amp;#39;t let him take that away from you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8e0e0", "score_hidden": false, "stickied": false, "created": 1492153838.0, "created_utc": 1492125038.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8wsyf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cinnamon2017", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It's normal to blame yourself, since you have a conscience. You will need more time to process all this and put the blame where it belongs - on HIM. Hopefully he will get arrested and go to prison for sexual assault of a minor! See how he likes that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s normal to blame yourself, since you have a conscience. You will need more time to process all this and put the blame where it belongs - on HIM. Hopefully he will get arrested and go to prison for sexual assault of a minor! See how he likes that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8wsyf", "score_hidden": false, "stickied": false, "created": 1492185361.0, "created_utc": 1492156561.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg9gzc3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "beenthereshunnedthat", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "&gt;I want to hurt myself, but that would only hurt my little boy.\n\nIt would hurt your sister too. You say she was afraid of losing you before, so imagine how awful it would be for her to lose you now when she finally had the strength to tell you the truth. She would blame herself. I'm not saying this to guilt you, just to stress how much you are needed in this world. I can't imagine the volume of pain you're experiencing right now so I don't blame you for having those thoughts. But it is so important that you live. You've done nothing wrong. He wronged, hurt, and betrayed you too, even though it wasn't in the same way that he wronged, hurt, and betrayed your sister. \n\nDon't be hard on yourself for not realizing he was capable of that. It's only natural that a good person might not recognize something as unfamiliar as evil. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I want to hurt myself, but that would only hurt my little boy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It would hurt your sister too. You say she was afraid of losing you before, so imagine how awful it would be for her to lose you now when she finally had the strength to tell you the truth. She would blame herself. I&amp;#39;m not saying this to guilt you, just to stress how much you are needed in this world. I can&amp;#39;t imagine the volume of pain you&amp;#39;re experiencing right now so I don&amp;#39;t blame you for having those thoughts. But it is so important that you live. You&amp;#39;ve done nothing wrong. He wronged, hurt, and betrayed you too, even though it wasn&amp;#39;t in the same way that he wronged, hurt, and betrayed your sister. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be hard on yourself for not realizing he was capable of that. It&amp;#39;s only natural that a good person might not recognize something as unfamiliar as evil. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9gzc3", "score_hidden": false, "stickied": false, "created": 1492220588.0, "created_utc": 1492191788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg87mdp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "slayer991", "parent_id": "t1_dg7yvvh", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I feel so badly that your sister (and you) have to go through this.  I can't imagine the pain of hearing that from your sister.\n\nAs others have stated, get an attorney immediately.  You may want to ask your attorney if your sister should press charges (my feeling is you should, but that's up to you based on circumstances and what your attorney says).  Get some counseling for you and your sister.\n\nI wish nothing but the best for you...and I hope your stbx gets what is coming to him.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel so badly that your sister (and you) have to go through this.  I can&amp;#39;t imagine the pain of hearing that from your sister.&lt;/p&gt;\n\n&lt;p&gt;As others have stated, get an attorney immediately.  You may want to ask your attorney if your sister should press charges (my feeling is you should, but that&amp;#39;s up to you based on circumstances and what your attorney says).  Get some counseling for you and your sister.&lt;/p&gt;\n\n&lt;p&gt;I wish nothing but the best for you...and I hope your stbx gets what is coming to him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87mdp", "score_hidden": false, "stickied": false, "created": 1492145736.0, "created_utc": 1492116936.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8pcht", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Floomby", "parent_id": "t1_dg7yvvh", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Both of you should check out the website [RAINN](http://www.rainn.org). \n\nAfter therapy, lawyers, and careful consideration, the decision to press charges should ideally be decided by mutual consent. Your sister should have control over making this as public or as private as she wishes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Both of you should check out the website &lt;a href=\"http://www.rainn.org\"&gt;RAINN&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;After therapy, lawyers, and careful consideration, the decision to press charges should ideally be decided by mutual consent. Your sister should have control over making this as public or as private as she wishes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8pcht", "score_hidden": false, "stickied": false, "created": 1492169726.0, "created_utc": 1492140926.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yvvh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7vulh", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "My sister was afraid, due to a conversation taken out of context, that I would choose him over her, or that I wouldn't believe her.\n\nRecently my stbx told me that he didn't love me anymore and wasn't sure he wanted to be with me. I told her about it and she realized that he wasn't helping me - he was hurting me - and she thought it would be better to finally tell me so that we could both finally move past him.\n\nShe is leaving it up to me to press charges because her primary concern is her nephew. She is extremely close with my son because she can't have children of her own, and she wants to make the transition as easy as possible for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My sister was afraid, due to a conversation taken out of context, that I would choose him over her, or that I wouldn&amp;#39;t believe her.&lt;/p&gt;\n\n&lt;p&gt;Recently my stbx told me that he didn&amp;#39;t love me anymore and wasn&amp;#39;t sure he wanted to be with me. I told her about it and she realized that he wasn&amp;#39;t helping me - he was hurting me - and she thought it would be better to finally tell me so that we could both finally move past him.&lt;/p&gt;\n\n&lt;p&gt;She is leaving it up to me to press charges because her primary concern is her nephew. She is extremely close with my son because she can&amp;#39;t have children of her own, and she wants to make the transition as easy as possible for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7yvvh", "score_hidden": false, "stickied": false, "created": 1492136184.0, "created_utc": 1492107384.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg87p2z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "slayer991", "parent_id": "t1_dg7x7at", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "She's a big girl and capable of making that determination...and she did.\n\nThe reason I asked is if there were threats involved or he had tried to rape her sister again, then that makes the entire GTFO process accelerated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s a big girl and capable of making that determination...and she did.&lt;/p&gt;\n\n&lt;p&gt;The reason I asked is if there were threats involved or he had tried to rape her sister again, then that makes the entire GTFO process accelerated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87p2z", "score_hidden": false, "stickied": false, "created": 1492145822.0, "created_utc": 1492117022.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7x7at", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "trashcanhan", "parent_id": "t1_dg7vulh", "subreddit_name_prefixed": "r/offmychest", "controversiality": 1, "body": "Those aren't really questions to ask right now. All of this is still fresh to OP, and there are many explanations why. Young girls can get depressed and never talk about it because they don't know how to. I've been there, it's not easy to answer such harsh questions when all you really wanted was for it to \"go away\" like it never happened. It's all very painful ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those aren&amp;#39;t really questions to ask right now. All of this is still fresh to OP, and there are many explanations why. Young girls can get depressed and never talk about it because they don&amp;#39;t know how to. I&amp;#39;ve been there, it&amp;#39;s not easy to answer such harsh questions when all you really wanted was for it to &amp;quot;go away&amp;quot; like it never happened. It&amp;#39;s all very painful &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7x7at", "score_hidden": false, "stickied": false, "created": 1492134400.0, "created_utc": 1492105600.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7vulh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "slayer991", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm sorry this happened to you.\n\nI do have a few questions.  Why didn't your sister tell anyone immediately?  Why didn't she press charges?  Was she threatened?  Did he threaten to hurt you if she talked?  Why did she decide to tell you 3 years later?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry this happened to you.&lt;/p&gt;\n\n&lt;p&gt;I do have a few questions.  Why didn&amp;#39;t your sister tell anyone immediately?  Why didn&amp;#39;t she press charges?  Was she threatened?  Did he threaten to hurt you if she talked?  Why did she decide to tell you 3 years later?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7vulh", "score_hidden": false, "stickied": false, "created": 1492132958.0, "created_utc": 1492104158.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7hl5a", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "rannieb", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I am so sorry this happened to your sister and to you. I am so happy that you have the emotional strenght to side with your sister, who needs you.\n\nAs mentioned by many others, your sister needs to press charges against your ex. \n\nShe needs it for her own recovery. It will also help you, your son and even your ex in the future.\n\nHopefully this is a one of mistake for your ex. If so, he needs to pay his dues to have any chance of rebuilding his life. \n\nEveryone around him, who cared/cares for him also need to know that he suffered consequences for his actions and won't be hurting anyone again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry this happened to your sister and to you. I am so happy that you have the emotional strenght to side with your sister, who needs you.&lt;/p&gt;\n\n&lt;p&gt;As mentioned by many others, your sister needs to press charges against your ex. &lt;/p&gt;\n\n&lt;p&gt;She needs it for her own recovery. It will also help you, your son and even your ex in the future.&lt;/p&gt;\n\n&lt;p&gt;Hopefully this is a one of mistake for your ex. If so, he needs to pay his dues to have any chance of rebuilding his life. &lt;/p&gt;\n\n&lt;p&gt;Everyone around him, who cared/cares for him also need to know that he suffered consequences for his actions and won&amp;#39;t be hurting anyone again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7hl5a", "score_hidden": false, "stickied": false, "created": 1492116313.0, "created_utc": 1492087513.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg80v9i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "t4ctic4lc4ctus", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 1, "body": "Please press charges. Pedophiles should not be free to roam the streets. And absolutely should not be allowed contact with your son. A pedophile is a pedophile and your son is young. Protect yourselves ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please press charges. Pedophiles should not be free to roam the streets. And absolutely should not be allowed contact with your son. A pedophile is a pedophile and your son is young. Protect yourselves &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg80v9i", "score_hidden": false, "stickied": false, "created": 1492138301.0, "created_utc": 1492109501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7ijat", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bananamuffler", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Damn. I normally have advice. But I'm left speechless here. I'm truly sorry. My thoughts are with you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn. I normally have advice. But I&amp;#39;m left speechless here. I&amp;#39;m truly sorry. My thoughts are with you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7ijat", "score_hidden": false, "stickied": false, "created": 1492117760.0, "created_utc": 1492088960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg8or7k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "flappybunny19", "parent_id": "t1_dg7z2q0", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Just like bravery is doing the correct thing in the presence of fear, strength is doing the right thing even while feeling shattered. You are strong AND brave, and a whole bunch of other very positive character attributes for the actions you've taken and will be taking.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just like bravery is doing the correct thing in the presence of fear, strength is doing the right thing even while feeling shattered. You are strong AND brave, and a whole bunch of other very positive character attributes for the actions you&amp;#39;ve taken and will be taking.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8or7k", "score_hidden": false, "stickied": false, "created": 1492168797.0, "created_utc": 1492139997.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7z2q0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7ub84", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you. My therapist said the same thing this morning. She said she thinks I am strong for accepting that it happened and not rejecting it to protect my own feelings or sense of happiness/security.\n\nI don't feel strong - I feel pretty shattered, but I appreciate the support.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. My therapist said the same thing this morning. She said she thinks I am strong for accepting that it happened and not rejecting it to protect my own feelings or sense of happiness/security.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t feel strong - I feel pretty shattered, but I appreciate the support.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7z2q0", "score_hidden": false, "stickied": false, "created": 1492136389.0, "created_utc": 1492107589.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ub84", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rx_for_bitter_pills", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This is awful, but you are doing the right thing. With all the BS relationships we see around us, it's hard for us to keep the thoughts of one relationship 'pure'. What I mean is, I see people choosing monsters over the victims all the time. That image seeped into your sisters mind but that does NOT mean you gave her that message or you influenced it. Please don't beat yourself up over it.\n\nWhat you are doing now proves to your sister, yourself, your son, your family, your friends, EVERYONE who loves you that you are stronger than many. So fucking many.\n\nHang in there, do not beat yourself up, and keep moving forward. I hope that bastard piece of shit rots in hell.\n\nP.S. I know a 'nice guy' that everyone loved who ended up raping my friend. They fool many and we are no exception.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is awful, but you are doing the right thing. With all the BS relationships we see around us, it&amp;#39;s hard for us to keep the thoughts of one relationship &amp;#39;pure&amp;#39;. What I mean is, I see people choosing monsters over the victims all the time. That image seeped into your sisters mind but that does NOT mean you gave her that message or you influenced it. Please don&amp;#39;t beat yourself up over it.&lt;/p&gt;\n\n&lt;p&gt;What you are doing now proves to your sister, yourself, your son, your family, your friends, EVERYONE who loves you that you are stronger than many. So fucking many.&lt;/p&gt;\n\n&lt;p&gt;Hang in there, do not beat yourself up, and keep moving forward. I hope that bastard piece of shit rots in hell.&lt;/p&gt;\n\n&lt;p&gt;P.S. I know a &amp;#39;nice guy&amp;#39; that everyone loved who ended up raping my friend. They fool many and we are no exception.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7ub84", "score_hidden": false, "stickied": false, "created": 1492131327.0, "created_utc": 1492102527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7z1t3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gracebatmonkey", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You're what every survivor wants to have when they can finally say what was done to them out loud, whenever that is: a believer and an action-taker.\n\nYou DO deserve your son &amp; sister. And your own life to be happy again after all of this is dealt with. It will take time to move through all of the changes this will bring about, and some (like your feelings) are going to take a long time. Give yourself love and respect for taking the right steps and being a badass. Do all of the self-care things that help you get through it. Be gentle with yourself, your sister, and your son as you move through this.\n\nHave a safety plan for each of you. At home, at your son's care locations, at work, anyplace he knows to look for any of you. That might sound extreme, but I think we've all seen the possibility of someone in extremis deciding to harm those they blame for their inability to control their own emotions. Better to be safe than the alternative.\n\nLove to you, OP. You don't own any of the shame in this. You're doing the right things. Let yourself feel that.\n\nEdited to change \"what happened\" to the more accurate \"what was done\".\n", "edited": 1492111022.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re what every survivor wants to have when they can finally say what was done to them out loud, whenever that is: a believer and an action-taker.&lt;/p&gt;\n\n&lt;p&gt;You DO deserve your son &amp;amp; sister. And your own life to be happy again after all of this is dealt with. It will take time to move through all of the changes this will bring about, and some (like your feelings) are going to take a long time. Give yourself love and respect for taking the right steps and being a badass. Do all of the self-care things that help you get through it. Be gentle with yourself, your sister, and your son as you move through this.&lt;/p&gt;\n\n&lt;p&gt;Have a safety plan for each of you. At home, at your son&amp;#39;s care locations, at work, anyplace he knows to look for any of you. That might sound extreme, but I think we&amp;#39;ve all seen the possibility of someone in extremis deciding to harm those they blame for their inability to control their own emotions. Better to be safe than the alternative.&lt;/p&gt;\n\n&lt;p&gt;Love to you, OP. You don&amp;#39;t own any of the shame in this. You&amp;#39;re doing the right things. Let yourself feel that.&lt;/p&gt;\n\n&lt;p&gt;Edited to change &amp;quot;what happened&amp;quot; to the more accurate &amp;quot;what was done&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7z1t3", "score_hidden": false, "stickied": false, "created": 1492136362.0, "created_utc": 1492107562.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg87o5j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hell_hath_no", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You chose to believe her. That is worth so so much. Support each other and continue to  be someone she can trust, you are amazing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You chose to believe her. That is worth so so much. Support each other and continue to  be someone she can trust, you are amazing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg87o5j", "score_hidden": false, "stickied": false, "created": 1492145793.0, "created_utc": 1492116993.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7qp9g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nohablaingles32", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You need to press charges so that he does not ever do this again to any other woman. I am so so so sorry that you have to deal with this. Be there for your sister and your son. You will get through this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to press charges so that he does not ever do this again to any other woman. I am so so so sorry that you have to deal with this. Be there for your sister and your son. You will get through this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7qp9g", "score_hidden": false, "stickied": false, "created": 1492127478.0, "created_utc": 1492098678.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7rzlh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Throwaway993017", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I am so, so sorry. It's not your fault. &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so, so sorry. It&amp;#39;s not your fault. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7rzlh", "score_hidden": false, "stickied": false, "created": 1492128851.0, "created_utc": 1492100051.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7z3r8", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7ttnp", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "He confessed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He confessed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7z3r8", "score_hidden": false, "stickied": false, "created": 1492136420.0, "created_utc": 1492107620.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ttnp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "2Cor517", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "So, how did you find out? Did he confess? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, how did you find out? Did he confess? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7ttnp", "score_hidden": false, "stickied": false, "created": 1492130812.0, "created_utc": 1492102012.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7vdd9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ellexoxoxo33", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "All great advice on here.  I cannot even begin to articulate how badly sorry i am that this happened to your family, and to any others out there. One added thing, you and your sister should think about getting involved in martial arts. Krav Maga, jujitsu, freestyle wrestling, anything. Not only is it a powerful stress reliever,  it will empower both of you, and give you some mental clarity and  a fresh way of looking at life. Just remember, you are in control. You are doing the right thing. You got this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All great advice on here.  I cannot even begin to articulate how badly sorry i am that this happened to your family, and to any others out there. One added thing, you and your sister should think about getting involved in martial arts. Krav Maga, jujitsu, freestyle wrestling, anything. Not only is it a powerful stress reliever,  it will empower both of you, and give you some mental clarity and  a fresh way of looking at life. Just remember, you are in control. You are doing the right thing. You got this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7vdd9", "score_hidden": false, "stickied": false, "created": 1492132448.0, "created_utc": 1492103648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7lpeq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gigadweeb", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Get you and your sister therapy, it should do a lot of good. Fucking creepy monster, I don't understand how people could do such a thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get you and your sister therapy, it should do a lot of good. Fucking creepy monster, I don&amp;#39;t understand how people could do such a thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7lpeq", "score_hidden": false, "stickied": false, "created": 1492121933.0, "created_utc": 1492093133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7krfo", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "elywanderer", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sorry for what you've been through! Consider pressing charges - if he is capable of this then what else could he inflict on someone else when he's divorced!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for what you&amp;#39;ve been through! Consider pressing charges - if he is capable of this then what else could he inflict on someone else when he&amp;#39;s divorced!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7krfo", "score_hidden": false, "stickied": false, "created": 1492120760.0, "created_utc": 1492091960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7litz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "LushFan912", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Press charges. It's not your fault at all. It's his fault for betraying you and doing that horrible act. Don't blame yourself for something you didn't do. He deserves all of the blame. Not you. You didn't do anything. He's the one who did that. You shouldn't feel guilty for another person's actions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Press charges. It&amp;#39;s not your fault at all. It&amp;#39;s his fault for betraying you and doing that horrible act. Don&amp;#39;t blame yourself for something you didn&amp;#39;t do. He deserves all of the blame. Not you. You didn&amp;#39;t do anything. He&amp;#39;s the one who did that. You shouldn&amp;#39;t feel guilty for another person&amp;#39;s actions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7litz", "score_hidden": false, "stickied": false, "created": 1492121715.0, "created_utc": 1492092915.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg88fj1", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "outlawa", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I don't believe there's a statute of limitations on felony crimes. Last I checked rape was a felony.\nWhile it is pretty late for your sister to press charges, it is not unheard of. \nAlso it's pretty hard to have custody when your in prison. And there could be additional charges because of age (depending on what state or country you're in). \n\nI'd tell your sister to speak with law enforcement. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t believe there&amp;#39;s a statute of limitations on felony crimes. Last I checked rape was a felony.\nWhile it is pretty late for your sister to press charges, it is not unheard of. \nAlso it&amp;#39;s pretty hard to have custody when your in prison. And there could be additional charges because of age (depending on what state or country you&amp;#39;re in). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d tell your sister to speak with law enforcement. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg88fj1", "score_hidden": false, "stickied": false, "created": 1492146682.0, "created_utc": 1492117882.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_653jsl", "likes": null, "replies": "", "user_reports": [], "id": "dg7z741", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ReservateThatRoom", "parent_id": "t1_dg7st3y", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Definitely doing therapy. Luckily my son and I are both already seeing a therapist &amp; I had an appointment this morning. My sister has already done therapy, but I plan to ask her if she's willing to go again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely doing therapy. Luckily my son and I are both already seeing a therapist &amp;amp; I had an appointment this morning. My sister has already done therapy, but I plan to ask her if she&amp;#39;s willing to go again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7z741", "score_hidden": false, "stickied": false, "created": 1492136518.0, "created_utc": 1492107718.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7st3y", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "BigPinkPanther", "parent_id": "t3_653jsl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I know you are sad and disappointed and understandably so.  I would encourage you to be angry with him, not with yourself.  He's the guilty one.  You did your best and obviously would never knowingly put your sister at risk.  Do look into counseling to help you and your sister please.  We all do the best we can for the situation.  I'm so sorry you have to deal with this horrible deception.  Please do press charges as I think this would help your sister in the long run.  Godspeed, my friend.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know you are sad and disappointed and understandably so.  I would encourage you to be angry with him, not with yourself.  He&amp;#39;s the guilty one.  You did your best and obviously would never knowingly put your sister at risk.  Do look into counseling to help you and your sister please.  We all do the best we can for the situation.  I&amp;#39;m so sorry you have to deal with this horrible deception.  Please do press charges as I think this would help your sister in the long run.  Godspeed, my friend.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg7st3y", "score_hidden": false, "stickied": false, "created": 1492129716.0, "created_utc": 1492100916.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]