[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;[ThrowAway Reddit Acct!]&lt;/p&gt;\n\n&lt;p&gt;Pulled into local grocery for dinner one evening last week.  Out at entrance way into parking lot sat an apparent homeless guy, with a dog laying beside him, Retriever mix of some sort - I love dogs.  It was looking a little warn, head hung, maybe tired. The guy was holding the standard issue &amp;quot;Need help&amp;quot; sign - you know the kind that makes us all uncomfortable when they pan handle at intersections, off ramps and stop lights?&lt;/p&gt;\n\n&lt;p&gt;While inside the store, getting myself some food I thought; I don&amp;#39;t carry cash but I can get that guy out there something from the deli so he could at least have a decent meal this evening.  So I filled up the basket with a few things for him that he could eat; sandwich, snacks, water, etc.  Then I thought; I should get him a bag of dog food too!  So picked up a 10 pound bag of some decent dog food and even a bag of treats.  Dog&amp;#39;s gotta eat too:)&lt;/p&gt;\n\n&lt;p&gt;I went to pull out of the lot and, he was walking away from his spot I first saw him.  So I drove over to the end of the lot where he was walking.  He looked pretty rough, not old but definitely a middle-aged guy on some hard times. Pulled up beside him with window rolled down: &amp;quot;Hey man, you need some help?&amp;quot; and he had that pleading look in his eyes; &amp;quot;Yeah...&amp;quot; he said.&lt;/p&gt;\n\n&lt;p&gt;I handed him the grocery bag of human and dog food through the open window.  He looked very surprised; &amp;quot;Thanks buddy!&amp;quot; was all I heard as I drove off (edit spelling).  &lt;/p&gt;\n\n&lt;p&gt;Glanced in the rear view mirror and he was already sitting on the ground, tearing into that bag taking stock of what he&amp;#39;d been given like it was Christmas.  But the part that got me, was seeing that dog perk up and sniff the bag and it&amp;#39;s tail start to wag.&lt;/p&gt;\n\n&lt;p&gt;Why is this an off my chest moment?  I&amp;#39;ve told no one about this for deeply personal reasons - but I got to thinking, I&amp;#39;d like someone to read this, not to praise or anything, I do NOT desire that but maybe sharing this experience could inspire someone to do something similar (pass it on!) or gain some courage to reach out and support another human being (or homeless pet!) when they normally wouldn&amp;#39;t.  At the very least, maybe this gives you a little bit of hope.&lt;/p&gt;\n\n&lt;p&gt;I wish we could all be as humane and loyal to each other as that dog was to him.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[ThrowAway Reddit Acct!]\n\nPulled into local grocery for dinner one evening last week.  Out at entrance way into parking lot sat an apparent homeless guy, with a dog laying beside him, Retriever mix of some sort - I love dogs.  It was looking a little warn, head hung, maybe tired. The guy was holding the standard issue \"Need help\" sign - you know the kind that makes us all uncomfortable when they pan handle at intersections, off ramps and stop lights?\n\nWhile inside the store, getting myself some food I thought; I don't carry cash but I can get that guy out there something from the deli so he could at least have a decent meal this evening.  So I filled up the basket with a few things for him that he could eat; sandwich, snacks, water, etc.  Then I thought; I should get him a bag of dog food too!  So picked up a 10 pound bag of some decent dog food and even a bag of treats.  Dog's gotta eat too:)\n\nI went to pull out of the lot and, he was walking away from his spot I first saw him.  So I drove over to the end of the lot where he was walking.  He looked pretty rough, not old but definitely a middle-aged guy on some hard times. Pulled up beside him with window rolled down: \"Hey man, you need some help?\" and he had that pleading look in his eyes; \"Yeah...\" he said.\n\nI handed him the grocery bag of human and dog food through the open window.  He looked very surprised; \"Thanks buddy!\" was all I heard as I drove off (edit spelling).  \n\nGlanced in the rear view mirror and he was already sitting on the ground, tearing into that bag taking stock of what he'd been given like it was Christmas.  But the part that got me, was seeing that dog perk up and sniff the bag and it's tail start to wag.\n\nWhy is this an off my chest moment?  I've told no one about this for deeply personal reasons - but I got to thinking, I'd like someone to read this, not to praise or anything, I do NOT desire that but maybe sharing this experience could inspire someone to do something similar (pass it on!) or gain some courage to reach out and support another human being (or homeless pet!) when they normally wouldn't.  At the very least, maybe this gives you a little bit of hope.\n\nI wish we could all be as humane and loyal to each other as that dog was to him.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6573ma", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "NO1_IsA_ThrowAway", "saved": false, "mod_reports": [], "name": "t3_6573ma", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": 1492109195.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/6573ma/helped_out_a_homeless_guy_his_dog/", "num_reports": null, "locked": false, "stickied": false, "created": 1492134823.0, "url": "https://www.reddit.com/r/offmychest/comments/6573ma/helped_out_a_homeless_guy_his_dog/", "author_flair_text": null, "quarantine": false, "title": "Helped out a homeless guy &amp; his dog", "created_utc": 1492106023.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6573ma", "likes": null, "replies": "", "user_reports": [], "id": "dg80eme", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LazyTits127", "parent_id": "t3_6573ma", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I've done the same thing and I'm glad there are more people out here like this. I used to not like seeing dogs with homeless but then thought realistically those dogs would be put down or looking for food elsewhere. It's nice to have a friend and partner through hard times sleeping in the cold. It's better they're together than separate sleeping in the streets. \n\nGiving food only backfired once lol I was like 10 and I convinced my mom to give our food/leftovers/extras to the homeless lady nearby. (My mom never took us out at all, so that corner crappy Chinese food spot was the best thing on earth as a kid lol) I thought she'd love and appreciate something as much as I did especially since she probably doesn't eat as much as me. My mom warned me: she might not want it or like that we're offering. \n\nI didn't believe her and thought she was crazy if this lady didn't want food. But I was completely wrong. That lady did not want it and started screaming high pitches sounds and noises. Walking aggressively towards me.\n\nMy mom took me away laughing and I was so red and embarrassed. We still laugh about it til this day, but that's never stopped me from offering. Having grown up in L.A., I see it left and right and my grandma loves chilling and drinking with the homeless and giving them food. I would like it if I was homeless one day, someone hooks me up. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve done the same thing and I&amp;#39;m glad there are more people out here like this. I used to not like seeing dogs with homeless but then thought realistically those dogs would be put down or looking for food elsewhere. It&amp;#39;s nice to have a friend and partner through hard times sleeping in the cold. It&amp;#39;s better they&amp;#39;re together than separate sleeping in the streets. &lt;/p&gt;\n\n&lt;p&gt;Giving food only backfired once lol I was like 10 and I convinced my mom to give our food/leftovers/extras to the homeless lady nearby. (My mom never took us out at all, so that corner crappy Chinese food spot was the best thing on earth as a kid lol) I thought she&amp;#39;d love and appreciate something as much as I did especially since she probably doesn&amp;#39;t eat as much as me. My mom warned me: she might not want it or like that we&amp;#39;re offering. &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t believe her and thought she was crazy if this lady didn&amp;#39;t want food. But I was completely wrong. That lady did not want it and started screaming high pitches sounds and noises. Walking aggressively towards me.&lt;/p&gt;\n\n&lt;p&gt;My mom took me away laughing and I was so red and embarrassed. We still laugh about it til this day, but that&amp;#39;s never stopped me from offering. Having grown up in L.A., I see it left and right and my grandma loves chilling and drinking with the homeless and giving them food. I would like it if I was homeless one day, someone hooks me up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg80eme", "score_hidden": false, "stickied": false, "created": 1492137806.0, "created_utc": 1492109006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6573ma", "likes": null, "replies": "", "user_reports": [], "id": "dg8bjmu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hoosierdaddy1964", "parent_id": "t3_6573ma", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you for being a decent human being.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for being a decent human being.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8bjmu", "score_hidden": false, "stickied": false, "created": 1492150565.0, "created_utc": 1492121765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6573ma", "likes": null, "replies": "", "user_reports": [], "id": "dg8llx0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mrthomaswayne", "parent_id": "t3_6573ma", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Good job OP", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good job OP&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8llx0", "score_hidden": false, "stickied": false, "created": 1492164217.0, "created_utc": 1492135417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6573ma", "likes": null, "replies": "", "user_reports": [], "id": "dg8q4qg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "girls_withguns", "parent_id": "t3_6573ma", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Isn't that the best feeling ever?! I also never carry cash, but generic food/hygiene items are always met with a positive review. The world is a miserable, lonely place for more people than we'd care to imagine, so I think it's our responsibility as the \"fortunate\" ones to remove the gap between the \"haves\" and the \"have nots\" when the opportunity presents itself.\n\nI'm sure you made that man and his lovely doggo's week. Keep being an awesome human!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Isn&amp;#39;t that the best feeling ever?! I also never carry cash, but generic food/hygiene items are always met with a positive review. The world is a miserable, lonely place for more people than we&amp;#39;d care to imagine, so I think it&amp;#39;s our responsibility as the &amp;quot;fortunate&amp;quot; ones to remove the gap between the &amp;quot;haves&amp;quot; and the &amp;quot;have nots&amp;quot; when the opportunity presents itself.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure you made that man and his lovely doggo&amp;#39;s week. Keep being an awesome human!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8q4qg", "score_hidden": false, "stickied": false, "created": 1492170983.0, "created_utc": 1492142183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]