[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Long story as short as I can manage...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The background:&lt;/strong&gt; My parents own a company.  I worked there for a couple years after college.  I held a long-standing, deep-seated belief that my dad loved his business more than he loved me.  As such, I cared about the business more than I should have and considered people who worked there an extension of family.  I thought of one particular manager like an uncle for a couple years.  After I started working full-time, I hung out with him (and others from work) because being in the &amp;quot;in-crowd&amp;quot; at the company seemed to be the way to get promoted.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The issue:&lt;/strong&gt; On one of these hanging out nights, uncle-like manager encouraged me to drink way past my limits, and then raped me.  He was married, with a 2-year-old kid, and something like 15 years older than me; I thought he was a safe person.  I literally told him I thought of him like an uncle the same damn night he raped me and left me bleeding the next morning.  I minimized what happened and didn&amp;#39;t label it as rape for a long time.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The result:&lt;/strong&gt; I had to see him every day at work, so I found ways to cope.  He harassed me at work, groped my legs and ass, made inappropriate comments.  I told him I wasn&amp;#39;t interested, but I also literally could not do my job without his help, so I wasn&amp;#39;t too forceful.  I refused to even consider reporting him, because I believed his role at the company was too important, and that the business would be hurt if he wasn&amp;#39;t there.  I was afraid harming the company would basically result in me being disowned by my dad.  So I dealt with it.  I brushed him off as much as possible while still getting my work done.  Plus I&amp;#39;d cared about the guy for years at that point, so I jumped through mental hoops to minimize what he&amp;#39;d done and not see him as a monster.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Later:&lt;/strong&gt; He finally backed off, and spent the next year doing everything he could to sabotage my career.  I finally came to terms with how fucked up the situation was.  I told my mom a couple months after it happened, and my dad about a year and a half later, shortly after he&amp;#39;d been fired.  My parents always supported their kids to resolve their own problems, so other than an offer of physical violence from my dad, neither of them took action.  I learned that at least one other woman at the company was sexually harassed by him.  I wonder if I&amp;#39;d reported him if that would have prevented her being harassed, and feel guilty.  But I also don&amp;#39;t know if he&amp;#39;d have been fired if I did report him.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Today:&lt;/strong&gt; I left their company over two years ago.  My rapist was fired nearly three years ago.  And today I found out their CEO still goes out to dinner with him and charges it to the company, and that my rapist is playing a major role in a company social event this weekend.&lt;/p&gt;\n\n&lt;p&gt;He gets off scot-free and has my parents indirectly buy him dinner and drinks, and I am still suffering over four years later, uncertain how to trust anyone, and living half-way across the country from my family because I can&amp;#39;t stand to live in the same city as him.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: My rapist is still actively involved in things at my parents&amp;#39; company years later, and I&amp;#39;m not coping with it well.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Long story as short as I can manage...\n\n**The background:** My parents own a company.  I worked there for a couple years after college.  I held a long-standing, deep-seated belief that my dad loved his business more than he loved me.  As such, I cared about the business more than I should have and considered people who worked there an extension of family.  I thought of one particular manager like an uncle for a couple years.  After I started working full-time, I hung out with him (and others from work) because being in the \"in-crowd\" at the company seemed to be the way to get promoted.\n\n**The issue:** On one of these hanging out nights, uncle-like manager encouraged me to drink way past my limits, and then raped me.  He was married, with a 2-year-old kid, and something like 15 years older than me; I thought he was a safe person.  I literally told him I thought of him like an uncle the same damn night he raped me and left me bleeding the next morning.  I minimized what happened and didn't label it as rape for a long time.\n\n**The result:** I had to see him every day at work, so I found ways to cope.  He harassed me at work, groped my legs and ass, made inappropriate comments.  I told him I wasn't interested, but I also literally could not do my job without his help, so I wasn't too forceful.  I refused to even consider reporting him, because I believed his role at the company was too important, and that the business would be hurt if he wasn't there.  I was afraid harming the company would basically result in me being disowned by my dad.  So I dealt with it.  I brushed him off as much as possible while still getting my work done.  Plus I'd cared about the guy for years at that point, so I jumped through mental hoops to minimize what he'd done and not see him as a monster.\n\n**Later:** He finally backed off, and spent the next year doing everything he could to sabotage my career.  I finally came to terms with how fucked up the situation was.  I told my mom a couple months after it happened, and my dad about a year and a half later, shortly after he'd been fired.  My parents always supported their kids to resolve their own problems, so other than an offer of physical violence from my dad, neither of them took action.  I learned that at least one other woman at the company was sexually harassed by him.  I wonder if I'd reported him if that would have prevented her being harassed, and feel guilty.  But I also don't know if he'd have been fired if I did report him.\n\n**Today:** I left their company over two years ago.  My rapist was fired nearly three years ago.  And today I found out their CEO still goes out to dinner with him and charges it to the company, and that my rapist is playing a major role in a company social event this weekend.\n\nHe gets off scot-free and has my parents indirectly buy him dinner and drinks, and I am still suffering over four years later, uncertain how to trust anyone, and living half-way across the country from my family because I can't stand to live in the same city as him.\n\n**TL;DR: My rapist is still actively involved in things at my parents' company years later, and I'm not coping with it well.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6587ay", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 29, "report_reasons": null, "author": "canttrustthrowaway", "saved": false, "mod_reports": [], "name": "t3_6587ay", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/6587ay/my_parents_are_regularly_paying_for_my_rapists/", "num_reports": null, "locked": false, "stickied": false, "created": 1492145260.0, "url": "https://www.reddit.com/r/offmychest/comments/6587ay/my_parents_are_regularly_paying_for_my_rapists/", "author_flair_text": null, "quarantine": false, "title": "My parents are regularly paying for my rapist's dinner", "created_utc": 1492116460.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6587ay", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6587ay", "likes": null, "replies": "", "user_reports": [], "id": "dg8eobu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "canttrustthrowaway", "parent_id": "t1_dg8e71f", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you. I'm so sorry you had to go through that, both the abuse and the lack of support.\n\nI need to start going to a therapist again. I tried once, but then got the job offer I moved for before I could make a second appointment, and the second time I tried I saw someone who wasn't a good fit and I didn't get anywhere in dealing with these issues. As I said, it's been four years and I'm still having a lot of trust issues from it. I need help. =\\\n\nMy parents didn't know he was going to be involved in the event this weekend, and I'm not sure they knew that the CEO was still taking him out to dinner. I want to talk to my dad about putting an end to that. I feel weird asking for it, but it's also really important to me to try for my own sanity. I haven't been able to think about anything else all day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I&amp;#39;m so sorry you had to go through that, both the abuse and the lack of support.&lt;/p&gt;\n\n&lt;p&gt;I need to start going to a therapist again. I tried once, but then got the job offer I moved for before I could make a second appointment, and the second time I tried I saw someone who wasn&amp;#39;t a good fit and I didn&amp;#39;t get anywhere in dealing with these issues. As I said, it&amp;#39;s been four years and I&amp;#39;m still having a lot of trust issues from it. I need help. =\\&lt;/p&gt;\n\n&lt;p&gt;My parents didn&amp;#39;t know he was going to be involved in the event this weekend, and I&amp;#39;m not sure they knew that the CEO was still taking him out to dinner. I want to talk to my dad about putting an end to that. I feel weird asking for it, but it&amp;#39;s also really important to me to try for my own sanity. I haven&amp;#39;t been able to think about anything else all day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8eobu", "score_hidden": false, "stickied": false, "created": 1492154725.0, "created_utc": 1492125925.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8e71f", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tealeaves123", "parent_id": "t3_6587ay", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Your uncle sounds really messed up, none of this is your fault and I'm sorry your family didn't do more to support you after what happened to you.\n\nI went through something similar, was abused by an extended family member.  When my parents found out, they didn't do anything to support me like calling police on the person that did this or telling him he was no longer welcome in our home.  At some point I cut my mother off but there were a lot of other reasons for that as well.   I had significant issues with trust for a long time, lots of counseling helped but I don't think I will ever be the same.\n\nAgain, I'm sorry this happened to you, sucks that your parents are indirectly buying him dinner and didn't rally around you after this happened.   Either the people that violate others have no idea of the pain that they cause or don't care.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your uncle sounds really messed up, none of this is your fault and I&amp;#39;m sorry your family didn&amp;#39;t do more to support you after what happened to you.&lt;/p&gt;\n\n&lt;p&gt;I went through something similar, was abused by an extended family member.  When my parents found out, they didn&amp;#39;t do anything to support me like calling police on the person that did this or telling him he was no longer welcome in our home.  At some point I cut my mother off but there were a lot of other reasons for that as well.   I had significant issues with trust for a long time, lots of counseling helped but I don&amp;#39;t think I will ever be the same.&lt;/p&gt;\n\n&lt;p&gt;Again, I&amp;#39;m sorry this happened to you, sucks that your parents are indirectly buying him dinner and didn&amp;#39;t rally around you after this happened.   Either the people that violate others have no idea of the pain that they cause or don&amp;#39;t care.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8e71f", "score_hidden": false, "stickied": false, "created": 1492154086.0, "created_utc": 1492125286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6587ay", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6587ay", "likes": null, "replies": "", "user_reports": [], "id": "dg8iabc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "canttrustthrowaway", "parent_id": "t1_dg8hqrv", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I know. Late in my teens I came to terms with the fact that the two guys I'd dated while I was in high school were sexually/emotionally abusive, and also dug up a repressed memory of being sexually assaulted by a stranger in a movie theater when I was 11. I wish I could say it all stopped there when I realized what I'd gone through, but instead I let all the crap that I'd experienced just create bad habits in my life/relationships. The guy that I worked with was the slap in the face I needed to realize I shouldn't trust people. It's made me bitter and fearful, when I used to always see the best in people and loved everyone.\n\nThat's what hurts the most about it. I'm angry at how naive I used to be, and yet I also miss the person I was. That's what he took from me, more than anything else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. Late in my teens I came to terms with the fact that the two guys I&amp;#39;d dated while I was in high school were sexually/emotionally abusive, and also dug up a repressed memory of being sexually assaulted by a stranger in a movie theater when I was 11. I wish I could say it all stopped there when I realized what I&amp;#39;d gone through, but instead I let all the crap that I&amp;#39;d experienced just create bad habits in my life/relationships. The guy that I worked with was the slap in the face I needed to realize I shouldn&amp;#39;t trust people. It&amp;#39;s made me bitter and fearful, when I used to always see the best in people and loved everyone.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what hurts the most about it. I&amp;#39;m angry at how naive I used to be, and yet I also miss the person I was. That&amp;#39;s what he took from me, more than anything else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8iabc", "score_hidden": false, "stickied": false, "created": 1492159641.0, "created_utc": 1492130841.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8hqrv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Terryuseful", "parent_id": "t3_6587ay", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I wish more people understood what rape is and that it is usually from people you think are safe and that is why they get away with it. \n\nI don't know what your life brings but I hope that if you ever get really down about it and want to hurt yourself that you hurt the person who attacked you. I hope that you keep things together and become successful and let others know at one point that you have been through it, soldered on and that they likely know a rapist and the least they can do is try to understand.\n\nFuck everything. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish more people understood what rape is and that it is usually from people you think are safe and that is why they get away with it. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what your life brings but I hope that if you ever get really down about it and want to hurt yourself that you hurt the person who attacked you. I hope that you keep things together and become successful and let others know at one point that you have been through it, soldered on and that they likely know a rapist and the least they can do is try to understand.&lt;/p&gt;\n\n&lt;p&gt;Fuck everything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8hqrv", "score_hidden": false, "stickied": false, "created": 1492158901.0, "created_utc": 1492130101.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6587ay", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6587ay", "likes": null, "replies": "", "user_reports": [], "id": "dg937tq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "canttrustthrowaway", "parent_id": "t1_dg8wixj", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "He wasn't so great. I just thought he was, because he was really good for a while and he'd replaced someone who was worse than him. In the long run though, he got promoted above his ability and it came out how bad he was. But it took a long time for that to happen, and he made VP before it did.\n\nI don't have any proof except some flirtatious text messages from him that got forwarded to and saved in email, so don't think I could make any kind of case of it.\n\nI really didn't know how to deal. I was in my first full-time job, and had all the weirdness of being really emotionally tied to my work and coworkers because of the family thing. I'm a lot happier in my new job because I don't let it affect me emotionally in the same way; yeah I might get a little stressed and I like my coworkers, but I wouldn't sacrifice my own sanity to protect the company or anyone in it. I try to look at things like that as a reminder that I did get something good out of a shitty situation; I have learned and grown as an adult. Even if those are lessons I'd have been happier to learn in other ways. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He wasn&amp;#39;t so great. I just thought he was, because he was really good for a while and he&amp;#39;d replaced someone who was worse than him. In the long run though, he got promoted above his ability and it came out how bad he was. But it took a long time for that to happen, and he made VP before it did.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have any proof except some flirtatious text messages from him that got forwarded to and saved in email, so don&amp;#39;t think I could make any kind of case of it.&lt;/p&gt;\n\n&lt;p&gt;I really didn&amp;#39;t know how to deal. I was in my first full-time job, and had all the weirdness of being really emotionally tied to my work and coworkers because of the family thing. I&amp;#39;m a lot happier in my new job because I don&amp;#39;t let it affect me emotionally in the same way; yeah I might get a little stressed and I like my coworkers, but I wouldn&amp;#39;t sacrifice my own sanity to protect the company or anyone in it. I try to look at things like that as a reminder that I did get something good out of a shitty situation; I have learned and grown as an adult. Even if those are lessons I&amp;#39;d have been happier to learn in other ways. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg937tq", "score_hidden": false, "stickied": false, "created": 1492203163.0, "created_utc": 1492174363.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wixj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cinnamon2017", "parent_id": "t3_6587ay", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Why was he fired if he was so great?\n\nI wonder if you could report him now or if the statute of limitations is up. You know he's out there raping whoever he can. \n\nTake back your power. When you're young, you just don't know what to do about things. I'm sorry this happened to you and I'm sorry your parents weren't or aren't more supportive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why was he fired if he was so great?&lt;/p&gt;\n\n&lt;p&gt;I wonder if you could report him now or if the statute of limitations is up. You know he&amp;#39;s out there raping whoever he can. &lt;/p&gt;\n\n&lt;p&gt;Take back your power. When you&amp;#39;re young, you just don&amp;#39;t know what to do about things. I&amp;#39;m sorry this happened to you and I&amp;#39;m sorry your parents weren&amp;#39;t or aren&amp;#39;t more supportive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8wixj", "score_hidden": false, "stickied": false, "created": 1492184550.0, "created_utc": 1492155750.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_6587ay", "likes": null, "replies": "", "user_reports": [], "id": "dg96kfl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lilcapt", "parent_id": "t3_6587ay", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This is not advice and no way to properly cope with the situation I would put the guy in the ground...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not advice and no way to properly cope with the situation I would put the guy in the ground...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg96kfl", "score_hidden": false, "stickied": false, "created": 1492208324.0, "created_utc": 1492179524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]