[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My brother died unexpectedly a year ago, it was an overdose, maybe a suicide, we don&amp;#39;t know.  He had been struggling, had many ups and downs over his life and we were estranged.  &lt;/p&gt;\n\n&lt;p&gt;I had helped him out over the years both financially and supported him emotionally, I felt he took me for granted, that it was one sided and the weight of being there for him got to be too much.  I started missing work and had to take some time off because of all the stress. I started to set some limits with him and not be there every time he needed me because it was taking a toll on me mentally, draining me and making it difficult to cope with my own life.  How many times can you help someone who is on and off drugs, intermittently suicidal, needing help and when they are doing well, never seem to care about you?  It hurt.  I was drowning and had to save myself. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to his death, he called or tried to call everyone important to him one last time.  He didn&amp;#39;t call me because I had blocked him over some arguments we had, whether he tried to call, I&amp;#39;ll never know.      &lt;/p&gt;\n\n&lt;p&gt;Looking back now I wished I would have done everything and anything to help him.  Why did I save myself? I have so much guilt and regret, if I would have done more, maybe he&amp;#39;d still be here.   Every few weeks I completely break down and the pain is soul crushing, when that is happening, I pray I will go to sleep and never wake up because I don&amp;#39;t know how I will cope.  I suppose it had gotten a little better, this used to happen daily but I really don&amp;#39;t know how I will get over this or move on with my life.  I&amp;#39;m in counseling, I suppose it helps some.  In some ways I feel like I am being punished for what I didn&amp;#39;t do for him, I have had a series of difficulties since he died.  I think about him daily, sometimes I feel him around me.   &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what I need, maybe that someone else has had similar feelings?   I feel so much, guilt, regret and pain.   &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My brother died unexpectedly a year ago, it was an overdose, maybe a suicide, we don't know.  He had been struggling, had many ups and downs over his life and we were estranged.  \n\nI had helped him out over the years both financially and supported him emotionally, I felt he took me for granted, that it was one sided and the weight of being there for him got to be too much.  I started missing work and had to take some time off because of all the stress. I started to set some limits with him and not be there every time he needed me because it was taking a toll on me mentally, draining me and making it difficult to cope with my own life.  How many times can you help someone who is on and off drugs, intermittently suicidal, needing help and when they are doing well, never seem to care about you?  It hurt.  I was drowning and had to save myself. \n\nFast forward to his death, he called or tried to call everyone important to him one last time.  He didn't call me because I had blocked him over some arguments we had, whether he tried to call, I'll never know.      \n\nLooking back now I wished I would have done everything and anything to help him.  Why did I save myself? I have so much guilt and regret, if I would have done more, maybe he'd still be here.   Every few weeks I completely break down and the pain is soul crushing, when that is happening, I pray I will go to sleep and never wake up because I don't know how I will cope.  I suppose it had gotten a little better, this used to happen daily but I really don't know how I will get over this or move on with my life.  I'm in counseling, I suppose it helps some.  In some ways I feel like I am being punished for what I didn't do for him, I have had a series of difficulties since he died.  I think about him daily, sometimes I feel him around me.   \n\nI don't know what I need, maybe that someone else has had similar feelings?   I feel so much, guilt, regret and pain.   ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "658zqh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "tealeaves123", "saved": false, "mod_reports": [], "name": "t3_658zqh", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/658zqh/my_brother_died_a_year_ago_and_i_feel_soul/", "num_reports": null, "locked": false, "stickied": false, "created": 1492153545.0, "url": "https://www.reddit.com/r/offmychest/comments/658zqh/my_brother_died_a_year_ago_and_i_feel_soul/", "author_flair_text": null, "quarantine": false, "title": "my brother died a year ago and I feel soul crushing pain that is overwhelming", "created_utc": 1492124745.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_658zqh", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_658zqh", "likes": null, "replies": "", "user_reports": [], "id": "dg8h8nf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tealeaves123", "parent_id": "t1_dg8h56y", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "thank you for your kind words.   It helps to hear something other than my own self blame.  Thanks for reading.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you for your kind words.   It helps to hear something other than my own self blame.  Thanks for reading.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8h8nf", "score_hidden": false, "stickied": false, "created": 1492158208.0, "created_utc": 1492129408.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8h56y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "melysechoes2016", "parent_id": "t3_658zqh", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I cannot possibly imagine what you are going through but I do know that the people who are addicted to something always need a helping hand but not at the cost of another's happiness.  I was so angry with a family member for always stealing and ruining everything for himself but when I worked at a home for recovering mothers, I learned that these people are just like everyone else but maybe a little more prone to addictive behaviors than others or not able to care for their psyche as well as others.  I always say that they are weaker but that is something that I am trying to unteach myself.  You tried and you were there.  Take it from someone who has borderline personality disorder and ptsd; at times I was emotionally unreachable; you were there.  He knew that.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I cannot possibly imagine what you are going through but I do know that the people who are addicted to something always need a helping hand but not at the cost of another&amp;#39;s happiness.  I was so angry with a family member for always stealing and ruining everything for himself but when I worked at a home for recovering mothers, I learned that these people are just like everyone else but maybe a little more prone to addictive behaviors than others or not able to care for their psyche as well as others.  I always say that they are weaker but that is something that I am trying to unteach myself.  You tried and you were there.  Take it from someone who has borderline personality disorder and ptsd; at times I was emotionally unreachable; you were there.  He knew that.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8h56y", "score_hidden": false, "stickied": false, "created": 1492158075.0, "created_utc": 1492129275.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_658zqh", "likes": null, "replies": "", "user_reports": [], "id": "dg9mcef", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lostsoul8683", "parent_id": "t3_658zqh", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Oh god.  My sister died this week.  Very similar situation and I am broken.  I can't function, and I'm scared I will just fall apart.  \n\nI keep trying to tell myself she is at peace now, but it's not working to relieve any of the pain.  \n\nI am sorry for your loss, it's so hard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh god.  My sister died this week.  Very similar situation and I am broken.  I can&amp;#39;t function, and I&amp;#39;m scared I will just fall apart.  &lt;/p&gt;\n\n&lt;p&gt;I keep trying to tell myself she is at peace now, but it&amp;#39;s not working to relieve any of the pain.  &lt;/p&gt;\n\n&lt;p&gt;I am sorry for your loss, it&amp;#39;s so hard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9mcef", "score_hidden": false, "stickied": false, "created": 1492226988.0, "created_utc": 1492198188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]