[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not somebody who grew up a huge Star Wars fan. It was always there in the background, but I really only got into it maybe a year and a half to two years ago, when TFA was being hyped up. I instantly adored Carrie, but she wasn&amp;#39;t someone who had any kind of presence in my life for so long – so why, why can&amp;#39;t I get over her death?&lt;/p&gt;\n\n&lt;p&gt;I read her twitter almost every day. Her wit showed through (even though that emoji alphabet she insisted on using). I found out she had mental illnesses and struggled with addiction. She was absolutely captivating, as a 19 year old and as a 60 year old. I was terrified for her when I heard of her heart attack, and crushed when I heard of her death. She wasn&amp;#39;t breathing for nearly 30 minutes on the day it happened. I didn&amp;#39;t think she had much of a chance, but I also didn&amp;#39;t want to think that she&amp;#39;d die. Carrie and Debbie, together...it felt like a cruel joke to me. 2016 couldn&amp;#39;t resist one last tragedy. &lt;/p&gt;\n\n&lt;p&gt;I have watched the tribute to Carrie (the one shown at SW Celebration today) 3 times, and 3 times I&amp;#39;ve burst into tears at the exact same place: a clip of present-day Carrie saying, &amp;quot;Help me, Obi-Wan Kenobi,&amp;quot; and then whispering, &amp;quot;You&amp;#39;re my only hope.&amp;quot; She&amp;#39;s just reciting her old lines, but it feels very melancholic. I can&amp;#39;t put my finger on it, but I&amp;#39;ve watched that part over and over.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never lost anybody close to me in real life, so maybe that&amp;#39;s why I&amp;#39;ve taken this so hard. I still feel like I&amp;#39;m grieving. She was probably the only celebrity I&amp;#39;ve ever wanted to meet. I think about her so much. It still hurts. I don&amp;#39;t believe in god, but I like to picture her being up there somewhere.&lt;/p&gt;\n\n&lt;p&gt;If you haven&amp;#39;t seen the tribute video, I think it&amp;#39;s worth it if not just to see the tiny part I described above (of course, the whole thing is equally beautiful and touching).&lt;/p&gt;\n\n&lt;p&gt;I miss you Carrie :(&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not somebody who grew up a huge Star Wars fan. It was always there in the background, but I really only got into it maybe a year and a half to two years ago, when TFA was being hyped up. I instantly adored Carrie, but she wasn't someone who had any kind of presence in my life for so long – so why, why can't I get over her death?\n\nI read her twitter almost every day. Her wit showed through (even though that emoji alphabet she insisted on using). I found out she had mental illnesses and struggled with addiction. She was absolutely captivating, as a 19 year old and as a 60 year old. I was terrified for her when I heard of her heart attack, and crushed when I heard of her death. She wasn't breathing for nearly 30 minutes on the day it happened. I didn't think she had much of a chance, but I also didn't want to think that she'd die. Carrie and Debbie, together...it felt like a cruel joke to me. 2016 couldn't resist one last tragedy. \n\nI have watched the tribute to Carrie (the one shown at SW Celebration today) 3 times, and 3 times I've burst into tears at the exact same place: a clip of present-day Carrie saying, \"Help me, Obi-Wan Kenobi,\" and then whispering, \"You're my only hope.\" She's just reciting her old lines, but it feels very melancholic. I can't put my finger on it, but I've watched that part over and over.\n\nI've never lost anybody close to me in real life, so maybe that's why I've taken this so hard. I still feel like I'm grieving. She was probably the only celebrity I've ever wanted to meet. I think about her so much. It still hurts. I don't believe in god, but I like to picture her being up there somewhere.\n\nIf you haven't seen the tribute video, I think it's worth it if not just to see the tiny part I described above (of course, the whole thing is equally beautiful and touching).\n\nI miss you Carrie :(", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65a3pl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "cellularjam", "saved": false, "mod_reports": [], "name": "t3_65a3pl", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65a3pl/im_still_not_over_carrie_fishers_death/", "num_reports": null, "locked": false, "stickied": false, "created": 1492166904.0, "url": "https://www.reddit.com/r/offmychest/comments/65a3pl/im_still_not_over_carrie_fishers_death/", "author_flair_text": null, "quarantine": false, "title": "I'm still not over Carrie Fisher's death", "created_utc": 1492138104.0, "distinguished": null, "media": null, "upvote_ratio": 0.65, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65a3pl", "likes": null, "replies": "", "user_reports": [], "id": "dg8uydm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "JohnTheMod", "parent_id": "t3_65a3pl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I don't think Carrie's someone anyone can get over.  It'll be four months in a couple weeks from now, and it still hurts that after Episode IX at the latest, we'll never see her again.  You know, it's funny.  I kept imagining her coming out from backstage with Gary in tow during the panel yesterday, only to remember that she's not there.  I miss my Princess, and if I could've given my life to spare hers, I would've.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think Carrie&amp;#39;s someone anyone can get over.  It&amp;#39;ll be four months in a couple weeks from now, and it still hurts that after Episode IX at the latest, we&amp;#39;ll never see her again.  You know, it&amp;#39;s funny.  I kept imagining her coming out from backstage with Gary in tow during the panel yesterday, only to remember that she&amp;#39;s not there.  I miss my Princess, and if I could&amp;#39;ve given my life to spare hers, I would&amp;#39;ve.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8uydm", "score_hidden": false, "stickied": false, "created": 1492180350.0, "created_utc": 1492151550.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65a3pl", "likes": null, "replies": "", "user_reports": [], "id": "dg8yna3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BigYearColorado", "parent_id": "t3_65a3pl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Carrie Fisher was so influential that her loss has this unknowable chasm underneath it. She worked on so many movies, credited and uncredited, that we will never know everything she touched and changed. It's rare to see someone with her force of personality and 2016 was a year in which we lost many of those people. The year started with Bowie, kept up its momentum with Prince, and ended with Fisher. She felt a bit like a finishing blow: something expected, appropriate, and still horrible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Carrie Fisher was so influential that her loss has this unknowable chasm underneath it. She worked on so many movies, credited and uncredited, that we will never know everything she touched and changed. It&amp;#39;s rare to see someone with her force of personality and 2016 was a year in which we lost many of those people. The year started with Bowie, kept up its momentum with Prince, and ended with Fisher. She felt a bit like a finishing blow: something expected, appropriate, and still horrible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8yna3", "score_hidden": false, "stickied": false, "created": 1492191252.0, "created_utc": 1492162452.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65a3pl", "likes": null, "replies": "", "user_reports": [], "id": "dg8r5bl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Womenarepeopletoo69", "parent_id": "t3_65a3pl", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I made a small shrine with her photo and an R2D2 figurine and a candle. Loved that woman.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I made a small shrine with her photo and an R2D2 figurine and a candle. Loved that woman.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg8r5bl", "score_hidden": false, "stickied": false, "created": 1492172644.0, "created_utc": 1492143844.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]