[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My parents have recently inherited a house by the coast from my late grandparents. They are going to keep it as their holiday home, and have been cleaning it up and doing diy jobs over the past few months. I asked them if I could redesign the deck area (there&amp;#39;s a huge deck) and they said I could and so I have been running ideas by them for the past couple of months and devellopimg designs for the area.&lt;/p&gt;\n\n&lt;p&gt;At the moment it&amp;#39;s shabby and delapidated and I plan to reinvigorate it with new stained wood finishings, a suspended garden and features that pay homage to my late grandparents (e.g. Incorporating my late grandmas favourite flowers into the design) and using recycled timber from my late grandfather&amp;#39;s shed.&lt;/p&gt;\n\n&lt;p&gt;I have been putting a lot of thought into it and running th ideas by my parents and i am almost ready to start work.&lt;/p&gt;\n\n&lt;p&gt;Today over breakfast with my older brother, his fiancé and my parents my brother said I would need to help him paint his house. I said I would but that my main focus is on building the new deck. Immediately he started laughing and told me that nobody was serious about letting me redesign the deck.&lt;/p&gt;\n\n&lt;p&gt;His fiancé said that &amp;quot;no one wants to have to look at the shit you have collected from some shed&amp;quot; and that it&amp;#39;s going to ruin the house.&lt;/p&gt;\n\n&lt;p&gt;I told them that I have put a lot of work into the design and I think it will look good and they laughed at me. I&amp;#39;ve never felt so belittled before in my life, it was terrible and I felt like crying and I was really angry because they haven&amp;#39;t even seen my designs and they&amp;#39;re dismissing them and saying that they&amp;#39;re not good.&lt;/p&gt;\n\n&lt;p&gt;My brother said again that it&amp;#39;s not going to happen and that it will ruin the house and so I stood up and walked out. I&amp;#39;ve never done that before in my life but I did because I felt disrespected. I have gotten approval to do this and I&amp;#39;ve been working hard on it and putting in a lot of effort and they cut me down. It&amp;#39;s not even their house, it&amp;#39;s my parents&amp;#39; house and I asked if I could go ahead with this and I&amp;#39;ve been running all my plans by them.&lt;/p&gt;\n\n&lt;p&gt;I feel really shit. I almost cried later on today. It was a piece of my heart in those designs and they have cut them down in a really mean manner.&lt;/p&gt;\n\n&lt;p&gt;EDIT: thank you everyone for your responses. Last night I decided I would like to cut my brother and his fiancé out of my life. I knew this was a big decision so I decided to sleep on it and see how I felt in the morning. I feel the same way now. I am still undecided now as to whether I build the deck. I do not want to build something that will go unappreciated and be ridiculed. I am considering taking the materials and building a sculpture for a local festival instead (where I live there are many festivals in the summer in the countryside and people build sculptures that they leave scattered around the festival grounds for the patrons to look at and enjoy (generally as they trip on acid or other psychedelics)). I am going to talk to my parents and see if they want it or not. If they don&amp;#39;t then I will go with the festival idea instead because I know it will be appreciated there. Thanks everyone for your support.&lt;/p&gt;\n\n&lt;p&gt;TL;DR my art was laughed and attacked at by my brother and his fiancé&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My parents have recently inherited a house by the coast from my late grandparents. They are going to keep it as their holiday home, and have been cleaning it up and doing diy jobs over the past few months. I asked them if I could redesign the deck area (there's a huge deck) and they said I could and so I have been running ideas by them for the past couple of months and devellopimg designs for the area.\n\nAt the moment it's shabby and delapidated and I plan to reinvigorate it with new stained wood finishings, a suspended garden and features that pay homage to my late grandparents (e.g. Incorporating my late grandmas favourite flowers into the design) and using recycled timber from my late grandfather's shed.\n\nI have been putting a lot of thought into it and running th ideas by my parents and i am almost ready to start work.\n\nToday over breakfast with my older brother, his fiancé and my parents my brother said I would need to help him paint his house. I said I would but that my main focus is on building the new deck. Immediately he started laughing and told me that nobody was serious about letting me redesign the deck.\n\nHis fiancé said that \"no one wants to have to look at the shit you have collected from some shed\" and that it's going to ruin the house.\n\nI told them that I have put a lot of work into the design and I think it will look good and they laughed at me. I've never felt so belittled before in my life, it was terrible and I felt like crying and I was really angry because they haven't even seen my designs and they're dismissing them and saying that they're not good.\n\nMy brother said again that it's not going to happen and that it will ruin the house and so I stood up and walked out. I've never done that before in my life but I did because I felt disrespected. I have gotten approval to do this and I've been working hard on it and putting in a lot of effort and they cut me down. It's not even their house, it's my parents' house and I asked if I could go ahead with this and I've been running all my plans by them.\n\nI feel really shit. I almost cried later on today. It was a piece of my heart in those designs and they have cut them down in a really mean manner.\n\nEDIT: thank you everyone for your responses. Last night I decided I would like to cut my brother and his fiancé out of my life. I knew this was a big decision so I decided to sleep on it and see how I felt in the morning. I feel the same way now. I am still undecided now as to whether I build the deck. I do not want to build something that will go unappreciated and be ridiculed. I am considering taking the materials and building a sculpture for a local festival instead (where I live there are many festivals in the summer in the countryside and people build sculptures that they leave scattered around the festival grounds for the patrons to look at and enjoy (generally as they trip on acid or other psychedelics)). I am going to talk to my parents and see if they want it or not. If they don't then I will go with the festival idea instead because I know it will be appreciated there. Thanks everyone for your support.\n\nTL;DR my art was laughed and attacked at by my brother and his fiancé", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65bnc6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 85, "report_reasons": null, "author": "law_it_mandarin", "saved": false, "mod_reports": [], "name": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": 1492212477.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65bnc6/i_poured_my_heart_into_something_and_my_siblings/", "num_reports": null, "locked": false, "stickied": false, "created": 1492192099.0, "url": "https://www.reddit.com/r/offmychest/comments/65bnc6/i_poured_my_heart_into_something_and_my_siblings/", "author_flair_text": null, "quarantine": false, "title": "i poured my heart into something and my siblings mocked me for it", "created_utc": 1492163299.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 24, "visited": false, "subreddit_type": "public", "ups": 85}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9itos", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "AlucardD80", "parent_id": "t1_dg9cv2c", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's what I'd fucking do. Why even help? Cuz you're my brother? Pfft.\n\nIn my family if you're an asshole, you're an asshole and deserve no help. Blood or no blood relation you're treated how you treat others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I&amp;#39;d fucking do. Why even help? Cuz you&amp;#39;re my brother? Pfft.&lt;/p&gt;\n\n&lt;p&gt;In my family if you&amp;#39;re an asshole, you&amp;#39;re an asshole and deserve no help. Blood or no blood relation you&amp;#39;re treated how you treat others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9itos", "score_hidden": false, "stickied": false, "created": 1492222751.0, "created_utc": 1492193951.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cv2c", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Durbee", "parent_id": "t1_dg933f6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "And you don't have to paint their home.  \"Apparently my work and ideas don't meet your standards. You'd be better served hiring a contractor.\"  Then stop engaging.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And you don&amp;#39;t have to paint their home.  &amp;quot;Apparently my work and ideas don&amp;#39;t meet your standards. You&amp;#39;d be better served hiring a contractor.&amp;quot;  Then stop engaging.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9cv2c", "score_hidden": false, "stickied": false, "created": 1492215887.0, "created_utc": 1492187087.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9s5gs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "havetothrowawaythis1", "parent_id": "t1_dg933f6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Good. As long as you walk away from this experience with renewed self-confidence, I'm happy. Go kick ass. (Not your brother's, though. Somehow I think that won't help matters...)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good. As long as you walk away from this experience with renewed self-confidence, I&amp;#39;m happy. Go kick ass. (Not your brother&amp;#39;s, though. Somehow I think that won&amp;#39;t help matters...)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9s5gs", "score_hidden": false, "stickied": false, "created": 1492234066.0, "created_utc": 1492205266.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg933f6", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "law_it_mandarin", "parent_id": "t1_dg91ir6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Yeah you're right actually. They make me feel like this a fair bit. Last time was about two months ago when I took on a lower paying job that I am more passionate about and they said I was immature and needed to grow up because I moved into a share house as a result (I'm single with no kids though, so it's not as though that decision affected anyone but me).\n\nIt sucks because I've always been nice and supportive to them. I try to be supportive of all my friends and (would you believe it) my friends usually try to be supportive and nice to me. It's awesome and that's why I love them. I think there is no chance that I would be friends with my brother and his fiancé If it weren't for our blood. I usually just cut these people out of my personal life, and so I'm not skilled at having to deal with them when I can't so easily cut them off.\n\nAnyway, that's my rant done. Thanks for your comment havetothrowawaythis1, it really meant a lot to me and it made me feel a little better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah you&amp;#39;re right actually. They make me feel like this a fair bit. Last time was about two months ago when I took on a lower paying job that I am more passionate about and they said I was immature and needed to grow up because I moved into a share house as a result (I&amp;#39;m single with no kids though, so it&amp;#39;s not as though that decision affected anyone but me).&lt;/p&gt;\n\n&lt;p&gt;It sucks because I&amp;#39;ve always been nice and supportive to them. I try to be supportive of all my friends and (would you believe it) my friends usually try to be supportive and nice to me. It&amp;#39;s awesome and that&amp;#39;s why I love them. I think there is no chance that I would be friends with my brother and his fiancé If it weren&amp;#39;t for our blood. I usually just cut these people out of my personal life, and so I&amp;#39;m not skilled at having to deal with them when I can&amp;#39;t so easily cut them off.&lt;/p&gt;\n\n&lt;p&gt;Anyway, that&amp;#39;s my rant done. Thanks for your comment havetothrowawaythis1, it really meant a lot to me and it made me feel a little better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg933f6", "score_hidden": false, "stickied": false, "created": 1492202940.0, "created_utc": 1492174140.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 39}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91ir6", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "havetothrowawaythis1", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I doubt this is the first time you've felt cut down and unsupported?\n\nSome people just like to piss on anything creative or interesting because they lack the imagination to do something similar. In this case it also sounds less like an incident and more like a family dynamic. Take it from me, your project sounds amazing. Ignore the nasty feedback. You were right to walk away.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I doubt this is the first time you&amp;#39;ve felt cut down and unsupported?&lt;/p&gt;\n\n&lt;p&gt;Some people just like to piss on anything creative or interesting because they lack the imagination to do something similar. In this case it also sounds less like an incident and more like a family dynamic. Take it from me, your project sounds amazing. Ignore the nasty feedback. You were right to walk away.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg91ir6", "score_hidden": false, "stickied": false, "created": 1492199690.0, "created_utc": 1492170890.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg95qg5", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "-Avacyn", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Let me guess, your brother and fiancée are are this ultimate, stereotypical middle class family who care *a lot* about appearances and living the perfect LifeScript life.\n\nA lot of people like this act this way because of some deep seeded insecurity, because deep down, people who don't conform to how someone *should* live their life according to them, is a threat to their status quo of what is 'normal'. \n\nYou do you. Don't invest too much time and effort in them, as you know, it will never be returned. And if they are crappy to you, stand up for yourself. So what if they get angry and pissed, it's not like they truly care about you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let me guess, your brother and fiancée are are this ultimate, stereotypical middle class family who care &lt;em&gt;a lot&lt;/em&gt; about appearances and living the perfect LifeScript life.&lt;/p&gt;\n\n&lt;p&gt;A lot of people like this act this way because of some deep seeded insecurity, because deep down, people who don&amp;#39;t conform to how someone &lt;em&gt;should&lt;/em&gt; live their life according to them, is a threat to their status quo of what is &amp;#39;normal&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;You do you. Don&amp;#39;t invest too much time and effort in them, as you know, it will never be returned. And if they are crappy to you, stand up for yourself. So what if they get angry and pissed, it&amp;#39;s not like they truly care about you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg95qg5", "score_hidden": false, "stickied": false, "created": 1492207156.0, "created_utc": 1492178356.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9d3ob", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "chasing_cheerios", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Don't help him paint his house. He doesn't respect you just wants to use you. What an ass", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t help him paint his house. He doesn&amp;#39;t respect you just wants to use you. What an ass&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9d3ob", "score_hidden": false, "stickied": false, "created": 1492216155.0, "created_utc": 1492187355.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg979hf", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "toodlesmn", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sounds like brother is jealous of your talents. Please don't help that creep paint his house.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like brother is jealous of your talents. Please don&amp;#39;t help that creep paint his house.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg979hf", "score_hidden": false, "stickied": false, "created": 1492209246.0, "created_utc": 1492180446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9cr4x", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "B_Randy210", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I think your ideas sound amazing. Great thing you don't need your brothers approval for those plans, and you've been running them by your parents. There approval is the only one you need. Don't let your brother and his fiancé ruin your vision and put a damper on your passion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your ideas sound amazing. Great thing you don&amp;#39;t need your brothers approval for those plans, and you&amp;#39;ve been running them by your parents. There approval is the only one you need. Don&amp;#39;t let your brother and his fiancé ruin your vision and put a damper on your passion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9cr4x", "score_hidden": false, "stickied": false, "created": 1492215769.0, "created_utc": 1492186969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9fhge", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "KitchenSwillForPigs", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I would definitely not help him paint the house. It's your parent's place, they gave the okay on your designs. Don't give up on the deck. It sounds amazing. Your brother sounds like an ass. I'm really sorry he belittled you. That feels so shitty. Did you parents say anything when they were treating you like that? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would definitely not help him paint the house. It&amp;#39;s your parent&amp;#39;s place, they gave the okay on your designs. Don&amp;#39;t give up on the deck. It sounds amazing. Your brother sounds like an ass. I&amp;#39;m really sorry he belittled you. That feels so shitty. Did you parents say anything when they were treating you like that? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9fhge", "score_hidden": false, "stickied": false, "created": 1492218853.0, "created_utc": 1492190053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9in1d", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ThirtyLastCalls", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Were your parents just silent during this interaction?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Were your parents just silent during this interaction?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9in1d", "score_hidden": false, "stickied": false, "created": 1492222532.0, "created_utc": 1492193732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9lttb", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "holystar64", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Yo fuck your unsupportive ass family", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yo fuck your unsupportive ass family&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9lttb", "score_hidden": false, "stickied": false, "created": 1492226364.0, "created_utc": 1492197564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9hp4y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lazydaysjj", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Man, fuck them they sound heartless and stupid. If your parents still approve of you doing the deck then go for it! It's their house not your brothers. Otherwise keep those materials and maybe use them for yourself for something special. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, fuck them they sound heartless and stupid. If your parents still approve of you doing the deck then go for it! It&amp;#39;s their house not your brothers. Otherwise keep those materials and maybe use them for yourself for something special. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9hp4y", "score_hidden": false, "stickied": false, "created": 1492221418.0, "created_utc": 1492192618.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9miwu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Cpt_Picard", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "take a hammer to their skulls and paint the deck with their blood.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;take a hammer to their skulls and paint the deck with their blood.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9miwu", "score_hidden": false, "stickied": false, "created": 1492227203.0, "created_utc": 1492198403.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dgaanmp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HammStar", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "His girlfriend is a yes man and is just following his lead.  They are narrow minded slaves who couldn't conjure the imagination to draw a stick figure, and laugh at what they don't understand because they could never accomplish such a task.  As an artist you've got to be bed fellows with criticism, but I can see how it coming from a family member is why it hurt a little more.  I agree with others that he is clearly toxic to you being your best, and you are doing the right thing by avoiding him.  Tell that lazy fuck to paint his own house, and if he asked why your being bitter, be honest.", "edited": 1492231892.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His girlfriend is a yes man and is just following his lead.  They are narrow minded slaves who couldn&amp;#39;t conjure the imagination to draw a stick figure, and laugh at what they don&amp;#39;t understand because they could never accomplish such a task.  As an artist you&amp;#39;ve got to be bed fellows with criticism, but I can see how it coming from a family member is why it hurt a little more.  I agree with others that he is clearly toxic to you being your best, and you are doing the right thing by avoiding him.  Tell that lazy fuck to paint his own house, and if he asked why your being bitter, be honest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgaanmp", "score_hidden": false, "stickied": false, "created": 1492260209.0, "created_utc": 1492231409.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9i7i1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "atticSlabs", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Bro you need to use this as fuel to do this deck! I believe you are on a good track!! They obviously are not seeing what you see.. And easily thrown away since this is something I'm assuming you don't do? So yes they are going to think your nuts! But, if you take that initiative and start, maybe just maybe they might start taking you serious! But using old shed wood takes alot of time... it really does. Alot of match making and depending on conditions as well. You should definitely post the deck as is, the shed you are gonna use, and your ideas for the outcome! Id be down to help you along!?", "edited": 1492193582.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bro you need to use this as fuel to do this deck! I believe you are on a good track!! They obviously are not seeing what you see.. And easily thrown away since this is something I&amp;#39;m assuming you don&amp;#39;t do? So yes they are going to think your nuts! But, if you take that initiative and start, maybe just maybe they might start taking you serious! But using old shed wood takes alot of time... it really does. Alot of match making and depending on conditions as well. You should definitely post the deck as is, the shed you are gonna use, and your ideas for the outcome! Id be down to help you along!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9i7i1", "score_hidden": false, "stickied": false, "created": 1492222017.0, "created_utc": 1492193217.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9iwpv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rondevu69", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Your sibling sounds like a dream killer.  You don't need that in your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your sibling sounds like a dream killer.  You don&amp;#39;t need that in your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9iwpv", "score_hidden": false, "stickied": false, "created": 1492222849.0, "created_utc": 1492194049.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9jezj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheFuturist47", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Fuck your brother and fuck his fiance. They haven't even seen your plans. This is between you and your parents. I hope your parents stood up for you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck your brother and fuck his fiance. They haven&amp;#39;t even seen your plans. This is between you and your parents. I hope your parents stood up for you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9jezj", "score_hidden": false, "stickied": false, "created": 1492223454.0, "created_utc": 1492194654.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9jtct", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "somtcherry", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sometimes that's an indicator for when you need to cut out the toxicity of certain relationships in your life. It wasn't fair for them to be so condescending - if this happens frequently you should take the opportunity to sit your brother down and have a serious conversation about your feelings. If he's the sort to just laugh and brush it off, then you know where you stand.\n\nYour work pays homage to people you love and you shouldn't have to compromise on that. Best of luck OP", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes that&amp;#39;s an indicator for when you need to cut out the toxicity of certain relationships in your life. It wasn&amp;#39;t fair for them to be so condescending - if this happens frequently you should take the opportunity to sit your brother down and have a serious conversation about your feelings. If he&amp;#39;s the sort to just laugh and brush it off, then you know where you stand.&lt;/p&gt;\n\n&lt;p&gt;Your work pays homage to people you love and you shouldn&amp;#39;t have to compromise on that. Best of luck OP&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9jtct", "score_hidden": false, "stickied": false, "created": 1492223937.0, "created_utc": 1492195137.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9ohb7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cinnamon2017", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Your brother is a jackass. I have one like that. I have nothing to do with him. Trust me, I know it hurts because family is \"supposed\" to love you and be supportive. That's how it is in all the tv shows amd movies, right? Only in real life, people just won't behave and they do and say whatever they want and don't care about how anyone else feels.  You're related so you are expected to put up with it. I'm glad you walked out. Do NOT help your brother paint his house. They are just jealous, afraid that this will turn out awesomely, and afraid that you will get the credit and attention. Ignore them and/or look up some snappy comebacks to rude remarks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your brother is a jackass. I have one like that. I have nothing to do with him. Trust me, I know it hurts because family is &amp;quot;supposed&amp;quot; to love you and be supportive. That&amp;#39;s how it is in all the tv shows amd movies, right? Only in real life, people just won&amp;#39;t behave and they do and say whatever they want and don&amp;#39;t care about how anyone else feels.  You&amp;#39;re related so you are expected to put up with it. I&amp;#39;m glad you walked out. Do NOT help your brother paint his house. They are just jealous, afraid that this will turn out awesomely, and afraid that you will get the credit and attention. Ignore them and/or look up some snappy comebacks to rude remarks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9ohb7", "score_hidden": false, "stickied": false, "created": 1492229555.0, "created_utc": 1492200755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dga3a5l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "spaghettisauce11", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "fuck them, your parents said you could so go for it.....\n\nBuild the shit outta that deck and make it so awesome your brother and his fiance will want to use it for baby showers and shit, When they do you remind them that they laughed and tell them to fuck off. Sorry if i sound aggressive but reading the situation made3 me mad for you, thats downright hurtful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;fuck them, your parents said you could so go for it.....&lt;/p&gt;\n\n&lt;p&gt;Build the shit outta that deck and make it so awesome your brother and his fiance will want to use it for baby showers and shit, When they do you remind them that they laughed and tell them to fuck off. Sorry if i sound aggressive but reading the situation made3 me mad for you, thats downright hurtful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dga3a5l", "score_hidden": false, "stickied": false, "created": 1492248903.0, "created_utc": 1492220103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9mbud", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RestingMurderFace", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Your parents should have stood up for you. \n\nBtw, you sound like a tremendously creative, thoughtful, loving person.\n\nYour brother and his wife will never be as cool as you are.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your parents should have stood up for you. &lt;/p&gt;\n\n&lt;p&gt;Btw, you sound like a tremendously creative, thoughtful, loving person.&lt;/p&gt;\n\n&lt;p&gt;Your brother and his wife will never be as cool as you are.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9mbud", "score_hidden": false, "stickied": false, "created": 1492226969.0, "created_utc": 1492198169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65bnc6", "likes": null, "replies": "", "user_reports": [], "id": "dg9n537", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MonkyThrowPoop", "parent_id": "t3_65bnc6", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "If they do that again, or next time you're around them and discussing your plans with your parents, just mention something about how you're \"sorry that they don't have the imagination to picture it and appreciate the thought and effort in it.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If they do that again, or next time you&amp;#39;re around them and discussing your plans with your parents, just mention something about how you&amp;#39;re &amp;quot;sorry that they don&amp;#39;t have the imagination to picture it and appreciate the thought and effort in it.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9n537", "score_hidden": false, "stickied": false, "created": 1492227945.0, "created_utc": 1492199145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]