[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Living alone sounds nice to me. Mainly because I&amp;#39;ve only been alone on my own for about 9 months. When my mom went back home over seas to visit. 28 years in I find myself resenting every single person around me. So here it goes, as I can&amp;#39;t say this to anyone in my life. &lt;/p&gt;\n\n&lt;p&gt;I would love to divorce my wife, put my mom in a senior home, sell my house, quit my job, and move to another city and live in a studio apartment by myself. I am so sick of dealing with anxiety and drama that I want to just quit. Nothing has changed in the last 6 years. The same arguments over and over. I feel bad for my kids, they think they&amp;#39;re parents are happy and life is good. I am trying to hard to not let any of this effect them but I&amp;#39;m breaking. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m anxious, depressed, confused, angry. I don&amp;#39;t know what to do and it&amp;#39;s killing me. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Living alone sounds nice to me. Mainly because I've only been alone on my own for about 9 months. When my mom went back home over seas to visit. 28 years in I find myself resenting every single person around me. So here it goes, as I can't say this to anyone in my life. \n\nI would love to divorce my wife, put my mom in a senior home, sell my house, quit my job, and move to another city and live in a studio apartment by myself. I am so sick of dealing with anxiety and drama that I want to just quit. Nothing has changed in the last 6 years. The same arguments over and over. I feel bad for my kids, they think they're parents are happy and life is good. I am trying to hard to not let any of this effect them but I'm breaking. \n\nI'm anxious, depressed, confused, angry. I don't know what to do and it's killing me. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65dyds", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 69, "report_reasons": null, "author": "beersinspace", "saved": false, "mod_reports": [], "name": "t3_65dyds", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65dyds/i_want_to_be_live_alone_and_only_worry_about/", "num_reports": null, "locked": false, "stickied": false, "created": 1492220219.0, "url": "https://www.reddit.com/r/offmychest/comments/65dyds/i_want_to_be_live_alone_and_only_worry_about/", "author_flair_text": null, "quarantine": false, "title": "I want to be live alone and only worry about myself", "created_utc": 1492191419.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 69}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": "", "user_reports": [], "id": "dgc4h7l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lazy-lemur", "parent_id": "t1_dgbifsm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Good luck! Alone time is critical for my sanity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck! Alone time is critical for my sanity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc4h7l", "score_hidden": false, "stickied": false, "created": 1492384023.0, "created_utc": 1492355223.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbifsm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "beersinspace", "parent_id": "t1_dg9ti8a", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You're absolutely right. I would drown in the guilt if I were to leave. I can't do that to my kids. I like your idea of having alone time, and I might do just that. I have been up early some mornings and it's really nice. No noise, no nagging, just me and my coffee. I might make it a habit. Thanks for the advice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re absolutely right. I would drown in the guilt if I were to leave. I can&amp;#39;t do that to my kids. I like your idea of having alone time, and I might do just that. I have been up early some mornings and it&amp;#39;s really nice. No noise, no nagging, just me and my coffee. I might make it a habit. Thanks for the advice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbifsm", "score_hidden": false, "stickied": false, "created": 1492336404.0, "created_utc": 1492307604.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ti8a", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "lazy-lemur", "parent_id": "t3_65dyds", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I feel for you. My mother is dead now, but for many years I had to take care of my mother, my wife, and my two daughters. It did get better, sort of, when we finally moved my mother into a care facility. But I hear you. \n\nYou can take this route, \"run away\" if you like, but I will warn you that the guilt can be terribly powerful (I did this before children.)\n\nAnother option to consider is how you could carve out Alone Time For You in all this. What would it take for you? An afternoon a week? Or several hours a day? Lately I've chosen to give up the evenings for the family, go to bed early (like, 9 pm), but then I get up at 4:30 in the morning and trust me, no one will bother you, no one will call and need anything, between 4:30 and 6:30 in the morning. I have ice coffee prepped (no running the coffee maker, that might wake someone up,) and the cat and I go sit outside in the back yard in the dark and smoke and drink ice coffee, Reddit or Facebook or read the news, whatever. It's my time and I love it. Makes the rest not so bad. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel for you. My mother is dead now, but for many years I had to take care of my mother, my wife, and my two daughters. It did get better, sort of, when we finally moved my mother into a care facility. But I hear you. &lt;/p&gt;\n\n&lt;p&gt;You can take this route, &amp;quot;run away&amp;quot; if you like, but I will warn you that the guilt can be terribly powerful (I did this before children.)&lt;/p&gt;\n\n&lt;p&gt;Another option to consider is how you could carve out Alone Time For You in all this. What would it take for you? An afternoon a week? Or several hours a day? Lately I&amp;#39;ve chosen to give up the evenings for the family, go to bed early (like, 9 pm), but then I get up at 4:30 in the morning and trust me, no one will bother you, no one will call and need anything, between 4:30 and 6:30 in the morning. I have ice coffee prepped (no running the coffee maker, that might wake someone up,) and the cat and I go sit outside in the back yard in the dark and smoke and drink ice coffee, Reddit or Facebook or read the news, whatever. It&amp;#39;s my time and I love it. Makes the rest not so bad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9ti8a", "score_hidden": false, "stickied": false, "created": 1492235810.0, "created_utc": 1492207010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": "", "user_reports": [], "id": "dg9k7bz", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "DantehMawn", "parent_id": "t3_65dyds", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Your happiness is just as important as anyone else's. I know my comment might not help much but don't forget that you deserve to be happy, no matter what anyone else thinks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your happiness is just as important as anyone else&amp;#39;s. I know my comment might not help much but don&amp;#39;t forget that you deserve to be happy, no matter what anyone else thinks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9k7bz", "score_hidden": false, "stickied": false, "created": 1492224401.0, "created_utc": 1492195601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": "", "user_reports": [], "id": "dgbihui", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "beersinspace", "parent_id": "t1_dg9nvlj", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "&gt;You can't will yourself into desiring a certain kind of lifestyle if you at the same time wholeheartedly don't want it. \n\nYou've hit the nail on the head. I thought I could do it and be strong but it's an uphill battle every day. Thank you for your advice, it's given me a lot think about. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You can&amp;#39;t will yourself into desiring a certain kind of lifestyle if you at the same time wholeheartedly don&amp;#39;t want it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ve hit the nail on the head. I thought I could do it and be strong but it&amp;#39;s an uphill battle every day. Thank you for your advice, it&amp;#39;s given me a lot think about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbihui", "score_hidden": false, "stickied": false, "created": 1492336489.0, "created_utc": 1492307689.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9nvlj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FucksLikeASeraphim", "parent_id": "t3_65dyds", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I haven't been in the same situation as you, but I've been in a similar one. I made a decision to get involved in something that I didn't wholly want, and it wound up eating me alive. Each day there was a stress, a tremendous pressure to perform and to do what I said I'd do. But here's the thing: people *change their mind*. I talked myself into wanting a thing that I didn't really want. I didn't want it, yet I did the same menial things every day, trying to make myself want it. You can't will yourself into desiring a certain kind of lifestyle if you at the same time wholeheartedly *don't* want it. \nThe wakeup call for me was the realisation that I didn't want to sink any more time or money into the things I did. \n*No one will be there at the end of a long day to pat you on the back for putting up with it.* You will never get a thank you for sacrificing your own wants and needs. The people who depend on you will just have to make do on their own (except your children, of course). They will have to carve out their own path, without your support. \nWe're only given one life each. Don't squander it trying to live up to someone else's thoughts of who you should be. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t been in the same situation as you, but I&amp;#39;ve been in a similar one. I made a decision to get involved in something that I didn&amp;#39;t wholly want, and it wound up eating me alive. Each day there was a stress, a tremendous pressure to perform and to do what I said I&amp;#39;d do. But here&amp;#39;s the thing: people &lt;em&gt;change their mind&lt;/em&gt;. I talked myself into wanting a thing that I didn&amp;#39;t really want. I didn&amp;#39;t want it, yet I did the same menial things every day, trying to make myself want it. You can&amp;#39;t will yourself into desiring a certain kind of lifestyle if you at the same time wholeheartedly &lt;em&gt;don&amp;#39;t&lt;/em&gt; want it. \nThe wakeup call for me was the realisation that I didn&amp;#39;t want to sink any more time or money into the things I did. \n&lt;em&gt;No one will be there at the end of a long day to pat you on the back for putting up with it.&lt;/em&gt; You will never get a thank you for sacrificing your own wants and needs. The people who depend on you will just have to make do on their own (except your children, of course). They will have to carve out their own path, without your support. \nWe&amp;#39;re only given one life each. Don&amp;#39;t squander it trying to live up to someone else&amp;#39;s thoughts of who you should be. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9nvlj", "score_hidden": false, "stickied": false, "created": 1492228824.0, "created_utc": 1492200024.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": "", "user_reports": [], "id": "dg9nw7i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cinnamon2017", "parent_id": "t3_65dyds", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You can do all that. It happens every day. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can do all that. It happens every day. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dg9nw7i", "score_hidden": false, "stickied": false, "created": 1492228845.0, "created_utc": 1492200045.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": "", "user_reports": [], "id": "dgaotke", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cinnamon2017", "parent_id": "t1_dga4g55", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You are a strong and decent person. I'm very sorry for your losses. Please look out for yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are a strong and decent person. I&amp;#39;m very sorry for your losses. Please look out for yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgaotke", "score_hidden": false, "stickied": false, "created": 1492294812.0, "created_utc": 1492266012.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65dyds", "likes": null, "replies": "", "user_reports": [], "id": "dgax6li", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lazy-lemur", "parent_id": "t1_dga4g55", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Oh that sounds just horrible! I hope you stay strong. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh that sounds just horrible! I hope you stay strong. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgax6li", "score_hidden": false, "stickied": false, "created": 1492306747.0, "created_utc": 1492277947.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga4g55", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "offthewalloffmychest", "parent_id": "t3_65dyds", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I feel you, too.\n\nI had started typing up something - but it became a novella (and still looks to be one anyway).\n\nMy father died in 2008, and my husband and I moved back to be closer to my mother (and lived with her, for a time).  I worked remotely to help her after she broke her arm in a fall late one summer and couldn't dress or bathe (daily), or get to her physical therapy appts (multiple times a week).  She healed, but later that winter, was feeling lethargic.  I went remote again to help with appointments, and then on leave when we were called by the MD and told to get to the ER for an emergency surgery. Mom made it through the surgery, but while in recovery, due to tons of risk factors, and the possibility of a particularly virulent cancer, she had a series of strokes, and subsequently died.  This was early 2014.\n\nMy MIL had a series of strokes the same week.  Found ourselves flying out days after my mom died to see my husband's mother, and make arrangements for her to go to a care facility after her discharge. PIL did not qualify nor could afford in home care. I paid for the facility's care, meanwhile.  \n\nBack home, and at work, I end up quitting after a month or two, as I can't manage the grief, closing my parents' estate, and my developmentally disabled brother's advocacy on a schedule that my work would not accommodate (or allow me to work remotely).\n\nPIL meanwhile, are shuffling MIL between care facilities and struggling to pay bills. We plan to move out their way, and facilitate getting them going with Medicare, Medicaid, et al.  Buy a \"house\" (it's a manufactured) for them, move MIL up. She transitions from a care facility into home care with (now) 24hr caregivers.\n\nMy PIL never planned for anything. Again, neglected their own health, refused to get insurance, had no savings, etc, etc.  Lots of irrational, crazy history before any of this came about, to boot.\n\nI've just moved my developmentally disabled, schizophrenic brother out here to the tune of tens of thousands of dollars OOP.  He doesn't even recognize what we've done, and berates both of us (mostly me) constantly about how we're just like our (my) parents, and never do anything for him, and don't support him.  He has no clue, and never will. His world revolves around him.\n\nPepper in my husband's emotional affair with my best (now former) friend off and on for a couple of years, his alcoholism, the death of a close cousin, and now his alcoholic father having terminal colorectal cancer...\n\nI now hate where I'm living (literally around the corner from my brother, and the PIL), and have withdrawn as much as possible, except for when advocacy and necessity deem otherwise.\n\nYeah.. I really sometimes want to cut and run.  \n\nThis is not what I wanted for my life.  There have been so many occasions, especially right before each of these events, where my gut has pushed me to rebel, and not follow through with whatever was upcoming, and I've never listened. \n\nSo.. yes. Sometimes I feel that way. I want to sever everything, and leave off by myself.\n\nTL;DR - the last 8 years of my life seem like they've been a shitshow. I definitely think about disappearing.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel you, too.&lt;/p&gt;\n\n&lt;p&gt;I had started typing up something - but it became a novella (and still looks to be one anyway).&lt;/p&gt;\n\n&lt;p&gt;My father died in 2008, and my husband and I moved back to be closer to my mother (and lived with her, for a time).  I worked remotely to help her after she broke her arm in a fall late one summer and couldn&amp;#39;t dress or bathe (daily), or get to her physical therapy appts (multiple times a week).  She healed, but later that winter, was feeling lethargic.  I went remote again to help with appointments, and then on leave when we were called by the MD and told to get to the ER for an emergency surgery. Mom made it through the surgery, but while in recovery, due to tons of risk factors, and the possibility of a particularly virulent cancer, she had a series of strokes, and subsequently died.  This was early 2014.&lt;/p&gt;\n\n&lt;p&gt;My MIL had a series of strokes the same week.  Found ourselves flying out days after my mom died to see my husband&amp;#39;s mother, and make arrangements for her to go to a care facility after her discharge. PIL did not qualify nor could afford in home care. I paid for the facility&amp;#39;s care, meanwhile.  &lt;/p&gt;\n\n&lt;p&gt;Back home, and at work, I end up quitting after a month or two, as I can&amp;#39;t manage the grief, closing my parents&amp;#39; estate, and my developmentally disabled brother&amp;#39;s advocacy on a schedule that my work would not accommodate (or allow me to work remotely).&lt;/p&gt;\n\n&lt;p&gt;PIL meanwhile, are shuffling MIL between care facilities and struggling to pay bills. We plan to move out their way, and facilitate getting them going with Medicare, Medicaid, et al.  Buy a &amp;quot;house&amp;quot; (it&amp;#39;s a manufactured) for them, move MIL up. She transitions from a care facility into home care with (now) 24hr caregivers.&lt;/p&gt;\n\n&lt;p&gt;My PIL never planned for anything. Again, neglected their own health, refused to get insurance, had no savings, etc, etc.  Lots of irrational, crazy history before any of this came about, to boot.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve just moved my developmentally disabled, schizophrenic brother out here to the tune of tens of thousands of dollars OOP.  He doesn&amp;#39;t even recognize what we&amp;#39;ve done, and berates both of us (mostly me) constantly about how we&amp;#39;re just like our (my) parents, and never do anything for him, and don&amp;#39;t support him.  He has no clue, and never will. His world revolves around him.&lt;/p&gt;\n\n&lt;p&gt;Pepper in my husband&amp;#39;s emotional affair with my best (now former) friend off and on for a couple of years, his alcoholism, the death of a close cousin, and now his alcoholic father having terminal colorectal cancer...&lt;/p&gt;\n\n&lt;p&gt;I now hate where I&amp;#39;m living (literally around the corner from my brother, and the PIL), and have withdrawn as much as possible, except for when advocacy and necessity deem otherwise.&lt;/p&gt;\n\n&lt;p&gt;Yeah.. I really sometimes want to cut and run.  &lt;/p&gt;\n\n&lt;p&gt;This is not what I wanted for my life.  There have been so many occasions, especially right before each of these events, where my gut has pushed me to rebel, and not follow through with whatever was upcoming, and I&amp;#39;ve never listened. &lt;/p&gt;\n\n&lt;p&gt;So.. yes. Sometimes I feel that way. I want to sever everything, and leave off by myself.&lt;/p&gt;\n\n&lt;p&gt;TL;DR - the last 8 years of my life seem like they&amp;#39;ve been a shitshow. I definitely think about disappearing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dga4g55", "score_hidden": false, "stickied": false, "created": 1492250510.0, "created_utc": 1492221710.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]