[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work at a doggy daycare and one of our kennel dogs has seemingly become abandoned. Spike&amp;#39;s dad, let&amp;#39;s call him Henry, is a veteran, he originally booked a boarding stay for Spike 6 months ago for 3 days, his reason for booking was because he was moving. Usually we don&amp;#39;t do this because we&amp;#39;ve previously had clients extend the stay when they didn&amp;#39;t actually have a new place lined up and the whole thing is just a headache. When Henry booked my manager had just had emergency surgery and things were super hectic, so the reason for booking fell through the cracks. You can probably tell where this is going, Henry didn&amp;#39;t have a new place lined up. On the day of Spike&amp;#39;s scheduled pick up Henry didn&amp;#39;t show. When we called he explained that he&amp;#39;s on a fixed income, the V.A. was trying to help him find affordable housing, but they hadn&amp;#39;t been able to find a place where he could keep Spike. He was sleeping on a friend&amp;#39;s couch until he was able to find a permanent place, he said he&amp;#39;d make regular payments and the owner agreed because he felt sorry for the guy. He made monthly payments, and everytime I talked to him I could tell he really loved Spike. He got him as a puppy (Spike&amp;#39;s 9.5) and he was his best buddy since the beginning. I genuinely do think Henry wanted to avoid this situation, he is an old veteran who has fallen on hard times. He doesn&amp;#39;t deserve to be crucified for that. I can&amp;#39;t fault him for his circumstances, even if the result of those circumstances led to him abandoning Spike.&lt;/p&gt;\n\n&lt;p&gt;It has been almost 2 months now since Henry made a payment. He stopped answering our calls, and at this point Spike has been with us for so long that we&amp;#39;ve all fallen in love with him. My boss isn&amp;#39;t going to bring him to a shelter, for now he&amp;#39;s just gonna stay with us, like he has been for the past 6 months. Honestly, he is living the life and we spoil him rotten. Spike does daycare everyday (M-F) and on the weekends he gets to hang out on a dog bed in the office with us. He gets a bath every 5 weeks, we give him cuddles whenever we have the chance, we buy him treats because he&amp;#39;s such a good boy, he gets extra super fluffy comforters in his kennel, and I&amp;#39;ve even taken him home with me every now and then. He&amp;#39;s the sweetest dog I have ever met, and I have met a LOT of dogs. &lt;/p&gt;\n\n&lt;p&gt;Spike&amp;#39;s special, he takes everything in stride, nothing phases him, he keeps an eye on the puppies, and even at 9 years old he can keep up with the younger dogs, and when I took him home with me he was perfect with my cats. Everyone loves him, dogs and people alike. He doesn&amp;#39;t ask for much of anything, just a few comfy blankets to sleep on and someone to scratch his belly every once and a while or to toss a ball his way.  It is sad that he was abandoned, and it&amp;#39;s even sadder that no one at my work, including myself, have the means to adopt him ourselves, but he&amp;#39;s happy with us. Hopefully we&amp;#39;ll find him a home and my boss likes him so much he said whoever adopts Spike will get free daycare just so we can still see him. I&amp;#39;m going to miss him so much whenever it is we part ways, but if any dog deserves to sleep in a bed and snuggle on a couch again, it&amp;#39;s our old man Spike.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I work at a doggy daycare and one of our kennel dogs has seemingly become abandoned. Spike's dad, let's call him Henry, is a veteran, he originally booked a boarding stay for Spike 6 months ago for 3 days, his reason for booking was because he was moving. Usually we don't do this because we've previously had clients extend the stay when they didn't actually have a new place lined up and the whole thing is just a headache. When Henry booked my manager had just had emergency surgery and things were super hectic, so the reason for booking fell through the cracks. You can probably tell where this is going, Henry didn't have a new place lined up. On the day of Spike's scheduled pick up Henry didn't show. When we called he explained that he's on a fixed income, the V.A. was trying to help him find affordable housing, but they hadn't been able to find a place where he could keep Spike. He was sleeping on a friend's couch until he was able to find a permanent place, he said he'd make regular payments and the owner agreed because he felt sorry for the guy. He made monthly payments, and everytime I talked to him I could tell he really loved Spike. He got him as a puppy (Spike's 9.5) and he was his best buddy since the beginning. I genuinely do think Henry wanted to avoid this situation, he is an old veteran who has fallen on hard times. He doesn't deserve to be crucified for that. I can't fault him for his circumstances, even if the result of those circumstances led to him abandoning Spike.\n\nIt has been almost 2 months now since Henry made a payment. He stopped answering our calls, and at this point Spike has been with us for so long that we've all fallen in love with him. My boss isn't going to bring him to a shelter, for now he's just gonna stay with us, like he has been for the past 6 months. Honestly, he is living the life and we spoil him rotten. Spike does daycare everyday (M-F) and on the weekends he gets to hang out on a dog bed in the office with us. He gets a bath every 5 weeks, we give him cuddles whenever we have the chance, we buy him treats because he's such a good boy, he gets extra super fluffy comforters in his kennel, and I've even taken him home with me every now and then. He's the sweetest dog I have ever met, and I have met a LOT of dogs. \n\nSpike's special, he takes everything in stride, nothing phases him, he keeps an eye on the puppies, and even at 9 years old he can keep up with the younger dogs, and when I took him home with me he was perfect with my cats. Everyone loves him, dogs and people alike. He doesn't ask for much of anything, just a few comfy blankets to sleep on and someone to scratch his belly every once and a while or to toss a ball his way.  It is sad that he was abandoned, and it's even sadder that no one at my work, including myself, have the means to adopt him ourselves, but he's happy with us. Hopefully we'll find him a home and my boss likes him so much he said whoever adopts Spike will get free daycare just so we can still see him. I'm going to miss him so much whenever it is we part ways, but if any dog deserves to sleep in a bed and snuggle on a couch again, it's our old man Spike.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65g1mp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "Throwawaydogdaycare", "saved": false, "mod_reports": [], "name": "t3_65g1mp", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65g1mp/a_dog_was_abandoned_at_my_work/", "num_reports": null, "locked": false, "stickied": false, "created": 1492242004.0, "url": "https://www.reddit.com/r/offmychest/comments/65g1mp/a_dog_was_abandoned_at_my_work/", "author_flair_text": null, "quarantine": false, "title": "A dog was abandoned at my work", "created_utc": 1492213204.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65g1mp", "likes": null, "replies": "", "user_reports": [], "id": "dga1t7s", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "jello_kitty", "parent_id": "t3_65g1mp", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's beautiful. I'm glad you all care so much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s beautiful. I&amp;#39;m glad you all care so much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dga1t7s", "score_hidden": false, "stickied": false, "created": 1492246864.0, "created_utc": 1492218064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65g1mp", "likes": null, "replies": "", "user_reports": [], "id": "dgaaazb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PaganMa", "parent_id": "t3_65g1mp", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Such a sweet doggo, I hope he finds a good home with lots of little humans to play with a loving mom and dad to take good care of him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Such a sweet doggo, I hope he finds a good home with lots of little humans to play with a loving mom and dad to take good care of him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgaaazb", "score_hidden": false, "stickied": false, "created": 1492259595.0, "created_utc": 1492230795.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]