[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m a music major in college, and was sitting in my composition class listening to the Symphony of Sorrowful Songs by Gorecki. Now we listen to a lot of new age music and most of its garbage, but this piece was extremely powerful; it really was about life and death. My professor brought that up and said some things about how to live your life and how to think about death, and it compelled me to talk to him about something.&lt;/p&gt;\n\n&lt;p&gt;Last september, my mother passed away unexpectedly. At least, she did to me; apparently the rest of my family saw this coming, but thats another issue. It happened my first month into college, and as you could guess I was devastated. I haven&amp;#39;t been coping with it very well, and thought maybe my professor had some answers for me.&lt;/p&gt;\n\n&lt;p&gt;I caught him in the hallway, thankfully. He was going to a meeting but we ended up standing in the hallway for at least twenty minutes, talking about death in all its forms. He told me about the two brothers he&amp;#39;d lost, his father&amp;#39;s last words (Well, I&amp;#39;ve felt better), and how it affected him. Now this man is as close to the walking definition of stoic as I have ever seen, extremely well read and intelligent, but I could tell even he was getting emotional. He told me he remembered the June day he buried his brother, and I told him I still remember shoveling dirt onto my mother&amp;#39;s casket. I started tearing up at this point and knew I was gonna break down soon. I wrote down some points of the discussion, as follows:&lt;/p&gt;\n\n&lt;p&gt;-life is limited\n- &amp;quot;You live better when you know you&amp;#39;re gonna die&amp;quot;\n- friends, family, faith ( the three things my professor builds his life around)\n- Are my actions making the world better? (question that leads to a better life)\n- I matter. What I do matters.&lt;/p&gt;\n\n&lt;p&gt;After our conversation, I thanked him, shook his hand, and went into a practice room to bawl my eyes out. I didn&amp;#39;t get all of the answers I was looking for, but what I did get was something like a puzzle piece that i&amp;#39;ve got 3/1000 pieces; it may be a fruitless pursuit, but getting one step closer to clearing my conscience is good enough for me.&lt;/p&gt;\n\n&lt;p&gt;Thank you, Dr. Moore. For everything.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I'm a music major in college, and was sitting in my composition class listening to the Symphony of Sorrowful Songs by Gorecki. Now we listen to a lot of new age music and most of its garbage, but this piece was extremely powerful; it really was about life and death. My professor brought that up and said some things about how to live your life and how to think about death, and it compelled me to talk to him about something.\n\nLast september, my mother passed away unexpectedly. At least, she did to me; apparently the rest of my family saw this coming, but thats another issue. It happened my first month into college, and as you could guess I was devastated. I haven't been coping with it very well, and thought maybe my professor had some answers for me.\n\nI caught him in the hallway, thankfully. He was going to a meeting but we ended up standing in the hallway for at least twenty minutes, talking about death in all its forms. He told me about the two brothers he'd lost, his father's last words (Well, I've felt better), and how it affected him. Now this man is as close to the walking definition of stoic as I have ever seen, extremely well read and intelligent, but I could tell even he was getting emotional. He told me he remembered the June day he buried his brother, and I told him I still remember shoveling dirt onto my mother's casket. I started tearing up at this point and knew I was gonna break down soon. I wrote down some points of the discussion, as follows:\n\n-life is limited\n- \"You live better when you know you're gonna die\"\n- friends, family, faith ( the three things my professor builds his life around)\n- Are my actions making the world better? (question that leads to a better life)\n- I matter. What I do matters.\n\nAfter our conversation, I thanked him, shook his hand, and went into a practice room to bawl my eyes out. I didn't get all of the answers I was looking for, but what I did get was something like a puzzle piece that i've got 3/1000 pieces; it may be a fruitless pursuit, but getting one step closer to clearing my conscience is good enough for me.\n\nThank you, Dr. Moore. For everything.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65g860", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 29, "report_reasons": null, "author": "benmoorepaintco", "saved": false, "mod_reports": [], "name": "t3_65g860", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65g860/started_tearing_up_in_front_of_my_professor/", "num_reports": null, "locked": false, "stickied": false, "created": 1492244256.0, "url": "https://www.reddit.com/r/offmychest/comments/65g860/started_tearing_up_in_front_of_my_professor/", "author_flair_text": null, "quarantine": false, "title": "Started tearing up in front of my professor....", "created_utc": 1492215456.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65g860", "likes": null, "replies": "", "user_reports": [], "id": "dga07qw", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "adg2928", "parent_id": "t3_65g860", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sending you positive thoughts to your side of the screen and hope you find the support that will assist you in your journey. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sending you positive thoughts to your side of the screen and hope you find the support that will assist you in your journey. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dga07qw", "score_hidden": false, "stickied": false, "created": 1492244731.0, "created_utc": 1492215931.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65g860", "likes": null, "replies": "", "user_reports": [], "id": "dga0upv", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "phaeton21", "parent_id": "t3_65g860", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Death is tragic, and being emotional about it and tearing up is nothing at all to be ashamed of.   \n   \nYou may not have considered this yet, but it is likely that by listening to Dr. Moore, you've helped him too.\n   \n   \nAlso, music is the most powerful force in the Universe.  If done right, it is pure emotion expressed.  Connecting to it like that is an amazing event.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Death is tragic, and being emotional about it and tearing up is nothing at all to be ashamed of.   &lt;/p&gt;\n\n&lt;p&gt;You may not have considered this yet, but it is likely that by listening to Dr. Moore, you&amp;#39;ve helped him too.&lt;/p&gt;\n\n&lt;p&gt;Also, music is the most powerful force in the Universe.  If done right, it is pure emotion expressed.  Connecting to it like that is an amazing event.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dga0upv", "score_hidden": false, "stickied": false, "created": 1492245584.0, "created_utc": 1492216784.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]