[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All of my life, I&amp;#39;ve been living under the same roof as my abusive father and poor mother. Poor in the aspect that she never deserved to be forced into this fucked as hell arranged marriage with my dad, only to have him to abuse her verbally, physically and emotionally all throughout their years of marriage.&lt;/p&gt;\n\n&lt;p&gt;The only reason they&amp;#39;re still together despite her many previous thoughts and attempts to/about divorcing him was because of her children, me and said sibling. She didn&amp;#39;t want us to grow up in a &amp;quot;broken family&amp;quot; without my dad despite me constantly telling her we didn&amp;#39;t need him in our lives. And although it&amp;#39;s been getting better, aka he hasn&amp;#39;t beaten her up or scarred her anytime recently, he still flares up time to time, roaring at everyone in the vicinity and threatening to beat us the fuck up. Because yknow, that&amp;#39;s his only means of interaction with us it seems.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve tried cutting ties with him in the past and one of the time, even reported his abuse to the police where he was forced to move out for a brief period to live with my aunt (his sister/side of the family, also a questionable bunch at best) and my mum ended up feeling sorry for him. Mainly because he&amp;#39;s a mess, and completely lost without her. She and I (mainly her) do every fucking thing in the house. From paperwork to bills, cooking and cleaning etc. All he does is sit on the couch and watch tv. And he doesn&amp;#39;t fucking appreciate it at all. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve tried so hard to explain things to him and  endure his shit but I&amp;#39;m at such a loss right now. I really needed to get this off my chest; that if we don&amp;#39;t do something soon, and because my mum feels too sorry for him to force a divorce with a team of lawyers, it seems like the only way we&amp;#39;ll live a peaceful life again is if he suddenly disappears. And death seems to be the only way he&amp;#39;ll be remembered somewhat respectfully, if at all.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t even say I love my dad anymore. All we do is fight. All I remember is getting yelled at by my grandpa (mum&amp;#39;s dad) for hiding in fear with sibling when my dad had dragged her by her hair around the house and into the kitchen to beat her black and blue at the age of ~seven.&lt;/p&gt;\n\n&lt;p&gt;Sorry, I really just need to rant for a bit there. Even if it was on reddit and noone sees this. &lt;/p&gt;\n\n&lt;p&gt;Hope everyone is having a better day than I am. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "All of my life, I've been living under the same roof as my abusive father and poor mother. Poor in the aspect that she never deserved to be forced into this fucked as hell arranged marriage with my dad, only to have him to abuse her verbally, physically and emotionally all throughout their years of marriage.\n\nThe only reason they're still together despite her many previous thoughts and attempts to/about divorcing him was because of her children, me and said sibling. She didn't want us to grow up in a \"broken family\" without my dad despite me constantly telling her we didn't need him in our lives. And although it's been getting better, aka he hasn't beaten her up or scarred her anytime recently, he still flares up time to time, roaring at everyone in the vicinity and threatening to beat us the fuck up. Because yknow, that's his only means of interaction with us it seems.\n\nWe've tried cutting ties with him in the past and one of the time, even reported his abuse to the police where he was forced to move out for a brief period to live with my aunt (his sister/side of the family, also a questionable bunch at best) and my mum ended up feeling sorry for him. Mainly because he's a mess, and completely lost without her. She and I (mainly her) do every fucking thing in the house. From paperwork to bills, cooking and cleaning etc. All he does is sit on the couch and watch tv. And he doesn't fucking appreciate it at all. \n\nWe've tried so hard to explain things to him and  endure his shit but I'm at such a loss right now. I really needed to get this off my chest; that if we don't do something soon, and because my mum feels too sorry for him to force a divorce with a team of lawyers, it seems like the only way we'll live a peaceful life again is if he suddenly disappears. And death seems to be the only way he'll be remembered somewhat respectfully, if at all.\n\nI can't even say I love my dad anymore. All we do is fight. All I remember is getting yelled at by my grandpa (mum's dad) for hiding in fear with sibling when my dad had dragged her by her hair around the house and into the kitchen to beat her black and blue at the age of ~seven.\n\nSorry, I really just need to rant for a bit there. Even if it was on reddit and noone sees this. \n\nHope everyone is having a better day than I am. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65j3qw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "stupidrhapsody", "saved": false, "mod_reports": [], "name": "t3_65j3qw", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65j3qw/honest_to_god_hope_my_dad_passes_away_soon/", "num_reports": null, "locked": false, "stickied": false, "created": 1492292225.0, "url": "https://www.reddit.com/r/offmychest/comments/65j3qw/honest_to_god_hope_my_dad_passes_away_soon/", "author_flair_text": null, "quarantine": false, "title": "Honest to god hope my dad passes away soon", "created_utc": 1492263425.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": "", "user_reports": [], "id": "dgb8w55", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "-shadowstorm-", "parent_id": "t1_dgb7dzn", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Haha you too, I hope all turns out well ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha you too, I hope all turns out well &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgb8w55", "score_hidden": false, "stickied": false, "created": 1492322718.0, "created_utc": 1492293918.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb7dzn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stupidrhapsody", "parent_id": "t1_dgap4lb", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Yeah, nah all good. It's understandable. He was and still is a real jerk at times. But im going to try take on a new attitude and hope for a better ending between us somehow. Go give your dad a hug for/from me in appreciation of you never having to go through that. Legit, at this point of my life, I'm just glad you, some rando internet stranger lol, isn't able to imagine that. Have a good day dude/dudette.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, nah all good. It&amp;#39;s understandable. He was and still is a real jerk at times. But im going to try take on a new attitude and hope for a better ending between us somehow. Go give your dad a hug for/from me in appreciation of you never having to go through that. Legit, at this point of my life, I&amp;#39;m just glad you, some rando internet stranger lol, isn&amp;#39;t able to imagine that. Have a good day dude/dudette.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgb7dzn", "score_hidden": false, "stickied": false, "created": 1492320644.0, "created_utc": 1492291844.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgap4lb", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "-shadowstorm-", "parent_id": "t3_65j3qw", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I see that there are no comments here and I just want you to know that I read your post, and... I mean, I honestly don't blame you for thinking about him this way. I seriously can't imagine having to come home to a dad like that. That's terrible.\n(Sorry if that somehow offends you, but really...)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see that there are no comments here and I just want you to know that I read your post, and... I mean, I honestly don&amp;#39;t blame you for thinking about him this way. I seriously can&amp;#39;t imagine having to come home to a dad like that. That&amp;#39;s terrible.\n(Sorry if that somehow offends you, but really...)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgap4lb", "score_hidden": false, "stickied": false, "created": 1492295319.0, "created_utc": 1492266519.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": "", "user_reports": [], "id": "dgbas3u", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "scurius", "parent_id": "t1_dgb74m9", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I don't know what to say back that'll stay meaningful, but feel free to reach out any time. And yeah, second that on the hope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what to say back that&amp;#39;ll stay meaningful, but feel free to reach out any time. And yeah, second that on the hope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbas3u", "score_hidden": false, "stickied": false, "created": 1492325446.0, "created_utc": 1492296646.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb74m9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "stupidrhapsody", "parent_id": "t1_dgaqwdt", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thanks scurius. I'm so sorry to hear about your dad, my condolences to you and your family about the suffering and hardship you all must be going through right now. I can't even imagine what you're all going through but I wish you guys the best. \nAnd that gandalf quote though, I guess I really needed to hear something like that. Woke up in the morning to see the comment notif on my phone and proceeded to bawl my eyes out at that lol. I mean.. I know it's harsh to wish that on my own blood and flesh father but everytime I've tried to start anew and be good with him, he legitimately always fucks it up somehow or another. But it does help to see things in that perspective (wow, thanks LOTR lol). I really appreciate you taking the time to reply, you don't know how much its changed my way of thinking and helped. \n\nHere's to hoping either our dads will pass on peacefully, if they by fate do, or just continue to get better and live the rest of their lives with us in happiness. Thanks scurius, really. ", "edited": 1492297089.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks scurius. I&amp;#39;m so sorry to hear about your dad, my condolences to you and your family about the suffering and hardship you all must be going through right now. I can&amp;#39;t even imagine what you&amp;#39;re all going through but I wish you guys the best. \nAnd that gandalf quote though, I guess I really needed to hear something like that. Woke up in the morning to see the comment notif on my phone and proceeded to bawl my eyes out at that lol. I mean.. I know it&amp;#39;s harsh to wish that on my own blood and flesh father but everytime I&amp;#39;ve tried to start anew and be good with him, he legitimately always fucks it up somehow or another. But it does help to see things in that perspective (wow, thanks LOTR lol). I really appreciate you taking the time to reply, you don&amp;#39;t know how much its changed my way of thinking and helped. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s to hoping either our dads will pass on peacefully, if they by fate do, or just continue to get better and live the rest of their lives with us in happiness. Thanks scurius, really. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgb74m9", "score_hidden": false, "stickied": false, "created": 1492320284.0, "created_utc": 1492291484.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqwdt", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "scurius", "parent_id": "t3_65j3qw", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "As someone who's found himself making the same wish lately (for a very different reason), I think you have a much better reason for it. In a way both of us are wishing a kind of euthanasia it seems (in that your father's life sounds miserable in any scenario he's not dragging everyone else down), but I really think your father likes life much less than mine does. For some context, my dad has cancer that was expected to have killed him over a year ago. It's been a bumpy ride and has sometimes sucked pretty badly. Lately has been one of those times. His liver has been failing more and it's started to affect his brain and make him into an asshole. I hate that my father is dying and all I can do is fight with him. Most of the time it's to get him to take lifesaving medication too =(. And then on top of that my life is on hold and I'm afraid to start a career because I don't trust him to take care of himself without me, and I find myself resenting that.\n\nKnowing my father is almost definitely going to die to this and that his quality of life is probably going to keep going downhill, I still think your father is unhappier and might find more peace in death than my own. I wish something could happen to make your dad happy and not an asshole, but perhaps neither of us might be so lucky. I think it's interesting and heartwarming in a way that your wish for his death doesn't seem motivated by malice or spite so much as a weird kind of mercy. Knowing that for you and your mother to be free from his destruction it would hurt him, and to wish him a dignified peace instead of some kind of vengeance. It's not \"you've hurt me now let me hurt you,\" but, \"this is the only way none of us will be hurting.\"\n\nSo now I find myself channeling Gandalf: \"Many that live deserve death. Some that die deserve life. Can you give it to them, Frodo? Do not be too eager to deal out death in judgment. Even the very wise cannot see all ends.\" I deeply hope that both our fathers can find peace without an early death and that you and your mother can find a safe happiness beyond the event horizon of the black hole that seems to be his heart. While we've both wished it, I hope we both find resolutions to the motivations for the wish that don't involve death.\n\nDon't beat yourself up for feeling this way. I did and I think my reasons for wishing it were more selfish.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who&amp;#39;s found himself making the same wish lately (for a very different reason), I think you have a much better reason for it. In a way both of us are wishing a kind of euthanasia it seems (in that your father&amp;#39;s life sounds miserable in any scenario he&amp;#39;s not dragging everyone else down), but I really think your father likes life much less than mine does. For some context, my dad has cancer that was expected to have killed him over a year ago. It&amp;#39;s been a bumpy ride and has sometimes sucked pretty badly. Lately has been one of those times. His liver has been failing more and it&amp;#39;s started to affect his brain and make him into an asshole. I hate that my father is dying and all I can do is fight with him. Most of the time it&amp;#39;s to get him to take lifesaving medication too =(. And then on top of that my life is on hold and I&amp;#39;m afraid to start a career because I don&amp;#39;t trust him to take care of himself without me, and I find myself resenting that.&lt;/p&gt;\n\n&lt;p&gt;Knowing my father is almost definitely going to die to this and that his quality of life is probably going to keep going downhill, I still think your father is unhappier and might find more peace in death than my own. I wish something could happen to make your dad happy and not an asshole, but perhaps neither of us might be so lucky. I think it&amp;#39;s interesting and heartwarming in a way that your wish for his death doesn&amp;#39;t seem motivated by malice or spite so much as a weird kind of mercy. Knowing that for you and your mother to be free from his destruction it would hurt him, and to wish him a dignified peace instead of some kind of vengeance. It&amp;#39;s not &amp;quot;you&amp;#39;ve hurt me now let me hurt you,&amp;quot; but, &amp;quot;this is the only way none of us will be hurting.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So now I find myself channeling Gandalf: &amp;quot;Many that live deserve death. Some that die deserve life. Can you give it to them, Frodo? Do not be too eager to deal out death in judgment. Even the very wise cannot see all ends.&amp;quot; I deeply hope that both our fathers can find peace without an early death and that you and your mother can find a safe happiness beyond the event horizon of the black hole that seems to be his heart. While we&amp;#39;ve both wished it, I hope we both find resolutions to the motivations for the wish that don&amp;#39;t involve death.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t beat yourself up for feeling this way. I did and I think my reasons for wishing it were more selfish.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgaqwdt", "score_hidden": false, "stickied": false, "created": 1492298000.0, "created_utc": 1492269200.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": "", "user_reports": [], "id": "dgb7o82", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stupidrhapsody", "parent_id": "t1_dgav3ij", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Ye I've definitely done all of those but it still didn't help how/where my mind was for a long time about my dad. But defs trying again now; working on it, thanks dwkk. \n\nLol af though, my dad towers me with his build considering how I'm more oestrogen then testosterone. I can only imagine what would've happened if I tried taking him on. \n\nEdit: a word", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ye I&amp;#39;ve definitely done all of those but it still didn&amp;#39;t help how/where my mind was for a long time about my dad. But defs trying again now; working on it, thanks dwkk. &lt;/p&gt;\n\n&lt;p&gt;Lol af though, my dad towers me with his build considering how I&amp;#39;m more oestrogen then testosterone. I can only imagine what would&amp;#39;ve happened if I tried taking him on. &lt;/p&gt;\n\n&lt;p&gt;Edit: a word&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgb7o82", "score_hidden": false, "stickied": false, "created": 1492321022.0, "created_utc": 1492292222.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgav3ij", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65j3qw", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgav3ij", "score_hidden": false, "stickied": false, "created": 1492303911.0, "created_utc": 1492275111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": "", "user_reports": [], "id": "dgb7qnf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stupidrhapsody", "parent_id": "t1_dgaxqpr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thanks sherchb, I'll have a look. And thanks again, hope you're having a better day some wherever you are today", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks sherchb, I&amp;#39;ll have a look. And thanks again, hope you&amp;#39;re having a better day some wherever you are today&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgb7qnf", "score_hidden": false, "stickied": false, "created": 1492321112.0, "created_utc": 1492292312.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxqpr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sherchb", "parent_id": "t3_65j3qw", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Please look up the book Toxic Parents, I found it very helpful.  Sorry you are going through this xx", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please look up the book Toxic Parents, I found it very helpful.  Sorry you are going through this xx&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgaxqpr", "score_hidden": false, "stickied": false, "created": 1492307505.0, "created_utc": 1492278705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3qw", "likes": null, "replies": "", "user_reports": [], "id": "dgaqlc7", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "potassiumcompound", "parent_id": "t3_65j3qw", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Ricin\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ricin&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgaqlc7", "score_hidden": false, "stickied": false, "created": 1492297563.0, "created_utc": 1492268763.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]