[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;All my life I was TheBestAtDrawing.&lt;/strong&gt; You know, the kind of person who distracts the teacher &lt;em&gt;and&lt;/em&gt; the students during class because their drawing of a dragon is just too awesome. &amp;quot;Go to art school,&amp;quot; they said. &amp;quot;It&amp;#39;s your path in life!&amp;quot;&lt;br/&gt;\n...And so, after having tried a bunch of things and two failed attempts at education, I went. Hope was fresh - after all, this was something I could succeed at! I had the talent! It would be easy breezy!  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;And right I was.&lt;/strong&gt; It was so easy, in fact, I wondered why I went there at all. We had weekly assignments, which were graded No or Yes, and getting a Yes was as easy as delivering. We were supposed to learn techniques, but they were extremely basic and it seemed to me that anyone who had an interest in art would have figured those things out themselves. Like, for instance, how to shade a human body, we had countless classes on shading. Yet, when it was time to deliver the assignment, I went on YouTube for more advanced instructions, because I already knew what had been taught in class - and I was by no means the only one.    &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Most of the classes were like this.&lt;/strong&gt; Way too easy or unreasonably complicated by teachers who didn&amp;#39;t really know their shit (like, getting taught 3D animation by someone who clearly hadn&amp;#39;t been doing it too long themselves). Whenever this happened, I used YouTube to be able to deliver at all, because the teachers were so bad at communicating their limited knowledge. And again, I wasn&amp;#39;t the only one struggling. In fact, we were sharing said YouTube-videos between us.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Complaining did not matter,&lt;/strong&gt; because the classes were so short (two weeks, tops, mostly one week) that there was no time to change anything.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Before I went to art school&lt;/strong&gt; (which lasted three years) I was told I&amp;#39;d make great connections which would fuel my artistic future into the stars, or something to that effect. I was told I&amp;#39;d learn so much, find my style, and so on. Now, five years after graduating, the only thing I can remember that was actually worth while was how to mix egg tempera paint. I&amp;#39;ve never used this paint, but it was a cool thing to learn and the teacher was nice.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Apart from one or two students during my years there,&lt;/strong&gt; none of them made any mark in the art community, and it&amp;#39;s not for lack of talent. It&amp;#39;s because they decided to spend their time in an expensive art school instead of working &lt;em&gt;and&lt;/em&gt; pursuing their artistic interests - and now they have to work full time to pay the debt. The few who did go on to do great things, did not become known for doing anything we learned at school. One is an aquarelle painter (and she was professionally good before the courses at school) and a one is a professional cosplayer. Those are the only two I can think of who aren&amp;#39;t failures as artists (if you judge by income).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I appreciate my acquaintances and love my friends from art school,&lt;/strong&gt; but in absolutely no capacity because of their &amp;quot;networking&amp;quot; value. We&amp;#39;re friends the same way everyone else is friends, we hardly even talk about art.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So, this is my advice to you:&lt;/strong&gt;&lt;br/&gt;\nIf you want to make it as an artist, do the following -&lt;br/&gt;\n1: Don&amp;#39;t go to art school. Get a part-time job and spend the rest of your time working on your art.&lt;br/&gt;\n2: Study via YouTube and the countless other free sources online. Often they are actually better than art school teachers.&lt;br/&gt;\n3: Go to galleries, both to study other artists, get into the game and perhaps get to know some people who &lt;em&gt;actually&lt;/em&gt; are valuable when networking.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Even if you live in a country where art school is free, you still waste your time there - that&amp;#39;s my opinion. If there are any other art school graduates out there, let me know what your experiences were like.&lt;/strong&gt;     &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT: I come from a small, European country.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**All my life I was TheBestAtDrawing.** You know, the kind of person who distracts the teacher *and* the students during class because their drawing of a dragon is just too awesome. \"Go to art school,\" they said. \"It's your path in life!\"   \n...And so, after having tried a bunch of things and two failed attempts at education, I went. Hope was fresh - after all, this was something I could succeed at! I had the talent! It would be easy breezy!  \n   \n**And right I was.** It was so easy, in fact, I wondered why I went there at all. We had weekly assignments, which were graded No or Yes, and getting a Yes was as easy as delivering. We were supposed to learn techniques, but they were extremely basic and it seemed to me that anyone who had an interest in art would have figured those things out themselves. Like, for instance, how to shade a human body, we had countless classes on shading. Yet, when it was time to deliver the assignment, I went on YouTube for more advanced instructions, because I already knew what had been taught in class - and I was by no means the only one.    \n \n**Most of the classes were like this.** Way too easy or unreasonably complicated by teachers who didn't really know their shit (like, getting taught 3D animation by someone who clearly hadn't been doing it too long themselves). Whenever this happened, I used YouTube to be able to deliver at all, because the teachers were so bad at communicating their limited knowledge. And again, I wasn't the only one struggling. In fact, we were sharing said YouTube-videos between us.   \n \n**Complaining did not matter,** because the classes were so short (two weeks, tops, mostly one week) that there was no time to change anything.   \n\n**Before I went to art school** (which lasted three years) I was told I'd make great connections which would fuel my artistic future into the stars, or something to that effect. I was told I'd learn so much, find my style, and so on. Now, five years after graduating, the only thing I can remember that was actually worth while was how to mix egg tempera paint. I've never used this paint, but it was a cool thing to learn and the teacher was nice.   \n  \n**Apart from one or two students during my years there,** none of them made any mark in the art community, and it's not for lack of talent. It's because they decided to spend their time in an expensive art school instead of working *and* pursuing their artistic interests - and now they have to work full time to pay the debt. The few who did go on to do great things, did not become known for doing anything we learned at school. One is an aquarelle painter (and she was professionally good before the courses at school) and a one is a professional cosplayer. Those are the only two I can think of who aren't failures as artists (if you judge by income).\n   \n**I appreciate my acquaintances and love my friends from art school,** but in absolutely no capacity because of their \"networking\" value. We're friends the same way everyone else is friends, we hardly even talk about art.   \n  \n**So, this is my advice to you:**  \nIf you want to make it as an artist, do the following -   \n1: Don't go to art school. Get a part-time job and spend the rest of your time working on your art.  \n2: Study via YouTube and the countless other free sources online. Often they are actually better than art school teachers.  \n3: Go to galleries, both to study other artists, get into the game and perhaps get to know some people who *actually* are valuable when networking.   \n  \n**Even if you live in a country where art school is free, you still waste your time there - that's my opinion. If there are any other art school graduates out there, let me know what your experiences were like.**     \n  \n- - -   \n**EDIT: I come from a small, European country.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65j3gr", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 43, "report_reasons": null, "author": "Aphranida", "saved": false, "mod_reports": [], "name": "t3_65j3gr", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": 1492289723.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65j3gr/i_regret_going_to_art_school_do_you_consider/", "num_reports": null, "locked": false, "stickied": false, "created": 1492292120.0, "url": "https://www.reddit.com/r/offmychest/comments/65j3gr/i_regret_going_to_art_school_do_you_consider/", "author_flair_text": null, "quarantine": false, "title": "I regret going to art school. Do you consider going? Read this first.", "created_utc": 1492263320.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 43}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgax6kr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "DFKENLK", "parent_id": "t1_dgawlko", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Yeah... a good fine arts program teaches you how to think about art, not just how to make art. A BFA is worth as much as you make out of it, you should really be developing your portfolio and impressing employers with what you *think* not what you make.\n\nBesides, it's all about interdisciplinary studies these days. A BFA falls short in practical applications, realistically speaking you're gonna want a basic knowledge in other fields such as CS (comp sci) and business if you want to make your art accessible to a broader audience.", "edited": 1492278197.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah... a good fine arts program teaches you how to think about art, not just how to make art. A BFA is worth as much as you make out of it, you should really be developing your portfolio and impressing employers with what you &lt;em&gt;think&lt;/em&gt; not what you make.&lt;/p&gt;\n\n&lt;p&gt;Besides, it&amp;#39;s all about interdisciplinary studies these days. A BFA falls short in practical applications, realistically speaking you&amp;#39;re gonna want a basic knowledge in other fields such as CS (comp sci) and business if you want to make your art accessible to a broader audience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgax6kr", "score_hidden": false, "stickied": false, "created": 1492306746.0, "created_utc": 1492277946.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgayp86", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "secondgeneration", "parent_id": "t1_dgawlko", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I second this. I don't know what country you're in, but the top art schools in the U.S. all have so many notable alumni and have pretty rigorous courses. Even the arts high school I went to had an incredibly challenging and competitive atmosphere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I second this. I don&amp;#39;t know what country you&amp;#39;re in, but the top art schools in the U.S. all have so many notable alumni and have pretty rigorous courses. Even the arts high school I went to had an incredibly challenging and competitive atmosphere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgayp86", "score_hidden": false, "stickied": false, "created": 1492308800.0, "created_utc": 1492280000.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgb6auk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "skunkynugget", "parent_id": "t1_dgawlko", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Seriously sounds like a shit program. Also it sounds like you went for a basic art education focusing on technique which from what you said sounds like you already possessed. \n\nI would recommend, first choosing what form of art work you would like to profit from, marketing, design, architecture etc. how could you most effectively apply you're craft? Keep in mind wage:satisfaction ratio. \n\nNow that you're focused, find a program that fits. You do t just go to \"art school.\"  You basically wasted you're own time by not preparing at all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously sounds like a shit program. Also it sounds like you went for a basic art education focusing on technique which from what you said sounds like you already possessed. &lt;/p&gt;\n\n&lt;p&gt;I would recommend, first choosing what form of art work you would like to profit from, marketing, design, architecture etc. how could you most effectively apply you&amp;#39;re craft? Keep in mind wage:satisfaction ratio. &lt;/p&gt;\n\n&lt;p&gt;Now that you&amp;#39;re focused, find a program that fits. You do t just go to &amp;quot;art school.&amp;quot;  You basically wasted you&amp;#39;re own time by not preparing at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgb6auk", "score_hidden": false, "stickied": false, "created": 1492319126.0, "created_utc": 1492290326.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgb5rrz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Aphranida", "parent_id": "t1_dgaxtgz", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I guess my country has piss poor art program, then :P  \nI was sick for half a semester, but apart from that I very much part-took in everything they had to offer, from after-school optional courses to social events at school. The whole shebang. There are a few not-for-profit, state run art schools, but those are so few I bet my whole country only has around 200 ...slots? (English isn't my native language) for students, and 45 of them are MFA. Granted, this isn't a large country, but if you want to study art you basically have to pay. This must all sound weird to you, but this is a small European country.   \n  \nSo, while the 200 \"free\" slots are for people who are ridiculously talented and basically just need to get even better, the for profit schools have interview rounds and require a few work deliveries before they let you in, but getting in is pretty easy. None of the for profit schools are hard to get into, since they basically just need to see you draw something that doesn't suck to let you in.  \n  \nOh man, I gotta stop writing. I'm drunk.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess my country has piss poor art program, then :P&lt;br/&gt;\nI was sick for half a semester, but apart from that I very much part-took in everything they had to offer, from after-school optional courses to social events at school. The whole shebang. There are a few not-for-profit, state run art schools, but those are so few I bet my whole country only has around 200 ...slots? (English isn&amp;#39;t my native language) for students, and 45 of them are MFA. Granted, this isn&amp;#39;t a large country, but if you want to study art you basically have to pay. This must all sound weird to you, but this is a small European country.   &lt;/p&gt;\n\n&lt;p&gt;So, while the 200 &amp;quot;free&amp;quot; slots are for people who are ridiculously talented and basically just need to get even better, the for profit schools have interview rounds and require a few work deliveries before they let you in, but getting in is pretty easy. None of the for profit schools are hard to get into, since they basically just need to see you draw something that doesn&amp;#39;t suck to let you in.  &lt;/p&gt;\n\n&lt;p&gt;Oh man, I gotta stop writing. I&amp;#39;m drunk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgb5rrz", "score_hidden": false, "stickied": false, "created": 1492318385.0, "created_utc": 1492289585.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxtgz", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "albrecht_fick", "parent_id": "t1_dgax7zv", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "These aren't official classifications, but in the US a 1st tier program would be a school like RISD or Yale's art program and 4th tier would be some no name for profit online art program. I'm a bit shocked to hear that you would experience the problems you had at one of your country's finest art schools, either your country has some piss poor art programs or you didn't take full advantage of what they were offering.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These aren&amp;#39;t official classifications, but in the US a 1st tier program would be a school like RISD or Yale&amp;#39;s art program and 4th tier would be some no name for profit online art program. I&amp;#39;m a bit shocked to hear that you would experience the problems you had at one of your country&amp;#39;s finest art schools, either your country has some piss poor art programs or you didn&amp;#39;t take full advantage of what they were offering.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgaxtgz", "score_hidden": false, "stickied": false, "created": 1492307611.0, "created_utc": 1492278811.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgax7zv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Aphranida", "parent_id": "t1_dgawlko", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I have no idea what that means, sounds like US school classifications.   \nI do know what a BFA is - because I have one - but this 4th tier stuff? No idea.  \n  \nWhat I do know is that my particular art school is not only expensive, but considered one of my country's finest. It has been praised in newspapers, as well as institutions offering MFA's, since they receive my school's students afterwards. All in all, people love my school. Everyone by those who went there. They're mostly just \"meh\", but the few who are bothered enough to actually form opinions, tend to agree with me.  \n  \nI don't know if that counted as an answer to anything you said, but there you go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have no idea what that means, sounds like US school classifications.&lt;br/&gt;\nI do know what a BFA is - because I have one - but this 4th tier stuff? No idea.  &lt;/p&gt;\n\n&lt;p&gt;What I do know is that my particular art school is not only expensive, but considered one of my country&amp;#39;s finest. It has been praised in newspapers, as well as institutions offering MFA&amp;#39;s, since they receive my school&amp;#39;s students afterwards. All in all, people love my school. Everyone by those who went there. They&amp;#39;re mostly just &amp;quot;meh&amp;quot;, but the few who are bothered enough to actually form opinions, tend to agree with me.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if that counted as an answer to anything you said, but there you go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgax7zv", "score_hidden": false, "stickied": false, "created": 1492306801.0, "created_utc": 1492278001.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawlko", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "albrecht_fick", "parent_id": "t3_65j3gr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sounds like you just went into a shit program. The merits of getting a BFA/MFA are certainly debatable with regards to cost vs. employment opportunity but your complaints just make it seem like you went to a 4th tier program.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you just went into a shit program. The merits of getting a BFA/MFA are certainly debatable with regards to cost vs. employment opportunity but your complaints just make it seem like you went to a 4th tier program.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgawlko", "score_hidden": false, "stickied": false, "created": 1492305951.0, "created_utc": 1492277151.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgarfsp", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "RainbowMarbles", "parent_id": "t3_65j3gr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "So I'm in the camp of people who actually learned a lot in art school and do not regret it at all. I think the main problem for people going into art school is that people just go \"I want to study all the arts!!!!\" And then are disappointed when it's just the basics of everything. My advice would be to choose a discipline you want to become proficient in, and pick a school based on that.\n\nI went to a school specialized in 3d art for video games, and I (and most of my friends) still feel like it wasn't quite specialized enough (I should have gone to a school for 3d animation in video games, while one of my friends should have gone to a school for concept art for video games, etc). Sometimes these schools are online, and many online schools are actually amazing.\n\nI know it can be daunting to choose something so specific when you haven't tried everything, but like you said, a generic art school usually doesn't cover anything in detail, just glosses over everything in a way that would be easy to do individually. It requires more research and effort to find the school that is the best fit for you, but they're out there. Schools for illustration, comics, photography, 3d art, sculpture, painting... they're all out there if you look hard enough :)\n\n(Just to be clear, I'm not trying to be confrontational or diminish your experience with art school! I just wanted to offer a different perspective on the matter.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m in the camp of people who actually learned a lot in art school and do not regret it at all. I think the main problem for people going into art school is that people just go &amp;quot;I want to study all the arts!!!!&amp;quot; And then are disappointed when it&amp;#39;s just the basics of everything. My advice would be to choose a discipline you want to become proficient in, and pick a school based on that.&lt;/p&gt;\n\n&lt;p&gt;I went to a school specialized in 3d art for video games, and I (and most of my friends) still feel like it wasn&amp;#39;t quite specialized enough (I should have gone to a school for 3d animation in video games, while one of my friends should have gone to a school for concept art for video games, etc). Sometimes these schools are online, and many online schools are actually amazing.&lt;/p&gt;\n\n&lt;p&gt;I know it can be daunting to choose something so specific when you haven&amp;#39;t tried everything, but like you said, a generic art school usually doesn&amp;#39;t cover anything in detail, just glosses over everything in a way that would be easy to do individually. It requires more research and effort to find the school that is the best fit for you, but they&amp;#39;re out there. Schools for illustration, comics, photography, 3d art, sculpture, painting... they&amp;#39;re all out there if you look hard enough :)&lt;/p&gt;\n\n&lt;p&gt;(Just to be clear, I&amp;#39;m not trying to be confrontational or diminish your experience with art school! I just wanted to offer a different perspective on the matter.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgarfsp", "score_hidden": false, "stickied": false, "created": 1492298771.0, "created_utc": 1492269971.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgavk4n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Aphranida", "parent_id": "t1_dgapry5", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Well, if your bucket list has an item named \"go to art school\", then do it, by all means, but if you actually want to improve as an artist, I suggest the methods listed, yeah!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, if your bucket list has an item named &amp;quot;go to art school&amp;quot;, then do it, by all means, but if you actually want to improve as an artist, I suggest the methods listed, yeah!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgavk4n", "score_hidden": false, "stickied": false, "created": 1492304540.0, "created_utc": 1492275740.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapry5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "arielflip", "parent_id": "t3_65j3gr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thanks. I'm an artist who's been working all my life and not found time for it. But I do now and I wondered about art school. I think with practice and the resources you mentioned can help. Wow, feeling inspired! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. I&amp;#39;m an artist who&amp;#39;s been working all my life and not found time for it. But I do now and I wondered about art school. I think with practice and the resources you mentioned can help. Wow, feeling inspired! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgapry5", "score_hidden": false, "stickied": false, "created": 1492296328.0, "created_utc": 1492267528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgaxx8y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wtrmlnjuc", "parent_id": "t3_65j3gr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Or rather, apply to one above your skill level. Something at or below your skill level will be a waste of time. There are different types of art programs. One of the most famous ones we have here in Canada is the Sheridan Animation program. It's hard to get into, but it's a very good program. Then there's something like Art Fundamentals, which, is for art fundamentals. If not pure art, maybe look into graphic design, industrial design, or even architecture.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or rather, apply to one above your skill level. Something at or below your skill level will be a waste of time. There are different types of art programs. One of the most famous ones we have here in Canada is the Sheridan Animation program. It&amp;#39;s hard to get into, but it&amp;#39;s a very good program. Then there&amp;#39;s something like Art Fundamentals, which, is for art fundamentals. If not pure art, maybe look into graphic design, industrial design, or even architecture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgaxx8y", "score_hidden": false, "stickied": false, "created": 1492307757.0, "created_utc": 1492278957.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgb58x1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cescelia", "parent_id": "t3_65j3gr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Yeah, it sounds like the program and teachers were lacking. Before I applied to my art fundamentals/animation program I did a ton of research on the teachers and the school, found alumni, etc. What I liked the best about the program at the time was that past students all said \"the teachers are brutal, but they push you\". \n\n(I've heard feedback from people who are currently in the program, and unfortunately it sounds like they have too many new teachers without industry experience, which sucks)\n\nI work in a different field now (graphic design, which would of been maybe a 2 week spotlight in art fundamentals) but there are soooo many things that have helped me. Never underestimate the basics. I highly doubt I would of been as successful without going into the program, mostly because it opened doors for me and I was able to then create a path for myself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, it sounds like the program and teachers were lacking. Before I applied to my art fundamentals/animation program I did a ton of research on the teachers and the school, found alumni, etc. What I liked the best about the program at the time was that past students all said &amp;quot;the teachers are brutal, but they push you&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;(I&amp;#39;ve heard feedback from people who are currently in the program, and unfortunately it sounds like they have too many new teachers without industry experience, which sucks)&lt;/p&gt;\n\n&lt;p&gt;I work in a different field now (graphic design, which would of been maybe a 2 week spotlight in art fundamentals) but there are soooo many things that have helped me. Never underestimate the basics. I highly doubt I would of been as successful without going into the program, mostly because it opened doors for me and I was able to then create a path for myself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgb58x1", "score_hidden": false, "stickied": false, "created": 1492317671.0, "created_utc": 1492288871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgbjewp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwdemawayplz", "parent_id": "t3_65j3gr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I went to a state school for a 3D art program and it was not nearly this bad. Holy shit.\n\nWe did have some dud professors and some amazing ones, though. But so did my STEM friends.\n\nSince I was at a state school, my tuition was a lot lower than it would have been at one of my preferred art schools. I also was able to take electives and general education courses in other subjects that have helped me out in a variety of ways during my current 3D-related job. My coworkers are a mix of those who went to cheap state schools, those who went to pricey art schools, and those who went to useless for-profit art/tech schools. We all ended up in the same place though.\n\nMy advice: \n\n(1) Try to spend as little money as possible. Most artist salaries are never enough to justify an insane amount of art school debt these days. \n\n(2) Pick a useful art. Web design may be more competitive than web dev, but you still have better prospects than a Painting or Illustration major. Photography majors have some dismal prospects but 3D artists/animators can make it work if they are flexible and open minded to other opportunities outside of Hollywood or AAA games. \n\n(3) Internships and/or co-ops are required to be employable after school.I don't care if your program doesn't actually \"require\" them, for all intents and purposes just pretend that they are a graduation requirement and try to snag as many as possible. If you start searching and you can't find any realistic internships for your major, then you may want to consider finding something more in demand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went to a state school for a 3D art program and it was not nearly this bad. Holy shit.&lt;/p&gt;\n\n&lt;p&gt;We did have some dud professors and some amazing ones, though. But so did my STEM friends.&lt;/p&gt;\n\n&lt;p&gt;Since I was at a state school, my tuition was a lot lower than it would have been at one of my preferred art schools. I also was able to take electives and general education courses in other subjects that have helped me out in a variety of ways during my current 3D-related job. My coworkers are a mix of those who went to cheap state schools, those who went to pricey art schools, and those who went to useless for-profit art/tech schools. We all ended up in the same place though.&lt;/p&gt;\n\n&lt;p&gt;My advice: &lt;/p&gt;\n\n&lt;p&gt;(1) Try to spend as little money as possible. Most artist salaries are never enough to justify an insane amount of art school debt these days. &lt;/p&gt;\n\n&lt;p&gt;(2) Pick a useful art. Web design may be more competitive than web dev, but you still have better prospects than a Painting or Illustration major. Photography majors have some dismal prospects but 3D artists/animators can make it work if they are flexible and open minded to other opportunities outside of Hollywood or AAA games. &lt;/p&gt;\n\n&lt;p&gt;(3) Internships and/or co-ops are required to be employable after school.I don&amp;#39;t care if your program doesn&amp;#39;t actually &amp;quot;require&amp;quot; them, for all intents and purposes just pretend that they are a graduation requirement and try to snag as many as possible. If you start searching and you can&amp;#39;t find any realistic internships for your major, then you may want to consider finding something more in demand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbjewp", "score_hidden": false, "stickied": false, "created": 1492337839.0, "created_utc": 1492309039.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65j3gr", "likes": null, "replies": "", "user_reports": [], "id": "dgc7zkk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65j3gr", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I had thoughts about going to art school. But now I don't want to do anything with school at all. It's too stressful for me and my mental illness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had thoughts about going to art school. But now I don&amp;#39;t want to do anything with school at all. It&amp;#39;s too stressful for me and my mental illness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc7zkk", "score_hidden": false, "stickied": false, "created": 1492388830.0, "created_utc": 1492360030.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]