[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;ve been with this girl for about a month or so now. She&amp;#39;s a really nice girl, but something just feels wrong. It&amp;#39;s in the little things she&amp;#39;ll do or say. She doesn&amp;#39;t seem to show any empathy towards even the most harmless of creatures, and will kill almost any bug, insect, or spider for no reason. She doesn&amp;#39;t even like regular animals, like dogs or cats. She also is very.. smothering. It didn&amp;#39;t take any time before she was telling me how much she loved me, and she&amp;#39;s very very affectionate and flirtatious, like, beyond what is normal for such a short time of knowing each other. Whenever I look at her directly, she is beautiful, but something just isn&amp;#39;t right. I feel like I can&amp;#39;t break up with her because I don&amp;#39;t want to hurt her feelings, as she has been known to be extremely emotional if someone breaks ties with her and usually ends up harming herself. She always complains about how everybody leaves her to me, and how she knows I won&amp;#39;t leave her like all of her exes did.&lt;/p&gt;\n\n&lt;p&gt;In short, maybe these things all are just nothing. However, she does have ties to very sketchy people, and is friends with pretty much everyone I know, so I fear the consequences of talking to anyone I know about her. Something just ISNT right, I can&amp;#39;t put my finger on it, but i don&amp;#39;t feel very good about being with her. I just feel like i have no reason NOT to like her. She&amp;#39;s beautiful, outgoing, and affectionate, along with being pretty sexual.&lt;/p&gt;\n\n&lt;p&gt;If any of you have any advice, I would appreciate it. Thanks for reading if anyone did, I just needed to write this out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, I've been with this girl for about a month or so now. She's a really nice girl, but something just feels wrong. It's in the little things she'll do or say. She doesn't seem to show any empathy towards even the most harmless of creatures, and will kill almost any bug, insect, or spider for no reason. She doesn't even like regular animals, like dogs or cats. She also is very.. smothering. It didn't take any time before she was telling me how much she loved me, and she's very very affectionate and flirtatious, like, beyond what is normal for such a short time of knowing each other. Whenever I look at her directly, she is beautiful, but something just isn't right. I feel like I can't break up with her because I don't want to hurt her feelings, as she has been known to be extremely emotional if someone breaks ties with her and usually ends up harming herself. She always complains about how everybody leaves her to me, and how she knows I won't leave her like all of her exes did.\n\nIn short, maybe these things all are just nothing. However, she does have ties to very sketchy people, and is friends with pretty much everyone I know, so I fear the consequences of talking to anyone I know about her. Something just ISNT right, I can't put my finger on it, but i don't feel very good about being with her. I just feel like i have no reason NOT to like her. She's beautiful, outgoing, and affectionate, along with being pretty sexual.\n\nIf any of you have any advice, I would appreciate it. Thanks for reading if anyone did, I just needed to write this out.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65m4bc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "hiraethtrash", "saved": false, "mod_reports": [], "name": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65m4bc/my_girlfriend_seems_off_and_i_dont_know_what_to_do/", "num_reports": null, "locked": false, "stickied": false, "created": 1492327507.0, "url": "https://www.reddit.com/r/offmychest/comments/65m4bc/my_girlfriend_seems_off_and_i_dont_know_what_to_do/", "author_flair_text": null, "quarantine": false, "title": "My girlfriend seems off and I don't know what to do", "created_utc": 1492298707.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbejvz", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Pola_Xray", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "saying \"I love you\" way too soon is a red flag. \n\n&gt;I just feel like i have no reason NOT to like her.\n\nThat's not a good enough reason to stay with someone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;saying &amp;quot;I love you&amp;quot; way too soon is a red flag. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I just feel like i have no reason NOT to like her.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not a good enough reason to stay with someone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbejvz", "score_hidden": false, "stickied": false, "created": 1492330813.0, "created_utc": 1492302013.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgboslo", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "catchafire678", "parent_id": "t1_dgblmn0", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "And block her everywhere and don't allow yourself to be manipulated. If she threatened suicide or self harm CALL THE POLICE and she will get help she needs or will stop her manipulative BS.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And block her everywhere and don&amp;#39;t allow yourself to be manipulated. If she threatened suicide or self harm CALL THE POLICE and she will get help she needs or will stop her manipulative BS.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgboslo", "score_hidden": false, "stickied": false, "created": 1492346235.0, "created_utc": 1492317435.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgc62ai", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AD4K", "parent_id": "t1_dgblmn0", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I was with a girl like this as well, and she ultimately ended up ghosting me after I figured out that she had been fucking her old college professor behind my back and flirting around with all his rich academic friends just to get them to buy stuff for her. She refused to be confronted about it and said I \"had no right to make her feel bad for doing what makes her happy\".  \n\nSome people are sociopaths with zero comprehension of empathy or real attachment to others. I still to this day have issues with trusting people I date. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was with a girl like this as well, and she ultimately ended up ghosting me after I figured out that she had been fucking her old college professor behind my back and flirting around with all his rich academic friends just to get them to buy stuff for her. She refused to be confronted about it and said I &amp;quot;had no right to make her feel bad for doing what makes her happy&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;Some people are sociopaths with zero comprehension of empathy or real attachment to others. I still to this day have issues with trusting people I date. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc62ai", "score_hidden": false, "stickied": false, "created": 1492386228.0, "created_utc": 1492357428.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgblmn0", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "hiraethtrash", "parent_id": "t1_dgbgtju", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you so much.. I think I will dump her once I see her on Monday, as there it will be in public so she can't do anything. \nThank you again, it really means a lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much.. I think I will dump her once I see her on Monday, as there it will be in public so she can&amp;#39;t do anything. \nThank you again, it really means a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgblmn0", "score_hidden": false, "stickied": false, "created": 1492341111.0, "created_utc": 1492312311.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbgtju", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "1pandamanypanda", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sweetheart, listen:\n\nDump. Her.\n\n\nI know this may sound harsh, but I have met and dealt with many people like this and know many more. If I am wrong about how this girl is, I apologize in advance, but the way you are describing her matches with some other people I know. I also apologize as what I'm about to say will seem very harsh, but I know what I am talking about (I grew up with someone like this. Trust me, I am being honest with this.)\n\n\nThere are some people who like others because they simply like other people, and then there are people who like other people because they like the attention it brings them. She is definitely in the latter group. \nPeople like this will cling to people who validate them and overwhelm them till they eventually cannot take it anymore. It's an odd form of narcissism; they don't love themselves per se, but they love it when other people love them. That is why they take being left so personally, it's an offense to their sense of personal value.\n\nNow people like this can be fine to be around with on occasion, but you never want them to become dependent on you for affection. They will treat you sweetly and be over affectionate to convince you that they are worth your time and emotions, which they then use to validate themselves and bolster their own opinions of themselves. The \"offness\" often felt around them is due to their own lack of genuine character and affection; they are being fake in how they present themselves to better appeal to you. To convince you that they are perfect and worth the time and investment. That you shouldn't leave.\n\n\nShe will never be genuine with you. She will not give any real emotional connection because she doesn't know how. She loves herself and the affection you can give her because that reinforces her preset ideas. You don't need someone like this in your life.\n\nDump her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sweetheart, listen:&lt;/p&gt;\n\n&lt;p&gt;Dump. Her.&lt;/p&gt;\n\n&lt;p&gt;I know this may sound harsh, but I have met and dealt with many people like this and know many more. If I am wrong about how this girl is, I apologize in advance, but the way you are describing her matches with some other people I know. I also apologize as what I&amp;#39;m about to say will seem very harsh, but I know what I am talking about (I grew up with someone like this. Trust me, I am being honest with this.)&lt;/p&gt;\n\n&lt;p&gt;There are some people who like others because they simply like other people, and then there are people who like other people because they like the attention it brings them. She is definitely in the latter group. \nPeople like this will cling to people who validate them and overwhelm them till they eventually cannot take it anymore. It&amp;#39;s an odd form of narcissism; they don&amp;#39;t love themselves per se, but they love it when other people love them. That is why they take being left so personally, it&amp;#39;s an offense to their sense of personal value.&lt;/p&gt;\n\n&lt;p&gt;Now people like this can be fine to be around with on occasion, but you never want them to become dependent on you for affection. They will treat you sweetly and be over affectionate to convince you that they are worth your time and emotions, which they then use to validate themselves and bolster their own opinions of themselves. The &amp;quot;offness&amp;quot; often felt around them is due to their own lack of genuine character and affection; they are being fake in how they present themselves to better appeal to you. To convince you that they are perfect and worth the time and investment. That you shouldn&amp;#39;t leave.&lt;/p&gt;\n\n&lt;p&gt;She will never be genuine with you. She will not give any real emotional connection because she doesn&amp;#39;t know how. She loves herself and the affection you can give her because that reinforces her preset ideas. You don&amp;#39;t need someone like this in your life.&lt;/p&gt;\n\n&lt;p&gt;Dump her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbgtju", "score_hidden": false, "stickied": false, "created": 1492334046.0, "created_utc": 1492305246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbk98e", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "bigpony", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "The most triggering part of this story... was that the most repeated caveat to stay with her was that she was beautiful. \n\nThis relates to my own personal hangups regarding men focusing too much on women's beauty and ignoring the ugly person they are clearly showing them. I watched my brother get trapped with a woman he had cold feet about,  then she got pregnant.  They are divorced but my brothers life is essentially ruined and now he is suicidal and messed up after 10 years of drama and manipulation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The most triggering part of this story... was that the most repeated caveat to stay with her was that she was beautiful. &lt;/p&gt;\n\n&lt;p&gt;This relates to my own personal hangups regarding men focusing too much on women&amp;#39;s beauty and ignoring the ugly person they are clearly showing them. I watched my brother get trapped with a woman he had cold feet about,  then she got pregnant.  They are divorced but my brothers life is essentially ruined and now he is suicidal and messed up after 10 years of drama and manipulation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbk98e", "score_hidden": false, "stickied": false, "created": 1492339093.0, "created_utc": 1492310293.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbg23b", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "WaterWatcher", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Trust your instincts. \nThe bug killing &amp; not liking animals is like 4% danger, but the other stuff you mentioned....\n\nAlso, she's manipulating you. She needs to get help and you are not the one. You are not responsible for her self harm, either. You need to buckle up, break up, get a restraining order if need be (breakup manipulation will make you feel 50 kinds of guilty &amp; bad), and avoid her. The sooner the better.\n\nGood luck. Be strong ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust your instincts. \nThe bug killing &amp;amp; not liking animals is like 4% danger, but the other stuff you mentioned....&lt;/p&gt;\n\n&lt;p&gt;Also, she&amp;#39;s manipulating you. She needs to get help and you are not the one. You are not responsible for her self harm, either. You need to buckle up, break up, get a restraining order if need be (breakup manipulation will make you feel 50 kinds of guilty &amp;amp; bad), and avoid her. The sooner the better.&lt;/p&gt;\n\n&lt;p&gt;Good luck. Be strong &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbg23b", "score_hidden": false, "stickied": false, "created": 1492332970.0, "created_utc": 1492304170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbq72q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "silvercat3", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I would say trust your instinct and break up with her. My instinct has helped me in my life. Please stay safe and call the police if you feel you are in danger. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would say trust your instinct and break up with her. My instinct has helped me in my life. Please stay safe and call the police if you feel you are in danger. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbq72q", "score_hidden": false, "stickied": false, "created": 1492348794.0, "created_utc": 1492319994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbn2ln", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "fracISback", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Look up Borderline Personality Disorder. She truly sounds like she has it from what you're describing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Look up Borderline Personality Disorder. She truly sounds like she has it from what you&amp;#39;re describing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbn2ln", "score_hidden": false, "stickied": false, "created": 1492343333.0, "created_utc": 1492314533.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbj8kd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MangoMambo", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Breakup with her.\n\nWhat's the plan? Wait 4 years until she can handle the break up? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Breakup with her.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s the plan? Wait 4 years until she can handle the break up? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbj8kd", "score_hidden": false, "stickied": false, "created": 1492337588.0, "created_utc": 1492308788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbla5l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FatPaunch", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "She's a narcissist. Run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s a narcissist. Run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbla5l", "score_hidden": false, "stickied": false, "created": 1492340589.0, "created_utc": 1492311789.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbok7t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Heydudeinspace", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Bro. The self-harm, neediness, being overly affectionate and sexual after a short time of dating (which cheapens the whole experience, to be honest), and manipulation tells me that you're dating a ticking time bomb. I wouldn't be surprised in the slightest if she's bipolar, BTW.\n\nJump ship. People should fix themselves before inserting another person into their life.\n\nThe word \"beautiful\" is mentioned more than once in the post. We males are visual creatures (and I am pretty sure you're not minding the sex), but being mentally unstable trumps beautiful any day of the week. You're still ashore. Don't go in deep enough until you start getting suicide threats on the phone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bro. The self-harm, neediness, being overly affectionate and sexual after a short time of dating (which cheapens the whole experience, to be honest), and manipulation tells me that you&amp;#39;re dating a ticking time bomb. I wouldn&amp;#39;t be surprised in the slightest if she&amp;#39;s bipolar, BTW.&lt;/p&gt;\n\n&lt;p&gt;Jump ship. People should fix themselves before inserting another person into their life.&lt;/p&gt;\n\n&lt;p&gt;The word &amp;quot;beautiful&amp;quot; is mentioned more than once in the post. We males are visual creatures (and I am pretty sure you&amp;#39;re not minding the sex), but being mentally unstable trumps beautiful any day of the week. You&amp;#39;re still ashore. Don&amp;#39;t go in deep enough until you start getting suicide threats on the phone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbok7t", "score_hidden": false, "stickied": false, "created": 1492345837.0, "created_utc": 1492317037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbue6x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThreeTreeCat", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You wrote comparatively little, but all I can see are massive fucking red flags. You two aren't the right match for each other.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You wrote comparatively little, but all I can see are massive fucking red flags. You two aren&amp;#39;t the right match for each other.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbue6x", "score_hidden": false, "stickied": false, "created": 1492359278.0, "created_utc": 1492330478.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgbx7pn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kanzona", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Have you talked with her about these things? She isn't perfect, but I can't help thinking you may be projecting your own emptiness on her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you talked with her about these things? She isn&amp;#39;t perfect, but I can&amp;#39;t help thinking you may be projecting your own emptiness on her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgbx7pn", "score_hidden": false, "stickied": false, "created": 1492368829.0, "created_utc": 1492340029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65m4bc", "likes": null, "replies": "", "user_reports": [], "id": "dgblhef", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jobriq", "parent_id": "t3_65m4bc", "subreddit_name_prefixed": "r/offmychest", "controversiality": 1, "body": "Bang her first. Then dump her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bang her first. Then dump her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgblhef", "score_hidden": false, "stickied": false, "created": 1492340888.0, "created_utc": 1492312088.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]