[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Fuck. What a thing to hit someone with.&lt;/p&gt;\n\n&lt;p&gt;I get it, we&amp;#39;re young, people fall in and out of love. But then why did you let me take you out to a fancy dinner and drinks after for a total of nearly $300? You were trying to get me to buy you a charm for your bracelet the week before. The month before that I took you to a White Party (not a racist thing if you don&amp;#39;t know) for your birthday and you looked me in the eyes, a little tipsy, with the coloured lights glinting through your hair under the stars as we had a cigarette and said &amp;quot;I love you&amp;quot;. More than once. Our lives were fucking perfect. There was never any sign of doubt or mistrust, your best friend thought I was going to ask you to marry me in the coming months.&lt;/p&gt;\n\n&lt;p&gt;Then we get in the cab after an expensive, but amazing night, laughing and telling jokes and saying &amp;quot;I love you&amp;quot; on the ride back to your house, and I leave the car with a different person.&lt;/p&gt;\n\n&lt;p&gt;In an instant the girl I knew inside and out changed to a complete stranger. She didn&amp;#39;t know how she felt. She thought she could convince herself otherwise (for how long had she been trying?), and just couldn&amp;#39;t anymore. She didn&amp;#39;t know whether she wanted to be with me anymore. She didn&amp;#39;t know whether she still loved me.&lt;/p&gt;\n\n&lt;p&gt;I have saved your life. I&amp;#39;ve taken you inside when you were out in the cold dark with a knife, I&amp;#39;ve told you how I don&amp;#39;t care about the scars on your legs, your hands, too many to count. You hadn&amp;#39;t hurt yourself for months since we&amp;#39;d started dating. I&amp;#39;ve pinned you down while you screaming, trying to bite me, anything to stop me calling the hospital and having your parents find out, after carrying you from the bathtub, nearly burnt from scalding water, with a cut the width and depth of a finger in your thigh, me covered in blood and begging for the operator to send paramedics and police. I lost my house for that.&lt;/p&gt;\n\n&lt;p&gt;But I stuck by you the whole time, I never for a second doubted that I loved you, I was prepared to live for you and make sure that never happened again.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t know how bad I was before I met you. I&amp;#39;d been a finger squeeze away from ending my life, saved by a duck that came running up to me for petting. You dragged me out of that, as much as I took you out of the terrible place you were in. And now with you gone, I realise how much I relied upon you. My counsellor wants to put me on meds, which scares the shit out of me. Having a cigarette under a bridge with a train passing over it, the appeal of the sound of the wheels spinning overhead terrified me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m with friends now, drinking wine, at something we were meant to do together. This would be fun in any other case... but there&amp;#39;s an ache in my chest the whole time, my thoughts are never of fun or jokes like they used to be. It&amp;#39;s an ache that&amp;#39;s impossible to describe to someone who hasn&amp;#39;t had that same ache before.&lt;/p&gt;\n\n&lt;p&gt;No-one listens. &amp;quot;I know you were together for a long time, you&amp;#39;ll get over it&amp;quot;. This girl saved my life. I didn&amp;#39;t realise what was wrong with me till now. &amp;quot;She left you? That&amp;#39;s shit man... but she was a c***, we know you can do better&amp;quot;... I get the idea, but do you really think I want to hear that? Myself, her, and us have been through shit I wouldn&amp;#39;t wish upon my worst enemy.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve lost a stupid amount of weight. I&amp;#39;m smoking probably quadruple what I used to. My self confidence is shattered. If I&amp;#39;m lucky I wake up wanting to do nothing. Otherwise I&amp;#39;m thinking about killing myself, and not in a lighthearted way. I think about how good it would be to live a life where I&amp;#39;m not reliant on medication to feel a shadow of &amp;quot;normal&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;People can fall in and out of love, I get that. But this has plunged me into a place I&amp;#39;d never thought I&amp;#39;d be again and that terrifies me.&lt;/p&gt;\n\n&lt;p&gt;I have tried so hard to make myself hate you, convince myself you were dead and it was someone with the same name in your place, work out where everything went wrong. And I can&amp;#39;t. I am trying so hard to let you go but this depression is like an anchor. We&amp;#39;ve saved each others lives.&lt;/p&gt;\n\n&lt;p&gt;I just want you back. And I know that&amp;#39;ll never be. I have to face this dread thats a part of me on my own. But I wish I didn&amp;#39;t have to.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Fuck. What a thing to hit someone with.\n\nI get it, we're young, people fall in and out of love. But then why did you let me take you out to a fancy dinner and drinks after for a total of nearly $300? You were trying to get me to buy you a charm for your bracelet the week before. The month before that I took you to a White Party (not a racist thing if you don't know) for your birthday and you looked me in the eyes, a little tipsy, with the coloured lights glinting through your hair under the stars as we had a cigarette and said \"I love you\". More than once. Our lives were fucking perfect. There was never any sign of doubt or mistrust, your best friend thought I was going to ask you to marry me in the coming months.\n\nThen we get in the cab after an expensive, but amazing night, laughing and telling jokes and saying \"I love you\" on the ride back to your house, and I leave the car with a different person.\n\nIn an instant the girl I knew inside and out changed to a complete stranger. She didn't know how she felt. She thought she could convince herself otherwise (for how long had she been trying?), and just couldn't anymore. She didn't know whether she wanted to be with me anymore. She didn't know whether she still loved me.\n\nI have saved your life. I've taken you inside when you were out in the cold dark with a knife, I've told you how I don't care about the scars on your legs, your hands, too many to count. You hadn't hurt yourself for months since we'd started dating. I've pinned you down while you screaming, trying to bite me, anything to stop me calling the hospital and having your parents find out, after carrying you from the bathtub, nearly burnt from scalding water, with a cut the width and depth of a finger in your thigh, me covered in blood and begging for the operator to send paramedics and police. I lost my house for that.\n\nBut I stuck by you the whole time, I never for a second doubted that I loved you, I was prepared to live for you and make sure that never happened again.\n\nYou don't know how bad I was before I met you. I'd been a finger squeeze away from ending my life, saved by a duck that came running up to me for petting. You dragged me out of that, as much as I took you out of the terrible place you were in. And now with you gone, I realise how much I relied upon you. My counsellor wants to put me on meds, which scares the shit out of me. Having a cigarette under a bridge with a train passing over it, the appeal of the sound of the wheels spinning overhead terrified me.\n\nI'm with friends now, drinking wine, at something we were meant to do together. This would be fun in any other case... but there's an ache in my chest the whole time, my thoughts are never of fun or jokes like they used to be. It's an ache that's impossible to describe to someone who hasn't had that same ache before.\n\nNo-one listens. \"I know you were together for a long time, you'll get over it\". This girl saved my life. I didn't realise what was wrong with me till now. \"She left you? That's shit man... but she was a c***, we know you can do better\"... I get the idea, but do you really think I want to hear that? Myself, her, and us have been through shit I wouldn't wish upon my worst enemy.\n\nI've lost a stupid amount of weight. I'm smoking probably quadruple what I used to. My self confidence is shattered. If I'm lucky I wake up wanting to do nothing. Otherwise I'm thinking about killing myself, and not in a lighthearted way. I think about how good it would be to live a life where I'm not reliant on medication to feel a shadow of \"normal\".\n\nPeople can fall in and out of love, I get that. But this has plunged me into a place I'd never thought I'd be again and that terrifies me.\n\nI have tried so hard to make myself hate you, convince myself you were dead and it was someone with the same name in your place, work out where everything went wrong. And I can't. I am trying so hard to let you go but this depression is like an anchor. We've saved each others lives.\n\nI just want you back. And I know that'll never be. I have to face this dread thats a part of me on my own. But I wish I didn't have to.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65olkq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "dau_throwaway", "saved": false, "mod_reports": [], "name": "t3_65olkq", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65olkq/i_dont_love_you_anymore_and_i_dont_know_why/", "num_reports": null, "locked": false, "stickied": false, "created": 1492369331.0, "url": "https://www.reddit.com/r/offmychest/comments/65olkq/i_dont_love_you_anymore_and_i_dont_know_why/", "author_flair_text": null, "quarantine": false, "title": "\"I don't love you anymore and I don't know why.\"", "created_utc": 1492340531.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65olkq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65olkq", "likes": null, "replies": "", "user_reports": [], "id": "dgc61um", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lindypie", "parent_id": "t1_dgc4t5a", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "what Lightbluekite  said. That exactly. You were with her for a reason. Now she is giving you a gift. It hurts - but TAKE IT. Move on. Perhaps some googling on the stages grief and loss would be helpful in doing that. You are having a lot of feeling and they are natural. Your brain is building new synapses and the universe is going to use all of this to give you something better. It gets better - it really does. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;what Lightbluekite  said. That exactly. You were with her for a reason. Now she is giving you a gift. It hurts - but TAKE IT. Move on. Perhaps some googling on the stages grief and loss would be helpful in doing that. You are having a lot of feeling and they are natural. Your brain is building new synapses and the universe is going to use all of this to give you something better. It gets better - it really does. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc61um", "score_hidden": false, "stickied": false, "created": 1492386211.0, "created_utc": 1492357411.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4t5a", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Lightbluekite", "parent_id": "t3_65olkq", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Dear OP, she is mentally ill.  Your self confidence should not be shattered.  I know you hurt, but please understand that she is sick.  Trying to hurt herself all the time, making you feel responsible for taking care of her, all of the things she does are attention seeking behavior.  Telling you she loves you and now telling you she does not know how she feels - that is still attention seeking behavior, just a different kind.  She keeps exhibiting attention seeking behavior and mental illness.  You will do yourself a favor if you encourage her to get help and get yourself out of the situation as fast as you can because this does not have to be your life.  My son has been trying to help his mentally ill off and on girlfriend for six years.  Six years of threatening to kill herself.  Her breaking up with him and then wanting him back.  Her cheating and then wanting him back.  He can't seem to let her go.  It is not his responsibility.  She is not your responsibility.  A normal loving person did not just tell you that she doesn't love you - an attention seeking mentally unstable person told you that.  I'm so sorry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dear OP, she is mentally ill.  Your self confidence should not be shattered.  I know you hurt, but please understand that she is sick.  Trying to hurt herself all the time, making you feel responsible for taking care of her, all of the things she does are attention seeking behavior.  Telling you she loves you and now telling you she does not know how she feels - that is still attention seeking behavior, just a different kind.  She keeps exhibiting attention seeking behavior and mental illness.  You will do yourself a favor if you encourage her to get help and get yourself out of the situation as fast as you can because this does not have to be your life.  My son has been trying to help his mentally ill off and on girlfriend for six years.  Six years of threatening to kill herself.  Her breaking up with him and then wanting him back.  Her cheating and then wanting him back.  He can&amp;#39;t seem to let her go.  It is not his responsibility.  She is not your responsibility.  A normal loving person did not just tell you that she doesn&amp;#39;t love you - an attention seeking mentally unstable person told you that.  I&amp;#39;m so sorry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc4t5a", "score_hidden": false, "stickied": false, "created": 1492384497.0, "created_utc": 1492355697.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65olkq", "likes": null, "replies": "", "user_reports": [], "id": "dgc98hu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Hell_hath_no", "parent_id": "t3_65olkq", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You do amazing things, that's for sure, but she does not owe you love in return. She can't love herself, she is not capable of living you either right now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You do amazing things, that&amp;#39;s for sure, but she does not owe you love in return. She can&amp;#39;t love herself, she is not capable of living you either right now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc98hu", "score_hidden": false, "stickied": false, "created": 1492390455.0, "created_utc": 1492361655.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65olkq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65olkq", "likes": null, "replies": "", "user_reports": [], "id": "dgcd102", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lightbluekite", "parent_id": "t1_dgc6186", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "This is such a great comment.  I totally agree that being on medication is absolutely nothing to be ashamed of.  I relied on antidepressants myself for 9 years.  I'm happy that I don't need them now.  But I really did need them for that time in my life.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is such a great comment.  I totally agree that being on medication is absolutely nothing to be ashamed of.  I relied on antidepressants myself for 9 years.  I&amp;#39;m happy that I don&amp;#39;t need them now.  But I really did need them for that time in my life.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcd102", "score_hidden": false, "stickied": false, "created": 1492395438.0, "created_utc": 1492366638.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6186", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mr_simmons", "parent_id": "t3_65olkq", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You seem like the most brave, loving kind of person. I don't know you, but I'm just so sorry that you've had to go through all of it. Another commenter (quite rightly imo) suggested that she is mentally ill- it sounds like you both are, you both know it, and that's partly why you bonded so strongly.\n\nIt sounds like your devotion and capacity to care are a double-edged sword- you did so much for this girl, but at the expense of your own self-care. It also sounds like you were relying on each other for the support and love that should have been coming from within yourselves. \n\nThe idea of two people in a relationship saving each other is romanticised so much; whilst it's true that two people can bring out the best in each other, your lives are still your own, and someone else caring for your survival is no substitute for self-worth. The dread you're feeling now is likely a manifestation of how poorly you view yourself as a person in your own right. You've probably heard this so many times now that it sounds trite, but it doesn't have to be that way.\n\nIt feels impossible at the moment, but you can be happy and at peace with yourself, without her. Recovering from this is going to involve learning how to love yourself- you will get over her, but it'll happen without you realising, almost as an afterthought of you being secure in yourself as an individual. It'll be a long and painful process, but so worth it in the end.\n\nYou've said you've got a counsellor- that's great, keep at it. You mentioned that they've suggested medication, and it's totally understandable to find that terrifying. I remember going on psychoactive meds for the first time and thinking the same: that I'd be reliant on them for the rest of my life, that they'd change who I was as a person/numb me out completely, and that the side effect profiles are a mile long. The first point 1) doesn't have to be true, and 2) even if it is, the potential benefit of actually living a happy life massively outweighs you having to take a pill every day. I think of it a bit like diabetes- some diabetics will be reliant on insulin injections for the rest of their life, but that doesn't make them any less worthy as people, and they get the benefit of being alive. It's hard to see it like that when mental illness is so stigmatised, and when you don't actually want to be alive at the moment. The second point is a half-truth; when antidepressants etc. do their job, you will notice a change in how you are. But that's not you becoming a different person, it's you being the best version of yourself. The third point is a bit moot because there are so many medication options- if you don't get on with one, you can easily switch to another. Meds won't solve your problems for you, but they'll put you in a better position to solve them for yourself. \n\nSorry for the essay, but your story resonated. I haven't been through what you have, but I have been hospitalised for a suicide attempt in the past (with many near-misses before that). I really hope you can come out of this as happy as you deserve to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You seem like the most brave, loving kind of person. I don&amp;#39;t know you, but I&amp;#39;m just so sorry that you&amp;#39;ve had to go through all of it. Another commenter (quite rightly imo) suggested that she is mentally ill- it sounds like you both are, you both know it, and that&amp;#39;s partly why you bonded so strongly.&lt;/p&gt;\n\n&lt;p&gt;It sounds like your devotion and capacity to care are a double-edged sword- you did so much for this girl, but at the expense of your own self-care. It also sounds like you were relying on each other for the support and love that should have been coming from within yourselves. &lt;/p&gt;\n\n&lt;p&gt;The idea of two people in a relationship saving each other is romanticised so much; whilst it&amp;#39;s true that two people can bring out the best in each other, your lives are still your own, and someone else caring for your survival is no substitute for self-worth. The dread you&amp;#39;re feeling now is likely a manifestation of how poorly you view yourself as a person in your own right. You&amp;#39;ve probably heard this so many times now that it sounds trite, but it doesn&amp;#39;t have to be that way.&lt;/p&gt;\n\n&lt;p&gt;It feels impossible at the moment, but you can be happy and at peace with yourself, without her. Recovering from this is going to involve learning how to love yourself- you will get over her, but it&amp;#39;ll happen without you realising, almost as an afterthought of you being secure in yourself as an individual. It&amp;#39;ll be a long and painful process, but so worth it in the end.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve said you&amp;#39;ve got a counsellor- that&amp;#39;s great, keep at it. You mentioned that they&amp;#39;ve suggested medication, and it&amp;#39;s totally understandable to find that terrifying. I remember going on psychoactive meds for the first time and thinking the same: that I&amp;#39;d be reliant on them for the rest of my life, that they&amp;#39;d change who I was as a person/numb me out completely, and that the side effect profiles are a mile long. The first point 1) doesn&amp;#39;t have to be true, and 2) even if it is, the potential benefit of actually living a happy life massively outweighs you having to take a pill every day. I think of it a bit like diabetes- some diabetics will be reliant on insulin injections for the rest of their life, but that doesn&amp;#39;t make them any less worthy as people, and they get the benefit of being alive. It&amp;#39;s hard to see it like that when mental illness is so stigmatised, and when you don&amp;#39;t actually want to be alive at the moment. The second point is a half-truth; when antidepressants etc. do their job, you will notice a change in how you are. But that&amp;#39;s not you becoming a different person, it&amp;#39;s you being the best version of yourself. The third point is a bit moot because there are so many medication options- if you don&amp;#39;t get on with one, you can easily switch to another. Meds won&amp;#39;t solve your problems for you, but they&amp;#39;ll put you in a better position to solve them for yourself. &lt;/p&gt;\n\n&lt;p&gt;Sorry for the essay, but your story resonated. I haven&amp;#39;t been through what you have, but I have been hospitalised for a suicide attempt in the past (with many near-misses before that). I really hope you can come out of this as happy as you deserve to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc6186", "score_hidden": false, "stickied": false, "created": 1492386188.0, "created_utc": 1492357388.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]