[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title suggests, I&amp;#39;m 27 and have never had sex. I&amp;#39;ve never had a girlfriend, and I don&amp;#39;t even know how to kiss.&lt;/p&gt;\n\n&lt;p&gt;Up until late last year, my family&amp;#39;s financial situation was miserable. By miserable, I mean I wouldn&amp;#39;t have $3 to make it to school at times, and if I went out today, I wouldn&amp;#39;t eat tomorrow. That lasted for (believe it or not) well over 11 years. In that time I was never able to &amp;quot;go out and meet people!&amp;quot;. I was also not the most sociable at school because we could hardly pay the rent most of the time and I was always worried.&lt;/p&gt;\n\n&lt;p&gt;I started working early last year and supporting the family (parent, sibling), but barely (the salary wasn&amp;#39;t great). Late last year, I got a much better job, and I can now support the family and I finally have enough to go out and meet people.&lt;/p&gt;\n\n&lt;p&gt;Onto the twist.&lt;/p&gt;\n\n&lt;p&gt;Four years ago, when I was 23, I was depressed about being lonely, never having a girlfriend, never having been with a girl. I decided to go to a prostitute. I did not end up having sex with her, but she did give me a blowjob (I was wearing a condom, but condoms don&amp;#39;t cover your testicles.) She also did lie on top of me for a bit.&lt;/p&gt;\n\n&lt;p&gt;A week or two later, my scrotum tightens up and goes red and the base of my penis hurts and itches. I thought herpes. I&amp;#39;ve seen six different doctors, and I&amp;#39;ve done two IGG blood tests (for those familiar) for herpes, and all of them say it isn&amp;#39;t herpes.&lt;/p&gt;\n\n&lt;p&gt;All I&amp;#39;ve been able to find online is &amp;quot;Red Scrotum Syndrome&amp;quot;, which you may read up about if you like. The end of it is this; My scrotum is red and tight at times throughout the day, and the base of my penis may hurt or itch at times as well. There is no explanation, and I&amp;#39;m currently trying different medications as per my doctor to see what would work.&lt;/p&gt;\n\n&lt;p&gt;I am good looking (believe it or not, I&amp;#39;ve lost more than one chance at having a girl, either because I was too stupid to notice she was hitting on me, or because I didn&amp;#39;t know how to respond, and this is before I even went to see the damn prostitute), I have a good job, I&amp;#39;m educated, I work out, and I&amp;#39;m constantly trying to improve myself (next step is how to not be awkward at times).&lt;/p&gt;\n\n&lt;p&gt;None of these things matter, though, as I don&amp;#39;t know what&amp;#39;s wrong with my genital area. I don&amp;#39;t know if it&amp;#39;s contagious or not. Even though my doctor thinks its unrelated to the woman, the internet is full of posts saying the same thing I&amp;#39;m saying (blowjob into redness), which may or may mean it&amp;#39;s contagious.&lt;/p&gt;\n\n&lt;p&gt;Also, at this age, some of my friends have moved out of the city, out of the country, or are already engaged/married, so no one actually wants to go out to places where we can meet people. We only ever go to someone&amp;#39;s house anymore.&lt;/p&gt;\n\n&lt;p&gt;I constantly feel like my whole life has passed me by and I haven&amp;#39;t been able to enjoy a bit of it. First, broke to no end, then a condition no one knows how to fix, and having no one to go out to places.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had suicidal thoughts on more than one occasion because I don&amp;#39;t know what to do. If I do meet someone, I&amp;#39;m not the kind of person to gloss over the red scrotum and go for it because I don&amp;#39;t want to hurt anyone else, but that&amp;#39;s assuming I get to the point where I can tell her, which doesn&amp;#39;t seem likely at this point.&lt;/p&gt;\n\n&lt;p&gt;TL;DR If I meet a girl and tell her I&amp;#39;m a virgin and my scrotum goes red, I really don&amp;#39;t have a chance in hell. This is assuming I&amp;#39;ll actually ever meet anyone.&lt;/p&gt;\n\n&lt;p&gt;Thanks for listening. (Sorry if a bit long-winded.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As the title suggests, I'm 27 and have never had sex. I've never had a girlfriend, and I don't even know how to kiss.\n\nUp until late last year, my family's financial situation was miserable. By miserable, I mean I wouldn't have $3 to make it to school at times, and if I went out today, I wouldn't eat tomorrow. That lasted for (believe it or not) well over 11 years. In that time I was never able to \"go out and meet people!\". I was also not the most sociable at school because we could hardly pay the rent most of the time and I was always worried.\n\nI started working early last year and supporting the family (parent, sibling), but barely (the salary wasn't great). Late last year, I got a much better job, and I can now support the family and I finally have enough to go out and meet people.\n\nOnto the twist.\n\nFour years ago, when I was 23, I was depressed about being lonely, never having a girlfriend, never having been with a girl. I decided to go to a prostitute. I did not end up having sex with her, but she did give me a blowjob (I was wearing a condom, but condoms don't cover your testicles.) She also did lie on top of me for a bit.\n\nA week or two later, my scrotum tightens up and goes red and the base of my penis hurts and itches. I thought herpes. I've seen six different doctors, and I've done two IGG blood tests (for those familiar) for herpes, and all of them say it isn't herpes.\n\nAll I've been able to find online is \"Red Scrotum Syndrome\", which you may read up about if you like. The end of it is this; My scrotum is red and tight at times throughout the day, and the base of my penis may hurt or itch at times as well. There is no explanation, and I'm currently trying different medications as per my doctor to see what would work.\n\nI am good looking (believe it or not, I've lost more than one chance at having a girl, either because I was too stupid to notice she was hitting on me, or because I didn't know how to respond, and this is before I even went to see the damn prostitute), I have a good job, I'm educated, I work out, and I'm constantly trying to improve myself (next step is how to not be awkward at times).\n\nNone of these things matter, though, as I don't know what's wrong with my genital area. I don't know if it's contagious or not. Even though my doctor thinks its unrelated to the woman, the internet is full of posts saying the same thing I'm saying (blowjob into redness), which may or may mean it's contagious.\n\nAlso, at this age, some of my friends have moved out of the city, out of the country, or are already engaged/married, so no one actually wants to go out to places where we can meet people. We only ever go to someone's house anymore.\n\nI constantly feel like my whole life has passed me by and I haven't been able to enjoy a bit of it. First, broke to no end, then a condition no one knows how to fix, and having no one to go out to places.\n\nI've had suicidal thoughts on more than one occasion because I don't know what to do. If I do meet someone, I'm not the kind of person to gloss over the red scrotum and go for it because I don't want to hurt anyone else, but that's assuming I get to the point where I can tell her, which doesn't seem likely at this point.\n\nTL;DR If I meet a girl and tell her I'm a virgin and my scrotum goes red, I really don't have a chance in hell. This is assuming I'll actually ever meet anyone.\n\nThanks for listening. (Sorry if a bit long-winded.)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65p1pm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 101, "report_reasons": null, "author": "QuiteDepressedx", "saved": false, "mod_reports": [], "name": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65p1pm/27_year_old_male_virgin_with_a_small_twist/", "num_reports": null, "locked": false, "stickied": false, "created": 1492377354.0, "url": "https://www.reddit.com/r/offmychest/comments/65p1pm/27_year_old_male_virgin_with_a_small_twist/", "author_flair_text": null, "quarantine": false, "title": "27 Year Old Male Virgin, With a Small Twist", "created_utc": 1492348554.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 24, "visited": false, "subreddit_type": "public", "ups": 101}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgcgvs5", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgc5fjg", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It's a one-day-at-a-time thing right now.\n\nThanks for the support.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a one-day-at-a-time thing right now.&lt;/p&gt;\n\n&lt;p&gt;Thanks for the support.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcgvs5", "score_hidden": false, "stickied": false, "created": 1492400574.0, "created_utc": 1492371774.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5fjg", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "Waitwhatdidijustsay", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Plenty of babies are actually born with herpes. Meaning that some people that have never had sex have herpes. And they grow up, having to explain this to people they fall in love with.\n\nYour case has been confirmed not herpes, so at least there's that! Please don't take your life over this, OP. Figure out what it is and take it a step at a time. People today are a lot less judgmental about health conditions than you think. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plenty of babies are actually born with herpes. Meaning that some people that have never had sex have herpes. And they grow up, having to explain this to people they fall in love with.&lt;/p&gt;\n\n&lt;p&gt;Your case has been confirmed not herpes, so at least there&amp;#39;s that! Please don&amp;#39;t take your life over this, OP. Figure out what it is and take it a step at a time. People today are a lot less judgmental about health conditions than you think. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc5fjg", "score_hidden": false, "stickied": false, "created": 1492385363.0, "created_utc": 1492356563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgcox75", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgcjzpe", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's where I was confused.\n\nI think it's common sense not to bring that sort of thing up on a first date, but the question was, when I do bring it up, should I just avoid mentioning where it came from completely?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s where I was confused.&lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s common sense not to bring that sort of thing up on a first date, but the question was, when I do bring it up, should I just avoid mentioning where it came from completely?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcox75", "score_hidden": false, "stickied": false, "created": 1492411115.0, "created_utc": 1492382315.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjzpe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DFKENLK", "parent_id": "t1_dgchada", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Just say it was from a past relationship you had with someone. Could be romantic, could be FWB, could be a hookup, could be an escort, doesn't matter. A relationship can be anything, what's important is that you're being upfront and honest about it so kudos to you for that. 😄\n\nedit: But I think what the original commenter meant is that you should only bring it up when the relationship gets serious and/or sexual. Don't go blurting it out on your first date, although if sex is on the table (as it often is with online dating), you still should.", "edited": 1492375990.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just say it was from a past relationship you had with someone. Could be romantic, could be FWB, could be a hookup, could be an escort, doesn&amp;#39;t matter. A relationship can be anything, what&amp;#39;s important is that you&amp;#39;re being upfront and honest about it so kudos to you for that. 😄&lt;/p&gt;\n\n&lt;p&gt;edit: But I think what the original commenter meant is that you should only bring it up when the relationship gets serious and/or sexual. Don&amp;#39;t go blurting it out on your first date, although if sex is on the table (as it often is with online dating), you still should.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcjzpe", "score_hidden": false, "stickied": false, "created": 1492404586.0, "created_utc": 1492375786.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchada", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgc6a99", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I don't know about the whole online dating thing. To me it just seems like there are so many more men than women on them that it might not be worth trying, but I'll still take your advice on it and see if I can actually land a date.\n\nNo issues with masturbation since the redness started. That said, there's no guarantee it will be going away anytime soon, or at all. Those with STIs generally have windows where they are minimally infectious (between outbreaks with Herpes, for example), whereas for me, it's red daily, but on and off throughout the day.\n\nThere's really nothing more or less to see down there, lol. My scrotum will just be a bit red and tightened up.\n\nAs for\n\"I honestly don't believe you need to tell her the prostitute part\": Don't bring it up ever? Should I just say the redness started from nothing?\n\nAlso, thanks for taking the time to read and respond, I appreciate it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know about the whole online dating thing. To me it just seems like there are so many more men than women on them that it might not be worth trying, but I&amp;#39;ll still take your advice on it and see if I can actually land a date.&lt;/p&gt;\n\n&lt;p&gt;No issues with masturbation since the redness started. That said, there&amp;#39;s no guarantee it will be going away anytime soon, or at all. Those with STIs generally have windows where they are minimally infectious (between outbreaks with Herpes, for example), whereas for me, it&amp;#39;s red daily, but on and off throughout the day.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s really nothing more or less to see down there, lol. My scrotum will just be a bit red and tightened up.&lt;/p&gt;\n\n&lt;p&gt;As for\n&amp;quot;I honestly don&amp;#39;t believe you need to tell her the prostitute part&amp;quot;: Don&amp;#39;t bring it up ever? Should I just say the redness started from nothing?&lt;/p&gt;\n\n&lt;p&gt;Also, thanks for taking the time to read and respond, I appreciate it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgchada", "score_hidden": false, "stickied": false, "created": 1492401103.0, "created_utc": 1492372303.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6a99", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Brewmeiser", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Hi. I'm glad you're financial circumstances have changed, and you feel able to get out there and meet people. I'm going to start out with that, as I'm a lady myself, so I feel more at ease helping with that.\n\nI myself have been in the dating game whilst most of my friends are either married, or in a long term relationship. I've also always loathed meeting people at bars/ clubs, as I've found those are almost more hook up situation's and not actually looking for significance. \n\nI highly suggest trying online dating. Personally, I'd pass on Tinder, (again I consider it more of a hook up app), and try something with more of a user profile. Personally, OK Cupid worked really well for myself, (it's how I met my fiancee), and it's a good way to weed out someone you have no interest in. It seems to me you're looking for something with more substance, and I find that's a good way to go.\n\nAs far as the scrotal/Virgin issue, I honestly don't think it's necessary a bad thing to be a Virgin at your age. Everyone is different, and some people just don't do it until they feel ready or comfortable. Any woman that has an honest interest in you as a person, won't care as well. I definitely don't think it's a first or second date conversation, (unless you feel comfortable talking about it), but I really don't think it's a big deal. Also, any time you're intimate with someone for the first time, it''s weird for both of you. I've had SO many horrible first kisses, (not to say yours will be), and that has not turned me off. A lot of times it's equal jitters from both of you. So don't be overly worried about your technique or anything. Things get better the more comfortable you feel with the person, (to be fair, I've had some good first kisses, but those dudes never worked out). Overall, if a girl is into you, there will be no games. She'll let you know, and it's OK to go on a couple of bad dates. It happens to all of us. \n\nOk. I hope that was somewhat helpful. \nAs far as the red scrotum issue, it's unfortunate that you have to deal with this issue, but again not the end of the world. I hope it's not overly bothersome on a day to day basis. May I ask if you've ever had any issues with masturbation after it started? Only asking if it has caused any problems with the act of sex. \n\nIt sounds as if you've seen the doctors, and they agree it's not contagious, so that's promising. However, many people in the world do suffer from STDs/STIs, and women honestly do appreciate when men use condoms automatically. Plus, it sounds like you opt for being safe in general.\nDo not worry about someone really looking at your penis/scrotum. It's honesty not that good looking, (that goes for all of them), and although it's enjoyable, it's not something that is super admired. \n\nWhen you feel good enough with a women to be intimate, be honest and tell her what has happened. I honestly don't believe you need to tell her the prostitute part, (not at first, it's a before things get very serious conversation), and let her know you'received seeing a doctor to get it taken care of. All you can do is be honest, and if she's into you she will understand. \n\nSorry for being so long winded. I hope this has helped. \nGood luck in your endeavors!!", "edited": 1492357960.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi. I&amp;#39;m glad you&amp;#39;re financial circumstances have changed, and you feel able to get out there and meet people. I&amp;#39;m going to start out with that, as I&amp;#39;m a lady myself, so I feel more at ease helping with that.&lt;/p&gt;\n\n&lt;p&gt;I myself have been in the dating game whilst most of my friends are either married, or in a long term relationship. I&amp;#39;ve also always loathed meeting people at bars/ clubs, as I&amp;#39;ve found those are almost more hook up situation&amp;#39;s and not actually looking for significance. &lt;/p&gt;\n\n&lt;p&gt;I highly suggest trying online dating. Personally, I&amp;#39;d pass on Tinder, (again I consider it more of a hook up app), and try something with more of a user profile. Personally, OK Cupid worked really well for myself, (it&amp;#39;s how I met my fiancee), and it&amp;#39;s a good way to weed out someone you have no interest in. It seems to me you&amp;#39;re looking for something with more substance, and I find that&amp;#39;s a good way to go.&lt;/p&gt;\n\n&lt;p&gt;As far as the scrotal/Virgin issue, I honestly don&amp;#39;t think it&amp;#39;s necessary a bad thing to be a Virgin at your age. Everyone is different, and some people just don&amp;#39;t do it until they feel ready or comfortable. Any woman that has an honest interest in you as a person, won&amp;#39;t care as well. I definitely don&amp;#39;t think it&amp;#39;s a first or second date conversation, (unless you feel comfortable talking about it), but I really don&amp;#39;t think it&amp;#39;s a big deal. Also, any time you&amp;#39;re intimate with someone for the first time, it&amp;#39;&amp;#39;s weird for both of you. I&amp;#39;ve had SO many horrible first kisses, (not to say yours will be), and that has not turned me off. A lot of times it&amp;#39;s equal jitters from both of you. So don&amp;#39;t be overly worried about your technique or anything. Things get better the more comfortable you feel with the person, (to be fair, I&amp;#39;ve had some good first kisses, but those dudes never worked out). Overall, if a girl is into you, there will be no games. She&amp;#39;ll let you know, and it&amp;#39;s OK to go on a couple of bad dates. It happens to all of us. &lt;/p&gt;\n\n&lt;p&gt;Ok. I hope that was somewhat helpful. \nAs far as the red scrotum issue, it&amp;#39;s unfortunate that you have to deal with this issue, but again not the end of the world. I hope it&amp;#39;s not overly bothersome on a day to day basis. May I ask if you&amp;#39;ve ever had any issues with masturbation after it started? Only asking if it has caused any problems with the act of sex. &lt;/p&gt;\n\n&lt;p&gt;It sounds as if you&amp;#39;ve seen the doctors, and they agree it&amp;#39;s not contagious, so that&amp;#39;s promising. However, many people in the world do suffer from STDs/STIs, and women honestly do appreciate when men use condoms automatically. Plus, it sounds like you opt for being safe in general.\nDo not worry about someone really looking at your penis/scrotum. It&amp;#39;s honesty not that good looking, (that goes for all of them), and although it&amp;#39;s enjoyable, it&amp;#39;s not something that is super admired. &lt;/p&gt;\n\n&lt;p&gt;When you feel good enough with a women to be intimate, be honest and tell her what has happened. I honestly don&amp;#39;t believe you need to tell her the prostitute part, (not at first, it&amp;#39;s a before things get very serious conversation), and let her know you&amp;#39;received seeing a doctor to get it taken care of. All you can do is be honest, and if she&amp;#39;s into you she will understand. &lt;/p&gt;\n\n&lt;p&gt;Sorry for being so long winded. I hope this has helped. \nGood luck in your endeavors!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc6a99", "score_hidden": false, "stickied": false, "created": 1492386532.0, "created_utc": 1492357732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgcgk23", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgccrgj", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I hope you do better than me lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope you do better than me lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcgk23", "score_hidden": false, "stickied": false, "created": 1492400143.0, "created_utc": 1492371343.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccrgj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "fuckeverything444", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "if it makes you feel better i'll be in the 27 year old virgin postion with you after my birthday this week", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if it makes you feel better i&amp;#39;ll be in the 27 year old virgin postion with you after my birthday this week&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgccrgj", "score_hidden": false, "stickied": false, "created": 1492395087.0, "created_utc": 1492366287.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgcgiv0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgccuei", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Congrats on finding someone. Nice to know there's something good happening out there.\n\nI'm already on doxy, we'll see if it fixes it or not. Third month in now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Congrats on finding someone. Nice to know there&amp;#39;s something good happening out there.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m already on doxy, we&amp;#39;ll see if it fixes it or not. Third month in now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcgiv0", "score_hidden": false, "stickied": false, "created": 1492400100.0, "created_utc": 1492371300.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccuei", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "notgoodatthrowingawa", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "well i just did a small google search about the syndrome and it is treatable with doxycline which is antibiotic. i dont think it is that bad, but you feel this way because it is quite important to you.\n\ni am also 27 and i had sex for the first time 2 months ago so i can relate somehow. my family is not poor. however, i grown up with no money because my father was a gambler and didnt care for his family.\n\ni grow up into an antisocial person who lacked the social skills. i am also educated and have my degree but it wasnt until start working as a retailer (i graduated law) when my social skills start developing. Finally got out with a good looking woman, a bit nuts but she was kind and accepting to the whole me at the time.\n\nat the time, when i was virgin, i thought not been virgin would change everythng but it didnt. however, i think it got some weight of my shoulder. if you check my history you can see that i was thinking of takin an escort but i didnt because it was also hard.\n\ni am also good looking but i really think self esteem is too important. i dont know yet how to achieve that, but i am trying to find a way.\n\nsuicide has always been a huge part of my life. but i will not do it, we will all die anyways, so why bring it sooner. i rather die been shot at than shooting myself. i also thnk of the french foreign legion, which offers anyone a second chance in life.\n\nmy suggestion to you is to keep yourself busy so you dont have time to think how sht your life is. get some good doctor check you up. and ask their decision in writing so that if they say it is nothing, in case it is to sue them and make money and havin them acountable for what they say.\n\nand do somethnig, it doesnt have to be nice build a car from scratch, build a house from scratch, make youtube videos. become the hardest working in whatever you do, but dont let your thoughts take over you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well i just did a small google search about the syndrome and it is treatable with doxycline which is antibiotic. i dont think it is that bad, but you feel this way because it is quite important to you.&lt;/p&gt;\n\n&lt;p&gt;i am also 27 and i had sex for the first time 2 months ago so i can relate somehow. my family is not poor. however, i grown up with no money because my father was a gambler and didnt care for his family.&lt;/p&gt;\n\n&lt;p&gt;i grow up into an antisocial person who lacked the social skills. i am also educated and have my degree but it wasnt until start working as a retailer (i graduated law) when my social skills start developing. Finally got out with a good looking woman, a bit nuts but she was kind and accepting to the whole me at the time.&lt;/p&gt;\n\n&lt;p&gt;at the time, when i was virgin, i thought not been virgin would change everythng but it didnt. however, i think it got some weight of my shoulder. if you check my history you can see that i was thinking of takin an escort but i didnt because it was also hard.&lt;/p&gt;\n\n&lt;p&gt;i am also good looking but i really think self esteem is too important. i dont know yet how to achieve that, but i am trying to find a way.&lt;/p&gt;\n\n&lt;p&gt;suicide has always been a huge part of my life. but i will not do it, we will all die anyways, so why bring it sooner. i rather die been shot at than shooting myself. i also thnk of the french foreign legion, which offers anyone a second chance in life.&lt;/p&gt;\n\n&lt;p&gt;my suggestion to you is to keep yourself busy so you dont have time to think how sht your life is. get some good doctor check you up. and ask their decision in writing so that if they say it is nothing, in case it is to sue them and make money and havin them acountable for what they say.&lt;/p&gt;\n\n&lt;p&gt;and do somethnig, it doesnt have to be nice build a car from scratch, build a house from scratch, make youtube videos. become the hardest working in whatever you do, but dont let your thoughts take over you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgccuei", "score_hidden": false, "stickied": false, "created": 1492395196.0, "created_utc": 1492366396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgcov0w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgcnuop", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That actually did make me feel better lol\n \nThanks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That actually did make me feel better lol&lt;/p&gt;\n\n&lt;p&gt;Thanks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcov0w", "score_hidden": false, "stickied": false, "created": 1492411035.0, "created_utc": 1492382235.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnuop", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DefinitelyForReal", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm a 25 year old male and I also get the red itchy scrotum. I get it on my glans too though so it's a little worse.\n\nI went to the dermatologist 8 years ago when I became sexually active because I thought it was herpes; he asked me to see my underarms and immediately said it was just eczema. As for medication, the only thing I've found that does anything is an extremely expensive ointment called Protopic.\n\nAnd from my experience, as long as you tell people what is going on beforehand nobody cares. All dicks look different, there is no normal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a 25 year old male and I also get the red itchy scrotum. I get it on my glans too though so it&amp;#39;s a little worse.&lt;/p&gt;\n\n&lt;p&gt;I went to the dermatologist 8 years ago when I became sexually active because I thought it was herpes; he asked me to see my underarms and immediately said it was just eczema. As for medication, the only thing I&amp;#39;ve found that does anything is an extremely expensive ointment called Protopic.&lt;/p&gt;\n\n&lt;p&gt;And from my experience, as long as you tell people what is going on beforehand nobody cares. All dicks look different, there is no normal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcnuop", "score_hidden": false, "stickied": false, "created": 1492409652.0, "created_utc": 1492380852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgcgdch", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgc53hp", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm currently on Doxy, just finished my 2nd month and into the third. I do hope it resolves, but it hasn't so far.\n\nI'm also going to see if any other doctors have any other advice on this.\n\nThanks for the kind words.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m currently on Doxy, just finished my 2nd month and into the third. I do hope it resolves, but it hasn&amp;#39;t so far.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also going to see if any other doctors have any other advice on this.&lt;/p&gt;\n\n&lt;p&gt;Thanks for the kind words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcgdch", "score_hidden": false, "stickied": false, "created": 1492399900.0, "created_utc": 1492371100.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc53hp", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Lightbluekite", "parent_id": "t1_dgc4rji", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "\"Last year, the Journal of Dermatological Case Reports published a paper about how to treat RSS using either doxycycline (an antibiotic) or gabapentin (a pain reliever). You probably won't find an over-the-counter treatment that's effective for RSS.\"  Have you been to anyone who tried treating you with doxycycline?  I hope you are able to find some relief and so sorry that you are dealing with this\n\nI suggest you search for a dermatologist in your area who has experience treating this syndrome. You may want to point him or her to the case study published in the journal mentioned above. Because RSS is rare, you may have to make several phone calls before finding a dermatologist with experience in treating RSS.\n\nDon't feel embarrassed seeking out treatment for this. You deserve some relief from this often-painful condition.\n\nWishing you all the best!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Last year, the Journal of Dermatological Case Reports published a paper about how to treat RSS using either doxycycline (an antibiotic) or gabapentin (a pain reliever). You probably won&amp;#39;t find an over-the-counter treatment that&amp;#39;s effective for RSS.&amp;quot;  Have you been to anyone who tried treating you with doxycycline?  I hope you are able to find some relief and so sorry that you are dealing with this&lt;/p&gt;\n\n&lt;p&gt;I suggest you search for a dermatologist in your area who has experience treating this syndrome. You may want to point him or her to the case study published in the journal mentioned above. Because RSS is rare, you may have to make several phone calls before finding a dermatologist with experience in treating RSS.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t feel embarrassed seeking out treatment for this. You deserve some relief from this often-painful condition.&lt;/p&gt;\n\n&lt;p&gt;Wishing you all the best!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc53hp", "score_hidden": false, "stickied": false, "created": 1492384897.0, "created_utc": 1492356097.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc4rji", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgc484v", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I was enrolled in a coop program that required that I do a semester of work experience but they never helped with placements, so I spent time looking for work while I was at school but was not successful at first. I graduated late because of this. I was let go by the place where I did my coop (a small start up that couldn't afford to keep me), and couldn't find a job (even a minimum wage one) for about a year and a half. \n\nAs for Red Scrotum Syndrome, a search will give you more insight. In terms of myself, my scrotum is red daily, but it comes and goes throughout the day. Mine is also accompanied with tightness in the scrotum as well when it's there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was enrolled in a coop program that required that I do a semester of work experience but they never helped with placements, so I spent time looking for work while I was at school but was not successful at first. I graduated late because of this. I was let go by the place where I did my coop (a small start up that couldn&amp;#39;t afford to keep me), and couldn&amp;#39;t find a job (even a minimum wage one) for about a year and a half. &lt;/p&gt;\n\n&lt;p&gt;As for Red Scrotum Syndrome, a search will give you more insight. In terms of myself, my scrotum is red daily, but it comes and goes throughout the day. Mine is also accompanied with tightness in the scrotum as well when it&amp;#39;s there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc4rji", "score_hidden": false, "stickied": false, "created": 1492384434.0, "created_utc": 1492355634.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc484v", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Lightbluekite", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "May I ask why you are 27 and just started working a year ago?  Your family was broke and you were not working and you were in your 20s?  I don't understand.  I am not sure what your red scrotum issue is.  I have honestly never heard of it.  Is it just off and on I guess?  How long does it last?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;May I ask why you are 27 and just started working a year ago?  Your family was broke and you were not working and you were in your 20s?  I don&amp;#39;t understand.  I am not sure what your red scrotum issue is.  I have honestly never heard of it.  Is it just off and on I guess?  How long does it last?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgc484v", "score_hidden": false, "stickied": false, "created": 1492383640.0, "created_utc": 1492354840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgd4nv3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KarmaChameleon306", "parent_id": "t1_dgd2gwe", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Oh yeah, I felt exactly the same.  I figured I had missed my window of oportunity and that it was just never going to happen.  What changed it for me was moving away to a new city and starting over with a new group of friends.  That way nobody else knew that I was a 28 year old virgin and I think that sort of freed me to get out of my comfort zone. \nI feel like part of what kept my dry spell going was that the longer it went, the more my reputation of being asexual and undatable preceeded me.  I was too shy to try and it just got harder as the years went on. \n\nSo getting into a completely new circle of friends in a new city seemed to help break that slump.  Change of scenery and all.  That being said, I realize that relocating isn't an option for everyone.  But maybe try to break out for your regular circle a little.  Maybe try joining some meetups or even internet dating.  That way you are going to be out of that element that may be contributing to your slump.  And that's really all it is, a slump. You will break out of this slump. You have to believe that.   It's hard to explain, and maybe someone else can help me with the psychology at play here, but I found that amongst my regular group of friends in my home town I had settled into the role of the guy who never dated, never kissed a girl, or had sex. And I think subconsciously, both my friends and I kept me in that role as it was just the natural order of things. \n\n\nSo my advice is make some new friends and try to meet women completely seperate from your regular group of friends and they don't need to know your virginity status.  That first kiss will be awkward but not as awkward as you think. First kisses are always awkward anyway.  And if it escalates to sex, just tell her that it's been a long time for you. That's all anyone needs to know and it will cover your inexperience.  As for the red scrotum, if your Dr and the research you have done says it's not contagious, then I don't know if you need to mention it. I don't know, that's a tough one. Definitely don't mention that you were with a prostitute.  Nobody needs to know that.  Just that you were with this woman sounds sufficient enough. \n\nHope this helps man. And I really feel your pain. But you can and will turn this around.  I thought it was never going to happen either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yeah, I felt exactly the same.  I figured I had missed my window of oportunity and that it was just never going to happen.  What changed it for me was moving away to a new city and starting over with a new group of friends.  That way nobody else knew that I was a 28 year old virgin and I think that sort of freed me to get out of my comfort zone. \nI feel like part of what kept my dry spell going was that the longer it went, the more my reputation of being asexual and undatable preceeded me.  I was too shy to try and it just got harder as the years went on. &lt;/p&gt;\n\n&lt;p&gt;So getting into a completely new circle of friends in a new city seemed to help break that slump.  Change of scenery and all.  That being said, I realize that relocating isn&amp;#39;t an option for everyone.  But maybe try to break out for your regular circle a little.  Maybe try joining some meetups or even internet dating.  That way you are going to be out of that element that may be contributing to your slump.  And that&amp;#39;s really all it is, a slump. You will break out of this slump. You have to believe that.   It&amp;#39;s hard to explain, and maybe someone else can help me with the psychology at play here, but I found that amongst my regular group of friends in my home town I had settled into the role of the guy who never dated, never kissed a girl, or had sex. And I think subconsciously, both my friends and I kept me in that role as it was just the natural order of things. &lt;/p&gt;\n\n&lt;p&gt;So my advice is make some new friends and try to meet women completely seperate from your regular group of friends and they don&amp;#39;t need to know your virginity status.  That first kiss will be awkward but not as awkward as you think. First kisses are always awkward anyway.  And if it escalates to sex, just tell her that it&amp;#39;s been a long time for you. That&amp;#39;s all anyone needs to know and it will cover your inexperience.  As for the red scrotum, if your Dr and the research you have done says it&amp;#39;s not contagious, then I don&amp;#39;t know if you need to mention it. I don&amp;#39;t know, that&amp;#39;s a tough one. Definitely don&amp;#39;t mention that you were with a prostitute.  Nobody needs to know that.  Just that you were with this woman sounds sufficient enough. &lt;/p&gt;\n\n&lt;p&gt;Hope this helps man. And I really feel your pain. But you can and will turn this around.  I thought it was never going to happen either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd4nv3", "score_hidden": false, "stickied": false, "created": 1492433473.0, "created_utc": 1492404673.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2gwe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgd0opm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "My worry is that it'll never happen. I don't know if you felt this at the time, but it always feels like I've missed out on so much by not having a girl, and it's the loss of time that I feel is irreparable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My worry is that it&amp;#39;ll never happen. I don&amp;#39;t know if you felt this at the time, but it always feels like I&amp;#39;ve missed out on so much by not having a girl, and it&amp;#39;s the loss of time that I feel is irreparable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd2gwe", "score_hidden": false, "stickied": false, "created": 1492429751.0, "created_utc": 1492400951.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0opm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KarmaChameleon306", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I had sex for the first time at 28.  As the years went on I found myself getting more and more hung up on how awkward and inexperienced I would look to a woman. I also hadn't kissed anyone. I was shut down with a horrible self esteem most of my life until then.  \n\n\nThe funny thing is that once I gained my confidence and finally kissed a woman it was fine.  The first kiss was kind of awkward but I figured it out quickly.  I think that is the case anyway.  Once I got my first girlfriend and had sex, I've never had problems. All that is needed is to get that first time out of the way and get your confidence up. Self esteem plays such a huge role here.  \n\n\nKeep your head up and just know that this does not make you a lesser person or weird in any way.  Everyone is different.   It will happen when the time is right and your instincts will kick in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had sex for the first time at 28.  As the years went on I found myself getting more and more hung up on how awkward and inexperienced I would look to a woman. I also hadn&amp;#39;t kissed anyone. I was shut down with a horrible self esteem most of my life until then.  &lt;/p&gt;\n\n&lt;p&gt;The funny thing is that once I gained my confidence and finally kissed a woman it was fine.  The first kiss was kind of awkward but I figured it out quickly.  I think that is the case anyway.  Once I got my first girlfriend and had sex, I&amp;#39;ve never had problems. All that is needed is to get that first time out of the way and get your confidence up. Self esteem plays such a huge role here.  &lt;/p&gt;\n\n&lt;p&gt;Keep your head up and just know that this does not make you a lesser person or weird in any way.  Everyone is different.   It will happen when the time is right and your instincts will kick in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd0opm", "score_hidden": false, "stickied": false, "created": 1492427122.0, "created_utc": 1492398322.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgcig1q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgchu01", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I've already seen six doctors. I'm trying to find time to go to more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve already seen six doctors. I&amp;#39;m trying to find time to go to more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcig1q", "score_hidden": false, "stickied": false, "created": 1492402586.0, "created_utc": 1492373786.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchu01", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgchu01", "score_hidden": false, "stickied": false, "created": 1492401808.0, "created_utc": 1492373008.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65p1pm", "likes": null, "replies": "", "user_reports": [], "id": "dgcottd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgcjasa", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Not my intentions at all. I thought you skimmed through my post and thought that I was 23. I know where you're coming from and I hope it doesn't take you this long.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not my intentions at all. I thought you skimmed through my post and thought that I was 23. I know where you&amp;#39;re coming from and I hope it doesn&amp;#39;t take you this long.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcottd", "score_hidden": false, "stickied": false, "created": 1492410988.0, "created_utc": 1492382188.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjasa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgchb9k", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcjasa", "score_hidden": false, "stickied": false, "created": 1492403696.0, "created_utc": 1492374896.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgchb9k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "QuiteDepressedx", "parent_id": "t1_dgcdx1z", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'll try. I wish I was 23 again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll try. I wish I was 23 again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgchb9k", "score_hidden": false, "stickied": false, "created": 1492401135.0, "created_utc": 1492372335.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcdx1z", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65p1pm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcdx1z", "score_hidden": false, "stickied": false, "created": 1492396646.0, "created_utc": 1492367846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]