[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t see my therapist until Thursday and I really just need to tell someone.&lt;/p&gt;\n\n&lt;p&gt;11 years ago I was an innocent 14 year old girl starting my freshman year of high school. I had a couple friends, never had a boyfriend, and was a shy, quiet girl. &lt;/p&gt;\n\n&lt;p&gt;A few months into 9th grade I met this boy who turned out to be the worst thing to ever happen to me. At the time I had already had a &amp;quot;boyfriend&amp;quot; who was really just a friend I talked to on AIM after school, and looked at awkwardly in the hallways at school. He was a sweet boy who was extremely nervous (and I was too). &lt;/p&gt;\n\n&lt;p&gt;This is the part where the worst boy entered -- we knew each other from marching band and played the same instrument. We were friends on myspace and knew each others AIM screen names, where he tried to get me to meet him by the auditorium so he could kiss me. He was also friends with sweet boy, and in hindsight I should&amp;#39;ve known then to never look in his direction.&lt;/p&gt;\n\n&lt;p&gt;Things evolved, and started out innocent and nice enough. I&amp;#39;m not sure exactly when it happened. The possessiveness, total obsession, and extreme jealousy. &lt;/p&gt;\n\n&lt;p&gt;It kept escalating and escalating. I couldn&amp;#39;t go home from school by myself, I couldn&amp;#39;t hang out with my new found high school friends without him. I was also the kind of girl who naturally made guy friends. Purely friendly. It started off with him texting me or calling me crying that I was going to cheat on him. For a while I put up with it, talking him down on the phone. But pretty soon that&amp;#39;s all I did while I was with my friends. &lt;/p&gt;\n\n&lt;p&gt;I am an introvert and I love my time alone and I always have. But I had no privacy and no life at all anymore. He was more strict than my parents ever were. I didn&amp;#39;t have to ask my parents for permission to see my friends, they knew and trusted me. I didn&amp;#39;t even have time to do my homework because he was there with me. All the time. &lt;/p&gt;\n\n&lt;p&gt;And pretty soon things escalated again, I stopped responding to him so much while I was with my friends. He would call and call and leave more than 10 voice mail messages screaming and yelling at me about what kind of person I was. &amp;quot;I bet your giving Benny boy a fucking blow job right now!&amp;quot; was a direct quote I still remember. And when I didn&amp;#39;t want him to come home with me after school every day, he would follow me  and yell at me. He made every day miserable. &lt;/p&gt;\n\n&lt;p&gt;But of course, that wasn&amp;#39;t all. Since sex was involved, we had to do it every day. And he would put up such a fight that I had to give in. The fighting and arguing were exhausting but I couldn&amp;#39;t give in completely - we would do it all over again the next day. Every day after school was a routine: argue on the way to my house, the lay on my bathroom floor with him on top of me, not making eye contact, no foreplay, no touching except PIV for 3-5 minutes. Or &amp;quot;cuddle&amp;quot; on my bed giving him a handjob to completion, all to try to keep some peace. He would sometimes find a way to bring me into my closet to give him a blow job while my friends were over. &lt;/p&gt;\n\n&lt;p&gt;I kept fighting and I kept fighting. He didn&amp;#39;t get physically abusive often, but he did. A slap here, a shove there. One of the first times was when I was on my family&amp;#39;s computer in the living room, doing whatever, myspace maybe? And he wanted to have sex and I must have been taking too long. So he came over and slapped me hard enough that I fell out of my chair. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure by now everyone is wondering why I didn&amp;#39;t break up with this guy. But it&amp;#39;s not for lack of trying. The worst part of it all was the emotional manipulation. I was a caring girl, and I still am. When I tried to break up with him, he would threaten to kill himself. Not once or twice, but on a daily basis for months, in many different ways, and not only if I wanted to break up with him. If I didn&amp;#39;t want to have sex, or if I didn&amp;#39;t want to do something in particular that he wanted me to do, he would threaten suicide in any multitude of ways.&lt;/p&gt;\n\n&lt;p&gt;Sometimes he would grab a knife from my kitchen and sulk out of my house and make me come after him (help me if I didn&amp;#39;t). If I didn&amp;#39;t react he would escalate more. Pills, cutting, jumping were what he threatened. This became part of our routine on the way to my house after school. At one time he carved words into his wrist. I would try to talk to him in my room and he would just write bullshit on post it notes and not talk to me. It was all an act. It all was. I still have several of the notes. All the threats he made, all the manipulative bullshit of &amp;quot;you&amp;#39;re going to make me kill myself, and it will all be your fault and everyone at school is going to hate you.&amp;quot; Over, and over, and over and over and over and over and over and over again.&lt;/p&gt;\n\n&lt;p&gt;I was completely miserable. My entire existence was dedicated to giving this piece of shit a &amp;quot;reason&amp;quot; not to kill himself. Talking him down every single day for at least a year (our relationship was 18 months long). Going through this bullshit play of following him outside of my house, pretending I still cared because I didn&amp;#39;t want him to die. Going through the motions of &amp;quot;I love you don&amp;#39;t kill yourself,&amp;quot; and finding him to take away various pills, knives, razor blades, etc. &lt;/p&gt;\n\n&lt;p&gt;I thought this was how my whole life was going to play out. I didn&amp;#39;t know how to end the cycle. I was miserable, and I cried myself to sleep most nights, after we talked on the phone for 30-60 minutes before bed. Because heaven forbid he didn&amp;#39;t know what I was doing for a few hours of my life. &lt;/p&gt;\n\n&lt;p&gt;I went to my best girl friend&amp;#39;s birthday party, I can&amp;#39;t remember if it was 15 or 16. But by that point he couldn&amp;#39;t stand me being with even girl friends. He called me and texted me saying that he took some pills and he was so &amp;quot;cold,&amp;quot; and so &amp;quot;alone.&amp;quot; I literally ran to my house and my friends came with me. I told my dad and he called the police. As I found out an hour or two later, he took a couple sleeping pills and laid down to take a nap. His parents came home to several emergency vehicles there and do you think anything that happened that night changed his attitude, at all? Definitely not.&lt;/p&gt;\n\n&lt;p&gt;I went to one of my high school counselors and told him what was going on. Not in detail. I was so ashamed and embarrassed of what I had let happen over all this time. He contacted his parents and he was made to go to counseling a few times. The problem is, counseling doesn&amp;#39;t help if the person doesn&amp;#39;t want to be there. Or, you know, if said person was actually suicidal. I didn&amp;#39;t truly believe he was ever going to do anything, but there was always that &amp;quot;chance&amp;quot; that he would do something, and he never let me forget it. &lt;/p&gt;\n\n&lt;p&gt;At some point I tried again to break up with him, via text, or IM, I don&amp;#39;t remember exactly. At the time he was with a female friend at some fair out of town. At one point we had to switch to texting from her phone because he said his was dead. So he was texting me and I was trying to ignore it. Eventually, after many an hour of silence, he texted me again pretending to be her, and said he was missing. Missing turned into &amp;quot;we found his hat at the bottom of this steep hill/cliff area, which turned into &amp;quot;he jumped because you broke up with him, you killed my friend, and so on and so forth. About an hour, maybe, after that, I get an IM from another one of his friends. This &amp;quot;friend&amp;quot; goes on to ask why I didn&amp;#39;t just talk to him, and give him another chance, and that he fights with his girlfriend too, but that he loves her, etc. I was so hysterical I didn&amp;#39;t realize until later when I reread the messages that it was him. He misspells a commonly used word in a very unique way that no one else spells that way (weird, I know). I was hysterically crying and my parents felt bad they couldn&amp;#39;t help me. I was texting him hoping he would respond, and that&amp;#39;s when he called me. Acting all nonchalant about the whole thing, of course. &lt;/p&gt;\n\n&lt;p&gt;After that I stopped fighting as hard. I just waited. He had enlisted in the army and was to be leaving for the summer. I started a countdown. I was desperate for my freedom again. &lt;/p&gt;\n\n&lt;p&gt;On the very last day, he was going to drop me off at my driver&amp;#39;s ed class before he left for the summer. I&amp;#39;m pretty sure he got to my house later than he said, and I was getting ready for my day, straightening my hair and putting on my make up. But that wasn&amp;#39;t going quick enough for him. I was sitting at the desk across from my bed, when he turns my hair around, picks me up by my upper arms and throws me onto my bed. He grabs my wrists very tightly and holds them above my head while he screams at me about 2 inches from my face. I&amp;#39;m sure you can guess what he wanted to do that morning. I&amp;#39;m not sure if I said it or he did, but if I was going to make it on time we had to leave at that moment. I didn&amp;#39;t react, and I didn&amp;#39;t respond to him on the short car ride there (by this time he had a car, so we didn&amp;#39;t have to walk or rely on my mom). He was screaming at me about how it was his last day for 10 weeks (or whatever). And when I wasn&amp;#39;t responding he reached across the the car and slapped me across the face. I jumped out of the car when we got there and ran inside the school. At that moment is when I texted him that it was over (and there is no cell reception in the driver&amp;#39;s ed classroom). I knew at that time that when class was over he would be gone. Of course, he tried not to let that be the end of it. He called my cell phone and my house phone off the hook that day. He said he would tell his recruiter that he was suicidal so he could come back home. So I made a fake promise that we would &amp;quot;see how things go&amp;quot; when he got home to get him to leave me alone and not come back. He wrote me a ton of letters and I wrote back twice with poems telling him to fuck off. His letters fluctuated between &amp;quot;I love you and I&amp;#39;m so sorry for how horrible I am,&amp;quot; and &amp;quot;I&amp;#39;m going to tell everyone your secrets!&amp;quot; and &amp;quot;when I get home I&amp;#39;m going to go to your favorite lake and kill myself so I can take away your happy place.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Words can&amp;#39;t express how fucking happy I was to be rid of that piece of work. But I was also angry, and depressed, for the longest time afterwards. I was so exhausted. And I should&amp;#39;ve found a therapist sooner than my senior year. &lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t for years that I was told that even if he had killed himself it would&amp;#39;ve been his choice. If he really wanted to do it, I couldn&amp;#39;t have stopped him. He was such an unhappy person, and that was on him. I&amp;#39;m still so jaded when it comes to suicide. I can&amp;#39;t help but think of him and what he put me through when the topic comes up. We broke up nearly 9 years ago. &lt;/p&gt;\n\n&lt;p&gt;For the longest time I was afraid that he was going to magically show up again and I would be forced into being with him again. It did happen once. During the 18 month relationship there was a gap where he was &amp;quot;wooing&amp;quot; and dating another girl. I thought it could&amp;#39;ve faded and been done with, but as soon as he caught a whiff of me being interested in another guy it was right back to me. &lt;/p&gt;\n\n&lt;p&gt;I am so glad that I survived. I&amp;#39;ve worked hard to make myself what I&amp;#39;ve become today. I&amp;#39;m married to a wonderful man, I know what a healthy relationship feels like the past 7 years. I own a nice house, I have a satisfying career that I&amp;#39;ve worked hard for. I&amp;#39;ve been in and out of therapy since 2009, and I still have my ups and downs, but life is great, truly. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;ve read this whole thing, thank you for sticking through it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't see my therapist until Thursday and I really just need to tell someone.\n\n11 years ago I was an innocent 14 year old girl starting my freshman year of high school. I had a couple friends, never had a boyfriend, and was a shy, quiet girl. \n\nA few months into 9th grade I met this boy who turned out to be the worst thing to ever happen to me. At the time I had already had a \"boyfriend\" who was really just a friend I talked to on AIM after school, and looked at awkwardly in the hallways at school. He was a sweet boy who was extremely nervous (and I was too). \n\nThis is the part where the worst boy entered -- we knew each other from marching band and played the same instrument. We were friends on myspace and knew each others AIM screen names, where he tried to get me to meet him by the auditorium so he could kiss me. He was also friends with sweet boy, and in hindsight I should've known then to never look in his direction.\n\nThings evolved, and started out innocent and nice enough. I'm not sure exactly when it happened. The possessiveness, total obsession, and extreme jealousy. \n\nIt kept escalating and escalating. I couldn't go home from school by myself, I couldn't hang out with my new found high school friends without him. I was also the kind of girl who naturally made guy friends. Purely friendly. It started off with him texting me or calling me crying that I was going to cheat on him. For a while I put up with it, talking him down on the phone. But pretty soon that's all I did while I was with my friends. \n\nI am an introvert and I love my time alone and I always have. But I had no privacy and no life at all anymore. He was more strict than my parents ever were. I didn't have to ask my parents for permission to see my friends, they knew and trusted me. I didn't even have time to do my homework because he was there with me. All the time. \n\nAnd pretty soon things escalated again, I stopped responding to him so much while I was with my friends. He would call and call and leave more than 10 voice mail messages screaming and yelling at me about what kind of person I was. \"I bet your giving Benny boy a fucking blow job right now!\" was a direct quote I still remember. And when I didn't want him to come home with me after school every day, he would follow me  and yell at me. He made every day miserable. \n\nBut of course, that wasn't all. Since sex was involved, we had to do it every day. And he would put up such a fight that I had to give in. The fighting and arguing were exhausting but I couldn't give in completely - we would do it all over again the next day. Every day after school was a routine: argue on the way to my house, the lay on my bathroom floor with him on top of me, not making eye contact, no foreplay, no touching except PIV for 3-5 minutes. Or \"cuddle\" on my bed giving him a handjob to completion, all to try to keep some peace. He would sometimes find a way to bring me into my closet to give him a blow job while my friends were over. \n\nI kept fighting and I kept fighting. He didn't get physically abusive often, but he did. A slap here, a shove there. One of the first times was when I was on my family's computer in the living room, doing whatever, myspace maybe? And he wanted to have sex and I must have been taking too long. So he came over and slapped me hard enough that I fell out of my chair. \n\nI'm sure by now everyone is wondering why I didn't break up with this guy. But it's not for lack of trying. The worst part of it all was the emotional manipulation. I was a caring girl, and I still am. When I tried to break up with him, he would threaten to kill himself. Not once or twice, but on a daily basis for months, in many different ways, and not only if I wanted to break up with him. If I didn't want to have sex, or if I didn't want to do something in particular that he wanted me to do, he would threaten suicide in any multitude of ways.\n\nSometimes he would grab a knife from my kitchen and sulk out of my house and make me come after him (help me if I didn't). If I didn't react he would escalate more. Pills, cutting, jumping were what he threatened. This became part of our routine on the way to my house after school. At one time he carved words into his wrist. I would try to talk to him in my room and he would just write bullshit on post it notes and not talk to me. It was all an act. It all was. I still have several of the notes. All the threats he made, all the manipulative bullshit of \"you're going to make me kill myself, and it will all be your fault and everyone at school is going to hate you.\" Over, and over, and over and over and over and over and over and over again.\n\nI was completely miserable. My entire existence was dedicated to giving this piece of shit a \"reason\" not to kill himself. Talking him down every single day for at least a year (our relationship was 18 months long). Going through this bullshit play of following him outside of my house, pretending I still cared because I didn't want him to die. Going through the motions of \"I love you don't kill yourself,\" and finding him to take away various pills, knives, razor blades, etc. \n\nI thought this was how my whole life was going to play out. I didn't know how to end the cycle. I was miserable, and I cried myself to sleep most nights, after we talked on the phone for 30-60 minutes before bed. Because heaven forbid he didn't know what I was doing for a few hours of my life. \n\nI went to my best girl friend's birthday party, I can't remember if it was 15 or 16. But by that point he couldn't stand me being with even girl friends. He called me and texted me saying that he took some pills and he was so \"cold,\" and so \"alone.\" I literally ran to my house and my friends came with me. I told my dad and he called the police. As I found out an hour or two later, he took a couple sleeping pills and laid down to take a nap. His parents came home to several emergency vehicles there and do you think anything that happened that night changed his attitude, at all? Definitely not.\n\nI went to one of my high school counselors and told him what was going on. Not in detail. I was so ashamed and embarrassed of what I had let happen over all this time. He contacted his parents and he was made to go to counseling a few times. The problem is, counseling doesn't help if the person doesn't want to be there. Or, you know, if said person was actually suicidal. I didn't truly believe he was ever going to do anything, but there was always that \"chance\" that he would do something, and he never let me forget it. \n\nAt some point I tried again to break up with him, via text, or IM, I don't remember exactly. At the time he was with a female friend at some fair out of town. At one point we had to switch to texting from her phone because he said his was dead. So he was texting me and I was trying to ignore it. Eventually, after many an hour of silence, he texted me again pretending to be her, and said he was missing. Missing turned into \"we found his hat at the bottom of this steep hill/cliff area, which turned into \"he jumped because you broke up with him, you killed my friend, and so on and so forth. About an hour, maybe, after that, I get an IM from another one of his friends. This \"friend\" goes on to ask why I didn't just talk to him, and give him another chance, and that he fights with his girlfriend too, but that he loves her, etc. I was so hysterical I didn't realize until later when I reread the messages that it was him. He misspells a commonly used word in a very unique way that no one else spells that way (weird, I know). I was hysterically crying and my parents felt bad they couldn't help me. I was texting him hoping he would respond, and that's when he called me. Acting all nonchalant about the whole thing, of course. \n\nAfter that I stopped fighting as hard. I just waited. He had enlisted in the army and was to be leaving for the summer. I started a countdown. I was desperate for my freedom again. \n\nOn the very last day, he was going to drop me off at my driver's ed class before he left for the summer. I'm pretty sure he got to my house later than he said, and I was getting ready for my day, straightening my hair and putting on my make up. But that wasn't going quick enough for him. I was sitting at the desk across from my bed, when he turns my hair around, picks me up by my upper arms and throws me onto my bed. He grabs my wrists very tightly and holds them above my head while he screams at me about 2 inches from my face. I'm sure you can guess what he wanted to do that morning. I'm not sure if I said it or he did, but if I was going to make it on time we had to leave at that moment. I didn't react, and I didn't respond to him on the short car ride there (by this time he had a car, so we didn't have to walk or rely on my mom). He was screaming at me about how it was his last day for 10 weeks (or whatever). And when I wasn't responding he reached across the the car and slapped me across the face. I jumped out of the car when we got there and ran inside the school. At that moment is when I texted him that it was over (and there is no cell reception in the driver's ed classroom). I knew at that time that when class was over he would be gone. Of course, he tried not to let that be the end of it. He called my cell phone and my house phone off the hook that day. He said he would tell his recruiter that he was suicidal so he could come back home. So I made a fake promise that we would \"see how things go\" when he got home to get him to leave me alone and not come back. He wrote me a ton of letters and I wrote back twice with poems telling him to fuck off. His letters fluctuated between \"I love you and I'm so sorry for how horrible I am,\" and \"I'm going to tell everyone your secrets!\" and \"when I get home I'm going to go to your favorite lake and kill myself so I can take away your happy place.\" \n\nWords can't express how fucking happy I was to be rid of that piece of work. But I was also angry, and depressed, for the longest time afterwards. I was so exhausted. And I should've found a therapist sooner than my senior year. \n\nIt wasn't for years that I was told that even if he had killed himself it would've been his choice. If he really wanted to do it, I couldn't have stopped him. He was such an unhappy person, and that was on him. I'm still so jaded when it comes to suicide. I can't help but think of him and what he put me through when the topic comes up. We broke up nearly 9 years ago. \n\nFor the longest time I was afraid that he was going to magically show up again and I would be forced into being with him again. It did happen once. During the 18 month relationship there was a gap where he was \"wooing\" and dating another girl. I thought it could've faded and been done with, but as soon as he caught a whiff of me being interested in another guy it was right back to me. \n\nI am so glad that I survived. I've worked hard to make myself what I've become today. I'm married to a wonderful man, I know what a healthy relationship feels like the past 7 years. I own a nice house, I have a satisfying career that I've worked hard for. I've been in and out of therapy since 2009, and I still have my ups and downs, but life is great, truly. \n\nIf you've read this whole thing, thank you for sticking through it.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65safy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "kaylin_xx3", "saved": false, "mod_reports": [], "name": "t3_65safy", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65safy/my_suicidal_boyfriend_naw/", "num_reports": null, "locked": false, "stickied": false, "created": 1492416115.0, "url": "https://www.reddit.com/r/offmychest/comments/65safy/my_suicidal_boyfriend_naw/", "author_flair_text": null, "quarantine": false, "title": "My Suicidal Boyfriend NAW", "created_utc": 1492387315.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65safy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65safy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65safy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65safy", "likes": null, "replies": "", "user_reports": [], "id": "dgcwwlg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "kaylin_xx3", "parent_id": "t1_dgcwqjj", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "He did to at least one other girl in high school. I sincerely hope he has learned something by now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He did to at least one other girl in high school. I sincerely hope he has learned something by now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcwwlg", "score_hidden": false, "stickied": false, "created": 1492421847.0, "created_utc": 1492393047.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwqjj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Siddu4evr", "parent_id": "t1_dgcwidm", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I hope he isn't manipulating some other poor soul. Props on moving on and living the dream.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hope he isn&amp;#39;t manipulating some other poor soul. Props on moving on and living the dream.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcwqjj", "score_hidden": false, "stickied": false, "created": 1492421621.0, "created_utc": 1492392821.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwidm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "kaylin_xx3", "parent_id": "t1_dgcw4op", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I work with an aunt of his, from what I understand not great. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work with an aunt of his, from what I understand not great. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcwidm", "score_hidden": false, "stickied": false, "created": 1492421326.0, "created_utc": 1492392526.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcw4op", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Siddu4evr", "parent_id": "t3_65safy", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Dang, I was on the edge of my seat for parts of that. Do you know how he's doing now? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dang, I was on the edge of my seat for parts of that. Do you know how he&amp;#39;s doing now? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcw4op", "score_hidden": false, "stickied": false, "created": 1492420844.0, "created_utc": 1492392044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65safy", "likes": null, "replies": "", "user_reports": [], "id": "dgdmwnx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kjtstl", "parent_id": "t3_65safy", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Jesus. I'm so sorry that you went through that. My wife and I have made it a point to tell each of our kids (15, 15, &amp; 13) that it is never okay for someone to try to manipulate them by saying they'll kill themselves. I hope it keeps them from going through something like this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus. I&amp;#39;m so sorry that you went through that. My wife and I have made it a point to tell each of our kids (15, 15, &amp;amp; 13) that it is never okay for someone to try to manipulate them by saying they&amp;#39;ll kill themselves. I hope it keeps them from going through something like this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdmwnx", "score_hidden": false, "stickied": false, "created": 1492472293.0, "created_utc": 1492443493.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]