[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(Feel free not to read it&amp;#39;s pretty boring, but if you really want to get the basic idea read the last paragraph)&lt;/p&gt;\n\n&lt;p&gt;I just wish I was born as a boy instead. I hate how feminine I am. I hate having wide hips and breasts and long hair and such a feminine name and such a high pitched voice. Sometimes I fall asleep hoping I&amp;#39;ll somehow be a boy when I wake up (which is impossible, I know, but it helps me fall asleep). Going through puberty is so terrible (I&amp;#39;m currently a teenager). All of the things I hate about my body since I was 11 have gotten worse.  I can&amp;#39;t ever imagine dating anyone because I&amp;#39;d have to be &amp;quot;womanly&amp;quot; or something in a relationship. I don&amp;#39;t want to be called someone&amp;#39;s &amp;quot;girlfriend&amp;quot;. I already wear a lot of boy-ish looking clothing but it isn&amp;#39;t enough. I don&amp;#39;t like being called a girl or expected to act like a girl. It just doesn&amp;#39;t feel like &amp;quot;me&amp;quot; if that makes sense.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m really confused :P I always thought everyone felt like that sometimes. None of my friends seem to be this way though. They seem to be happy as girls. I mean... most of the time I just sort of ignore my gender. When I realize that I&amp;#39;m a girl it upsets me. How do they never feel like that??? Maybe they do but are just pretending they don&amp;#39;t. Maybe everyone wants to be the opposite sex but just ignores it?&lt;/p&gt;\n\n&lt;p&gt;Actually, I guess sometimes I&amp;#39;m okay being a girl. I can go for months without even thinking about being a boy. I&amp;#39;ll tolerate putting on makeup, dressing femininely, etc but there is usually a lingering feeling of &amp;quot;this sucks. I hate being a girl&amp;quot; that I can&amp;#39;t shake. It&amp;#39;s really confusing because during the times I feel fine being a girl I look at myself and I think &amp;quot;I look great!&amp;quot; Like when I&amp;#39;m wearing dresses and stuff. Like I enjoy how feminine I look but I&amp;#39;d still rather not be wearing them. It&amp;#39;s as if I&amp;#39;d appreciate seeing a girl dressed like that (I&amp;#39;m pretty sure I&amp;#39;m a lesbian) but I don&amp;#39;t want to be dressed like that. I guess this just means I&amp;#39;m a tomboy? &lt;/p&gt;\n\n&lt;p&gt;I guess what I&amp;#39;m trying to say is that I hate being a girl and I wish I wasn&amp;#39;t one, but I can tolerate being a girl. I&amp;#39;d never prefer being a girl but sometimes I&amp;#39;m ok with it, basically. I&amp;#39;d rather have been born a boy but I don&amp;#39;t feel like I can do anything about it so I just try to ignore it. I can&amp;#39;t talk to anyone in my life about this because I&amp;#39;m scared of not being seen as normal. Sorry this is so long :p I just needed to rant.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(Feel free not to read it's pretty boring, but if you really want to get the basic idea read the last paragraph)\n\nI just wish I was born as a boy instead. I hate how feminine I am. I hate having wide hips and breasts and long hair and such a feminine name and such a high pitched voice. Sometimes I fall asleep hoping I'll somehow be a boy when I wake up (which is impossible, I know, but it helps me fall asleep). Going through puberty is so terrible (I'm currently a teenager). All of the things I hate about my body since I was 11 have gotten worse.  I can't ever imagine dating anyone because I'd have to be \"womanly\" or something in a relationship. I don't want to be called someone's \"girlfriend\". I already wear a lot of boy-ish looking clothing but it isn't enough. I don't like being called a girl or expected to act like a girl. It just doesn't feel like \"me\" if that makes sense.\n\nBut I'm really confused :P I always thought everyone felt like that sometimes. None of my friends seem to be this way though. They seem to be happy as girls. I mean... most of the time I just sort of ignore my gender. When I realize that I'm a girl it upsets me. How do they never feel like that??? Maybe they do but are just pretending they don't. Maybe everyone wants to be the opposite sex but just ignores it?\n\nActually, I guess sometimes I'm okay being a girl. I can go for months without even thinking about being a boy. I'll tolerate putting on makeup, dressing femininely, etc but there is usually a lingering feeling of \"this sucks. I hate being a girl\" that I can't shake. It's really confusing because during the times I feel fine being a girl I look at myself and I think \"I look great!\" Like when I'm wearing dresses and stuff. Like I enjoy how feminine I look but I'd still rather not be wearing them. It's as if I'd appreciate seeing a girl dressed like that (I'm pretty sure I'm a lesbian) but I don't want to be dressed like that. I guess this just means I'm a tomboy? \n\nI guess what I'm trying to say is that I hate being a girl and I wish I wasn't one, but I can tolerate being a girl. I'd never prefer being a girl but sometimes I'm ok with it, basically. I'd rather have been born a boy but I don't feel like I can do anything about it so I just try to ignore it. I can't talk to anyone in my life about this because I'm scared of not being seen as normal. Sorry this is so long :p I just needed to rant.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65slss", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "Throwaway17215", "saved": false, "mod_reports": [], "name": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65slss/i_really_hate_being_a_girl_and_i_really_need_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492419967.0, "url": "https://www.reddit.com/r/offmychest/comments/65slss/i_really_hate_being_a_girl_and_i_really_need_to/", "author_flair_text": null, "quarantine": false, "title": "I really hate being a girl and I really need to rant about it", "created_utc": 1492391167.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 20, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgda4r3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "frowattio", "parent_id": "t1_dgd5dym", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Deciding you want to go transgender would be a pretty serious move, it doesn't sound like you're ready for that by a long shot. You're you, just work on self acceptance. Teenage boys can be at a very different stage to girls their own age, and you're still growing. Take your time, listen to your feelings , and don't do anything for anyone but yourself, whether that's hooking up, deciding who you are, or whatever. We are complex and confusing creatures, and you're a unique, amazing person. Wishing you well on your journey. :)  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Deciding you want to go transgender would be a pretty serious move, it doesn&amp;#39;t sound like you&amp;#39;re ready for that by a long shot. You&amp;#39;re you, just work on self acceptance. Teenage boys can be at a very different stage to girls their own age, and you&amp;#39;re still growing. Take your time, listen to your feelings , and don&amp;#39;t do anything for anyone but yourself, whether that&amp;#39;s hooking up, deciding who you are, or whatever. We are complex and confusing creatures, and you&amp;#39;re a unique, amazing person. Wishing you well on your journey. :)  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgda4r3", "score_hidden": false, "stickied": false, "created": 1492446558.0, "created_utc": 1492417758.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgea3i1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Throwaway17215", "parent_id": "t1_dge6i77", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I don't care about gender stereotypes haha. I've never really cared about them. I don't think I'm transgender (I hope not because of my conservative town) but the problem is that I don't care if I'm girly or not. I really don't think I described it well in my post but I'd rather be a very feminine man than a very masculine woman, if that makes sense, most of the time. It's just really confusing haha! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t care about gender stereotypes haha. I&amp;#39;ve never really cared about them. I don&amp;#39;t think I&amp;#39;m transgender (I hope not because of my conservative town) but the problem is that I don&amp;#39;t care if I&amp;#39;m girly or not. I really don&amp;#39;t think I described it well in my post but I&amp;#39;d rather be a very feminine man than a very masculine woman, if that makes sense, most of the time. It&amp;#39;s just really confusing haha! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgea3i1", "score_hidden": false, "stickied": false, "created": 1492499081.0, "created_utc": 1492470281.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6i77", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rivka333", "parent_id": "t1_dgd5dym", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "It doesn't sound like you're transgender to me...it sounds like you have a somewhat androgyneous, rather than a girly personality. I'm the same way. I'm happy with the fact that I'm biologically a woman, but I could never do the girly thing.\n\nYou be you. Ignore gender stereotypes, ignore any feeling that you have to conform to gender stereotypes. You can be female without conforming to them, and as you get older, other people will become more accepting of your real personality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t sound like you&amp;#39;re transgender to me...it sounds like you have a somewhat androgyneous, rather than a girly personality. I&amp;#39;m the same way. I&amp;#39;m happy with the fact that I&amp;#39;m biologically a woman, but I could never do the girly thing.&lt;/p&gt;\n\n&lt;p&gt;You be you. Ignore gender stereotypes, ignore any feeling that you have to conform to gender stereotypes. You can be female without conforming to them, and as you get older, other people will become more accepting of your real personality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dge6i77", "score_hidden": false, "stickied": false, "created": 1492494471.0, "created_utc": 1492465671.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5dym", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Throwaway17215", "parent_id": "t1_dgd4lev", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "That's sort of relieving! Being transgender would be a hassle due to where I live, who I live with, etc. So this means that just because want to be a boy, it doesn't mean I should identify as one? That's good. I feel like I must say that I've never really tried to appeal to guys (if I'm reading this correctly) because I don't \"like\" them I couldn't care less if I was appealing to boys haha but this isn't very important. Thanks for the advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s sort of relieving! Being transgender would be a hassle due to where I live, who I live with, etc. So this means that just because want to be a boy, it doesn&amp;#39;t mean I should identify as one? That&amp;#39;s good. I feel like I must say that I&amp;#39;ve never really tried to appeal to guys (if I&amp;#39;m reading this correctly) because I don&amp;#39;t &amp;quot;like&amp;quot; them I couldn&amp;#39;t care less if I was appealing to boys haha but this isn&amp;#39;t very important. Thanks for the advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd5dym", "score_hidden": false, "stickied": false, "created": 1492434892.0, "created_utc": 1492406092.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4lev", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "frowattio", "parent_id": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Since the other posts so far have all made mention of being transgender , thought I'd add that the issues you're talking about don't necessarily mean you are .... You don't \"have\" to be a girlie girl. You can do things your way. Dress however suits you. Work on quality relationships rather than trying to appeal to guys. Enjoy the ride, make your own rules, you're the only you there is, so be good to yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since the other posts so far have all made mention of being transgender , thought I&amp;#39;d add that the issues you&amp;#39;re talking about don&amp;#39;t necessarily mean you are .... You don&amp;#39;t &amp;quot;have&amp;quot; to be a girlie girl. You can do things your way. Dress however suits you. Work on quality relationships rather than trying to appeal to guys. Enjoy the ride, make your own rules, you&amp;#39;re the only you there is, so be good to yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd4lev", "score_hidden": false, "stickied": false, "created": 1492433344.0, "created_utc": 1492404544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgd3tg4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vickylovesims", "parent_id": "t1_dgd3n3t", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I did for a long time, too! Thanks to the Internet I've realized that gender isn't as black and white as society makes it out to be and I'm not weird! Hopefully you'll get the same piece of mind by researching gender a bit more :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did for a long time, too! Thanks to the Internet I&amp;#39;ve realized that gender isn&amp;#39;t as black and white as society makes it out to be and I&amp;#39;m not weird! Hopefully you&amp;#39;ll get the same piece of mind by researching gender a bit more :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd3tg4", "score_hidden": false, "stickied": false, "created": 1492431963.0, "created_utc": 1492403163.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3n3t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Throwaway17215", "parent_id": "t1_dgd315l", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you for the kind words :) honestly I just thought I was weird haha. I didn't think anyone would understand it. I'll definitely take your advice as best as I can!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the kind words :) honestly I just thought I was weird haha. I didn&amp;#39;t think anyone would understand it. I&amp;#39;ll definitely take your advice as best as I can!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd3n3t", "score_hidden": false, "stickied": false, "created": 1492431668.0, "created_utc": 1492402868.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd315l", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "vickylovesims", "parent_id": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I agree with the other person in this thread who said that you might be trans and non-binary or agender. I just want to let you know that you aren't alone in feeling this way. I honestly could've written this post myself, besides feeling like a boy. I don't really feel like any gender, and being identified and perceived as female by others can sometimes make me uncomfortable. I felt very stifled by traditional gender roles and norms, too. \n\nWhat helped me feel comfortable enough to face the world as a girl was rejecting traditional gender roles and norms. I don't wear bras now because they were uncomfortable and made me more aware of my breasts (I mostly like to forget that my breasts are there now, and I dress in a way that de-emphasizes them). I keep a good mix of edgy, more \"masculine\" clothing and accessories and more \"feminine\" ones. Instead of forcing myself to wear the frilliest dresses I can find like my mother did, I wear simple black shift dresses with combat boots or loose babydoll dresses with edgy patterns like red and black plaid. I wear a lot of jogger pants and loose T-shirts with slip on shoes. Try experimenting with fashion and see if it makes you feel any better. Maybe even consider cutting your hair short and see if that helps. \n\nI totally understand why you don't feel comfortable coming out to the people around you - neither do I, honestly. But I've changed the things that I can that are within my control, and I feel a lot better because of it. I hope that you're able to find some things that work for you and make you feel better until you're in an accepting place and feel safe enough to come out xx ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with the other person in this thread who said that you might be trans and non-binary or agender. I just want to let you know that you aren&amp;#39;t alone in feeling this way. I honestly could&amp;#39;ve written this post myself, besides feeling like a boy. I don&amp;#39;t really feel like any gender, and being identified and perceived as female by others can sometimes make me uncomfortable. I felt very stifled by traditional gender roles and norms, too. &lt;/p&gt;\n\n&lt;p&gt;What helped me feel comfortable enough to face the world as a girl was rejecting traditional gender roles and norms. I don&amp;#39;t wear bras now because they were uncomfortable and made me more aware of my breasts (I mostly like to forget that my breasts are there now, and I dress in a way that de-emphasizes them). I keep a good mix of edgy, more &amp;quot;masculine&amp;quot; clothing and accessories and more &amp;quot;feminine&amp;quot; ones. Instead of forcing myself to wear the frilliest dresses I can find like my mother did, I wear simple black shift dresses with combat boots or loose babydoll dresses with edgy patterns like red and black plaid. I wear a lot of jogger pants and loose T-shirts with slip on shoes. Try experimenting with fashion and see if it makes you feel any better. Maybe even consider cutting your hair short and see if that helps. &lt;/p&gt;\n\n&lt;p&gt;I totally understand why you don&amp;#39;t feel comfortable coming out to the people around you - neither do I, honestly. But I&amp;#39;ve changed the things that I can that are within my control, and I feel a lot better because of it. I hope that you&amp;#39;re able to find some things that work for you and make you feel better until you&amp;#39;re in an accepting place and feel safe enough to come out xx &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd315l", "score_hidden": false, "stickied": false, "created": 1492430660.0, "created_utc": 1492401860.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgea8ka", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Throwaway17215", "parent_id": "t1_dgdg700", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Okay that's good to know! I hope this goes away, it's really difficult to deal with most of the time! It really helps to know that I won't have to deal this for the rest of my life :)\n\nEdit:grammar", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay that&amp;#39;s good to know! I hope this goes away, it&amp;#39;s really difficult to deal with most of the time! It really helps to know that I won&amp;#39;t have to deal this for the rest of my life :)&lt;/p&gt;\n\n&lt;p&gt;Edit:grammar&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgea8ka", "score_hidden": false, "stickied": false, "created": 1492499266.0, "created_utc": 1492470466.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdg700", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LibertarianPorcupine", "parent_id": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm not a fan of labels, so I won't suggest any as the other commenters have.  I'll just say that what you experience sounds normal to me.  I think some people go through phases of liking and disliking what gender they are, especially if they don't conform to the \"traditional\" expectations of that gender.\n\ntl;dr - no worries.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not a fan of labels, so I won&amp;#39;t suggest any as the other commenters have.  I&amp;#39;ll just say that what you experience sounds normal to me.  I think some people go through phases of liking and disliking what gender they are, especially if they don&amp;#39;t conform to the &amp;quot;traditional&amp;quot; expectations of that gender.&lt;/p&gt;\n\n&lt;p&gt;tl;dr - no worries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdg700", "score_hidden": false, "stickied": false, "created": 1492463038.0, "created_utc": 1492434238.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgcy34d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Throwaway17215", "parent_id": "t1_dgcx4l2", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I really, really wish I could take your advice and tell people that I don't feel like a girl most of the time, but I'm too scared. I live in a conservative small town so I don't think anyone would be very supportive. I'm sort of expected to be a girl because I was born as a girl, ya know? If I don't explain myself (just start acting like a boy over time), or tell people I'm a girl who doesn't feel like a girl, I'm sure I would be bullied a lot. \n\nEdit: some parts of this didn't make that much sense", "edited": 1492395978.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really, really wish I could take your advice and tell people that I don&amp;#39;t feel like a girl most of the time, but I&amp;#39;m too scared. I live in a conservative small town so I don&amp;#39;t think anyone would be very supportive. I&amp;#39;m sort of expected to be a girl because I was born as a girl, ya know? If I don&amp;#39;t explain myself (just start acting like a boy over time), or tell people I&amp;#39;m a girl who doesn&amp;#39;t feel like a girl, I&amp;#39;m sure I would be bullied a lot. &lt;/p&gt;\n\n&lt;p&gt;Edit: some parts of this didn&amp;#39;t make that much sense&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcy34d", "score_hidden": false, "stickied": false, "created": 1492423489.0, "created_utc": 1492394689.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcx4l2", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mikestorm", "parent_id": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I think limiting your scope to binary genders is frustrating you because you don't fit the mold of the one you're supposed to identify with.  It isn't necessarily just girl or boy and that's it.  Fuck labels. Just be yourself and don't feel compelled to explain yourself to anyone, especially while you're trying to figure things out.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think limiting your scope to binary genders is frustrating you because you don&amp;#39;t fit the mold of the one you&amp;#39;re supposed to identify with.  It isn&amp;#39;t necessarily just girl or boy and that&amp;#39;s it.  Fuck labels. Just be yourself and don&amp;#39;t feel compelled to explain yourself to anyone, especially while you&amp;#39;re trying to figure things out.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcx4l2", "score_hidden": false, "stickied": false, "created": 1492422150.0, "created_utc": 1492393350.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgdhm2q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vowels", "parent_id": "t1_dgd1c08", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "You might also like to check out r/ftm/ or r/genderqueer/ &lt;3 There's places for you in this world!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might also like to check out &lt;a href=\"/r/ftm/\"&gt;r/ftm/&lt;/a&gt; or &lt;a href=\"/r/genderqueer/\"&gt;r/genderqueer/&lt;/a&gt; &amp;lt;3 There&amp;#39;s places for you in this world!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdhm2q", "score_hidden": false, "stickied": false, "created": 1492465355.0, "created_utc": 1492436555.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd1c08", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Throwaway17215", "parent_id": "t1_dgcwz8z", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Oh wow I never thought it was anything more than me wishing to be a man :p I didn't know there were so many gender identities! I'll do some more research, thanks for the information! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh wow I never thought it was anything more than me wishing to be a man :p I didn&amp;#39;t know there were so many gender identities! I&amp;#39;ll do some more research, thanks for the information! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd1c08", "score_hidden": false, "stickied": false, "created": 1492428059.0, "created_utc": 1492399259.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwz8z", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "atalkingsharkiguess", "parent_id": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Honestly, it sounds like you're experiencing Dysphoria, and its very possible you are transgender, and that doesnt nessicarily mean you're a transmale, you could be Non-binary/agender like myself (there's times I absolutely hate being masculine or male myself )\n\nI dont know many trans reddit communities, but I'd check r/transgender. If you want more personal help, feel free to PM me and I can run any questions or concerns by some transmale friends of mine!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, it sounds like you&amp;#39;re experiencing Dysphoria, and its very possible you are transgender, and that doesnt nessicarily mean you&amp;#39;re a transmale, you could be Non-binary/agender like myself (there&amp;#39;s times I absolutely hate being masculine or male myself )&lt;/p&gt;\n\n&lt;p&gt;I dont know many trans reddit communities, but I&amp;#39;d check &lt;a href=\"/r/transgender\"&gt;r/transgender&lt;/a&gt;. If you want more personal help, feel free to PM me and I can run any questions or concerns by some transmale friends of mine!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgcwz8z", "score_hidden": false, "stickied": false, "created": 1492421947.0, "created_utc": 1492393147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgdb8re", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LanvinC9", "parent_id": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Maybe your gender identity is Demigirl? \n\nhttp://gender.wikia.com/wiki/Demigirl", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe your gender identity is Demigirl? &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://gender.wikia.com/wiki/Demigirl\"&gt;http://gender.wikia.com/wiki/Demigirl&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdb8re", "score_hidden": false, "stickied": false, "created": 1492450420.0, "created_utc": 1492421620.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgea515", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Throwaway17215", "parent_id": "t1_dge46wj", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Ikr. It's tough :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ikr. It&amp;#39;s tough :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgea515", "score_hidden": false, "stickied": false, "created": 1492499139.0, "created_utc": 1492470339.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge46wj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_Caed_", "parent_id": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Can we switch? \n\nReally, I hate my gender. I feel trapped like you do about 70% of the time, and then sometimes I'm \"fine\". I cope by wearing skinny jeans and making my video game avatars girls. But it's hard. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can we switch? &lt;/p&gt;\n\n&lt;p&gt;Really, I hate my gender. I feel trapped like you do about 70% of the time, and then sometimes I&amp;#39;m &amp;quot;fine&amp;quot;. I cope by wearing skinny jeans and making my video game avatars girls. But it&amp;#39;s hard. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dge46wj", "score_hidden": false, "stickied": false, "created": 1492491677.0, "created_utc": 1492462877.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65slss", "likes": null, "replies": "", "user_reports": [], "id": "dgeaamc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Throwaway17215", "parent_id": "t1_dgd0xw9", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Ok, I definitely will! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, I definitely will! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgeaamc", "score_hidden": false, "stickied": false, "created": 1492499341.0, "created_utc": 1492470541.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0xw9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThreeTreeCat", "parent_id": "t3_65slss", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "/r/genderqueer\n\nCome say hi, or just read the stuff others post. We don't bite. But there's a better way to live than just hating the body and the gender role you were born into.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/genderqueer\"&gt;/r/genderqueer&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Come say hi, or just read the stuff others post. We don&amp;#39;t bite. But there&amp;#39;s a better way to live than just hating the body and the gender role you were born into.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd0xw9", "score_hidden": false, "stickied": false, "created": 1492427492.0, "created_utc": 1492398692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]