[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was staying at my girlfriend&amp;#39;s house over spring break(and by that I mean I was staying at my girlfriend&amp;#39;s parents house), I was invited to join her extended family to celebrate passover with them in Santa Cruz (A 6 hour drive from the home) So we attended passover, stayed in motel rooms, and planned to return the next day. My girlfriend and I had a room, while her sister and parents stayed in another room. The next day comes, her parents and sister leave extra early and we sleep in (which isn&amp;#39;t a problem because my girlfriend and I have a car). We receive a text from her mom that her sister left her iPad in the motel room. My girlfriend and I then wait an hour at the motel front desk for someone to show up so we can get the key and get into the room for the ipad. &lt;/p&gt;\n\n&lt;p&gt;A little background about my girlfriend&amp;#39;s sister, she is over 200lb and over 6ft tall (And it&amp;#39;s crazy that she&amp;#39;s also ONLY 16). She is MUCH bigger and stronger than even her parents, and her parents fear her for it. As a result she could get away with murder, she steals alcohol, her dad&amp;#39;s medical marijuana, she sometimes just goes into my girlfriend&amp;#39;s room and destroys something like a stuffed animal. she has no respect for you (This is best explained by an example, if you begin to use a kitchen stove and than step away to persay get an ingredient. She will step right up to the stove and not leave until her own food is done, forcing you to wait to use the stove). Her parents are so afraid that they are convinced that she will KILL THEM IN THEIR SLEEP IF THEY ATTEMPT TO DISCIPLINE HER. Once her mom was arguing with her in her room, AND AT ONE POINT SHE JUST LIFTS HER MOM, CARRYS HER OUT, AND SLAMS THE DOOR ON HER. So she gets away with a lot and receives no punishment. \n(TL:DR My Girlfriends sister is a violent monster that her parents refuse to control out of fear for their lives) &lt;/p&gt;\n\n&lt;p&gt;On with the story, we get the ipad, and I decide to wrongly take revenge. I know that with Apple devices, if you put the password in wrong too many times, it will lock you out for a few minutes, with the duration getting longer with each failed attempt. I want to lockout the ipad for 5 hours, as part of what I believed to be a harmless prank. What ended up happening, is instead of increasing the duration of lock time, the ipad SUPERLOCKS itself, requiring you to connect to iTunes and format the memory. I should not have been messing with the ipad in the first place, but let it be known THAT I NEVER EVER INTENDED FOR IT TO BE SUPERLOCKED, I ONLY WANTED IT LOCKED FOR A FEW HOURS.  My girlfriend and I get home, leave the ipad on the kitchen table, and wait, We play PlayStation 2 in the living room to pass the time. At one point her sister STOMPS upstairs to her parents room and begins yelling. My girlfriend is than called up. I don&amp;#39;t know the exact dialogue, I do know that there came a point where her sister, fist clenched, lunges at my girlfriend. Her mom gets between the two of them just in time to get hit in the face. She receives no consequence for this and as a matter of fact this event is forgotten as everyone demand that my girlfriend fix it. So her mom, my girlfriend, and her sister come down the stairs to the living room where I am, my girlfriend opens iTunes on her laptop. The internet at the house is shit, iTunes is taking a long time to open, her sister suddenly bursts out &amp;quot;YOU KNOW MAYBE I SHOULD BREAK SOME OF HER SHIT&amp;quot; she proceeds to lunge at the PlayStation 2, which is sitting on a table in front of the couch. She RIPS the controllers from their sockets in the PlayStation 2. I jump to my feet, and get to the table, READY TO DEFEND MY PROPERTY WITH MY LIFE. She may be able to fuck with her parents but I refuse to take her abuse. She gets a fist ready and quickly says &amp;quot;IF YOU LAY A FINGER ON ME I&amp;#39;LL HAVE YOU SENT TO JAIL&amp;quot; (I&amp;#39;m 18 years old, an adult). I look her dead in the face and simply say &amp;quot;Start it&amp;quot;. At this point her mom gets between the two of us and yells &amp;quot;DAVID I NEED SOME HELP DOWN HERE&amp;quot; David is of course her husband and the father of my girlfriend and her sister. He begins to come downstairs but the excitement was over. What really makes me angry, is that then, her mom asks ME to sit back down, when I WASN&amp;#39;T THE ONE WHO WAS STARTING SHIT. When my girlfriend&amp;#39;s dad comes downstairs, her sister says to him that &amp;quot;He THREATENED ME and I NEVER want him to come back here&amp;quot; jeez it really ticks me off that she&amp;#39;s ordering him as if she owns the damn house. So her dad looks at me and says &amp;quot;Eric you&amp;#39;re going back home&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Honestly, it was my own actions that roped me into this harsh experience and I accept that. But tell me, does this not shed light ON A PROBLEM MUCH BIGGER THAN JUST AN IPAD BEING LOCKED. Is there nothing to be said about how this situation DIDNT EVER NEED TO GET VIOLENT. And when it all boils down, simply looking at the statement &amp;quot;I Got Kicked Out of my girlfriend&amp;#39;s house for locking an  iPad&amp;quot; is such a ridiculous statement that hopefully should never need apply to anyone else. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was staying at my girlfriend's house over spring break(and by that I mean I was staying at my girlfriend's parents house), I was invited to join her extended family to celebrate passover with them in Santa Cruz (A 6 hour drive from the home) So we attended passover, stayed in motel rooms, and planned to return the next day. My girlfriend and I had a room, while her sister and parents stayed in another room. The next day comes, her parents and sister leave extra early and we sleep in (which isn't a problem because my girlfriend and I have a car). We receive a text from her mom that her sister left her iPad in the motel room. My girlfriend and I then wait an hour at the motel front desk for someone to show up so we can get the key and get into the room for the ipad. \n\nA little background about my girlfriend's sister, she is over 200lb and over 6ft tall (And it's crazy that she's also ONLY 16). She is MUCH bigger and stronger than even her parents, and her parents fear her for it. As a result she could get away with murder, she steals alcohol, her dad's medical marijuana, she sometimes just goes into my girlfriend's room and destroys something like a stuffed animal. she has no respect for you (This is best explained by an example, if you begin to use a kitchen stove and than step away to persay get an ingredient. She will step right up to the stove and not leave until her own food is done, forcing you to wait to use the stove). Her parents are so afraid that they are convinced that she will KILL THEM IN THEIR SLEEP IF THEY ATTEMPT TO DISCIPLINE HER. Once her mom was arguing with her in her room, AND AT ONE POINT SHE JUST LIFTS HER MOM, CARRYS HER OUT, AND SLAMS THE DOOR ON HER. So she gets away with a lot and receives no punishment. \n(TL:DR My Girlfriends sister is a violent monster that her parents refuse to control out of fear for their lives) \n\nOn with the story, we get the ipad, and I decide to wrongly take revenge. I know that with Apple devices, if you put the password in wrong too many times, it will lock you out for a few minutes, with the duration getting longer with each failed attempt. I want to lockout the ipad for 5 hours, as part of what I believed to be a harmless prank. What ended up happening, is instead of increasing the duration of lock time, the ipad SUPERLOCKS itself, requiring you to connect to iTunes and format the memory. I should not have been messing with the ipad in the first place, but let it be known THAT I NEVER EVER INTENDED FOR IT TO BE SUPERLOCKED, I ONLY WANTED IT LOCKED FOR A FEW HOURS.  My girlfriend and I get home, leave the ipad on the kitchen table, and wait, We play PlayStation 2 in the living room to pass the time. At one point her sister STOMPS upstairs to her parents room and begins yelling. My girlfriend is than called up. I don't know the exact dialogue, I do know that there came a point where her sister, fist clenched, lunges at my girlfriend. Her mom gets between the two of them just in time to get hit in the face. She receives no consequence for this and as a matter of fact this event is forgotten as everyone demand that my girlfriend fix it. So her mom, my girlfriend, and her sister come down the stairs to the living room where I am, my girlfriend opens iTunes on her laptop. The internet at the house is shit, iTunes is taking a long time to open, her sister suddenly bursts out \"YOU KNOW MAYBE I SHOULD BREAK SOME OF HER SHIT\" she proceeds to lunge at the PlayStation 2, which is sitting on a table in front of the couch. She RIPS the controllers from their sockets in the PlayStation 2. I jump to my feet, and get to the table, READY TO DEFEND MY PROPERTY WITH MY LIFE. She may be able to fuck with her parents but I refuse to take her abuse. She gets a fist ready and quickly says \"IF YOU LAY A FINGER ON ME I'LL HAVE YOU SENT TO JAIL\" (I'm 18 years old, an adult). I look her dead in the face and simply say \"Start it\". At this point her mom gets between the two of us and yells \"DAVID I NEED SOME HELP DOWN HERE\" David is of course her husband and the father of my girlfriend and her sister. He begins to come downstairs but the excitement was over. What really makes me angry, is that then, her mom asks ME to sit back down, when I WASN'T THE ONE WHO WAS STARTING SHIT. When my girlfriend's dad comes downstairs, her sister says to him that \"He THREATENED ME and I NEVER want him to come back here\" jeez it really ticks me off that she's ordering him as if she owns the damn house. So her dad looks at me and says \"Eric you're going back home\". \n\nHonestly, it was my own actions that roped me into this harsh experience and I accept that. But tell me, does this not shed light ON A PROBLEM MUCH BIGGER THAN JUST AN IPAD BEING LOCKED. Is there nothing to be said about how this situation DIDNT EVER NEED TO GET VIOLENT. And when it all boils down, simply looking at the statement \"I Got Kicked Out of my girlfriend's house for locking an  iPad\" is such a ridiculous statement that hopefully should never need apply to anyone else. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65u62i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "broadcasterred", "saved": false, "mod_reports": [], "name": "t3_65u62i", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65u62i/i_got_kicked_out_of_my_girlfriends_house_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1492442448.0, "url": "https://www.reddit.com/r/offmychest/comments/65u62i/i_got_kicked_out_of_my_girlfriends_house_for/", "author_flair_text": null, "quarantine": false, "title": "I got kicked out of my girlfriend's house for locking an iPad", "created_utc": 1492413648.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65u62i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65u62i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65u62i", "likes": null, "replies": "", "user_reports": [], "id": "dgdb5ea", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sitting-in-the-dark", "parent_id": "t1_dgdb0zz", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I can understand where you're coming from. I hope everything works out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can understand where you&amp;#39;re coming from. I hope everything works out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdb5ea", "score_hidden": false, "stickied": false, "created": 1492450099.0, "created_utc": 1492421299.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdb0zz", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "vanessers9", "parent_id": "t1_dgd9y9v", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm his gf; believe me buddy, I hate them just as much as he does. We aren't planning on maintaining a hell of a lot of communication once we're outta here", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m his gf; believe me buddy, I hate them just as much as he does. We aren&amp;#39;t planning on maintaining a hell of a lot of communication once we&amp;#39;re outta here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdb0zz", "score_hidden": false, "stickied": false, "created": 1492449683.0, "created_utc": 1492420883.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65u62i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65u62i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65u62i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65u62i", "likes": null, "replies": "", "user_reports": [], "id": "dgdfujt", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "CrunchyHipster", "parent_id": "t1_dgdcdog", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm not trying to get down on her about her size. I'm just saying parents set the boundaries for how to act. Your parents let her get away with acting like that when she was smaller (presumably).  Now that she's big(ger than them) they're reaping what they've sown.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not trying to get down on her about her size. I&amp;#39;m just saying parents set the boundaries for how to act. Your parents let her get away with acting like that when she was smaller (presumably).  Now that she&amp;#39;s big(ger than them) they&amp;#39;re reaping what they&amp;#39;ve sown.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdfujt", "score_hidden": false, "stickied": false, "created": 1492462433.0, "created_utc": 1492433633.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdcdog", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "broadcasterred", "parent_id": "t1_dgdbf5d", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "GF: only reason he brought up how physically imposing she is was to emphasize how frightened my parents are of reprimanding her in any way. I couldn't care less what she looks like", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;GF: only reason he brought up how physically imposing she is was to emphasize how frightened my parents are of reprimanding her in any way. I couldn&amp;#39;t care less what she looks like&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdcdog", "score_hidden": false, "stickied": false, "created": 1492454201.0, "created_utc": 1492425401.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbf5d", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "CrunchyHipster", "parent_id": "t1_dgdamsh", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "As long as GF doesn't expect you to go back to their house or have her parents around again at any point in your future forever,  you're in the clear. \n\nPeople like her sister cannot handle real life, so don't expect her to be living independently away from her parents when she \"grows up\". \n\nAnd don't ever expect GFs parents to take your/GFs feelings into account. You and GF want to have only her parents over for dinner? HOW DARE YOU NOT INVITE THEIR SWEET CHILD. You don't want sister at the wedding?  FUCK YOU THEN WE WON'T GO UNLESS SISTER CAN COME! WHY WOULD YOU RIP OUR FAMILY APART?!?!#!@&amp;\n\nSister has learned she can get away with anything and it has nothing to do with her size. It's her parents enabling. It's never going to stop. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As long as GF doesn&amp;#39;t expect you to go back to their house or have her parents around again at any point in your future forever,  you&amp;#39;re in the clear. &lt;/p&gt;\n\n&lt;p&gt;People like her sister cannot handle real life, so don&amp;#39;t expect her to be living independently away from her parents when she &amp;quot;grows up&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;And don&amp;#39;t ever expect GFs parents to take your/GFs feelings into account. You and GF want to have only her parents over for dinner? HOW DARE YOU NOT INVITE THEIR SWEET CHILD. You don&amp;#39;t want sister at the wedding?  FUCK YOU THEN WE WON&amp;#39;T GO UNLESS SISTER CAN COME! WHY WOULD YOU RIP OUR FAMILY APART?!?!#!@&amp;amp;&lt;/p&gt;\n\n&lt;p&gt;Sister has learned she can get away with anything and it has nothing to do with her size. It&amp;#39;s her parents enabling. It&amp;#39;s never going to stop. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdbf5d", "score_hidden": false, "stickied": false, "created": 1492451035.0, "created_utc": 1492422235.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65u62i", "likes": null, "replies": "", "user_reports": [], "id": "dgdb577", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sitting-in-the-dark", "parent_id": "t1_dgdamsh", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Sorry to hear that man, good on you for staying strong!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to hear that man, good on you for staying strong!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdb577", "score_hidden": false, "stickied": false, "created": 1492450079.0, "created_utc": 1492421279.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdamsh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "broadcasterred", "parent_id": "t1_dgd9y9v", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I don't feel like I'll be stuck with it, I feel like when my girlfriend and I get money and an apartment, when we can rely on our own resources, we'll be able to simply ignore them, forget them, and live our lives. For now, we make do. My girlfriend hates her sister and wishes that she didn't exist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t feel like I&amp;#39;ll be stuck with it, I feel like when my girlfriend and I get money and an apartment, when we can rely on our own resources, we&amp;#39;ll be able to simply ignore them, forget them, and live our lives. For now, we make do. My girlfriend hates her sister and wishes that she didn&amp;#39;t exist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdamsh", "score_hidden": false, "stickied": false, "created": 1492448297.0, "created_utc": 1492419497.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9y9v", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Sitting-in-the-dark", "parent_id": "t3_65u62i", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Dude you've gotta drop that girl like a hot potato. Red flags at every turn. Do you really want to be stuck with her family drama for the rest of your life? Yikes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude you&amp;#39;ve gotta drop that girl like a hot potato. Red flags at every turn. Do you really want to be stuck with her family drama for the rest of your life? Yikes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgd9y9v", "score_hidden": false, "stickied": false, "created": 1492445961.0, "created_utc": 1492417161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}]