[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "offmychest", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A year and a half ago, I felt like I needed a change in my life, so I applied to be a flight attendant. This has been the most incredible job I could ever dream for! I get great medical coverage, I meet people from all over the world, and I get to travel everywhere. I live in the US and I&amp;#39;ve taken day trips to Europe just to have dinner or go shopping.&lt;/p&gt;\n\n&lt;p&gt;Up until last week, almost every single one of my flights has gone smoothly (at least from a customer service aspect). Yes, there have been mechanical delays, weather cancellations, medical situations, etc., but passengers have always come on the plane and been decent. I go out of my way to offer great customer service. I take pride in my work and encourage my co-workers to do the same. I recognize people paid a lot of money to purchase a ticket on my flight and I try to treat people as if they were guests in my own home (if I actually had one). I also take pride in the fact I&amp;#39;ve never even considered kicking someone off my flights. I&amp;#39;ve never had any security issues to even warrant the idea, so I don&amp;#39;t even consider it an option unless I feel threatened.&lt;/p&gt;\n\n&lt;p&gt;Over the past year and a half I&amp;#39;ve learned a lot about how the airline industry works and there is still A LOT for me to learn. I&amp;#39;ve given up almost everything for this job. I gave up my a lifestyle were I could live on my own, eat out whenever I wanted, go out for drinks every single night, and take a week of vacation and plan a trip every other month. I currently sleep on my friend&amp;#39;s couch when I am between trips. I&amp;#39;ve slept in my car many nights just because I get in late from a flight and don&amp;#39;t want to inconvenience my friend to let me in. I beg for 3-4 day trips because I&amp;#39;ll have to have a layover which means a bed and a warm shower. I still love my job though and wake up every morning thankful to have it. &lt;/p&gt;\n\n&lt;p&gt;Since last week though, the job has been much more difficult. Look, I was just as horrified about Dr. Dao as everyone else and think there could have been a much better solution to the situation. It wasn&amp;#39;t personally my fault though, nor any of the other flight attendants I work with. Please, please, please stop taking it out on us. Between myself and others, people are taking it upon themselves to take upgraded seats and threatening to sue me if I even ask them to move to their originally assigned seat. People are demanding free drinks and cursing at us because their flight got delayed because of a storm. People walk down the aisle and push us out of the way while we are trying to do a beverage service just to talk with their friend. &amp;quot;What are you going to do? Drag me off the plane too?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I know traveling is difficult. TSA lines are ridiculous, delays and cancellations are horrible, and all you want to do is get on the plane and go home or vacation or wherever. And yes, you totally do get some bad egg flight attendants. That&amp;#39;s what happens when you have thousands of employees in a company, but really, most of us are good and nice. Please don&amp;#39;t use recent events to do whatever you want on the plane. I will gladly do whatever I can to make your flight comfortable, but riding the hate train (or plane) is not the way to get a free drink. Bring me a chocolate bar though and we&amp;#39;ll talk :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A year and a half ago, I felt like I needed a change in my life, so I applied to be a flight attendant. This has been the most incredible job I could ever dream for! I get great medical coverage, I meet people from all over the world, and I get to travel everywhere. I live in the US and I've taken day trips to Europe just to have dinner or go shopping.\n\nUp until last week, almost every single one of my flights has gone smoothly (at least from a customer service aspect). Yes, there have been mechanical delays, weather cancellations, medical situations, etc., but passengers have always come on the plane and been decent. I go out of my way to offer great customer service. I take pride in my work and encourage my co-workers to do the same. I recognize people paid a lot of money to purchase a ticket on my flight and I try to treat people as if they were guests in my own home (if I actually had one). I also take pride in the fact I've never even considered kicking someone off my flights. I've never had any security issues to even warrant the idea, so I don't even consider it an option unless I feel threatened.\n\nOver the past year and a half I've learned a lot about how the airline industry works and there is still A LOT for me to learn. I've given up almost everything for this job. I gave up my a lifestyle were I could live on my own, eat out whenever I wanted, go out for drinks every single night, and take a week of vacation and plan a trip every other month. I currently sleep on my friend's couch when I am between trips. I've slept in my car many nights just because I get in late from a flight and don't want to inconvenience my friend to let me in. I beg for 3-4 day trips because I'll have to have a layover which means a bed and a warm shower. I still love my job though and wake up every morning thankful to have it. \n\nSince last week though, the job has been much more difficult. Look, I was just as horrified about Dr. Dao as everyone else and think there could have been a much better solution to the situation. It wasn't personally my fault though, nor any of the other flight attendants I work with. Please, please, please stop taking it out on us. Between myself and others, people are taking it upon themselves to take upgraded seats and threatening to sue me if I even ask them to move to their originally assigned seat. People are demanding free drinks and cursing at us because their flight got delayed because of a storm. People walk down the aisle and push us out of the way while we are trying to do a beverage service just to talk with their friend. \"What are you going to do? Drag me off the plane too?\"\n\nI know traveling is difficult. TSA lines are ridiculous, delays and cancellations are horrible, and all you want to do is get on the plane and go home or vacation or wherever. And yes, you totally do get some bad egg flight attendants. That's what happens when you have thousands of employees in a company, but really, most of us are good and nice. Please don't use recent events to do whatever you want on the plane. I will gladly do whatever I can to make your flight comfortable, but riding the hate train (or plane) is not the way to get a free drink. Bring me a chocolate bar though and we'll talk :)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65w5i5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 26, "report_reasons": null, "author": "Fathrowaway102010", "saved": false, "mod_reports": [], "name": "t3_65w5i5", "subreddit_name_prefixed": "r/offmychest", "approved_by": null, "over_18": false, "domain": "self.offmychest", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ranw", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/offmychest/comments/65w5i5/my_dream_job_has_become_a_nightmare/", "num_reports": null, "locked": false, "stickied": false, "created": 1492471044.0, "url": "https://www.reddit.com/r/offmychest/comments/65w5i5/my_dream_job_has_become_a_nightmare/", "author_flair_text": null, "quarantine": false, "title": "My Dream Job Has Become A Nightmare", "created_utc": 1492442244.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65w5i5", "likes": null, "replies": "", "user_reports": [], "id": "dgdnv1g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Stuntedatpuberty", "parent_id": "t3_65w5i5", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I'm sorry to hear about your recent experiences. My sister is a flight attendant too and is based out of New York. She has rented an apartment with a few others and uses that when in New York. But, she lives in a different territory. \n\nThe incident with Dr. Dao did make the airlines look bad but not so much flight attendants as the CEO and management. \n\nHang in there. People do appreciate your work. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to hear about your recent experiences. My sister is a flight attendant too and is based out of New York. She has rented an apartment with a few others and uses that when in New York. But, she lives in a different territory. &lt;/p&gt;\n\n&lt;p&gt;The incident with Dr. Dao did make the airlines look bad but not so much flight attendants as the CEO and management. &lt;/p&gt;\n\n&lt;p&gt;Hang in there. People do appreciate your work. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdnv1g", "score_hidden": false, "stickied": false, "created": 1492473382.0, "created_utc": 1492444582.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65w5i5", "likes": null, "replies": "", "user_reports": [], "id": "dgdppwz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "mashuto", "parent_id": "t3_65w5i5", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I always feel bad for *most* of the airline employees when things are not going well. Because the employees are usually not the ones making the decisions that impact the customers, yet are the ones that have to directly interact with them.\n\nSomewhat unrelated, but I had a bad experience where the airline put my luggage on the wrong plane on the last leg of a 30 hour trip. They were incidentally also dealing with some weather issues at the time and put other peoples luggage on planes where there flights were cancelled or something and they couldnt get their luggage back.\n\nEveryone was being so rude to this woman who obviously had zero control over the situation and was obviously not the one who made any of those decisions. So when I finally got up to speak to her I was just polite, and while the resolution of the situation was not ideal, I just had to wait for them to deliver it the next day, she was polite back and helped me get sorted very quickly.\n\nSo I always try to be polite, because I know 99% of the time the person I am dealing with is not responsible for whatever issues I may be having with the airlines.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always feel bad for &lt;em&gt;most&lt;/em&gt; of the airline employees when things are not going well. Because the employees are usually not the ones making the decisions that impact the customers, yet are the ones that have to directly interact with them.&lt;/p&gt;\n\n&lt;p&gt;Somewhat unrelated, but I had a bad experience where the airline put my luggage on the wrong plane on the last leg of a 30 hour trip. They were incidentally also dealing with some weather issues at the time and put other peoples luggage on planes where there flights were cancelled or something and they couldnt get their luggage back.&lt;/p&gt;\n\n&lt;p&gt;Everyone was being so rude to this woman who obviously had zero control over the situation and was obviously not the one who made any of those decisions. So when I finally got up to speak to her I was just polite, and while the resolution of the situation was not ideal, I just had to wait for them to deliver it the next day, she was polite back and helped me get sorted very quickly.&lt;/p&gt;\n\n&lt;p&gt;So I always try to be polite, because I know 99% of the time the person I am dealing with is not responsible for whatever issues I may be having with the airlines.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdppwz", "score_hidden": false, "stickied": false, "created": 1492475483.0, "created_utc": 1492446683.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65w5i5", "likes": null, "replies": "", "user_reports": [], "id": "dgdwgp8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Fathrowaway102010", "parent_id": "t3_65w5i5", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Thank you all for your kind words. There has been a ton of support from positive passengers as well which is very helpful. And it's true, most employees do really want to get you and your luggage to your proper destinations ahead of schedule. We actually get in trouble if we don't. Unfortunately, luggage for instance, while you may just have to run from one plane to another, the luggage gets sorted quickly and if you have a short transfer, it may not go. I know they've taken big steps in trying to avoid screw ups. I think one of the biggest things is that people leave their luggage tags on from previous flights and it can screw a person up if you're sorting 250 passenger's bags and you see an old luggage tag. I know if I were a baggage handler, I would probably screw up multiple bags. Does anyone have any other questions about the airline industry I can try to answer?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you all for your kind words. There has been a ton of support from positive passengers as well which is very helpful. And it&amp;#39;s true, most employees do really want to get you and your luggage to your proper destinations ahead of schedule. We actually get in trouble if we don&amp;#39;t. Unfortunately, luggage for instance, while you may just have to run from one plane to another, the luggage gets sorted quickly and if you have a short transfer, it may not go. I know they&amp;#39;ve taken big steps in trying to avoid screw ups. I think one of the biggest things is that people leave their luggage tags on from previous flights and it can screw a person up if you&amp;#39;re sorting 250 passenger&amp;#39;s bags and you see an old luggage tag. I know if I were a baggage handler, I would probably screw up multiple bags. Does anyone have any other questions about the airline industry I can try to answer?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdwgp8", "score_hidden": false, "stickied": false, "created": 1492482969.0, "created_utc": 1492454169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65w5i5", "likes": null, "replies": "", "user_reports": [], "id": "dgdswn5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_isthisnetflix_", "parent_id": "t3_65w5i5", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "I saw flight attendant and I KNEW it was going to be about Dr.Dao lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I saw flight attendant and I KNEW it was going to be about Dr.Dao lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdswn5", "score_hidden": false, "stickied": false, "created": 1492479025.0, "created_utc": 1492450225.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ranw", "removal_reason": null, "link_id": "t3_65w5i5", "likes": null, "replies": "", "user_reports": [], "id": "dgdux2w", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "CNash85", "parent_id": "t3_65w5i5", "subreddit_name_prefixed": "r/offmychest", "controversiality": 0, "body": "Don't lose heart. People will forget about that incident soon enough and things will get back to normal. This too shall pass.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t lose heart. People will forget about that incident soon enough and things will get back to normal. This too shall pass.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "offmychest", "name": "t1_dgdux2w", "score_hidden": false, "stickied": false, "created": 1492481233.0, "created_utc": 1492452433.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]