[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "breakingbad", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whenever I read through comments on Breaking Bad clips, it&amp;#39;s always filled with people saying stuff that implies that Walt is gone and that only &amp;quot;Heisenberg&amp;quot; remains, or that Heisenberg and Walt are two separate entities that live in the same body. The way I always saw it, &amp;quot;Heisenberg&amp;quot; is just a false identity Walt makes for himself, in order to do the things he does. There&amp;#39;s not really a true Heisenberg, just the character Walt makes for himself to fill. &lt;/p&gt;\n\n&lt;p&gt;Also, I thought by the end of the series, that Walt had grown out of his &amp;quot;Heisenberg&amp;quot; persona, not that he had been fully immersed in it. Gretchen describes this in Granite State, but in doing the things he does in the finale (apologizing to Skyler, no longer caring about his money) I felt he was redeeming himself from &amp;quot;Heisenberg.&amp;quot; Thoughts? Am I way off the mark?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Whenever I read through comments on Breaking Bad clips, it's always filled with people saying stuff that implies that Walt is gone and that only \"Heisenberg\" remains, or that Heisenberg and Walt are two separate entities that live in the same body. The way I always saw it, \"Heisenberg\" is just a false identity Walt makes for himself, in order to do the things he does. There's not really a true Heisenberg, just the character Walt makes for himself to fill. \n\nAlso, I thought by the end of the series, that Walt had grown out of his \"Heisenberg\" persona, not that he had been fully immersed in it. Gretchen describes this in Granite State, but in doing the things he does in the finale (apologizing to Skyler, no longer caring about his money) I felt he was redeeming himself from \"Heisenberg.\" Thoughts? Am I way off the mark?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65forb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "pseudomucho", "saved": false, "mod_reports": [], "name": "t3_65forb", "subreddit_name_prefixed": "r/breakingbad", "approved_by": null, "over_18": false, "domain": "self.breakingbad", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2rlw4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/breakingbad/comments/65forb/unpopular_opinion_about_heisenberg/", "num_reports": null, "locked": false, "stickied": false, "created": 1492237825.0, "url": "https://www.reddit.com/r/breakingbad/comments/65forb/unpopular_opinion_about_heisenberg/", "author_flair_text": null, "quarantine": false, "title": "Unpopular opinion about \"Heisenberg\"", "created_utc": 1492209025.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rlw4", "removal_reason": null, "link_id": "t3_65forb", "likes": null, "replies": "", "user_reports": [], "id": "dg9ystm", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Majorlazzer", "parent_id": "t3_65forb", "subreddit_name_prefixed": "r/breakingbad", "controversiality": 0, "body": "I think Heisenberg was just the way Walt would convince himself to do things that were out of his comfort zone. By the end of the series killing and all the other Heisenberg stuff are no longer things he's uncomfortable with doing so although by the end he's not technically in his Heisenberg persona it had essentially taken over him ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think Heisenberg was just the way Walt would convince himself to do things that were out of his comfort zone. By the end of the series killing and all the other Heisenberg stuff are no longer things he&amp;#39;s uncomfortable with doing so although by the end he&amp;#39;s not technically in his Heisenberg persona it had essentially taken over him &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "breakingbad", "name": "t1_dg9ystm", "score_hidden": false, "stickied": false, "created": 1492242847.0, "created_utc": 1492214047.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rlw4", "removal_reason": null, "link_id": "t3_65forb", "likes": null, "replies": "", "user_reports": [], "id": "dgaakg1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Deb_LA", "parent_id": "t3_65forb", "subreddit_name_prefixed": "r/breakingbad", "controversiality": 0, "body": "Apologies for the long read… grab a glass of wine.\n\nBeing the name of the show is... Breaking Bad... to corrupt, go rogue, violently against convention and authority, I'd say it's safe to say there's still the element of self-awareness to it.\n\nThat ultimately is a choice. Otherwise there'd be no need to create an intentional persona named Heisenberg. That act alone says, \"by taking off this black hat and dark clothes I can resume my otherwise normal life and good name with this deception.\" IE, it's just a way to justify his bad behavior and be able to live with himself by compartmentalizing. He wants - and has it - both ways, without consequences. He mostly achieved that, with others suffering for his actions, but not himself.\n\nRecall too: the eponymously named German physicist whose breakthrough scientific papers and discoveries garnered the Nobel prize - the science and his work colluded with the third reich for nuclear bomb development in WWII to ~~annihilate humanity~~ create an empire for the master race. \n\nEven nature corrupts: healthy cells into cancer [cough]; and Walt's science class explanation of chirality to set up the show’s premise.\n\nThe point: no pure, rational person, process, thought or deed is immune to corruption. And that it's an insidious process that takes over but is consciously justified as the ends justify the means to \"survive.” \n\nIn Walt's case: \"I did it for ~~my family~~ me.” His personification pretty much sums up how not just individuals, but businesses, countries, governments and world leaders operate when they justify “breaking bad\" - to protect and defend ~~good citizens and families~~ their self-interests - and do so with the trumped up pretext of threat of attack.\n\nBottom line: Walt's Heisenberg persona was always a choice, made every step of the way - with upside down, compartmentalized, dangerously chiral, rationalization.\n\nAnd we're not the rational creatures we think we are.\n\nFin", "edited": 1492236842.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Apologies for the long read… grab a glass of wine.&lt;/p&gt;\n\n&lt;p&gt;Being the name of the show is... Breaking Bad... to corrupt, go rogue, violently against convention and authority, I&amp;#39;d say it&amp;#39;s safe to say there&amp;#39;s still the element of self-awareness to it.&lt;/p&gt;\n\n&lt;p&gt;That ultimately is a choice. Otherwise there&amp;#39;d be no need to create an intentional persona named Heisenberg. That act alone says, &amp;quot;by taking off this black hat and dark clothes I can resume my otherwise normal life and good name with this deception.&amp;quot; IE, it&amp;#39;s just a way to justify his bad behavior and be able to live with himself by compartmentalizing. He wants - and has it - both ways, without consequences. He mostly achieved that, with others suffering for his actions, but not himself.&lt;/p&gt;\n\n&lt;p&gt;Recall too: the eponymously named German physicist whose breakthrough scientific papers and discoveries garnered the Nobel prize - the science and his work colluded with the third reich for nuclear bomb development in WWII to &lt;del&gt;annihilate humanity&lt;/del&gt; create an empire for the master race. &lt;/p&gt;\n\n&lt;p&gt;Even nature corrupts: healthy cells into cancer [cough]; and Walt&amp;#39;s science class explanation of chirality to set up the show’s premise.&lt;/p&gt;\n\n&lt;p&gt;The point: no pure, rational person, process, thought or deed is immune to corruption. And that it&amp;#39;s an insidious process that takes over but is consciously justified as the ends justify the means to &amp;quot;survive.” &lt;/p&gt;\n\n&lt;p&gt;In Walt&amp;#39;s case: &amp;quot;I did it for &lt;del&gt;my family&lt;/del&gt; me.” His personification pretty much sums up how not just individuals, but businesses, countries, governments and world leaders operate when they justify “breaking bad&amp;quot; - to protect and defend &lt;del&gt;good citizens and families&lt;/del&gt; their self-interests - and do so with the trumped up pretext of threat of attack.&lt;/p&gt;\n\n&lt;p&gt;Bottom line: Walt&amp;#39;s Heisenberg persona was always a choice, made every step of the way - with upside down, compartmentalized, dangerously chiral, rationalization.&lt;/p&gt;\n\n&lt;p&gt;And we&amp;#39;re not the rational creatures we think we are.&lt;/p&gt;\n\n&lt;p&gt;Fin&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "breakingbad", "name": "t1_dgaakg1", "score_hidden": false, "stickied": false, "created": 1492260053.0, "created_utc": 1492231253.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2rlw4", "removal_reason": null, "link_id": "t3_65forb", "likes": null, "replies": "", "user_reports": [], "id": "dgazuk4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tempromatic", "parent_id": "t3_65forb", "subreddit_name_prefixed": "r/breakingbad", "controversiality": 0, "body": "I'll take it a step further, Heisenberg is just a name he gave to not have his real name floating around in criminal circles. There's just Walt.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll take it a step further, Heisenberg is just a name he gave to not have his real name floating around in criminal circles. There&amp;#39;s just Walt.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "breakingbad", "name": "t1_dgazuk4", "score_hidden": false, "stickied": false, "created": 1492310390.0, "created_utc": 1492281590.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]