[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "web_design", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen a lot of posts lately asking questions about how to deal with bad clients. I just want to give my advice from working with clients for almost 20 years. &lt;/p&gt;\n\n&lt;p&gt;A lot of the problems that I&amp;#39;m seeing (but not all) stem from the initial meeting with the client. (Hopefully, every project starts with an initial meeting.) Before you ever give a quote or sign a contract, meet with the client for an hour or two and talk with them about their business, current website, and what they want to see. Here are some good starter questions:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;What do you like about your website?&lt;/li&gt;\n&lt;li&gt;Tell me two or three things you want users to do on your site before they leave.&lt;/li&gt;\n&lt;li&gt;What are some adjectives to describe the design style you&amp;#39;re looking for?&lt;/li&gt;\n&lt;li&gt;Can you tell me some sites that you like? Why do you like them?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;You should also be asking questions that will help you figure out the technical specs for the site. Do they need a CMS? What sorts of payment gateways or carts are needed? What forms do they need? &lt;/p&gt;\n\n&lt;p&gt;It is vital as a designer that you learn to interpret what the client wants. You have to learn how to speak to them using language he/she can understand and then interpret that into technical knowledge of how to get the site to that place. Does the client need to know the technical term? No. It&amp;#39;s your job to hear &amp;quot;big photo on the front page&amp;quot; and interpret that as a hero image. Then instruct them on the proper terms. &amp;quot;Oh, yes, like this? [show them a hero image]. That&amp;#39;s called a hero section or hero image. Do you want to be able to change that easily?&amp;quot; If they describe something and you don&amp;#39;t understand, then have them show you an example. Clarity is the key. Clearly talk about yourself and about the client&amp;#39;s vision.&lt;/p&gt;\n\n&lt;p&gt;At the end of the first meeting, you should be able to come up with a proposal outlining the scope, look, and feel of the website before you even sign the contract. The proposal gives the client the design direction, technical specs, cost, and time. That is the working document with the client until you get to a contract.&lt;/p&gt;\n\n&lt;p&gt;This proposal/discovery document should be ok&amp;#39;d by the client and that can be the basis for the contract. The contract should cover what happens during the agreed upon timeframe for the work, what happens with the work once it&amp;#39;s finished, your responsibility as the designer, the client&amp;#39;s responsibilities (and those should be clearly outlined), and how to handle contingencies (over time, over budget, sickness, vacation, etc.). &lt;/p&gt;\n\n&lt;p&gt;Lay out the expectations to the client. You are partners. You are not just the client&amp;#39;s &amp;quot;hands.&amp;quot; You are a professional. You are paid to do something specific. Do that thing. Find out if the client wants you to do your thing or is looking for something you can&amp;#39;t or aren&amp;#39;t willing to do. If they don&amp;#39;t feel like they respect you in that way, politely let them know that you are not the designer they are looking for. &lt;/p&gt;\n\n&lt;p&gt;At the end of every project, evaluate the project from the beginning. If it was the kind of client you don&amp;#39;t want to work with, think through any warning signs you saw in the beginning, before you even started the work. Either come up with ways to direct those kinds of clients or learn how to let them go before entering into a contractual relationship with them.&lt;/p&gt;\n\n&lt;p&gt;In the end, you are a builder--a contractor. You are setting out to remodel or rebuild. The person hiring you doesn&amp;#39;t know how to do that. You have to teach, guide, instruct, and move the client to a better solution, not your own personal style or preferences. It&amp;#39;s not good enough to say I don&amp;#39;t like this. Show yourself to be an expert. Use testing, use articles from trusted sources. Work around a glaring problem like, &amp;quot;Can we make the logo bigger?&amp;quot; Provide some mockups. If you find that these sorts of revisions are taking up too much time and you&amp;#39;re not getting paid enough, make provision for that in the contract. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t like &amp;quot;nickel and dime&amp;quot; clients? Raise your rates. It will get rid of them. It&amp;#39;s almost always the cheap clients who do that. Learn how to spot a cheap client. Learn how to let them know courteously that your services just aren&amp;#39;t right and let them go. There are plenty of people who respect what you do and will let you free to design as long as you work with them on the direction you&amp;#39;re going.&lt;/p&gt;\n\n&lt;p&gt;This is especially important for young designers/developers and those just starting to interact with clients. Be courteously bold. Be confident in your skills and thoughts. Have a process in place &lt;em&gt;before&lt;/em&gt; you meet clients. Guide the clients through an area they know nothing about. They will respect that and will treat you better in the end.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've seen a lot of posts lately asking questions about how to deal with bad clients. I just want to give my advice from working with clients for almost 20 years. \n\nA lot of the problems that I'm seeing (but not all) stem from the initial meeting with the client. (Hopefully, every project starts with an initial meeting.) Before you ever give a quote or sign a contract, meet with the client for an hour or two and talk with them about their business, current website, and what they want to see. Here are some good starter questions:\n\n- What do you like about your website?\n- Tell me two or three things you want users to do on your site before they leave.\n- What are some adjectives to describe the design style you're looking for?\n- Can you tell me some sites that you like? Why do you like them?\n\nYou should also be asking questions that will help you figure out the technical specs for the site. Do they need a CMS? What sorts of payment gateways or carts are needed? What forms do they need? \n\nIt is vital as a designer that you learn to interpret what the client wants. You have to learn how to speak to them using language he/she can understand and then interpret that into technical knowledge of how to get the site to that place. Does the client need to know the technical term? No. It's your job to hear \"big photo on the front page\" and interpret that as a hero image. Then instruct them on the proper terms. \"Oh, yes, like this? [show them a hero image]. That's called a hero section or hero image. Do you want to be able to change that easily?\" If they describe something and you don't understand, then have them show you an example. Clarity is the key. Clearly talk about yourself and about the client's vision.\n\nAt the end of the first meeting, you should be able to come up with a proposal outlining the scope, look, and feel of the website before you even sign the contract. The proposal gives the client the design direction, technical specs, cost, and time. That is the working document with the client until you get to a contract.\n\nThis proposal/discovery document should be ok'd by the client and that can be the basis for the contract. The contract should cover what happens during the agreed upon timeframe for the work, what happens with the work once it's finished, your responsibility as the designer, the client's responsibilities (and those should be clearly outlined), and how to handle contingencies (over time, over budget, sickness, vacation, etc.). \n\nLay out the expectations to the client. You are partners. You are not just the client's \"hands.\" You are a professional. You are paid to do something specific. Do that thing. Find out if the client wants you to do your thing or is looking for something you can't or aren't willing to do. If they don't feel like they respect you in that way, politely let them know that you are not the designer they are looking for. \n\nAt the end of every project, evaluate the project from the beginning. If it was the kind of client you don't want to work with, think through any warning signs you saw in the beginning, before you even started the work. Either come up with ways to direct those kinds of clients or learn how to let them go before entering into a contractual relationship with them.\n\nIn the end, you are a builder--a contractor. You are setting out to remodel or rebuild. The person hiring you doesn't know how to do that. You have to teach, guide, instruct, and move the client to a better solution, not your own personal style or preferences. It's not good enough to say I don't like this. Show yourself to be an expert. Use testing, use articles from trusted sources. Work around a glaring problem like, \"Can we make the logo bigger?\" Provide some mockups. If you find that these sorts of revisions are taking up too much time and you're not getting paid enough, make provision for that in the contract. \n\nDon't like \"nickel and dime\" clients? Raise your rates. It will get rid of them. It's almost always the cheap clients who do that. Learn how to spot a cheap client. Learn how to let them know courteously that your services just aren't right and let them go. There are plenty of people who respect what you do and will let you free to design as long as you work with them on the direction you're going.\n\nThis is especially important for young designers/developers and those just starting to interact with clients. Be courteously bold. Be confident in your skills and thoughts. Have a process in place *before* you meet clients. Guide the clients through an area they know nothing about. They will respect that and will treat you better in the end.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vdyf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 171, "report_reasons": null, "author": "brianhaferkamp", "saved": false, "mod_reports": [], "name": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "approved_by": null, "over_18": false, "domain": "self.web_design", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh1m", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/web_design/comments/65vdyf/dealing_with_web_design_clients/", "num_reports": null, "locked": false, "stickied": false, "created": 1492462728.0, "url": "https://www.reddit.com/r/web_design/comments/65vdyf/dealing_with_web_design_clients/", "author_flair_text": null, "quarantine": false, "title": "Dealing with Web Design Clients", "created_utc": 1492433928.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 32, "visited": false, "subreddit_type": "public", "ups": 171}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgdjldl", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "brianhaferkamp", "parent_id": "t1_dgdj97z", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Thanks. I like this:\n\n\"...in reality the proposal should be just a physical manifestation of things you've already discussed and agreed-to verbally with the client.\"\n\nSo true.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. I like this:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;...in reality the proposal should be just a physical manifestation of things you&amp;#39;ve already discussed and agreed-to verbally with the client.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So true.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdjldl", "score_hidden": false, "stickied": false, "created": 1492468195.0, "created_utc": 1492439395.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdj97z", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "Squagem", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "&gt; This proposal/discovery document should be ok'd by the client and that can be the basis for the contract. \n\nWanted to elaborate on this.\n\nTry not to let your proposal do the selling for you.  Talk numbers **early and often** with your clients (I usually talk budget in the first 5 minutes of the call).\n\nWhy?  Your proposal can do very little to convince your client that they're making the right decision -- that needs to be done by you.  \n\nI think most web designers tend to just send off the proposal \"into the wind\" so to speak (because they're a bit worried about the numbers conversation), when in reality the proposal should be just a physical manifestation of things you've **already discussed and agreed-to verbally** with the client.\n\n&gt; Don't like \"nickel and dime\" clients? Raise your rates.\n\n+1.\n\nThanks for sharing this -- lots of good info on expectation management to learn here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This proposal/discovery document should be ok&amp;#39;d by the client and that can be the basis for the contract. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wanted to elaborate on this.&lt;/p&gt;\n\n&lt;p&gt;Try not to let your proposal do the selling for you.  Talk numbers &lt;strong&gt;early and often&lt;/strong&gt; with your clients (I usually talk budget in the first 5 minutes of the call).&lt;/p&gt;\n\n&lt;p&gt;Why?  Your proposal can do very little to convince your client that they&amp;#39;re making the right decision -- that needs to be done by you.  &lt;/p&gt;\n\n&lt;p&gt;I think most web designers tend to just send off the proposal &amp;quot;into the wind&amp;quot; so to speak (because they&amp;#39;re a bit worried about the numbers conversation), when in reality the proposal should be just a physical manifestation of things you&amp;#39;ve &lt;strong&gt;already discussed and agreed-to verbally&lt;/strong&gt; with the client.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Don&amp;#39;t like &amp;quot;nickel and dime&amp;quot; clients? Raise your rates.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;+1.&lt;/p&gt;\n\n&lt;p&gt;Thanks for sharing this -- lots of good info on expectation management to learn here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdj97z", "score_hidden": false, "stickied": false, "created": 1492467735.0, "created_utc": 1492438935.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgdjpes", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "snajdal", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "The very best advise is \"DARE TO SAY \"NO\".\n\nAnd this is at the very 1st stage. If you start having sensation at your 1st meeting that it's not going to be a \"good\" client, do not even start. You'll hate the job, you'll have problem to get paid and you'll probably even get bad reputation.\n\nEven if you have a good feeling, always keep written records about everything. Meeting minutes are ever best thing on this planet. It makes you resuming for yourself what you have understood. It gives to your client idea, how you have got what they were trying to express. And if later it turns wrong, you have already a working method based on keeping records. When you are kept in a trap of signed contracts etc. you can state that you strongly recommend to your client to do something different of what they ask and issue written warning of problems that may get into. It mitigates the risks ... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The very best advise is &amp;quot;DARE TO SAY &amp;quot;NO&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;And this is at the very 1st stage. If you start having sensation at your 1st meeting that it&amp;#39;s not going to be a &amp;quot;good&amp;quot; client, do not even start. You&amp;#39;ll hate the job, you&amp;#39;ll have problem to get paid and you&amp;#39;ll probably even get bad reputation.&lt;/p&gt;\n\n&lt;p&gt;Even if you have a good feeling, always keep written records about everything. Meeting minutes are ever best thing on this planet. It makes you resuming for yourself what you have understood. It gives to your client idea, how you have got what they were trying to express. And if later it turns wrong, you have already a working method based on keeping records. When you are kept in a trap of signed contracts etc. you can state that you strongly recommend to your client to do something different of what they ask and issue written warning of problems that may get into. It mitigates the risks ... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdjpes", "score_hidden": false, "stickied": false, "created": 1492468346.0, "created_utc": 1492439546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgdr48r", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "row4land", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Excellent points, OP. In terms of negotiating the design/UI:\n\n- Don't let the site go live until the client agrees the UI is sufficient. This puts pressure on them to keep the ball rolling.\n\n- Charge hourly for design work, if you don't already.\n\nIf they want to keep altering my design, good, pay me. I'll keep my draft designs for future customers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Excellent points, OP. In terms of negotiating the design/UI:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Don&amp;#39;t let the site go live until the client agrees the UI is sufficient. This puts pressure on them to keep the ball rolling.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Charge hourly for design work, if you don&amp;#39;t already.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;If they want to keep altering my design, good, pay me. I&amp;#39;ll keep my draft designs for future customers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdr48r", "score_hidden": false, "stickied": false, "created": 1492477031.0, "created_utc": 1492448231.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgdidtl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "honda_fast", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Very well said!  And I can concur with it all, been practising that all my career and it has served me well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very well said!  And I can concur with it all, been practising that all my career and it has served me well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdidtl", "score_hidden": false, "stickied": false, "created": 1492466515.0, "created_utc": 1492437715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgelxm1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lawnpuppies", "parent_id": "t1_dgelk3m", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Same thing. Getting taken advantage of is usually your vault if you don't have systems in place to protect yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same thing. Getting taken advantage of is usually your vault if you don&amp;#39;t have systems in place to protect yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgelxm1", "score_hidden": false, "stickied": false, "created": 1492513838.0, "created_utc": 1492485038.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgelk3m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "marcocom", "parent_id": "t1_dgdyjy1", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "i like what your saying, however, there is many business-smart people who think that they can tie you into a knot.  they do it for a living, they put vendors over a barrel and they get as much as they can for as little as they can.  its what theyre paid to do.  its not personal. (i deal with mostly very large corporate clients)\nI do think though that its important to be aware of this fact, it is hostile, you are going to be taken advantage of for anything you dont explicitly provide for in your work agreement.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i like what your saying, however, there is many business-smart people who think that they can tie you into a knot.  they do it for a living, they put vendors over a barrel and they get as much as they can for as little as they can.  its what theyre paid to do.  its not personal. (i deal with mostly very large corporate clients)\nI do think though that its important to be aware of this fact, it is hostile, you are going to be taken advantage of for anything you dont explicitly provide for in your work agreement.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgelk3m", "score_hidden": false, "stickied": false, "created": 1492513362.0, "created_utc": 1492484562.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdyjy1", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "lawnpuppies", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Generally speaking, anytime the client is confused, it's usually your fault for not having the systems in place to solve your clients problems. It's almost kinda of silly that in some cases you have to teach your client how to do their own job so that you can do your own job or assign work to other people, but that's how it is sometimes. Building a framework to give to your client, so they can define what they want in sort of a wireframe / big picture form, and then you can determine whose job it is to fill in what content where and determining or establishing your role(s). Boxes inside boxes are easier to understand for everyone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Generally speaking, anytime the client is confused, it&amp;#39;s usually your fault for not having the systems in place to solve your clients problems. It&amp;#39;s almost kinda of silly that in some cases you have to teach your client how to do their own job so that you can do your own job or assign work to other people, but that&amp;#39;s how it is sometimes. Building a framework to give to your client, so they can define what they want in sort of a wireframe / big picture form, and then you can determine whose job it is to fill in what content where and determining or establishing your role(s). Boxes inside boxes are easier to understand for everyone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdyjy1", "score_hidden": false, "stickied": false, "created": 1492485339.0, "created_utc": 1492456539.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgelqe7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "marcocom", "parent_id": "t1_dgekg3f", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "I have a trick for that. \nWhen doing 'discovery' , youre right that there is no shortage of bloviating off-the-top-of-the-head stuff thrown around.  Lots of different business-concerns (often internally fighting themselves for more) and different strategies abound.\nso what i do is keep a piece of paper and i record key words  that i hear said.  different adjectives or action-words.  and every time i hear them said again, i draw a circle around that word.   later, when you look at the paper, you will see which words resonated and were used most often.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a trick for that. \nWhen doing &amp;#39;discovery&amp;#39; , youre right that there is no shortage of bloviating off-the-top-of-the-head stuff thrown around.  Lots of different business-concerns (often internally fighting themselves for more) and different strategies abound.\nso what i do is keep a piece of paper and i record key words  that i hear said.  different adjectives or action-words.  and every time i hear them said again, i draw a circle around that word.   later, when you look at the paper, you will see which words resonated and were used most often.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgelqe7", "score_hidden": false, "stickied": false, "created": 1492513581.0, "created_utc": 1492484781.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekg3f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "virtueavatar", "parent_id": "t1_dgeeu0y", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Prepared to talk about their website, yes. \n\nPrepared to give you appropriate adjectives and gives you specific examples of other sites they're aiming for, no. You'd get answers, but they'd be the type of answers you'd rattle off off the top of your head and hadn't given much thought to, which is likely inaccurate.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Prepared to talk about their website, yes. &lt;/p&gt;\n\n&lt;p&gt;Prepared to give you appropriate adjectives and gives you specific examples of other sites they&amp;#39;re aiming for, no. You&amp;#39;d get answers, but they&amp;#39;d be the type of answers you&amp;#39;d rattle off off the top of your head and hadn&amp;#39;t given much thought to, which is likely inaccurate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgekg3f", "score_hidden": false, "stickied": false, "created": 1492511946.0, "created_utc": 1492483146.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeeu0y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brianhaferkamp", "parent_id": "t1_dgedfqg", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "I guess many of my clients are prepared to talk about their websites. I've never had anyone not prepared to speak about it at least a little. Designers have to learn how to spin the smallest piece of straw into gold :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess many of my clients are prepared to talk about their websites. I&amp;#39;ve never had anyone not prepared to speak about it at least a little. Designers have to learn how to spin the smallest piece of straw into gold :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgeeu0y", "score_hidden": false, "stickied": false, "created": 1492505144.0, "created_utc": 1492476344.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgedfqg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "virtueavatar", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "&gt; What are some adjectives to describe the design style you're looking for?\n\n&gt; Can you tell me some sites that you like? Why do you like them?\n\nThese are questions I would not be able to appropriately answer at a meeting - they require some careful thought if you expect to get useful answers. It's the kind of thing you'd offer early and say come back to me in a few hours/tomorrow about this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What are some adjectives to describe the design style you&amp;#39;re looking for?&lt;/p&gt;\n\n&lt;p&gt;Can you tell me some sites that you like? Why do you like them?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These are questions I would not be able to appropriately answer at a meeting - they require some careful thought if you expect to get useful answers. It&amp;#39;s the kind of thing you&amp;#39;d offer early and say come back to me in a few hours/tomorrow about this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgedfqg", "score_hidden": false, "stickied": false, "created": 1492503396.0, "created_utc": 1492474596.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgdup3t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Yungblood78", "parent_id": "t1_dgdndjn", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Amazing advice, thanks a lot", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Amazing advice, thanks a lot&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdup3t", "score_hidden": false, "stickied": false, "created": 1492480985.0, "created_utc": 1492452185.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdndjn", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "brianhaferkamp", "parent_id": "t1_dgdm3xk", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Process will help you get rid of those situations. But if you are in the situation, just be honest with the client. Either you underestimated the work or the client is going out of scope. See if you can come up with a solution together. Positive communication that is looking for a mutually beneficial solution is key.\n\nIf you're not a confrontational person you can just push through, finish, and take a loss. \n\nEither way, when the project is complete, seriously evaluate the whole situation. What could you have done to ensure the scope? What could you have put in the contract to kick in when you're going out of scope? Could you have priced that client out at the beginning? Were there red flags along the way? What were they? How can you make it so that you are prepared in the future for that contingency?\n\nIn the beginning designers will take their lumps. Don't just whine about clients. Learn from your mistakes and try to come up with a solution that is better for the next client. Refine your business processes. Have a business process and it will make the client feel like things are in control. \n\nAnother piece of advice. Don't work hourly. Figure out the value of the project to the client. This means business talk. Here is a great seminar on value-based pricing for creatives: https://youtu.be/RKXZ7t_RiOE", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Process will help you get rid of those situations. But if you are in the situation, just be honest with the client. Either you underestimated the work or the client is going out of scope. See if you can come up with a solution together. Positive communication that is looking for a mutually beneficial solution is key.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re not a confrontational person you can just push through, finish, and take a loss. &lt;/p&gt;\n\n&lt;p&gt;Either way, when the project is complete, seriously evaluate the whole situation. What could you have done to ensure the scope? What could you have put in the contract to kick in when you&amp;#39;re going out of scope? Could you have priced that client out at the beginning? Were there red flags along the way? What were they? How can you make it so that you are prepared in the future for that contingency?&lt;/p&gt;\n\n&lt;p&gt;In the beginning designers will take their lumps. Don&amp;#39;t just whine about clients. Learn from your mistakes and try to come up with a solution that is better for the next client. Refine your business processes. Have a business process and it will make the client feel like things are in control. &lt;/p&gt;\n\n&lt;p&gt;Another piece of advice. Don&amp;#39;t work hourly. Figure out the value of the project to the client. This means business talk. Here is a great seminar on value-based pricing for creatives: &lt;a href=\"https://youtu.be/RKXZ7t_RiOE\"&gt;https://youtu.be/RKXZ7t_RiOE&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdndjn", "score_hidden": false, "stickied": false, "created": 1492472829.0, "created_utc": 1492444029.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdm3xk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Yungblood78", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "So how do you work with your client when you realize you're not getting paid enough for the project?\n\n Say it's hourly, are you forced to just stick it out since the contract has already been signed or is there a way to express to the client that your initial rate just isn't going to work out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So how do you work with your client when you realize you&amp;#39;re not getting paid enough for the project?&lt;/p&gt;\n\n&lt;p&gt;Say it&amp;#39;s hourly, are you forced to just stick it out since the contract has already been signed or is there a way to express to the client that your initial rate just isn&amp;#39;t going to work out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdm3xk", "score_hidden": false, "stickied": false, "created": 1492471364.0, "created_utc": 1492442564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgejiv8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kamomil", "parent_id": "t1_dgdw6y5", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "What is discovery?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is discovery?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgejiv8", "score_hidden": false, "stickied": false, "created": 1492510834.0, "created_utc": 1492482034.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdw6y5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "brianhaferkamp", "parent_id": "t1_dgdq1v2", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "This playlist is gold for a lot of questions like these.\n\nhttps://www.youtube.com/playlist?list=PLzKJi2GjpkEHbv_b8C_XKs0VT5T3cCraH\n\nThere is a video in there called Big Client Meeting: How to Sell Large Digital Products. It might be helpful for question 2.\n\nSome people will charge by the hour for discovery because you can set time parameters to it (1 hour, 10 hours, etc) and then you stick to that. I've seen $100/hour before. If you charge by the hour you should stick to the parameters you've set for it (don't give 2 and charge for 1). As you work with clients more you'll get a feel for how long things take. \n\nIn the end, every moment you take away from your life is valuable. You only get so much time on this earth. Your time and attention are the most valuable things you have to give others. It has value so you should charge for it. Same goes for your expertise. You can choose to give it away, but know that it has value. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This playlist is gold for a lot of questions like these.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/playlist?list=PLzKJi2GjpkEHbv_b8C_XKs0VT5T3cCraH\"&gt;https://www.youtube.com/playlist?list=PLzKJi2GjpkEHbv_b8C_XKs0VT5T3cCraH&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There is a video in there called Big Client Meeting: How to Sell Large Digital Products. It might be helpful for question 2.&lt;/p&gt;\n\n&lt;p&gt;Some people will charge by the hour for discovery because you can set time parameters to it (1 hour, 10 hours, etc) and then you stick to that. I&amp;#39;ve seen $100/hour before. If you charge by the hour you should stick to the parameters you&amp;#39;ve set for it (don&amp;#39;t give 2 and charge for 1). As you work with clients more you&amp;#39;ll get a feel for how long things take. &lt;/p&gt;\n\n&lt;p&gt;In the end, every moment you take away from your life is valuable. You only get so much time on this earth. Your time and attention are the most valuable things you have to give others. It has value so you should charge for it. Same goes for your expertise. You can choose to give it away, but know that it has value. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdw6y5", "score_hidden": false, "stickied": false, "created": 1492482663.0, "created_utc": 1492453863.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgeeyo9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brianhaferkamp", "parent_id": "t1_dge43mu", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Agreed. Take a couple of weeks and just go through their channel. There is so much good info here. The playlist above is from the same channel.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. Take a couple of weeks and just go through their channel. There is so much good info here. The playlist above is from the same channel.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgeeyo9", "score_hidden": false, "stickied": false, "created": 1492505302.0, "created_utc": 1492476502.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge43mu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shadeobrady", "parent_id": "t1_dgdq1v2", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Try this video - I've been watching their work recently as a number of guys that work with them keep popping up on my radar. They have good classes and discussion.\n\nHe goes over their discover pricing range and large projects + how to handle any questions on pricing that may come up.\n\nhttps://www.youtube.com/watch?v=RKXZ7t_RiOE&amp;feature=youtu.be", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try this video - I&amp;#39;ve been watching their work recently as a number of guys that work with them keep popping up on my radar. They have good classes and discussion.&lt;/p&gt;\n\n&lt;p&gt;He goes over their discover pricing range and large projects + how to handle any questions on pricing that may come up.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=RKXZ7t_RiOE&amp;amp;feature=youtu.be\"&gt;https://www.youtube.com/watch?v=RKXZ7t_RiOE&amp;amp;feature=youtu.be&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dge43mu", "score_hidden": false, "stickied": false, "created": 1492491571.0, "created_utc": 1492462771.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq1v2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "30thnight", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "This is a great thread.\n\nDoes anyone have any experience:\n\n1. Charging for discovery?\n1. Targeting large clients / 20k plus projects?", "edited": 1492447440.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a great thread.&lt;/p&gt;\n\n&lt;p&gt;Does anyone have any experience:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Charging for discovery?&lt;/li&gt;\n&lt;li&gt;Targeting large clients / 20k plus projects?&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdq1v2", "score_hidden": false, "stickied": false, "created": 1492475850.0, "created_utc": 1492447050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgdwo6k", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "temptedtotough", "parent_id": "t1_dgdqcam", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Informally: y,z features are like extra toppings at certain restaurants - they will cost you extra. :) [the smiley face is important]\n\nFormally: I am excited as you are for extending functionality of this app however adding the aforementioned features will be outside of the scope of the original agreement thus will raise the price since it will take more time and assets to implement. If you like, I can add these features in the next version of the app once we release this one and renegotiate the price. \n\nIt's a little easier with apps since there is a constant churn for more features and new design, thus versioning. With art, I just say hey, the price is this for that and if you want to add those then it will cost you. Also a limit on free changes to like one or two and a surcharge for anything past that. \n\nTL;DR: Be blunt but polite and try to hook them to work with you on the next iteration. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Informally: y,z features are like extra toppings at certain restaurants - they will cost you extra. :) [the smiley face is important]&lt;/p&gt;\n\n&lt;p&gt;Formally: I am excited as you are for extending functionality of this app however adding the aforementioned features will be outside of the scope of the original agreement thus will raise the price since it will take more time and assets to implement. If you like, I can add these features in the next version of the app once we release this one and renegotiate the price. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a little easier with apps since there is a constant churn for more features and new design, thus versioning. With art, I just say hey, the price is this for that and if you want to add those then it will cost you. Also a limit on free changes to like one or two and a surcharge for anything past that. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: Be blunt but polite and try to hook them to work with you on the next iteration. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdwo6k", "score_hidden": false, "stickied": false, "created": 1492483206.0, "created_utc": 1492454406.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgdxc7h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "brianhaferkamp", "parent_id": "t1_dgdqcam", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Good question. This is all of the protection I have in my current contract:\n\n\"We don’t want to limit your ability to change your mind. If you want to change your mind or add anything new, that won’t be a problem as we’ll provide a separate estimate for those additional changes.\"\n\nIt's under a section called \"changes and revisions.\" You could be a lot more hardcore than that. I've not had to really go through that with my clients. You could add that anything outside the expressed, written scope of the contract will be worked up and billed separately or that any changes must be agreed upon by both parties and written up for billing. \n\nIf you're working with a client where there are a lot of decision-makers, then build in an extra 25% (or another number) on the cost for changes and revisions. Then, you won't have to worry about undercharging or nickel and diming for revisions. \n\nIn the end, you have to be firm. Make sure you read through the contract again to ensure that you're right :-) Then let the client know that what they are asking for is a separate feature and is out of the scope of the contract. If they want to have it then give them an estimate for the extra costs and have them sign off on it. Don't just say \"yes.\" Go through the process. If it's a bad idea then give some push back on it. See how they respond to your logic. If they still want to do it and they're willing to pay, then the ball is in your court. Do it or don't. You might even consider finding someone else to contract that work out to.\n\nJust make sure the contract specifically says what you will be putting into the project, especially if you have had previous conversations that weren't written down. \n\nGive clients a little bit of grace. They don't always know when they're moving into a new feature. Coach them, teach them. Don't treat them like the enemy.\n\nAnd to the best of your ability, use business language to explain to them things like cost overruns and overages and add-ons. These are concepts they understand in their business and it might help them see that what they're asking for isn't in scope and is something you must charge for.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good question. This is all of the protection I have in my current contract:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We don’t want to limit your ability to change your mind. If you want to change your mind or add anything new, that won’t be a problem as we’ll provide a separate estimate for those additional changes.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s under a section called &amp;quot;changes and revisions.&amp;quot; You could be a lot more hardcore than that. I&amp;#39;ve not had to really go through that with my clients. You could add that anything outside the expressed, written scope of the contract will be worked up and billed separately or that any changes must be agreed upon by both parties and written up for billing. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re working with a client where there are a lot of decision-makers, then build in an extra 25% (or another number) on the cost for changes and revisions. Then, you won&amp;#39;t have to worry about undercharging or nickel and diming for revisions. &lt;/p&gt;\n\n&lt;p&gt;In the end, you have to be firm. Make sure you read through the contract again to ensure that you&amp;#39;re right :-) Then let the client know that what they are asking for is a separate feature and is out of the scope of the contract. If they want to have it then give them an estimate for the extra costs and have them sign off on it. Don&amp;#39;t just say &amp;quot;yes.&amp;quot; Go through the process. If it&amp;#39;s a bad idea then give some push back on it. See how they respond to your logic. If they still want to do it and they&amp;#39;re willing to pay, then the ball is in your court. Do it or don&amp;#39;t. You might even consider finding someone else to contract that work out to.&lt;/p&gt;\n\n&lt;p&gt;Just make sure the contract specifically says what you will be putting into the project, especially if you have had previous conversations that weren&amp;#39;t written down. &lt;/p&gt;\n\n&lt;p&gt;Give clients a little bit of grace. They don&amp;#39;t always know when they&amp;#39;re moving into a new feature. Coach them, teach them. Don&amp;#39;t treat them like the enemy.&lt;/p&gt;\n\n&lt;p&gt;And to the best of your ability, use business language to explain to them things like cost overruns and overages and add-ons. These are concepts they understand in their business and it might help them see that what they&amp;#39;re asking for isn&amp;#39;t in scope and is something you must charge for.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdxc7h", "score_hidden": false, "stickied": false, "created": 1492483962.0, "created_utc": 1492455162.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqcam", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "allalittlemad", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "How do you work out pricing changes for when the client keeps adding edits to the project? \n\nFor example, say I quote a client for an iOS app at $1000 and that's what they can afford. I let them know that for that price you can get \"x\" features. \n\nDuring the process, maybe the client decides they want \"y\" and \"z\" features too. How would you exactly word your response to the client for additions or edits that would add more work or lengthen the project?\n\nHow would you add that type of clause to a contract? Like \"any edits or additions not agreed upon will result in a new agreement on pay rate\"? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you work out pricing changes for when the client keeps adding edits to the project? &lt;/p&gt;\n\n&lt;p&gt;For example, say I quote a client for an iOS app at $1000 and that&amp;#39;s what they can afford. I let them know that for that price you can get &amp;quot;x&amp;quot; features. &lt;/p&gt;\n\n&lt;p&gt;During the process, maybe the client decides they want &amp;quot;y&amp;quot; and &amp;quot;z&amp;quot; features too. How would you exactly word your response to the client for additions or edits that would add more work or lengthen the project?&lt;/p&gt;\n\n&lt;p&gt;How would you add that type of clause to a contract? Like &amp;quot;any edits or additions not agreed upon will result in a new agreement on pay rate&amp;quot;? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgdqcam", "score_hidden": false, "stickied": false, "created": 1492476173.0, "created_utc": 1492447373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgeficj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "inmyhumbleo", "parent_id": "t1_dgecvye", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Yeah man! [This episode](https://soundcloud.com/nosleepstartup/episode-11-your-proposal) is related to this topic. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah man! &lt;a href=\"https://soundcloud.com/nosleepstartup/episode-11-your-proposal\"&gt;This episode&lt;/a&gt; is related to this topic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgeficj", "score_hidden": false, "stickied": false, "created": 1492505969.0, "created_utc": 1492477169.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgecvye", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shibuyamizou", "parent_id": "t1_dge77r7", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "You got a link for it?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You got a link for it?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgecvye", "score_hidden": false, "stickied": false, "created": 1492502688.0, "created_utc": 1492473888.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge77r7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "inmyhumbleo", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Man...this is what a majority of my podcast is about. Good stuff man!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man...this is what a majority of my podcast is about. Good stuff man!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dge77r7", "score_hidden": false, "stickied": false, "created": 1492495356.0, "created_utc": 1492466556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgei9k0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mckenro", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Great post - thanks for sharing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post - thanks for sharing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgei9k0", "score_hidden": false, "stickied": false, "created": 1492509368.0, "created_utc": 1492480568.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgek4bt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "digitallynked", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "well said ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well said &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgek4bt", "score_hidden": false, "stickied": false, "created": 1492511540.0, "created_utc": 1492482740.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1m", "removal_reason": null, "link_id": "t3_65vdyf", "likes": null, "replies": "", "user_reports": [], "id": "dgejn93", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kamomil", "parent_id": "t1_dgeegm8", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "I think the commenter is talking about a client who wants fancy details that don't add anything information-wise to the site", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the commenter is talking about a client who wants fancy details that don&amp;#39;t add anything information-wise to the site&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgejn93", "score_hidden": false, "stickied": false, "created": 1492510976.0, "created_utc": 1492482176.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeegm8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mr-Yellow", "parent_id": "t1_dge8zjz", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "They have no concern about AJAX or Javascript. They aren't hiring you to teach them how to code.\n\nIf they have concerns about AJAX or Javascript... Why are they hiring you to consult? Have no need for your advice because they know better? Sounds like a bad client.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They have no concern about AJAX or Javascript. They aren&amp;#39;t hiring you to teach them how to code.&lt;/p&gt;\n\n&lt;p&gt;If they have concerns about AJAX or Javascript... Why are they hiring you to consult? Have no need for your advice because they know better? Sounds like a bad client.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dgeegm8", "score_hidden": false, "stickied": false, "created": 1492504676.0, "created_utc": 1492475876.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8zjz", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "FuckCersei", "parent_id": "t3_65vdyf", "subreddit_name_prefixed": "r/web_design", "controversiality": 0, "body": "Tell them Ajax and JavaScript in general is laggy as fuck and not every user likes that even if it looks pretty", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell them Ajax and JavaScript in general is laggy as fuck and not every user likes that even if it looks pretty&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "web_design", "name": "t1_dge8zjz", "score_hidden": false, "stickied": false, "created": 1492497627.0, "created_utc": 1492468827.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]