[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "engineering", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey folks, I&amp;#39;ve been interviewing with a company for a role as an NPI engineer and, so far, it&amp;#39;s been going pretty well. I have a lot of solid background knowledge for the field of the products I&amp;#39;d be working on, but what I don&amp;#39;t have is direct experience in transitioning a product from R&amp;amp;D to production. I&amp;#39;m wondering if anybody has any good resources or insight into the kind of stuff I should brush up on before my next interview. For instance, certain statistical concepts that I would want to be solid in or common threads/issues that pop up in all NPI jobs. What does an NPI engineer think about all day and what defines success in their role? &lt;/p&gt;\n\n&lt;p&gt;Obviously I&amp;#39;ve done some background research and whatnot, but it&amp;#39;d be good to hear some firsthand experiences.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey folks, I've been interviewing with a company for a role as an NPI engineer and, so far, it's been going pretty well. I have a lot of solid background knowledge for the field of the products I'd be working on, but what I don't have is direct experience in transitioning a product from R&amp;D to production. I'm wondering if anybody has any good resources or insight into the kind of stuff I should brush up on before my next interview. For instance, certain statistical concepts that I would want to be solid in or common threads/issues that pop up in all NPI jobs. What does an NPI engineer think about all day and what defines success in their role? \n\nObviously I've done some background research and whatnot, but it'd be good to hear some firsthand experiences.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[GENERAL]", "id": "64shkg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "o0DrWurm0o", "saved": false, "mod_reports": [], "name": "t3_64shkg", "subreddit_name_prefixed": "r/engineering", "approved_by": null, "over_18": false, "domain": "self.engineering", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhpi", "edited": false, "link_flair_css_class": "gen", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/engineering/comments/64shkg/looking_for_insight_into_npi_new_product/", "num_reports": null, "locked": false, "stickied": false, "created": 1491962285.0, "url": "https://www.reddit.com/r/engineering/comments/64shkg/looking_for_insight_into_npi_new_product/", "author_flair_text": "BSEE - Photonics", "quarantine": false, "title": "Looking for insight into NPI (new product introduction) Engineering", "created_utc": 1491933485.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_64shkg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_64shkg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_64shkg", "likes": null, "replies": "", "user_reports": [], "id": "dg58tof", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "goldfishpaws", "parent_id": "t1_dg4xltd", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "Manufacturing Engineering is a degree in itself, but DFM as an approach isn't really anything secret, just a lot of incremental small wins.  For instance instead of 3 screw sizes you standardise on one.  Instead of it being possible to insert a gasket the wrong way round you either design it with full symmetry or make it so asymmetric as to be impossible.  Instead of feeding stuff onto a spindle, you create a jig that means everything can only fit on in the right order and it's held vertically in the correct alignment throughout.  Kit your parts.  ISO9000 (and friends) can be designed into this stage easier than retrofitting.  Look at critical dimensions and noncritical ones and adjust tolerances accordingly.  Can a small rework of the design mean you use standard commodity parts off the shelf (roller skate bearings are much cheaper than a size up or down thanks to bring made in higher volume, or adjustable spacing using a bag of washers instead of individually machined spacers)?  Can you adapt an existing product line with a little retooling?\n\nYou can also at this stage design for recycling for negligible extra work - can you make any contaminated plastics easily separable from clean (eg glued rubber feet can snap off neatly from a telephone), metal removal be clean and easy, etc.\n\nEvery penny you save is a quarter on the retail price, so go to town.  Can a bearing be a bushing?  How about a sintered bronze one packed with oil to self-lubricate?  Do you need a transformer to power the low voltage indicator or can you use a neon? How about a capacitive dropper?  Is power factor important to your customers (domestic Vs industrial, to do with aligning the phase of current and voltage) and so can you build in correction at source?  \n\nJust a few starter thoughts for you :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Manufacturing Engineering is a degree in itself, but DFM as an approach isn&amp;#39;t really anything secret, just a lot of incremental small wins.  For instance instead of 3 screw sizes you standardise on one.  Instead of it being possible to insert a gasket the wrong way round you either design it with full symmetry or make it so asymmetric as to be impossible.  Instead of feeding stuff onto a spindle, you create a jig that means everything can only fit on in the right order and it&amp;#39;s held vertically in the correct alignment throughout.  Kit your parts.  ISO9000 (and friends) can be designed into this stage easier than retrofitting.  Look at critical dimensions and noncritical ones and adjust tolerances accordingly.  Can a small rework of the design mean you use standard commodity parts off the shelf (roller skate bearings are much cheaper than a size up or down thanks to bring made in higher volume, or adjustable spacing using a bag of washers instead of individually machined spacers)?  Can you adapt an existing product line with a little retooling?&lt;/p&gt;\n\n&lt;p&gt;You can also at this stage design for recycling for negligible extra work - can you make any contaminated plastics easily separable from clean (eg glued rubber feet can snap off neatly from a telephone), metal removal be clean and easy, etc.&lt;/p&gt;\n\n&lt;p&gt;Every penny you save is a quarter on the retail price, so go to town.  Can a bearing be a bushing?  How about a sintered bronze one packed with oil to self-lubricate?  Do you need a transformer to power the low voltage indicator or can you use a neon? How about a capacitive dropper?  Is power factor important to your customers (domestic Vs industrial, to do with aligning the phase of current and voltage) and so can you build in correction at source?  &lt;/p&gt;\n\n&lt;p&gt;Just a few starter thoughts for you :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dg58tof", "score_hidden": false, "stickied": false, "created": 1491988463.0, "created_utc": 1491959663.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_64shkg", "likes": null, "replies": "", "user_reports": [], "id": "dg6hyx3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NastyCabbage", "parent_id": "t1_dg4xltd", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "The larger company I worked at was in aerospace components. Most of the NPI work was performance and validation work, with the product design changes being relatively small and related to additional functionality and airframe specific requirements. The vast majority of changes didn't really alter the fundamental architecture of the products; it was pushing things a bit bigger, or trying out less nasty materials, increasing on-board monitoring equipment, modifying I/O to suite the customer. Some complete revamps of the entire system architecture were just starting up, but I left and never really got to experience them.\n\nMost of the work was testing due to the nature of the product. First performing Design Assurance Testing to validate the design and any internally generated requirements, then Certification testing to demonstrate compliance with the external requirements from EASA or the customer etc. We're actually doing things in a similar way at my smaller and more disorganised company, just in a less structured way, so I imagine it applies cross industry its just that it may be less thorough.\n\nIf I was hiring someone at any company it would be someone who's excited at the prospect of being involved in the product. I think most hiring managers, unless the role is very technically specific (which NPI generally isn't in larger companies - they have \"specialists\") ,would be looking for someone diligent with high intellect and good professional writing skills - the product specific stuff comes within a few of months of doing the job learning from expert colleagues, and then your own input into design slowly starts to creep into the product.\n\nObvs this is only my own personal views and experience!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The larger company I worked at was in aerospace components. Most of the NPI work was performance and validation work, with the product design changes being relatively small and related to additional functionality and airframe specific requirements. The vast majority of changes didn&amp;#39;t really alter the fundamental architecture of the products; it was pushing things a bit bigger, or trying out less nasty materials, increasing on-board monitoring equipment, modifying I/O to suite the customer. Some complete revamps of the entire system architecture were just starting up, but I left and never really got to experience them.&lt;/p&gt;\n\n&lt;p&gt;Most of the work was testing due to the nature of the product. First performing Design Assurance Testing to validate the design and any internally generated requirements, then Certification testing to demonstrate compliance with the external requirements from EASA or the customer etc. We&amp;#39;re actually doing things in a similar way at my smaller and more disorganised company, just in a less structured way, so I imagine it applies cross industry its just that it may be less thorough.&lt;/p&gt;\n\n&lt;p&gt;If I was hiring someone at any company it would be someone who&amp;#39;s excited at the prospect of being involved in the product. I think most hiring managers, unless the role is very technically specific (which NPI generally isn&amp;#39;t in larger companies - they have &amp;quot;specialists&amp;quot;) ,would be looking for someone diligent with high intellect and good professional writing skills - the product specific stuff comes within a few of months of doing the job learning from expert colleagues, and then your own input into design slowly starts to creep into the product.&lt;/p&gt;\n\n&lt;p&gt;Obvs this is only my own personal views and experience!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dg6hyx3", "score_hidden": false, "stickied": false, "created": 1492057525.0, "created_utc": 1492028725.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4xltd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "o0DrWurm0o", "parent_id": "t1_dg4u284", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "Hey thanks a lot for your input! I'm glad you made the distinction about small/large companies. The company I'm looking at is reasonably large, and as you alluded to, they have previous similar products to draw from. I wonder if that's one reason they're willing to compromise on direct experience and get somebody who's just really excited to work with the products. If you don't mind, could you share a little more about your experience with the so-called \"IPI\" at a larger company? I'm hoping it's a good opportunity to get deeply acquainted with the technology and maybe transition to more of a design role in the future. \n\nI'll definitely look into DFM and me asking about standards compliance could be a good way to show that I've been doing some research.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey thanks a lot for your input! I&amp;#39;m glad you made the distinction about small/large companies. The company I&amp;#39;m looking at is reasonably large, and as you alluded to, they have previous similar products to draw from. I wonder if that&amp;#39;s one reason they&amp;#39;re willing to compromise on direct experience and get somebody who&amp;#39;s just really excited to work with the products. If you don&amp;#39;t mind, could you share a little more about your experience with the so-called &amp;quot;IPI&amp;quot; at a larger company? I&amp;#39;m hoping it&amp;#39;s a good opportunity to get deeply acquainted with the technology and maybe transition to more of a design role in the future. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll definitely look into DFM and me asking about standards compliance could be a good way to show that I&amp;#39;ve been doing some research.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dg4xltd", "score_hidden": false, "stickied": false, "created": 1491973943.0, "created_utc": 1491945143.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4u284", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NastyCabbage", "parent_id": "t3_64shkg", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "The product my company make is in the transitional phase from R&amp;D to production at the moment, so I guess I can offer up a few ideas.\n\nBear in mind that NPI at a large company is different to NPI at a smaller one. I have first hand experience of both now. Looking back, NPI at the large company is barely NPI - they're building so much on pedigree that they have very high confidence and established experience. E.g. building a new pump in volume isn't that hard if you already make other pumps. Its more like Incremental Product Introduction. NPI in a small business seems to be very different in my limited experience because you may have nothing as a baseline that already works.\n\nThe themes at my small company, and that may form the basis of some good interview answers, are:\n\n* Cost reduction - Making an R&amp;D product costs a fortune per unit. Cost reduction can be acheived either by volume purchase (generally not an NPI engineer's concern), alternate components, removal of processing steps that are OTT (e.g. heat treatment where we can get away without), yield improvement on components (if applicable) and slackened tolerances to ease manufacture.\n* DFM - design for manufacture, definitely look this up if you are not already familiar with it. It can impress at interviews.\n* Compliance with the relevant standards - this can prove to be difficult (as I'm discovering!) as you transition from a 'wing it' R&amp;D product to something you actually want to sell. Some design changes may be required, and you need to demonstrate compliance which takes a lot of engineering time (and maybe testing). A mistake here can be expensive in rework, and a really bad mistake means someone could go to prison for professional negligence.", "edited": 1491941329.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The product my company make is in the transitional phase from R&amp;amp;D to production at the moment, so I guess I can offer up a few ideas.&lt;/p&gt;\n\n&lt;p&gt;Bear in mind that NPI at a large company is different to NPI at a smaller one. I have first hand experience of both now. Looking back, NPI at the large company is barely NPI - they&amp;#39;re building so much on pedigree that they have very high confidence and established experience. E.g. building a new pump in volume isn&amp;#39;t that hard if you already make other pumps. Its more like Incremental Product Introduction. NPI in a small business seems to be very different in my limited experience because you may have nothing as a baseline that already works.&lt;/p&gt;\n\n&lt;p&gt;The themes at my small company, and that may form the basis of some good interview answers, are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Cost reduction - Making an R&amp;amp;D product costs a fortune per unit. Cost reduction can be acheived either by volume purchase (generally not an NPI engineer&amp;#39;s concern), alternate components, removal of processing steps that are OTT (e.g. heat treatment where we can get away without), yield improvement on components (if applicable) and slackened tolerances to ease manufacture.&lt;/li&gt;\n&lt;li&gt;DFM - design for manufacture, definitely look this up if you are not already familiar with it. It can impress at interviews.&lt;/li&gt;\n&lt;li&gt;Compliance with the relevant standards - this can prove to be difficult (as I&amp;#39;m discovering!) as you transition from a &amp;#39;wing it&amp;#39; R&amp;amp;D product to something you actually want to sell. Some design changes may be required, and you need to demonstrate compliance which takes a lot of engineering time (and maybe testing). A mistake here can be expensive in rework, and a really bad mistake means someone could go to prison for professional negligence.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dg4u284", "score_hidden": false, "stickied": false, "created": 1491969920.0, "created_utc": 1491941120.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]