[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "engineering", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s say that I have a perfect sphere, and I surround it with a fluid with concentration C1 that will diffuse into it. When solving the diffusion equation for the concentration profile &amp;quot;C&amp;quot;, it is normal to assume that the concentration at the surface of the sphere is constant at the value of C1, which will be the boundary condition at the surface. What conditions are necessary for this to be true or a reasonable argument? What dimensional quantities/arguments allow for this assumption to be made? I believe it has to do with the size of the sphere, relative value of the diffusion constant D, and mass transfer resistance, but I want to understand more the technical aspects of the physical system that one should think about when approaching the boundary conditions of a problem like this.&lt;/p&gt;\n\n&lt;p&gt;How would one make the argument, and what conditions would be necessary, that C1 itself was a function (of time) and not a constant at the surface?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Let's say that I have a perfect sphere, and I surround it with a fluid with concentration C1 that will diffuse into it. When solving the diffusion equation for the concentration profile \"C\", it is normal to assume that the concentration at the surface of the sphere is constant at the value of C1, which will be the boundary condition at the surface. What conditions are necessary for this to be true or a reasonable argument? What dimensional quantities/arguments allow for this assumption to be made? I believe it has to do with the size of the sphere, relative value of the diffusion constant D, and mass transfer resistance, but I want to understand more the technical aspects of the physical system that one should think about when approaching the boundary conditions of a problem like this.\n\n\nHow would one make the argument, and what conditions would be necessary, that C1 itself was a function (of time) and not a constant at the surface?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[CHEMICAL]", "id": "65juot", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "RealKeanuReeves", "saved": false, "mod_reports": [], "name": "t3_65juot", "subreddit_name_prefixed": "r/engineering", "approved_by": null, "over_18": false, "domain": "self.engineering", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhpi", "edited": false, "link_flair_css_class": "che", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/engineering/comments/65juot/what_conditions_or_assumptions_are_required_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1492301462.0, "url": "https://www.reddit.com/r/engineering/comments/65juot/what_conditions_or_assumptions_are_required_for/", "author_flair_text": null, "quarantine": false, "title": "What conditions or assumptions are required for there to be a non-constant, time-dependent surface concentration in a diffusion system?", "created_utc": 1492272662.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_65juot", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_65juot", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_65juot", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_65juot", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_65juot", "likes": null, "replies": "", "user_reports": [], "id": "dgcflxj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "InductorMan", "parent_id": "t1_dgce9dn", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "&gt; force it to appear not explicitly spherical coordinates\n\nOhhhhhh kay! That was actually nagging me. I was thinking \"what's so special about the boundary being spherical?\"\n\nAnd I guess the answer is \"nothing\"!\n\nI will check out that document if I have time, but honestly you're explanation rings true enough to me that I might just take it as an article of faith until I actually run into a situation where I need to understand it more deeply.\n\nThanks!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;force it to appear not explicitly spherical coordinates&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Ohhhhhh kay! That was actually nagging me. I was thinking &amp;quot;what&amp;#39;s so special about the boundary being spherical?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And I guess the answer is &amp;quot;nothing&amp;quot;!&lt;/p&gt;\n\n&lt;p&gt;I will check out that document if I have time, but honestly you&amp;#39;re explanation rings true enough to me that I might just take it as an article of faith until I actually run into a situation where I need to understand it more deeply.&lt;/p&gt;\n\n&lt;p&gt;Thanks!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dgcflxj", "score_hidden": false, "stickied": false, "created": 1492398901.0, "created_utc": 1492370101.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgce9dn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RealKeanuReeves", "parent_id": "t1_dgcc3da", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "So for that mass transfer coefficient, I think what you say it is is equivalent to mine, just a substitution of say v=C-C1, and therefore dc/dr = dv/dr will make it look the way I mentioned it.\n\n\n\nAnd that's interesting about knowing these diffusion principles as an electrical engineer. It's really cool how all the disciplines more or less tie together in a lot of ways. I'm studying biomedical engineering right now in my first year of grad school, with an undergrad in chemical, and for what it's worth we did a decent amount of circuit analysis for some biological/medical systems, and my research is going to be focused in MRI so I'm assuming I'm going to get more than I imagined in terms of electrical engineering hahaha.\n\n\nTo the rest of your comment I'll attach a google doc of my derivation because it can probably be more legible as a pdf than trying to type it out on here (ignore that last bit about \"Danckwert's Method\" as that's another thing I don't really understand lol).\n\nhttps://drive.google.com/open?id=0B2a7-t6c2LA4RUlSbGlPdUtNbEE\n\n\nI think that'll answer your questions about the time-invariant solutions, if not let me know. The reason it works is because you can make appropriate substitutions to the governing partial differential equation to force it to appear not explicitly spherical coordinates so you can solve using separation of variables. And then when you have your solution you can put the original substitution back in place.\nSuperposition principle and eigenfunctions/orthogonality and all that stuff are a liiiiiittle fuzzy math in my head and I'll just have to keep studying them to understand them more fully, but I think I understand enough to solve some problems like these, at least I hope lol. But I think that should answer the questions! Let me know if it's not clear or anything.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So for that mass transfer coefficient, I think what you say it is is equivalent to mine, just a substitution of say v=C-C1, and therefore dc/dr = dv/dr will make it look the way I mentioned it.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s interesting about knowing these diffusion principles as an electrical engineer. It&amp;#39;s really cool how all the disciplines more or less tie together in a lot of ways. I&amp;#39;m studying biomedical engineering right now in my first year of grad school, with an undergrad in chemical, and for what it&amp;#39;s worth we did a decent amount of circuit analysis for some biological/medical systems, and my research is going to be focused in MRI so I&amp;#39;m assuming I&amp;#39;m going to get more than I imagined in terms of electrical engineering hahaha.&lt;/p&gt;\n\n&lt;p&gt;To the rest of your comment I&amp;#39;ll attach a google doc of my derivation because it can probably be more legible as a pdf than trying to type it out on here (ignore that last bit about &amp;quot;Danckwert&amp;#39;s Method&amp;quot; as that&amp;#39;s another thing I don&amp;#39;t really understand lol).&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://drive.google.com/open?id=0B2a7-t6c2LA4RUlSbGlPdUtNbEE\"&gt;https://drive.google.com/open?id=0B2a7-t6c2LA4RUlSbGlPdUtNbEE&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I think that&amp;#39;ll answer your questions about the time-invariant solutions, if not let me know. The reason it works is because you can make appropriate substitutions to the governing partial differential equation to force it to appear not explicitly spherical coordinates so you can solve using separation of variables. And then when you have your solution you can put the original substitution back in place.\nSuperposition principle and eigenfunctions/orthogonality and all that stuff are a liiiiiittle fuzzy math in my head and I&amp;#39;ll just have to keep studying them to understand them more fully, but I think I understand enough to solve some problems like these, at least I hope lol. But I think that should answer the questions! Let me know if it&amp;#39;s not clear or anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dgce9dn", "score_hidden": false, "stickied": false, "created": 1492397101.0, "created_utc": 1492368301.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc3da", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "InductorMan", "parent_id": "t1_dgc3g45", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "For sure! Yes I think in many cases where you've got an aqueous solution around a solid, it's probably the case that the depletion of concentration near the solid absorber is pretty small.\n\nI see what this mass transfer coefficient is about, then: that's a nice analytical boundary. But I'm a little confused, don't we actually want:\n\n-D dC/dr = h (C-C1)\n\nThe equation you offered looks like the case where the surrounding medium has zero concentration of the antibody. The above is I think the right boundary at r=R for mass transfer from your sphere to a medium that has a bulk concentration C1 and an effective mass transfer coefficient h.\n\nIf you were interested, the reason an electrical engineer knows the erf(x) solution form to the diffusion equation is that it arises in semiconductor manufacture quite frequently. You might have a slab of silicon with none of some dopant in it, and then you might use chemical vapor deposition to place a layer of material containing concentration C1 of the dopant on top, at low temperature. Then you bake in an oven to promote diffusion, and the profile near the interface takes on the erf(x) form at each point in time. \n\nAlso, I'm glad I offered you such a detailed response because I really enjoyed reading yours, I haven't seen the diffusion equation in a spherical frame like that and it was fun trying to figure out where the second order derivative term of concentration vs position was hiding and neat to learn why there's a first order derivative term!\n\nIf you'd indulge me just briefly, though, I'm still a bit confused by your linear superposition. Why is it antisymmetrical about r=0? That seems like the opposite of what I'd expect given the symmetry that you expressed as dC/dr (r=0,t)=0. \n\nAlso, I guess I'm surprised that the time-invariant components of the solution still take on a sin(..r...) form. I'm not sure if I'm using the right term, by time-invariant components I mean those solutions to the system where the profile at time t=0 just re-scales over time and doesn't change shape. These appear to be the sort of component that you've built your superposition out of. \n\nA sin(r) (or other harmonic) time invariant profile makes sense for a 1d case, since if \n\nC(r,0) is sin(r),\n\nthen\n\nd/dt C(r,0) = d^2 sin(r) / dr^2 D = -sin(r) D, \n\nwhich is pretty clearly satisfied over the course of time by C(r,t) = exp(-t/tau) sin(r), and I'm too lazy to solve for tau which has something to do with D. \n\nBut for your spherical case I would have for some reason expected the time invariant solutions to take on some different form, given that the spherical coordinate version of the diffustion equaiton is so different.\n\nIf I take the same initial condition C(r,0) = sin(r), and plug it into the spherical version to make the same t=0 sanity check as I did above, then: \n\nd/dt C(r,0) = D/r^2 * d/dr (r^2 dC/dr) = D/r^2 * d/dr (r^2 d/dr sin(r))\n\nd/dt C(r,0) = D/r^2 * d/dr (r^2 cos(r))\n\nd/dt C(r,0) = D/r^2 * ( 2r cos(r) - r^2 sin(r))\n\nNow I could be missing some deeply burried and forgotten trig identity, but that doesn't look like it's going to be a time invariant profile. Do exponentially decaying sin(n * pi * r/R) components really suffice to describe the concentration over all time for the spherical case?", "edited": 1492365591.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For sure! Yes I think in many cases where you&amp;#39;ve got an aqueous solution around a solid, it&amp;#39;s probably the case that the depletion of concentration near the solid absorber is pretty small.&lt;/p&gt;\n\n&lt;p&gt;I see what this mass transfer coefficient is about, then: that&amp;#39;s a nice analytical boundary. But I&amp;#39;m a little confused, don&amp;#39;t we actually want:&lt;/p&gt;\n\n&lt;p&gt;-D dC/dr = h (C-C1)&lt;/p&gt;\n\n&lt;p&gt;The equation you offered looks like the case where the surrounding medium has zero concentration of the antibody. The above is I think the right boundary at r=R for mass transfer from your sphere to a medium that has a bulk concentration C1 and an effective mass transfer coefficient h.&lt;/p&gt;\n\n&lt;p&gt;If you were interested, the reason an electrical engineer knows the erf(x) solution form to the diffusion equation is that it arises in semiconductor manufacture quite frequently. You might have a slab of silicon with none of some dopant in it, and then you might use chemical vapor deposition to place a layer of material containing concentration C1 of the dopant on top, at low temperature. Then you bake in an oven to promote diffusion, and the profile near the interface takes on the erf(x) form at each point in time. &lt;/p&gt;\n\n&lt;p&gt;Also, I&amp;#39;m glad I offered you such a detailed response because I really enjoyed reading yours, I haven&amp;#39;t seen the diffusion equation in a spherical frame like that and it was fun trying to figure out where the second order derivative term of concentration vs position was hiding and neat to learn why there&amp;#39;s a first order derivative term!&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;d indulge me just briefly, though, I&amp;#39;m still a bit confused by your linear superposition. Why is it antisymmetrical about r=0? That seems like the opposite of what I&amp;#39;d expect given the symmetry that you expressed as dC/dr (r=0,t)=0. &lt;/p&gt;\n\n&lt;p&gt;Also, I guess I&amp;#39;m surprised that the time-invariant components of the solution still take on a sin(..r...) form. I&amp;#39;m not sure if I&amp;#39;m using the right term, by time-invariant components I mean those solutions to the system where the profile at time t=0 just re-scales over time and doesn&amp;#39;t change shape. These appear to be the sort of component that you&amp;#39;ve built your superposition out of. &lt;/p&gt;\n\n&lt;p&gt;A sin(r) (or other harmonic) time invariant profile makes sense for a 1d case, since if &lt;/p&gt;\n\n&lt;p&gt;C(r,0) is sin(r),&lt;/p&gt;\n\n&lt;p&gt;then&lt;/p&gt;\n\n&lt;p&gt;d/dt C(r,0) = d&lt;sup&gt;2&lt;/sup&gt; sin(r) / dr&lt;sup&gt;2&lt;/sup&gt; D = -sin(r) D, &lt;/p&gt;\n\n&lt;p&gt;which is pretty clearly satisfied over the course of time by C(r,t) = exp(-t/tau) sin(r), and I&amp;#39;m too lazy to solve for tau which has something to do with D. &lt;/p&gt;\n\n&lt;p&gt;But for your spherical case I would have for some reason expected the time invariant solutions to take on some different form, given that the spherical coordinate version of the diffustion equaiton is so different.&lt;/p&gt;\n\n&lt;p&gt;If I take the same initial condition C(r,0) = sin(r), and plug it into the spherical version to make the same t=0 sanity check as I did above, then: &lt;/p&gt;\n\n&lt;p&gt;d/dt C(r,0) = D/r&lt;sup&gt;2&lt;/sup&gt; * d/dr (r&lt;sup&gt;2&lt;/sup&gt; dC/dr) = D/r&lt;sup&gt;2&lt;/sup&gt; * d/dr (r&lt;sup&gt;2&lt;/sup&gt; d/dr sin(r))&lt;/p&gt;\n\n&lt;p&gt;d/dt C(r,0) = D/r&lt;sup&gt;2&lt;/sup&gt; * d/dr (r&lt;sup&gt;2&lt;/sup&gt; cos(r))&lt;/p&gt;\n\n&lt;p&gt;d/dt C(r,0) = D/r&lt;sup&gt;2&lt;/sup&gt; * ( 2r cos(r) - r&lt;sup&gt;2&lt;/sup&gt; sin(r))&lt;/p&gt;\n\n&lt;p&gt;Now I could be missing some deeply burried and forgotten trig identity, but that doesn&amp;#39;t look like it&amp;#39;s going to be a time invariant profile. Do exponentially decaying sin(n * pi * r/R) components really suffice to describe the concentration over all time for the spherical case?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dgcc3da", "score_hidden": false, "stickied": false, "created": 1492394196.0, "created_utc": 1492365396.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3g45", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RealKeanuReeves", "parent_id": "t1_dgb5kbi", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "Thanks for your well thought out reply! I see what you were trying to say with your eqns even if they didn't directly translate over. I think I am able to lump the bulk into an equivalent diffusivity since it's not a gas diffusing into the sphere. But what you said logically made sense. As long as the diffusion coefficient is large enough (and therefore the diffusion process is fast enough) then this will prevent a depletion region, as someone else on another thread called it, to surround the sphere upon initial contact and diffusion.\n\n\nIf you're interested at all (seeing as how in-depth you went I think you might be) the actual eqn I solved was the diffusion eqn:\n\n\n     dC/dt = D/r^2 * d/dr (r^2 dC/dr)\n\n\nThe system is a tumor spheroid surrounded by monoclonal antibodies (considered to be the fluid).\n\n\nFor assuming constant concentration at the sphere boundary, the conditions for solving were\n\n     C(r=R,t) = C1,       dC/dr (r=0,t)=0 (symmetry)\n     C(r, t=0) = 0\n\nAnd then through some substitutions, separation of variables, and superposition principle I got my result\n    \n     C(r,t) = C1 + C1*(constant)*(summation n=1 to infinity)*sin(n*pi*r/R)*exponential(dependent on t and n)\n\n\nWhen I asked an adviser about the idea of a non constant surface concentration, he made an analogy to Newton's law of cooling, where one of the boundary conditions would be\n\n\n    -D*dC/dr (r=R,t) = hC\n\n\nWhere h would be the mass transfer coefficient. Needless to say this does have a ridiculous solution that he actually solved and I really don't think I could hahahaha so I'm glad to just know what I for sure what I have to look out for with the assumptions. Thanks again\n    \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your well thought out reply! I see what you were trying to say with your eqns even if they didn&amp;#39;t directly translate over. I think I am able to lump the bulk into an equivalent diffusivity since it&amp;#39;s not a gas diffusing into the sphere. But what you said logically made sense. As long as the diffusion coefficient is large enough (and therefore the diffusion process is fast enough) then this will prevent a depletion region, as someone else on another thread called it, to surround the sphere upon initial contact and diffusion.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re interested at all (seeing as how in-depth you went I think you might be) the actual eqn I solved was the diffusion eqn:&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; dC/dt = D/r^2 * d/dr (r^2 dC/dr)\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;The system is a tumor spheroid surrounded by monoclonal antibodies (considered to be the fluid).&lt;/p&gt;\n\n&lt;p&gt;For assuming constant concentration at the sphere boundary, the conditions for solving were&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; C(r=R,t) = C1,       dC/dr (r=0,t)=0 (symmetry)\n C(r, t=0) = 0\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;And then through some substitutions, separation of variables, and superposition principle I got my result&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; C(r,t) = C1 + C1*(constant)*(summation n=1 to infinity)*sin(n*pi*r/R)*exponential(dependent on t and n)\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;When I asked an adviser about the idea of a non constant surface concentration, he made an analogy to Newton&amp;#39;s law of cooling, where one of the boundary conditions would be&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;-D*dC/dr (r=R,t) = hC\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Where h would be the mass transfer coefficient. Needless to say this does have a ridiculous solution that he actually solved and I really don&amp;#39;t think I could hahahaha so I&amp;#39;m glad to just know what I for sure what I have to look out for with the assumptions. Thanks again&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dgc3g45", "score_hidden": false, "stickied": false, "created": 1492382457.0, "created_utc": 1492353657.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5kbi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "InductorMan", "parent_id": "t3_65juot", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "A sphere is a somewhat hard system to analyze in a reddit post. If you start out with a one-dimensional system it's quite a bit easier. Maybe we can then say some things about the sphere.\n\nAlso, to make things easier, I'm going to say that when you bring the sphere and the medium into contact and wait forever, the equilibrium concentrations in the two materials are equal (the solubilities are equal). I think one can just do a little rescaling of the concentration profiles to account for differing solubilities, hopefully that hand-waving isn't unjustified.\n\nFirst off, in order to be able to say that the concentration C' at the surface of the material is equal to C1, you would have to be able to say that the diffusivity of the material in the surrounding medium is much higher than in the destination material. One way this might be true is if the surrounding medium is a pure fluid, and this fluid is what you're analyzing. If I'm remembering my highschool chemistry the chemical activity of a pure fluid is 1, so that's tantamount to a constant surface concentration.\n\nSame deal for a pure gas at constant pressure.\n\nIt gets much more intersting if the diffusive material is mixed into a solvent or a buffer gas. Then, you need to satisfy an equilibrium at the surface of the material. We'd better keep the concentration of the stuff small with respect to the solvent/buffer concentration so we can say that diffusivity is not concentration-dependent. Let's say that the diffusivity of the stuff is D1 outside of the material and D2 inside. You need to satisfy:\n\nD1 d/dx C1(x) = D2 d/dx C2(x),\n\nwhere C1(x) is the concentration profile outside, and C2(x) is the concentration profile inside.\n\nThis follows from conservation of mass, since the two sides of the equilibrium are the net transfer rates across the interface in each of the materials.\n\nIf you start out with two materials that are in perfect equilibrium and bring them into contact, then immediately what happens is that the concentration profiles inside of the materials start to look like the [error function](https://en.wikipedia.org/wiki/Error_function). If the diffusivities in the two materials are equal, and the initial concentration in the target material is zero, then C' ends up being half of C1(bulk) and the profile looks exactly like the profile on the Wiki page. If the diffusivities are unequal, then each profile in each material looks like half of the error function, but rescaled so that the slopes where they meet at the interface are discontinuous and satsify the above relationship.\n\nThis means that if the diffusivities are very unequal, the profile in the system with the much larger diffusivity will meet at the interface with a very small slope, and the total change in concentration in that medium will be very small: C' will basically equal C1(bulk) if the diffusivity in the medium surrounding is very high. \n\nOtherwise, C' = C1[bulk] [1/D2 / (1/D1 + 1/D2)] + C2[bulk] [1/D1 / (1/D1 + 1/D2)]\n\nSorry that's such a mess, I'm an electrical engineer and I don't know the actual formula offhand so I just am using the equivalent resistor divider formulas to get the result. This equation (if I've done it right) ought to work for arbitrary starting concentration, ie if the concentration in the target material isn't zero. If the concentration in the sphere starts at zero, then throw away the right hand term of the equation.\n\nInterestingly in the one dimensional case where this applies, C' _immediately_ reaches the equilibrium value and never departs from it, as the error function spreads out (rescales in the x direction), since in the 1D case each material is a reservoir with infinite extent. The rate of diffusion slows down as the error profiles spread out, since the slope at the interface is decreasing, but never stops.\n\nNow in your case, the sphere, we can say some qualitative things. The sphere is a finite reservoir, so eventually the sphere will end up in static equilibrium with the surrounding medium. At this point in time C1(bulk) = C' = C2(bulk). At some much earlier point in time, when the extent of diffusion was small compared to the radius of the sphere, the 1D approximation was valid, so earlier C' = that long ugly thing I wrote out. These two things aren't equal, so this means that the sphere case, analyzed over the whole course of time, does indeed need a changing surface concentration.\n\nNow, I'm not sure I actually addressed the problem you want. You mentioned mass transfer resistance, which doesn't come into play in the analysis I did. If you had a sphere immersed in a solid, porous matrix, and you had a gaseous species surrounding it, then a mass transfer resistance would be appropriate. But I think you ought to be able to lump it into an equivalent diffusivity.\n\nIt's probably a good time to try and account for different solubilities here. I believe what you'd do for solubilities S1 and S2 is rescale the error function profiles so they didn't meet at the interface, but instead C'1 / S1 = C'2 / S2, where C'x is the surface concentration on the side of the interface in material x. We totally still need to satisfy the criterion D1 d/dx C1(x) = D2 d/dx C2(x), since this is a conservation of mass equation. But now (and I'm getting here through a lot of mental hand waving, so I am not 100% sure on this one) the material with higher solubility appears to have a higher diffusivity, since the higher concentration of the substance on that side of the interface means that the initial gradient on that side of the interface is steeper. So I think you can say, for the case where C2[bulk] is zero so that I don't have to write out that whole mess above,\n\nC'1 = C1[bulk] [1/D2' / (1/D1 + 1/D2')]\n\nwhere\n\nD2' = D2 S2/S1\n\nThen also\n\nC'2 = C1[bulk](S2/S1) [1/D1' / (1/D2 + 1/D1')]\n\nwhere \n\nD1' = D1 S1/S2\n\nI think that's how it works, anyway. \n\nSo I think if I have answered your question at all, the answer is that diffusion from a bulk fluid into a sphere starts out as the 1D limiting case, and then as the sphere becomes saturated, reaches the ratio of concentrations dictated by the equilibrium solubilities. Since the surface concentrations are different in these two cases, the surface concentrations must be time dependent. When the medium in which the sphere is embedded has a much higer solubility and/or much higher diffusivity than the sphere itsself, then the surface concentration doesn't really change much over time.", "edited": 1492289615.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A sphere is a somewhat hard system to analyze in a reddit post. If you start out with a one-dimensional system it&amp;#39;s quite a bit easier. Maybe we can then say some things about the sphere.&lt;/p&gt;\n\n&lt;p&gt;Also, to make things easier, I&amp;#39;m going to say that when you bring the sphere and the medium into contact and wait forever, the equilibrium concentrations in the two materials are equal (the solubilities are equal). I think one can just do a little rescaling of the concentration profiles to account for differing solubilities, hopefully that hand-waving isn&amp;#39;t unjustified.&lt;/p&gt;\n\n&lt;p&gt;First off, in order to be able to say that the concentration C&amp;#39; at the surface of the material is equal to C1, you would have to be able to say that the diffusivity of the material in the surrounding medium is much higher than in the destination material. One way this might be true is if the surrounding medium is a pure fluid, and this fluid is what you&amp;#39;re analyzing. If I&amp;#39;m remembering my highschool chemistry the chemical activity of a pure fluid is 1, so that&amp;#39;s tantamount to a constant surface concentration.&lt;/p&gt;\n\n&lt;p&gt;Same deal for a pure gas at constant pressure.&lt;/p&gt;\n\n&lt;p&gt;It gets much more intersting if the diffusive material is mixed into a solvent or a buffer gas. Then, you need to satisfy an equilibrium at the surface of the material. We&amp;#39;d better keep the concentration of the stuff small with respect to the solvent/buffer concentration so we can say that diffusivity is not concentration-dependent. Let&amp;#39;s say that the diffusivity of the stuff is D1 outside of the material and D2 inside. You need to satisfy:&lt;/p&gt;\n\n&lt;p&gt;D1 d/dx C1(x) = D2 d/dx C2(x),&lt;/p&gt;\n\n&lt;p&gt;where C1(x) is the concentration profile outside, and C2(x) is the concentration profile inside.&lt;/p&gt;\n\n&lt;p&gt;This follows from conservation of mass, since the two sides of the equilibrium are the net transfer rates across the interface in each of the materials.&lt;/p&gt;\n\n&lt;p&gt;If you start out with two materials that are in perfect equilibrium and bring them into contact, then immediately what happens is that the concentration profiles inside of the materials start to look like the &lt;a href=\"https://en.wikipedia.org/wiki/Error_function\"&gt;error function&lt;/a&gt;. If the diffusivities in the two materials are equal, and the initial concentration in the target material is zero, then C&amp;#39; ends up being half of C1(bulk) and the profile looks exactly like the profile on the Wiki page. If the diffusivities are unequal, then each profile in each material looks like half of the error function, but rescaled so that the slopes where they meet at the interface are discontinuous and satsify the above relationship.&lt;/p&gt;\n\n&lt;p&gt;This means that if the diffusivities are very unequal, the profile in the system with the much larger diffusivity will meet at the interface with a very small slope, and the total change in concentration in that medium will be very small: C&amp;#39; will basically equal C1(bulk) if the diffusivity in the medium surrounding is very high. &lt;/p&gt;\n\n&lt;p&gt;Otherwise, C&amp;#39; = C1[bulk] [1/D2 / (1/D1 + 1/D2)] + C2[bulk] [1/D1 / (1/D1 + 1/D2)]&lt;/p&gt;\n\n&lt;p&gt;Sorry that&amp;#39;s such a mess, I&amp;#39;m an electrical engineer and I don&amp;#39;t know the actual formula offhand so I just am using the equivalent resistor divider formulas to get the result. This equation (if I&amp;#39;ve done it right) ought to work for arbitrary starting concentration, ie if the concentration in the target material isn&amp;#39;t zero. If the concentration in the sphere starts at zero, then throw away the right hand term of the equation.&lt;/p&gt;\n\n&lt;p&gt;Interestingly in the one dimensional case where this applies, C&amp;#39; &lt;em&gt;immediately&lt;/em&gt; reaches the equilibrium value and never departs from it, as the error function spreads out (rescales in the x direction), since in the 1D case each material is a reservoir with infinite extent. The rate of diffusion slows down as the error profiles spread out, since the slope at the interface is decreasing, but never stops.&lt;/p&gt;\n\n&lt;p&gt;Now in your case, the sphere, we can say some qualitative things. The sphere is a finite reservoir, so eventually the sphere will end up in static equilibrium with the surrounding medium. At this point in time C1(bulk) = C&amp;#39; = C2(bulk). At some much earlier point in time, when the extent of diffusion was small compared to the radius of the sphere, the 1D approximation was valid, so earlier C&amp;#39; = that long ugly thing I wrote out. These two things aren&amp;#39;t equal, so this means that the sphere case, analyzed over the whole course of time, does indeed need a changing surface concentration.&lt;/p&gt;\n\n&lt;p&gt;Now, I&amp;#39;m not sure I actually addressed the problem you want. You mentioned mass transfer resistance, which doesn&amp;#39;t come into play in the analysis I did. If you had a sphere immersed in a solid, porous matrix, and you had a gaseous species surrounding it, then a mass transfer resistance would be appropriate. But I think you ought to be able to lump it into an equivalent diffusivity.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s probably a good time to try and account for different solubilities here. I believe what you&amp;#39;d do for solubilities S1 and S2 is rescale the error function profiles so they didn&amp;#39;t meet at the interface, but instead C&amp;#39;1 / S1 = C&amp;#39;2 / S2, where C&amp;#39;x is the surface concentration on the side of the interface in material x. We totally still need to satisfy the criterion D1 d/dx C1(x) = D2 d/dx C2(x), since this is a conservation of mass equation. But now (and I&amp;#39;m getting here through a lot of mental hand waving, so I am not 100% sure on this one) the material with higher solubility appears to have a higher diffusivity, since the higher concentration of the substance on that side of the interface means that the initial gradient on that side of the interface is steeper. So I think you can say, for the case where C2[bulk] is zero so that I don&amp;#39;t have to write out that whole mess above,&lt;/p&gt;\n\n&lt;p&gt;C&amp;#39;1 = C1[bulk] [1/D2&amp;#39; / (1/D1 + 1/D2&amp;#39;)]&lt;/p&gt;\n\n&lt;p&gt;where&lt;/p&gt;\n\n&lt;p&gt;D2&amp;#39; = D2 S2/S1&lt;/p&gt;\n\n&lt;p&gt;Then also&lt;/p&gt;\n\n&lt;p&gt;C&amp;#39;2 = C1[bulk](S2/S1) [1/D1&amp;#39; / (1/D2 + 1/D1&amp;#39;)]&lt;/p&gt;\n\n&lt;p&gt;where &lt;/p&gt;\n\n&lt;p&gt;D1&amp;#39; = D1 S1/S2&lt;/p&gt;\n\n&lt;p&gt;I think that&amp;#39;s how it works, anyway. &lt;/p&gt;\n\n&lt;p&gt;So I think if I have answered your question at all, the answer is that diffusion from a bulk fluid into a sphere starts out as the 1D limiting case, and then as the sphere becomes saturated, reaches the ratio of concentrations dictated by the equilibrium solubilities. Since the surface concentrations are different in these two cases, the surface concentrations must be time dependent. When the medium in which the sphere is embedded has a much higer solubility and/or much higher diffusivity than the sphere itsself, then the surface concentration doesn&amp;#39;t really change much over time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dgb5kbi", "score_hidden": false, "stickied": false, "created": 1492318105.0, "created_utc": 1492289305.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_65juot", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhpi", "removal_reason": null, "link_id": "t3_65juot", "likes": null, "replies": "", "user_reports": [], "id": "dgavv8t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RealKeanuReeves", "parent_id": "t1_dgav7lj", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "Wut", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wut&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dgavv8t", "score_hidden": false, "stickied": false, "created": 1492304968.0, "created_utc": 1492276168.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgav7lj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "saabirevvarmi", "parent_id": "t3_65juot", "subreddit_name_prefixed": "r/engineering", "controversiality": 0, "body": "I don't know shit about engineering but I still read all of it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know shit about engineering but I still read all of it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "engineering", "name": "t1_dgav7lj", "score_hidden": false, "stickied": false, "created": 1492304062.0, "created_utc": 1492275262.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]