[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "architecture", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all\nI&amp;#39;m at a major crossroads in my educational life right now. I have been studying engineering in pursuit of a bachelors degree in biological engineering. I have the opportunity to pursue a B. Arch from a very well-respected architecture school. I want to receive a formal education in design, but becoming a practicing architect is not a priority for me. I simply want to find my way in the creative realm as opposed to the STEM realm that I have been around for a few years now. Does an education in architecture have benefits that aren&amp;#39;t strictly related to architectural practice? I sense that this discipline teaches principles that are present in almost any design field, and many non-design fields as well. Would it be foolish to go after this degree if I don&amp;#39;t have definite aspirations to practice?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all\nI'm at a major crossroads in my educational life right now. I have been studying engineering in pursuit of a bachelors degree in biological engineering. I have the opportunity to pursue a B. Arch from a very well-respected architecture school. I want to receive a formal education in design, but becoming a practicing architect is not a priority for me. I simply want to find my way in the creative realm as opposed to the STEM realm that I have been around for a few years now. Does an education in architecture have benefits that aren't strictly related to architectural practice? I sense that this discipline teaches principles that are present in almost any design field, and many non-design fields as well. Would it be foolish to go after this degree if I don't have definite aspirations to practice?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zq62", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "bobobbityboo", "saved": false, "mod_reports": [], "name": "t3_65zq62", "subreddit_name_prefixed": "r/architecture", "approved_by": null, "over_18": false, "domain": "self.architecture", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhae", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/architecture/comments/65zq62/architecture_school_without_wanting_to_be_an/", "num_reports": null, "locked": false, "stickied": false, "created": 1492506521.0, "url": "https://www.reddit.com/r/architecture/comments/65zq62/architecture_school_without_wanting_to_be_an/", "author_flair_text": null, "quarantine": false, "title": "Architecture school without wanting to be an architect", "created_utc": 1492477721.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhae", "removal_reason": null, "link_id": "t3_65zq62", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhae", "removal_reason": null, "link_id": "t3_65zq62", "likes": null, "replies": "", "user_reports": [], "id": "dgeoajv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bobobbityboo", "parent_id": "t1_dgelq9k", "subreddit_name_prefixed": "r/architecture", "controversiality": 0, "body": "Thank you, I think you convinced me to give the program a shot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I think you convinced me to give the program a shot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "architecture", "name": "t1_dgeoajv", "score_hidden": false, "stickied": false, "created": 1492517155.0, "created_utc": 1492488355.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgelq9k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Tonybc2888", "parent_id": "t3_65zq62", "subreddit_name_prefixed": "r/architecture", "controversiality": 0, "body": "I'm about to graduate from a masters of architecture program and I can tell you that more than 50% of the people I'm graduating with have zero desire to peruse a career in the professional field of architectural design. One colleague of mine went into the program with a desire to explore digitally built environments and is looking for work in VR, another was intrigued by education in building digital space to explore the capabilities of computer driven design. I don't have the interests that they do but talking with them about their passions are some of the most interest conversations I've ever had. Architecture is such a wide reaching field that adding a little kindling to the spark you have could start a fire you never thought was possible. \n\nThe best way I can answer your question:  I'm not familiar with any universally average figures, but my undergraduate architecture program(a very technically driven program) dropout rate was 60%. It wasn't because it was difficult or some kind of elitist program, it's because people figure out what they really want to do along the way. I've seen people find their calling in programming and digital design midway through. I had a friend date some girl that dropped out because she got a job as an digital animator in Silicon Valley because she liked rendering all day. In short; if you're thinking about it, architecture can be your gateway drug to figuring out how you design and what drives your passion. \n\nForgive the preachy way everything I said sounded. I could literally talk about it for hours and love this kind of discussion. I hope it answers your question and you find a way to itch the scratch you got. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m about to graduate from a masters of architecture program and I can tell you that more than 50% of the people I&amp;#39;m graduating with have zero desire to peruse a career in the professional field of architectural design. One colleague of mine went into the program with a desire to explore digitally built environments and is looking for work in VR, another was intrigued by education in building digital space to explore the capabilities of computer driven design. I don&amp;#39;t have the interests that they do but talking with them about their passions are some of the most interest conversations I&amp;#39;ve ever had. Architecture is such a wide reaching field that adding a little kindling to the spark you have could start a fire you never thought was possible. &lt;/p&gt;\n\n&lt;p&gt;The best way I can answer your question:  I&amp;#39;m not familiar with any universally average figures, but my undergraduate architecture program(a very technically driven program) dropout rate was 60%. It wasn&amp;#39;t because it was difficult or some kind of elitist program, it&amp;#39;s because people figure out what they really want to do along the way. I&amp;#39;ve seen people find their calling in programming and digital design midway through. I had a friend date some girl that dropped out because she got a job as an digital animator in Silicon Valley because she liked rendering all day. In short; if you&amp;#39;re thinking about it, architecture can be your gateway drug to figuring out how you design and what drives your passion. &lt;/p&gt;\n\n&lt;p&gt;Forgive the preachy way everything I said sounded. I could literally talk about it for hours and love this kind of discussion. I hope it answers your question and you find a way to itch the scratch you got. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "architecture", "name": "t1_dgelq9k", "score_hidden": false, "stickied": false, "created": 1492513576.0, "created_utc": 1492484776.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhae", "removal_reason": null, "link_id": "t3_65zq62", "likes": null, "replies": "", "user_reports": [], "id": "dgem4yu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sdavis08", "parent_id": "t3_65zq62", "subreddit_name_prefixed": "r/architecture", "controversiality": 0, "body": "I don't know your situation or how much a B.arch will cost you personally, but the B.Arch is typically a 5 year program, so your already looking at spending 20% more for that degree than you would for a non-accredited 4 year degree such as a BS of Architecture. If you are not planning on getting licenced than I see little reason to get a B.Arch.\n\n Architecture  is a vast field and there are many many different facets so I don't think getting a degree in architecture is a waste of time, however it's a pretty demanding major that requires a much larger time comittment than almost any other major. Overcoming The challenges can be quite fulfilling but I honestly don't think I would have made it through if I didn't  really want to be an architect. \n\nSome of my peers graduated with a B.Arch and now work in related feilds. A bunch went directly into construction management, a few to VR / gaming and a couple actually became product sales reps for various building material vendors. There are definitely people who leave with the degree and never practice or become licensed. I think what happens is people don't really know what they are getting themselves into and by the time they realize it's not for them they are already to heavily invested to walk away without a degree. \n\nIf I were you I'd try to find something a bit more broad, like a general liberal arts degree and then take a wide variety of  classes until I'd found what suits me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know your situation or how much a B.arch will cost you personally, but the B.Arch is typically a 5 year program, so your already looking at spending 20% more for that degree than you would for a non-accredited 4 year degree such as a BS of Architecture. If you are not planning on getting licenced than I see little reason to get a B.Arch.&lt;/p&gt;\n\n&lt;p&gt;Architecture  is a vast field and there are many many different facets so I don&amp;#39;t think getting a degree in architecture is a waste of time, however it&amp;#39;s a pretty demanding major that requires a much larger time comittment than almost any other major. Overcoming The challenges can be quite fulfilling but I honestly don&amp;#39;t think I would have made it through if I didn&amp;#39;t  really want to be an architect. &lt;/p&gt;\n\n&lt;p&gt;Some of my peers graduated with a B.Arch and now work in related feilds. A bunch went directly into construction management, a few to VR / gaming and a couple actually became product sales reps for various building material vendors. There are definitely people who leave with the degree and never practice or become licensed. I think what happens is people don&amp;#39;t really know what they are getting themselves into and by the time they realize it&amp;#39;s not for them they are already to heavily invested to walk away without a degree. &lt;/p&gt;\n\n&lt;p&gt;If I were you I&amp;#39;d try to find something a bit more broad, like a general liberal arts degree and then take a wide variety of  classes until I&amp;#39;d found what suits me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "architecture", "name": "t1_dgem4yu", "score_hidden": false, "stickied": false, "created": 1492514090.0, "created_utc": 1492485290.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhae", "removal_reason": null, "link_id": "t3_65zq62", "likes": null, "replies": "", "user_reports": [], "id": "dgep3fu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "js1893", "parent_id": "t3_65zq62", "subreddit_name_prefixed": "r/architecture", "controversiality": 0, "body": "Curious what you're interests are? I don't know anyone who pursued an architecture degree not wanting to be an architect from the start. As the others have said, it is a common thing for people to realize they want to do something else during the program and the degree definitely has versatile use, so I wouldn't say pursuing it is the wrong decision. My only thing is that it is a 5 year program on top of the schooling you've already done, which seems kind of like overkill if you're not planning to be a licensed architect. You could probably finish in under 4 years doing a B.S in architecture elsewhere, and it'll be just as good of an education. The B.Arch is required for licensure, but otherwise employers don't care which degree you got.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Curious what you&amp;#39;re interests are? I don&amp;#39;t know anyone who pursued an architecture degree not wanting to be an architect from the start. As the others have said, it is a common thing for people to realize they want to do something else during the program and the degree definitely has versatile use, so I wouldn&amp;#39;t say pursuing it is the wrong decision. My only thing is that it is a 5 year program on top of the schooling you&amp;#39;ve already done, which seems kind of like overkill if you&amp;#39;re not planning to be a licensed architect. You could probably finish in under 4 years doing a B.S in architecture elsewhere, and it&amp;#39;ll be just as good of an education. The B.Arch is required for licensure, but otherwise employers don&amp;#39;t care which degree you got.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "architecture", "name": "t1_dgep3fu", "score_hidden": false, "stickied": false, "created": 1492518351.0, "created_utc": 1492489551.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhae", "removal_reason": null, "link_id": "t3_65zq62", "likes": null, "replies": "", "user_reports": [], "id": "dgerksb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bergamaut", "parent_id": "t3_65zq62", "subreddit_name_prefixed": "r/architecture", "controversiality": 0, "body": "You really should find out what you actually want to do for a job and work backwards from there. You will be competing against graduates who actually studied the thing you want to do while you'll have two degrees in unrelated fields.\n\nYou'd be better off getting a biological engineering job (assuming you're at least halfway done with your degree) and then taking the time to explore different design disciplines in your free time, and then going back to school for what you want. ", "edited": 1492494059.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You really should find out what you actually want to do for a job and work backwards from there. You will be competing against graduates who actually studied the thing you want to do while you&amp;#39;ll have two degrees in unrelated fields.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;d be better off getting a biological engineering job (assuming you&amp;#39;re at least halfway done with your degree) and then taking the time to explore different design disciplines in your free time, and then going back to school for what you want. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "architecture", "name": "t1_dgerksb", "score_hidden": false, "stickied": false, "created": 1492522533.0, "created_utc": 1492493733.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]