[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I need to describe this new character in a way that the reader would immediately think &amp;quot;Gosh, this person will clearly be the villain. How long until they betray the protagonist?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My protagonist has entered this new city, and in that city rests a Magical Guild one of her friends belongs to. The obviously evil character is the strongest wizard of this guild, with no other Guild members even coming that close to his power.&lt;/p&gt;\n\n&lt;p&gt;See, him looking like that fits into his backstory. He very nearly fell to evil, and almost brought an end to the guild, but he was brought out of it by his friends and The Guild Master. Because he was almost irredeemable, and due to the nature of magic, he&amp;#39;s stuck looking as he does, and seems to radiate this presence of evil.&lt;/p&gt;\n\n&lt;p&gt;Currently I have him tall and pale looking with long black hair covering one of his eyes, a perpetual frown on his face, and a cloak that covers his arms and goes down to his knees.&lt;/p&gt;\n\n&lt;p&gt;I was also thinking of the protagonist flat out describing him as &amp;quot;evil-looking&amp;quot;, but I&amp;#39;m not sure if that seems too blatant or not.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I need to describe this new character in a way that the reader would immediately think \"Gosh, this person will clearly be the villain. How long until they betray the protagonist?\"\n\nMy protagonist has entered this new city, and in that city rests a Magical Guild one of her friends belongs to. The obviously evil character is the strongest wizard of this guild, with no other Guild members even coming that close to his power.\n\nSee, him looking like that fits into his backstory. He very nearly fell to evil, and almost brought an end to the guild, but he was brought out of it by his friends and The Guild Master. Because he was almost irredeemable, and due to the nature of magic, he's stuck looking as he does, and seems to radiate this presence of evil.\n\nCurrently I have him tall and pale looking with long black hair covering one of his eyes, a perpetual frown on his face, and a cloak that covers his arms and goes down to his knees.\n\nI was also thinking of the protagonist flat out describing him as \"evil-looking\", but I'm not sure if that seems too blatant or not.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rjaa", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "ProfessorRomendev", "saved": false, "mod_reports": [], "name": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/64rjaa/how_do_i_describe_a_character_that_looks/", "num_reports": null, "locked": false, "stickied": false, "created": 1491953442.0, "url": "https://www.reddit.com/r/writing/comments/64rjaa/how_do_i_describe_a_character_that_looks/", "author_flair_text": null, "quarantine": false, "title": "How do I describe a character that looks obviously evil?", "created_utc": 1491924642.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 20, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4n81h", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "thesimplemachine", "parent_id": "t1_dg4g92i", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "This is the kind of direction I would urge. The \"evil\" appearance OP describes is all superficial stuff that the character chooses to wear. He describes him as having dabbled with evil so much that it changed him, even though he is not evil anymore. If he's not evil anymore it wouldn't seem to make sense for him to choose to look evil (although the style he describes seems to suggest maybe the guy is a sort of brooding, sad type who was perhaps emotionally damaged by his experience with evil magic).\n\nPhysical alterations seem to be the right way to go though. That way it's like a scar; the character got too close to the flame and he got burnt, so to speak. Sort of how the Fable video game series does it. As you align with evil, your skin becomes pale, then these black veins start to lattice across your skin, at the extreme end of the spectrum you grow gigantic horns and your skin turns black.  ", "edited": 1491933968.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the kind of direction I would urge. The &amp;quot;evil&amp;quot; appearance OP describes is all superficial stuff that the character chooses to wear. He describes him as having dabbled with evil so much that it changed him, even though he is not evil anymore. If he&amp;#39;s not evil anymore it wouldn&amp;#39;t seem to make sense for him to choose to look evil (although the style he describes seems to suggest maybe the guy is a sort of brooding, sad type who was perhaps emotionally damaged by his experience with evil magic).&lt;/p&gt;\n\n&lt;p&gt;Physical alterations seem to be the right way to go though. That way it&amp;#39;s like a scar; the character got too close to the flame and he got burnt, so to speak. Sort of how the Fable video game series does it. As you align with evil, your skin becomes pale, then these black veins start to lattice across your skin, at the extreme end of the spectrum you grow gigantic horns and your skin turns black.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4n81h", "score_hidden": false, "stickied": false, "created": 1491962534.0, "created_utc": 1491933734.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4z845", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "247naptime", "parent_id": "t1_dg4g92i", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Nah, doesn't sound like Snape to me.  appearance maybe, but OP's character turns out to be good", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, doesn&amp;#39;t sound like Snape to me.  appearance maybe, but OP&amp;#39;s character turns out to be good&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4z845", "score_hidden": false, "stickied": false, "created": 1491975894.0, "created_utc": 1491947094.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4g92i", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "SockofBadKarma", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Well, first of all, you basically just described Severus Snape. Sooooo. I dunno if you wanted to do that, but be aware.\n\nThose features you described aren't really \"evil\", per se; they're more like the characteristics of a goth wannabe (aka Snape). I'd go for something more on-the-nose if magic actually physically warps people. The simplest addition would be non-matching eyes. One eye is normal, and the other is pure black, or it has a red iris and pupil, or it shimmers with some inexplicable malice, or it's literally a missing eye, and a thin trail of smoke permanently emanates from the eye socket. Or snake eyes. Or anything like that, really.\n\nNext thing would be to mess with his teeth and hands. Claws, sharpened fangs, et al. Then mess with his skin in some way other than \"he's pale\". A slow rot? Unnatural grayness? Lizardlike ridges or horns, maybe? Give him a hunchback, too, if you're really going for the gold. I'd basically emulate the appearance of early-stage mutations of Chaos humans in the *Warhammer* universe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, first of all, you basically just described Severus Snape. Sooooo. I dunno if you wanted to do that, but be aware.&lt;/p&gt;\n\n&lt;p&gt;Those features you described aren&amp;#39;t really &amp;quot;evil&amp;quot;, per se; they&amp;#39;re more like the characteristics of a goth wannabe (aka Snape). I&amp;#39;d go for something more on-the-nose if magic actually physically warps people. The simplest addition would be non-matching eyes. One eye is normal, and the other is pure black, or it has a red iris and pupil, or it shimmers with some inexplicable malice, or it&amp;#39;s literally a missing eye, and a thin trail of smoke permanently emanates from the eye socket. Or snake eyes. Or anything like that, really.&lt;/p&gt;\n\n&lt;p&gt;Next thing would be to mess with his teeth and hands. Claws, sharpened fangs, et al. Then mess with his skin in some way other than &amp;quot;he&amp;#39;s pale&amp;quot;. A slow rot? Unnatural grayness? Lizardlike ridges or horns, maybe? Give him a hunchback, too, if you&amp;#39;re really going for the gold. I&amp;#39;d basically emulate the appearance of early-stage mutations of Chaos humans in the &lt;em&gt;Warhammer&lt;/em&gt; universe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4g92i", "score_hidden": false, "stickied": false, "created": 1491954913.0, "created_utc": 1491926113.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4wlp5", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DavesWorldInfo", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "As /u/embur [mentioned](https://www.reddit.com/r/writing/comments/64rjaa/how_do_i_describe_a_character_that_looks/dg4kbhq/), actions speak louder than words.\n\nTo be very specific, it strikes me as a *very* bad idea to attempt to do what you say you want to do here ... even if you somehow pull it off.  Which I doubt you would, since you're asking for advice as to how.\n\nMotivations are established through storytelling, not something as weak and cheap as \"anyone who looked at him could just tell he was evil.\"  And I do emphasize weak and cheap, because odds are that's what the audience's reaction will be.\n\nThe choice you describe as wanting to pursue here will not be a benefit to your story unless you're writing comedy or satire.  It will read silly, obvious, and uninteresting.  Modern audiences are sophisticated and dislike being spoonfed every last detail.  They like to be able to draw their own conclusions, to ask their own questions as they read.  Looking for a way to bring a character on stage so their appearance makes everyone think \"ahh, that's the bad guy\" is just ... everything that's not beneficial.\n\nDon't do it.  Try harder.  Your story will turn out stronger if some effort is invested in building characters and narrative up in layers, rather than troweling things on clumsily and with low-effort slaps of obvious drawn-for-the-audience conclusions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As &lt;a href=\"/u/embur\"&gt;/u/embur&lt;/a&gt; &lt;a href=\"https://www.reddit.com/r/writing/comments/64rjaa/how_do_i_describe_a_character_that_looks/dg4kbhq/\"&gt;mentioned&lt;/a&gt;, actions speak louder than words.&lt;/p&gt;\n\n&lt;p&gt;To be very specific, it strikes me as a &lt;em&gt;very&lt;/em&gt; bad idea to attempt to do what you say you want to do here ... even if you somehow pull it off.  Which I doubt you would, since you&amp;#39;re asking for advice as to how.&lt;/p&gt;\n\n&lt;p&gt;Motivations are established through storytelling, not something as weak and cheap as &amp;quot;anyone who looked at him could just tell he was evil.&amp;quot;  And I do emphasize weak and cheap, because odds are that&amp;#39;s what the audience&amp;#39;s reaction will be.&lt;/p&gt;\n\n&lt;p&gt;The choice you describe as wanting to pursue here will not be a benefit to your story unless you&amp;#39;re writing comedy or satire.  It will read silly, obvious, and uninteresting.  Modern audiences are sophisticated and dislike being spoonfed every last detail.  They like to be able to draw their own conclusions, to ask their own questions as they read.  Looking for a way to bring a character on stage so their appearance makes everyone think &amp;quot;ahh, that&amp;#39;s the bad guy&amp;quot; is just ... everything that&amp;#39;s not beneficial.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t do it.  Try harder.  Your story will turn out stronger if some effort is invested in building characters and narrative up in layers, rather than troweling things on clumsily and with low-effort slaps of obvious drawn-for-the-audience conclusions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4wlp5", "score_hidden": false, "stickied": false, "created": 1491972765.0, "created_utc": 1491943965.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4z3gm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SecretBattleship", "parent_id": "t1_dg4j9dz", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I think your last point is where OP needs to focus. If people's interactions with him make it clear that they fear him, even if it's not clear why exactly, this could help make the character look evil to the reader. Untrustworthiness would also be a good way to portray this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your last point is where OP needs to focus. If people&amp;#39;s interactions with him make it clear that they fear him, even if it&amp;#39;s not clear why exactly, this could help make the character look evil to the reader. Untrustworthiness would also be a good way to portray this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4z3gm", "score_hidden": false, "stickied": false, "created": 1491975738.0, "created_utc": 1491946938.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4j9dz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "MrTemple", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; Currently I have him tall and pale looking with long black hair covering one of his eyes, a perpetual frown on his face, and a cloak that covers his arms and goes down to his knees.\n\nPhysical description alone can never achieve what you're asking. Readers are not going to take that and assume evil.\n\n&gt; But they're not evil. He just looks evil. In terms of personality he's actually a pretty nice guy. \n\nThe trouble is, what you're asking for is doable literarily, but I don't think it's plausible. I literally cannot think of a way that a character's physical appearance alone can 'look evil'. Even describing the stereotypical van dyke-sporting devil would be difficult to convey evil by physical characteristics alone.\n\nAnd worse, each person will have a different idea of what en evil physical appearance is.\n\nBut let's say that you want to do it this way...\n\nWhat you're likely going to have to do is decide what you think makes him look evil (corrupted physical form, sociopath's penetrating stare, goat-hooves and horns, whatever), but then show SOMEBODY ELSE judging his book by its cover.\n\nHave your guy do something the reader knows is benign, even good, but have another person (who perhaps doesn't know him) get an immediate 'evil' vibe from him, and completely misinterpret his actions.\n\nThat will establish that his physical countenance appears evil to some of the characters in your story.\n\nEven if the reader cannot imagine such a thing, if you do it well they will likely accept that your characters react this way.\n\n&gt; I was also thinking of the protagonist flat out describing him as \"evil-looking\", but I'm not sure if that seems too blatant or not.\n\nPretty unsubtle.\n\nReally, have you considered moving beyond physical appearance alone?\n\nFar more plausible I think is if he simply strikes people as evil. Whether through a combination of his looks, his presence, his speech, mannerisms, etc, it's much more believable to have a character who gives off an evil vibe than it is to have a character who merely *looks* evil. Plus, it's easier to evoke in the reader (either via an interaction with your MC or another character, as described above).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Currently I have him tall and pale looking with long black hair covering one of his eyes, a perpetual frown on his face, and a cloak that covers his arms and goes down to his knees.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Physical description alone can never achieve what you&amp;#39;re asking. Readers are not going to take that and assume evil.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But they&amp;#39;re not evil. He just looks evil. In terms of personality he&amp;#39;s actually a pretty nice guy. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The trouble is, what you&amp;#39;re asking for is doable literarily, but I don&amp;#39;t think it&amp;#39;s plausible. I literally cannot think of a way that a character&amp;#39;s physical appearance alone can &amp;#39;look evil&amp;#39;. Even describing the stereotypical van dyke-sporting devil would be difficult to convey evil by physical characteristics alone.&lt;/p&gt;\n\n&lt;p&gt;And worse, each person will have a different idea of what en evil physical appearance is.&lt;/p&gt;\n\n&lt;p&gt;But let&amp;#39;s say that you want to do it this way...&lt;/p&gt;\n\n&lt;p&gt;What you&amp;#39;re likely going to have to do is decide what you think makes him look evil (corrupted physical form, sociopath&amp;#39;s penetrating stare, goat-hooves and horns, whatever), but then show SOMEBODY ELSE judging his book by its cover.&lt;/p&gt;\n\n&lt;p&gt;Have your guy do something the reader knows is benign, even good, but have another person (who perhaps doesn&amp;#39;t know him) get an immediate &amp;#39;evil&amp;#39; vibe from him, and completely misinterpret his actions.&lt;/p&gt;\n\n&lt;p&gt;That will establish that his physical countenance appears evil to some of the characters in your story.&lt;/p&gt;\n\n&lt;p&gt;Even if the reader cannot imagine such a thing, if you do it well they will likely accept that your characters react this way.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I was also thinking of the protagonist flat out describing him as &amp;quot;evil-looking&amp;quot;, but I&amp;#39;m not sure if that seems too blatant or not.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Pretty unsubtle.&lt;/p&gt;\n\n&lt;p&gt;Really, have you considered moving beyond physical appearance alone?&lt;/p&gt;\n\n&lt;p&gt;Far more plausible I think is if he simply strikes people as evil. Whether through a combination of his looks, his presence, his speech, mannerisms, etc, it&amp;#39;s much more believable to have a character who gives off an evil vibe than it is to have a character who merely &lt;em&gt;looks&lt;/em&gt; evil. Plus, it&amp;#39;s easier to evoke in the reader (either via an interaction with your MC or another character, as described above).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4j9dz", "score_hidden": false, "stickied": false, "created": 1491958205.0, "created_utc": 1491929405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4jwdg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "geoff8733", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The best way to describe him as looking evil, without coming out and saying as much, would be to describe his appearance in the same manner as other villains in your story. Share motifs, shared turns of phrase, that kind of thing. \n\nIt's subtle, so if you want readers to instantly recognize those descriptors you'll need to have introduced a couple of obvious villains first. \n\nIf you want unambiguous then you're better off just having characters be wary of him because of his seeming corruption. This might paint the characters as prejudiced if you want the 'evil' character to be ambiguous. \n\nIf the character is intended to be evil, then being more direct could work. If you intend the character to be ultimately good then you'll want to be less direct. Setting the character up as someone who will betray the protagonist is going to make your readers expect a payoff from that. The more direct you make his 'evilness' the less ambiguity you're telling the reader to expect. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best way to describe him as looking evil, without coming out and saying as much, would be to describe his appearance in the same manner as other villains in your story. Share motifs, shared turns of phrase, that kind of thing. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s subtle, so if you want readers to instantly recognize those descriptors you&amp;#39;ll need to have introduced a couple of obvious villains first. &lt;/p&gt;\n\n&lt;p&gt;If you want unambiguous then you&amp;#39;re better off just having characters be wary of him because of his seeming corruption. This might paint the characters as prejudiced if you want the &amp;#39;evil&amp;#39; character to be ambiguous. &lt;/p&gt;\n\n&lt;p&gt;If the character is intended to be evil, then being more direct could work. If you intend the character to be ultimately good then you&amp;#39;ll want to be less direct. Setting the character up as someone who will betray the protagonist is going to make your readers expect a payoff from that. The more direct you make his &amp;#39;evilness&amp;#39; the less ambiguity you&amp;#39;re telling the reader to expect. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4jwdg", "score_hidden": false, "stickied": false, "created": 1491958894.0, "created_utc": 1491930094.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4g4ud", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "TonyDiGerolamo", "parent_id": "t1_dg4fqt8", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "You're talking about a D&amp;D world where anyone can dress pretty much like anything.  \"Evil looking\" is tough to define.  Pointy armor, bizarro weapons, black cloak---  All that stuff can be on a good guy in a world like that.\n\nI would go the other way.  If he was evil and then became good, what if he overcompensated with his appearance and went overboard trying to prove to everyone how good he was?  That would make him suspicious to reader.  I mean, if that's what you're going for.\n\nWhat's evil in this world?  He should have some sort of a visual association with it he can't get rid of.  Like a brand or a tattoo.  Otherwise, wouldn't he change his clothes?  Maybe it's the reaction of others when he walks into a place.  People either quickly get out of his way or eye him warily.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re talking about a D&amp;amp;D world where anyone can dress pretty much like anything.  &amp;quot;Evil looking&amp;quot; is tough to define.  Pointy armor, bizarro weapons, black cloak---  All that stuff can be on a good guy in a world like that.&lt;/p&gt;\n\n&lt;p&gt;I would go the other way.  If he was evil and then became good, what if he overcompensated with his appearance and went overboard trying to prove to everyone how good he was?  That would make him suspicious to reader.  I mean, if that&amp;#39;s what you&amp;#39;re going for.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s evil in this world?  He should have some sort of a visual association with it he can&amp;#39;t get rid of.  Like a brand or a tattoo.  Otherwise, wouldn&amp;#39;t he change his clothes?  Maybe it&amp;#39;s the reaction of others when he walks into a place.  People either quickly get out of his way or eye him warily.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4g4ud", "score_hidden": false, "stickied": false, "created": 1491954787.0, "created_utc": 1491925987.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4kbhq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "embur", "parent_id": "t1_dg4fqt8", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Actions speak louder than words. If you want the reader to think he's a bad guy, looks alone won't do it. You have to engineer circumstances that give the appearance of conflict against the protagonist. Make it look like he's in the directly at odds with the hero, then reveal the opposite. \n\nEven if your hero is a profoundly judgemental dick giving the audience their heavily-colored perceptions, it won't work with looks alone. Kvothe in the Kingkiller Chronicle paints Ambrose Jackiss in such a light as to make us hate him immediately, but Ambrose's actions are what seal the deal. Without direct conflict -- or at least the obvious appearance of such -- your reader won't just assume that the book is evil just because the cover looks to be. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actions speak louder than words. If you want the reader to think he&amp;#39;s a bad guy, looks alone won&amp;#39;t do it. You have to engineer circumstances that give the appearance of conflict against the protagonist. Make it look like he&amp;#39;s in the directly at odds with the hero, then reveal the opposite. &lt;/p&gt;\n\n&lt;p&gt;Even if your hero is a profoundly judgemental dick giving the audience their heavily-colored perceptions, it won&amp;#39;t work with looks alone. Kvothe in the Kingkiller Chronicle paints Ambrose Jackiss in such a light as to make us hate him immediately, but Ambrose&amp;#39;s actions are what seal the deal. Without direct conflict -- or at least the obvious appearance of such -- your reader won&amp;#39;t just assume that the book is evil just because the cover looks to be. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4kbhq", "score_hidden": false, "stickied": false, "created": 1491959360.0, "created_utc": 1491930560.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4fqt8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ProfessorRomendev", "parent_id": "t1_dg4f8t5", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "But they're not evil. He just looks evil. In terms of personality he's actually a pretty nice guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But they&amp;#39;re not evil. He just looks evil. In terms of personality he&amp;#39;s actually a pretty nice guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4fqt8", "score_hidden": false, "stickied": false, "created": 1491954359.0, "created_utc": 1491925559.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4f8t5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "TonyDiGerolamo", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "How we do the small things tells people how we do the big things.  A true sociopath doesn't care about anyone but themselves, so stepping on a dog, laughing at a beggar on the street and generally just behaving in a way that indicates the person has no compassion would send a clear signal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How we do the small things tells people how we do the big things.  A true sociopath doesn&amp;#39;t care about anyone but themselves, so stepping on a dog, laughing at a beggar on the street and generally just behaving in a way that indicates the person has no compassion would send a clear signal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4f8t5", "score_hidden": false, "stickied": false, "created": 1491953805.0, "created_utc": 1491925005.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4ffbx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AliceTheGamedev", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'd try to define what I associate with villainous looks. Google some movie villains (not the Darth Vader or Sauron kind, but the ones that have a face that you see and associate with their evilness), pick a few faces that you think make a good villain for you personally, and try to describe some of their attributes.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d try to define what I associate with villainous looks. Google some movie villains (not the Darth Vader or Sauron kind, but the ones that have a face that you see and associate with their evilness), pick a few faces that you think make a good villain for you personally, and try to describe some of their attributes.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4ffbx", "score_hidden": false, "stickied": false, "created": 1491954006.0, "created_utc": 1491925206.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4ttn9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EdwardPastaHands", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Make him ridiculously attractive with a perpetual smirk on his face ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make him ridiculously attractive with a perpetual smirk on his face &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4ttn9", "score_hidden": false, "stickied": false, "created": 1491969651.0, "created_utc": 1491940851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4xuvk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "yohohobo", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Scrap that physical description, unless you're very young and writing for children. The best villains are the ones we don't see coming: they don't necessarily *look* like one of the good guys, but tend to blend in. \n\nSo give your protagonist reason to doubt him, reason to suspect and be uncomfortable in his precence. Make him difficult to read. The surest sign that someone is going to betray the protagonist, is subtle hints that they are lying/ setting them up to fail/ involved with the more obvious bad guys etc. \n\nIf done properly, you'll have a reader constantly second guessing everything he says and does. If he eventually is not evil, it will make sense as the protagonist making assumptions. If he eventually is evil, it'll be foreshadowed so subtly you'll still get stung by the betrayal without screaming \"he's going to fuck you up!\" Three chapters too early. \n\nGiving him an ulterior motive does this well: a secret he's hiding and thus acting suspiciously, a person he's avoiding, a deal he's being secretly blackmailed to keep. \n\nHave the reader questioning, until the very end, if he ever really meant anything he said. If we don't know, we'll keep reading to find out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Scrap that physical description, unless you&amp;#39;re very young and writing for children. The best villains are the ones we don&amp;#39;t see coming: they don&amp;#39;t necessarily &lt;em&gt;look&lt;/em&gt; like one of the good guys, but tend to blend in. &lt;/p&gt;\n\n&lt;p&gt;So give your protagonist reason to doubt him, reason to suspect and be uncomfortable in his precence. Make him difficult to read. The surest sign that someone is going to betray the protagonist, is subtle hints that they are lying/ setting them up to fail/ involved with the more obvious bad guys etc. &lt;/p&gt;\n\n&lt;p&gt;If done properly, you&amp;#39;ll have a reader constantly second guessing everything he says and does. If he eventually is not evil, it will make sense as the protagonist making assumptions. If he eventually is evil, it&amp;#39;ll be foreshadowed so subtly you&amp;#39;ll still get stung by the betrayal without screaming &amp;quot;he&amp;#39;s going to fuck you up!&amp;quot; Three chapters too early. &lt;/p&gt;\n\n&lt;p&gt;Giving him an ulterior motive does this well: a secret he&amp;#39;s hiding and thus acting suspiciously, a person he&amp;#39;s avoiding, a deal he&amp;#39;s being secretly blackmailed to keep. &lt;/p&gt;\n\n&lt;p&gt;Have the reader questioning, until the very end, if he ever really meant anything he said. If we don&amp;#39;t know, we&amp;#39;ll keep reading to find out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4xuvk", "score_hidden": false, "stickied": false, "created": 1491974246.0, "created_utc": 1491945446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg5rbg3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dscares", "parent_id": "t1_dg5ib35", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Bonus points for animals being frightened of him unless they're things like carrion scavengers or predators (who needs a dog when you can have a hyena or a culture?), casts no shadow, no longer bleeds, or just giving people goosebumps when he's around.\n\nEdit: alopecia, too. No eyebrows gives people the willies!\n\nAnd glad I could help!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bonus points for animals being frightened of him unless they&amp;#39;re things like carrion scavengers or predators (who needs a dog when you can have a hyena or a culture?), casts no shadow, no longer bleeds, or just giving people goosebumps when he&amp;#39;s around.&lt;/p&gt;\n\n&lt;p&gt;Edit: alopecia, too. No eyebrows gives people the willies!&lt;/p&gt;\n\n&lt;p&gt;And glad I could help!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg5rbg3", "score_hidden": false, "stickied": false, "created": 1492026666.0, "created_utc": 1491997866.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ib35", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ProfessorRomendev", "parent_id": "t1_dg5fpn1", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I think this might be the best response I've gotten. I was focused on how he looked, but I never thought of how permanently his almost fall to evil would affect his magic. \n\nYeah, plants wilting and the air getting cold... I need to do stuff like that.\n\nThank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this might be the best response I&amp;#39;ve gotten. I was focused on how he looked, but I never thought of how permanently his almost fall to evil would affect his magic. &lt;/p&gt;\n\n&lt;p&gt;Yeah, plants wilting and the air getting cold... I need to do stuff like that.&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg5ib35", "score_hidden": false, "stickied": false, "created": 1492002691.0, "created_utc": 1491973891.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fpn1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dscares", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I take it you're trying to throw a redherring with your evil, so the audience doesn't see the twist coming?\n\nHave others treat him differently, first. People who know his past. Because that's what this is about, right? His trying to atone?\n\nHave other, more insidious traits about him, though. Subtle things he can't hide by just changing his clothing. Plants wilt when they're around him. Milk spoils, wine turns to vinegar after too long in his presence. All the nasty effects of evil magic that, no matter what he does, he'll never scrub free and people will always sense. Cold auras, frigid or unearthly hot hands, slight transformations he desperately tries to hide from others because of shame, so the reader will think he's trying to do it for obsfucation and suspect him all the more. \n\nAs far as clothing? Make him dress nice. This is 2017, no one trusts the rich.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I take it you&amp;#39;re trying to throw a redherring with your evil, so the audience doesn&amp;#39;t see the twist coming?&lt;/p&gt;\n\n&lt;p&gt;Have others treat him differently, first. People who know his past. Because that&amp;#39;s what this is about, right? His trying to atone?&lt;/p&gt;\n\n&lt;p&gt;Have other, more insidious traits about him, though. Subtle things he can&amp;#39;t hide by just changing his clothing. Plants wilt when they&amp;#39;re around him. Milk spoils, wine turns to vinegar after too long in his presence. All the nasty effects of evil magic that, no matter what he does, he&amp;#39;ll never scrub free and people will always sense. Cold auras, frigid or unearthly hot hands, slight transformations he desperately tries to hide from others because of shame, so the reader will think he&amp;#39;s trying to do it for obsfucation and suspect him all the more. &lt;/p&gt;\n\n&lt;p&gt;As far as clothing? Make him dress nice. This is 2017, no one trusts the rich.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg5fpn1", "score_hidden": false, "stickied": false, "created": 1491998095.0, "created_utc": 1491969295.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4vlh5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WoenixFright", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Having features that sort of hint at a violent past leads the reader to think that this character might be evil. So having this mysterious scar or magic-induced damage on his face might make the readers wonder, \"Who tried to kill him, and why?\" Of course, it might not have been a result of violence, maybe it was an experiment gone wrong or something like that, but the reader would have no way to know right off the bat. \n\nLike you said, simply describing him as \"Evil-looking\" is too on-the-nose, but there are ways to write that in without saying it! I'd consider having the protagonist be made uncomfortable in his presence. Have them notice that something is off about this \"bad guy,\" and maybe they get really nervous or antsy when he tries to interact with them. When you give the leading characters some preconceived judgments about a character, it can go a long way towards having the reader take up those judgments, too. \n\nGood luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having features that sort of hint at a violent past leads the reader to think that this character might be evil. So having this mysterious scar or magic-induced damage on his face might make the readers wonder, &amp;quot;Who tried to kill him, and why?&amp;quot; Of course, it might not have been a result of violence, maybe it was an experiment gone wrong or something like that, but the reader would have no way to know right off the bat. &lt;/p&gt;\n\n&lt;p&gt;Like you said, simply describing him as &amp;quot;Evil-looking&amp;quot; is too on-the-nose, but there are ways to write that in without saying it! I&amp;#39;d consider having the protagonist be made uncomfortable in his presence. Have them notice that something is off about this &amp;quot;bad guy,&amp;quot; and maybe they get really nervous or antsy when he tries to interact with them. When you give the leading characters some preconceived judgments about a character, it can go a long way towards having the reader take up those judgments, too. &lt;/p&gt;\n\n&lt;p&gt;Good luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4vlh5", "score_hidden": false, "stickied": false, "created": 1491971643.0, "created_utc": 1491942843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg4wl2o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vl99", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Scars (particularly on the face), a vocal affectation that makes him sound perpetually condescending. And if you want to come right out and say he looks evil, show don't tell. Say that \"he looks like the type of guy that spends his days off stealing candy from babies for giggles\" or something like that. You get the idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Scars (particularly on the face), a vocal affectation that makes him sound perpetually condescending. And if you want to come right out and say he looks evil, show don&amp;#39;t tell. Say that &amp;quot;he looks like the type of guy that spends his days off stealing candy from babies for giggles&amp;quot; or something like that. You get the idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg4wl2o", "score_hidden": false, "stickied": false, "created": 1491972746.0, "created_utc": 1491943946.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64rjaa", "likes": null, "replies": "", "user_reports": [], "id": "dg8621i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GriffinRaynor", "parent_id": "t3_64rjaa", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "- don't overuse the word evil, and I would drop the phrase \"turn to evil\" from your vocabulary. Unless you're writing a very black and white fairy tale story ideas of good and evil need to be complex and not cliche. \n\n- don't make him look evil, make him unpleasant. Suspicious, too frank, withdrawn, etc. Make your main characters dislike him, make your audience dislike him, and trick them into thinking they're right to do so.\n\n- other people have suggested using famous villains as inspiration. Be careful. Villain design is often based in racism and homophobia: dark hair/eyes/skin, big noses, effeminate male characters and masculine, homoerotic, or overly sexual female characters - these kinds of traits in villains are stereotypes and not endearing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;don&amp;#39;t overuse the word evil, and I would drop the phrase &amp;quot;turn to evil&amp;quot; from your vocabulary. Unless you&amp;#39;re writing a very black and white fairy tale story ideas of good and evil need to be complex and not cliche. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;don&amp;#39;t make him look evil, make him unpleasant. Suspicious, too frank, withdrawn, etc. Make your main characters dislike him, make your audience dislike him, and trick them into thinking they&amp;#39;re right to do so.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;other people have suggested using famous villains as inspiration. Be careful. Villain design is often based in racism and homophobia: dark hair/eyes/skin, big noses, effeminate male characters and masculine, homoerotic, or overly sexual female characters - these kinds of traits in villains are stereotypes and not endearing.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8621i", "score_hidden": false, "stickied": false, "created": 1492143959.0, "created_utc": 1492115159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]