[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s make things a bit more interesting shall we! Let&amp;#39;s write a piece of flash fiction (250 words or less) where the first sentence AND last sentence MUST include the Word of the Day!  &lt;/p&gt;\n\n&lt;p&gt;Are you up for the challenge?  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;UNTENABLE&lt;/strong&gt; (adj.) Not able to be defended or occupied.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Let's make things a bit more interesting shall we! Let's write a piece of flash fiction (250 words or less) where the first sentence AND last sentence MUST include the Word of the Day!  \n  \nAre you up for the challenge?  \n  \n**UNTENABLE** (adj.) Not able to be defended or occupied.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64yhrt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "ericadrayton", "saved": false, "mod_reports": [], "name": "t3_64yhrt", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "Author", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/64yhrt/word_of_the_day_untenable_writing_challenge/", "num_reports": null, "locked": false, "stickied": false, "created": 1492036237.0, "url": "https://www.reddit.com/r/writing/comments/64yhrt/word_of_the_day_untenable_writing_challenge/", "author_flair_text": "Self-Published Author", "quarantine": false, "title": "Word of the Day [UNTENABLE] Writing Challenge", "created_utc": 1492007437.0, "distinguished": null, "media": null, "upvote_ratio": 0.65, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64yhrt", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64yhrt", "likes": null, "replies": "", "user_reports": [], "id": "dg6ip2z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kamuimaru", "parent_id": "t1_dg64ztn", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "\"Nu... ance?\"\n\n\"That's right,\" I said. \"My name is Nuance.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Nu... ance?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That&amp;#39;s right,&amp;quot; I said. &amp;quot;My name is Nuance.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6ip2z", "score_hidden": false, "stickied": false, "created": 1492058284.0, "created_utc": 1492029484.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64ztn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "xblackshear", "parent_id": "t3_64yhrt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "My mother never really had a firm grasp on English and so when it came time to choose my name, just days after her and my father got off the boat in Los Angeles, her instinct on what would pass as a proper American given name failed her miserably as she uttered my name to the doctor: “Untenable.” Apparently neither the doctor nor the nurses attending her had any inclination to disabuse her of this choice. \n\nIn my first years, this name didn’t affect me much. My parents didn’t speak English at home, and anyway they and everyone else in my family called me “Ten”.\n \nIt wasn’t until I started elementary school that I started to suspect something was wrong. On that first day, I had never seen so many pink-faced, blue-eyed children in my life. It was as if I had gone to heaven, and now I was surrounded by a choir of golden-haired little angels. But this illusion was shattered the moment Ms. Jollenbach stumbled over my name during roll call. \n\n“Un... ten...able?” she asked hesitantly. Unaware that there was a problem, I raised my hand eagerly.\n\n“What’s your name, sweetheart,” she asked me, smiling. “I believe there’s a mistake on this printout.” At this, the little angels in the room began giggling maliciously.\n\n“Untenable,” I said proudly. This only seemed to encourage the children around me. “My name is Untenable,” I said again, my confidence deflating like a balloon with a tiny hole in it. \n", "edited": 1492015709.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mother never really had a firm grasp on English and so when it came time to choose my name, just days after her and my father got off the boat in Los Angeles, her instinct on what would pass as a proper American given name failed her miserably as she uttered my name to the doctor: “Untenable.” Apparently neither the doctor nor the nurses attending her had any inclination to disabuse her of this choice. &lt;/p&gt;\n\n&lt;p&gt;In my first years, this name didn’t affect me much. My parents didn’t speak English at home, and anyway they and everyone else in my family called me “Ten”.&lt;/p&gt;\n\n&lt;p&gt;It wasn’t until I started elementary school that I started to suspect something was wrong. On that first day, I had never seen so many pink-faced, blue-eyed children in my life. It was as if I had gone to heaven, and now I was surrounded by a choir of golden-haired little angels. But this illusion was shattered the moment Ms. Jollenbach stumbled over my name during roll call. &lt;/p&gt;\n\n&lt;p&gt;“Un... ten...able?” she asked hesitantly. Unaware that there was a problem, I raised my hand eagerly.&lt;/p&gt;\n\n&lt;p&gt;“What’s your name, sweetheart,” she asked me, smiling. “I believe there’s a mistake on this printout.” At this, the little angels in the room began giggling maliciously.&lt;/p&gt;\n\n&lt;p&gt;“Untenable,” I said proudly. This only seemed to encourage the children around me. “My name is Untenable,” I said again, my confidence deflating like a balloon with a tiny hole in it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg64ztn", "score_hidden": false, "stickied": false, "created": 1492044261.0, "created_utc": 1492015461.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64yhrt", "likes": null, "replies": "", "user_reports": [], "id": "dg68fp2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Rheagorethesilly", "parent_id": "t3_64yhrt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "\"I will not sit here and listen to this bullshit, I will not abide being put in the untenable position of caretaker to a bunch of half-men-children, and I will no longer attempt to hide my disdain for you all.\" This is how Margo St. John left the practice that she'd built with her late husband. \n\nIt’s bad enough the intern had filed the complaint with HR, but now she was actually demanding the promotion she was promised when the favors were exchanged. This was not unfamiliar waters for the partners. Around the time Henry was asking, \"How much would she cost us if we wanted it to just go away?\" Margo figured she was done. It wasn't until he said, \"Stop sending the cute ones his way.” that Margo felt her composure slip.\n\nShe’d honed her composure over years, and tempered it in the fires of this room. Her husband was the one who wanted this space. He was a good man, kind and gentle, not made for this work really. \n\nShe wasn't as good as he was. She was hard and stoic: the men of the office called her \"iron curtains.\" They thought she didn't know. She did.\n\nNow standing there, in that room she'd built, all she could feel was a complete empty nothing. She wondered why it took her so long to do this. Maybe she was just waiting for the whole damn thing to become as untenable and diseased as her husband's cancerous pancreas.     \n ", "edited": 1492019664.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I will not sit here and listen to this bullshit, I will not abide being put in the untenable position of caretaker to a bunch of half-men-children, and I will no longer attempt to hide my disdain for you all.&amp;quot; This is how Margo St. John left the practice that she&amp;#39;d built with her late husband. &lt;/p&gt;\n\n&lt;p&gt;It’s bad enough the intern had filed the complaint with HR, but now she was actually demanding the promotion she was promised when the favors were exchanged. This was not unfamiliar waters for the partners. Around the time Henry was asking, &amp;quot;How much would she cost us if we wanted it to just go away?&amp;quot; Margo figured she was done. It wasn&amp;#39;t until he said, &amp;quot;Stop sending the cute ones his way.” that Margo felt her composure slip.&lt;/p&gt;\n\n&lt;p&gt;She’d honed her composure over years, and tempered it in the fires of this room. Her husband was the one who wanted this space. He was a good man, kind and gentle, not made for this work really. &lt;/p&gt;\n\n&lt;p&gt;She wasn&amp;#39;t as good as he was. She was hard and stoic: the men of the office called her &amp;quot;iron curtains.&amp;quot; They thought she didn&amp;#39;t know. She did.&lt;/p&gt;\n\n&lt;p&gt;Now standing there, in that room she&amp;#39;d built, all she could feel was a complete empty nothing. She wondered why it took her so long to do this. Maybe she was just waiting for the whole damn thing to become as untenable and diseased as her husband&amp;#39;s cancerous pancreas.     &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg68fp2", "score_hidden": false, "stickied": false, "created": 1492047753.0, "created_utc": 1492018953.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64yhrt", "likes": null, "replies": "", "user_reports": [], "id": "dg5ymie", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DocCannery84", "parent_id": "t3_64yhrt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It was an untenable situation, I knew that from the start. You can go on massive winning streaks, but eventually the house always won. But here I was again, trying to double up. Not for the money even, but the girls it seemed to attract to the table. Now I sit here, looking at my fifteen, seeing the dealer's Ace. Scared. All they need is a picture card. Or a ten. I decide to take a card. It's a six. She turns over a seven for eighteen. A five for fourteen. Another eight. Busted. Maybe it's a good thing this game is untenable after all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was an untenable situation, I knew that from the start. You can go on massive winning streaks, but eventually the house always won. But here I was again, trying to double up. Not for the money even, but the girls it seemed to attract to the table. Now I sit here, looking at my fifteen, seeing the dealer&amp;#39;s Ace. Scared. All they need is a picture card. Or a ten. I decide to take a card. It&amp;#39;s a six. She turns over a seven for eighteen. A five for fourteen. Another eight. Busted. Maybe it&amp;#39;s a good thing this game is untenable after all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg5ymie", "score_hidden": false, "stickied": false, "created": 1492037341.0, "created_utc": 1492008541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64yhrt", "likes": null, "replies": "", "user_reports": [], "id": "dg6967l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "emelbee923", "parent_id": "t3_64yhrt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Untenable. \n\nThat's the word they kept using. I didn't know what it meant, but I sure as shit knew I didn't like where it landed me. Tossed into the deepest, darkest hole, away from anyone or anything I might harm in my crusade. \n\nI hurt people. I killed more. They earned it, whether the law saw it that way or not.\n\nThe law. There's a joke. Drunk on power, blurring the lines of right and wrong more than I ever did. The guy they prop up as some psychopath with a gun and vendetta.\n\nIt didn't matter to me, though. The words of a few corrupt assholes wouldn't change what I knew in my gut. My soul, if I bought into the idea. I had taken lives, but they had pushed the city to the brink of destruction to turn a profit.\n\nUntenable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Untenable. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the word they kept using. I didn&amp;#39;t know what it meant, but I sure as shit knew I didn&amp;#39;t like where it landed me. Tossed into the deepest, darkest hole, away from anyone or anything I might harm in my crusade. &lt;/p&gt;\n\n&lt;p&gt;I hurt people. I killed more. They earned it, whether the law saw it that way or not.&lt;/p&gt;\n\n&lt;p&gt;The law. There&amp;#39;s a joke. Drunk on power, blurring the lines of right and wrong more than I ever did. The guy they prop up as some psychopath with a gun and vendetta.&lt;/p&gt;\n\n&lt;p&gt;It didn&amp;#39;t matter to me, though. The words of a few corrupt assholes wouldn&amp;#39;t change what I knew in my gut. My soul, if I bought into the idea. I had taken lives, but they had pushed the city to the brink of destruction to turn a profit.&lt;/p&gt;\n\n&lt;p&gt;Untenable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6967l", "score_hidden": false, "stickied": false, "created": 1492048494.0, "created_utc": 1492019694.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64yhrt", "likes": null, "replies": "", "user_reports": [], "id": "dg6v4pr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nsongonya", "parent_id": "t3_64yhrt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Run on sentences are untenable grammatical phenomena, presently solely by the shittiest of writers, writers who think its edgy, writing exactly two hundred and fifty words in a single sentence; they think it adds sophistication, but I've got a secret for you: it doesn't; I read a run on sentence once and I ran away from it, it was that bad; it was as though the author meant for his or her first sentence to also be the last, but at the same time, he or she had little idea of how to stretch a sentence out to two hundred and fifty words, so instead he or she added extraneous words by using phrases such as “he or she” instead of simply referring to his or her own gender with a single pronoun, and then he or she just went on rambling about a different topic entirely; I went to the ice cream store yesterday; it was one of the ones where you squeeze your own ice cream out of a little anus shaped hole into a little toilet shaped bowl, and when you get to the end of the line, the cashier weighs your dump on the scale and asks you to pay according to weight, so this time I brought my own scale, a little thing that fit in the pocket of my skinny jeans without even looking too suspicious, and I measured it all up on that little scale before I went to the counter, the end.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Run on sentences are untenable grammatical phenomena, presently solely by the shittiest of writers, writers who think its edgy, writing exactly two hundred and fifty words in a single sentence; they think it adds sophistication, but I&amp;#39;ve got a secret for you: it doesn&amp;#39;t; I read a run on sentence once and I ran away from it, it was that bad; it was as though the author meant for his or her first sentence to also be the last, but at the same time, he or she had little idea of how to stretch a sentence out to two hundred and fifty words, so instead he or she added extraneous words by using phrases such as “he or she” instead of simply referring to his or her own gender with a single pronoun, and then he or she just went on rambling about a different topic entirely; I went to the ice cream store yesterday; it was one of the ones where you squeeze your own ice cream out of a little anus shaped hole into a little toilet shaped bowl, and when you get to the end of the line, the cashier weighs your dump on the scale and asks you to pay according to weight, so this time I brought my own scale, a little thing that fit in the pocket of my skinny jeans without even looking too suspicious, and I measured it all up on that little scale before I went to the counter, the end.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6v4pr", "score_hidden": false, "stickied": false, "created": 1492073226.0, "created_utc": 1492044426.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64yhrt", "likes": null, "replies": "", "user_reports": [], "id": "dg7eht2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flurpahderp", "parent_id": "t3_64yhrt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "\"This is outrageous!\", shouted the defense attorney in his untenable situation. His eyes widened in anger, staring at the new piece of evidence presented by the prosecutor. As the judge slammed his gavel downwards calling for order, the defense attorney took large strides towards the table on which all evidence lay. He swiftly grasped the item from the table and examined it from all angles. It looked merely like a large book, heavy and thick. Opening the book to study its contents, he discovered it was a photo album. As he gazed upon the pages, he gasped for breath. The photographs were of familiar people. Distant ghosts in a forest of memories. After flipping several pages, he found a particular picture showcasing a young man. The defense attorney looked up in horror. Everyone looked at him with patronizing looks, like they were feeling sorry for him. He oncemore looked at the photograph and realized it was a picture of him. It was  taken by his parents the last time he saw them alive, they day they visited him...\nA cold chill of realization ran down his spine as he looked up from the album oncemore. The courtroom seemed to be melting and the people vanished in puffs of smoke. Wood melted from the surfaces around him as padded walls revealed themselfs. He fell to his knees as the dredd sank in. The only thing that was truly untenable, was his mind....\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;This is outrageous!&amp;quot;, shouted the defense attorney in his untenable situation. His eyes widened in anger, staring at the new piece of evidence presented by the prosecutor. As the judge slammed his gavel downwards calling for order, the defense attorney took large strides towards the table on which all evidence lay. He swiftly grasped the item from the table and examined it from all angles. It looked merely like a large book, heavy and thick. Opening the book to study its contents, he discovered it was a photo album. As he gazed upon the pages, he gasped for breath. The photographs were of familiar people. Distant ghosts in a forest of memories. After flipping several pages, he found a particular picture showcasing a young man. The defense attorney looked up in horror. Everyone looked at him with patronizing looks, like they were feeling sorry for him. He oncemore looked at the photograph and realized it was a picture of him. It was  taken by his parents the last time he saw them alive, they day they visited him...\nA cold chill of realization ran down his spine as he looked up from the album oncemore. The courtroom seemed to be melting and the people vanished in puffs of smoke. Wood melted from the surfaces around him as padded walls revealed themselfs. He fell to his knees as the dredd sank in. The only thing that was truly untenable, was his mind....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7eht2", "score_hidden": false, "stickied": false, "created": 1492110097.0, "created_utc": 1492081297.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_64yhrt", "likes": null, "replies": "", "user_reports": [], "id": "dg6x75h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kaesch4", "parent_id": "t3_64yhrt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I stare past the tree branches looming above, as I lay, powerless, untenable. I try to latch my thoughts onto something, anything, to help me escape the sounds of panic in my children's voices, \" Dad, please say something!\" \"Where is the ambulance!?.\" The reality of the situation begins to sink in. I reach for the dirt, as if it can bring me strength to sit up, to fight the weight on my chest. A jet passes by, it looks so beautiful to me now. I suddenly feel myself in the window, looking down at a man surrounded by people. I want to reach for him but know in my heart I can't help him, he is untenable.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I stare past the tree branches looming above, as I lay, powerless, untenable. I try to latch my thoughts onto something, anything, to help me escape the sounds of panic in my children&amp;#39;s voices, &amp;quot; Dad, please say something!&amp;quot; &amp;quot;Where is the ambulance!?.&amp;quot; The reality of the situation begins to sink in. I reach for the dirt, as if it can bring me strength to sit up, to fight the weight on my chest. A jet passes by, it looks so beautiful to me now. I suddenly feel myself in the window, looking down at a man surrounded by people. I want to reach for him but know in my heart I can&amp;#39;t help him, he is untenable.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6x75h", "score_hidden": false, "stickied": false, "created": 1492075766.0, "created_utc": 1492046966.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]