[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My first novel is out on Amazon, and it sold OK when you consider my lack of marketing. It has a few (way too few) reviews, all of them positive (4 or 5 stars), and some of them even come from people who aren&amp;#39;t related to me :).&lt;/p&gt;\n\n&lt;p&gt;Now, I&amp;#39;m getting ready to publish my second novel. Since this is genre series fiction, the sales of one book should directly affect the next. My problem is, should I rewrite the first novel to bring it up to the current standard of what I&amp;#39;ve learned over the past year?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying the first novel is _bad, just that it&amp;#39;s not as good as what I can write now. I went in to revise the back matter and fix a couple of typos and there are some sections that just make me cringe. I hired an editor for my second book and the guy taught me a _lot. As a result, the second novel just feels tighter.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m concerned that once I&amp;#39;ve gotten the third and fourth books under my belt, I&amp;#39;ll be even better at this and want to rewrite all the preceding books. This could lead to a pretty vicious cycle where i spend all my time focusing on past works instead of creating new material.&lt;/p&gt;\n\n&lt;p&gt;So, my question is simple: Would you, if you were at my stage of development as a writer, rewrite your early work or focus on new projects?&lt;/p&gt;\n\n&lt;p&gt;EDIT: Wow, thanx for all the constructive comments. I think I&amp;#39;m going to leave it be and get cracking on book 3. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My first novel is out on Amazon, and it sold OK when you consider my lack of marketing. It has a few (way too few) reviews, all of them positive (4 or 5 stars), and some of them even come from people who aren't related to me :).\n\nNow, I'm getting ready to publish my second novel. Since this is genre series fiction, the sales of one book should directly affect the next. My problem is, should I rewrite the first novel to bring it up to the current standard of what I've learned over the past year?\n\nI'm not saying the first novel is _bad, just that it's not as good as what I can write now. I went in to revise the back matter and fix a couple of typos and there are some sections that just make me cringe. I hired an editor for my second book and the guy taught me a _lot. As a result, the second novel just feels tighter.\n\nI'm concerned that once I've gotten the third and fourth books under my belt, I'll be even better at this and want to rewrite all the preceding books. This could lead to a pretty vicious cycle where i spend all my time focusing on past works instead of creating new material.\n\nSo, my question is simple: Would you, if you were at my stage of development as a writer, rewrite your early work or focus on new projects?\n\n\nEDIT: Wow, thanx for all the constructive comments. I think I'm going to leave it be and get cracking on book 3. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "651vib", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "RabbiShekky", "saved": false, "mod_reports": [], "name": "t3_651vib", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": 1492106724.0, "link_flair_css_class": null, "author_flair_css_class": "Author", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/651vib/would_you_rewrite_a_published_novel/", "num_reports": null, "locked": false, "stickied": false, "created": 1492068675.0, "url": "https://www.reddit.com/r/writing/comments/651vib/would_you_rewrite_a_published_novel/", "author_flair_text": "Self-Published Author", "quarantine": false, "title": "Would you re-write a published novel?", "created_utc": 1492039875.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg759bi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jonodonozym", "parent_id": "t1_dg73oj6", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'd say it's more like having a multi-course meal. Currently, the first dish is average while the others are significantly better. By having a so-so first dish, people are going to assume the other dishes are the same and not order them.\n\nOne year later, looking back at the recipe of the first dish a more experienced chef might realize that some quantities of the ingredients could be changed, or some substituted with almost identical ingredients. The new dish will have the same name, the same general taste. It will have the same meaning and story behind the dish. But the flavors will be accentuated and enhanced, making the dish far more enjoyable.\n\nNot only does this make the first dish a better dish, but it helps the other dishes sell more since people think,  \"Sweet Jesus, that was a tasty meal. We should order more!\" People can't order the original dish any more; only the new one is available, and the chef doesn't even have to say he changed the recipe if that's an issue.\n\nSure, maybe it would be a better investment of energy to move on and start another series. But if you're carrying on with writing a series like OP is, most people will start at book 1 and only carry on if they liked it. Reviewing the first book is absolutely not a waste of time, and if OP feels like he wants to re-write it then he might as well do so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say it&amp;#39;s more like having a multi-course meal. Currently, the first dish is average while the others are significantly better. By having a so-so first dish, people are going to assume the other dishes are the same and not order them.&lt;/p&gt;\n\n&lt;p&gt;One year later, looking back at the recipe of the first dish a more experienced chef might realize that some quantities of the ingredients could be changed, or some substituted with almost identical ingredients. The new dish will have the same name, the same general taste. It will have the same meaning and story behind the dish. But the flavors will be accentuated and enhanced, making the dish far more enjoyable.&lt;/p&gt;\n\n&lt;p&gt;Not only does this make the first dish a better dish, but it helps the other dishes sell more since people think,  &amp;quot;Sweet Jesus, that was a tasty meal. We should order more!&amp;quot; People can&amp;#39;t order the original dish any more; only the new one is available, and the chef doesn&amp;#39;t even have to say he changed the recipe if that&amp;#39;s an issue.&lt;/p&gt;\n\n&lt;p&gt;Sure, maybe it would be a better investment of energy to move on and start another series. But if you&amp;#39;re carrying on with writing a series like OP is, most people will start at book 1 and only carry on if they liked it. Reviewing the first book is absolutely not a waste of time, and if OP feels like he wants to re-write it then he might as well do so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg759bi", "score_hidden": false, "stickied": false, "created": 1492086683.0, "created_utc": 1492057883.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73oj6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustinBrower", "parent_id": "t1_dg6s5fd", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "You get an upvote for the tiramisu cake comment :)\n\nI make a delicious tiramisu crepe cake.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You get an upvote for the tiramisu cake comment :)&lt;/p&gt;\n\n&lt;p&gt;I make a delicious tiramisu crepe cake.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg73oj6", "score_hidden": false, "stickied": false, "created": 1492084265.0, "created_utc": 1492055465.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6s5fd", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "cmbel2005", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It's like cooking a dish. Let's say learning how to make tiramisu cake (I love tiramisu cake). After trial and error and some tweaks, you finally make a first cake that you can call a cake. You eat it, and at that point in time, you're happy you even made it this far at all.\n\nNow if you vomit it back up and try to re-bake it together somehow, it's just going to be a vomit filled tiramisu cake. Nobody likes to eat the same cake they have already eaten, let alone pay for the vomit cake.\n\nNo, no, you should enjoy the story for what it is. It's already established and sets the basis for the series. Have you ever read or watched a trilogy? And how the first one is kind of good (Batman Begins), but the second one is considered better (The Dark Knight)? Christopher Nolan didn't go back and rehash Batman Begins because the Dark Knight was rated better.\n\nIt's not common practice. Maybe you can work something out where once you're done with the series, you can re-release the whole series as a single set of books and a major selling point could be \"extended\" scenes. And as part of those extensions you can tweak and improve some things.\n\nBut I don't really suggest re-writing the first book to bring it up to your current skill level. What happens if and when you do improve by the time you start Book 3? Are you going to want to then rewrite Book 1 and book 2 to the level of skill and quality of Book 3?\n\nI suggest against it and just be happy to start on the next installment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s like cooking a dish. Let&amp;#39;s say learning how to make tiramisu cake (I love tiramisu cake). After trial and error and some tweaks, you finally make a first cake that you can call a cake. You eat it, and at that point in time, you&amp;#39;re happy you even made it this far at all.&lt;/p&gt;\n\n&lt;p&gt;Now if you vomit it back up and try to re-bake it together somehow, it&amp;#39;s just going to be a vomit filled tiramisu cake. Nobody likes to eat the same cake they have already eaten, let alone pay for the vomit cake.&lt;/p&gt;\n\n&lt;p&gt;No, no, you should enjoy the story for what it is. It&amp;#39;s already established and sets the basis for the series. Have you ever read or watched a trilogy? And how the first one is kind of good (Batman Begins), but the second one is considered better (The Dark Knight)? Christopher Nolan didn&amp;#39;t go back and rehash Batman Begins because the Dark Knight was rated better.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not common practice. Maybe you can work something out where once you&amp;#39;re done with the series, you can re-release the whole series as a single set of books and a major selling point could be &amp;quot;extended&amp;quot; scenes. And as part of those extensions you can tweak and improve some things.&lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t really suggest re-writing the first book to bring it up to your current skill level. What happens if and when you do improve by the time you start Book 3? Are you going to want to then rewrite Book 1 and book 2 to the level of skill and quality of Book 3?&lt;/p&gt;\n\n&lt;p&gt;I suggest against it and just be happy to start on the next installment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6s5fd", "score_hidden": false, "stickied": false, "created": 1492069594.0, "created_utc": 1492040794.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg6twf2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "dying_pteradactyl", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I think the answer here is - it depends.\n\nYou will always be growing as a writer which means you'll always look back on older work and cringe a little or think 'I could do this better now'. This is something you just have to learn to live with. If you had gone the trade publishing route you wouldn't even have the option of revising (unless you came to some kind of agreement with your publisher).\n\nThe reason I say it depends is because it sounds like you've made bigger leaps than usual between this first and second novel - mainly, you've hired an editor and done a proper edit on novel 2.\n\nLots of self-pubbers rush into their first novel without thinking about the important things like a good cover or a proper edit. And a proper edit can mean the difference between just another self-published novel and a professional level product.\n\nHad this first novel been a stand alone I would have said 100% leave it be. But since it's the start of a series, since new readers will be reading this novel first and deciding whether to keep reading based on that alone... well maybe it is worth doing a proper revision just this one time. It all depends on how wide the gap is between book 1 and 2. If 1 is potentially going to lose you readers then maybe it is a good idea.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the answer here is - it depends.&lt;/p&gt;\n\n&lt;p&gt;You will always be growing as a writer which means you&amp;#39;ll always look back on older work and cringe a little or think &amp;#39;I could do this better now&amp;#39;. This is something you just have to learn to live with. If you had gone the trade publishing route you wouldn&amp;#39;t even have the option of revising (unless you came to some kind of agreement with your publisher).&lt;/p&gt;\n\n&lt;p&gt;The reason I say it depends is because it sounds like you&amp;#39;ve made bigger leaps than usual between this first and second novel - mainly, you&amp;#39;ve hired an editor and done a proper edit on novel 2.&lt;/p&gt;\n\n&lt;p&gt;Lots of self-pubbers rush into their first novel without thinking about the important things like a good cover or a proper edit. And a proper edit can mean the difference between just another self-published novel and a professional level product.&lt;/p&gt;\n\n&lt;p&gt;Had this first novel been a stand alone I would have said 100% leave it be. But since it&amp;#39;s the start of a series, since new readers will be reading this novel first and deciding whether to keep reading based on that alone... well maybe it is worth doing a proper revision just this one time. It all depends on how wide the gap is between book 1 and 2. If 1 is potentially going to lose you readers then maybe it is a good idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6twf2", "score_hidden": false, "stickied": false, "created": 1492071775.0, "created_utc": 1492042975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg6rxun", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MrTemple", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; So, my question is simple: Would you, if you were at my stage of development as a writer, rewrite your early work or focus on new projects?\n\nYou will never feel 100% satisfied with a work. \n\nWhere do you want to devote your energies? Improving your old stories or creating new, better stories?\n\nThat's a question for you to decide.\n\nBut I wonder about that growth you experienced writing and revising your second book. Would you have had that same growth if you had spent that effort rewriting and revising your first book? Would the first book have wound up as good as your second?\n\nSame questions apply to whether or not you should write and revise a third book, or spend that effort rewriting and revising your first.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So, my question is simple: Would you, if you were at my stage of development as a writer, rewrite your early work or focus on new projects?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You will never feel 100% satisfied with a work. &lt;/p&gt;\n\n&lt;p&gt;Where do you want to devote your energies? Improving your old stories or creating new, better stories?&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a question for you to decide.&lt;/p&gt;\n\n&lt;p&gt;But I wonder about that growth you experienced writing and revising your second book. Would you have had that same growth if you had spent that effort rewriting and revising your first book? Would the first book have wound up as good as your second?&lt;/p&gt;\n\n&lt;p&gt;Same questions apply to whether or not you should write and revise a third book, or spend that effort rewriting and revising your first.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6rxun", "score_hidden": false, "stickied": false, "created": 1492069338.0, "created_utc": 1492040538.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg6za6c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fairly_bookish", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "If you're passionate about the story, I don't see a problem with it. \n\nTake *The Gunslinger* for example. The revised edition is the first version I read, ~15 years ago. Last year I read the original version, because I'd had several people tell me they preferred the original. \n\nThe story was much the same, but the writing was... I'd almost call it *bad*. King himself says in the introduction to the revised edition that the original is difficult to read, and I agree. It doesn't have the same flow that his later books do. \n\nI just started reading the revised edition again a few days ago, and I now remember why this is my favorite book in the series. \n\nThat said, King did wait 20 years before he went back and revised that book. So maybe I would say hold off a little longer. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re passionate about the story, I don&amp;#39;t see a problem with it. &lt;/p&gt;\n\n&lt;p&gt;Take &lt;em&gt;The Gunslinger&lt;/em&gt; for example. The revised edition is the first version I read, ~15 years ago. Last year I read the original version, because I&amp;#39;d had several people tell me they preferred the original. &lt;/p&gt;\n\n&lt;p&gt;The story was much the same, but the writing was... I&amp;#39;d almost call it &lt;em&gt;bad&lt;/em&gt;. King himself says in the introduction to the revised edition that the original is difficult to read, and I agree. It doesn&amp;#39;t have the same flow that his later books do. &lt;/p&gt;\n\n&lt;p&gt;I just started reading the revised edition again a few days ago, and I now remember why this is my favorite book in the series. &lt;/p&gt;\n\n&lt;p&gt;That said, King did wait 20 years before he went back and revised that book. So maybe I would say hold off a little longer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6za6c", "score_hidden": false, "stickied": false, "created": 1492078356.0, "created_utc": 1492049556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg7fr63", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "katfletcher", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Do not be George Lucas.\n\nIt sounds like you've done what needs to be done. If you edited the first yourself, send it for line edits--that's what I did. But don't sit down and do a full revision, there's no payoff and as you said, you will keep learning and it will lead to a lot of wasted time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not be George Lucas.&lt;/p&gt;\n\n&lt;p&gt;It sounds like you&amp;#39;ve done what needs to be done. If you edited the first yourself, send it for line edits--that&amp;#39;s what I did. But don&amp;#39;t sit down and do a full revision, there&amp;#39;s no payoff and as you said, you will keep learning and it will lead to a lot of wasted time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7fr63", "score_hidden": false, "stickied": false, "created": 1492113011.0, "created_utc": 1492084211.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg73vor", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "clashbuster", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The cooking thing is a very poor analogy. Don't listen to that.\n\nMost cooks perfect a dish by cooking the exact same dish many many times.\n\nIn theory the same rules would apply to book writing. Infact many writers do exactly that. The first draft is just the outline or whatever. \"good writing is rewriting\" You know the drill and the sayings.\n\nThe answer is yes OP may write a much better version of book 1, but it will probably not sell that great because people have already read it.\n\nAlso, fans might think OP released the first book when it was unfinished.\n\nHowever, in the writing world books get rewritten all the time and it's not necessarily a bad thing. IIRC JK rowling rewrote one book 7 times (or so she claims)\n\nLastly an unknown self published book can easily be forgotten by the world. The fact that you've published it doesn't really mean all that much especially if it could use improvements. if you rewrite it better it might even take off in a great way.\n\nPoint being it's entirely up to you. If you think that work can be improved and deserves to be improved then do it. There's absolutely no doubt you would improve on it by rewriting.\n\nI'de just say don't get hung up on a book for too long. Do your diligence. first draft it. Devote enough energy to rewrite the entire thing at least once during your editing, but don't stagnate.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The cooking thing is a very poor analogy. Don&amp;#39;t listen to that.&lt;/p&gt;\n\n&lt;p&gt;Most cooks perfect a dish by cooking the exact same dish many many times.&lt;/p&gt;\n\n&lt;p&gt;In theory the same rules would apply to book writing. Infact many writers do exactly that. The first draft is just the outline or whatever. &amp;quot;good writing is rewriting&amp;quot; You know the drill and the sayings.&lt;/p&gt;\n\n&lt;p&gt;The answer is yes OP may write a much better version of book 1, but it will probably not sell that great because people have already read it.&lt;/p&gt;\n\n&lt;p&gt;Also, fans might think OP released the first book when it was unfinished.&lt;/p&gt;\n\n&lt;p&gt;However, in the writing world books get rewritten all the time and it&amp;#39;s not necessarily a bad thing. IIRC JK rowling rewrote one book 7 times (or so she claims)&lt;/p&gt;\n\n&lt;p&gt;Lastly an unknown self published book can easily be forgotten by the world. The fact that you&amp;#39;ve published it doesn&amp;#39;t really mean all that much especially if it could use improvements. if you rewrite it better it might even take off in a great way.&lt;/p&gt;\n\n&lt;p&gt;Point being it&amp;#39;s entirely up to you. If you think that work can be improved and deserves to be improved then do it. There&amp;#39;s absolutely no doubt you would improve on it by rewriting.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;de just say don&amp;#39;t get hung up on a book for too long. Do your diligence. first draft it. Devote enough energy to rewrite the entire thing at least once during your editing, but don&amp;#39;t stagnate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg73vor", "score_hidden": false, "stickied": false, "created": 1492084560.0, "created_utc": 1492055760.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg6vm5f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Malshandir", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Authors sometimes do this, but the reason is usually not so much \"I'm a better writer now\" as it is \"I painted myself into a corner in that book, I need to fix some things for the next book in the series\", or \"Huh, so Mercury isn't tide-locked after all\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Authors sometimes do this, but the reason is usually not so much &amp;quot;I&amp;#39;m a better writer now&amp;quot; as it is &amp;quot;I painted myself into a corner in that book, I need to fix some things for the next book in the series&amp;quot;, or &amp;quot;Huh, so Mercury isn&amp;#39;t tide-locked after all&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg6vm5f", "score_hidden": false, "stickied": false, "created": 1492073799.0, "created_utc": 1492044999.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg70766", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scijior", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Tolkien rewrote The Hobbit to accommodate changes in the story created by Lord of the Rings. \n\nLucas renamed \"Star Wars\" to \"Episode IV: A New Hope\" (and then unnecessarily edited it twenty years later).\n\nShit happens. Do what you want. Happiness is the only metric available of actual accomplishment in your own lifetime. For remember Percy Shelley's *Ozymandias*:\n\nI met a traveller from an antique land\nWho said: Two vast and trunkless legs of stone\nStand in the desert…. Near them, on the sand,\nHalf sunk, a shattered visage lies, whose frown,\nAnd wrinkled lip, and sneer of cold command,\nTell that its sculptor well those passions read\nWhich yet survive, stamped on these lifeless things,\nThe hand that mocked them, and the heart that fed:\nAnd on the pedestal these words appear:\n*'My name is Ozymandias, king of kings:*\n*Look on my works, ye Mighty, and despair!'*\n**Nothing beside remains. Round the decay**\n**Of that colossal wreck, boundless and bare**\n**The lone and level sands stretch far away.**\n\nDo what makes you happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tolkien rewrote The Hobbit to accommodate changes in the story created by Lord of the Rings. &lt;/p&gt;\n\n&lt;p&gt;Lucas renamed &amp;quot;Star Wars&amp;quot; to &amp;quot;Episode IV: A New Hope&amp;quot; (and then unnecessarily edited it twenty years later).&lt;/p&gt;\n\n&lt;p&gt;Shit happens. Do what you want. Happiness is the only metric available of actual accomplishment in your own lifetime. For remember Percy Shelley&amp;#39;s &lt;em&gt;Ozymandias&lt;/em&gt;:&lt;/p&gt;\n\n&lt;p&gt;I met a traveller from an antique land\nWho said: Two vast and trunkless legs of stone\nStand in the desert…. Near them, on the sand,\nHalf sunk, a shattered visage lies, whose frown,\nAnd wrinkled lip, and sneer of cold command,\nTell that its sculptor well those passions read\nWhich yet survive, stamped on these lifeless things,\nThe hand that mocked them, and the heart that fed:\nAnd on the pedestal these words appear:\n&lt;em&gt;&amp;#39;My name is Ozymandias, king of kings:&lt;/em&gt;\n&lt;em&gt;Look on my works, ye Mighty, and despair!&amp;#39;&lt;/em&gt;\n&lt;strong&gt;Nothing beside remains. Round the decay&lt;/strong&gt;\n&lt;strong&gt;Of that colossal wreck, boundless and bare&lt;/strong&gt;\n&lt;strong&gt;The lone and level sands stretch far away.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Do what makes you happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg70766", "score_hidden": false, "stickied": false, "created": 1492079488.0, "created_utc": 1492050688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg85qqd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sarah_ahiers", "parent_id": "t1_dg84u4r", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Oh definitely!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh definitely!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg85qqd", "score_hidden": false, "stickied": false, "created": 1492143616.0, "created_utc": 1492114816.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84u4r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ur_story_is_cool_bro", "parent_id": "t1_dg7kdq6", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "For sure, but that is a hell of a larger endeavor than editing in the cloud and updating a file!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For sure, but that is a hell of a larger endeavor than editing in the cloud and updating a file!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg84u4r", "score_hidden": false, "stickied": false, "created": 1492142615.0, "created_utc": 1492113815.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kdq6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sarah_ahiers", "parent_id": "t1_dg718kk", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; I think in 1 out of 3 physical books I read I find errors, namely spelling, and don't you think if the publisher could go back and fix those they would?\n\nActually they do fix them on subsequent printings (if the book goes into a second or third printing)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think in 1 out of 3 physical books I read I find errors, namely spelling, and don&amp;#39;t you think if the publisher could go back and fix those they would?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually they do fix them on subsequent printings (if the book goes into a second or third printing)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7kdq6", "score_hidden": false, "stickied": false, "created": 1492120273.0, "created_utc": 1492091473.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg718kk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ur_story_is_cool_bro", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I've had books on my Kindle that are updated a few times. I couldn't tell you the updates since I've either already read them and don't go back, or have yet to get to them and won't know what was different before. \n\nI would say polishing it up isn't a bad thing. I wouldn't make it a whole different story by changing major plots/characters/scenes though. Shoring up some dialog, grammar, or descriptions won't change the overall book.\n\nI think in 1 out of 3 physical books I read I find errors, namely spelling, and don't you think if the publisher could go back and fix those they would? Haha.\n\nBut don't get stuck in the past- if this is series like you mentioned, look forward, and keep creating!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had books on my Kindle that are updated a few times. I couldn&amp;#39;t tell you the updates since I&amp;#39;ve either already read them and don&amp;#39;t go back, or have yet to get to them and won&amp;#39;t know what was different before. &lt;/p&gt;\n\n&lt;p&gt;I would say polishing it up isn&amp;#39;t a bad thing. I wouldn&amp;#39;t make it a whole different story by changing major plots/characters/scenes though. Shoring up some dialog, grammar, or descriptions won&amp;#39;t change the overall book.&lt;/p&gt;\n\n&lt;p&gt;I think in 1 out of 3 physical books I read I find errors, namely spelling, and don&amp;#39;t you think if the publisher could go back and fix those they would? Haha.&lt;/p&gt;\n\n&lt;p&gt;But don&amp;#39;t get stuck in the past- if this is series like you mentioned, look forward, and keep creating!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg718kk", "score_hidden": false, "stickied": false, "created": 1492080836.0, "created_utc": 1492052036.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg7ye8q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RabbiShekky", "parent_id": "t1_dg741h6", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I was leaning towards doing it. I wouldn't change the plot or anything, but there are at least three scenes I could figuratively hack out with a machete, replace with a simple paragraph, and improve the pacing.\n\nI think, based on the comments I've received, that I might leave it be, though, and focus on getting on with book three.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was leaning towards doing it. I wouldn&amp;#39;t change the plot or anything, but there are at least three scenes I could figuratively hack out with a machete, replace with a simple paragraph, and improve the pacing.&lt;/p&gt;\n\n&lt;p&gt;I think, based on the comments I&amp;#39;ve received, that I might leave it be, though, and focus on getting on with book three.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7ye8q", "score_hidden": false, "stickied": false, "created": 1492135661.0, "created_utc": 1492106861.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg741h6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustinBrower", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "In response to the question of what I would do: if it's published, I would leave it be (unless there was reason to revisit it: calls to improve the writing and consistency, scenes to add/add back in/extend, etc.).\n\nWhat path are you leaning more toward? You seem in the middle, but I can't quite tell as you see the costs and benefits of both sides, yet give no indication of which you're on.", "edited": 1492058728.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In response to the question of what I would do: if it&amp;#39;s published, I would leave it be (unless there was reason to revisit it: calls to improve the writing and consistency, scenes to add/add back in/extend, etc.).&lt;/p&gt;\n\n&lt;p&gt;What path are you leaning more toward? You seem in the middle, but I can&amp;#39;t quite tell as you see the costs and benefits of both sides, yet give no indication of which you&amp;#39;re on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg741h6", "score_hidden": false, "stickied": false, "created": 1492084803.0, "created_utc": 1492056003.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg74otz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hc84", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I actually have a novel I want to rewrite, but haven't got around to it, because it's kind of a mess. I think you should try it out though, if you really feel strongly about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually have a novel I want to rewrite, but haven&amp;#39;t got around to it, because it&amp;#39;s kind of a mess. I think you should try it out though, if you really feel strongly about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg74otz", "score_hidden": false, "stickied": false, "created": 1492085783.0, "created_utc": 1492056983.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg7eat7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ruzkin", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "How *little* can you do on this rewrite and still feel good about the results? Can you do a general copy-edit? Revise a couple key scenes? If you can give your first novel a spit-and-polish in a couple weeks, sure, do it. If it's going to consume you for the next six months, walk away. Never look back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How &lt;em&gt;little&lt;/em&gt; can you do on this rewrite and still feel good about the results? Can you do a general copy-edit? Revise a couple key scenes? If you can give your first novel a spit-and-polish in a couple weeks, sure, do it. If it&amp;#39;s going to consume you for the next six months, walk away. Never look back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7eat7", "score_hidden": false, "stickied": false, "created": 1492109573.0, "created_utc": 1492080773.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg7na35", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "michaelochurch", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "My personal opinion: improve but never invalidate. \n\nYou're a writer, so you're smart enough that you can fix things in later books if they truly must be fixed. No narrator is 100% reliable. There are always multiple ways to view events. Of course, you don't want to play *deus ex machina* games. (\"The first novel was just a dream. In fact, Tom is not an aging hedge knight but a bank teller in Ohio.\")\n\nI work in software and have reviewed a lot of technical writing, and multiple editions are the norm. So I don't think it's a problem if you're making things more clear, and fixing grammatical errors is a no-brainer, but you should be extremely conservative in making changes. I don't think you should \"rewrite\". Plot wise, what happened happened. If you want a different plot, write a different book. \n\nInvalidating prior fiction is, in my view, bad form. You can rename characters and get away with it. (\"She went by Melissa, her middle name, as a teenager, but she grew to prefer being called Erica as she came into adulthood.\") You don't want to overdo it, though. *What happened, happened.* You don't want to remake your story into something dramatically different and invalidate the 180-to-600 minutes that your readers put into reading your work. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My personal opinion: improve but never invalidate. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re a writer, so you&amp;#39;re smart enough that you can fix things in later books if they truly must be fixed. No narrator is 100% reliable. There are always multiple ways to view events. Of course, you don&amp;#39;t want to play &lt;em&gt;deus ex machina&lt;/em&gt; games. (&amp;quot;The first novel was just a dream. In fact, Tom is not an aging hedge knight but a bank teller in Ohio.&amp;quot;)&lt;/p&gt;\n\n&lt;p&gt;I work in software and have reviewed a lot of technical writing, and multiple editions are the norm. So I don&amp;#39;t think it&amp;#39;s a problem if you&amp;#39;re making things more clear, and fixing grammatical errors is a no-brainer, but you should be extremely conservative in making changes. I don&amp;#39;t think you should &amp;quot;rewrite&amp;quot;. Plot wise, what happened happened. If you want a different plot, write a different book. &lt;/p&gt;\n\n&lt;p&gt;Invalidating prior fiction is, in my view, bad form. You can rename characters and get away with it. (&amp;quot;She went by Melissa, her middle name, as a teenager, but she grew to prefer being called Erica as she came into adulthood.&amp;quot;) You don&amp;#39;t want to overdo it, though. &lt;em&gt;What happened, happened.&lt;/em&gt; You don&amp;#39;t want to remake your story into something dramatically different and invalidate the 180-to-600 minutes that your readers put into reading your work. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7na35", "score_hidden": false, "stickied": false, "created": 1492123764.0, "created_utc": 1492094964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg7u2pi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blade55555", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "In my opinion? No I would never re-write a book I already published. I think you'll always learn when writing a book and just apply what you learn into the next one. Don't worry about fixing an old book, it's released, it's done there is no point in going back imo.\n\n\nI would just focus on a new project and keep on trucking. If every author went back to an old book because they got better, well a lot of authors wouldn't have that many books out :P.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my opinion? No I would never re-write a book I already published. I think you&amp;#39;ll always learn when writing a book and just apply what you learn into the next one. Don&amp;#39;t worry about fixing an old book, it&amp;#39;s released, it&amp;#39;s done there is no point in going back imo.&lt;/p&gt;\n\n&lt;p&gt;I would just focus on a new project and keep on trucking. If every author went back to an old book because they got better, well a lot of authors wouldn&amp;#39;t have that many books out :P.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7u2pi", "score_hidden": false, "stickied": false, "created": 1492131078.0, "created_utc": 1492102278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_651vib", "likes": null, "replies": "", "user_reports": [], "id": "dg77cbw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deaglebro", "parent_id": "t3_651vib", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "People are so needlessly wordy on this forum. If you want to rewrite an old work, sure, revise it. But I would only do it if it had the potential to be significantly better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People are so needlessly wordy on this forum. If you want to rewrite an old work, sure, revise it. But I would only do it if it had the potential to be significantly better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg77cbw", "score_hidden": false, "stickied": false, "created": 1492090393.0, "created_utc": 1492061593.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]