[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hiya folks!&lt;/p&gt;\n\n&lt;p&gt;You may notice that I am not &lt;a href=\"/u/MNBrian\"&gt;/u/MNBrian&lt;/a&gt;, and yet, here I am, posting pubtips. The nerve! Well, I assure you that I&amp;#39;m doing this with Brian&amp;#39;s blessing. In order to take some of the pressure off of him trying to produce two articles a week, we&amp;#39;re going to be splitting the work, so get used to me! &lt;em&gt;insert evil cackle here&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I guess I should introduce myself properly. I&amp;#39;ve been self-publishing since December of 2013 when I first started cobbling together smut shorts for money. It was never very fulfilling or enjoyable for me (read: I &lt;strong&gt;hated&lt;/strong&gt; it) and in October of 2014, I published my first romance novel. Since then, I&amp;#39;ve published ten novels and probably twenty or more novellas. After a certain point, you lose count. I&amp;#39;ve been supporting myself with my writing for the last two years and at this point, I feel like I&amp;#39;ve got a pretty good handle on things when it comes to this gig.&lt;/p&gt;\n\n&lt;p&gt;Brian is still going to be around, posting his article once a week and answering questions in the comments. But there are lots of other ways to get in contact with us!&lt;/p&gt;\n\n&lt;p&gt;Drop by on &lt;a href=\"/r/pubTips\"&gt;r/pubTips&lt;/a&gt; to connect with me and ensure you don&amp;#39;t miss a post and check out the calendar for weekly events and writing exercises.&lt;/p&gt;\n\n&lt;p&gt;I also participate in the following writing communities:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.reddit.com/r/writerchat\"&gt;WriterChat&lt;/a&gt; - A place to talk writing, share writing and get critiques with a cool system of rewarding critiquers and writers.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://kiwiirc.com/client/irc.snoonet.org/writerchat\"&gt;WriterChat IRC&lt;/a&gt; - Where all the cool kids hang out and shoot the breeze. Join a weekend word sprint or participate in Friday Trivia Nights, or just generally chat with other like minded writers.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://discord.gg/kSg8qZF\"&gt;Writer&amp;#39;s Block Discord&lt;/a&gt; - Another great group of writers - Join the weekly short story competitions, have focused writing conversations, or jump in voice chat to talk out a plot knot.&lt;/p&gt;\n\n&lt;p&gt;If you have a suggestion for what you&amp;#39;d like me to discuss, add your suggestion here and I&amp;#39;ll answer you or add it to my list of future volumes -&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/PubTips/comments/58v1nb/have_a_question_ive_got_an_answer_post_it_here/\"&gt;CLICK HERE AND TELL ME WHAT TO TALK ABOUT!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If you missed previous posts, you can find the entire archive cross posted on &lt;a href=\"http://www.reddit.com/r/pubtips\"&gt;www.reddit.com/r/pubtips&lt;/a&gt; (I&amp;#39;m working on updating this as part of my new duties, so it should be much easier to navigate soon!)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://reddit.us14.list-manage.com/subscribe?u=d98789a1db74b3582bbd8a371&amp;amp;id=3b4a198d51\"&gt;Click here to sign up for Habits &amp;amp; Traits e-mails on Tuesday/Thursday mornings&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And as always a disclaimer — these are only my opinions based on my experiences. Feel free to disagree, debate, and tell me I&amp;#39;m wrong. Here we go!&lt;/p&gt;\n\n&lt;h1&gt;&lt;strong&gt;Habits &amp;amp; Traits 68 — Writing Believable Romance&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;p&gt;Our question today comes from &lt;a href=\"/u/Mad-Reader\"&gt;/u/Mad-Reader&lt;/a&gt; who wants to know how to write a believable romance. Awesome! This is my wheelhouse :D&lt;/p&gt;\n\n&lt;p&gt;Now, I know many of you aren&amp;#39;t going to be writing romance novels, but you may wind up with a romance subplot on day and I hope that this will help you make it convincing.&lt;/p&gt;\n\n&lt;p&gt;Above all else, a romance plot is a character arc plot. But with two characters (or more, I don&amp;#39;t judge, but for the sake of simplicity, let&amp;#39;s stick with two for now.) Both of these characters have to have some fundamental flaw or short-coming that they may not even realize themselves. But you know it&amp;#39;s there. You&amp;#39;re God and you see all. By the end of the plot/book/arc, not only will your characters have realized their fundamental flaw, but they&amp;#39;ll have learned how to overcome it through the power of &lt;em&gt;looooove&lt;/em&gt;. Cheesy, I know, but that&amp;#39;s romance for ya.&lt;/p&gt;\n\n&lt;p&gt;One of my favorite books on the subject calls this stage &amp;quot;hole-hearted&amp;quot; (and the end-stage &amp;quot;whole-hearted.&amp;quot; Simple, right?) basically meaning that the character is missing something and maybe they don&amp;#39;t even know what it is, but it&amp;#39;s the other character.&lt;/p&gt;\n\n&lt;p&gt;But this is probably sounding kind of obvious. How do you get them from hole-hearted to whole-hearted?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;First, they need to have opposing goals and clashing personalities.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a saying in the romance community: If he&amp;#39;s a firefighter, she&amp;#39;s an arsonist. &lt;/p&gt;\n\n&lt;p&gt;You get the best results when you pit together people that are nothing alike. She could take things too seriously and he never takes anything serious at all (my current WIP) or maybe she longs for adventure and he&amp;#39;s weary from his travels (my last book). Whatever the case may be, the uniting factor is &lt;strong&gt;they don&amp;#39;t realize what they&amp;#39;re doing is wrong.&lt;/strong&gt; Generally, they&amp;#39;re content with the way things are going, even if they&amp;#39;re not happy, and it&amp;#39;s the introduction of the other player that turns everything on its head.&lt;/p&gt;\n\n&lt;p&gt;And remember, I said goals &lt;em&gt;and&lt;/em&gt; personalities. Your characters have to have goals (you knew that, right? Of course you did.) and those goals &lt;strong&gt;should not&lt;/strong&gt; be romance. In fact, romance should be the &lt;em&gt;last&lt;/em&gt; thing they want and could actually get in the way of their goals.&lt;/p&gt;\n\n&lt;p&gt;See? We&amp;#39;re already building conflict.&lt;/p&gt;\n\n&lt;p&gt;Once you&amp;#39;ve got your personalities and goals fleshed out, it&amp;#39;s time to get down to the nitty gritty.&lt;/p&gt;\n\n&lt;p&gt;Romance is often accused of being formulaic, and it is. A satisfying and convincing romance will follow the formula, but there is enough room for variation that you can make it your own. You can go with the minimum number of peaks and valleys, or you can go hog-wild and make your arc look like a roller coaster. It depends on what kind of romance you&amp;#39;re going for. Sweet and simple? Angsty and volatile? Something in the middle? You know what you want, I&amp;#39;m going to give you the tools to make it happen.&lt;/p&gt;\n\n&lt;p&gt;A romance plot line has four distinct sections and I&amp;#39;ll go over each of them briefly.&lt;/p&gt;\n\n&lt;h2&gt;(1) Getting to know each other&lt;/h2&gt;\n\n&lt;p&gt;This is where you introduce your characters to the reader, and to each other. It&amp;#39;s where you show that &amp;quot;hole-hearted&amp;quot; vision and the first hint that the other character is the answer to their problems. It&amp;#39;s also the first time one or both of your characters will grind their heels into the dirt and say &amp;quot;nu uh, no way, &lt;em&gt;that&lt;/em&gt; is not the person for me.&amp;quot; This part is vital.&lt;/p&gt;\n\n&lt;p&gt;By the end of this section, your plot thrust should have them stuck together like glue. It could be a forced proximity trope, or a marriage of convenience, or a quest to defeat the evil wizard. Whatever it may be, this is the point of no return for them and all the fun romancey stuff comes after it.&lt;/p&gt;\n\n&lt;h2&gt;(2) Falling in love&lt;/h2&gt;\n\n&lt;p&gt;This is my favorite part. It&amp;#39;s where the characters get to know each other on a deeper level. They&amp;#39;re still not quite over the &amp;quot;no way&amp;quot; and may reiterate it (or if one character didn&amp;#39;t have that thought before, now is the time). They&amp;#39;re still clinging to the comfort of their flaw and not quite ready to open up.&lt;/p&gt;\n\n&lt;p&gt;But, open up they do! Slowly, you have to incorporate mutual feelings of attraction. It may start out physical and move to emotional, or vice versa, depending on your characters. But this is a slow build. Think of romances you&amp;#39;ve read or seen in movies. There&amp;#39;s typically a moment where a character does something out of his/her &amp;quot;perceived&amp;quot; character. This is when the other person starts to think maybe there&amp;#39;s more to this person than what they originally thought. They show each other a different side of themselves and the door opens a little wider. With subsequent scenes, you keep chipping away at that wall they&amp;#39;ve built until the door is flung wide open. &lt;/p&gt;\n\n&lt;p&gt;By the end of this section, you&amp;#39;ll be at the midpoint of your story/arc. This is typically when sex happens, or some other form of deep intimacy like revealing a secret or personal truth that they normally keep hidden. Everything is going good for the characters and they feel on top of the world with their newfound love. But, they don&amp;#39;t know what we know, and that&amp;#39;s that the next section is...&lt;/p&gt;\n\n&lt;h2&gt;(3) Falling out of love&lt;/h2&gt;\n\n&lt;p&gt;It couldn&amp;#39;t be that easy! Our characters still haven&amp;#39;t addressed their fundamental flaw, and they can&amp;#39;t get to whole-hearted without facing their demons.&lt;/p&gt;\n\n&lt;p&gt;This is the part of the book where things start to fall apart. That flaw rears its ugly head in a way that makes the other person doubt what they were feeling. You have to keep piling on the doubt, and make sure it&amp;#39;s catered to your character&amp;#39;s specific flaw; ie if he&amp;#39;s convinced every woman is a cheater, you have to make it look like she&amp;#39;s two-timing him somehow. Really dig in hard on those insecurities and then pour some salt on the wound for good measure. The harder the journey to the end, the more satisfying it will be.&lt;/p&gt;\n\n&lt;p&gt;These doubts grow on both sides of the equation until the unthinkable happens — the break-up. This is when the character gives into their flaw and chooses fear over love. You might know this as the black moment, or the dark night of the soul, or a million other things. Your character has hit rock bottom, and the worst part of it is? They &lt;strong&gt;did this to themselves&lt;/strong&gt;. That&amp;#39;s very important. It can&amp;#39;t be external forces making them separate. Maybe external forces exacerbated the flaws and doubts, but the direct cause of this black moment has to be a choice the character made.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s important, because next is...&lt;/p&gt;\n\n&lt;h2&gt;(4) Making up&lt;/h2&gt;\n\n&lt;p&gt;At some point while your characters are wallowing in their own self-pity, something or someone comes along to snap them out of it. It could be a trusted friend or family member telling them to get their head out of their ass, or it could be realizing they were wrong about those doubts all along, or a million other things. It helps me to refer to this step as the &amp;quot;Wake up and smell the coffee, you idiot&amp;quot; phase.&lt;/p&gt;\n\n&lt;p&gt;But they&amp;#39;ve really stepped in it, and winning back the heart of their love isn&amp;#39;t going to be easy. They&amp;#39;re going to need some kind of grand gesture. This is standing outside her window with a boombox, or confessing your love at a baseball game, or &lt;em&gt;something&lt;/em&gt; but it&amp;#39;s generally much better if you can directly tie that back into the character&amp;#39;s flaw. Confessing your love in front of millions of people has a much bigger emotional impact if your character is terrified of public speaking than if he&amp;#39;s a stand-up comic used to seeing big crowds all the time. They have to show that they&amp;#39;re willing to overcome their flaw for the person they love and they have to show it in a &lt;strong&gt;big&lt;/strong&gt; way.&lt;/p&gt;\n\n&lt;p&gt;After that, I generally add some declarations of love, an apology or two (normally both characters go through this arc, but not always simultaneously) and a kiss.&lt;/p&gt;\n\n&lt;p&gt;You end the love arc by showing the characters being whole-hearted. That is, they&amp;#39;ve overcome their flaw, grown as a person, and have earned their happily ever after.&lt;/p&gt;\n\n&lt;p&gt;The end.&lt;/p&gt;\n\n&lt;h1&gt;Bonus:&lt;/h1&gt;\n\n&lt;p&gt;Not everyone interprets love in the same way. If you want to make sure your romance resonates with your audience, you&amp;#39;d do well to include each of the &lt;a href=\"http://www.kevinhalloran.net/what-are-the-five-love-languages-summary/\"&gt;Five Love Languages&lt;/a&gt;. This will ensure that every person, no matter how they express/receive love, will feel that these two people are truly meant for each other.&lt;/p&gt;\n\n&lt;p&gt;And that&amp;#39;s it! That&amp;#39;s how I craft a convincing and believable romance. Feel free to ask me any questions or tell me why I&amp;#39;m wrong in the comments :D &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hiya folks!\n\nYou may notice that I am not /u/MNBrian, and yet, here I am, posting pubtips. The nerve! Well, I assure you that I'm doing this with Brian's blessing. In order to take some of the pressure off of him trying to produce two articles a week, we're going to be splitting the work, so get used to me! *insert evil cackle here*\n\nI guess I should introduce myself properly. I've been self-publishing since December of 2013 when I first started cobbling together smut shorts for money. It was never very fulfilling or enjoyable for me (read: I **hated** it) and in October of 2014, I published my first romance novel. Since then, I've published ten novels and probably twenty or more novellas. After a certain point, you lose count. I've been supporting myself with my writing for the last two years and at this point, I feel like I've got a pretty good handle on things when it comes to this gig.\n\nBrian is still going to be around, posting his article once a week and answering questions in the comments. But there are lots of other ways to get in contact with us!\n\n\nDrop by on r/pubTips to connect with me and ensure you don't miss a post and check out the calendar for weekly events and writing exercises.\n\nI also participate in the following writing communities:\n\n[WriterChat](http://www.reddit.com/r/writerchat) - A place to talk writing, share writing and get critiques with a cool system of rewarding critiquers and writers.\n\n[WriterChat IRC](https://kiwiirc.com/client/irc.snoonet.org/writerchat) - Where all the cool kids hang out and shoot the breeze. Join a weekend word sprint or participate in Friday Trivia Nights, or just generally chat with other like minded writers.\n\n[Writer's Block Discord](https://discord.gg/kSg8qZF) - Another great group of writers - Join the weekly short story competitions, have focused writing conversations, or jump in voice chat to talk out a plot knot.\n\n \n\nIf you have a suggestion for what you'd like me to discuss, add your suggestion here and I'll answer you or add it to my list of future volumes -\n\n \n\n[CLICK HERE AND TELL ME WHAT TO TALK ABOUT!](https://www.reddit.com/r/PubTips/comments/58v1nb/have_a_question_ive_got_an_answer_post_it_here/)\n\n \n\nIf you missed previous posts, you can find the entire archive cross posted on www.reddit.com/r/pubtips (I'm working on updating this as part of my new duties, so it should be much easier to navigate soon!)\n\n \n\n[Click here to sign up for Habits &amp; Traits e-mails on Tuesday/Thursday mornings](http://reddit.us14.list-manage.com/subscribe?u=d98789a1db74b3582bbd8a371&amp;id=3b4a198d51)\n\n \n\nAnd as always a disclaimer — these are only my opinions based on my experiences. Feel free to disagree, debate, and tell me I'm wrong. Here we go!\n\n# **Habits &amp; Traits 68 — Writing Believable Romance**\n\nOur question today comes from /u/Mad-Reader who wants to know how to write a believable romance. Awesome! This is my wheelhouse :D\n\nNow, I know many of you aren't going to be writing romance novels, but you may wind up with a romance subplot on day and I hope that this will help you make it convincing.\n\nAbove all else, a romance plot is a character arc plot. But with two characters (or more, I don't judge, but for the sake of simplicity, let's stick with two for now.) Both of these characters have to have some fundamental flaw or short-coming that they may not even realize themselves. But you know it's there. You're God and you see all. By the end of the plot/book/arc, not only will your characters have realized their fundamental flaw, but they'll have learned how to overcome it through the power of *looooove*. Cheesy, I know, but that's romance for ya.\n\nOne of my favorite books on the subject calls this stage \"hole-hearted\" (and the end-stage \"whole-hearted.\" Simple, right?) basically meaning that the character is missing something and maybe they don't even know what it is, but it's the other character.\n\nBut this is probably sounding kind of obvious. How do you get them from hole-hearted to whole-hearted?\n\n**First, they need to have opposing goals and clashing personalities.** \n\nThere's a saying in the romance community: If he's a firefighter, she's an arsonist. \n\nYou get the best results when you pit together people that are nothing alike. She could take things too seriously and he never takes anything serious at all (my current WIP) or maybe she longs for adventure and he's weary from his travels (my last book). Whatever the case may be, the uniting factor is **they don't realize what they're doing is wrong.** Generally, they're content with the way things are going, even if they're not happy, and it's the introduction of the other player that turns everything on its head.\n\nAnd remember, I said goals *and* personalities. Your characters have to have goals (you knew that, right? Of course you did.) and those goals **should not** be romance. In fact, romance should be the *last* thing they want and could actually get in the way of their goals.\n\nSee? We're already building conflict.\n\nOnce you've got your personalities and goals fleshed out, it's time to get down to the nitty gritty.\n\nRomance is often accused of being formulaic, and it is. A satisfying and convincing romance will follow the formula, but there is enough room for variation that you can make it your own. You can go with the minimum number of peaks and valleys, or you can go hog-wild and make your arc look like a roller coaster. It depends on what kind of romance you're going for. Sweet and simple? Angsty and volatile? Something in the middle? You know what you want, I'm going to give you the tools to make it happen.\n\nA romance plot line has four distinct sections and I'll go over each of them briefly.\n\n##(1) Getting to know each other\n\nThis is where you introduce your characters to the reader, and to each other. It's where you show that \"hole-hearted\" vision and the first hint that the other character is the answer to their problems. It's also the first time one or both of your characters will grind their heels into the dirt and say \"nu uh, no way, *that* is not the person for me.\" This part is vital.\n\nBy the end of this section, your plot thrust should have them stuck together like glue. It could be a forced proximity trope, or a marriage of convenience, or a quest to defeat the evil wizard. Whatever it may be, this is the point of no return for them and all the fun romancey stuff comes after it.\n\n## (2) Falling in love\n\nThis is my favorite part. It's where the characters get to know each other on a deeper level. They're still not quite over the \"no way\" and may reiterate it (or if one character didn't have that thought before, now is the time). They're still clinging to the comfort of their flaw and not quite ready to open up.\n\nBut, open up they do! Slowly, you have to incorporate mutual feelings of attraction. It may start out physical and move to emotional, or vice versa, depending on your characters. But this is a slow build. Think of romances you've read or seen in movies. There's typically a moment where a character does something out of his/her \"perceived\" character. This is when the other person starts to think maybe there's more to this person than what they originally thought. They show each other a different side of themselves and the door opens a little wider. With subsequent scenes, you keep chipping away at that wall they've built until the door is flung wide open. \n\nBy the end of this section, you'll be at the midpoint of your story/arc. This is typically when sex happens, or some other form of deep intimacy like revealing a secret or personal truth that they normally keep hidden. Everything is going good for the characters and they feel on top of the world with their newfound love. But, they don't know what we know, and that's that the next section is...\n\n## (3) Falling out of love\n\nIt couldn't be that easy! Our characters still haven't addressed their fundamental flaw, and they can't get to whole-hearted without facing their demons.\n\nThis is the part of the book where things start to fall apart. That flaw rears its ugly head in a way that makes the other person doubt what they were feeling. You have to keep piling on the doubt, and make sure it's catered to your character's specific flaw; ie if he's convinced every woman is a cheater, you have to make it look like she's two-timing him somehow. Really dig in hard on those insecurities and then pour some salt on the wound for good measure. The harder the journey to the end, the more satisfying it will be.\n\nThese doubts grow on both sides of the equation until the unthinkable happens — the break-up. This is when the character gives into their flaw and chooses fear over love. You might know this as the black moment, or the dark night of the soul, or a million other things. Your character has hit rock bottom, and the worst part of it is? They **did this to themselves**. That's very important. It can't be external forces making them separate. Maybe external forces exacerbated the flaws and doubts, but the direct cause of this black moment has to be a choice the character made.\n\nThat's important, because next is...\n\n## (4) Making up\n\nAt some point while your characters are wallowing in their own self-pity, something or someone comes along to snap them out of it. It could be a trusted friend or family member telling them to get their head out of their ass, or it could be realizing they were wrong about those doubts all along, or a million other things. It helps me to refer to this step as the \"Wake up and smell the coffee, you idiot\" phase.\n\nBut they've really stepped in it, and winning back the heart of their love isn't going to be easy. They're going to need some kind of grand gesture. This is standing outside her window with a boombox, or confessing your love at a baseball game, or *something* but it's generally much better if you can directly tie that back into the character's flaw. Confessing your love in front of millions of people has a much bigger emotional impact if your character is terrified of public speaking than if he's a stand-up comic used to seeing big crowds all the time. They have to show that they're willing to overcome their flaw for the person they love and they have to show it in a **big** way.\n\nAfter that, I generally add some declarations of love, an apology or two (normally both characters go through this arc, but not always simultaneously) and a kiss.\n\nYou end the love arc by showing the characters being whole-hearted. That is, they've overcome their flaw, grown as a person, and have earned their happily ever after.\n\nThe end.\n\n# Bonus:\n\nNot everyone interprets love in the same way. If you want to make sure your romance resonates with your audience, you'd do well to include each of the [Five Love Languages](http://www.kevinhalloran.net/what-are-the-five-love-languages-summary/). This will ensure that every person, no matter how they express/receive love, will feel that these two people are truly meant for each other.\n\n\nAnd that's it! That's how I craft a convincing and believable romance. Feel free to ask me any questions or tell me why I'm wrong in the comments :D ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65570w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 220, "report_reasons": null, "author": "gingasaurusrexx", "saved": false, "mod_reports": [], "name": "t3_65570w", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/65570w/habits_traits_68_writing_believable_romance/", "num_reports": null, "locked": false, "stickied": false, "created": 1492115909.0, "url": "https://www.reddit.com/r/writing/comments/65570w/habits_traits_68_writing_believable_romance/", "author_flair_text": null, "quarantine": false, "title": "Habits &amp; Traits 68 — Writing Believable Romance", "created_utc": 1492087109.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 133, "visited": false, "subreddit_type": "public", "ups": 220}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7mhlw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7m9bz", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Hahaha. Not that I know of... :D ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hahaha. Not that I know of... :D &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7mhlw", "score_hidden": false, "stickied": false, "created": 1492122855.0, "created_utc": 1492094055.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7m9bz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NotTooDeep", "parent_id": "t1_dg7l9kt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "LMAO! \n\nBut can you get Black Sails on Netflix? \n\nAsking the important questions...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LMAO! &lt;/p&gt;\n\n&lt;p&gt;But can you get Black Sails on Netflix? &lt;/p&gt;\n\n&lt;p&gt;Asking the important questions...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7m9bz", "score_hidden": false, "stickied": false, "created": 1492122579.0, "created_utc": 1492093779.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7l9kt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7klde", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Baha! Well this frees me up for my other pastimes, like destroying the lives of my regular commenters and watching Netflix. Oh wait... did I say that first thing out loud? :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Baha! Well this frees me up for my other pastimes, like destroying the lives of my regular commenters and watching Netflix. Oh wait... did I say that first thing out loud? :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7l9kt", "score_hidden": false, "stickied": false, "created": 1492121397.0, "created_utc": 1492092597.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7klde", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "NotTooDeep", "parent_id": "t1_dg7jc6k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Nah, man, we're all good here. /r/gingasaurusrexx has it covered. Don't rush to get back.  ;-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, man, we&amp;#39;re all good here. &lt;a href=\"/r/gingasaurusrexx\"&gt;/r/gingasaurusrexx&lt;/a&gt; has it covered. Don&amp;#39;t rush to get back.  ;-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7klde", "score_hidden": false, "stickied": false, "created": 1492120545.0, "created_utc": 1492091745.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jc6k", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "MNBrian", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Fantastic post /u/gingasaurusrexx - very well done. It's a far better answer than I could have given on the subject. :) \n\nLike ging said, I'm here still if anyone needs me! :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fantastic post &lt;a href=\"/u/gingasaurusrexx\"&gt;/u/gingasaurusrexx&lt;/a&gt; - very well done. It&amp;#39;s a far better answer than I could have given on the subject. :) &lt;/p&gt;\n\n&lt;p&gt;Like ging said, I&amp;#39;m here still if anyone needs me! :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7jc6k", "score_hidden": false, "stickied": false, "created": 1492118897.0, "created_utc": 1492090097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg850k8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg80i80", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Nora has the very best writing advice in my opinion. \n\n[This one](https://writersback.files.wordpress.com/2014/11/no-more-excuses-to-write.png) is a favorite of mine. \n\n[This one too.](http://shannondittemore.com/wp-content/uploads/2014/06/Nora-Roberts-e1403759851276.jpg) \n\nAnd if you ever hear her actually speak? God, her voice. It's so gravelly and wonderful. She doesn't suffer fools, she takes no shit, and I definitely want to be her when I grow up. She was 31 when her first book was published, and I was 24 when I published my first one, so there's still time! :P", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nora has the very best writing advice in my opinion. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://writersback.files.wordpress.com/2014/11/no-more-excuses-to-write.png\"&gt;This one&lt;/a&gt; is a favorite of mine. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://shannondittemore.com/wp-content/uploads/2014/06/Nora-Roberts-e1403759851276.jpg\"&gt;This one too.&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;And if you ever hear her actually speak? God, her voice. It&amp;#39;s so gravelly and wonderful. She doesn&amp;#39;t suffer fools, she takes no shit, and I definitely want to be her when I grow up. She was 31 when her first book was published, and I was 24 when I published my first one, so there&amp;#39;s still time! :P&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg850k8", "score_hidden": false, "stickied": false, "created": 1492142815.0, "created_utc": 1492114015.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80i80", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NotTooDeep", "parent_id": "t1_dg7or2n", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I enjoy the JD Robb novels as well. Her voice is very different in that series. Girlfriend can write!\n\nWe could all do a lot worse than trying to emulate Nora.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I enjoy the JD Robb novels as well. Her voice is very different in that series. Girlfriend can write!&lt;/p&gt;\n\n&lt;p&gt;We could all do a lot worse than trying to emulate Nora.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg80i80", "score_hidden": false, "stickied": false, "created": 1492137911.0, "created_utc": 1492109111.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7or2n", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7kvt4", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Once you see it, it's very hard to stop seeing it! I've ruined any kind of romance for my roommate by telling her exactly when things are going to start going bad and figuring out the set up ten-steps ahead. I was just saying last night that I should brush up on the hero's journey to be able to ruin the non-romance plots, too :P \n\nNora is a master of this, for sure. She's actually kind of my idol. I want to write so many books that my publisher has to tell me to slow down and then eventually caves and just gives me another pen name. That woman is a machine. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Once you see it, it&amp;#39;s very hard to stop seeing it! I&amp;#39;ve ruined any kind of romance for my roommate by telling her exactly when things are going to start going bad and figuring out the set up ten-steps ahead. I was just saying last night that I should brush up on the hero&amp;#39;s journey to be able to ruin the non-romance plots, too :P &lt;/p&gt;\n\n&lt;p&gt;Nora is a master of this, for sure. She&amp;#39;s actually kind of my idol. I want to write so many books that my publisher has to tell me to slow down and then eventually caves and just gives me another pen name. That woman is a machine. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7or2n", "score_hidden": false, "stickied": false, "created": 1492125399.0, "created_utc": 1492096599.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kvt4", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "NotTooDeep", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "What I find most valuable about these structural posts is how it changes my point of view. I read anything, including romance. Romance always, always engages me such that I never see \"oh this is where the 'x' has to happen\". \n\nThen your post comes along and I'm immediately recalling that last Nora Roberts romance and the two character's lives intersecting and the vows that were made by each before their meeting that made them both resist the attraction. The pacing, the timing of revealing why they resist getting together, it reminds me of reading the history of great battles. The pieces moving into place on the game board to force events to unfold with a clear intent, but without a certain outcome. \n\nI need to learn to think more like a writer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What I find most valuable about these structural posts is how it changes my point of view. I read anything, including romance. Romance always, always engages me such that I never see &amp;quot;oh this is where the &amp;#39;x&amp;#39; has to happen&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Then your post comes along and I&amp;#39;m immediately recalling that last Nora Roberts romance and the two character&amp;#39;s lives intersecting and the vows that were made by each before their meeting that made them both resist the attraction. The pacing, the timing of revealing why they resist getting together, it reminds me of reading the history of great battles. The pieces moving into place on the game board to force events to unfold with a clear intent, but without a certain outcome. &lt;/p&gt;\n\n&lt;p&gt;I need to learn to think more like a writer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7kvt4", "score_hidden": false, "stickied": false, "created": 1492120918.0, "created_utc": 1492092118.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7n7t6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg7kzfv", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I've heard requests for it because it can humanise a prickly character. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve heard requests for it because it can humanise a prickly character. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7n7t6", "score_hidden": false, "stickied": false, "created": 1492123692.0, "created_utc": 1492094892.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7popb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sarah_ahiers", "parent_id": "t1_dg7os74", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It really, really is!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really, really is!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7popb", "score_hidden": false, "stickied": false, "created": 1492126400.0, "created_utc": 1492097600.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7os74", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7kzfv", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Romance is *so* fun to write! Glad you enjoyed the post :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Romance is &lt;em&gt;so&lt;/em&gt; fun to write! Glad you enjoyed the post :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7os74", "score_hidden": false, "stickied": false, "created": 1492125433.0, "created_utc": 1492096633.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kzfv", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "sarah_ahiers", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "This is a hella great breakdown of romance. I'm going to bookmark it.\n\nI LOVE including a romance plotline in my books. Because romance makes conflict and conflict is super fun to write and propels the story forward.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a hella great breakdown of romance. I&amp;#39;m going to bookmark it.&lt;/p&gt;\n\n&lt;p&gt;I LOVE including a romance plotline in my books. Because romance makes conflict and conflict is super fun to write and propels the story forward.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7kzfv", "score_hidden": false, "stickied": false, "created": 1492121047.0, "created_utc": 1492092247.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7on9o", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7jd8m", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Shhhhh. No one needs to worry about that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shhhhh. No one needs to worry about that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7on9o", "score_hidden": false, "stickied": false, "created": 1492125280.0, "created_utc": 1492096480.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7kbyy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7jd8m", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Baha! I'm here! I'm here! :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Baha! I&amp;#39;m here! I&amp;#39;m here! :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7kbyy", "score_hidden": false, "stickied": false, "created": 1492120213.0, "created_utc": 1492091413.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8sxkl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Diabols", "parent_id": "t1_dg7jd8m", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "They've been going through step 3, give it time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;ve been going through step 3, give it time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8sxkl", "score_hidden": false, "stickied": false, "created": 1492175947.0, "created_utc": 1492147147.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jd8m", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "NegativeMagenta", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Thanks you very much for this!\n\nWhere did you hide u/MNBrian though?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks you very much for this!&lt;/p&gt;\n\n&lt;p&gt;Where did you hide &lt;a href=\"/u/MNBrian\"&gt;u/MNBrian&lt;/a&gt; though?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7jd8m", "score_hidden": false, "stickied": false, "created": 1492118936.0, "created_utc": 1492090136.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7ngbq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sarah_ahiers", "parent_id": "t1_dg7n3si", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Definitely. I mean for me, it was just too formulaic. It didn't work with my process. But I know for some people it works really well. To each their own.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely. I mean for me, it was just too formulaic. It didn&amp;#39;t work with my process. But I know for some people it works really well. To each their own.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7ngbq", "score_hidden": false, "stickied": false, "created": 1492123963.0, "created_utc": 1492095163.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7n3si", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7ml40", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Totally. It's definitely worth a read. I did laugh through a few overly-simplified categories, but I still appreciated the fact that Snyder tried so hard to categorize all films. It was more of a case study in how we read/see things, which was a whole 'nother exploration in what makes something \"good\" in our minds.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally. It&amp;#39;s definitely worth a read. I did laugh through a few overly-simplified categories, but I still appreciated the fact that Snyder tried so hard to categorize all films. It was more of a case study in how we read/see things, which was a whole &amp;#39;nother exploration in what makes something &amp;quot;good&amp;quot; in our minds.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7n3si", "score_hidden": false, "stickied": false, "created": 1492123566.0, "created_utc": 1492094766.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ml40", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sarah_ahiers", "parent_id": "t1_dg7ld66", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "People LURVE Save the Cat. It didn't do much for me, but I always rec it because it helps so many writers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People LURVE Save the Cat. It didn&amp;#39;t do much for me, but I always rec it because it helps so many writers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7ml40", "score_hidden": false, "stickied": false, "created": 1492122965.0, "created_utc": 1492094165.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7mmlg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg7ld66", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Anything is good. \n\nFrom critique, my weak spots are too much detachment and not enough feeling in the story, and going back over some scenes in the second draft involved teasing out some character depth (how to make my 25-yo character actually act 25 rather than fully adult). This would be a really interesting perspective.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anything is good. &lt;/p&gt;\n\n&lt;p&gt;From critique, my weak spots are too much detachment and not enough feeling in the story, and going back over some scenes in the second draft involved teasing out some character depth (how to make my 25-yo character actually act 25 rather than fully adult). This would be a really interesting perspective.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7mmlg", "score_hidden": false, "stickied": false, "created": 1492123011.0, "created_utc": 1492094211.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ld66", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7l215", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Don't get me wrong, it's not the de facto book it claims to be, but it does a great job at looking at things from a reader/viewer perspective in order to get a better handle on the patterns in what we enjoy. It's certainly worth a read. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get me wrong, it&amp;#39;s not the de facto book it claims to be, but it does a great job at looking at things from a reader/viewer perspective in order to get a better handle on the patterns in what we enjoy. It&amp;#39;s certainly worth a read. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7ld66", "score_hidden": false, "stickied": false, "created": 1492121522.0, "created_utc": 1492092722.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7l215", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg7ka8f", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I really will have to read *Save the Cat*. I'm deep into the climax stuff of the 2nd draft now (I wake up every morning thinking I'm burned out and by the time I get to the station I'm opening up my netbook again!), but I'm going to need to read it before I do the third draft. \n\nThe force driving them apart was a bit cruel: the villain actually forces them into an engagement using one of those pesky obsolete-but-still-on-the-statute-books feudal laws, which kills off some of the attraction. A romantic interest might work, but the female lead lost her previous girlfriend in last year's riot. My thought on that from writing it is probably to play that 'my heart's been broken once already' card, but the key word I guess is girlfriend - 'and anyway I don't go for guys'. So maybe playing that aspect up might put it across that she's *not interested*; it doesn't stop the forced marriage (it's to get her out of holy orders, since marriage still ends a professional woman's career), but it may need to be clearer to the reader that she's gay and heartbroken, and thus she needs to act the part a bit more.\n\n(She is what in our society would be a lipstick lesbian but there's much less of a taboo about the whole thing in this society than there would have been at the corresponding time and place in the real world.)", "edited": 1492092782.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really will have to read &lt;em&gt;Save the Cat&lt;/em&gt;. I&amp;#39;m deep into the climax stuff of the 2nd draft now (I wake up every morning thinking I&amp;#39;m burned out and by the time I get to the station I&amp;#39;m opening up my netbook again!), but I&amp;#39;m going to need to read it before I do the third draft. &lt;/p&gt;\n\n&lt;p&gt;The force driving them apart was a bit cruel: the villain actually forces them into an engagement using one of those pesky obsolete-but-still-on-the-statute-books feudal laws, which kills off some of the attraction. A romantic interest might work, but the female lead lost her previous girlfriend in last year&amp;#39;s riot. My thought on that from writing it is probably to play that &amp;#39;my heart&amp;#39;s been broken once already&amp;#39; card, but the key word I guess is girlfriend - &amp;#39;and anyway I don&amp;#39;t go for guys&amp;#39;. So maybe playing that aspect up might put it across that she&amp;#39;s &lt;em&gt;not interested&lt;/em&gt;; it doesn&amp;#39;t stop the forced marriage (it&amp;#39;s to get her out of holy orders, since marriage still ends a professional woman&amp;#39;s career), but it may need to be clearer to the reader that she&amp;#39;s gay and heartbroken, and thus she needs to act the part a bit more.&lt;/p&gt;\n\n&lt;p&gt;(She is what in our society would be a lipstick lesbian but there&amp;#39;s much less of a taboo about the whole thing in this society than there would have been at the corresponding time and place in the real world.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7l215", "score_hidden": false, "stickied": false, "created": 1492121137.0, "created_utc": 1492092337.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ka8f", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7i59o", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Haha! This is amazing crowqueen! Save the Cat actually talks about the classic comedy as also being a romance. Essentially, the same components exist, but the relationship is just different. In Dumb &amp; Dumber for example, Harry and Lloyd are both hole-hearted (both desiring to win the heart of a lady love and both in very bad financial shape), and they have all the same beats as a romance (where the girl they love ends up separating them, and then they realize they're trying to fill in the hole with a relationship when they should be focused on being friends together). It's funny how it works, but essentially you have the same scaffolding, which is probably why you keep writing it as romance. Conflict naturally drives the two priests together, and naturally they grow closer, and naturally they need more internal conflict to separate them and eventually (hopefully) to fix everything and settle into what their relationship should be. Often the easy way to add that external element is to add a love interest outside of the circle, who is inherently bad for one of the characters and who inherently feeds into that characters main flaw. That way going \"back\" to the friendship is healthy and good for the character.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha! This is amazing crowqueen! Save the Cat actually talks about the classic comedy as also being a romance. Essentially, the same components exist, but the relationship is just different. In Dumb &amp;amp; Dumber for example, Harry and Lloyd are both hole-hearted (both desiring to win the heart of a lady love and both in very bad financial shape), and they have all the same beats as a romance (where the girl they love ends up separating them, and then they realize they&amp;#39;re trying to fill in the hole with a relationship when they should be focused on being friends together). It&amp;#39;s funny how it works, but essentially you have the same scaffolding, which is probably why you keep writing it as romance. Conflict naturally drives the two priests together, and naturally they grow closer, and naturally they need more internal conflict to separate them and eventually (hopefully) to fix everything and settle into what their relationship should be. Often the easy way to add that external element is to add a love interest outside of the circle, who is inherently bad for one of the characters and who inherently feeds into that characters main flaw. That way going &amp;quot;back&amp;quot; to the friendship is healthy and good for the character.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7ka8f", "score_hidden": false, "stickied": false, "created": 1492120151.0, "created_utc": 1492091351.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7kvyn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg7k51k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Ah right. That's an idea I hadn't thought of.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah right. That&amp;#39;s an idea I hadn&amp;#39;t thought of.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7kvyn", "score_hidden": false, "stickied": false, "created": 1492120923.0, "created_utc": 1492092123.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k51k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "kaneblaise", "parent_id": "t1_dg7k0yp", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "If it wasn't clear, I didn't mean to keep them the same gender at the end, but just to write them the same and then change back once you have the parts that are currently unwantedly-romantic over. It's certainly not a great solution, but one that I could see being useful to myself if I ran into that problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it wasn&amp;#39;t clear, I didn&amp;#39;t mean to keep them the same gender at the end, but just to write them the same and then change back once you have the parts that are currently unwantedly-romantic over. It&amp;#39;s certainly not a great solution, but one that I could see being useful to myself if I ran into that problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7k51k", "score_hidden": false, "stickied": false, "created": 1492119960.0, "created_utc": 1492091160.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k0yp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg7iprm", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'd like to keep them the way they are. I did actually wonder whether the guy could be a girl, but discarded the idea. The woman is an established character in my 'verse, and parts of the bureaucratic absurdity are gendered. It's important to the climax to separate them -- the deportation chaos has the men leave town and the women's transport halted. So it works along a gender divide.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to keep them the way they are. I did actually wonder whether the guy could be a girl, but discarded the idea. The woman is an established character in my &amp;#39;verse, and parts of the bureaucratic absurdity are gendered. It&amp;#39;s important to the climax to separate them -- the deportation chaos has the men leave town and the women&amp;#39;s transport halted. So it works along a gender divide.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7k0yp", "score_hidden": false, "stickied": false, "created": 1492119815.0, "created_utc": 1492091015.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8h7l9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaneblaise", "parent_id": "t1_dg881or", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "That can work too if your mind can wrap around it instinctively. I know gay characters are difficult for me to set my brain into because I've so rarely been around gay people, so that wouldn't work as well for myself. But yeah, same idea, and do whatever works best for you! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That can work too if your mind can wrap around it instinctively. I know gay characters are difficult for me to set my brain into because I&amp;#39;ve so rarely been around gay people, so that wouldn&amp;#39;t work as well for myself. But yeah, same idea, and do whatever works best for you! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8h7l9", "score_hidden": false, "stickied": false, "created": 1492158166.0, "created_utc": 1492129366.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg881or", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bitchyfruitcup", "parent_id": "t1_dg7iprm", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "See, my suggestion was going to be to make one or both of them gay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See, my suggestion was going to be to make one or both of them gay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg881or", "score_hidden": false, "stickied": false, "created": 1492146220.0, "created_utc": 1492117420.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7iprm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "kaneblaise", "parent_id": "t1_dg7i59o", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Beyond their unwanted-romance, are these two characters' genders important to the story otherwise? Would it help you to write them both as male or both as female and then go through and just change one in a later edit? It's not a perfect fix, but so often our default beliefs about the world will lead our stories in certain directions. If you can't overcome your bias (in this instance) about a male and female not being romantic, then what if they're just two dudes or two chicks traveling together (until you edit it later)?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Beyond their unwanted-romance, are these two characters&amp;#39; genders important to the story otherwise? Would it help you to write them both as male or both as female and then go through and just change one in a later edit? It&amp;#39;s not a perfect fix, but so often our default beliefs about the world will lead our stories in certain directions. If you can&amp;#39;t overcome your bias (in this instance) about a male and female not being romantic, then what if they&amp;#39;re just two dudes or two chicks traveling together (until you edit it later)?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7iprm", "score_hidden": false, "stickied": false, "created": 1492118021.0, "created_utc": 1492089221.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7s22p", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7qzuo", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; That is something that could be a game-changer in their relationship, where although the sex part may still not be something they're comfortable with, they see each other as a companionship as well as two professionals trying to work together. \n\nExactly. This sounds a lot like a midpoint, or leading up to a midpoint :D ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That is something that could be a game-changer in their relationship, where although the sex part may still not be something they&amp;#39;re comfortable with, they see each other as a companionship as well as two professionals trying to work together. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Exactly. This sounds a lot like a midpoint, or leading up to a midpoint :D &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7s22p", "score_hidden": false, "stickied": false, "created": 1492128922.0, "created_utc": 1492100122.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qzuo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg7oln5", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "That's an interesting perspective. It gives me some fodder for the third draft, where it needs some real thought about where they're going together and how to get over her frustrations about him.\n\nThere is a scene where he sits and listens to her relating a traumatic encounter with a rogue spirit (we see the attack, but she let's him know that there's something strange going on) and there's the warmth developing between them in the face of adversity. That is something that could be a game-changer in their relationship, where although the sex part may still not be something they're comfortable with, they see each other as a companionship as well as two professionals trying to work together. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s an interesting perspective. It gives me some fodder for the third draft, where it needs some real thought about where they&amp;#39;re going together and how to get over her frustrations about him.&lt;/p&gt;\n\n&lt;p&gt;There is a scene where he sits and listens to her relating a traumatic encounter with a rogue spirit (we see the attack, but she let&amp;#39;s him know that there&amp;#39;s something strange going on) and there&amp;#39;s the warmth developing between them in the face of adversity. That is something that could be a game-changer in their relationship, where although the sex part may still not be something they&amp;#39;re comfortable with, they see each other as a companionship as well as two professionals trying to work together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7qzuo", "score_hidden": false, "stickied": false, "created": 1492127792.0, "created_utc": 1492098992.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7oln5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7i59o", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "So, as I see it, you have two options — let it happen, or change your perception of this \"romance.\" It sounds like, with a lesbian and a guy, that this has the perfect potential to be a \"bromance.\" They can be very close friends (and even pretend to be married, ever seen that ridiculous Adam Sandler movie Chuck &amp; Larry?) without actual romantic feelings developing. Especially if one character is heartbroken, that kind of companionship without expectations or strings attached can be very comforting. \n\nAlternatively, maybe she's bi for this dude and they're just gonna insist on getting it on. \n\nYou could, without rewriting anything, have them both independently (now that they're separated) wonder what they hell they were doing, probably getting caught up in the moment, playing the role too well, and when they meet again have an awkward kind of \"So... about that thing we did...\" \"Yeah... That was weird, right?\" \"Oh my god, you too? I was worried I was going to break your heart.\" \"Nah dude. It's cool. Friends?\" \n\nMaybe that could work? I've definitely slept with/tried dating friends before and we both simultaneously realized how very wrong it was and laughed about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, as I see it, you have two options — let it happen, or change your perception of this &amp;quot;romance.&amp;quot; It sounds like, with a lesbian and a guy, that this has the perfect potential to be a &amp;quot;bromance.&amp;quot; They can be very close friends (and even pretend to be married, ever seen that ridiculous Adam Sandler movie Chuck &amp;amp; Larry?) without actual romantic feelings developing. Especially if one character is heartbroken, that kind of companionship without expectations or strings attached can be very comforting. &lt;/p&gt;\n\n&lt;p&gt;Alternatively, maybe she&amp;#39;s bi for this dude and they&amp;#39;re just gonna insist on getting it on. &lt;/p&gt;\n\n&lt;p&gt;You could, without rewriting anything, have them both independently (now that they&amp;#39;re separated) wonder what they hell they were doing, probably getting caught up in the moment, playing the role too well, and when they meet again have an awkward kind of &amp;quot;So... about that thing we did...&amp;quot; &amp;quot;Yeah... That was weird, right?&amp;quot; &amp;quot;Oh my god, you too? I was worried I was going to break your heart.&amp;quot; &amp;quot;Nah dude. It&amp;#39;s cool. Friends?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Maybe that could work? I&amp;#39;ve definitely slept with/tried dating friends before and we both simultaneously realized how very wrong it was and laughed about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7oln5", "score_hidden": false, "stickied": false, "created": 1492125229.0, "created_utc": 1492096429.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7k6c0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FatedTitan", "parent_id": "t1_dg7i59o", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "That's simple.  Let them be friends.  You don't go kissing every guy you see on the street or even every guy friend you have.  We all have incredibly good friends of the opposite sex that we aren't attracted to.  Not everyone is a sex target for the other.  Friends can be friends and there be nothing sexual about it.  This actually happens far more often than the alternative.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s simple.  Let them be friends.  You don&amp;#39;t go kissing every guy you see on the street or even every guy friend you have.  We all have incredibly good friends of the opposite sex that we aren&amp;#39;t attracted to.  Not everyone is a sex target for the other.  Friends can be friends and there be nothing sexual about it.  This actually happens far more often than the alternative.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7k6c0", "score_hidden": false, "stickied": false, "created": 1492120007.0, "created_utc": 1492091207.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7kezf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg7irug", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "There is a little bit of resentment (the woman is from a separate religious community, think something like the Bosnian Muslims but as a smaller minority) but I like the idea of him growing to understand her position and her understanding his conciliatory attempts as not coming from a totally chauvinistic 'why can't we all just get along' position, but develops into a genuine ally. \n\nThere is a point where she asks him for help approaching the authorities, and doing something that is a religious taboo for her but not for him, but finds it hard to trust him fully until close to the climax. So there's that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a little bit of resentment (the woman is from a separate religious community, think something like the Bosnian Muslims but as a smaller minority) but I like the idea of him growing to understand her position and her understanding his conciliatory attempts as not coming from a totally chauvinistic &amp;#39;why can&amp;#39;t we all just get along&amp;#39; position, but develops into a genuine ally. &lt;/p&gt;\n\n&lt;p&gt;There is a point where she asks him for help approaching the authorities, and doing something that is a religious taboo for her but not for him, but finds it hard to trust him fully until close to the climax. So there&amp;#39;s that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7kezf", "score_hidden": false, "stickied": false, "created": 1492120318.0, "created_utc": 1492091518.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7irug", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SamOfGrayhaven", "parent_id": "t1_dg7i59o", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Maybe stop fighting it?  You have two professionals who respect one another and who are both effectively forbidden fruit.  You have the ingredients for a secret romance plot underneath everything else, so why not just play into it as best you can?  I was going to say make their personalities clash so they hate each other, but then that will likely just turn into tension and end up the same way, but you might be able to buy some more time.\n\nI know I'm have similar problems trying to even out romance subplots in my stories, but I usually write a more \"loner\" male character, so it's easiest to just change the context where he meets new people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe stop fighting it?  You have two professionals who respect one another and who are both effectively forbidden fruit.  You have the ingredients for a secret romance plot underneath everything else, so why not just play into it as best you can?  I was going to say make their personalities clash so they hate each other, but then that will likely just turn into tension and end up the same way, but you might be able to buy some more time.&lt;/p&gt;\n\n&lt;p&gt;I know I&amp;#39;m have similar problems trying to even out romance subplots in my stories, but I usually write a more &amp;quot;loner&amp;quot; male character, so it&amp;#39;s easiest to just change the context where he meets new people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7irug", "score_hidden": false, "stickied": false, "created": 1492118108.0, "created_utc": 1492089308.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8846e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg86mz8", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Oh yes. I remember a good book I read where there was a gay romance going on, and I assumed the two characters were a couple before they actually decided to be an item.\n\nI think I marked that as the point where I could successfully identify chemistry subtext, having finally experienced it myself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yes. I remember a good book I read where there was a gay romance going on, and I assumed the two characters were a couple before they actually decided to be an item.&lt;/p&gt;\n\n&lt;p&gt;I think I marked that as the point where I could successfully identify chemistry subtext, having finally experienced it myself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8846e", "score_hidden": false, "stickied": false, "created": 1492146301.0, "created_utc": 1492117501.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86mz8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EclecticDreck", "parent_id": "t1_dg7i59o", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The very first romance arc I ever wrote happened by accident.  I was trying to close out a part that would lead to most of the cast getting themselves killed when I realized that, given the circumstances and the odd chemistry these two characters had, them having sex would be the single most realistic thing to have happen.  I was worried that it would sound like it came out of left field, and yet the opposite happened.  People pointed out where the romance started thirty thousand words before *I* figured it out.\n\nThis time around I planned for the romance to happen all along and, to be perfectly honest, I'm not at all convinced that I'm selling it right.  Then again, I am in the middle of writing it (which is what I *should* be doing but this question just happened to directly apply to my current quandary so here I am, wasting words), and so am in a poor position to judge.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The very first romance arc I ever wrote happened by accident.  I was trying to close out a part that would lead to most of the cast getting themselves killed when I realized that, given the circumstances and the odd chemistry these two characters had, them having sex would be the single most realistic thing to have happen.  I was worried that it would sound like it came out of left field, and yet the opposite happened.  People pointed out where the romance started thirty thousand words before &lt;em&gt;I&lt;/em&gt; figured it out.&lt;/p&gt;\n\n&lt;p&gt;This time around I planned for the romance to happen all along and, to be perfectly honest, I&amp;#39;m not at all convinced that I&amp;#39;m selling it right.  Then again, I am in the middle of writing it (which is what I &lt;em&gt;should&lt;/em&gt; be doing but this question just happened to directly apply to my current quandary so here I am, wasting words), and so am in a poor position to judge.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg86mz8", "score_hidden": false, "stickied": false, "created": 1492144616.0, "created_utc": 1492115816.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg90cj3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EltaninAntenna", "parent_id": "t1_dg8zyny", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Not on my account, please. I think I came across harsher than I actually felt about it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not on my account, please. I think I came across harsher than I actually felt about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg90cj3", "score_hidden": false, "stickied": false, "created": 1492196664.0, "created_utc": 1492167864.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zyny", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg8cdx8", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'll go back and edit it...I am sorry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll go back and edit it...I am sorry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8zyny", "score_hidden": false, "stickied": false, "created": 1492195515.0, "created_utc": 1492166715.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8cdx8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EltaninAntenna", "parent_id": "t1_dg7n0k1", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "No offence taken, of course. It's just that, the way you initially put it, a romance is a necessary part of the plot and its absence some kind of oversight. \n\nOf course, if you were writing a romantic novel and forgot the romance, then yeah, that can be a problem. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No offence taken, of course. It&amp;#39;s just that, the way you initially put it, a romance is a necessary part of the plot and its absence some kind of oversight. &lt;/p&gt;\n\n&lt;p&gt;Of course, if you were writing a romantic novel and forgot the romance, then yeah, that can be a problem. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8cdx8", "score_hidden": false, "stickied": false, "created": 1492151683.0, "created_utc": 1492122883.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7n0k1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg7mhuu", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Nah, it isn't mandatory at all -- I'm sorry if I caused offence. I just didn't write it *at all*, at least not the actual romantic getting together/staying together parts where it would be normal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nah, it isn&amp;#39;t mandatory at all -- I&amp;#39;m sorry if I caused offence. I just didn&amp;#39;t write it &lt;em&gt;at all&lt;/em&gt;, at least not the actual romantic getting together/staying together parts where it would be normal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7n0k1", "score_hidden": false, "stickied": false, "created": 1492123462.0, "created_utc": 1492094662.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mhuu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EltaninAntenna", "parent_id": "t1_dg7i59o", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; I used to be terrible at remembering to put romance in my stories,\n\nFuck, I hadn't realised it was mandatory. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I used to be terrible at remembering to put romance in my stories,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Fuck, I hadn&amp;#39;t realised it was mandatory. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7mhuu", "score_hidden": false, "stickied": false, "created": 1492122863.0, "created_utc": 1492094063.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7i59o", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "crowqueen", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "What I want to know is how you *stop* two characters falling in love. I wrote female and male fantasy priests on a quest to solve a mystery, because I wanted the privileged/minority dynamic and to write the MF dynamic without romance.\n\nMy main couple have been steadfastly refusing to obey my orders to stay out of each others' arms and to stop kissing. I got another character to forcibly engage them (this setting takes petty meddlesome bureaucratic steamroller to its logical conclusion) and they said, 'Ehhhhhhh, not so bad.' I even made the woman lesbian, because I was going for a 'casually queer' protagonist, but it's actually been hard to convince me of that.\n\nI've ended up having to deport the guy to a labour camp (in the chaotic aftermath of a riot) just to split them up.\n\nI think I need another draft and to maybe be a bit kinder on them, and have something blossoming, if not romance, then deeper platonic friendship, between them when it's cut short. The ending has to be that way -- because ultimately it's a tragic ending for him; he *does* get sorted out eventually and made a chaplain in the camp, but it's still a tragedy for someone who was on course for a bishopric -- but if two characters want something, it's hard not to give it to them.\n\n~~I used to be terrible at remembering to put romance in my stories, and~~ Most of my characters were single and uninterested, f###-buddies, or happily married, but then I met my husband, and that became so much easier to write. I guess I don't write pure romance, so in some regards it's easier to have a romance plot that's more like my own relationship, but this is all interesting information and if I do write a good romance then I'll certainly use this advice. ", "edited": 1492166743.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What I want to know is how you &lt;em&gt;stop&lt;/em&gt; two characters falling in love. I wrote female and male fantasy priests on a quest to solve a mystery, because I wanted the privileged/minority dynamic and to write the MF dynamic without romance.&lt;/p&gt;\n\n&lt;p&gt;My main couple have been steadfastly refusing to obey my orders to stay out of each others&amp;#39; arms and to stop kissing. I got another character to forcibly engage them (this setting takes petty meddlesome bureaucratic steamroller to its logical conclusion) and they said, &amp;#39;Ehhhhhhh, not so bad.&amp;#39; I even made the woman lesbian, because I was going for a &amp;#39;casually queer&amp;#39; protagonist, but it&amp;#39;s actually been hard to convince me of that.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve ended up having to deport the guy to a labour camp (in the chaotic aftermath of a riot) just to split them up.&lt;/p&gt;\n\n&lt;p&gt;I think I need another draft and to maybe be a bit kinder on them, and have something blossoming, if not romance, then deeper platonic friendship, between them when it&amp;#39;s cut short. The ending has to be that way -- because ultimately it&amp;#39;s a tragic ending for him; he &lt;em&gt;does&lt;/em&gt; get sorted out eventually and made a chaplain in the camp, but it&amp;#39;s still a tragedy for someone who was on course for a bishopric -- but if two characters want something, it&amp;#39;s hard not to give it to them.&lt;/p&gt;\n\n&lt;p&gt;&lt;del&gt;I used to be terrible at remembering to put romance in my stories, and&lt;/del&gt; Most of my characters were single and uninterested, f###-buddies, or happily married, but then I met my husband, and that became so much easier to write. I guess I don&amp;#39;t write pure romance, so in some regards it&amp;#39;s easier to have a romance plot that&amp;#39;s more like my own relationship, but this is all interesting information and if I do write a good romance then I&amp;#39;ll certainly use this advice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7i59o", "score_hidden": false, "stickied": false, "created": 1492117176.0, "created_utc": 1492088376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7pkwx", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7jfgm", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "What you're referring to is often called the \"meet cute.\" And generally, it's the hardest part of the romance to get right. You have to show the characters in their element, working toward a goal (but probably not the big one) and butting heads (because this leads directly into that \"no way, Jose\" moment). \n\nYou have to get creative! Maybe she's helping a friend out at some charity function and he mistakes her for a high-class lady (I've seen this trope a lot and it works well to set up funny situations where she has to keep up the charade). Maybe he's slumming it to follow a hot tip and the opposite happens (I once wrote a story with a heroine that hated people flashing around wealth and hated accepting \"charity\" despite being super poor and... she of course fell for a billionaire ;) ). Without knowing specific details, it's harder to say. You have to give them a scene early on in both their arcs (if it's a romance, the closer to page one it is, the better) where their paths cross in an unexpected way. Watch the first ten to fifteen minutes of a bunch of romantic comedies and you'll start to get a feel for how it's done. Meet cutes are *hard* but they set the whole tone for the rest of the romance, and often, at the denouement, you want to try to \"echo\" the meet cute, so make it count! This is the story they'll be telling their grandkids about how they met :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What you&amp;#39;re referring to is often called the &amp;quot;meet cute.&amp;quot; And generally, it&amp;#39;s the hardest part of the romance to get right. You have to show the characters in their element, working toward a goal (but probably not the big one) and butting heads (because this leads directly into that &amp;quot;no way, Jose&amp;quot; moment). &lt;/p&gt;\n\n&lt;p&gt;You have to get creative! Maybe she&amp;#39;s helping a friend out at some charity function and he mistakes her for a high-class lady (I&amp;#39;ve seen this trope a lot and it works well to set up funny situations where she has to keep up the charade). Maybe he&amp;#39;s slumming it to follow a hot tip and the opposite happens (I once wrote a story with a heroine that hated people flashing around wealth and hated accepting &amp;quot;charity&amp;quot; despite being super poor and... she of course fell for a billionaire ;) ). Without knowing specific details, it&amp;#39;s harder to say. You have to give them a scene early on in both their arcs (if it&amp;#39;s a romance, the closer to page one it is, the better) where their paths cross in an unexpected way. Watch the first ten to fifteen minutes of a bunch of romantic comedies and you&amp;#39;ll start to get a feel for how it&amp;#39;s done. Meet cutes are &lt;em&gt;hard&lt;/em&gt; but they set the whole tone for the rest of the romance, and often, at the denouement, you want to try to &amp;quot;echo&amp;quot; the meet cute, so make it count! This is the story they&amp;#39;ll be telling their grandkids about how they met :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7pkwx", "score_hidden": false, "stickied": false, "created": 1492126286.0, "created_utc": 1492097486.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7nf89", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7jfgm", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "What you probably need is a place where the low-class and high-class collide. I'd start there. For what would the HC character venture into a low class setting? Public transit? To buy clothes? To go out to a party or buy something sketchy? The nice thing about that (doing something sketchy) is it also gives the HC and LC character a secret, so that if perhaps the LC character ends up as a table waiter for a catered event later, the HC and LC are pushed together and forced to \"deal with\" the possibility of someone saying something.\n\nI'm sure Ging will have other good ideas. This is just what came to mind for me. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What you probably need is a place where the low-class and high-class collide. I&amp;#39;d start there. For what would the HC character venture into a low class setting? Public transit? To buy clothes? To go out to a party or buy something sketchy? The nice thing about that (doing something sketchy) is it also gives the HC and LC character a secret, so that if perhaps the LC character ends up as a table waiter for a catered event later, the HC and LC are pushed together and forced to &amp;quot;deal with&amp;quot; the possibility of someone saying something.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure Ging will have other good ideas. This is just what came to mind for me. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7nf89", "score_hidden": false, "stickied": false, "created": 1492123928.0, "created_utc": 1492095128.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8gw60", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8dpig", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "This made me think of 2 Weeks' Notice with Sandra Bullock! They clash because his development firm wants to tear down the community center in her building and he doesn't see it as a big deal, but it has huge sentimental value to her and her family, and even more value to the community. A solid cause is always a good point of conflict. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This made me think of 2 Weeks&amp;#39; Notice with Sandra Bullock! They clash because his development firm wants to tear down the community center in her building and he doesn&amp;#39;t see it as a big deal, but it has huge sentimental value to her and her family, and even more value to the community. A solid cause is always a good point of conflict. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8gw60", "score_hidden": false, "stickied": false, "created": 1492157723.0, "created_utc": 1492128923.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8dpig", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RuhWalde", "parent_id": "t1_dg7jfgm", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Put the middle class one in a service position at a place that the wealthy one regularly patronizes.  Or for more conflict, make them involved in a cause that the wealthy one opposes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Put the middle class one in a service position at a place that the wealthy one regularly patronizes.  Or for more conflict, make them involved in a cause that the wealthy one opposes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8dpig", "score_hidden": false, "stickied": false, "created": 1492153429.0, "created_utc": 1492124629.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jfgm", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "PiLamdOd", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "What are good ways to come up with a reason for the characters to meet and further get to know each other, when it is not obvious to them that they are wrapped up in the same plot?\n\nI have two characters in a modern urban setting, from opposite walks of life, one is high class and wealthy while the other is middle class. Both of them are unknowingly on opposing sides of the villain's plot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are good ways to come up with a reason for the characters to meet and further get to know each other, when it is not obvious to them that they are wrapped up in the same plot?&lt;/p&gt;\n\n&lt;p&gt;I have two characters in a modern urban setting, from opposite walks of life, one is high class and wealthy while the other is middle class. Both of them are unknowingly on opposing sides of the villain&amp;#39;s plot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7jfgm", "score_hidden": false, "stickied": false, "created": 1492119019.0, "created_utc": 1492090219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg87b7a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Crimsonian", "parent_id": "t1_dg86ssu", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I mean, no it's not like saying that at all. If there was a rule that all fantasy had to have a dragon, then yeah, sure, it's almost like saying that.\n\nAnd saying we don't have control over it is simply wrong. I mean, yes, you and I don't have any control to dictate any rules. But my argument is that a lot of people can change things. If they wanted to. I'm not saying anyone should dictate anything one way or the other. But I am humbly trying to coerce people to take up the same cause, and maybe at some point put an end to the nonsense.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, no it&amp;#39;s not like saying that at all. If there was a rule that all fantasy had to have a dragon, then yeah, sure, it&amp;#39;s almost like saying that.&lt;/p&gt;\n\n&lt;p&gt;And saying we don&amp;#39;t have control over it is simply wrong. I mean, yes, you and I don&amp;#39;t have any control to dictate any rules. But my argument is that a lot of people can change things. If they wanted to. I&amp;#39;m not saying anyone should dictate anything one way or the other. But I am humbly trying to coerce people to take up the same cause, and maybe at some point put an end to the nonsense.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg87b7a", "score_hidden": false, "stickied": false, "created": 1492145385.0, "created_utc": 1492116585.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86ssu", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg868zl", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I propose that someday when we put you in charge of all things, you institute such new rules. :D\n\nI see your point. It's fine. It make sense. But just like saying \"I propose all fantasy should include dragons or it should be forever referred to as **non-dragon fantasy**\" it really isn't something I feel like we have much control over. \n\nSort of like why rap-rock exists at all. Not only is it a terrible name for a genre. But the genre itself is an abomination. ;D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I propose that someday when we put you in charge of all things, you institute such new rules. :D&lt;/p&gt;\n\n&lt;p&gt;I see your point. It&amp;#39;s fine. It make sense. But just like saying &amp;quot;I propose all fantasy should include dragons or it should be forever referred to as &lt;strong&gt;non-dragon fantasy&lt;/strong&gt;&amp;quot; it really isn&amp;#39;t something I feel like we have much control over. &lt;/p&gt;\n\n&lt;p&gt;Sort of like why rap-rock exists at all. Not only is it a terrible name for a genre. But the genre itself is an abomination. ;D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg86ssu", "score_hidden": false, "stickied": false, "created": 1492144802.0, "created_utc": 1492116002.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8goq7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg868zl", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'd argue that is should be (and probably is) the opposite. Romance - Tragedy. Romance is an established genre with established rules and no amount of recategorizing or organizing is going to change what readers ultimately want out of the genre. As a romance reader, I'd be pissed if what you suggested happened, because it cuts out ALL the other subgenres. There's romantic suspense. Fantasy romance. Dark romance. Romantic mysteries. Erotic romance. Sci-fi romance. Young adult romance. Middle grade romance. Historical Romance. Contemporary romance. New adult romance. And on, and on, and on. Lumping them all together just because they have a happy ending is so short-sighted. And why only apply this standard to romance? Most action/adventures end with the hero defeating the bad guys. Do we need to recategorize them as \"Adventure - Triumphant\"? What about all those mysteries, where the mystery is actually, you know solved? \n\nEvery genre has expectations. You're picking on romance for pretty arbitrary reasons, I think. Just because you disagree with the genre labeling doesn't mean you're correct. And there's a place for the romance you want, it's just not categorized as general romance because it's not marketable as such.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d argue that is should be (and probably is) the opposite. Romance - Tragedy. Romance is an established genre with established rules and no amount of recategorizing or organizing is going to change what readers ultimately want out of the genre. As a romance reader, I&amp;#39;d be pissed if what you suggested happened, because it cuts out ALL the other subgenres. There&amp;#39;s romantic suspense. Fantasy romance. Dark romance. Romantic mysteries. Erotic romance. Sci-fi romance. Young adult romance. Middle grade romance. Historical Romance. Contemporary romance. New adult romance. And on, and on, and on. Lumping them all together just because they have a happy ending is so short-sighted. And why only apply this standard to romance? Most action/adventures end with the hero defeating the bad guys. Do we need to recategorize them as &amp;quot;Adventure - Triumphant&amp;quot;? What about all those mysteries, where the mystery is actually, you know solved? &lt;/p&gt;\n\n&lt;p&gt;Every genre has expectations. You&amp;#39;re picking on romance for pretty arbitrary reasons, I think. Just because you disagree with the genre labeling doesn&amp;#39;t mean you&amp;#39;re correct. And there&amp;#39;s a place for the romance you want, it&amp;#39;s just not categorized as general romance because it&amp;#39;s not marketable as such.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8goq7", "score_hidden": false, "stickied": false, "created": 1492157432.0, "created_utc": 1492128632.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg868zl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Crimsonian", "parent_id": "t1_dg855uq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Ah, see, this is a very good metaphor. Thank you Brian. I think I can work with this to further articulate my point (with which, as you well know, I have a problem sometimes). \n\nI agree with you, that is what the metal audience wants. But that's not how I see it. Let me offer a different comparison in the same style:\n\nI do see what you mean. Metal heads love the loud guitar, loud noises, and lightning quick drumming. And that isn't a flaw. However as a rock lover, if you said \"all rock mus be that\" I'd promptly tell you to fuck off. \n\nMetal is still rock. It's a sub genre of rock. They share a lot of the same instruments, a lot of the same elements. But metal is still a part of rock.\n\nMy proposal isn't \"all romance is stupid\" -- no no, don't misunderstand. I love romance. I just hate the genre. \n\nThe romance genre is like saying all rock is metal. Which it isn't. And in that same way, the romance genre says \"all romance stories have happy endings\" which they fucking don't. So calling the genre \"romance\" and one of the rules of that genre that there has to be a happy ending. Would be like to call the genre \"rock\" and have the rules of it be that it must be metal.\n\nThere's more to romance than a happy ending. So much in the way that it's:\n\nROCK: \n- Alternative\n- Metal\n- Prog\n\nIt should be:\n\nROMANCE:\n- Optimistic\n\nAnd I do think that optimistic should be the only sub genre (that I know of at the moment). And that may sound silly, why should the original version of the genre be the one put as a sub genre? My answer is: Because the people that read that apparently don't mind *knowing* what ending they're going to get. The rest of us, or at least plenty of us, do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, see, this is a very good metaphor. Thank you Brian. I think I can work with this to further articulate my point (with which, as you well know, I have a problem sometimes). &lt;/p&gt;\n\n&lt;p&gt;I agree with you, that is what the metal audience wants. But that&amp;#39;s not how I see it. Let me offer a different comparison in the same style:&lt;/p&gt;\n\n&lt;p&gt;I do see what you mean. Metal heads love the loud guitar, loud noises, and lightning quick drumming. And that isn&amp;#39;t a flaw. However as a rock lover, if you said &amp;quot;all rock mus be that&amp;quot; I&amp;#39;d promptly tell you to fuck off. &lt;/p&gt;\n\n&lt;p&gt;Metal is still rock. It&amp;#39;s a sub genre of rock. They share a lot of the same instruments, a lot of the same elements. But metal is still a part of rock.&lt;/p&gt;\n\n&lt;p&gt;My proposal isn&amp;#39;t &amp;quot;all romance is stupid&amp;quot; -- no no, don&amp;#39;t misunderstand. I love romance. I just hate the genre. &lt;/p&gt;\n\n&lt;p&gt;The romance genre is like saying all rock is metal. Which it isn&amp;#39;t. And in that same way, the romance genre says &amp;quot;all romance stories have happy endings&amp;quot; which they fucking don&amp;#39;t. So calling the genre &amp;quot;romance&amp;quot; and one of the rules of that genre that there has to be a happy ending. Would be like to call the genre &amp;quot;rock&amp;quot; and have the rules of it be that it must be metal.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s more to romance than a happy ending. So much in the way that it&amp;#39;s:&lt;/p&gt;\n\n&lt;p&gt;ROCK: \n- Alternative\n- Metal\n- Prog&lt;/p&gt;\n\n&lt;p&gt;It should be:&lt;/p&gt;\n\n&lt;p&gt;ROMANCE:\n- Optimistic&lt;/p&gt;\n\n&lt;p&gt;And I do think that optimistic should be the only sub genre (that I know of at the moment). And that may sound silly, why should the original version of the genre be the one put as a sub genre? My answer is: Because the people that read that apparently don&amp;#39;t mind &lt;em&gt;knowing&lt;/em&gt; what ending they&amp;#39;re going to get. The rest of us, or at least plenty of us, do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg868zl", "score_hidden": false, "stickied": false, "created": 1492144174.0, "created_utc": 1492115374.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg855uq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg84n7y", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "/u/crimsonian\n\nTo piggy back off this, it's sort of like saying \"Well metal sucks because it's all too loud...\"\n\nYeah. I suppose it's a valid argument. Metal is loud. And that's a fine reason to hate metal. But it isn't really a \"flaw\" -- just a thing the metal audience wants (fast guitars with shrieking sounds and loud noises and driving drums) that other people (like my grandma) don't want.\n\nGenre's don't have problems. Inherently. Because they were established by readers for readers. They have clichés. They have repetition and expectation, and these things might be annoying to some people -- but just like music genres, they exist because enough people like that particular thing to categorize all books that do that particular thing into that particular group. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/crimsonian\"&gt;/u/crimsonian&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;To piggy back off this, it&amp;#39;s sort of like saying &amp;quot;Well metal sucks because it&amp;#39;s all too loud...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Yeah. I suppose it&amp;#39;s a valid argument. Metal is loud. And that&amp;#39;s a fine reason to hate metal. But it isn&amp;#39;t really a &amp;quot;flaw&amp;quot; -- just a thing the metal audience wants (fast guitars with shrieking sounds and loud noises and driving drums) that other people (like my grandma) don&amp;#39;t want.&lt;/p&gt;\n\n&lt;p&gt;Genre&amp;#39;s don&amp;#39;t have problems. Inherently. Because they were established by readers for readers. They have clichés. They have repetition and expectation, and these things might be annoying to some people -- but just like music genres, they exist because enough people like that particular thing to categorize all books that do that particular thing into that particular group. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg855uq", "score_hidden": false, "stickied": false, "created": 1492142977.0, "created_utc": 1492114177.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg853ko", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Crimsonian", "parent_id": "t1_dg84n7y", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Absolutely, but that's sort of my argument. There's this mismatch, I think, in who does and who doesn't read romance. I think if you go by how romance is defined, and it's one of the genre rules quite explicitly that they do have to have a happy ending to be a romance story, then you have that readership of 30-40 year old married women. But that definition, or rule, a lot of people, including me, find that boring. To know the end is massively boring. \n\nSo fine, let that be *a version* of romance. A sub-category, if you will. But let other things be romance, too. This monopolization of stories with happy endings of the genre \"romance\" takes away from the word and the meaning of the genre itself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely, but that&amp;#39;s sort of my argument. There&amp;#39;s this mismatch, I think, in who does and who doesn&amp;#39;t read romance. I think if you go by how romance is defined, and it&amp;#39;s one of the genre rules quite explicitly that they do have to have a happy ending to be a romance story, then you have that readership of 30-40 year old married women. But that definition, or rule, a lot of people, including me, find that boring. To know the end is massively boring. &lt;/p&gt;\n\n&lt;p&gt;So fine, let that be &lt;em&gt;a version&lt;/em&gt; of romance. A sub-category, if you will. But let other things be romance, too. This monopolization of stories with happy endings of the genre &amp;quot;romance&amp;quot; takes away from the word and the meaning of the genre itself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg853ko", "score_hidden": false, "stickied": false, "created": 1492142906.0, "created_utc": 1492114106.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84n7y", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7yluz", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "While you're totally right in the real world, with all books, you have to keep in mind genre expectations. You are more than welcome to write a romance where the hero dies or something, but be ready for readers to flay you alive. There's a reason Nicholas Sparks refuses to categorize his books as romance. \n\nRomance is all about escapism, fantasy, and wish fulfillment. If you think about the target audience, it's usually 30-40 year old married women with careers and children. They have busy, hectic, stressful lives and sometimes (or a lot of the times) very unsatisfying marriages. Reading these books is what gets them through the day. \n\nI've had readers dealing with debilitating chronic illnesses that leave them bedridden, or people going through chemo treatments, or the loss of a loved one, email me and tell me how my books helped them get through a rough time. Their experience would have been wildly different had I set expectations that this was a romance (implying a happy ending) and failed to deliver on it. \n\nSo maybe romance isn't your cup of tea, but there is a reason for the genre conventions and it's useful to keep them in mind. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While you&amp;#39;re totally right in the real world, with all books, you have to keep in mind genre expectations. You are more than welcome to write a romance where the hero dies or something, but be ready for readers to flay you alive. There&amp;#39;s a reason Nicholas Sparks refuses to categorize his books as romance. &lt;/p&gt;\n\n&lt;p&gt;Romance is all about escapism, fantasy, and wish fulfillment. If you think about the target audience, it&amp;#39;s usually 30-40 year old married women with careers and children. They have busy, hectic, stressful lives and sometimes (or a lot of the times) very unsatisfying marriages. Reading these books is what gets them through the day. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had readers dealing with debilitating chronic illnesses that leave them bedridden, or people going through chemo treatments, or the loss of a loved one, email me and tell me how my books helped them get through a rough time. Their experience would have been wildly different had I set expectations that this was a romance (implying a happy ending) and failed to deliver on it. &lt;/p&gt;\n\n&lt;p&gt;So maybe romance isn&amp;#39;t your cup of tea, but there is a reason for the genre conventions and it&amp;#39;s useful to keep them in mind. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg84n7y", "score_hidden": false, "stickied": false, "created": 1492142400.0, "created_utc": 1492113600.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8m3ei", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Crimsonian", "parent_id": "t1_dg8l6yt", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I suppose. To me a journey is more fun if I'm going to destination unknown, rather than work on a Monday morning. Sure, the rout is alright, but there's no excitement. To each his own. I just wish that genre weren't monopolized by one specific type of ending.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suppose. To me a journey is more fun if I&amp;#39;m going to destination unknown, rather than work on a Monday morning. Sure, the rout is alright, but there&amp;#39;s no excitement. To each his own. I just wish that genre weren&amp;#39;t monopolized by one specific type of ending.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8m3ei", "score_hidden": false, "stickied": false, "created": 1492164903.0, "created_utc": 1492136103.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8l6yt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8jjm6", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It's about the journey, not the destination. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s about the journey, not the destination. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8l6yt", "score_hidden": false, "stickied": false, "created": 1492163634.0, "created_utc": 1492134834.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8jjm6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Crimsonian", "parent_id": "t1_dg8ixs9", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Right, but the thing isn't that I want stories that necessarily have bad endings. I just don't want to know what the ending is. There's no tension for me if I know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right, but the thing isn&amp;#39;t that I want stories that necessarily have bad endings. I just don&amp;#39;t want to know what the ending is. There&amp;#39;s no tension for me if I know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8jjm6", "score_hidden": false, "stickied": false, "created": 1492161358.0, "created_utc": 1492132558.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ixs9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8ic7x", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Well, you can read Nicholas Sparks, or start writing some tragic romances. But don't say I didn't warn you. There are books that buck the trend and they tend to get a lot of attention, but not always for the right reason. If you wanted to find these books, it's not hard. A quick internet search turned up a whole slew of \"romances without happy endings.\" \n\nYou could also look at other genres. Women's fiction often has romantic elements without focusing on the romance and instead on the woman's journey. Family life books tend to be more about the trials and tribulations families face as a unit and there's more wiggle room there. YA also has plenty of tragic romances because sappy melodramatic teenagers will soak it up. You have options. Maybe they're not options you like, but I can't help you there. I didn't make the rules, readers did. If suddenly, 90% of readers felt like you, there'd be a flood of tragic romances, because the books always follow the demand. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, you can read Nicholas Sparks, or start writing some tragic romances. But don&amp;#39;t say I didn&amp;#39;t warn you. There are books that buck the trend and they tend to get a lot of attention, but not always for the right reason. If you wanted to find these books, it&amp;#39;s not hard. A quick internet search turned up a whole slew of &amp;quot;romances without happy endings.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;You could also look at other genres. Women&amp;#39;s fiction often has romantic elements without focusing on the romance and instead on the woman&amp;#39;s journey. Family life books tend to be more about the trials and tribulations families face as a unit and there&amp;#39;s more wiggle room there. YA also has plenty of tragic romances because sappy melodramatic teenagers will soak it up. You have options. Maybe they&amp;#39;re not options you like, but I can&amp;#39;t help you there. I didn&amp;#39;t make the rules, readers did. If suddenly, 90% of readers felt like you, there&amp;#39;d be a flood of tragic romances, because the books always follow the demand. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8ixs9", "score_hidden": false, "stickied": false, "created": 1492160523.0, "created_utc": 1492131723.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ic7x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Crimsonian", "parent_id": "t1_dg8gt25", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'm not at all saying it's more poignant than happy ones. I'm just saying that if you say romance, the genre, can only end with a happy ending, that takes away from the genre in such a massive way. And I get it, not for the people that enjoy that genre. But it's difficult to find a good \"romance/love\" story, when you can't go to the \"romance\" genre for it, because they all end in the same way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not at all saying it&amp;#39;s more poignant than happy ones. I&amp;#39;m just saying that if you say romance, the genre, can only end with a happy ending, that takes away from the genre in such a massive way. And I get it, not for the people that enjoy that genre. But it&amp;#39;s difficult to find a good &amp;quot;romance/love&amp;quot; story, when you can&amp;#39;t go to the &amp;quot;romance&amp;quot; genre for it, because they all end in the same way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8ic7x", "score_hidden": false, "stickied": false, "created": 1492159711.0, "created_utc": 1492130911.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8gt25", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg85tre", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; That story (though choppy, created now in a minute and poorly articulated) is a lot more romantic, than say, a story about an arsonist who realizes the error of her ways because the abs on the big hunky fireman are just so dreamy. \n\nPlease realize this is only your opinion. Not everyone would agree with you that the story you described is \"more romantic.\" Everyone views love and romance differently and just because you have an idea that a tragic romance is somehow more poignant than a happy one, doesn't invalidate everyone that prefers a happy one. I would hate to read a whole book about lovers and find out one of them died. I would feel cheated, throw the book across the room, and never read that author again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That story (though choppy, created now in a minute and poorly articulated) is a lot more romantic, than say, a story about an arsonist who realizes the error of her ways because the abs on the big hunky fireman are just so dreamy. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Please realize this is only your opinion. Not everyone would agree with you that the story you described is &amp;quot;more romantic.&amp;quot; Everyone views love and romance differently and just because you have an idea that a tragic romance is somehow more poignant than a happy one, doesn&amp;#39;t invalidate everyone that prefers a happy one. I would hate to read a whole book about lovers and find out one of them died. I would feel cheated, throw the book across the room, and never read that author again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8gt25", "score_hidden": false, "stickied": false, "created": 1492157601.0, "created_utc": 1492128801.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8h63m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg85tre", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Also, on further reflection, I have to point out that you *are* using the romance arc in your example. The only thing you've changed is a happy ending to a sad. The meeting, the struggling, the grand gesture of going to find their loved one — all part of the arc. You might want to stop thinking of what you want to write as \"whatever genre Romance\" and think of it as \"Romantic whatever genre.\" Something that's \"romantic\" has elements of a romance plot without that being the main focus. In your example, the relationship is not the main point of conflict. The war is. In a romance, the actual relationship would be the conflict. What you've described is a romantic military thriller, most likely, not a military romance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, on further reflection, I have to point out that you &lt;em&gt;are&lt;/em&gt; using the romance arc in your example. The only thing you&amp;#39;ve changed is a happy ending to a sad. The meeting, the struggling, the grand gesture of going to find their loved one — all part of the arc. You might want to stop thinking of what you want to write as &amp;quot;whatever genre Romance&amp;quot; and think of it as &amp;quot;Romantic whatever genre.&amp;quot; Something that&amp;#39;s &amp;quot;romantic&amp;quot; has elements of a romance plot without that being the main focus. In your example, the relationship is not the main point of conflict. The war is. In a romance, the actual relationship would be the conflict. What you&amp;#39;ve described is a romantic military thriller, most likely, not a military romance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8h63m", "score_hidden": false, "stickied": false, "created": 1492158110.0, "created_utc": 1492129310.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg85tre", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Crimsonian", "parent_id": "t1_dg84fyu", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Relationships can have tension even if it's outside factors. In fact, relationships usually do have tension precisely because of outside factors. And I'm not talking exploding trains or evil wizards.\n\nWhile I do get what you're saying, I do also find that a cheap way to create tension. \n\nSay two military vets. Both female, both male, opposite sex (irrelevant). They meet on a tour in whereverstan and then come home, live in separate states, but move in together after some time of long-distancing. Then comes the new war, or whatever, they're selected, and without choice or regard to them, they're put in separate parts of a continent they're fighting on.\n\nOne of them flees their camp during the night because they need to go find the person they love. Either they believe something to have happened to them, or the letter communication they were having suddenly stopped on the other persons end. And all the while through the novel you interject with moments of arguments when they got back home after the first war. Moments where they were down, and the mundane lifestyle was driving them batty and turning them on each other.\n\nThen finally the reach the end, and yep, sure enough the person they loved is dead, that's why the letters stopped coming, but they never managed to mail a last letter, revealing the knew they were going to die in whatevestan or whatever.\n\nThat story (though choppy, created now in a minute and poorly articulated) is a lot more romantic, than say, a story about an arsonist who realizes the error of her ways because the abs on the big hunky fireman are just so dreamy. \n\nThe romance genre lacks most in credibility because it's calls itself romance, and stories where then hunk and dame live happily ever after even though they're poorly fleshed out characters and the relationship doesn't really make sense, those stories are (thumbs up, nice romance) and stories like, say, Romeo and Juliet get chased out with pitchforks and torches because it has an unhappy ending, despite being a vastly more romantic story. That. Is my problem with romance. \n\nI don't think romance stories are bad. I just think that monopolizing the entire genre for stories exclusively with happy endings and predictable roadmaps is a good way to get a genre mocked, and a bad way to have a diverse reader/writership on it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Relationships can have tension even if it&amp;#39;s outside factors. In fact, relationships usually do have tension precisely because of outside factors. And I&amp;#39;m not talking exploding trains or evil wizards.&lt;/p&gt;\n\n&lt;p&gt;While I do get what you&amp;#39;re saying, I do also find that a cheap way to create tension. &lt;/p&gt;\n\n&lt;p&gt;Say two military vets. Both female, both male, opposite sex (irrelevant). They meet on a tour in whereverstan and then come home, live in separate states, but move in together after some time of long-distancing. Then comes the new war, or whatever, they&amp;#39;re selected, and without choice or regard to them, they&amp;#39;re put in separate parts of a continent they&amp;#39;re fighting on.&lt;/p&gt;\n\n&lt;p&gt;One of them flees their camp during the night because they need to go find the person they love. Either they believe something to have happened to them, or the letter communication they were having suddenly stopped on the other persons end. And all the while through the novel you interject with moments of arguments when they got back home after the first war. Moments where they were down, and the mundane lifestyle was driving them batty and turning them on each other.&lt;/p&gt;\n\n&lt;p&gt;Then finally the reach the end, and yep, sure enough the person they loved is dead, that&amp;#39;s why the letters stopped coming, but they never managed to mail a last letter, revealing the knew they were going to die in whatevestan or whatever.&lt;/p&gt;\n\n&lt;p&gt;That story (though choppy, created now in a minute and poorly articulated) is a lot more romantic, than say, a story about an arsonist who realizes the error of her ways because the abs on the big hunky fireman are just so dreamy. &lt;/p&gt;\n\n&lt;p&gt;The romance genre lacks most in credibility because it&amp;#39;s calls itself romance, and stories where then hunk and dame live happily ever after even though they&amp;#39;re poorly fleshed out characters and the relationship doesn&amp;#39;t really make sense, those stories are (thumbs up, nice romance) and stories like, say, Romeo and Juliet get chased out with pitchforks and torches because it has an unhappy ending, despite being a vastly more romantic story. That. Is my problem with romance. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think romance stories are bad. I just think that monopolizing the entire genre for stories exclusively with happy endings and predictable roadmaps is a good way to get a genre mocked, and a bad way to have a diverse reader/writership on it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg85tre", "score_hidden": false, "stickied": false, "created": 1492143708.0, "created_utc": 1492114908.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg84fyu", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7yluz", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "But you realize it isn't so much about how opposites attract. It's about the greatest possible tension. If two high school teachers meet and get together.. bleh. Who cares? Snore fest. A bartender and a customer meet up and hook up? Neat. What a boring endeavor. But a struggling alcoholic and a bartender? Or, as Ging says, a firefighter and an arsonist? \n\nTension in a romance novel is as important as tension in anything else. The problem is, you don't have evil wizards or exploding trains or anything like that to keep you involved. So where does the tension come from? The relationship. And like any good book, there needs to be a problem that can't be solved until the end of the book or who the heck cares that you're writing it. In a romance, the problem is love.\n\nIt's formulaic in the same way that most things are formulaic. Why do we have tropes like the \"chosen one\" or the \"old wise master who dies\" or the \"best friend who tries to calm the chosen one down and amp up the tension\" etc etc. \n\nThe problem I think you have with it (and I think this is perfectly fair) is that you're not interested in the relationship as the cornerstone of the tension. And this is the reason romance isn't a fun read for you. And you may also feel as though this lacks depth, but you and I know full well that there are plenty of fantasy books that lack depth, plenty of techno-thrillers that lack depth, etc. I could argue depth is when genres come together to build a wider base. \n\nJust some thoughts! :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But you realize it isn&amp;#39;t so much about how opposites attract. It&amp;#39;s about the greatest possible tension. If two high school teachers meet and get together.. bleh. Who cares? Snore fest. A bartender and a customer meet up and hook up? Neat. What a boring endeavor. But a struggling alcoholic and a bartender? Or, as Ging says, a firefighter and an arsonist? &lt;/p&gt;\n\n&lt;p&gt;Tension in a romance novel is as important as tension in anything else. The problem is, you don&amp;#39;t have evil wizards or exploding trains or anything like that to keep you involved. So where does the tension come from? The relationship. And like any good book, there needs to be a problem that can&amp;#39;t be solved until the end of the book or who the heck cares that you&amp;#39;re writing it. In a romance, the problem is love.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s formulaic in the same way that most things are formulaic. Why do we have tropes like the &amp;quot;chosen one&amp;quot; or the &amp;quot;old wise master who dies&amp;quot; or the &amp;quot;best friend who tries to calm the chosen one down and amp up the tension&amp;quot; etc etc. &lt;/p&gt;\n\n&lt;p&gt;The problem I think you have with it (and I think this is perfectly fair) is that you&amp;#39;re not interested in the relationship as the cornerstone of the tension. And this is the reason romance isn&amp;#39;t a fun read for you. And you may also feel as though this lacks depth, but you and I know full well that there are plenty of fantasy books that lack depth, plenty of techno-thrillers that lack depth, etc. I could argue depth is when genres come together to build a wider base. &lt;/p&gt;\n\n&lt;p&gt;Just some thoughts! :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg84fyu", "score_hidden": false, "stickied": false, "created": 1492142177.0, "created_utc": 1492113377.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yluz", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Crimsonian", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "This is my fundamental issue with the Romance Genre, and why I claim to, and do stick my the statement that I will never read a book from that genre. At least not for reasons other than re-search.\n\nThis idea that there has to be a makeup at the end.\n\nAlso this idea that opposites attract and stick together is fantastically flawed. Sure, people are all different, and quite often couples may seem like polar opposites (but usually in many ways they're the same). And even when they are opposites, it's the attraction, the whirlwind romance effect that makes them seem like they work so well. He's the firefighter, and she's the arsonist, right? Except realistically that's nonsensical. An introvert and an extrovert may love one another at the start very, very much, but over time they start wearing on each other.\n\nI propose 4 other steps, or really just new steps 3 and 4.\n\n3: The impossible odds.\n\nDo the lovers manage to overcome something keeping them apart? What lengths are they willing to go through for each other? Will they break laws, ruin lives? What will they do to be together.\n\nStep 4: Do they make it?\n\nYes or no. Not only yes, and not only no.\n\nThat's the biggest flaw of the romance genre as I see it. A good love story, hell, \"a good story\" cannot have a fixed positive ending. The make up should not be a nailed down thing. I've long maintained that the tragedy Romeo and Juliet is a great *romance story* even though it's not put in that genre, a lot more say than anything I pick up knowing \"they'll make it in the end.\"\n\nAll is fair in love and war, peeps, and both can be ugly as shit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is my fundamental issue with the Romance Genre, and why I claim to, and do stick my the statement that I will never read a book from that genre. At least not for reasons other than re-search.&lt;/p&gt;\n\n&lt;p&gt;This idea that there has to be a makeup at the end.&lt;/p&gt;\n\n&lt;p&gt;Also this idea that opposites attract and stick together is fantastically flawed. Sure, people are all different, and quite often couples may seem like polar opposites (but usually in many ways they&amp;#39;re the same). And even when they are opposites, it&amp;#39;s the attraction, the whirlwind romance effect that makes them seem like they work so well. He&amp;#39;s the firefighter, and she&amp;#39;s the arsonist, right? Except realistically that&amp;#39;s nonsensical. An introvert and an extrovert may love one another at the start very, very much, but over time they start wearing on each other.&lt;/p&gt;\n\n&lt;p&gt;I propose 4 other steps, or really just new steps 3 and 4.&lt;/p&gt;\n\n&lt;p&gt;3: The impossible odds.&lt;/p&gt;\n\n&lt;p&gt;Do the lovers manage to overcome something keeping them apart? What lengths are they willing to go through for each other? Will they break laws, ruin lives? What will they do to be together.&lt;/p&gt;\n\n&lt;p&gt;Step 4: Do they make it?&lt;/p&gt;\n\n&lt;p&gt;Yes or no. Not only yes, and not only no.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the biggest flaw of the romance genre as I see it. A good love story, hell, &amp;quot;a good story&amp;quot; cannot have a fixed positive ending. The make up should not be a nailed down thing. I&amp;#39;ve long maintained that the tragedy Romeo and Juliet is a great &lt;em&gt;romance story&lt;/em&gt; even though it&amp;#39;s not put in that genre, a lot more say than anything I pick up knowing &amp;quot;they&amp;#39;ll make it in the end.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;All is fair in love and war, peeps, and both can be ugly as shit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7yluz", "score_hidden": false, "stickied": false, "created": 1492135889.0, "created_utc": 1492107089.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7rxwn", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7qi1i", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "If they're *very* alike, that means they likely have the same flaw, which could make for an even more interesting arc. They may be able to recognize the undesirable behavior in the other person, but not see that they're the exact same way and getting a dose of their own medicine is the only way to real growth and understanding. \n\nIt still comes down to the same arc. Maybe their similarities are what initially bring them together, but it's also going to be what drives them apart, because looking in a mirror is hard when there's something there you don't want to see. It's a little bit trickier this way, but still totally doable. \n\nThe main point here, is that they need to be flawed. And whatever that flaw is, it's standing in the way of their happiness. Maybe they're a workaholic. Or a playboy. Or a thousand other things. You have to dredge up those flaws and rub their noses in it. Generally, they can see their flaw through the opposite and both can meet somewhere in the middle, but if they're the same, it means they're going to have a lot of self-discovery in this process and probably have to face some cold hard facts about themselves and the way they're living their life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If they&amp;#39;re &lt;em&gt;very&lt;/em&gt; alike, that means they likely have the same flaw, which could make for an even more interesting arc. They may be able to recognize the undesirable behavior in the other person, but not see that they&amp;#39;re the exact same way and getting a dose of their own medicine is the only way to real growth and understanding. &lt;/p&gt;\n\n&lt;p&gt;It still comes down to the same arc. Maybe their similarities are what initially bring them together, but it&amp;#39;s also going to be what drives them apart, because looking in a mirror is hard when there&amp;#39;s something there you don&amp;#39;t want to see. It&amp;#39;s a little bit trickier this way, but still totally doable. &lt;/p&gt;\n\n&lt;p&gt;The main point here, is that they need to be flawed. And whatever that flaw is, it&amp;#39;s standing in the way of their happiness. Maybe they&amp;#39;re a workaholic. Or a playboy. Or a thousand other things. You have to dredge up those flaws and rub their noses in it. Generally, they can see their flaw through the opposite and both can meet somewhere in the middle, but if they&amp;#39;re the same, it means they&amp;#39;re going to have a lot of self-discovery in this process and probably have to face some cold hard facts about themselves and the way they&amp;#39;re living their life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7rxwn", "score_hidden": false, "stickied": false, "created": 1492128802.0, "created_utc": 1492100002.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg870ab", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "othellia", "parent_id": "t1_dg7qi1i", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Echoing /u/gingasaurusrexx's same flaw advice. Also, if you want to watch some examples, both [Romantics Anonymous](https://en.wikipedia.org/wiki/Romantics_Anonymous) and [Blind Date](https://en.wikipedia.org/wiki/Blind_Date_(2015_film)) are French romcoms with \"very alike\" characters (Romantics Anonymous a little bit more than Blind Date).\n\nRomantics Anonymous follows a woman who's a chocolate pastry chef and a man who's a chocolate manufacturer. Both have extreme social anxiety. Their love for chocolate is what originally brings them together. (Their meet cute is her interview--the man's secretary who normally does interviews is out, the woman does a terrible interview because of her anxiety, but the man is so anxious being the interviewer that he hires her just to get out of the situation.) But their social anxiety and fears of becoming intimate obviously throw wrenches into their love.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Echoing &lt;a href=\"/u/gingasaurusrexx\"&gt;/u/gingasaurusrexx&lt;/a&gt;&amp;#39;s same flaw advice. Also, if you want to watch some examples, both &lt;a href=\"https://en.wikipedia.org/wiki/Romantics_Anonymous\"&gt;Romantics Anonymous&lt;/a&gt; and &lt;a href=\"https://en.wikipedia.org/wiki/Blind_Date_(2015_film\"&gt;Blind Date&lt;/a&gt;) are French romcoms with &amp;quot;very alike&amp;quot; characters (Romantics Anonymous a little bit more than Blind Date).&lt;/p&gt;\n\n&lt;p&gt;Romantics Anonymous follows a woman who&amp;#39;s a chocolate pastry chef and a man who&amp;#39;s a chocolate manufacturer. Both have extreme social anxiety. Their love for chocolate is what originally brings them together. (Their meet cute is her interview--the man&amp;#39;s secretary who normally does interviews is out, the woman does a terrible interview because of her anxiety, but the man is so anxious being the interviewer that he hires her just to get out of the situation.) But their social anxiety and fears of becoming intimate obviously throw wrenches into their love.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg870ab", "score_hidden": false, "stickied": false, "created": 1492145036.0, "created_utc": 1492116236.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qi1i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheAngush", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "*saves article for later*\n\nI have one question, though. \n\n&gt;**First, they need to have opposing goals and clashing personalities.** \n\n&gt;There's a saying in the romance community: If he's a firefighter, she's an arsonist. \n\n&gt;You get the best results when you pit together people that are nothing alike. She could take things too seriously and he never takes anything serious at all (my current WIP) or maybe she longs for adventure and he's weary from his travels (my last book). Whatever the case may be, the uniting factor is **they don't realize what they're doing is wrong.** Generally, they're content with the way things are going, even if they're not happy, and it's the introduction of the other player that turns everything on its head.\n\nMaybe you get the best results when the characters are nothing alike, but... what if they're *very* alike? How do you do development there? \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;saves article for later&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I have one question, though. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;First, they need to have opposing goals and clashing personalities.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a saying in the romance community: If he&amp;#39;s a firefighter, she&amp;#39;s an arsonist. &lt;/p&gt;\n\n&lt;p&gt;You get the best results when you pit together people that are nothing alike. She could take things too seriously and he never takes anything serious at all (my current WIP) or maybe she longs for adventure and he&amp;#39;s weary from his travels (my last book). Whatever the case may be, the uniting factor is &lt;strong&gt;they don&amp;#39;t realize what they&amp;#39;re doing is wrong.&lt;/strong&gt; Generally, they&amp;#39;re content with the way things are going, even if they&amp;#39;re not happy, and it&amp;#39;s the introduction of the other player that turns everything on its head.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Maybe you get the best results when the characters are nothing alike, but... what if they&amp;#39;re &lt;em&gt;very&lt;/em&gt; alike? How do you do development there? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7qi1i", "score_hidden": false, "stickied": false, "created": 1492127265.0, "created_utc": 1492098465.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7ux2s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7u6lh", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "My pleasure! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My pleasure! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7ux2s", "score_hidden": false, "stickied": false, "created": 1492131966.0, "created_utc": 1492103166.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7u6lh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PerfectArchCo", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Can't say I ever intend to write romance but obviously – again as this series proves – so many writers struggle with exactly these sorts of questions. I think your advice is spot on and will help most writers frame the issue more comfortably for their characters. Thanks for the post! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can&amp;#39;t say I ever intend to write romance but obviously – again as this series proves – so many writers struggle with exactly these sorts of questions. I think your advice is spot on and will help most writers frame the issue more comfortably for their characters. Thanks for the post! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7u6lh", "score_hidden": false, "stickied": false, "created": 1492131192.0, "created_utc": 1492102392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg9l9tm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lexi_Banner", "parent_id": "t1_dg9g9f2", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The problem is that too many writers don't make their characters earn that ending - particularly self-published writers.  Then people make assumptions that *romance* is terrible and poorly written - never mind that any of their stories would be of poor quality regardless of genre!  \n\nAn unbelievable, flat character will not improve if they are in a fantasy, or if they are in a romance, or if they are in a literary piece.  The *only* fix is stronger writing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem is that too many writers don&amp;#39;t make their characters earn that ending - particularly self-published writers.  Then people make assumptions that &lt;em&gt;romance&lt;/em&gt; is terrible and poorly written - never mind that any of their stories would be of poor quality regardless of genre!  &lt;/p&gt;\n\n&lt;p&gt;An unbelievable, flat character will not improve if they are in a fantasy, or if they are in a romance, or if they are in a literary piece.  The &lt;em&gt;only&lt;/em&gt; fix is stronger writing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9l9tm", "score_hidden": false, "stickied": false, "created": 1492225696.0, "created_utc": 1492196896.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9g9f2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8xehm", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Exactly! This is the point of having those flaws and putting them through the wringer. They have to **earn** that happy ending. It can't just be handed to them or it feels fake. The satisfaction in a romance, for most readers, comes from seeing how bad things get and wondering \"how in the hell are they ever going to get out of this?!\" Of course you *know* they will, but you don't know *how,* and that's the exciting part that keeps you turning pages. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly! This is the point of having those flaws and putting them through the wringer. They have to &lt;strong&gt;earn&lt;/strong&gt; that happy ending. It can&amp;#39;t just be handed to them or it feels fake. The satisfaction in a romance, for most readers, comes from seeing how bad things get and wondering &amp;quot;how in the hell are they ever going to get out of this?!&amp;quot; Of course you &lt;em&gt;know&lt;/em&gt; they will, but you don&amp;#39;t know &lt;em&gt;how,&lt;/em&gt; and that&amp;#39;s the exciting part that keeps you turning pages. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9g9f2", "score_hidden": false, "stickied": false, "created": 1492219749.0, "created_utc": 1492190949.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xehm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lexi_Banner", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I will say that I agree with some posters that a guaranteed happy ever after can feel cheap and cheesy. But that's not the fault of the ending! That's the fault of a writer who believed there *had* to be a HEA and jammed one on without earning that ending. \n\nA great example is a book I read where the characters meet and kiss within a week followed by gushing I LOVE YOU and sex. Then they fought (about something super petty) and separated, only to meet again the next week and run off for a courthouse wedding. Yay for love! \n\nWait, what? Why couldn't they just end with the characters choosing to work toward their HEA? Why did there have to be a literal wedding? *They've only known each other for a week!*\n\nThis is not bad ROMANCE. This is bad WRITING. The writer could have chosen to stretch the time period longer - given the reader a reason to believe that these people were committed and ready for marriage. They could've chosen a happy-for-now ending. There are lots of things that could be done to improve this story without losing the romantic arc. \n\nThat said, I do believe a romance needs a happy/positive/hopeful ending. I've read romances with unhappy or unsure endings, and it didn't sit right with me. I went in expecting the writer's version of the *genre* - not to be misled into a tragedy. If that's what the you want to write - go for it. Romance just isn't the right place to categorize your book then. You'll do a hell of a lot better if you market your book for what it is. \n\nSo yeah. Make your character genuinely earn their happy ending. Don't go for the white wedding every time. And don't sell me a romance and deliver a tragedy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will say that I agree with some posters that a guaranteed happy ever after can feel cheap and cheesy. But that&amp;#39;s not the fault of the ending! That&amp;#39;s the fault of a writer who believed there &lt;em&gt;had&lt;/em&gt; to be a HEA and jammed one on without earning that ending. &lt;/p&gt;\n\n&lt;p&gt;A great example is a book I read where the characters meet and kiss within a week followed by gushing I LOVE YOU and sex. Then they fought (about something super petty) and separated, only to meet again the next week and run off for a courthouse wedding. Yay for love! &lt;/p&gt;\n\n&lt;p&gt;Wait, what? Why couldn&amp;#39;t they just end with the characters choosing to work toward their HEA? Why did there have to be a literal wedding? &lt;em&gt;They&amp;#39;ve only known each other for a week!&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This is not bad ROMANCE. This is bad WRITING. The writer could have chosen to stretch the time period longer - given the reader a reason to believe that these people were committed and ready for marriage. They could&amp;#39;ve chosen a happy-for-now ending. There are lots of things that could be done to improve this story without losing the romantic arc. &lt;/p&gt;\n\n&lt;p&gt;That said, I do believe a romance needs a happy/positive/hopeful ending. I&amp;#39;ve read romances with unhappy or unsure endings, and it didn&amp;#39;t sit right with me. I went in expecting the writer&amp;#39;s version of the &lt;em&gt;genre&lt;/em&gt; - not to be misled into a tragedy. If that&amp;#39;s what the you want to write - go for it. Romance just isn&amp;#39;t the right place to categorize your book then. You&amp;#39;ll do a hell of a lot better if you market your book for what it is. &lt;/p&gt;\n\n&lt;p&gt;So yeah. Make your character genuinely earn their happy ending. Don&amp;#39;t go for the white wedding every time. And don&amp;#39;t sell me a romance and deliver a tragedy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8xehm", "score_hidden": false, "stickied": false, "created": 1492187196.0, "created_utc": 1492158396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg859bs", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg80ln8", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Woo! I think a lot of us kind of know instinctively what a story should *feel* like, and it can get frustrating if it's not working out. But then when you stumble upon one that works, suddenly light bulbs go off all over the place. \n\nI recently, while having a movie marathon, realized that my \"adhesion plot thrust\" wasn't doing its job because I wasn't giving the characters a choice in the matter. I was just engineering the plot in a way that they were forced to be together. But in most instances, this portion of the arc has a much bigger impact if they have the chance to turn away, but choose not to. My light bulb moment came during the new Beauty and the Beast. When the Beast saves Belle from the wolves and is bleeding in the snow, she has her horse, she can make a break for it, but he saved her, and that shows her that maybe there's something deep down in him worth saving too. So she stays. She nurses him back to health. But she *chose* to. Not because he held her prisoner, because he showed her a kindness she wanted to repay. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woo! I think a lot of us kind of know instinctively what a story should &lt;em&gt;feel&lt;/em&gt; like, and it can get frustrating if it&amp;#39;s not working out. But then when you stumble upon one that works, suddenly light bulbs go off all over the place. &lt;/p&gt;\n\n&lt;p&gt;I recently, while having a movie marathon, realized that my &amp;quot;adhesion plot thrust&amp;quot; wasn&amp;#39;t doing its job because I wasn&amp;#39;t giving the characters a choice in the matter. I was just engineering the plot in a way that they were forced to be together. But in most instances, this portion of the arc has a much bigger impact if they have the chance to turn away, but choose not to. My light bulb moment came during the new Beauty and the Beast. When the Beast saves Belle from the wolves and is bleeding in the snow, she has her horse, she can make a break for it, but he saved her, and that shows her that maybe there&amp;#39;s something deep down in him worth saving too. So she stays. She nurses him back to health. But she &lt;em&gt;chose&lt;/em&gt; to. Not because he held her prisoner, because he showed her a kindness she wanted to repay. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg859bs", "score_hidden": false, "stickied": false, "created": 1492143085.0, "created_utc": 1492114285.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80ln8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "too_many_mojitos", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "For the past few years I kept trying to write romance and then I deleted the entire thing and felt like banging my head against the keyboard. Finally this year I tried my hand at a romance novel again and have been feeling fairly proud of myself so far. Seeing that I was adhering to  the 4 step formula without knowing it feels pretty great. So thank you for this! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For the past few years I kept trying to write romance and then I deleted the entire thing and felt like banging my head against the keyboard. Finally this year I tried my hand at a romance novel again and have been feeling fairly proud of myself so far. Seeing that I was adhering to  the 4 step formula without knowing it feels pretty great. So thank you for this! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg80ln8", "score_hidden": false, "stickied": false, "created": 1492138017.0, "created_utc": 1492109217.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg9trh0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RuroniHS", "parent_id": "t1_dg9rvpz", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; Especially not if you're looking for commercial success in the genre.\n\nI think this summarizes our core divergence of opinion. I don't give a quarter of a damn about commercial success. All I care about is good writing, and the two are not in any way correlated. Personally, I think most romance that's out there, in movies, shows, books, plays, poetry, everything really, is deeply flawed for the reasons I've stated. I don't think \"it sells\" renders it immune to literary criticism. \n\nI also think you're imposing your own formula onto the examples rather than drawing forth natural \"no ways.\" The actual subtleties of the characters imply a subconscious \"hell yeah,\" not a \"no way.\" Maybe Richard doesn't think he's going to fall for a prostitute, but he still treats her with respect and stands up for her *before* they start falling in love. And Julia defends Richard to her friend despite warnings of not getting emotionally invested. These are *not* \"no ways,\" and I think you're warping the character motivation, plot dynamics, and themes to make it fit this formula. \n\nI also think you're badly misunderstanding *Romeo and Juliet.* The central conflict of the story is \"They stumble that run fast.\" Those two kids are head-over-heals for each other. The conflict doesn't arise from them questioning their feelings, but from *not* questioning your feelings. The play doesn't want the reader to wonder if they will come to love each other, it wants the reader to see how petty grudges can destroy something beautiful, and how hasty decisions can lead to your undoing. \n\nAs for my favorite couple, Tomoya and Nagisa... the color palette literally shifts from grayish hues to pastels and it was pretty much implied that they would be together within the first 5 minutes of the show. \n\nWith that said, I think you can render all of my criticism moot by deleting two words in your OP: \"convincing\" and \"believable.\" You said in your responses to other posters that what you write is \"fantasy wish-fulfillment\" romance, not realistic romance. And that's fine. You find my realistic romance dull and uneventful, I find your wish-fulfillment romance trite and predictable. \n\nIn light of all of this, I mean no disrespect. I just enjoy having intelligent literary debates.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Especially not if you&amp;#39;re looking for commercial success in the genre.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think this summarizes our core divergence of opinion. I don&amp;#39;t give a quarter of a damn about commercial success. All I care about is good writing, and the two are not in any way correlated. Personally, I think most romance that&amp;#39;s out there, in movies, shows, books, plays, poetry, everything really, is deeply flawed for the reasons I&amp;#39;ve stated. I don&amp;#39;t think &amp;quot;it sells&amp;quot; renders it immune to literary criticism. &lt;/p&gt;\n\n&lt;p&gt;I also think you&amp;#39;re imposing your own formula onto the examples rather than drawing forth natural &amp;quot;no ways.&amp;quot; The actual subtleties of the characters imply a subconscious &amp;quot;hell yeah,&amp;quot; not a &amp;quot;no way.&amp;quot; Maybe Richard doesn&amp;#39;t think he&amp;#39;s going to fall for a prostitute, but he still treats her with respect and stands up for her &lt;em&gt;before&lt;/em&gt; they start falling in love. And Julia defends Richard to her friend despite warnings of not getting emotionally invested. These are &lt;em&gt;not&lt;/em&gt; &amp;quot;no ways,&amp;quot; and I think you&amp;#39;re warping the character motivation, plot dynamics, and themes to make it fit this formula. &lt;/p&gt;\n\n&lt;p&gt;I also think you&amp;#39;re badly misunderstanding &lt;em&gt;Romeo and Juliet.&lt;/em&gt; The central conflict of the story is &amp;quot;They stumble that run fast.&amp;quot; Those two kids are head-over-heals for each other. The conflict doesn&amp;#39;t arise from them questioning their feelings, but from &lt;em&gt;not&lt;/em&gt; questioning your feelings. The play doesn&amp;#39;t want the reader to wonder if they will come to love each other, it wants the reader to see how petty grudges can destroy something beautiful, and how hasty decisions can lead to your undoing. &lt;/p&gt;\n\n&lt;p&gt;As for my favorite couple, Tomoya and Nagisa... the color palette literally shifts from grayish hues to pastels and it was pretty much implied that they would be together within the first 5 minutes of the show. &lt;/p&gt;\n\n&lt;p&gt;With that said, I think you can render all of my criticism moot by deleting two words in your OP: &amp;quot;convincing&amp;quot; and &amp;quot;believable.&amp;quot; You said in your responses to other posters that what you write is &amp;quot;fantasy wish-fulfillment&amp;quot; romance, not realistic romance. And that&amp;#39;s fine. You find my realistic romance dull and uneventful, I find your wish-fulfillment romance trite and predictable. &lt;/p&gt;\n\n&lt;p&gt;In light of all of this, I mean no disrespect. I just enjoy having intelligent literary debates.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9trh0", "score_hidden": false, "stickied": false, "created": 1492236141.0, "created_utc": 1492207341.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9rvpz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg9pooc", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Sure. None of what I said are hard and fast rules, but if you want to try your hand at romance for the first time, what I've said helps put in inherent conflict and tension. \n\nI disagree with a lot of what you say, but you're entitled to that opinion. Not everyone is looking for the same thing in romance and I think the examples you've used show that you're not in the same place as most readers of romance today. They're not reading Pride and Prejudice and no one's publishing those, either. \n\nMaybe it would be better to say on a *superficial* level, their personalities clash and goals are opposing. I agree when you say\n\n&gt;However, at the fundamental level, they should have more in common than uncommon.\n\nYes, but that's the point of the romance arc. To make them *realize* that despite their apparent differences, deep down they want the same thing. \n\n&gt;Clashing goals is also a bad idea. The characters should have overlapping or compatible goals.\n\nI disagree with this too. If they have compatible or overlapping goals, there's nothing to stop them from working together. There's nothing keeping them apart. And that tension is what makes romances work, in my opinion. The point of a character growing and learning is that they realize what they *thought* were their goals, were not great goals. They were not fulfilling goals that would lead to a lifetime of happiness. Characters should change their goals by the end of the book to realize that \"whole-heartedness.\" If they have reasonable or complementary goals in the beginning, there's nowhere for that arc to go and it falls flat. \n\n&gt;First, no, it's not vital. Romeo and Juliet, Pretty Woman, Dune, Dragon Lance, and even Twilight disregard the \"outright denial of affection\" trope, as I like to call it. They all have either a romantic plot or subplot that begins with, \"hey, I might actually like this person.\" \n\nActually, I think you're disregarding some of the internal no ways. Romeo and Juliet, despite all their attraction, definitely have conflicted feelings about whether they can really like this person. They're supposed to be sworn enemies. In Pretty Woman, you think Richard Gere really thinks he's the type of guy who's going to fall for a hooker? No way. Does Julia really want to try to woo this guy? No, she just wants her payday and to get out of there. It's about the money for her, not at all about him until they start moving into the second part of the arc. In Twilight, Edward knows he should not be interested at all in this weird human and tries to fight it as much as he can. Those are all no ways. I'm not familiar enough with the other examples to refute them, but I think that the element is still probably present, even if it's not in the form you expect it to be. There has to be *resistence* to the idea of love, or you just have people wandering around like love sick puppy dogs without anything interesting happening. \n\nI've not read *Pride and Prejudice*, but I think we can agree that most romance writers aren't, cannot be, and many probably don't want to be Austen. I'm sure it's a wonderful story and there is a whole sub-genre of basically Austen fanfics with these characters, so certainly something in it resonated with people, but just because it deviated from the formula doesn't mean it should be held up as an example of what all romances should be. It's a very specific kind of romance, written for a specific audience in a specific time period. So is the kind of romance I'm talking about, but it's for a different audience, in a different time period. A lot changes when centuries pass and popular culture influences what people want and expect in their media. This formula has been used by romance writers and movies for as long as I've been alive and clearly works for the audience its targeting. Whether or not you're that audience, I can't say, but I don't think it's wise to discount the tried-and-true for a few outlying examples. Especially not if you're looking for commercial success in the genre. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sure. None of what I said are hard and fast rules, but if you want to try your hand at romance for the first time, what I&amp;#39;ve said helps put in inherent conflict and tension. &lt;/p&gt;\n\n&lt;p&gt;I disagree with a lot of what you say, but you&amp;#39;re entitled to that opinion. Not everyone is looking for the same thing in romance and I think the examples you&amp;#39;ve used show that you&amp;#39;re not in the same place as most readers of romance today. They&amp;#39;re not reading Pride and Prejudice and no one&amp;#39;s publishing those, either. &lt;/p&gt;\n\n&lt;p&gt;Maybe it would be better to say on a &lt;em&gt;superficial&lt;/em&gt; level, their personalities clash and goals are opposing. I agree when you say&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;However, at the fundamental level, they should have more in common than uncommon.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, but that&amp;#39;s the point of the romance arc. To make them &lt;em&gt;realize&lt;/em&gt; that despite their apparent differences, deep down they want the same thing. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Clashing goals is also a bad idea. The characters should have overlapping or compatible goals.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree with this too. If they have compatible or overlapping goals, there&amp;#39;s nothing to stop them from working together. There&amp;#39;s nothing keeping them apart. And that tension is what makes romances work, in my opinion. The point of a character growing and learning is that they realize what they &lt;em&gt;thought&lt;/em&gt; were their goals, were not great goals. They were not fulfilling goals that would lead to a lifetime of happiness. Characters should change their goals by the end of the book to realize that &amp;quot;whole-heartedness.&amp;quot; If they have reasonable or complementary goals in the beginning, there&amp;#39;s nowhere for that arc to go and it falls flat. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;First, no, it&amp;#39;s not vital. Romeo and Juliet, Pretty Woman, Dune, Dragon Lance, and even Twilight disregard the &amp;quot;outright denial of affection&amp;quot; trope, as I like to call it. They all have either a romantic plot or subplot that begins with, &amp;quot;hey, I might actually like this person.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually, I think you&amp;#39;re disregarding some of the internal no ways. Romeo and Juliet, despite all their attraction, definitely have conflicted feelings about whether they can really like this person. They&amp;#39;re supposed to be sworn enemies. In Pretty Woman, you think Richard Gere really thinks he&amp;#39;s the type of guy who&amp;#39;s going to fall for a hooker? No way. Does Julia really want to try to woo this guy? No, she just wants her payday and to get out of there. It&amp;#39;s about the money for her, not at all about him until they start moving into the second part of the arc. In Twilight, Edward knows he should not be interested at all in this weird human and tries to fight it as much as he can. Those are all no ways. I&amp;#39;m not familiar enough with the other examples to refute them, but I think that the element is still probably present, even if it&amp;#39;s not in the form you expect it to be. There has to be &lt;em&gt;resistence&lt;/em&gt; to the idea of love, or you just have people wandering around like love sick puppy dogs without anything interesting happening. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve not read &lt;em&gt;Pride and Prejudice&lt;/em&gt;, but I think we can agree that most romance writers aren&amp;#39;t, cannot be, and many probably don&amp;#39;t want to be Austen. I&amp;#39;m sure it&amp;#39;s a wonderful story and there is a whole sub-genre of basically Austen fanfics with these characters, so certainly something in it resonated with people, but just because it deviated from the formula doesn&amp;#39;t mean it should be held up as an example of what all romances should be. It&amp;#39;s a very specific kind of romance, written for a specific audience in a specific time period. So is the kind of romance I&amp;#39;m talking about, but it&amp;#39;s for a different audience, in a different time period. A lot changes when centuries pass and popular culture influences what people want and expect in their media. This formula has been used by romance writers and movies for as long as I&amp;#39;ve been alive and clearly works for the audience its targeting. Whether or not you&amp;#39;re that audience, I can&amp;#39;t say, but I don&amp;#39;t think it&amp;#39;s wise to discount the tried-and-true for a few outlying examples. Especially not if you&amp;#39;re looking for commercial success in the genre. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9rvpz", "score_hidden": false, "stickied": false, "created": 1492233722.0, "created_utc": 1492204922.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9pooc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RuroniHS", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I have issues with quite a few aspects of this. This is pretty much everything I *don't* want to see in a romance, either as a primary narrative, or a sub-plot. Let's dissect this. I'll be referencing one of the most iconic romantic couples in literature to help us along: Liz and Darcy from *Pride and Prejudice.*\n\n&gt;First, they need to have opposing goals and clashing personalities.\n\nNo. Never this. Never ever, ever this. Well, unless you're satirizing bad romance stories. Then do this. But, this is the most unrealistic thing you could possibly do in your romance. I know a lot of romance writers do it, and I think it's completely ridiculous. There's a reason every dating site uses \"compatibility\" algorithms instead of \"clashing\" algorithms. It's because people who like each other are compatible, and they don't clash. \n\nYour characters should have **complimentary** personalities. This doesn't mean they can't have disagreements or divergences of opinion; in fact, those things make the character dynamics more interesting. However, *at the fundamental level,* they should have more in common than uncommon. Clashing goals is also a bad idea. The characters should have overlapping or compatible goals. If two characters want the opposite thing, then they are more likely to destroy each other than fall in love. In short, a firefighter will not want to kiss an arsonist; a firefighter will want to see the arsonist behind bars. \n\nLiz and Darcy have neither opposing goals *nor* opposing personalities. Both of them are are respectable adults with a keen wit and cynical sense of humor. They both have a pragmatic set of values entailing what is best for their families and future. They are both well-read, and fall a tad on the unconventional side in terms of societal norms. They have many differences, but none in direct opposition to one another. Thus their relationship has a complex, yet believable, formula at its base.\n\n&gt; It's also the first time one or both of your characters will grind their heels into the dirt and say \"nu uh, no way, that is not the person for me.\" This part is vital.\n\nFirst, no, it's not vital. *Romeo and Juliet, Pretty Woman, Dune, Dragon Lance,* and even *Twilight* disregard the \"outright denial of affection\" trope, as I like to call it. They all have either a romantic plot or subplot that begins with, \"hey, I might actually like this person.\" \n\nNow, it's *possible* to pull of the Outright Denial of Affection, but it has to be done tactfully, or it will come across as absurd if the characters finally decide to hook up. Mild annoyance, initial avoidance, or even a subtle slight can serve to make the characters start off with a \"no way.\" For example, when Darcy left Liz unaccompanied at the first ball, it left a bad impression. *However,* this initial dislike can **not** be the result of a fundamental incompatibility between characters. Darcy did not single out Liz and go, \"Pff, no way, I'm not dancing with that chick.\" He was just shy. He wasn't dancing with *any* girls. So, this is an easily resolvable misunderstanding that served as a source of conversation for the characters to get to know one another better.\n\n&gt;By the end of this section, your plot thrust should have them stuck together like glue.\n\nNothing inherently wrong with this, but I would like to point out that *Pride and Prejudice* defies this as well. Liz has NO obligations to see Darcy again. In fact, nobody expects her to interact with Darcy. She is presented with other suitors, and is gradually distanced from Darcy over the course of the novel. However, for one reason or another, she keeps coming back to him. And this, in my opinion, is SO much more effective than forcing people together because when people actually like each other, they will go out of their way to be together. Staying connected in spite of circumstance is what makes a relationship truly memorable. \n\nNext, I would like to note that *Pride and Prejudice* inverts your falling out of love, and falling in love sections. Throughout the story, it is shown that Liz and Darcy have quite an amusing chemistry with each other, but they are prevented from fully falling in love by their titular flaws. Also, making up happens *before* Liz finally falls in love with Darcy. Darcy's show of humility in the final act and Liz coming to fully understand Darcy's motives and personality is the bridge that allows her to fall in love with him. \n\nSo, while I think there are some workable things in this formula, I think there are a few problems with it that need to be mitigated in order to make a convincing and believable romance. I also find that this formula is used so much, that it's become way too predictable. Even if you manage to write a believable romance, you need a LOT more substance to make it interesting. \n\nAnd, for the record, my all-time favorite couple is Tomoya and Nagisa from the anime *Clannad.* Needless to say, they throw this formula right out the window. *Clannad* holds the distinction of being the only work of fiction to make me cry. It must be doing something right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have issues with quite a few aspects of this. This is pretty much everything I &lt;em&gt;don&amp;#39;t&lt;/em&gt; want to see in a romance, either as a primary narrative, or a sub-plot. Let&amp;#39;s dissect this. I&amp;#39;ll be referencing one of the most iconic romantic couples in literature to help us along: Liz and Darcy from &lt;em&gt;Pride and Prejudice.&lt;/em&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;First, they need to have opposing goals and clashing personalities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No. Never this. Never ever, ever this. Well, unless you&amp;#39;re satirizing bad romance stories. Then do this. But, this is the most unrealistic thing you could possibly do in your romance. I know a lot of romance writers do it, and I think it&amp;#39;s completely ridiculous. There&amp;#39;s a reason every dating site uses &amp;quot;compatibility&amp;quot; algorithms instead of &amp;quot;clashing&amp;quot; algorithms. It&amp;#39;s because people who like each other are compatible, and they don&amp;#39;t clash. &lt;/p&gt;\n\n&lt;p&gt;Your characters should have &lt;strong&gt;complimentary&lt;/strong&gt; personalities. This doesn&amp;#39;t mean they can&amp;#39;t have disagreements or divergences of opinion; in fact, those things make the character dynamics more interesting. However, &lt;em&gt;at the fundamental level,&lt;/em&gt; they should have more in common than uncommon. Clashing goals is also a bad idea. The characters should have overlapping or compatible goals. If two characters want the opposite thing, then they are more likely to destroy each other than fall in love. In short, a firefighter will not want to kiss an arsonist; a firefighter will want to see the arsonist behind bars. &lt;/p&gt;\n\n&lt;p&gt;Liz and Darcy have neither opposing goals &lt;em&gt;nor&lt;/em&gt; opposing personalities. Both of them are are respectable adults with a keen wit and cynical sense of humor. They both have a pragmatic set of values entailing what is best for their families and future. They are both well-read, and fall a tad on the unconventional side in terms of societal norms. They have many differences, but none in direct opposition to one another. Thus their relationship has a complex, yet believable, formula at its base.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s also the first time one or both of your characters will grind their heels into the dirt and say &amp;quot;nu uh, no way, that is not the person for me.&amp;quot; This part is vital.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;First, no, it&amp;#39;s not vital. &lt;em&gt;Romeo and Juliet, Pretty Woman, Dune, Dragon Lance,&lt;/em&gt; and even &lt;em&gt;Twilight&lt;/em&gt; disregard the &amp;quot;outright denial of affection&amp;quot; trope, as I like to call it. They all have either a romantic plot or subplot that begins with, &amp;quot;hey, I might actually like this person.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Now, it&amp;#39;s &lt;em&gt;possible&lt;/em&gt; to pull of the Outright Denial of Affection, but it has to be done tactfully, or it will come across as absurd if the characters finally decide to hook up. Mild annoyance, initial avoidance, or even a subtle slight can serve to make the characters start off with a &amp;quot;no way.&amp;quot; For example, when Darcy left Liz unaccompanied at the first ball, it left a bad impression. &lt;em&gt;However,&lt;/em&gt; this initial dislike can &lt;strong&gt;not&lt;/strong&gt; be the result of a fundamental incompatibility between characters. Darcy did not single out Liz and go, &amp;quot;Pff, no way, I&amp;#39;m not dancing with that chick.&amp;quot; He was just shy. He wasn&amp;#39;t dancing with &lt;em&gt;any&lt;/em&gt; girls. So, this is an easily resolvable misunderstanding that served as a source of conversation for the characters to get to know one another better.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;By the end of this section, your plot thrust should have them stuck together like glue.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nothing inherently wrong with this, but I would like to point out that &lt;em&gt;Pride and Prejudice&lt;/em&gt; defies this as well. Liz has NO obligations to see Darcy again. In fact, nobody expects her to interact with Darcy. She is presented with other suitors, and is gradually distanced from Darcy over the course of the novel. However, for one reason or another, she keeps coming back to him. And this, in my opinion, is SO much more effective than forcing people together because when people actually like each other, they will go out of their way to be together. Staying connected in spite of circumstance is what makes a relationship truly memorable. &lt;/p&gt;\n\n&lt;p&gt;Next, I would like to note that &lt;em&gt;Pride and Prejudice&lt;/em&gt; inverts your falling out of love, and falling in love sections. Throughout the story, it is shown that Liz and Darcy have quite an amusing chemistry with each other, but they are prevented from fully falling in love by their titular flaws. Also, making up happens &lt;em&gt;before&lt;/em&gt; Liz finally falls in love with Darcy. Darcy&amp;#39;s show of humility in the final act and Liz coming to fully understand Darcy&amp;#39;s motives and personality is the bridge that allows her to fall in love with him. &lt;/p&gt;\n\n&lt;p&gt;So, while I think there are some workable things in this formula, I think there are a few problems with it that need to be mitigated in order to make a convincing and believable romance. I also find that this formula is used so much, that it&amp;#39;s become way too predictable. Even if you manage to write a believable romance, you need a LOT more substance to make it interesting. &lt;/p&gt;\n\n&lt;p&gt;And, for the record, my all-time favorite couple is Tomoya and Nagisa from the anime &lt;em&gt;Clannad.&lt;/em&gt; Needless to say, they throw this formula right out the window. &lt;em&gt;Clannad&lt;/em&gt; holds the distinction of being the only work of fiction to make me cry. It must be doing something right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9pooc", "score_hidden": false, "stickied": false, "created": 1492231005.0, "created_utc": 1492202205.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7n70z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7jawd", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": ":D I'll let Ging thank you properly as well. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:D I&amp;#39;ll let Ging thank you properly as well. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7n70z", "score_hidden": false, "stickied": false, "created": 1492123667.0, "created_utc": 1492094867.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7osrk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7jawd", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "My pleasure! Thanks for reading :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My pleasure! Thanks for reading :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7osrk", "score_hidden": false, "stickied": false, "created": 1492125450.0, "created_utc": 1492096650.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jawd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Abjury", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Brilliant! Thank you for posting this!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Brilliant! Thank you for posting this!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7jawd", "score_hidden": false, "stickied": false, "created": 1492118849.0, "created_utc": 1492090049.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8kmm8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LexJulia", "parent_id": "t1_dg8jbic", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Thanks! That does help put it into perspective. I'll have to look again at the circumstances around it and probably pare all the metaphors down to one or two lines of the kiss itself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks! That does help put it into perspective. I&amp;#39;ll have to look again at the circumstances around it and probably pare all the metaphors down to one or two lines of the kiss itself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8kmm8", "score_hidden": false, "stickied": false, "created": 1492162855.0, "created_utc": 1492134055.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8jbic", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8ig0l", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Oh boy. This is a tough question. It depends a lot on your voice, your character's voice, and the tone of the story overall. I think with most kisses, the best part isn't the actual kiss, it's the anticipation of a kiss. That moment when your eyes lock, you drift a little closer, you're trying to focus on the conversation but all you notice is the way their lips move and then suddenly you're kissing and the world turns upside down and it's everything you imagined. Or it's terrible and awkward because some guy on the street catcalls the moment it starts and it breaks the moment. \n\nIt's also about what that kiss *means*. Does it mean your character is choosing one person over the other? Or do they not know who they're choosing? Is this just going to make them feel guilty and conflicted the moment the kiss breaks? Or do they allow themselves time to feel a little giddy and lightheaded? Does one person think the feelings are unrequited? When they just go for it, they might suddenly be mortified and run away. They could be really into the kiss, suddenly realize what they're doing, freeze, eyes wide open, pull away apologizing and scamper off. Or they could melt into each other, envelop one another in their arms and spend the whole day lounging in the sun, talking about their dreams while periodically kissing some more... for practice, you know. \n\nThere's a lot of things to do with a kiss, especially a first kiss, and almost none of them have anything to do with the actual kissing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh boy. This is a tough question. It depends a lot on your voice, your character&amp;#39;s voice, and the tone of the story overall. I think with most kisses, the best part isn&amp;#39;t the actual kiss, it&amp;#39;s the anticipation of a kiss. That moment when your eyes lock, you drift a little closer, you&amp;#39;re trying to focus on the conversation but all you notice is the way their lips move and then suddenly you&amp;#39;re kissing and the world turns upside down and it&amp;#39;s everything you imagined. Or it&amp;#39;s terrible and awkward because some guy on the street catcalls the moment it starts and it breaks the moment. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also about what that kiss &lt;em&gt;means&lt;/em&gt;. Does it mean your character is choosing one person over the other? Or do they not know who they&amp;#39;re choosing? Is this just going to make them feel guilty and conflicted the moment the kiss breaks? Or do they allow themselves time to feel a little giddy and lightheaded? Does one person think the feelings are unrequited? When they just go for it, they might suddenly be mortified and run away. They could be really into the kiss, suddenly realize what they&amp;#39;re doing, freeze, eyes wide open, pull away apologizing and scamper off. Or they could melt into each other, envelop one another in their arms and spend the whole day lounging in the sun, talking about their dreams while periodically kissing some more... for practice, you know. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a lot of things to do with a kiss, especially a first kiss, and almost none of them have anything to do with the actual kissing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8jbic", "score_hidden": false, "stickied": false, "created": 1492161048.0, "created_utc": 1492132248.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ig0l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LexJulia", "parent_id": "t1_dg7ov7y", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Well, I do have a question. What do you think are the important aspects of a first kiss? I wrote a bunch of nonsense about exploding stars and the sweat of her palms and I kind of hate it. It's metaphorical and dumb. But if I don't have all that it boils down to \"She leaned in and kissed her.\" (I have a bisexual YA love triangle which doesn't make matters any easier.) \n\nWhat should be there, what should be cut out? \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I do have a question. What do you think are the important aspects of a first kiss? I wrote a bunch of nonsense about exploding stars and the sweat of her palms and I kind of hate it. It&amp;#39;s metaphorical and dumb. But if I don&amp;#39;t have all that it boils down to &amp;quot;She leaned in and kissed her.&amp;quot; (I have a bisexual YA love triangle which doesn&amp;#39;t make matters any easier.) &lt;/p&gt;\n\n&lt;p&gt;What should be there, what should be cut out? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8ig0l", "score_hidden": false, "stickied": false, "created": 1492159852.0, "created_utc": 1492131052.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ov7y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7jemm", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'm so glad this came at the perfect time for you! I hope it helps you re-work the scene. And if you need pointers, you know where to find me ;) There's a lot more that goes into each of these sections, but I tried to keep it brief and to the point. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so glad this came at the perfect time for you! I hope it helps you re-work the scene. And if you need pointers, you know where to find me ;) There&amp;#39;s a lot more that goes into each of these sections, but I tried to keep it brief and to the point. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7ov7y", "score_hidden": false, "stickied": false, "created": 1492125525.0, "created_utc": 1492096725.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7p0e9", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Zerifachias", "parent_id": "t1_dg7ovgb", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "(b=3=)b", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(b=3=)b&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7p0e9", "score_hidden": false, "stickied": false, "created": 1492125682.0, "created_utc": 1492096882.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ovgb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7o6vi", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": ":D ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:D &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7ovgb", "score_hidden": false, "stickied": false, "created": 1492125532.0, "created_utc": 1492096732.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7o6vi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zerifachias", "parent_id": "t1_dg7jemm", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "SAME. Who knew this shit could be so stressful? This just saved me a mountain of work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;SAME. Who knew this shit could be so stressful? This just saved me a mountain of work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7o6vi", "score_hidden": false, "stickied": false, "created": 1492124779.0, "created_utc": 1492095979.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jemm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7jemm", "score_hidden": false, "stickied": false, "created": 1492118989.0, "created_utc": 1492090189.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7qktj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pm_me_your_molars", "parent_id": "t1_dg7puh5", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "That's a great point! I remember reading in \"Save the cat\" that all buddy movies follow the exact same beats as romance films.\n\nIn previous drafts, the relationship with these two characters actually was romantic, so I guess more of it carried over than I thought! But I'm happy with it this way, because one of the protagonist's major arcs is learning to trust people and letting go of her paranoia, and perhaps a love story without the sexual interest is the best way to go about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a great point! I remember reading in &amp;quot;Save the cat&amp;quot; that all buddy movies follow the exact same beats as romance films.&lt;/p&gt;\n\n&lt;p&gt;In previous drafts, the relationship with these two characters actually was romantic, so I guess more of it carried over than I thought! But I&amp;#39;m happy with it this way, because one of the protagonist&amp;#39;s major arcs is learning to trust people and letting go of her paranoia, and perhaps a love story without the sexual interest is the best way to go about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7qktj", "score_hidden": false, "stickied": false, "created": 1492127347.0, "created_utc": 1492098547.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7puh5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7jwbe", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The romance arc is also really helpful as a friendship arc. You can look at \"buddy\" movies where the characters don't know each other at the beginning to see what I mean. (I don't know why, but the only one coming to mind at the moment is Stepbrothers, but it actually has a pretty solid romance/friendship arc between the main characters — oh! Also 21 Jump Street is great at this). Intimacy between two people doesn't have to be a romance, it can be a very close friendship or companionship. And luckily for us writers, they can all be treated in roughly the same way! \n\nDon't be trapped into thinking that having a male and a female in an (emotionally) intimate relationship means it has to be a romance, but do be prepared for some people thinking it should have been ;) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The romance arc is also really helpful as a friendship arc. You can look at &amp;quot;buddy&amp;quot; movies where the characters don&amp;#39;t know each other at the beginning to see what I mean. (I don&amp;#39;t know why, but the only one coming to mind at the moment is Stepbrothers, but it actually has a pretty solid romance/friendship arc between the main characters — oh! Also 21 Jump Street is great at this). Intimacy between two people doesn&amp;#39;t have to be a romance, it can be a very close friendship or companionship. And luckily for us writers, they can all be treated in roughly the same way! &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be trapped into thinking that having a male and a female in an (emotionally) intimate relationship means it has to be a romance, but do be prepared for some people thinking it should have been ;) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7puh5", "score_hidden": false, "stickied": false, "created": 1492126572.0, "created_utc": 1492097772.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7si2x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7r6c2", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Ha! I need a new intro anyways. :) \n\nThat makes sense to me. I could always tell in HP how Hermoine was supposed to initially end up with Harry. All the foreshadowing and all those cute moments in the first book always point directly to that result, and it always made me feel a bit incomplete to not see it come to fruition. :)\n\nActually that's my strong case for outlining in depth. It helps you keep the clues and the foreshadowing for one result in the outline, and then you figure out why it doesn't work and none of those lingering ideas ever hit the manuscript. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ha! I need a new intro anyways. :) &lt;/p&gt;\n\n&lt;p&gt;That makes sense to me. I could always tell in HP how Hermoine was supposed to initially end up with Harry. All the foreshadowing and all those cute moments in the first book always point directly to that result, and it always made me feel a bit incomplete to not see it come to fruition. :)&lt;/p&gt;\n\n&lt;p&gt;Actually that&amp;#39;s my strong case for outlining in depth. It helps you keep the clues and the foreshadowing for one result in the outline, and then you figure out why it doesn&amp;#39;t work and none of those lingering ideas ever hit the manuscript. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7si2x", "score_hidden": false, "stickied": false, "created": 1492129393.0, "created_utc": 1492100593.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7r6c2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pm_me_your_molars", "parent_id": "t1_dg7nkw7", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Oops, that's what I get for skimming the intro!\n\nWell, in previous drafts of this story, these characters actually were love interests. I guess more of that stuck around than I thought! But currently the story ends with everyone going their separate ways and making the selfless choice (he makes a political marriage and she decides to go to another country as a deterrent against future wars), and their connection is more about helping each other find where they best belong in the world than carving out a space where they both belong together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oops, that&amp;#39;s what I get for skimming the intro!&lt;/p&gt;\n\n&lt;p&gt;Well, in previous drafts of this story, these characters actually were love interests. I guess more of that stuck around than I thought! But currently the story ends with everyone going their separate ways and making the selfless choice (he makes a political marriage and she decides to go to another country as a deterrent against future wars), and their connection is more about helping each other find where they best belong in the world than carving out a space where they both belong together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7r6c2", "score_hidden": false, "stickied": false, "created": 1492127981.0, "created_utc": 1492099181.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7nkw7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg7jwbe", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Lol. You can thank Ging! :) She did all the hard work. I just gave her the go-ahead. :D She'll be taking on the Thursday posts (or one a week) while I do the other to mix it up. :) \n\nAs for your issue with the MC and the false antagonist, do you feel they are being drawn together? If so, maybe the false antagonist can be one of the two love interests instead? Of course, it can work the way you have it! Just a thought. I get vicious in edits (at the concept level) and have a tendency to erase whole characters off the page if I feel their purpose isn't strong enough, combining them with another role that makes them stronger. :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol. You can thank Ging! :) She did all the hard work. I just gave her the go-ahead. :D She&amp;#39;ll be taking on the Thursday posts (or one a week) while I do the other to mix it up. :) &lt;/p&gt;\n\n&lt;p&gt;As for your issue with the MC and the false antagonist, do you feel they are being drawn together? If so, maybe the false antagonist can be one of the two love interests instead? Of course, it can work the way you have it! Just a thought. I get vicious in edits (at the concept level) and have a tendency to erase whole characters off the page if I feel their purpose isn&amp;#39;t strong enough, combining them with another role that makes them stronger. :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7nkw7", "score_hidden": false, "stickied": false, "created": 1492124108.0, "created_utc": 1492095308.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jwbe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pm_me_your_molars", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Thanks for writing this up, Brian! It's really funny for me to read over this and realize that the relationship which most follows this pattern in my current book is NOT between my protagonist and the dude she's desperately in love with, nor the one between my protagonist and the dude she hooks up with in order to forget the guy she's in love with, but between the protagonist and the false antagonist. It's basically this, beat for beat, except without sexual chemistry. They start out as polar opposites with incompatible goals (she's a traveling performer with fire powers who wants to search a military camp for clues to her mother, he's a politician who hates people with fire powers and doesn't want her within fifty miles of the camp) Then they start to acknowledge maybe the other person's not as bad as they thought and work together (he realizes that her fire powers aren't necessarily destructive and can be used positively, she realizes that he's the only person who shares her feelings on the military conflict, and at the midpoint they become each other's point of dependency.) But then she realizes he can never overcome his prejudices in order to help her accomplish what she needs, and he's in denial about the seriousness of the situation, and she goes out to resolve the situation on her own, without him, and she does, but at the cost of losing herself in an alternate dimension. And then he puts aside his pride and ambition to bring her back.\n\nSo I guess it really is a love story. Just without sexual tension. At least, without them ever acknowledging sexual tension.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for writing this up, Brian! It&amp;#39;s really funny for me to read over this and realize that the relationship which most follows this pattern in my current book is NOT between my protagonist and the dude she&amp;#39;s desperately in love with, nor the one between my protagonist and the dude she hooks up with in order to forget the guy she&amp;#39;s in love with, but between the protagonist and the false antagonist. It&amp;#39;s basically this, beat for beat, except without sexual chemistry. They start out as polar opposites with incompatible goals (she&amp;#39;s a traveling performer with fire powers who wants to search a military camp for clues to her mother, he&amp;#39;s a politician who hates people with fire powers and doesn&amp;#39;t want her within fifty miles of the camp) Then they start to acknowledge maybe the other person&amp;#39;s not as bad as they thought and work together (he realizes that her fire powers aren&amp;#39;t necessarily destructive and can be used positively, she realizes that he&amp;#39;s the only person who shares her feelings on the military conflict, and at the midpoint they become each other&amp;#39;s point of dependency.) But then she realizes he can never overcome his prejudices in order to help her accomplish what she needs, and he&amp;#39;s in denial about the seriousness of the situation, and she goes out to resolve the situation on her own, without him, and she does, but at the cost of losing herself in an alternate dimension. And then he puts aside his pride and ambition to bring her back.&lt;/p&gt;\n\n&lt;p&gt;So I guess it really is a love story. Just without sexual tension. At least, without them ever acknowledging sexual tension.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7jwbe", "score_hidden": false, "stickied": false, "created": 1492119644.0, "created_utc": 1492090844.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7q332", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7jwlq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "In the case of them already knowing each other, this is \"getting to know each other in a different way.\" Maybe he's her brothers best friend, but he's always seen her as that annoying kid that tagged along and she's always seen him as the bully that made her teen years hell. When everyone's home for the holidays and he sees her again, she's not that little girl anymore and even if he's still arrogant and infuriating, she can't help but remember that tiny little crush she had as a girl and now that he's interested, she wants to string him along and make him pay for mistreating her as a kid. I'm sure you can see where this is going... \n\nThe point is, they know each other, but for the purpose of this they don't *know* each other. It's probably on a superficial level until something comes along and thrusts them together and makes them look at the other in a different light. That's how you get them to romance. \n\nThis is **huge** in second chance romance where one or both of them have already screwed it up once, so that might be a good place to start :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the case of them already knowing each other, this is &amp;quot;getting to know each other in a different way.&amp;quot; Maybe he&amp;#39;s her brothers best friend, but he&amp;#39;s always seen her as that annoying kid that tagged along and she&amp;#39;s always seen him as the bully that made her teen years hell. When everyone&amp;#39;s home for the holidays and he sees her again, she&amp;#39;s not that little girl anymore and even if he&amp;#39;s still arrogant and infuriating, she can&amp;#39;t help but remember that tiny little crush she had as a girl and now that he&amp;#39;s interested, she wants to string him along and make him pay for mistreating her as a kid. I&amp;#39;m sure you can see where this is going... &lt;/p&gt;\n\n&lt;p&gt;The point is, they know each other, but for the purpose of this they don&amp;#39;t &lt;em&gt;know&lt;/em&gt; each other. It&amp;#39;s probably on a superficial level until something comes along and thrusts them together and makes them look at the other in a different light. That&amp;#39;s how you get them to romance. &lt;/p&gt;\n\n&lt;p&gt;This is &lt;strong&gt;huge&lt;/strong&gt; in second chance romance where one or both of them have already screwed it up once, so that might be a good place to start :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7q332", "score_hidden": false, "stickied": false, "created": 1492126824.0, "created_utc": 1492098024.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jwlq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7jwlq", "score_hidden": false, "stickied": false, "created": 1492119655.0, "created_utc": 1492090855.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg84qtc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7zdis", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "She's pretty hilarious. I'm a big fan of all the song choices :P ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s pretty hilarious. I&amp;#39;m a big fan of all the song choices :P &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg84qtc", "score_hidden": false, "stickied": false, "created": 1492142512.0, "created_utc": 1492113712.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7zdis", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OfficerGenious", "parent_id": "t1_dg7q6nq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'll be buying this. I'm all ready amused by the summary. Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be buying this. I&amp;#39;m all ready amused by the summary. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7zdis", "score_hidden": false, "stickied": false, "created": 1492136703.0, "created_utc": 1492107903.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7q6nq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7mm71", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "[This book](https://www.amazon.com/Romancing-Beat-Structure-Romance-Kissing-ebook/dp/B01DSJSURY) is invaluable for me. If you read it, you'll notice that a lot of what I said is a summary of this, because it's just so damn on point. She goes into all the parts a bit more in-depth. That should definitely help!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.amazon.com/Romancing-Beat-Structure-Romance-Kissing-ebook/dp/B01DSJSURY\"&gt;This book&lt;/a&gt; is invaluable for me. If you read it, you&amp;#39;ll notice that a lot of what I said is a summary of this, because it&amp;#39;s just so damn on point. She goes into all the parts a bit more in-depth. That should definitely help!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7q6nq", "score_hidden": false, "stickied": false, "created": 1492126929.0, "created_utc": 1492098129.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7mm71", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OfficerGenious", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I am terrible at romance and this is very helpful. Are there any other resources you'd recommend to someone trying to learn how to write romance?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am terrible at romance and this is very helpful. Are there any other resources you&amp;#39;d recommend to someone trying to learn how to write romance?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7mm71", "score_hidden": false, "stickied": false, "created": 1492122998.0, "created_utc": 1492094198.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7qddz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7nxns", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "You definitely can use this in all kinds of relationships. Friendships, work relationships, familial relationships, etc. Once you've mastered one, you've mastered them all. It's very interesting to me how writing has shaped my perception of human interaction and relationships in general. You start seeing the linear progression everywhere you go, even in real life. \n\nAnd you can certainly do the opposite. If you give them opposing views but they are 100% inflexible, then they're only going to grow to hate each other more. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You definitely can use this in all kinds of relationships. Friendships, work relationships, familial relationships, etc. Once you&amp;#39;ve mastered one, you&amp;#39;ve mastered them all. It&amp;#39;s very interesting to me how writing has shaped my perception of human interaction and relationships in general. You start seeing the linear progression everywhere you go, even in real life. &lt;/p&gt;\n\n&lt;p&gt;And you can certainly do the opposite. If you give them opposing views but they are 100% inflexible, then they&amp;#39;re only going to grow to hate each other more. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7qddz", "score_hidden": false, "stickied": false, "created": 1492127129.0, "created_utc": 1492098329.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7nxns", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "YDAQ", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It seems to me that you can scale this formula to any kind of relationship.\n\nMy current project has zero romance but I do have a motley crew who's going to learn to work together. So maybe they don't start with that sense of revulsion but they don't finish with an about-face either.\n\nYou want two people to learn to hate each other? Just do the opposite at every step! \n\nEither way, I find these formulas fascinating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems to me that you can scale this formula to any kind of relationship.&lt;/p&gt;\n\n&lt;p&gt;My current project has zero romance but I do have a motley crew who&amp;#39;s going to learn to work together. So maybe they don&amp;#39;t start with that sense of revulsion but they don&amp;#39;t finish with an about-face either.&lt;/p&gt;\n\n&lt;p&gt;You want two people to learn to hate each other? Just do the opposite at every step! &lt;/p&gt;\n\n&lt;p&gt;Either way, I find these formulas fascinating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7nxns", "score_hidden": false, "stickied": false, "created": 1492124495.0, "created_utc": 1492095695.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7uayt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7thbn", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I think the same way you write a character that's a doctor or a lawyer or a four-armed alien stripper without being those things yourself: research. Consume media with the kind of relationship you want to portray. Pay attention to what they do well and what they don't. After you watch or read something and think you know what's right and wrong, go read some reviews and see if people that love that genre agree with you. You may not realize some things are stereotypes until you read that scathing 1-star on a book you just finished. \n\nHonestly, I'm a female and I would be much more comfortable writing a bromance than a female friendship because all my friends have always been male. But I've known enough women in my life and seen how they interact to know how I'd want to portray that friendship. Get really good at studying people in real life. It's fun and educational! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the same way you write a character that&amp;#39;s a doctor or a lawyer or a four-armed alien stripper without being those things yourself: research. Consume media with the kind of relationship you want to portray. Pay attention to what they do well and what they don&amp;#39;t. After you watch or read something and think you know what&amp;#39;s right and wrong, go read some reviews and see if people that love that genre agree with you. You may not realize some things are stereotypes until you read that scathing 1-star on a book you just finished. &lt;/p&gt;\n\n&lt;p&gt;Honestly, I&amp;#39;m a female and I would be much more comfortable writing a bromance than a female friendship because all my friends have always been male. But I&amp;#39;ve known enough women in my life and seen how they interact to know how I&amp;#39;d want to portray that friendship. Get really good at studying people in real life. It&amp;#39;s fun and educational! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7uayt", "score_hidden": false, "stickied": false, "created": 1492131319.0, "created_utc": 1492102519.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7thbn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "firewoodspark", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Awesome post!\n\nNow, how do you write romance that you're not familiar with without falling into stereotypes (e.g. LGBTQ if you're straight, straight if you're LGBTQ)?\n\nAnd broadening the question: how do you write bromance if you're a female author, or, similarly, how to write about a close female friendship if you're male?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome post!&lt;/p&gt;\n\n&lt;p&gt;Now, how do you write romance that you&amp;#39;re not familiar with without falling into stereotypes (e.g. LGBTQ if you&amp;#39;re straight, straight if you&amp;#39;re LGBTQ)?&lt;/p&gt;\n\n&lt;p&gt;And broadening the question: how do you write bromance if you&amp;#39;re a female author, or, similarly, how to write about a close female friendship if you&amp;#39;re male?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7thbn", "score_hidden": false, "stickied": false, "created": 1492130446.0, "created_utc": 1492101646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7xls7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7w4v6", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "There's a **ton** of money in smutty romance. Look at Alexa Riley, Parker Grey, Madison Faye, they're rocking the genre, hit after hit, raking in the money with crazy wish fulfillment fantasy smut. \n\nI don't know a ton about gay romance. I know a few people writing it, but I don't know their income level. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a &lt;strong&gt;ton&lt;/strong&gt; of money in smutty romance. Look at Alexa Riley, Parker Grey, Madison Faye, they&amp;#39;re rocking the genre, hit after hit, raking in the money with crazy wish fulfillment fantasy smut. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know a ton about gay romance. I know a few people writing it, but I don&amp;#39;t know their income level. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7xls7", "score_hidden": false, "stickied": false, "created": 1492134824.0, "created_utc": 1492106024.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7w4v6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedheadBanshee", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Just out of sheer curiosity.... how much $$ is there in writing Smut novels?   Coincidently, a novelist friend told me that the most lucrative genre' at the moment was gay romance, specifically for men. What are your thoughts on that subject? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just out of sheer curiosity.... how much $$ is there in writing Smut novels?   Coincidently, a novelist friend told me that the most lucrative genre&amp;#39; at the moment was gay romance, specifically for men. What are your thoughts on that subject? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7w4v6", "score_hidden": false, "stickied": false, "created": 1492133260.0, "created_utc": 1492104460.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg84qa2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7zaec", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Haha, thanks! I'll keep it in mind. I'm very close to wrapping up my current WIP (omg, it's never going to end...) but maybe for the next one! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, thanks! I&amp;#39;ll keep it in mind. I&amp;#39;m very close to wrapping up my current WIP (omg, it&amp;#39;s never going to end...) but maybe for the next one! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg84qa2", "score_hidden": false, "stickied": false, "created": 1492142495.0, "created_utc": 1492113695.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7zaec", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "laminate_flooring246", "parent_id": "t1_dg7yaz5", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "That is so interesting. Thanks for answering! And if you ever need a beta reader, I'd be happy to volunteer! I have zero official qualifications other than I'm literate and I love reading romance :P ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is so interesting. Thanks for answering! And if you ever need a beta reader, I&amp;#39;d be happy to volunteer! I have zero official qualifications other than I&amp;#39;m literate and I love reading romance :P &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7zaec", "score_hidden": false, "stickied": false, "created": 1492136611.0, "created_utc": 1492107811.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yaz5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg7xg11", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I haven't had any luck with finding reliable betas, but I have a team of arc reviewers that help me out a ton. \n\nThat said, if anyone wants to beta.... ;) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t had any luck with finding reliable betas, but I have a team of arc reviewers that help me out a ton. &lt;/p&gt;\n\n&lt;p&gt;That said, if anyone wants to beta.... ;) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7yaz5", "score_hidden": false, "stickied": false, "created": 1492135564.0, "created_utc": 1492106764.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xg11", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "laminate_flooring246", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "This is awesome and so helpful! Thank you for taking the time to write all this down! \n\nRandom question: Do you have beta readers for your novels and novellas that you self-publish? Just wondering because you've published a ton of stuff in the past few years and I would imagine the publishing process would have to be kind of quick and streamlined. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is awesome and so helpful! Thank you for taking the time to write all this down! &lt;/p&gt;\n\n&lt;p&gt;Random question: Do you have beta readers for your novels and novellas that you self-publish? Just wondering because you&amp;#39;ve published a ton of stuff in the past few years and I would imagine the publishing process would have to be kind of quick and streamlined. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7xg11", "score_hidden": false, "stickied": false, "created": 1492134657.0, "created_utc": 1492105857.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg84r3c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg80e8s", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'll PM you :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll PM you :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg84r3c", "score_hidden": false, "stickied": false, "created": 1492142521.0, "created_utc": 1492113721.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80e8s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "antoniofelicemunro", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Can I ask what your name is so I can see what books you've written, or are you not comfortable with reddit knowing that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can I ask what your name is so I can see what books you&amp;#39;ve written, or are you not comfortable with reddit knowing that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg80e8s", "score_hidden": false, "stickied": false, "created": 1492137794.0, "created_utc": 1492108994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg85aks", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg839ul", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'm glad it was helpful!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad it was helpful!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg85aks", "score_hidden": false, "stickied": false, "created": 1492143124.0, "created_utc": 1492114324.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg839ul", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "P-22-", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Thanks for the advice, it was very helpful, since I find it rather difficult to create romantic subplots :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the advice, it was very helpful, since I find it rather difficult to create romantic subplots :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg839ul", "score_hidden": false, "stickied": false, "created": 1492140916.0, "created_utc": 1492112116.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8686y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg862sd", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": ":D ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:D &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8686y", "score_hidden": false, "stickied": false, "created": 1492144151.0, "created_utc": 1492115351.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg862sd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "superclaude1", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Bookmarking this :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bookmarking this :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg862sd", "score_hidden": false, "stickied": false, "created": 1492143981.0, "created_utc": 1492115181.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8gyoh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8a7ee", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Well, first I'd ask if they *need* a romance arc. Is their relationship going through some stuff? You might be able to skip/rush through the first two parts if they're sufficiently in love already and go straight to the bad stuff, but I think you need to probably still show enough \"on screen\" for the readers to have the contrast of what things were like before vs. what they're like when things go bad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, first I&amp;#39;d ask if they &lt;em&gt;need&lt;/em&gt; a romance arc. Is their relationship going through some stuff? You might be able to skip/rush through the first two parts if they&amp;#39;re sufficiently in love already and go straight to the bad stuff, but I think you need to probably still show enough &amp;quot;on screen&amp;quot; for the readers to have the contrast of what things were like before vs. what they&amp;#39;re like when things go bad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8gyoh", "score_hidden": false, "stickied": false, "created": 1492157823.0, "created_utc": 1492129023.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8a7ee", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Kingman9K", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "This is good advice for a romance subplot, but how would you go about handling romance for a pair (or more) that have been together since before the beginning of the story?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is good advice for a romance subplot, but how would you go about handling romance for a pair (or more) that have been together since before the beginning of the story?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8a7ee", "score_hidden": false, "stickied": false, "created": 1492148859.0, "created_utc": 1492120059.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8jtt2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KeeperofAmmut7", "parent_id": "t1_dg8gyzs", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Me too :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Me too :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8jtt2", "score_hidden": false, "stickied": false, "created": 1492161758.0, "created_utc": 1492132958.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8gyzs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8cl0f", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Awesome! Hope this helps :D ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome! Hope this helps :D &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8gyzs", "score_hidden": false, "stickied": false, "created": 1492157835.0, "created_utc": 1492129035.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8cl0f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KeeperofAmmut7", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Thanks for the post. I have a romance, a romance adventure, and another romance started.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the post. I have a romance, a romance adventure, and another romance started.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8cl0f", "score_hidden": false, "stickied": false, "created": 1492151940.0, "created_utc": 1492123140.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8gzjp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8e9zy", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Didn't miss it. I didn't say :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Didn&amp;#39;t miss it. I didn&amp;#39;t say :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8gzjp", "score_hidden": false, "stickied": false, "created": 1492157857.0, "created_utc": 1492129057.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8e9zy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "closedsystem23", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I might have missed it but i didn't catch your name.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I might have missed it but i didn&amp;#39;t catch your name.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8e9zy", "score_hidden": false, "stickied": false, "created": 1492154196.0, "created_utc": 1492125396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg9g6bj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8o7tu", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I think that kind of story can work. But if they're main characters and you want people invested in their relationship, you at least have to establish on page why they work together. What their strengths are, and what they've overcome as a couple to stay together. You may not have to show all of that at once or in fully fleshed-out scenes, but you need to touch on it long enough for readers to care about this couple. \n\nIs there a possibility that it's a secret relationship in the beginning? Or that the interactions with Character C could maybe be with Character D instead of Character B? Or maybe A and B don't have a great opinion of each other in the beginning until something happens, driving them together later, off-screen. It seems to me that you'd have to skip a lot of time with these characters and if they're the main characters in your book, that could feel strange unless there's another plot thread happening to distract people. \n\nUltimately, it's your book, so you just have to do what feels right and if it winds up feeling off, you know where to start looking :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that kind of story can work. But if they&amp;#39;re main characters and you want people invested in their relationship, you at least have to establish on page why they work together. What their strengths are, and what they&amp;#39;ve overcome as a couple to stay together. You may not have to show all of that at once or in fully fleshed-out scenes, but you need to touch on it long enough for readers to care about this couple. &lt;/p&gt;\n\n&lt;p&gt;Is there a possibility that it&amp;#39;s a secret relationship in the beginning? Or that the interactions with Character C could maybe be with Character D instead of Character B? Or maybe A and B don&amp;#39;t have a great opinion of each other in the beginning until something happens, driving them together later, off-screen. It seems to me that you&amp;#39;d have to skip a lot of time with these characters and if they&amp;#39;re the main characters in your book, that could feel strange unless there&amp;#39;s another plot thread happening to distract people. &lt;/p&gt;\n\n&lt;p&gt;Ultimately, it&amp;#39;s your book, so you just have to do what feels right and if it winds up feeling off, you know where to start looking :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9g6bj", "score_hidden": false, "stickied": false, "created": 1492219650.0, "created_utc": 1492190850.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8o7tu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nerdcomplex42", "parent_id": "t1_dg8ibi7", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; Like, months passed and they met every Tuesday for coffee, to talk about work and life. Until one day... (then a short scene about revealing feelings or something).\n\nYeah, that was more or less what I was planning on doing. I was just curious if there was any way to do this that's better/more interesting/follows some sort of common structure.\n\n&gt; Is their falling in love story inconsequential? It might not be important to include at all. Or they could be joking with friends about the \"meet cute\" incident at an engagement party. \n\nIt is relatively unimportant. Basically, if characters A and B are in a relationship before ~1/3 of the way through the story, then it makes their interactions with a certain character C much more interesting. How they fell in love doesn't matter too much, so I wish I could start off with them in a relationship and not even show the falling-in-love story, outside of some flashbacks (as you suggested). Unfortunately, doing so would require that I completely rewrite either the characters' backstories or the first third of the book; as I currently have it set up, A and B only have a vague awareness of each other when the story begins.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Like, months passed and they met every Tuesday for coffee, to talk about work and life. Until one day... (then a short scene about revealing feelings or something).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, that was more or less what I was planning on doing. I was just curious if there was any way to do this that&amp;#39;s better/more interesting/follows some sort of common structure.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Is their falling in love story inconsequential? It might not be important to include at all. Or they could be joking with friends about the &amp;quot;meet cute&amp;quot; incident at an engagement party. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It is relatively unimportant. Basically, if characters A and B are in a relationship before ~1/3 of the way through the story, then it makes their interactions with a certain character C much more interesting. How they fell in love doesn&amp;#39;t matter too much, so I wish I could start off with them in a relationship and not even show the falling-in-love story, outside of some flashbacks (as you suggested). Unfortunately, doing so would require that I completely rewrite either the characters&amp;#39; backstories or the first third of the book; as I currently have it set up, A and B only have a vague awareness of each other when the story begins.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8o7tu", "score_hidden": false, "stickied": false, "created": 1492167982.0, "created_utc": 1492139182.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ibi7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8hc3g", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Probably, if the focus is on other things, you can provide the romance arc in little vignettes or in narrative back story. Like, months passed and they met every Tuesday for coffee, to talk about work and life. Until one day... (then a short scene about revealing feelings or something). \n\nBut why are you more interested in writing about them as a couple? That's the important question. Is their falling in love story inconsequential? It might not be important to include at all. Or they could be joking with friends about the \"meet cute\" incident at an engagement party. There are all kinds of ways to drop in little bits of information. \n\nIf you've seen How I Met Your Mother, you'll know that for the main character, how he meets and falls in love with his various romantic interests is very important to him. That's the whole premise of the show. But for his best friends, Marshall and Lily, their romance is never questioned. As the series goes on, we get some backstory peppered in here and there, and they do face trials in their relationship, but their chemistry is so solid that the viewer never doubts how perfect they are for each other. They're the type of people that are just enjoyable to watch interact with each other because they're such a couple-y couple. Don't be afraid to step out of the box, but if it feels like it's not working for whatever reason, come back to this and see if maybe something here is what you're missing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably, if the focus is on other things, you can provide the romance arc in little vignettes or in narrative back story. Like, months passed and they met every Tuesday for coffee, to talk about work and life. Until one day... (then a short scene about revealing feelings or something). &lt;/p&gt;\n\n&lt;p&gt;But why are you more interested in writing about them as a couple? That&amp;#39;s the important question. Is their falling in love story inconsequential? It might not be important to include at all. Or they could be joking with friends about the &amp;quot;meet cute&amp;quot; incident at an engagement party. There are all kinds of ways to drop in little bits of information. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;ve seen How I Met Your Mother, you&amp;#39;ll know that for the main character, how he meets and falls in love with his various romantic interests is very important to him. That&amp;#39;s the whole premise of the show. But for his best friends, Marshall and Lily, their romance is never questioned. As the series goes on, we get some backstory peppered in here and there, and they do face trials in their relationship, but their chemistry is so solid that the viewer never doubts how perfect they are for each other. They&amp;#39;re the type of people that are just enjoyable to watch interact with each other because they&amp;#39;re such a couple-y couple. Don&amp;#39;t be afraid to step out of the box, but if it feels like it&amp;#39;s not working for whatever reason, come back to this and see if maybe something here is what you&amp;#39;re missing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8ibi7", "score_hidden": false, "stickied": false, "created": 1492159683.0, "created_utc": 1492130883.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8hc3g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nerdcomplex42", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Thank you for writing this; it all looks excellent.\n\nQuestion: I have two characters that, for backstory reasons, can't be in a relationship at the start of the story, but I'm more interested in writing about them as a couple than I am in describing the process of how they become a couple. So I don't feel like a full romance arc would work (it would be a bit bulky and out of place, for not much payoff), but I still need to get them together. Is there any particular structure or formula I ought to use for this, or is it basically just Falling in Love without all the other stuff?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for writing this; it all looks excellent.&lt;/p&gt;\n\n&lt;p&gt;Question: I have two characters that, for backstory reasons, can&amp;#39;t be in a relationship at the start of the story, but I&amp;#39;m more interested in writing about them as a couple than I am in describing the process of how they become a couple. So I don&amp;#39;t feel like a full romance arc would work (it would be a bit bulky and out of place, for not much payoff), but I still need to get them together. Is there any particular structure or formula I ought to use for this, or is it basically just Falling in Love without all the other stuff?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8hc3g", "score_hidden": false, "stickied": false, "created": 1492158342.0, "created_utc": 1492129542.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg8lxze", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheGreenBeatle", "parent_id": "t1_dg8lf08", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I've already planted the seeds for his clashing motivations while they pursue a common goal (and incidentally, she's also lying to him about something), so I'll see what I can do with those other tips. Thanks! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve already planted the seeds for his clashing motivations while they pursue a common goal (and incidentally, she&amp;#39;s also lying to him about something), so I&amp;#39;ll see what I can do with those other tips. Thanks! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8lxze", "score_hidden": false, "stickied": false, "created": 1492164702.0, "created_utc": 1492135902.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lf08", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg8jnzl", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It's not a hard and fast rule, just a good framework to keep in mind. I think especially as a subplot in another genre, you'll have enough going on with the opposing motives. You can't also work on exaggerating the ways they're most different for extra impact. Emphasize the ways they're the same when they're falling in love and the ways they're different when falling out of love. Give them scenes that highlight the opposing motives and make the reader think \"oooh, this is definitely gonna blow up in their face.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not a hard and fast rule, just a good framework to keep in mind. I think especially as a subplot in another genre, you&amp;#39;ll have enough going on with the opposing motives. You can&amp;#39;t also work on exaggerating the ways they&amp;#39;re most different for extra impact. Emphasize the ways they&amp;#39;re the same when they&amp;#39;re falling in love and the ways they&amp;#39;re different when falling out of love. Give them scenes that highlight the opposing motives and make the reader think &amp;quot;oooh, this is definitely gonna blow up in their face.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8lf08", "score_hidden": false, "stickied": false, "created": 1492163945.0, "created_utc": 1492135145.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8jnzl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheGreenBeatle", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "/u/gingasaurusrexx, I have a question if you don't mind indulging me, specifically about the firefighter-arsonist relationship.\n\nIn the novel I'm currently writing, the two main characters have *different* personalities (I don't know if I would say they clash per se), and ostensibly they have the same goal, but he has an ulterior motive that directly opposes hers (obviously the truth will come out to her in a totally relationship-damaging way). Just how much wiggle room is there in this firefighter-arsonist rule? I'm just concerned that if I'm trying to set them up for a relationship, the opposites are not polar enough and it'll fall flat.\n\nThanks in advance.\n\nEdit: Oh, I should mention this is a romance subplot occurring within the context of a sci-fi/fantasy story.", "edited": 1492133609.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/gingasaurusrexx\"&gt;/u/gingasaurusrexx&lt;/a&gt;, I have a question if you don&amp;#39;t mind indulging me, specifically about the firefighter-arsonist relationship.&lt;/p&gt;\n\n&lt;p&gt;In the novel I&amp;#39;m currently writing, the two main characters have &lt;em&gt;different&lt;/em&gt; personalities (I don&amp;#39;t know if I would say they clash per se), and ostensibly they have the same goal, but he has an ulterior motive that directly opposes hers (obviously the truth will come out to her in a totally relationship-damaging way). Just how much wiggle room is there in this firefighter-arsonist rule? I&amp;#39;m just concerned that if I&amp;#39;m trying to set them up for a relationship, the opposites are not polar enough and it&amp;#39;ll fall flat.&lt;/p&gt;\n\n&lt;p&gt;Thanks in advance.&lt;/p&gt;\n\n&lt;p&gt;Edit: Oh, I should mention this is a romance subplot occurring within the context of a sci-fi/fantasy story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8jnzl", "score_hidden": false, "stickied": false, "created": 1492161530.0, "created_utc": 1492132730.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dgafall", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gingasaurusrexx", "parent_id": "t1_dg9texo", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "My pleasure!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My pleasure!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgafall", "score_hidden": false, "stickied": false, "created": 1492270334.0, "created_utc": 1492241534.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9texo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mad-Reader", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Wow, I can't even recall now when I asked this question, maybe at the H&amp;T 19 or 11?  \n\nBut I adored your input on how to write a believable romance, knowing the different methods people use to approach something as delicate as romance (not that the other genres aren't as well).\n\nThank you for taking your time in posting this :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, I can&amp;#39;t even recall now when I asked this question, maybe at the H&amp;amp;T 19 or 11?  &lt;/p&gt;\n\n&lt;p&gt;But I adored your input on how to write a believable romance, knowing the different methods people use to approach something as delicate as romance (not that the other genres aren&amp;#39;t as well).&lt;/p&gt;\n\n&lt;p&gt;Thank you for taking your time in posting this :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9texo", "score_hidden": false, "stickied": false, "created": 1492235694.0, "created_utc": 1492206894.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65570w", "likes": null, "replies": "", "user_reports": [], "id": "dg7hcby", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "mentionhelper", "parent_id": "t3_65570w", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It looks like you're trying to mention other users, which only works if it's done in the comments like this (otherwise they don't receive a notification): \n\n- /u/MNBrian\n\n- /u/Mad-Reader\n\n\n\n---\n\n ^I'm ^a ^bot. ^Bleep. ^Bloop. ^| ^Visit ^/r/mentionhelper ^for ^discussion/feedback ^| ^Want ^to ^be ^left ^alone? ^Reply ^to ^this ^message ^with ^\"stop\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like you&amp;#39;re trying to mention other users, which only works if it&amp;#39;s done in the comments like this (otherwise they don&amp;#39;t receive a notification): &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"/u/MNBrian\"&gt;/u/MNBrian&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"/u/Mad-Reader\"&gt;/u/Mad-Reader&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;I&amp;#39;m&lt;/sup&gt; &lt;sup&gt;a&lt;/sup&gt; &lt;sup&gt;bot.&lt;/sup&gt; &lt;sup&gt;Bleep.&lt;/sup&gt; &lt;sup&gt;Bloop.&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;Visit&lt;/sup&gt; &lt;sup&gt;&lt;a href=\"/r/mentionhelper\"&gt;/r/mentionhelper&lt;/a&gt;&lt;/sup&gt; &lt;sup&gt;for&lt;/sup&gt; &lt;sup&gt;discussion/feedback&lt;/sup&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;sup&gt;Want&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;be&lt;/sup&gt; &lt;sup&gt;left&lt;/sup&gt; &lt;sup&gt;alone?&lt;/sup&gt; &lt;sup&gt;Reply&lt;/sup&gt; &lt;sup&gt;to&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;message&lt;/sup&gt; &lt;sup&gt;with&lt;/sup&gt; &lt;sup&gt;&amp;quot;stop&amp;quot;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg7hcby", "score_hidden": false, "stickied": false, "created": 1492115923.0, "created_utc": 1492087123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]