[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Aside from the big two: critique groups and reading. I&amp;#39;ve found writing off from prompts helps, especially in perspectives/styles you don&amp;#39;t typically use. What do you guys think? How do you improve?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Aside from the big two: critique groups and reading. I've found writing off from prompts helps, especially in perspectives/styles you don't typically use. What do you guys think? How do you improve?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "658opq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "Throwaway742617", "saved": false, "mod_reports": [], "name": "t3_658opq", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/658opq/discussion_how_do_you_improve_as_a_writer/", "num_reports": null, "locked": false, "stickied": false, "created": 1492150242.0, "url": "https://www.reddit.com/r/writing/comments/658opq/discussion_how_do_you_improve_as_a_writer/", "author_flair_text": null, "quarantine": false, "title": "[Discussion] How do you improve as a writer?", "created_utc": 1492121442.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8bqra", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "WhereSkyMeetsGround", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Practice.  I know I heard it a lot when I was younger and disregarded that advice.  It sounds too easy - but my writing only really began to improve measurably once I started writing daily or nearly daily.  Things get easier, the words come more quickly and organically if you write more often.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Practice.  I know I heard it a lot when I was younger and disregarded that advice.  It sounds too easy - but my writing only really began to improve measurably once I started writing daily or nearly daily.  Things get easier, the words come more quickly and organically if you write more often.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8bqra", "score_hidden": false, "stickied": false, "created": 1492150829.0, "created_utc": 1492122029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8l1ad", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "superpositionquantum", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Write, read and edit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Write, read and edit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8l1ad", "score_hidden": false, "stickied": false, "created": 1492163414.0, "created_utc": 1492134614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8ffq6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "closedsystem23", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I think that it is very difficult to know whether you are improving as a writer or not. I think that it's a very gradual and subjective judgment as to whether I've improved or not. Then again, I still believe that I have improved. I think what has helped me improve is writing a lot and reading a lot. I write every chance I get. (Ok sometimes I just stare at my computer screen and other times I'm just complaining about how some boy said this or that and did this or that and now I'm irritated with him and by extension all of humanity, but I digress). I write at work on my lunch break and I run back to my desk when a thought pops into my head. And then I read a lot. I read articles. I read other amateur work. I read about theories. I read about science and religion. I read the classics and I read new books. And then, i think most importantly, i read my own work. I go back and read my complaints about boys when I was 15 and laugh at how crappy i wrote back then. I read my short stories and the comics that i wrote when i was in middle school. I read the novel i wrote in high school and I reread my current projects. I read articles on how to write and then reread my stuff looking for those mistakes and then I change how I write. And then I read comments on r/writing and will even write a comment myself every once in awhile. Also, I have a trusted friend who is super honest and likes to critique my writing and I improve my writing that way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that it is very difficult to know whether you are improving as a writer or not. I think that it&amp;#39;s a very gradual and subjective judgment as to whether I&amp;#39;ve improved or not. Then again, I still believe that I have improved. I think what has helped me improve is writing a lot and reading a lot. I write every chance I get. (Ok sometimes I just stare at my computer screen and other times I&amp;#39;m just complaining about how some boy said this or that and did this or that and now I&amp;#39;m irritated with him and by extension all of humanity, but I digress). I write at work on my lunch break and I run back to my desk when a thought pops into my head. And then I read a lot. I read articles. I read other amateur work. I read about theories. I read about science and religion. I read the classics and I read new books. And then, i think most importantly, i read my own work. I go back and read my complaints about boys when I was 15 and laugh at how crappy i wrote back then. I read my short stories and the comics that i wrote when i was in middle school. I read the novel i wrote in high school and I reread my current projects. I read articles on how to write and then reread my stuff looking for those mistakes and then I change how I write. And then I read comments on &lt;a href=\"/r/writing\"&gt;r/writing&lt;/a&gt; and will even write a comment myself every once in awhile. Also, I have a trusted friend who is super honest and likes to critique my writing and I improve my writing that way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8ffq6", "score_hidden": false, "stickied": false, "created": 1492155717.0, "created_utc": 1492126917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8j21p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kalez238", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Reading and writing often, and researching the proprieties of writing. I know you were probably looking of something more, but that is pretty much all there is to it. As with anything, don't expect to be good at it right away, but keep at it and you will make it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading and writing often, and researching the proprieties of writing. I know you were probably looking of something more, but that is pretty much all there is to it. As with anything, don&amp;#39;t expect to be good at it right away, but keep at it and you will make it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8j21p", "score_hidden": false, "stickied": false, "created": 1492160686.0, "created_utc": 1492131886.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8jjr4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OfficerGenious", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'm not sure if I'm improving, but I read voraciously anything I can get my hands on about writing. Romance, suspense, all of it. I might use it in a subplot someday.\n\nThat being said, I'm not sure if its actually helping. I'm starting to approach a critical mass where I know all this \"stuff\" but can't form it into a cohesive story. It's a little like having a backpack so full of books you can't move anymore.\n\nIf I had to suggest a way to improve, it would be through actual writing. You'll never really be ready to write, so you might as well do it now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if I&amp;#39;m improving, but I read voraciously anything I can get my hands on about writing. Romance, suspense, all of it. I might use it in a subplot someday.&lt;/p&gt;\n\n&lt;p&gt;That being said, I&amp;#39;m not sure if its actually helping. I&amp;#39;m starting to approach a critical mass where I know all this &amp;quot;stuff&amp;quot; but can&amp;#39;t form it into a cohesive story. It&amp;#39;s a little like having a backpack so full of books you can&amp;#39;t move anymore.&lt;/p&gt;\n\n&lt;p&gt;If I had to suggest a way to improve, it would be through actual writing. You&amp;#39;ll never really be ready to write, so you might as well do it now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8jjr4", "score_hidden": false, "stickied": false, "created": 1492161363.0, "created_utc": 1492132563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8rwq0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ed727", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "You said aside from, but reading is an enormous benefit. Knowing what works and what doesn't is huge.\n\nOn top of general reading, I'd recommend reading the *Chicago Manual of Style* and *The Fantasy Fiction Formula* by Deborah Chester. The first is what most publishing companies in the US work from (though they'll generally have an in-house style sheet as well). The second is the best book on storycrafting I've ever read, with a good amount of application to any genre.\n\nBeyond that, just write. Then go over what you wrote a week later, edit it, think about it, and incorporate those thoughts.\n\nOne of the things my dad always said (which is probably from another source): \"Practice doesn't make perfect. Perfect practice makes perfect.\" Write as best you can, then make it better, then write that way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You said aside from, but reading is an enormous benefit. Knowing what works and what doesn&amp;#39;t is huge.&lt;/p&gt;\n\n&lt;p&gt;On top of general reading, I&amp;#39;d recommend reading the &lt;em&gt;Chicago Manual of Style&lt;/em&gt; and &lt;em&gt;The Fantasy Fiction Formula&lt;/em&gt; by Deborah Chester. The first is what most publishing companies in the US work from (though they&amp;#39;ll generally have an in-house style sheet as well). The second is the best book on storycrafting I&amp;#39;ve ever read, with a good amount of application to any genre.&lt;/p&gt;\n\n&lt;p&gt;Beyond that, just write. Then go over what you wrote a week later, edit it, think about it, and incorporate those thoughts.&lt;/p&gt;\n\n&lt;p&gt;One of the things my dad always said (which is probably from another source): &amp;quot;Practice doesn&amp;#39;t make perfect. Perfect practice makes perfect.&amp;quot; Write as best you can, then make it better, then write that way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8rwq0", "score_hidden": false, "stickied": false, "created": 1492173990.0, "created_utc": 1492145190.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8skx4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "novelconcepts", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Reconsider everything you're absolutely sure you know. It takes a while to realize that what you're doing isn't working if it isn't working for you. \n\nRead as much unpublished work as you can get your hands on. It's easy to think that there are no rules works when you're emotionally attached to your writing; when you're reading your own work you see what's on the page and what you think is on the page at the same time. Reading other people's work removes you from the emotional attachment that you have. \n\nIf you see dozens of people making the same mistake over and over again, it makes it easy to see it in your own work. If you critique other people's work, you'll see dozens of attempts at taking a story from beginning to end with all the traps. With your own stuff, if you see three attempts from start to finish you're doing quite well.\n\nHold your opinions away from you as a person so you can swap them out as you grow. If what you're doing is working, you should see progressively encouraging results, from personalized feedback to acceptances. Writer insanity is trying the same thing over and over again and expecting different results. I've seen it over and over again with writers stuck in a rut; if they think they know everything, it isn't possible to learn something new. And despite the lack of results, they will defend their process to the death.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reconsider everything you&amp;#39;re absolutely sure you know. It takes a while to realize that what you&amp;#39;re doing isn&amp;#39;t working if it isn&amp;#39;t working for you. &lt;/p&gt;\n\n&lt;p&gt;Read as much unpublished work as you can get your hands on. It&amp;#39;s easy to think that there are no rules works when you&amp;#39;re emotionally attached to your writing; when you&amp;#39;re reading your own work you see what&amp;#39;s on the page and what you think is on the page at the same time. Reading other people&amp;#39;s work removes you from the emotional attachment that you have. &lt;/p&gt;\n\n&lt;p&gt;If you see dozens of people making the same mistake over and over again, it makes it easy to see it in your own work. If you critique other people&amp;#39;s work, you&amp;#39;ll see dozens of attempts at taking a story from beginning to end with all the traps. With your own stuff, if you see three attempts from start to finish you&amp;#39;re doing quite well.&lt;/p&gt;\n\n&lt;p&gt;Hold your opinions away from you as a person so you can swap them out as you grow. If what you&amp;#39;re doing is working, you should see progressively encouraging results, from personalized feedback to acceptances. Writer insanity is trying the same thing over and over again and expecting different results. I&amp;#39;ve seen it over and over again with writers stuck in a rut; if they think they know everything, it isn&amp;#39;t possible to learn something new. And despite the lack of results, they will defend their process to the death.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8skx4", "score_hidden": false, "stickied": false, "created": 1492175256.0, "created_utc": 1492146456.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8vpva", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EdMcDonald_Blackwing", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Basically, you just write. If you talk to published authors, you'll find that there's no continuity between what they did or didn't do before they wrote a corker. Some will have been working on one book, totally alone, for 10 years. Others have attended writing workshops or groups. Some like me do a lot of online critique; most do none.\n\nThere's one thing that they all have in common, though: they finished their books.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Basically, you just write. If you talk to published authors, you&amp;#39;ll find that there&amp;#39;s no continuity between what they did or didn&amp;#39;t do before they wrote a corker. Some will have been working on one book, totally alone, for 10 years. Others have attended writing workshops or groups. Some like me do a lot of online critique; most do none.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s one thing that they all have in common, though: they finished their books.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8vpva", "score_hidden": false, "stickied": false, "created": 1492182299.0, "created_utc": 1492153499.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_658opq", "likes": null, "replies": "", "user_reports": [], "id": "dg8zczx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "swiftwater", "parent_id": "t3_658opq", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Practicing different techniques/tips that an author you like/respect uses.\n\nI got some really great tips by doing this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Practicing different techniques/tips that an author you like/respect uses.&lt;/p&gt;\n\n&lt;p&gt;I got some really great tips by doing this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8zczx", "score_hidden": false, "stickied": false, "created": 1492193616.0, "created_utc": 1492164816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]