[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a hobby linguist, so of course I like to create conlangs for the stories I write. This time, I am writing a particularily large story so I created three distinct languages. One of them is an actual constructed language, one is a version of english, and the other is just random symbols that aren&amp;#39;t meant to be transcribed. Anyways, I&amp;#39;m having trouble finding parts to insert them in. Every time I try, it comes off as forced. For example: the main character takes out a piece of paper from his pocket with the language. How am I supposed to include the actual text in? Do I say &amp;quot;the paper read:&amp;quot; or something else? I have already created the font for it. I want the language to be a big part of the story. Something that is so important that it would require readers to transcribe the text to get more information. I just don&amp;#39;t know where to include that kind of stuff in. Maybe the main character finds an old scroll with instructions on how to do the thing he wants to do? It just seems forced.&lt;/p&gt;\n\n&lt;p&gt;EDIT: In this case, the main character knows how to read the languages but has a strained memory about some of them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a hobby linguist, so of course I like to create conlangs for the stories I write. This time, I am writing a particularily large story so I created three distinct languages. One of them is an actual constructed language, one is a version of english, and the other is just random symbols that aren't meant to be transcribed. Anyways, I'm having trouble finding parts to insert them in. Every time I try, it comes off as forced. For example: the main character takes out a piece of paper from his pocket with the language. How am I supposed to include the actual text in? Do I say \"the paper read:\" or something else? I have already created the font for it. I want the language to be a big part of the story. Something that is so important that it would require readers to transcribe the text to get more information. I just don't know where to include that kind of stuff in. Maybe the main character finds an old scroll with instructions on how to do the thing he wants to do? It just seems forced.\n\nEDIT: In this case, the main character knows how to read the languages but has a strained memory about some of them.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Advice", "id": "659wq7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "clwbm", "saved": false, "mod_reports": [], "name": "t3_659wq7", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": "advice", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/659wq7/how_do_i_put_my_constructed_languages_into_parts/", "num_reports": null, "locked": false, "stickied": false, "created": 1492164387.0, "url": "https://www.reddit.com/r/writing/comments/659wq7/how_do_i_put_my_constructed_languages_into_parts/", "author_flair_text": null, "quarantine": false, "title": "How do I put my constructed languages into parts of my story?", "created_utc": 1492135587.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": "", "user_reports": [], "id": "dg8rjgj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cor-Kel", "parent_id": "t1_dg8n4rd", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I agree, when reading a book I should have the same general knowledge as the POV. If s/he reads a scroll and by the end of the story i didn't know what the scroll said I would be a bit frustrated. However if another character was speaking the language and it didn't play into main dialogue then that could be interesting. (Lord of the rings, Futurama, star wars, star trek.) And depending on how much of a fan I am of the story I might go that extra mile and try to figure out what it says. \n\nMade up languages are great for lore, but you shouldn't force a reader to try to unscramble a scroll. So do it right and it will be great.\n\nAlso I'm not a great writer so take this with a grain salt. :)", "edited": 1492144704.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, when reading a book I should have the same general knowledge as the POV. If s/he reads a scroll and by the end of the story i didn&amp;#39;t know what the scroll said I would be a bit frustrated. However if another character was speaking the language and it didn&amp;#39;t play into main dialogue then that could be interesting. (Lord of the rings, Futurama, star wars, star trek.) And depending on how much of a fan I am of the story I might go that extra mile and try to figure out what it says. &lt;/p&gt;\n\n&lt;p&gt;Made up languages are great for lore, but you shouldn&amp;#39;t force a reader to try to unscramble a scroll. So do it right and it will be great.&lt;/p&gt;\n\n&lt;p&gt;Also I&amp;#39;m not a great writer so take this with a grain salt. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8rjgj", "score_hidden": false, "stickied": false, "created": 1492173324.0, "created_utc": 1492144524.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8n4rd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "247naptime", "parent_id": "t1_dg8mo31", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I would add it in, but not give it an extremely significant role in the plot.  One thing I've always liked is when characters that are fluent in the language speak it, and the MC is confused with the readers.  Then the readers can use context clues to figure out what they said, while the MC is still left in the dark.  Though I'm not sure how you would do that if the MC does know the language.\n\nThat being said, I do love your idea.  I think it's a wonderful idea.  But I'd use it sparingly, and only in situations the reader can either figure out what they are saying through context cues, or know what's happening in the plot without it.  It can just be an extra cool layer.  A nice example I think is if the MC goes to some sort of ancient ruins and doesn't understand the language, you describe what the writing looks like or show it, and later the topic of some sort of ancient rebellion that took place comes up and if the reader can connect the dots, they'll figure out the message was a burial marker or something.\n\nEdit: the second paragraph", "edited": 1492137869.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would add it in, but not give it an extremely significant role in the plot.  One thing I&amp;#39;ve always liked is when characters that are fluent in the language speak it, and the MC is confused with the readers.  Then the readers can use context clues to figure out what they said, while the MC is still left in the dark.  Though I&amp;#39;m not sure how you would do that if the MC does know the language.&lt;/p&gt;\n\n&lt;p&gt;That being said, I do love your idea.  I think it&amp;#39;s a wonderful idea.  But I&amp;#39;d use it sparingly, and only in situations the reader can either figure out what they are saying through context cues, or know what&amp;#39;s happening in the plot without it.  It can just be an extra cool layer.  A nice example I think is if the MC goes to some sort of ancient ruins and doesn&amp;#39;t understand the language, you describe what the writing looks like or show it, and later the topic of some sort of ancient rebellion that took place comes up and if the reader can connect the dots, they&amp;#39;ll figure out the message was a burial marker or something.&lt;/p&gt;\n\n&lt;p&gt;Edit: the second paragraph&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8n4rd", "score_hidden": false, "stickied": false, "created": 1492166385.0, "created_utc": 1492137585.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": "", "user_reports": [], "id": "dg8ueae", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "krishnasaltere", "parent_id": "t1_dg8mo31", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'm personally of the opinion that you should just run with it. Stretch conventions as far as possible. See how far you can get away with it. Experiment, and more importantly, get feedback on your experiments. If their roles are mere easter eggs, then what's the point of all your work?\n\nHere's an idea. Use the language as a worldbuilding tool. Whenever you worldbuild, relate it to the language, one way or another. Slowly build up a reader's understanding of the vocabulary, rules, pitfalls, and relations that words have to do with the world. Think of writing your story as Language Course 101/worldbuilding/storytelling. Hopefully by 2/3 of the story, the reader will have the necessary knowledge to deduce simple sentences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m personally of the opinion that you should just run with it. Stretch conventions as far as possible. See how far you can get away with it. Experiment, and more importantly, get feedback on your experiments. If their roles are mere easter eggs, then what&amp;#39;s the point of all your work?&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s an idea. Use the language as a worldbuilding tool. Whenever you worldbuild, relate it to the language, one way or another. Slowly build up a reader&amp;#39;s understanding of the vocabulary, rules, pitfalls, and relations that words have to do with the world. Think of writing your story as Language Course 101/worldbuilding/storytelling. Hopefully by 2/3 of the story, the reader will have the necessary knowledge to deduce simple sentences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8ueae", "score_hidden": false, "stickied": false, "created": 1492179028.0, "created_utc": 1492150228.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mo31", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clwbm", "parent_id": "t1_dg8m2ju", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Yeah, but I thought I'd add the language parts of the book as easter eggs that aren't necessary to the story but provide lore. But how much can I include of that until it gets annoying? Personally, I always thought stuff like that was cool.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, but I thought I&amp;#39;d add the language parts of the book as easter eggs that aren&amp;#39;t necessary to the story but provide lore. But how much can I include of that until it gets annoying? Personally, I always thought stuff like that was cool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8mo31", "score_hidden": false, "stickied": false, "created": 1492165711.0, "created_utc": 1492136911.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8m2ju", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "247naptime", "parent_id": "t3_659wq7", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Honestly, that sounds like a big ole' headache.  I get you love languages and all, but most readers aren't going to want to have to do research on a book to understand it, or read a bunch of text that flies over their head, it may get frustrating and annoying.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, that sounds like a big ole&amp;#39; headache.  I get you love languages and all, but most readers aren&amp;#39;t going to want to have to do research on a book to understand it, or read a bunch of text that flies over their head, it may get frustrating and annoying.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8m2ju", "score_hidden": false, "stickied": false, "created": 1492164873.0, "created_utc": 1492136073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": "", "user_reports": [], "id": "dg8safr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Chris_Herron", "parent_id": "t3_659wq7", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Couple of idea come to mind.\n\n1. Think about media. You see characters occasionally that speak a foreign language that the viewer doesn't understand. Perhaps some of the other characters do, but it's not necessary. As long as the context gets the point across or there is another character to translate, you should be good.\n\n2. Let's use the ancient scroll as an example, and let's assume the MC is fluent and simply reads it. Describe the scroll as being in elvish (or whatever) but have them read it in English. Then add a picture of an old scroll with all your fun text on the next page. There seems to be a prejudice against using pictures in adult novels, but I've seen it done before and I loved it. It's not affecting the story, it's just eye candy and an excuse to show off your linguistic skills.\n\n3. I really don't like this idea, but you might. Have the MC have zero ability with a language. Then have another character teaching them how to speak it. In the process, you also teach the reader. The problem with this one is it takes up so much of the story, and if the reader isn't interested in learning it they might put down the book once it gets confusing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Couple of idea come to mind.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Think about media. You see characters occasionally that speak a foreign language that the viewer doesn&amp;#39;t understand. Perhaps some of the other characters do, but it&amp;#39;s not necessary. As long as the context gets the point across or there is another character to translate, you should be good.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Let&amp;#39;s use the ancient scroll as an example, and let&amp;#39;s assume the MC is fluent and simply reads it. Describe the scroll as being in elvish (or whatever) but have them read it in English. Then add a picture of an old scroll with all your fun text on the next page. There seems to be a prejudice against using pictures in adult novels, but I&amp;#39;ve seen it done before and I loved it. It&amp;#39;s not affecting the story, it&amp;#39;s just eye candy and an excuse to show off your linguistic skills.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I really don&amp;#39;t like this idea, but you might. Have the MC have zero ability with a language. Then have another character teaching them how to speak it. In the process, you also teach the reader. The problem with this one is it takes up so much of the story, and if the reader isn&amp;#39;t interested in learning it they might put down the book once it gets confusing.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8safr", "score_hidden": false, "stickied": false, "created": 1492174696.0, "created_utc": 1492145896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": "", "user_reports": [], "id": "dg8syhf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rourensu", "parent_id": "t3_659wq7", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "(Con)languages are a part of my story and I put examples of them in my book. For simple terms/phrases that can be understood from context, I leave it in the conlang, or if it's something the character (reader) learns and it comes up again.\n\n(Son talking to dad)\n\n\"Valtha, where's my phone?\"\n\n(Person giving birthday present)\n\n\"Kalthres pegan [name].\"\n\nIf it's something more complex or I want to make sure the meaning's clear, I include a translation after it. \n\n*Mi chiamo Lorenzo,* he thought. My name's Lorenzo.\n\nI like how language was written in James Clavell's *Shōgun* (set in Japan in 1600 and has Japanese, Spanish, Portuguese, Dutch, and Latin text sprinkled throughout) and base what I do off that:\n\n1. Via interpreter:\n\n\"*Wakarimasu ka?*\" Omi said directly to Blackthorne.\n\n\"He says, 'Do you understand?' \" (pg. 33)\n\n2. Mixing basic learned words with English:\n\n\"Quick! *Isogi!* Make him understand—Kasigi Yabu-sama! *Wakarimasu ka?*\" (pg. 174)\n\n3. Direct translation:\n\nThe assassin feinted once, shouted, \"*Namu Amida Butsu—*\" In the Name of the Buddha Amida—turned the knife on himself... (pg. 273)\n\n4. Remembering/learning the word + use in context:\n\n\"Get some water—water, *hai?*\"\n\nThe seamen stared at him without comprehension. Desperately he searched his mind for the Japanese word. The old monk had told it to him fifty times. Christ God, what is it? \"Oh—*mizu, mizu, hai?*\"\n\n\"Ah, *mizu! Hai,* Anjin-san.\" (pg. 368)\n\nEdit: This is from an unfinished short story I wrote:\n\n\"*Hanak thel avres,*” the Keeper spoke beneath his breath.\n\n*Go with the gods*, his mind translated. He had seen the phrase before—thrice as he completed reading the second line of text. A record of K’has Azlan’s last message prior to his death, his epistle had been a request to his followers. *Telos rosas dhem k’esh,* until the Sun stands in the sky, Azlan instructed them, *hanak thel avres.*\n", "edited": 1492149372.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Con)languages are a part of my story and I put examples of them in my book. For simple terms/phrases that can be understood from context, I leave it in the conlang, or if it&amp;#39;s something the character (reader) learns and it comes up again.&lt;/p&gt;\n\n&lt;p&gt;(Son talking to dad)&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Valtha, where&amp;#39;s my phone?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(Person giving birthday present)&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Kalthres pegan [name].&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s something more complex or I want to make sure the meaning&amp;#39;s clear, I include a translation after it. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Mi chiamo Lorenzo,&lt;/em&gt; he thought. My name&amp;#39;s Lorenzo.&lt;/p&gt;\n\n&lt;p&gt;I like how language was written in James Clavell&amp;#39;s &lt;em&gt;Shōgun&lt;/em&gt; (set in Japan in 1600 and has Japanese, Spanish, Portuguese, Dutch, and Latin text sprinkled throughout) and base what I do off that:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Via interpreter:&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;quot;&lt;em&gt;Wakarimasu ka?&lt;/em&gt;&amp;quot; Omi said directly to Blackthorne.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He says, &amp;#39;Do you understand?&amp;#39; &amp;quot; (pg. 33)&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Mixing basic learned words with English:&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;quot;Quick! &lt;em&gt;Isogi!&lt;/em&gt; Make him understand—Kasigi Yabu-sama! &lt;em&gt;Wakarimasu ka?&lt;/em&gt;&amp;quot; (pg. 174)&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Direct translation:&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The assassin feinted once, shouted, &amp;quot;&lt;em&gt;Namu Amida Butsu—&lt;/em&gt;&amp;quot; In the Name of the Buddha Amida—turned the knife on himself... (pg. 273)&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Remembering/learning the word + use in context:&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&amp;quot;Get some water—water, &lt;em&gt;hai?&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The seamen stared at him without comprehension. Desperately he searched his mind for the Japanese word. The old monk had told it to him fifty times. Christ God, what is it? &amp;quot;Oh—&lt;em&gt;mizu, mizu, hai?&lt;/em&gt;&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Ah, &lt;em&gt;mizu! Hai,&lt;/em&gt; Anjin-san.&amp;quot; (pg. 368)&lt;/p&gt;\n\n&lt;p&gt;Edit: This is from an unfinished short story I wrote:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&lt;em&gt;Hanak thel avres,&lt;/em&gt;” the Keeper spoke beneath his breath.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Go with the gods&lt;/em&gt;, his mind translated. He had seen the phrase before—thrice as he completed reading the second line of text. A record of K’has Azlan’s last message prior to his death, his epistle had been a request to his followers. &lt;em&gt;Telos rosas dhem k’esh,&lt;/em&gt; until the Sun stands in the sky, Azlan instructed them, &lt;em&gt;hanak thel avres.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8syhf", "score_hidden": false, "stickied": false, "created": 1492175998.0, "created_utc": 1492147198.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": "", "user_reports": [], "id": "dg8u9sq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thegriffin88", "parent_id": "t3_659wq7", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'm going to be incredibly blunt here so excuse me if I come off as rude I'm not trying to be.\n\nYou really only need what's necessary. I get that you love languages and that's fine, personally not my thing but at least you aren't just trying to mimic Tolkien which is the most rookie mistake in the history of fantasy writing. So as much as you love what you created you need to think of what is necessary to the plot, what makes sense in terms of the context and the characters. You might end up using only 10%, but it will be a better book for it. \n\nIt's not a you thing, it's just a casualty of world building. I have several pages of history on my world and maybe will only cover 10% of it in the actual book if I'm capable of some good shoehorning. At least your guy likes to read, gives you an excuse. My guy wouldn't be caught dead in a library so shoving some history into this thing is gonna be fun. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to be incredibly blunt here so excuse me if I come off as rude I&amp;#39;m not trying to be.&lt;/p&gt;\n\n&lt;p&gt;You really only need what&amp;#39;s necessary. I get that you love languages and that&amp;#39;s fine, personally not my thing but at least you aren&amp;#39;t just trying to mimic Tolkien which is the most rookie mistake in the history of fantasy writing. So as much as you love what you created you need to think of what is necessary to the plot, what makes sense in terms of the context and the characters. You might end up using only 10%, but it will be a better book for it. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not a you thing, it&amp;#39;s just a casualty of world building. I have several pages of history on my world and maybe will only cover 10% of it in the actual book if I&amp;#39;m capable of some good shoehorning. At least your guy likes to read, gives you an excuse. My guy wouldn&amp;#39;t be caught dead in a library so shoving some history into this thing is gonna be fun. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8u9sq", "score_hidden": false, "stickied": false, "created": 1492178737.0, "created_utc": 1492149937.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": "", "user_reports": [], "id": "dg8skkv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Seb_Romu", "parent_id": "t3_659wq7", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "If it is feeling forced it is probably because you are forcing it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it is feeling forced it is probably because you are forcing it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8skkv", "score_hidden": false, "stickied": false, "created": 1492175238.0, "created_utc": 1492146438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_659wq7", "likes": null, "replies": "", "user_reports": [], "id": "dg8yx0s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t3_659wq7", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I've used Polish and Russian in this way in my magical-Earth stories, but I've stopped actually writing phrases in the language, and only really refer to it when the character has a meaningful or ironic name (usually the latter: a woman who looks like she has Turkish ancestry is named 'Morozova', Miss Frost; the Cardinal in the story is named Sikorska, and people notice she puffs herself up like a *sikora*, a tit...). There's a barrier inherent in my audience: I know and appreciate Baltic culture, but my audience doesn't necessarily, and while I enjoy referring to odd bits of slang and descriptive names, at the same time it has to be immediately accessible to a reader. (My first protagonist was called Mlynarczyk, and I got feedback on the accessibility -- or otherwise -- of that name!) I often just literally translate idiom into English to give some alien flavour while keeping the context clear, but that's easier to do with a living language than a con-lang.\n\nI would not make it get in the way of a reader's comprehension of the story in context, however. One, it's not an easter egg because it's a made-up language and someone can't go to Google Translate to find out what it means. Secondly, if the reader has to leave the book to go and look something up, then you've punctured their immersion. Thirdly, I listen to audiobooks and often read when there's no wifi connection. I can't automatically go and look up whatever it is I need to look up if I'm walking across a road on my way to work or have the book playing while I'm working on my sales job (or, like my lorry driver friend, on the motorway back to his depot ;)). Audio is big business now, so books are even being written keeping it in mind.\n\nThere is an awful lot to be said for keeping everything within the context of the book. It wouldn't be as awesome for the reader as it is for you as a writer. If you must use your conlang, use it in a way that shows your work at consistency in naming patterns, or have brief snatches of it intelligible in context. Don't go overboard into long untranslated exchanges just because the MC can't understand the language properly (your average reader would just glaze over at that point) and don't force a reader out of the book to look it up. ", "edited": 1492173086.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve used Polish and Russian in this way in my magical-Earth stories, but I&amp;#39;ve stopped actually writing phrases in the language, and only really refer to it when the character has a meaningful or ironic name (usually the latter: a woman who looks like she has Turkish ancestry is named &amp;#39;Morozova&amp;#39;, Miss Frost; the Cardinal in the story is named Sikorska, and people notice she puffs herself up like a &lt;em&gt;sikora&lt;/em&gt;, a tit...). There&amp;#39;s a barrier inherent in my audience: I know and appreciate Baltic culture, but my audience doesn&amp;#39;t necessarily, and while I enjoy referring to odd bits of slang and descriptive names, at the same time it has to be immediately accessible to a reader. (My first protagonist was called Mlynarczyk, and I got feedback on the accessibility -- or otherwise -- of that name!) I often just literally translate idiom into English to give some alien flavour while keeping the context clear, but that&amp;#39;s easier to do with a living language than a con-lang.&lt;/p&gt;\n\n&lt;p&gt;I would not make it get in the way of a reader&amp;#39;s comprehension of the story in context, however. One, it&amp;#39;s not an easter egg because it&amp;#39;s a made-up language and someone can&amp;#39;t go to Google Translate to find out what it means. Secondly, if the reader has to leave the book to go and look something up, then you&amp;#39;ve punctured their immersion. Thirdly, I listen to audiobooks and often read when there&amp;#39;s no wifi connection. I can&amp;#39;t automatically go and look up whatever it is I need to look up if I&amp;#39;m walking across a road on my way to work or have the book playing while I&amp;#39;m working on my sales job (or, like my lorry driver friend, on the motorway back to his depot ;)). Audio is big business now, so books are even being written keeping it in mind.&lt;/p&gt;\n\n&lt;p&gt;There is an awful lot to be said for keeping everything within the context of the book. It wouldn&amp;#39;t be as awesome for the reader as it is for you as a writer. If you must use your conlang, use it in a way that shows your work at consistency in naming patterns, or have brief snatches of it intelligible in context. Don&amp;#39;t go overboard into long untranslated exchanges just because the MC can&amp;#39;t understand the language properly (your average reader would just glaze over at that point) and don&amp;#39;t force a reader out of the book to look it up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg8yx0s", "score_hidden": false, "stickied": false, "created": 1492192132.0, "created_utc": 1492163332.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]