[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been surfing Query Shark while working on my query letter (though I haven&amp;#39;t finished reading the archives), and Janet Reid sometimes points out when people compare their novels to something that&amp;#39;s not similar enough. Either the writing style doesn&amp;#39;t evoke that of the compared novel, or the genres or completely different.&lt;/p&gt;\n\n&lt;p&gt;My novel is speculative fiction, specifically post-apocalyptic, but it focuses on a small, somewhat isolated group of people who each have separate but interwoven narratives. I&amp;#39;d like to compare it to Toni Morrison&amp;#39;s &lt;em&gt;A Mercy&lt;/em&gt; which is historical fiction, but I believe the &amp;quot;narrative styles&amp;quot; are similar. Is this a no-no simply because I&amp;#39;m comparing novels from two separate genres?&lt;/p&gt;\n\n&lt;p&gt;I admittedly haven&amp;#39;t read enough post-apocalyptic fiction specifically to find a novel that&amp;#39;s similar enough to mine to use as a comparison within the sub-genre. Most of the speculative fiction I have read doesn&amp;#39;t seem very close to me either. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m an African-American woman writer and my novel, being somewhat in the near future, does deal with topics of race, identity, motherhood and belonging. It also evokes historical events relevant to what the characters are coping with in their present. I took a lot of inspiration from &lt;em&gt;A Mercy&lt;/em&gt; even though the settings between it and my novel are very different. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been considering leaving the comparison out entirely. I&amp;#39;m not sure if it would hurt more than help, as some of the agents I query who accept speculative fiction may not be interested in historical fiction. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: if the narrative styles are similar but the genres are not, is it still wise to make a comparison between two novels in a query letter? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been surfing Query Shark while working on my query letter (though I haven't finished reading the archives), and Janet Reid sometimes points out when people compare their novels to something that's not similar enough. Either the writing style doesn't evoke that of the compared novel, or the genres or completely different.\n\nMy novel is speculative fiction, specifically post-apocalyptic, but it focuses on a small, somewhat isolated group of people who each have separate but interwoven narratives. I'd like to compare it to Toni Morrison's *A Mercy* which is historical fiction, but I believe the \"narrative styles\" are similar. Is this a no-no simply because I'm comparing novels from two separate genres?\n\nI admittedly haven't read enough post-apocalyptic fiction specifically to find a novel that's similar enough to mine to use as a comparison within the sub-genre. Most of the speculative fiction I have read doesn't seem very close to me either. \n\nI'm an African-American woman writer and my novel, being somewhat in the near future, does deal with topics of race, identity, motherhood and belonging. It also evokes historical events relevant to what the characters are coping with in their present. I took a lot of inspiration from *A Mercy* even though the settings between it and my novel are very different. \n\nI've been considering leaving the comparison out entirely. I'm not sure if it would hurt more than help, as some of the agents I query who accept speculative fiction may not be interested in historical fiction. \n\nTL;DR: if the narrative styles are similar but the genres are not, is it still wise to make a comparison between two novels in a query letter? \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65bxft", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "EvaExotica", "saved": false, "mod_reports": [], "name": "t3_65bxft", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/65bxft/query_letter_question_is_it_okay_to_compare_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492197114.0, "url": "https://www.reddit.com/r/writing/comments/65bxft/query_letter_question_is_it_okay_to_compare_my/", "author_flair_text": null, "quarantine": false, "title": "Query Letter Question - Is it okay to compare my speculative fiction (post-apocalyptic) novel to a historical fiction novel?", "created_utc": 1492168314.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": "", "user_reports": [], "id": "dg96y4f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg96qz8", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Let me know how it goes when you read it! :) I thought Station Eleven was a fascinating and delightful book that really handled the post-apocalyptic genre in a new way. Very interested to see how others take it! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let me know how it goes when you read it! :) I thought Station Eleven was a fascinating and delightful book that really handled the post-apocalyptic genre in a new way. Very interested to see how others take it! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg96y4f", "score_hidden": false, "stickied": false, "created": 1492208829.0, "created_utc": 1492180029.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96qz8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EvaExotica", "parent_id": "t1_dg93io1", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Thank you for the advice! \n\nI certainly need to read more post-apocalyptic fiction specifically. I read the \"classic\" examples and then wandered into reading general Science-Fiction, which wasn't the best thing to do. \n\nI am sort of working on my query ahead of time at this point. While my novel has been through several drafts and has been read over and critiqued by professors who are all published authors themselves, it still has some issues (for example, it's currently a bit too short as it was originally intended as a novella). \n\nI think now would be a good time for me to request the help of beta readers while I read some other post-apocalyptic novels in the meantime. The readers' suggestions and whatever new things I learn to try/avoid from the other novels will hopefully influence my final revision before I query. \n\nI will also check out *Station Eleven*--thank you for that suggestion!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the advice! &lt;/p&gt;\n\n&lt;p&gt;I certainly need to read more post-apocalyptic fiction specifically. I read the &amp;quot;classic&amp;quot; examples and then wandered into reading general Science-Fiction, which wasn&amp;#39;t the best thing to do. &lt;/p&gt;\n\n&lt;p&gt;I am sort of working on my query ahead of time at this point. While my novel has been through several drafts and has been read over and critiqued by professors who are all published authors themselves, it still has some issues (for example, it&amp;#39;s currently a bit too short as it was originally intended as a novella). &lt;/p&gt;\n\n&lt;p&gt;I think now would be a good time for me to request the help of beta readers while I read some other post-apocalyptic novels in the meantime. The readers&amp;#39; suggestions and whatever new things I learn to try/avoid from the other novels will hopefully influence my final revision before I query. &lt;/p&gt;\n\n&lt;p&gt;I will also check out &lt;em&gt;Station Eleven&lt;/em&gt;--thank you for that suggestion!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg96qz8", "score_hidden": false, "stickied": false, "created": 1492208565.0, "created_utc": 1492179765.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": "", "user_reports": [], "id": "dg9ci7f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rourensu", "parent_id": "t1_dg9b6co", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Ultimately, it's the story I want to tell. It may or not be the BEST way, but I'm not going to limit myself to the arbitrary rules of the genre. If epic story telling and worldbuilding (for example) can be totally acceptable in epic fantasy, I see no reason I shouldn't do that because my characters have cellphones.\n\n&gt;Anywho - don't give up trying to find something similar.\n\nI wouldn't say I've given up, but I think I've exhausted most if not all of my resources.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ultimately, it&amp;#39;s the story I want to tell. It may or not be the BEST way, but I&amp;#39;m not going to limit myself to the arbitrary rules of the genre. If epic story telling and worldbuilding (for example) can be totally acceptable in epic fantasy, I see no reason I shouldn&amp;#39;t do that because my characters have cellphones.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Anywho - don&amp;#39;t give up trying to find something similar.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t say I&amp;#39;ve given up, but I think I&amp;#39;ve exhausted most if not all of my resources.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9ci7f", "score_hidden": false, "stickied": false, "created": 1492215497.0, "created_utc": 1492186697.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9b6co", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg98t9m", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; I feel like how Patrick Rothfuss said he felt because he was writing in first person and people said to him \"can you do that?\" \n\nThis is a really great point and you're right. Truly the best you can get sometimes is conventional wisdom if someone isn't reading your actual book, and even when they do, all they see is the hurdle and not your commitment to doing it that way. \n\nThe really important thing to consider is this (in your example) -- is third person worth it? Does it tell the best story?\n\nIf it is a hurdle and if you are breaking genre trends, and if you're sure that breaking this rule is the BEST way to share your story, then you absolutely should ignore everyone who says otherwise. If you're willing to die at the stake with this book because telling it in third person is the way it must be done, then you know it needs to be told that way. :) \n\nI realize you were just giving an example, but you get my point. :) \n\nAnywho - don't give up trying to find something similar. It won't be perfect, but reading things that don't do what we want is another way to identify how to do what we want to do - to tell a story with similar themes in a completely different way. :)\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I feel like how Patrick Rothfuss said he felt because he was writing in first person and people said to him &amp;quot;can you do that?&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a really great point and you&amp;#39;re right. Truly the best you can get sometimes is conventional wisdom if someone isn&amp;#39;t reading your actual book, and even when they do, all they see is the hurdle and not your commitment to doing it that way. &lt;/p&gt;\n\n&lt;p&gt;The really important thing to consider is this (in your example) -- is third person worth it? Does it tell the best story?&lt;/p&gt;\n\n&lt;p&gt;If it is a hurdle and if you are breaking genre trends, and if you&amp;#39;re sure that breaking this rule is the BEST way to share your story, then you absolutely should ignore everyone who says otherwise. If you&amp;#39;re willing to die at the stake with this book because telling it in third person is the way it must be done, then you know it needs to be told that way. :) &lt;/p&gt;\n\n&lt;p&gt;I realize you were just giving an example, but you get my point. :) &lt;/p&gt;\n\n&lt;p&gt;Anywho - don&amp;#39;t give up trying to find something similar. It won&amp;#39;t be perfect, but reading things that don&amp;#39;t do what we want is another way to identify how to do what we want to do - to tell a story with similar themes in a completely different way. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9b6co", "score_hidden": false, "stickied": false, "created": 1492214019.0, "created_utc": 1492185219.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98t9m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Rourensu", "parent_id": "t1_dg96brf", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Well I think it goes without saying that I haven't checked each of the 727,000 2015 self published books (actually I completely neglected to consider self published books), but I've inquired many times with people in the genre(s) and readers, but haven't had much luck. Part of the problem I think is that my book ***may be*** urban fantasy automatically because it is in a modern setting with some fantasy (and even agents have differing opinions about that), but besides that, there are many things that don't really belong in urban fantasy (including some intentional things because I **didn't** want it to be like an urban fiction book). I could find many books in the genre, but I'm not sure if even Amazon could further filter the results to exclude tropes and other elements that I don't like about the genre and find something more similar to my book.\n\n&gt;I mean, often the point here is that we writers get offended when someone suggests you \"cant\" do something.\n\nI feel like how Patrick Rothfuss said he felt because he was writing in first person and people said to him \"can you do that?\" after he already wrote 300 pages. He said he did first person because that's \"what felt right\" and hadn't considered epic fantasy (typically?) being written in third person. Then he read Robin Hobb's books and they \"gave him solace\" because she wrote first person. I'm hoping to find something like that for my book.\n\n&gt;You can write any book you like.\n\nThat's the goal.\n\n&gt;Now, the last thing I'll say is this -- what you DO read is influencing your genre.\n\nThis is something I've been thinking more about recently. Recently I've been reading more historical fiction and would say that my book is more like urban ~~fiction~~ fantasy that (ideally) reads like historical fiction or epic fantasy. The best comparison I could make would be a secondary world *American Gods*, meaning having all the worldbuilding typically found in epic fantasy or historical fiction and that sort of scale.\n\n&gt;So instead, next time you write a book, I'd recommend helping yourself by reading in that genre. \n\nWell I'm only 100k words into the book and it's the first in a trilogy, so if I ever finish this one there are still two more to write. I've been trying to find some stuff in the genre that I like, and have had some false hits for books similar to mine, but there's been one series that I think is promising (though not really similar to mine). There are many books in the genre that I do like and can't really justify myself skipping what I enjoy reading to read stuff I don't like.\n\nEdit: wrong word", "edited": 1492182760.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I think it goes without saying that I haven&amp;#39;t checked each of the 727,000 2015 self published books (actually I completely neglected to consider self published books), but I&amp;#39;ve inquired many times with people in the genre(s) and readers, but haven&amp;#39;t had much luck. Part of the problem I think is that my book &lt;strong&gt;&lt;em&gt;may be&lt;/em&gt;&lt;/strong&gt; urban fantasy automatically because it is in a modern setting with some fantasy (and even agents have differing opinions about that), but besides that, there are many things that don&amp;#39;t really belong in urban fantasy (including some intentional things because I &lt;strong&gt;didn&amp;#39;t&lt;/strong&gt; want it to be like an urban fiction book). I could find many books in the genre, but I&amp;#39;m not sure if even Amazon could further filter the results to exclude tropes and other elements that I don&amp;#39;t like about the genre and find something more similar to my book.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I mean, often the point here is that we writers get offended when someone suggests you &amp;quot;cant&amp;quot; do something.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I feel like how Patrick Rothfuss said he felt because he was writing in first person and people said to him &amp;quot;can you do that?&amp;quot; after he already wrote 300 pages. He said he did first person because that&amp;#39;s &amp;quot;what felt right&amp;quot; and hadn&amp;#39;t considered epic fantasy (typically?) being written in third person. Then he read Robin Hobb&amp;#39;s books and they &amp;quot;gave him solace&amp;quot; because she wrote first person. I&amp;#39;m hoping to find something like that for my book.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You can write any book you like.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s the goal.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Now, the last thing I&amp;#39;ll say is this -- what you DO read is influencing your genre.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is something I&amp;#39;ve been thinking more about recently. Recently I&amp;#39;ve been reading more historical fiction and would say that my book is more like urban &lt;del&gt;fiction&lt;/del&gt; fantasy that (ideally) reads like historical fiction or epic fantasy. The best comparison I could make would be a secondary world &lt;em&gt;American Gods&lt;/em&gt;, meaning having all the worldbuilding typically found in epic fantasy or historical fiction and that sort of scale.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So instead, next time you write a book, I&amp;#39;d recommend helping yourself by reading in that genre. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well I&amp;#39;m only 100k words into the book and it&amp;#39;s the first in a trilogy, so if I ever finish this one there are still two more to write. I&amp;#39;ve been trying to find some stuff in the genre that I like, and have had some false hits for books similar to mine, but there&amp;#39;s been one series that I think is promising (though not really similar to mine). There are many books in the genre that I do like and can&amp;#39;t really justify myself skipping what I enjoy reading to read stuff I don&amp;#39;t like.&lt;/p&gt;\n\n&lt;p&gt;Edit: wrong word&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg98t9m", "score_hidden": false, "stickied": false, "created": 1492211216.0, "created_utc": 1492182416.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96brf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MNBrian", "parent_id": "t1_dg94tcd", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "There were 727,000 self published books in 2015. Just in that year alone. Not including any other years, and books tend to stick around for quite a while. And lately, the number of genres and sub-genres you can find on Amazon is simply insane. The fact that a whole subcategory exists for Books &gt; Teens &gt; Science Fiction &amp; Fantasy &gt; Fantasy &gt; Dark Fantasy is honestly pretty stunning, and paths like this one are only getting deeper and diverging more.\n\nWhen I search goodreads for an unconventional subject, such as post apocalyptic unicorn books, I can absolutely always without fail find something ([like this](https://www.amazon.com/Ariel-Steven-R-Boyett/dp/0441017940)). \n\nNow granted, if you wrote a post apocalyptic unicorn novel with a male MC, a flaming sword, who rides on the back of a tortoise saving the world... then perhaps you aren't boiling your book down to its essence (post apocalyptic fantasy mashup). But if you are boiling it down to its essence, other books that are similar exist.\n\nSo I've heard this a fair amount -- and conventional wisdom says, at least with the millions and millions of books out there in the world, I can guarantee you that although your book hasn't been written, books on your subject matter have. \n\nI mean, often the point here is that we writers get offended when someone suggests you \"cant\" do something. You \"can't\" reinvent the romance genre. You \"can't\" write a fantasy post apocalyptic unicorn book and sell it. The truth is, you can do these things. You can write any book you like. But if you don't read in your genre, even if you don't like the genre, you're not doing yourself any favors. You are, in fact, hindering yourself -- because if you don't read in your genre then you have no idea what that genre's expectations are and who is doing innovative work in the genre.\n\nNow, the last thing I'll say is this -- what you DO read is influencing your genre. So say you want to reinvent romance and all you read is high fantasy. Well, what you're probably writing is a high fantasy book with a romance tilt. If you dislike a genre, that's a good sign that you probably aren't catering to its expectations. \n\nHopefully this helps! :) I totally get where you're coming from, and the truth is whether you read in your genre or not, you need to query the book you wrote. Maybe you've made it harder on yourself by not reading in your genre. But who cares. You wrote the book you wanted to read and you need to query that book to see if anyone else would be interested in it. :D\n\nWe can't go back and change the past. So instead, next time you write a book, I'd recommend helping yourself by reading in that genre. If you do, more power to you! If you don't, I'd still tell you to query that next book, and the one after, and the one after. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There were 727,000 self published books in 2015. Just in that year alone. Not including any other years, and books tend to stick around for quite a while. And lately, the number of genres and sub-genres you can find on Amazon is simply insane. The fact that a whole subcategory exists for Books &amp;gt; Teens &amp;gt; Science Fiction &amp;amp; Fantasy &amp;gt; Fantasy &amp;gt; Dark Fantasy is honestly pretty stunning, and paths like this one are only getting deeper and diverging more.&lt;/p&gt;\n\n&lt;p&gt;When I search goodreads for an unconventional subject, such as post apocalyptic unicorn books, I can absolutely always without fail find something (&lt;a href=\"https://www.amazon.com/Ariel-Steven-R-Boyett/dp/0441017940\"&gt;like this&lt;/a&gt;). &lt;/p&gt;\n\n&lt;p&gt;Now granted, if you wrote a post apocalyptic unicorn novel with a male MC, a flaming sword, who rides on the back of a tortoise saving the world... then perhaps you aren&amp;#39;t boiling your book down to its essence (post apocalyptic fantasy mashup). But if you are boiling it down to its essence, other books that are similar exist.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;ve heard this a fair amount -- and conventional wisdom says, at least with the millions and millions of books out there in the world, I can guarantee you that although your book hasn&amp;#39;t been written, books on your subject matter have. &lt;/p&gt;\n\n&lt;p&gt;I mean, often the point here is that we writers get offended when someone suggests you &amp;quot;cant&amp;quot; do something. You &amp;quot;can&amp;#39;t&amp;quot; reinvent the romance genre. You &amp;quot;can&amp;#39;t&amp;quot; write a fantasy post apocalyptic unicorn book and sell it. The truth is, you can do these things. You can write any book you like. But if you don&amp;#39;t read in your genre, even if you don&amp;#39;t like the genre, you&amp;#39;re not doing yourself any favors. You are, in fact, hindering yourself -- because if you don&amp;#39;t read in your genre then you have no idea what that genre&amp;#39;s expectations are and who is doing innovative work in the genre.&lt;/p&gt;\n\n&lt;p&gt;Now, the last thing I&amp;#39;ll say is this -- what you DO read is influencing your genre. So say you want to reinvent romance and all you read is high fantasy. Well, what you&amp;#39;re probably writing is a high fantasy book with a romance tilt. If you dislike a genre, that&amp;#39;s a good sign that you probably aren&amp;#39;t catering to its expectations. &lt;/p&gt;\n\n&lt;p&gt;Hopefully this helps! :) I totally get where you&amp;#39;re coming from, and the truth is whether you read in your genre or not, you need to query the book you wrote. Maybe you&amp;#39;ve made it harder on yourself by not reading in your genre. But who cares. You wrote the book you wanted to read and you need to query that book to see if anyone else would be interested in it. :D&lt;/p&gt;\n\n&lt;p&gt;We can&amp;#39;t go back and change the past. So instead, next time you write a book, I&amp;#39;d recommend helping yourself by reading in that genre. If you do, more power to you! If you don&amp;#39;t, I&amp;#39;d still tell you to query that next book, and the one after, and the one after. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg96brf", "score_hidden": false, "stickied": false, "created": 1492207998.0, "created_utc": 1492179198.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94tcd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rourensu", "parent_id": "t1_dg93io1", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "(Not OP)\n\n&gt;you want to read your type of book just to know that you aren't falling into tropes.\n\nWhat should one do if there may not really be another \"your type of book\" and/or you're not interested in the \"closest\" books or even the genre?", "edited": 1492177360.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;(Not OP)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;you want to read your type of book just to know that you aren&amp;#39;t falling into tropes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What should one do if there may not really be another &amp;quot;your type of book&amp;quot; and/or you&amp;#39;re not interested in the &amp;quot;closest&amp;quot; books or even the genre?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg94tcd", "score_hidden": false, "stickied": false, "created": 1492205817.0, "created_utc": 1492177017.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93io1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MNBrian", "parent_id": "t3_65bxft", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "So a few things here.\n\n1) Crow and DP hit on the fact already that you want to read your type of book just to know that you aren't falling into tropes.\n\n2) A Mercy is a wonderful book, but as you rightfully point out, it's not in your genre and it's certainly more than 5 years old (I want to say it was written around 2000). The goal of a comp title is like a good movie recommendation for a movie buff. You can't compare every sci-fi movie to Star Wars or you aren't really helping the movie buff understand what the film is actually about and actually feels like. And you certainly can't tell them that Jurassic Park is sort of like Star Wars and expect them to have any reaction other than confusion/anger/frustration. \n\nSo the takeaway here? If you're already ready to dive into the query pool, just don't include a comp title. You should probably try reading Station Eleven (one of the best post-apocalyptic books of the last 5 years that I've read). And you should probably just remove comps from your query. \n\nIf you're not yet ready to query and just working ahead on your query letter, I'd recommend immediately starting to dive into other post-apocalyptic books. You only hurt yourself if you haven't read your genre, because countless others have tried to write post-apocalyptic books and faced many of the problems you are facing, and they've dealt with them in certain ways. You want to know those tropes so you know if what you're doing is unique or not. \n\nHope this helps! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So a few things here.&lt;/p&gt;\n\n&lt;p&gt;1) Crow and DP hit on the fact already that you want to read your type of book just to know that you aren&amp;#39;t falling into tropes.&lt;/p&gt;\n\n&lt;p&gt;2) A Mercy is a wonderful book, but as you rightfully point out, it&amp;#39;s not in your genre and it&amp;#39;s certainly more than 5 years old (I want to say it was written around 2000). The goal of a comp title is like a good movie recommendation for a movie buff. You can&amp;#39;t compare every sci-fi movie to Star Wars or you aren&amp;#39;t really helping the movie buff understand what the film is actually about and actually feels like. And you certainly can&amp;#39;t tell them that Jurassic Park is sort of like Star Wars and expect them to have any reaction other than confusion/anger/frustration. &lt;/p&gt;\n\n&lt;p&gt;So the takeaway here? If you&amp;#39;re already ready to dive into the query pool, just don&amp;#39;t include a comp title. You should probably try reading Station Eleven (one of the best post-apocalyptic books of the last 5 years that I&amp;#39;ve read). And you should probably just remove comps from your query. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re not yet ready to query and just working ahead on your query letter, I&amp;#39;d recommend immediately starting to dive into other post-apocalyptic books. You only hurt yourself if you haven&amp;#39;t read your genre, because countless others have tried to write post-apocalyptic books and faced many of the problems you are facing, and they&amp;#39;ve dealt with them in certain ways. You want to know those tropes so you know if what you&amp;#39;re doing is unique or not. &lt;/p&gt;\n\n&lt;p&gt;Hope this helps! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg93io1", "score_hidden": false, "stickied": false, "created": 1492203709.0, "created_utc": 1492174909.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": "", "user_reports": [], "id": "dg9c9e5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg95e8b", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Yeah, definitely. Good luck :). I wish I could name some suggestions off the top of my head but I don't really read post-apoc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, definitely. Good luck :). I wish I could name some suggestions off the top of my head but I don&amp;#39;t really read post-apoc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9c9e5", "score_hidden": false, "stickied": false, "created": 1492215234.0, "created_utc": 1492186434.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg95e8b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EvaExotica", "parent_id": "t1_dg922rh", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Thank you for the detailed response and the examples!\nThat makes a lot of sense. I made assumptions and thought there could be exceptions with the comp titles if the writing styles and subject matter (outside of genre) were close enough, but you've pointed out to me that I have a lot to learn (gotta finish reading Janet Reid's Query Shark archives). \n\nAs a reader I'm not particular about genre, and draw inspiration from novels all over the place setting wise, but that obviously doesn't apply to the way the publishing world works. Thank you for making that clear for me.  \n\nI will definitely try to read more post-apocalyptic fiction before I query any agents. I have read a few post-apocalyptic novels (I've read more general Sci-Fi), but none of them really felt to me as if they \"fit\" the narrative style of my novel, so they felt like dishonest comparisons. But I'm inexperienced and my gut feeling doesn't necessarily apply. :P \n\nEdit: I wanted to add that the post-apocalyptic novels I've read have all been the very popular, well-known ones (e.g., *The Road*, *The Stand*, etc.) in addition to being published too long ago which, as you said, would also make them poor comp choices. \n\nAs I mentioned to  dying_pteradactyl, I may just avoid the comp titles this time around even when I do get some more post-apocalyptic titles read. Better safe than sorry for my first time querying! \n ", "edited": 1492178354.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the detailed response and the examples!\nThat makes a lot of sense. I made assumptions and thought there could be exceptions with the comp titles if the writing styles and subject matter (outside of genre) were close enough, but you&amp;#39;ve pointed out to me that I have a lot to learn (gotta finish reading Janet Reid&amp;#39;s Query Shark archives). &lt;/p&gt;\n\n&lt;p&gt;As a reader I&amp;#39;m not particular about genre, and draw inspiration from novels all over the place setting wise, but that obviously doesn&amp;#39;t apply to the way the publishing world works. Thank you for making that clear for me.  &lt;/p&gt;\n\n&lt;p&gt;I will definitely try to read more post-apocalyptic fiction before I query any agents. I have read a few post-apocalyptic novels (I&amp;#39;ve read more general Sci-Fi), but none of them really felt to me as if they &amp;quot;fit&amp;quot; the narrative style of my novel, so they felt like dishonest comparisons. But I&amp;#39;m inexperienced and my gut feeling doesn&amp;#39;t necessarily apply. :P &lt;/p&gt;\n\n&lt;p&gt;Edit: I wanted to add that the post-apocalyptic novels I&amp;#39;ve read have all been the very popular, well-known ones (e.g., &lt;em&gt;The Road&lt;/em&gt;, &lt;em&gt;The Stand&lt;/em&gt;, etc.) in addition to being published too long ago which, as you said, would also make them poor comp choices. &lt;/p&gt;\n\n&lt;p&gt;As I mentioned to  dying_pteradactyl, I may just avoid the comp titles this time around even when I do get some more post-apocalyptic titles read. Better safe than sorry for my first time querying! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg95e8b", "score_hidden": false, "stickied": false, "created": 1492206672.0, "created_utc": 1492177872.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": "", "user_reports": [], "id": "dg9lfll", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rourensu", "parent_id": "t1_dg9igya", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt;You still need to know where it goes on the shelf at a bookshop.\n\nAssuming there is a single \"fantasy\" section, then there, but when it comes to \"read books like yours and read your genre,\" that's where I'm stuck. I've tried narrowing down the genre, and according to others, it's urban fantasy based solely on the modern day setting (the wrapping). If I leave out the detail about the setting, people think it's epic fantasy, but when I tell the urban fantasy people the non-setting details, they say it's not urban fantasy. So if there's a epic-not-epic urban-not-urban fantasy section in the store, that's where it would go, front and center.\n\n&gt;Genre is your audience.\n\nWho would I imagine reading my book? People who like \"big fat epic fantasy books\" (Rothfuss) that are more grounded in reality and less about magic and more about humanity. (The GRRM crowd who are fine with non-medieval fantasy?) People who are interested in the \"epic\" part of epic fantasy—the deep, rich world, history, mythology, conflicts, and locations they can immerse themselves in. People who enjoy epic adventures and traveling and seeing different parts of the world. Readers of historical fiction who enjoyed *American Gods*.\n\nThis is where it seems to come into conflict with UF readers. I've personally heard from readers and authors of UF that the genre is not about the world(building) or the history or any of that stuff and is about the magic (and according to one person, the current trend is to have \"a strong focus on magic systems\"—something I have absolutely no interest in) and creatures coexisting with regular, modern people (this was one trope I strongly wanted to avoid). I was speaking with an UF author the other day and he said an agent yelled at him because he called his secondary world fantasy novel UF and she said in no unclear terms that UF is \"specifically set in the 'real world' with magic/fantasy elements,\" so that is another urban-not-urban fantasy issue as my world is secondary. Also, people disagree on how important the \"urban\" part of UF is as very little of my book takes place in a city and the character are usually traveling on the road.\n\n&gt;be able to know your specific niche inside out and back to front. When an agent requests your book, she needs to know what it's about and who she can pitch it to.\n\nI don't think I have a problem with this. Aside from my niche being represented entirely/solely by my book, I think I have a very good understanding of it. If anything, I elaborate on it too much and need to be able to discuss it effectively using fewer words.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You still need to know where it goes on the shelf at a bookshop.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Assuming there is a single &amp;quot;fantasy&amp;quot; section, then there, but when it comes to &amp;quot;read books like yours and read your genre,&amp;quot; that&amp;#39;s where I&amp;#39;m stuck. I&amp;#39;ve tried narrowing down the genre, and according to others, it&amp;#39;s urban fantasy based solely on the modern day setting (the wrapping). If I leave out the detail about the setting, people think it&amp;#39;s epic fantasy, but when I tell the urban fantasy people the non-setting details, they say it&amp;#39;s not urban fantasy. So if there&amp;#39;s a epic-not-epic urban-not-urban fantasy section in the store, that&amp;#39;s where it would go, front and center.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Genre is your audience.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Who would I imagine reading my book? People who like &amp;quot;big fat epic fantasy books&amp;quot; (Rothfuss) that are more grounded in reality and less about magic and more about humanity. (The GRRM crowd who are fine with non-medieval fantasy?) People who are interested in the &amp;quot;epic&amp;quot; part of epic fantasy—the deep, rich world, history, mythology, conflicts, and locations they can immerse themselves in. People who enjoy epic adventures and traveling and seeing different parts of the world. Readers of historical fiction who enjoyed &lt;em&gt;American Gods&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;This is where it seems to come into conflict with UF readers. I&amp;#39;ve personally heard from readers and authors of UF that the genre is not about the world(building) or the history or any of that stuff and is about the magic (and according to one person, the current trend is to have &amp;quot;a strong focus on magic systems&amp;quot;—something I have absolutely no interest in) and creatures coexisting with regular, modern people (this was one trope I strongly wanted to avoid). I was speaking with an UF author the other day and he said an agent yelled at him because he called his secondary world fantasy novel UF and she said in no unclear terms that UF is &amp;quot;specifically set in the &amp;#39;real world&amp;#39; with magic/fantasy elements,&amp;quot; so that is another urban-not-urban fantasy issue as my world is secondary. Also, people disagree on how important the &amp;quot;urban&amp;quot; part of UF is as very little of my book takes place in a city and the character are usually traveling on the road.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;be able to know your specific niche inside out and back to front. When an agent requests your book, she needs to know what it&amp;#39;s about and who she can pitch it to.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think I have a problem with this. Aside from my niche being represented entirely/solely by my book, I think I have a very good understanding of it. If anything, I elaborate on it too much and need to be able to discuss it effectively using fewer words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9lfll", "score_hidden": false, "stickied": false, "created": 1492225888.0, "created_utc": 1492197088.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9igya", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg9da7c", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Ok.\n\nYou still need to know where it goes on the shelf at a bookshop. Some books defy categorisation for a good reason, but a mish-mash of stuff sold as taking influences from a few bestsellers isn't going to make you look like you actually know what you're writing and who it would appeal to as much as actually being able to pinpoint your genre easily.\n\nGenre is your audience. If you don't know who they are, even if you self-publish, you have no idea who is going to be reading the book. If you don't know that, no-one else will.\n\nYou need to (a) start reading beyond the big blockbuster writers that everyone reads -- even if you can't find an exact match, you're better off than just knowing Gaiman and Martin and the other half a dozen big hitters; and (b) be able to know your specific niche inside out and back to front. When an agent requests your book, she needs to know what it's about and who she can pitch it to. Very few publishable debut books are so unique that you can get away with not being able to define it in broad genre terms, and if you simply tell the agent you're influenced by Martin and Gaiman she's going to think you haven't read any deeper in the fantasy genre and dismiss you as another amateur.\n\nFixing that issue is all on you, I'm afraid. The market is so competitive you need to know what you're doing before you start pitching. Saying you don't know what your comps are because your book transcends genre probably means you're actually not yet at professional level, because I think a professional writer would know roughly where their book would go in both a bookshop and an Amazon category, and you'd be able to answer the question, even if your comps are out of date. My book is steampunk/paranormal fantasy with strong religious and political themes. It's a fantasy *Gorky Park*, which means it's part mystery and part thriller. There, done. I can't use GP as a comp, and I have to keep reading to place the book more accurately in the current market, but it can be quickly categorised.\n\nNot being able to clearly pitch something is not in itself a bad thing, but it suggests you don't yet have the right manuscript to be your actual debut novel.      ", "edited": 1492194099.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok.&lt;/p&gt;\n\n&lt;p&gt;You still need to know where it goes on the shelf at a bookshop. Some books defy categorisation for a good reason, but a mish-mash of stuff sold as taking influences from a few bestsellers isn&amp;#39;t going to make you look like you actually know what you&amp;#39;re writing and who it would appeal to as much as actually being able to pinpoint your genre easily.&lt;/p&gt;\n\n&lt;p&gt;Genre is your audience. If you don&amp;#39;t know who they are, even if you self-publish, you have no idea who is going to be reading the book. If you don&amp;#39;t know that, no-one else will.&lt;/p&gt;\n\n&lt;p&gt;You need to (a) start reading beyond the big blockbuster writers that everyone reads -- even if you can&amp;#39;t find an exact match, you&amp;#39;re better off than just knowing Gaiman and Martin and the other half a dozen big hitters; and (b) be able to know your specific niche inside out and back to front. When an agent requests your book, she needs to know what it&amp;#39;s about and who she can pitch it to. Very few publishable debut books are so unique that you can get away with not being able to define it in broad genre terms, and if you simply tell the agent you&amp;#39;re influenced by Martin and Gaiman she&amp;#39;s going to think you haven&amp;#39;t read any deeper in the fantasy genre and dismiss you as another amateur.&lt;/p&gt;\n\n&lt;p&gt;Fixing that issue is all on you, I&amp;#39;m afraid. The market is so competitive you need to know what you&amp;#39;re doing before you start pitching. Saying you don&amp;#39;t know what your comps are because your book transcends genre probably means you&amp;#39;re actually not yet at professional level, because I think a professional writer would know roughly where their book would go in both a bookshop and an Amazon category, and you&amp;#39;d be able to answer the question, even if your comps are out of date. My book is steampunk/paranormal fantasy with strong religious and political themes. It&amp;#39;s a fantasy &lt;em&gt;Gorky Park&lt;/em&gt;, which means it&amp;#39;s part mystery and part thriller. There, done. I can&amp;#39;t use GP as a comp, and I have to keep reading to place the book more accurately in the current market, but it can be quickly categorised.&lt;/p&gt;\n\n&lt;p&gt;Not being able to clearly pitch something is not in itself a bad thing, but it suggests you don&amp;#39;t yet have the right manuscript to be your actual debut novel.      &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9igya", "score_hidden": false, "stickied": false, "created": 1492222329.0, "created_utc": 1492193529.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9da7c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rourensu", "parent_id": "t1_dg9cg1i", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The book's more like a mixture of different genres (or rather, an a la carte of things I like from my favorite genres/books), neither of which are from the \"technical\" genre my book would most likely be categorized as, so I doubt I'll come across anything similar as I'm not interested in the \"technical\" genre overall. (._.) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The book&amp;#39;s more like a mixture of different genres (or rather, an a la carte of things I like from my favorite genres/books), neither of which are from the &amp;quot;technical&amp;quot; genre my book would most likely be categorized as, so I doubt I&amp;#39;ll come across anything similar as I&amp;#39;m not interested in the &amp;quot;technical&amp;quot; genre overall. (._.) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9da7c", "score_hidden": false, "stickied": false, "created": 1492216359.0, "created_utc": 1492187559.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9cg1i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg951av", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Yeah...nope. Sorry. You can definitely namecheck people in less formal settings when describing your MS. The *Gorky Park* comp is because in GP, the mystery is solved relatively quickly, but the political fall-out is more significant to the climax. *The Invisible Library* appears to be the same thing, but it was published two years ago and is in my general genre and sub-genre, so works better as a formal comp. And it's not huge massive bestselling book. And my writing style is similar to Cogman's.\n\nJust keep reading. If you keep reading, you're bound to bump into something that's similar, or you just leave it out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah...nope. Sorry. You can definitely namecheck people in less formal settings when describing your MS. The &lt;em&gt;Gorky Park&lt;/em&gt; comp is because in GP, the mystery is solved relatively quickly, but the political fall-out is more significant to the climax. &lt;em&gt;The Invisible Library&lt;/em&gt; appears to be the same thing, but it was published two years ago and is in my general genre and sub-genre, so works better as a formal comp. And it&amp;#39;s not huge massive bestselling book. And my writing style is similar to Cogman&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;Just keep reading. If you keep reading, you&amp;#39;re bound to bump into something that&amp;#39;s similar, or you just leave it out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9cg1i", "score_hidden": false, "stickied": false, "created": 1492215430.0, "created_utc": 1492186630.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg951av", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rourensu", "parent_id": "t1_dg922rh", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt;You also don't want to make comparisons between yourself and a big name\n\nReferring to my work as \"secondary world\" *American Gods* has been the most accurate description I've been able to make after all these years. (._.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You also don&amp;#39;t want to make comparisons between yourself and a big name&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Referring to my work as &amp;quot;secondary world&amp;quot; &lt;em&gt;American Gods&lt;/em&gt; has been the most accurate description I&amp;#39;ve been able to make after all these years. (._.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg951av", "score_hidden": false, "stickied": false, "created": 1492206147.0, "created_utc": 1492177347.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg922rh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crowqueen", "parent_id": "t3_65bxft", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "You want to be reading in your genre. Comparisons are to do with where the book fits on the shelf; you don't want to make external comparisons unless both story and writing are similar and the title is an immediate contemporary. Toni Morrison is out because she's not your immediate market and she's not going to be a contemporary. You also don't want to make comparisons between yourself and a big name; I'd advise anyone querying epic fantasy not to compare themselves to epic fantasy names like Patrick Rothfuss, Joe Abercrombie, Brandon Sanderson etc, still less Tolkien, Rowling and Martin; the reason for comps is to target your book and demonstrate you know your immediate market. Find some good, solid, literary post-apoc to ground yourself and know who you're writing for, and use the newest ones as comps.\n\nAs DP has said, you don't need them, and a bad comp is worse than no comp, because you send out signals that you don't know your audience. I agree with DP about #ownvoices, but just don't go for something that makes you look like you don't know where your book sits. I would love to cite *Gorky Park*, *Cadfael* and *Name of the Rose* in my query letters because they're some of my big inspirations for this book. But they don't belong in a 2010s low/steampunk/paranormal fantasy query letter as much as *The Invisible Library* or *The Night Circus*, and to be honest I'm going to struggle with finding comp titles at all, because my work is also secondary world whereas a lot of steampunk fantasy (not all) is set in a version of the real world.\n\nErr on the side of caution; live by the phrase 'if in doubt, leave it out'. Read in the genre you're writing in. Read and find contemporary writers (published within the last 5 years or so). That's where comps will come from.         ", "edited": 1492172508.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You want to be reading in your genre. Comparisons are to do with where the book fits on the shelf; you don&amp;#39;t want to make external comparisons unless both story and writing are similar and the title is an immediate contemporary. Toni Morrison is out because she&amp;#39;s not your immediate market and she&amp;#39;s not going to be a contemporary. You also don&amp;#39;t want to make comparisons between yourself and a big name; I&amp;#39;d advise anyone querying epic fantasy not to compare themselves to epic fantasy names like Patrick Rothfuss, Joe Abercrombie, Brandon Sanderson etc, still less Tolkien, Rowling and Martin; the reason for comps is to target your book and demonstrate you know your immediate market. Find some good, solid, literary post-apoc to ground yourself and know who you&amp;#39;re writing for, and use the newest ones as comps.&lt;/p&gt;\n\n&lt;p&gt;As DP has said, you don&amp;#39;t need them, and a bad comp is worse than no comp, because you send out signals that you don&amp;#39;t know your audience. I agree with DP about #ownvoices, but just don&amp;#39;t go for something that makes you look like you don&amp;#39;t know where your book sits. I would love to cite &lt;em&gt;Gorky Park&lt;/em&gt;, &lt;em&gt;Cadfael&lt;/em&gt; and &lt;em&gt;Name of the Rose&lt;/em&gt; in my query letters because they&amp;#39;re some of my big inspirations for this book. But they don&amp;#39;t belong in a 2010s low/steampunk/paranormal fantasy query letter as much as &lt;em&gt;The Invisible Library&lt;/em&gt; or &lt;em&gt;The Night Circus&lt;/em&gt;, and to be honest I&amp;#39;m going to struggle with finding comp titles at all, because my work is also secondary world whereas a lot of steampunk fantasy (not all) is set in a version of the real world.&lt;/p&gt;\n\n&lt;p&gt;Err on the side of caution; live by the phrase &amp;#39;if in doubt, leave it out&amp;#39;. Read in the genre you&amp;#39;re writing in. Read and find contemporary writers (published within the last 5 years or so). That&amp;#39;s where comps will come from.         &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg922rh", "score_hidden": false, "stickied": false, "created": 1492200937.0, "created_utc": 1492172137.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": "", "user_reports": [], "id": "dg94occ", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "sarah_ahiers", "parent_id": "t1_dg949t2", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt; It seems like the #ownvoices tag covers more than just race, but sexuality and disability too.\n\nIt absolutely does. And if you are #OwnVoices I would definitely mention it in your query. One sentence in the bio section would work. Something like.\n\nMy GENRE TITLE is complete at WORD COUNT words and is an OwnVoices work involving race, sexuality, and disability.\n\n\nThat's it. You don't need to spell it out more than that.\n\n\nAlso, if you decide you do want to use the Hist Fic comp, make sure your other comp is much stronger and in the same genre. If you have one comp that's very strong and matches well, you can fudge a bit more with the other, as long as it doesn't make the agent confused.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It seems like the #ownvoices tag covers more than just race, but sexuality and disability too.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It absolutely does. And if you are #OwnVoices I would definitely mention it in your query. One sentence in the bio section would work. Something like.&lt;/p&gt;\n\n&lt;p&gt;My GENRE TITLE is complete at WORD COUNT words and is an OwnVoices work involving race, sexuality, and disability.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s it. You don&amp;#39;t need to spell it out more than that.&lt;/p&gt;\n\n&lt;p&gt;Also, if you decide you do want to use the Hist Fic comp, make sure your other comp is much stronger and in the same genre. If you have one comp that&amp;#39;s very strong and matches well, you can fudge a bit more with the other, as long as it doesn&amp;#39;t make the agent confused.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg94occ", "score_hidden": false, "stickied": false, "created": 1492205608.0, "created_utc": 1492176808.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg949t2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EvaExotica", "parent_id": "t1_dg91rgk", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "You're right -- the risk isn't worth it for the comparison. Thank you. \n\nAnd thank you so much for the link; I recall I'd briefly come across a mention on the Query Shark blog by Janet Reid about agents looking for stories about/by POC. I wasn't sure if that was something to mention. It seems like the #ownvoices tag covers more than just race, but sexuality and disability too.\n\nI have a disability and I am bisexual and a person of color. Many of the characters in my novel deal with racial issues, ableism and struggles with sexuality and gender identity. That seems like a lot to mention in a query letter, though, so perhaps I should just stick with the racial/ethnic component.\n \n\n  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right -- the risk isn&amp;#39;t worth it for the comparison. Thank you. &lt;/p&gt;\n\n&lt;p&gt;And thank you so much for the link; I recall I&amp;#39;d briefly come across a mention on the Query Shark blog by Janet Reid about agents looking for stories about/by POC. I wasn&amp;#39;t sure if that was something to mention. It seems like the #ownvoices tag covers more than just race, but sexuality and disability too.&lt;/p&gt;\n\n&lt;p&gt;I have a disability and I am bisexual and a person of color. Many of the characters in my novel deal with racial issues, ableism and struggles with sexuality and gender identity. That seems like a lot to mention in a query letter, though, so perhaps I should just stick with the racial/ethnic component.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg949t2", "score_hidden": false, "stickied": false, "created": 1492204975.0, "created_utc": 1492176175.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65bxft", "likes": null, "replies": "", "user_reports": [], "id": "dg9if2g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rourensu", "parent_id": "t1_dg9eqpz", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "That's somewhat what I have (for a lack of a better word) an \"issue\" with when it comes to \"genre\". If I wrote an epic fantasy novel comparable to the major contemporary books and read extensively in that genre (and broadly as well), but prior to submitting the MS I changed \"swords\" to \"guns\", \"chain mail\" to \"body armor\", \"torches\" with \"flashlights\", \"castles\" with \"skyscrapers\", and \"horses\" with \"cars\", does that make all the epic fantasy reading I did pointless and the book, again, for lack of a better word, worthless because I had never read urban fantasy? By changing the technology, it automatically changes the genre, so if everything not technologically related stays the same when it was epic fantasy, should that person have read extensively in urban fantasy instead and not bothered with epic fantasy (aside from supplemental reading)?\n\nI agree with what Neil Gaiman says about genre—there are cowboy books, and there are books with cowboys in it. He gave the analogy of a person going to see a musical, but there wasn't any singing—the person went to a musical expecting there to be singing, but there wasn't any. I don't agree that setting in and of itself should be the sole deciding factor for genre:\n\n&gt;If it was a cowboy novel, we'd need the fight in the saloon; we'd need the bad guy to come riding into town and the good guy to be waiting for him. A novel that happens to be in the Old West doesn't actually need to deliver any of those things—though it would leave readers of genre cowboy fiction feeling particularly disappointed, because they have not got the moments of specific satisfaction.\n\nIf I were writing \"a novel that happens to be set in the Old West,\" such as a historical romance, but the main elements that I'm writing about and focusing on aren't the \"cowboy\" tropes, must I read all the newly published cowboy novels in order to write it well? If one were to write a cowboy novel, should they include romance in their reading because the previous person published a romance book with cowboys in it?\n\nIf a person writes a romance book with cowboys in it, it doesn't necessarily mean it's a cowboy book. If a person writes a romance book with time travel, it doesn't necessarily mean it's a sci-fi book. If a person writes an epic fantasy book with modern technology, it doesn't necessarily mean it's an urban fantasy book. If a person writes an epic fantasy book in a historical period, it doesn't necessarily make it a historical book.\n\nThe main difference between the book I'm writing and the books I like and read is primarily the setting and level of technology. If I make it more traditional, that audience would enjoy it (assuming it's well-written, of course)—so I'm writing that kind of book with the tropes and elements expected from *that* genre, but changed the setting/technology. Publishing-wise, that one change puts it in an entirely different category regardless of anything else (though there is disagreement if it can even be considered the new genre in the first place). So that gives me different readers, tropes, and expectations—none of which I'm a fan of (I have no problems with the readers lol) nor were those my intentions when writing. If there are 10 factors that can be considered for genre classification, the book meets 9/10 of them for the original genre, but only 1/10 (the setting) for the new genre. Readers of the new genre would probably not be interested in it because it's not what they're expecting from that genre (like a non-singing musical) and that's not the genre I'm trying to write and in many ways I'm intentionally trying to avoid being similar to that genre. The internal structure, which I believe to be the most important and defining part, is in an external wrapping that is different, but everyone is just looking at the wrapping without taking into consideration what's inside.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s somewhat what I have (for a lack of a better word) an &amp;quot;issue&amp;quot; with when it comes to &amp;quot;genre&amp;quot;. If I wrote an epic fantasy novel comparable to the major contemporary books and read extensively in that genre (and broadly as well), but prior to submitting the MS I changed &amp;quot;swords&amp;quot; to &amp;quot;guns&amp;quot;, &amp;quot;chain mail&amp;quot; to &amp;quot;body armor&amp;quot;, &amp;quot;torches&amp;quot; with &amp;quot;flashlights&amp;quot;, &amp;quot;castles&amp;quot; with &amp;quot;skyscrapers&amp;quot;, and &amp;quot;horses&amp;quot; with &amp;quot;cars&amp;quot;, does that make all the epic fantasy reading I did pointless and the book, again, for lack of a better word, worthless because I had never read urban fantasy? By changing the technology, it automatically changes the genre, so if everything not technologically related stays the same when it was epic fantasy, should that person have read extensively in urban fantasy instead and not bothered with epic fantasy (aside from supplemental reading)?&lt;/p&gt;\n\n&lt;p&gt;I agree with what Neil Gaiman says about genre—there are cowboy books, and there are books with cowboys in it. He gave the analogy of a person going to see a musical, but there wasn&amp;#39;t any singing—the person went to a musical expecting there to be singing, but there wasn&amp;#39;t any. I don&amp;#39;t agree that setting in and of itself should be the sole deciding factor for genre:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If it was a cowboy novel, we&amp;#39;d need the fight in the saloon; we&amp;#39;d need the bad guy to come riding into town and the good guy to be waiting for him. A novel that happens to be in the Old West doesn&amp;#39;t actually need to deliver any of those things—though it would leave readers of genre cowboy fiction feeling particularly disappointed, because they have not got the moments of specific satisfaction.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If I were writing &amp;quot;a novel that happens to be set in the Old West,&amp;quot; such as a historical romance, but the main elements that I&amp;#39;m writing about and focusing on aren&amp;#39;t the &amp;quot;cowboy&amp;quot; tropes, must I read all the newly published cowboy novels in order to write it well? If one were to write a cowboy novel, should they include romance in their reading because the previous person published a romance book with cowboys in it?&lt;/p&gt;\n\n&lt;p&gt;If a person writes a romance book with cowboys in it, it doesn&amp;#39;t necessarily mean it&amp;#39;s a cowboy book. If a person writes a romance book with time travel, it doesn&amp;#39;t necessarily mean it&amp;#39;s a sci-fi book. If a person writes an epic fantasy book with modern technology, it doesn&amp;#39;t necessarily mean it&amp;#39;s an urban fantasy book. If a person writes an epic fantasy book in a historical period, it doesn&amp;#39;t necessarily make it a historical book.&lt;/p&gt;\n\n&lt;p&gt;The main difference between the book I&amp;#39;m writing and the books I like and read is primarily the setting and level of technology. If I make it more traditional, that audience would enjoy it (assuming it&amp;#39;s well-written, of course)—so I&amp;#39;m writing that kind of book with the tropes and elements expected from &lt;em&gt;that&lt;/em&gt; genre, but changed the setting/technology. Publishing-wise, that one change puts it in an entirely different category regardless of anything else (though there is disagreement if it can even be considered the new genre in the first place). So that gives me different readers, tropes, and expectations—none of which I&amp;#39;m a fan of (I have no problems with the readers lol) nor were those my intentions when writing. If there are 10 factors that can be considered for genre classification, the book meets 9/10 of them for the original genre, but only 1/10 (the setting) for the new genre. Readers of the new genre would probably not be interested in it because it&amp;#39;s not what they&amp;#39;re expecting from that genre (like a non-singing musical) and that&amp;#39;s not the genre I&amp;#39;m trying to write and in many ways I&amp;#39;m intentionally trying to avoid being similar to that genre. The internal structure, which I believe to be the most important and defining part, is in an external wrapping that is different, but everyone is just looking at the wrapping without taking into consideration what&amp;#39;s inside.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9if2g", "score_hidden": false, "stickied": false, "created": 1492222266.0, "created_utc": 1492193466.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9eqpz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crowqueen", "parent_id": "t1_dg99nuk", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "If you start comparing yourself to disparate big names, the agents will think you've got a rip-off or mash-up and you know nothing about your actual market, because you read ASOIAF and started writing a clone.\n\nYou can't cheat. You need to actually read what you're writing. Agents are after the writers who have done their homework and can act professionally to develop their skills and understanding -- not those looking for a shortcut.\n\nIf you're not reading widely in the genre you're trying to write, you will never find the comp titles you need. Seriously: you get out what you put in. If you're not putting in the effort to get to know your own genre deeper than a few of the bestsellers, then you probably won't get enough out of it to be writing at a professional level.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you start comparing yourself to disparate big names, the agents will think you&amp;#39;ve got a rip-off or mash-up and you know nothing about your actual market, because you read ASOIAF and started writing a clone.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t cheat. You need to actually read what you&amp;#39;re writing. Agents are after the writers who have done their homework and can act professionally to develop their skills and understanding -- not those looking for a shortcut.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re not reading widely in the genre you&amp;#39;re trying to write, you will never find the comp titles you need. Seriously: you get out what you put in. If you&amp;#39;re not putting in the effort to get to know your own genre deeper than a few of the bestsellers, then you probably won&amp;#39;t get enough out of it to be writing at a professional level.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg9eqpz", "score_hidden": false, "stickied": false, "created": 1492218002.0, "created_utc": 1492189202.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99nuk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rourensu", "parent_id": "t1_dg91rgk", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Instead of comp titles, could you mention the authors/works/genres that were part of the \"mix\" for your book (eg the politics of *ASOIAF*, the adventure of *American Gods*, and the richness of historical fiction)? Or is that just as frowned upon as a bad comp title?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Instead of comp titles, could you mention the authors/works/genres that were part of the &amp;quot;mix&amp;quot; for your book (eg the politics of &lt;em&gt;ASOIAF&lt;/em&gt;, the adventure of &lt;em&gt;American Gods&lt;/em&gt;, and the richness of historical fiction)? Or is that just as frowned upon as a bad comp title?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg99nuk", "score_hidden": false, "stickied": false, "created": 1492212242.0, "created_utc": 1492183442.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91rgk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dying_pteradactyl", "parent_id": "t3_65bxft", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "If in doubt with comp titles - leave them out.\n\nHaving no comp titles doesn't hurt you. Having bad comp titles (or what an agent might consider bad comp titles) does.\n\nSo if in doubt, leave them out. Because why risk it?\n\nWhat you might want to look into is the #ownvoices hashtag/movement because as a POC whose book deals with race issues, that might be something you want to include in your query.\n\nFrom Janet Reids blog:\n\nhttp://jetreidliterary.blogspot.com.au/2017/01/im-black-my-book-isnt.html", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If in doubt with comp titles - leave them out.&lt;/p&gt;\n\n&lt;p&gt;Having no comp titles doesn&amp;#39;t hurt you. Having bad comp titles (or what an agent might consider bad comp titles) does.&lt;/p&gt;\n\n&lt;p&gt;So if in doubt, leave them out. Because why risk it?&lt;/p&gt;\n\n&lt;p&gt;What you might want to look into is the #ownvoices hashtag/movement because as a POC whose book deals with race issues, that might be something you want to include in your query.&lt;/p&gt;\n\n&lt;p&gt;From Janet Reids blog:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://jetreidliterary.blogspot.com.au/2017/01/im-black-my-book-isnt.html\"&gt;http://jetreidliterary.blogspot.com.au/2017/01/im-black-my-book-isnt.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dg91rgk", "score_hidden": false, "stickied": false, "created": 1492200243.0, "created_utc": 1492171443.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]