[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys, your advice is greatly appreciated!&lt;/p&gt;\n\n&lt;p&gt;I try to keep a journal and pen my thoughts and feelings down 1-3 times a week. I try to write about significant things that had happened recently, or the thoughts/emotions that are running through me at that point. However, I notice a few things:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;I feel ashamed/embarrassed/self-loathing to re-read my own writing. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I don&amp;#39;t understand how other people feel enlightened re-reading their previous entries. Many times, I don&amp;#39;t even feel like turning the leaf to my past entries. It&amp;#39;s not that I write about gory/obnoxious stuff (they&amp;#39;re mostly about my feelings towards what happened in my life). I just feel a sense of shame and in-confidence with myself and my thoughts.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;I feel that even while I am writing, I am still avoiding my own, true feelings of the matter. I feel that I am still refusing to engage directly with my own feelings, and finding excuses to avoid engaging with them.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Instead of writing at length about how I actually feel about something, or what I think I should do henceforth, or what I had done previously, I tend to veer off into asking myself questions such as &amp;quot;why do I feel this way?&amp;quot;, &amp;quot;what is it that is causing this?&amp;quot;, and &amp;quot;why can&amp;#39;t I just buck up and do it?&amp;quot; without any resolution in the end of my writing. When I force myself not to write those (inconsequential?) questions down, my mind seems to veer off into thinking of ways to systematise my journalling (e.g. implementing a Getting-Things-Done system across Evernote, Google Keep, etc etc) and testing them out instead).&lt;/p&gt;\n\n&lt;p&gt;I think the core of what I experience is a sense of self-shame and avoidance of my own feelings. I would really appreciate if anyone could share with me their experience on this, how to overcome the insecurity and eventually confront my own feelings head on.&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys, your advice is greatly appreciated!\n\nI try to keep a journal and pen my thoughts and feelings down 1-3 times a week. I try to write about significant things that had happened recently, or the thoughts/emotions that are running through me at that point. However, I notice a few things:\n\n1. I feel ashamed/embarrassed/self-loathing to re-read my own writing. \n\nI don't understand how other people feel enlightened re-reading their previous entries. Many times, I don't even feel like turning the leaf to my past entries. It's not that I write about gory/obnoxious stuff (they're mostly about my feelings towards what happened in my life). I just feel a sense of shame and in-confidence with myself and my thoughts.\n\n2. I feel that even while I am writing, I am still avoiding my own, true feelings of the matter. I feel that I am still refusing to engage directly with my own feelings, and finding excuses to avoid engaging with them.\n\nInstead of writing at length about how I actually feel about something, or what I think I should do henceforth, or what I had done previously, I tend to veer off into asking myself questions such as \"why do I feel this way?\", \"what is it that is causing this?\", and \"why can't I just buck up and do it?\" without any resolution in the end of my writing. When I force myself not to write those (inconsequential?) questions down, my mind seems to veer off into thinking of ways to systematise my journalling (e.g. implementing a Getting-Things-Done system across Evernote, Google Keep, etc etc) and testing them out instead).\n\nI think the core of what I experience is a sense of self-shame and avoidance of my own feelings. I would really appreciate if anyone could share with me their experience on this, how to overcome the insecurity and eventually confront my own feelings head on.\n\nThank you!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65j6ss", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "johnconnor92", "saved": false, "mod_reports": [], "name": "t3_65j6ss", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/65j6ss/feeling_insecure_with_my_own_journalling/", "num_reports": null, "locked": false, "stickied": false, "created": 1492293468.0, "url": "https://www.reddit.com/r/writing/comments/65j6ss/feeling_insecure_with_my_own_journalling/", "author_flair_text": null, "quarantine": false, "title": "Feeling insecure with my own journalling", "created_utc": 1492264668.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65j6ss", "likes": null, "replies": "", "user_reports": [], "id": "dgas9xy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "spacehurps", "parent_id": "t3_65j6ss", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt;I feel ashamed/embarrassed/self-loathing to re-read my own writing.\n\nYou're not alone. I avoid looking at my journal entries until it's been years. Sometimes I never look. Maybe someday, you'll feel enough distance from that past you, and feel comfortable enough to take a peek into younger you's head. And if you don't, that's also ok.\n\n&gt;I think the core of what I experience is a sense of self-shame and avoidance of my own feelings.\n\nJournaling doesn't have to be about confessing the depths of your soul, then reading those very intimate thoughts. Some people like it, others don't. There's nothing wrong with glossing over things you don't wanna write about, or not reading things back, or even burning diaries when you're done [like Soli.](http://www.meekcomic.com/comic/3-03/) They're your journals. You write what you want, you do what you want.\n\nHere's something to try if you wanna open up more: Tell yourself you won't be reading this entry. Ever. Try and pour as much emotional truth into it as you can, and keep your promise until you're ready to see what you've written.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I feel ashamed/embarrassed/self-loathing to re-read my own writing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re not alone. I avoid looking at my journal entries until it&amp;#39;s been years. Sometimes I never look. Maybe someday, you&amp;#39;ll feel enough distance from that past you, and feel comfortable enough to take a peek into younger you&amp;#39;s head. And if you don&amp;#39;t, that&amp;#39;s also ok.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think the core of what I experience is a sense of self-shame and avoidance of my own feelings.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Journaling doesn&amp;#39;t have to be about confessing the depths of your soul, then reading those very intimate thoughts. Some people like it, others don&amp;#39;t. There&amp;#39;s nothing wrong with glossing over things you don&amp;#39;t wanna write about, or not reading things back, or even burning diaries when you&amp;#39;re done &lt;a href=\"http://www.meekcomic.com/comic/3-03/\"&gt;like Soli.&lt;/a&gt; They&amp;#39;re your journals. You write what you want, you do what you want.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s something to try if you wanna open up more: Tell yourself you won&amp;#39;t be reading this entry. Ever. Try and pour as much emotional truth into it as you can, and keep your promise until you&amp;#39;re ready to see what you&amp;#39;ve written.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgas9xy", "score_hidden": false, "stickied": false, "created": 1492299952.0, "created_utc": 1492271152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65j6ss", "likes": null, "replies": "", "user_reports": [], "id": "dgau1ww", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "navifrog", "parent_id": "t3_65j6ss", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I have started journaling in simple notepad documents that I don't save. It gets me in the habit of writing even the shameful feelings down, because there is no chance I'll read it again. It won't even exist in a few minutes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have started journaling in simple notepad documents that I don&amp;#39;t save. It gets me in the habit of writing even the shameful feelings down, because there is no chance I&amp;#39;ll read it again. It won&amp;#39;t even exist in a few minutes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgau1ww", "score_hidden": false, "stickied": false, "created": 1492302427.0, "created_utc": 1492273627.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65j6ss", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65j6ss", "likes": null, "replies": "", "user_reports": [], "id": "dgbq7ym", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "johnconnor92", "parent_id": "t1_dgayqn1", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt;  It sounds as if you're continuing to journal despite these feelings, and to me that indicates that as much as you don't like some of these thoughts, you still feel the need to make them known -- even if it's just to a blank sheet of paper. \n\nHaving a need to pen a certain thought down doesn't mean I am making any  progress with the dilemma in hand. I do not see any resolution in asking myself \"why can't I just buck up?\" or \"why can't I just go ahead and do it?\". I just can't see how I am helping  myself progress with this approach. Does that mean I need to change my style of journalling? Am I over concerning myself with the methodology?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It sounds as if you&amp;#39;re continuing to journal despite these feelings, and to me that indicates that as much as you don&amp;#39;t like some of these thoughts, you still feel the need to make them known -- even if it&amp;#39;s just to a blank sheet of paper. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Having a need to pen a certain thought down doesn&amp;#39;t mean I am making any  progress with the dilemma in hand. I do not see any resolution in asking myself &amp;quot;why can&amp;#39;t I just buck up?&amp;quot; or &amp;quot;why can&amp;#39;t I just go ahead and do it?&amp;quot;. I just can&amp;#39;t see how I am helping  myself progress with this approach. Does that mean I need to change my style of journalling? Am I over concerning myself with the methodology?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbq7ym", "score_hidden": false, "stickied": false, "created": 1492348841.0, "created_utc": 1492320041.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgayqn1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dr_Death_Defy24", "parent_id": "t3_65j6ss", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I have a stack of notebooks and journals, mostly full, that's almost 8 inches high. I've been journaling near-daily for almost 7 years. I've been doing it a while, and it's changed quite a bit in that time. For once, this is something I can actually provide a little insight into, so I'll do my best.\n\n&gt; I feel ashamed/embarrassed/self-loathing to re-read my own writing.\n\nThen don't read your own journal. I started in middle school, and back then, I was a spiteful, mean, human being. I hated all the people around me, and made it very clear, so I hate reading my thoughts from that part of my life. However, I'm still happy I wrote it. I've never read any of my journals cover to cover, but I've flipped through a few of them to get an idea of progress, and that works for me. Some people want to go back and read their life from start to finish like a book, and that's great. Other people just want what I've termed a \"live memoir,\" where it's written a bit like a memoir, but never intended to be read. Get your thoughts down on paper, sort out whatever problems you're having, but don't feel stressed over not revisiting them later.\n\n&gt; I feel that even while I am writing, I am still avoiding my own, true feelings of the matter. I feel that I am still refusing to engage directly with my own feelings, and finding excuses to avoid engaging with them.\n\nAt the risk of sounding like a certain Lebowski, my advice is to go with the flow. Whatever words your hand decides to put down on paper are always the right ones when it comes to keeping a journal. If your mind strays to certain things, whether you like them or not, those must be the right things. It sounds as if you're continuing to journal despite these feelings, and to me that indicates that as much as you don't like some of these thoughts, you still feel the need to make them known -- even if it's just to a blank sheet of paper. \n\nPeople are a little like books. Sure, you can open to the last chapter, and maybe you'll get the gist of what's going on, but you'll have cheated yourself out of some vital stuff, and you're just making it harder on yourself. And for what? So you can get done with a leisure activity faster? That's ridiculous. My point in that analogy, is that, like anything, just give it some time. Reading yourself (no pun intended) isnt an easy task, but I swear it'll get easier. If you're a naturally introspective person (like me), then it will come a little easier, but it will still take a little effort.\n\nDoes that mean my best advice is to just let go? Does that mean I don't have any magic words, or better yet, a magic wand? Yep. That's my best advice, and I don't have either. However, the length of this should indicate at least some level of passion, so if you're reading this going \"Yes, I *know* that, now how do I get there???\" then I encourage you to PM me if you want some more specific help. I love wittering on about this, and I wont complain.\n\nGood luck in your journals!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a stack of notebooks and journals, mostly full, that&amp;#39;s almost 8 inches high. I&amp;#39;ve been journaling near-daily for almost 7 years. I&amp;#39;ve been doing it a while, and it&amp;#39;s changed quite a bit in that time. For once, this is something I can actually provide a little insight into, so I&amp;#39;ll do my best.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I feel ashamed/embarrassed/self-loathing to re-read my own writing.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Then don&amp;#39;t read your own journal. I started in middle school, and back then, I was a spiteful, mean, human being. I hated all the people around me, and made it very clear, so I hate reading my thoughts from that part of my life. However, I&amp;#39;m still happy I wrote it. I&amp;#39;ve never read any of my journals cover to cover, but I&amp;#39;ve flipped through a few of them to get an idea of progress, and that works for me. Some people want to go back and read their life from start to finish like a book, and that&amp;#39;s great. Other people just want what I&amp;#39;ve termed a &amp;quot;live memoir,&amp;quot; where it&amp;#39;s written a bit like a memoir, but never intended to be read. Get your thoughts down on paper, sort out whatever problems you&amp;#39;re having, but don&amp;#39;t feel stressed over not revisiting them later.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I feel that even while I am writing, I am still avoiding my own, true feelings of the matter. I feel that I am still refusing to engage directly with my own feelings, and finding excuses to avoid engaging with them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;At the risk of sounding like a certain Lebowski, my advice is to go with the flow. Whatever words your hand decides to put down on paper are always the right ones when it comes to keeping a journal. If your mind strays to certain things, whether you like them or not, those must be the right things. It sounds as if you&amp;#39;re continuing to journal despite these feelings, and to me that indicates that as much as you don&amp;#39;t like some of these thoughts, you still feel the need to make them known -- even if it&amp;#39;s just to a blank sheet of paper. &lt;/p&gt;\n\n&lt;p&gt;People are a little like books. Sure, you can open to the last chapter, and maybe you&amp;#39;ll get the gist of what&amp;#39;s going on, but you&amp;#39;ll have cheated yourself out of some vital stuff, and you&amp;#39;re just making it harder on yourself. And for what? So you can get done with a leisure activity faster? That&amp;#39;s ridiculous. My point in that analogy, is that, like anything, just give it some time. Reading yourself (no pun intended) isnt an easy task, but I swear it&amp;#39;ll get easier. If you&amp;#39;re a naturally introspective person (like me), then it will come a little easier, but it will still take a little effort.&lt;/p&gt;\n\n&lt;p&gt;Does that mean my best advice is to just let go? Does that mean I don&amp;#39;t have any magic words, or better yet, a magic wand? Yep. That&amp;#39;s my best advice, and I don&amp;#39;t have either. However, the length of this should indicate at least some level of passion, so if you&amp;#39;re reading this going &amp;quot;Yes, I &lt;em&gt;know&lt;/em&gt; that, now how do I get there???&amp;quot; then I encourage you to PM me if you want some more specific help. I love wittering on about this, and I wont complain.&lt;/p&gt;\n\n&lt;p&gt;Good luck in your journals!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgayqn1", "score_hidden": false, "stickied": false, "created": 1492308851.0, "created_utc": 1492280051.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65j6ss", "likes": null, "replies": "", "user_reports": [], "id": "dgbavxc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "UltraFlyingTurtle", "parent_id": "t3_65j6ss", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Feeling ashamed when rereading your own writing is actually common. There's nothing wrong with that. Rather than thinking of a journal as an object to preserve your thoughts, instead think of it as a vehicle to let you write. It's the process of writing, not the words itself, that I find therapeutic. Get the words out -- who cares if they are right or wrong.\n\nA journal is a private thing. It's not meant to be published. Perhaps in some cases, not meant to be reread. It's your playground to experiment. Look at ways on how you can free yourself. If you find rereading your thoughts are hard, then don't for now.\n\nIf you find it is hard to confront the truth, then don't. Instead let other people confront them for you. Make up stories. That person who cut in line, or bullied you, change his name, turn him into a monster, and create a hero that challenges the monster. \n\nThey say artists need to stare into the sun and confront the harsh truths about the world and about themselves but stare too long and it may destroy you. One way to let people find truths about themselves is through make believe, through the act of pretending, through fiction.\n\nSo if you can't talk about something in depth because of self-loathing, create a character and let him or her talk. I've been keeping a journal for years, but sometimes speaking about very personal things can feel too raw, too vulnerable, too burning. So I steer toward fiction. Create a scene that is similar but with different people. Add a \"what if\" moment and change it. It still lets me be honest through other characters, moreover it allows me to be empathic toward people that hurt me or I dislike as I have to create characters based on them. One step in being a great writer is to show empathy not just to your likable characters but to the ones you hate, too.\n\nThe point is, if you are unable tell the truth, then lie and use imagination in your journal in order to tell the truth. Distance yourself from the thought or feeling, and use another voice, another character, to let them channel your innermost feelings. That way it doesn't feel like it's coming from you, and just that little emotional narrative distance may let you examine your feelings a bit more objectively because it's a character, a representation of someone, an aspect of your imagination, but not of you directly.\n\nEdit: typos. \n\n", "edited": 1492325853.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Feeling ashamed when rereading your own writing is actually common. There&amp;#39;s nothing wrong with that. Rather than thinking of a journal as an object to preserve your thoughts, instead think of it as a vehicle to let you write. It&amp;#39;s the process of writing, not the words itself, that I find therapeutic. Get the words out -- who cares if they are right or wrong.&lt;/p&gt;\n\n&lt;p&gt;A journal is a private thing. It&amp;#39;s not meant to be published. Perhaps in some cases, not meant to be reread. It&amp;#39;s your playground to experiment. Look at ways on how you can free yourself. If you find rereading your thoughts are hard, then don&amp;#39;t for now.&lt;/p&gt;\n\n&lt;p&gt;If you find it is hard to confront the truth, then don&amp;#39;t. Instead let other people confront them for you. Make up stories. That person who cut in line, or bullied you, change his name, turn him into a monster, and create a hero that challenges the monster. &lt;/p&gt;\n\n&lt;p&gt;They say artists need to stare into the sun and confront the harsh truths about the world and about themselves but stare too long and it may destroy you. One way to let people find truths about themselves is through make believe, through the act of pretending, through fiction.&lt;/p&gt;\n\n&lt;p&gt;So if you can&amp;#39;t talk about something in depth because of self-loathing, create a character and let him or her talk. I&amp;#39;ve been keeping a journal for years, but sometimes speaking about very personal things can feel too raw, too vulnerable, too burning. So I steer toward fiction. Create a scene that is similar but with different people. Add a &amp;quot;what if&amp;quot; moment and change it. It still lets me be honest through other characters, moreover it allows me to be empathic toward people that hurt me or I dislike as I have to create characters based on them. One step in being a great writer is to show empathy not just to your likable characters but to the ones you hate, too.&lt;/p&gt;\n\n&lt;p&gt;The point is, if you are unable tell the truth, then lie and use imagination in your journal in order to tell the truth. Distance yourself from the thought or feeling, and use another voice, another character, to let them channel your innermost feelings. That way it doesn&amp;#39;t feel like it&amp;#39;s coming from you, and just that little emotional narrative distance may let you examine your feelings a bit more objectively because it&amp;#39;s a character, a representation of someone, an aspect of your imagination, but not of you directly.&lt;/p&gt;\n\n&lt;p&gt;Edit: typos. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbavxc", "score_hidden": false, "stickied": false, "created": 1492325603.0, "created_utc": 1492296803.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65j6ss", "likes": null, "replies": "", "user_reports": [], "id": "dgasmv7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "B_Cypher", "parent_id": "t3_65j6ss", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Also, an idea to help, is to tell your parents or something close your TRUE feelings in the moment if they ask, \"how was your day?\" Or \"how are you?\" It's important to start being truthful with other people before you can be truthful with yourself. I've learned this after struggling for years with depression and social anxiety.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, an idea to help, is to tell your parents or something close your TRUE feelings in the moment if they ask, &amp;quot;how was your day?&amp;quot; Or &amp;quot;how are you?&amp;quot; It&amp;#39;s important to start being truthful with other people before you can be truthful with yourself. I&amp;#39;ve learned this after struggling for years with depression and social anxiety.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgasmv7", "score_hidden": false, "stickied": false, "created": 1492300457.0, "created_utc": 1492271657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65j6ss", "likes": null, "replies": "", "user_reports": [], "id": "dgbs007", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrTemple", "parent_id": "t3_65j6ss", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "PLEASE read Natalie Goldberg's Writing Down the Bones. \n\nPreferably the new copy, which she annotated 15 years after the original. (Actually it was the Audible version she read then commented on so many years later. I recommend the audiobook, so you can listen to it while doing chores/driving/etc.)\n\nGoldberg describes her writing practice, one of daily journaling with no set motivation or goal. This is not the sort of writing I want to do, yet I still found the book incredibly rewarding. \n\nHers is a strong message of self-love, of acceptance of one's self as a writer (in whatever form that takes). \n\nIt's a difficult book to describe, but it has been inspirational for me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PLEASE read Natalie Goldberg&amp;#39;s Writing Down the Bones. &lt;/p&gt;\n\n&lt;p&gt;Preferably the new copy, which she annotated 15 years after the original. (Actually it was the Audible version she read then commented on so many years later. I recommend the audiobook, so you can listen to it while doing chores/driving/etc.)&lt;/p&gt;\n\n&lt;p&gt;Goldberg describes her writing practice, one of daily journaling with no set motivation or goal. This is not the sort of writing I want to do, yet I still found the book incredibly rewarding. &lt;/p&gt;\n\n&lt;p&gt;Hers is a strong message of self-love, of acceptance of one&amp;#39;s self as a writer (in whatever form that takes). &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a difficult book to describe, but it has been inspirational for me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbs007", "score_hidden": false, "stickied": false, "created": 1492352725.0, "created_utc": 1492323925.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]