[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m gearing up to write my first novel in two weeks, which I&amp;#39;m prepared to throw myself into in order to do justice to the story premise I have in mind. The premise is wide open in terms of the themes it deals with, such as 1) What is the essence of a person? 2) Are we born predisposed for good or evil?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m exploring this through an inherently supernatural gothic idea, within the confines of genre: though the idea spans a few genres in multiple stories within an overarching story (think &amp;#39;The Illustrated Man&amp;#39; by Bradbury). &lt;/p&gt;\n\n&lt;p&gt;As opposed to this premise I&amp;#39;m working with, I have a separate premise which doesn&amp;#39;t have such high themes: the idea being a genre film similar to &amp;#39;Hunger Games&amp;#39; or &amp;#39;Battle Royale&amp;#39; -- except if I were writing this story I don&amp;#39;t feel I would be as equipped to stick with the story until the end because it isn&amp;#39;t offering up themes and something with gravitas to work with. At best I think I could write a novella on the premise. &lt;/p&gt;\n\n&lt;p&gt;Does anyone have a similar relationship to their premises? I don&amp;#39;t feel I&amp;#39;m explaining myself very well but hopefully this is enough to start a discussion. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm gearing up to write my first novel in two weeks, which I'm prepared to throw myself into in order to do justice to the story premise I have in mind. The premise is wide open in terms of the themes it deals with, such as 1) What is the essence of a person? 2) Are we born predisposed for good or evil?\n\nI'm exploring this through an inherently supernatural gothic idea, within the confines of genre: though the idea spans a few genres in multiple stories within an overarching story (think 'The Illustrated Man' by Bradbury). \n\nAs opposed to this premise I'm working with, I have a separate premise which doesn't have such high themes: the idea being a genre film similar to 'Hunger Games' or 'Battle Royale' -- except if I were writing this story I don't feel I would be as equipped to stick with the story until the end because it isn't offering up themes and something with gravitas to work with. At best I think I could write a novella on the premise. \n\nDoes anyone have a similar relationship to their premises? I don't feel I'm explaining myself very well but hopefully this is enough to start a discussion. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65o6si", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Breadloaf24601", "saved": false, "mod_reports": [], "name": "t3_65o6si", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/65o6si/story_premises_worth_exploring/", "num_reports": null, "locked": false, "stickied": false, "created": 1492360280.0, "url": "https://www.reddit.com/r/writing/comments/65o6si/story_premises_worth_exploring/", "author_flair_text": null, "quarantine": false, "title": "Story Premises Worth Exploring", "created_utc": 1492331480.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": "", "user_reports": [], "id": "dgbxfts", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sweetyi", "parent_id": "t1_dgbxem9", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "&gt;I will concede that there is no one way to approach writing and that what works for me may not work for others.  \n  \nOf course! I hope I didn't come across as trying to lecture on the subject; I'm just putting my thoughts out there for the sake of discussion, especially because theme has been something I've struggled over in the past. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I will concede that there is no one way to approach writing and that what works for me may not work for others.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Of course! I hope I didn&amp;#39;t come across as trying to lecture on the subject; I&amp;#39;m just putting my thoughts out there for the sake of discussion, especially because theme has been something I&amp;#39;ve struggled over in the past. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbxfts", "score_hidden": false, "stickied": false, "created": 1492369576.0, "created_utc": 1492340776.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxem9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Breadloaf24601", "parent_id": "t1_dgbws05", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Well what you've said is interesting because I know if I were to write a more traditional 'epic' fantasy: I would use my experience dealing with relatives fighting over who gets what out of an inheritance and just balloon the drama to fit a fantasy world. That would be my basis for grounding the story in character first, world-building second. In this way I'm not writing to theme, but instead tapping into my own personal experience of a tumultuous time in my life -- which I think adds real potency to a story. \n\nI will concede that there is no one way to approach writing and that what works for me may not work for others. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well what you&amp;#39;ve said is interesting because I know if I were to write a more traditional &amp;#39;epic&amp;#39; fantasy: I would use my experience dealing with relatives fighting over who gets what out of an inheritance and just balloon the drama to fit a fantasy world. That would be my basis for grounding the story in character first, world-building second. In this way I&amp;#39;m not writing to theme, but instead tapping into my own personal experience of a tumultuous time in my life -- which I think adds real potency to a story. &lt;/p&gt;\n\n&lt;p&gt;I will concede that there is no one way to approach writing and that what works for me may not work for others. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbxem9", "score_hidden": false, "stickied": false, "created": 1492369462.0, "created_utc": 1492340662.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbws05", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sweetyi", "parent_id": "t1_dgbw7xx", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Well, I'd argue that the point of exploring a theme is to extrapolate on your own experiences with it -- to ask a question (i.e. \"Are we born predisposed for good or evil?\") and then probe it in a way that pushes it towards a logical conclusion. Suppose  you decided you did want to write about submission to authority and build on your personal experience of a student-teacher relationship. Depending on your point of view, and level of cynicism, your story could come to the dystopian conclusion that absolute authority will result in a stagnant population of unquestioning drone-like people; or maybe you would explore the theme and decide that absolute authority will inevitably lead to rebellion against the status quo, and even make the argument that authoritarianism serves a useful purpose in that it always creates the environment necessary for radical change. You don't have to personally be living in scenes from The Wall to explore your own personal experiences.  \n  \nI do get what you mean about becoming apathetic over your writing from lack of personal investment. I think we're just polar opposite writers when it comes to theme! At one time, I really *really* wanted to write an allegorical fantasy about growing up and becoming an adult, but I got so hung up on how to actually write the theme, that I lost all of my interest in writing the story. My own personal investment was in the characters and world I was creating, and worrying over trying to make a theme coherent and elegant throughout the story just really bummed me out. If I'm not quite getting your point though, maybe I could understand better with more details about the kind of writing you *do* like.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I&amp;#39;d argue that the point of exploring a theme is to extrapolate on your own experiences with it -- to ask a question (i.e. &amp;quot;Are we born predisposed for good or evil?&amp;quot;) and then probe it in a way that pushes it towards a logical conclusion. Suppose  you decided you did want to write about submission to authority and build on your personal experience of a student-teacher relationship. Depending on your point of view, and level of cynicism, your story could come to the dystopian conclusion that absolute authority will result in a stagnant population of unquestioning drone-like people; or maybe you would explore the theme and decide that absolute authority will inevitably lead to rebellion against the status quo, and even make the argument that authoritarianism serves a useful purpose in that it always creates the environment necessary for radical change. You don&amp;#39;t have to personally be living in scenes from The Wall to explore your own personal experiences.  &lt;/p&gt;\n\n&lt;p&gt;I do get what you mean about becoming apathetic over your writing from lack of personal investment. I think we&amp;#39;re just polar opposite writers when it comes to theme! At one time, I really &lt;em&gt;really&lt;/em&gt; wanted to write an allegorical fantasy about growing up and becoming an adult, but I got so hung up on how to actually write the theme, that I lost all of my interest in writing the story. My own personal investment was in the characters and world I was creating, and worrying over trying to make a theme coherent and elegant throughout the story just really bummed me out. If I&amp;#39;m not quite getting your point though, maybe I could understand better with more details about the kind of writing you &lt;em&gt;do&lt;/em&gt; like.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbws05", "score_hidden": false, "stickied": false, "created": 1492367366.0, "created_utc": 1492338566.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": "", "user_reports": [], "id": "dgclx0c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "noveler7", "parent_id": "t1_dgbw7xx", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I have a similar urge when I plan to write, and I do find it helpful when determining what type of characters I want to explore, what their conflicts will be, etc. I need to feel a deeper emotional and intellectual attachment to the story to make it a sustainable project. I've found that, in the end, the act of writing (and rewriting...and rewriting...and rewriting) will help sharpen those themes anyway, so I find it most helpful to just start with a few broader issues first, then explore them through the prose and the characters from multiple angles and trim what doesn't work for the story in the revision. As long as you prioritize the story and avoid getting so philosophical that it slows the narrative, I think the theme-to-character-and-plot type of approach certainly has its place.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a similar urge when I plan to write, and I do find it helpful when determining what type of characters I want to explore, what their conflicts will be, etc. I need to feel a deeper emotional and intellectual attachment to the story to make it a sustainable project. I&amp;#39;ve found that, in the end, the act of writing (and rewriting...and rewriting...and rewriting) will help sharpen those themes anyway, so I find it most helpful to just start with a few broader issues first, then explore them through the prose and the characters from multiple angles and trim what doesn&amp;#39;t work for the story in the revision. As long as you prioritize the story and avoid getting so philosophical that it slows the narrative, I think the theme-to-character-and-plot type of approach certainly has its place.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgclx0c", "score_hidden": false, "stickied": false, "created": 1492407103.0, "created_utc": 1492378303.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbw7xx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Breadloaf24601", "parent_id": "t1_dgbvtlk", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Writing stories for me is something that I want to have purpose in. I wouldn't want to write a story that someone else could also write: like a  Battle Royale / Hunger Games story with whatever twist I might add to suit my own interests. The themes you talk about, everything surrounding theses settings, such as the dangers of submission to authority and so on, are not personal things I could write with confidence or a desire to understand on a greater level because I haven't dealt with these things in a meaningful way in my own life. I know what its like to have to submit to authority on a mundane student versus teacher, or employee versus manager, but that's the limit of it -- the danger is not being sincere when writing these themes. The writing of my own which I have enjoyed re-reading has always been deeply personal and sincere in the telling of the story -- I find it very difficult to continue writing a straight up genre-premise because there's no personal element for me to power me through the apathy which strikes when writing becomes a chore. Does that make sense? \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Writing stories for me is something that I want to have purpose in. I wouldn&amp;#39;t want to write a story that someone else could also write: like a  Battle Royale / Hunger Games story with whatever twist I might add to suit my own interests. The themes you talk about, everything surrounding theses settings, such as the dangers of submission to authority and so on, are not personal things I could write with confidence or a desire to understand on a greater level because I haven&amp;#39;t dealt with these things in a meaningful way in my own life. I know what its like to have to submit to authority on a mundane student versus teacher, or employee versus manager, but that&amp;#39;s the limit of it -- the danger is not being sincere when writing these themes. The writing of my own which I have enjoyed re-reading has always been deeply personal and sincere in the telling of the story -- I find it very difficult to continue writing a straight up genre-premise because there&amp;#39;s no personal element for me to power me through the apathy which strikes when writing becomes a chore. Does that make sense? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbw7xx", "score_hidden": false, "stickied": false, "created": 1492365437.0, "created_utc": 1492336637.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvtlk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "sweetyi", "parent_id": "t3_65o6si", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I used to struggle with theme, morals, and motif a lot during the planning stages of my writing, but ultimately I think you run a high risk of coming off preachy, obtuse, or just plain boring if you approach your project with a predetermined theme you want to get across. That's not to sound condescending of course, you might be great at writing from a pre-constructed set of themes -- I'm just personally not so hot at it. I think if you're trying to create the moral before the story, you can end up like Ayn Rand beating someone over the head with the free market for the entirety of the novel.  \n  \nThere's also nothing wrong with using the editorial process to polish up themes that will be naturally emergent from your story. Example: You're writing a premise similar to Battle Royale but don't think it's dealing with higher themes? I disagree! In a setting like that (basing these suggestions off Battle Royale itself), you can end up dealing with the savagery of human nature, the compassion of humanity in the worst of times, the dangers of submission to authority, the consequences of society normalizing the cruel and unjust, the ethical turmoil of compromising one's morality for the sake of survival... There's a lot of potential themes that can occur and once you're done, you get to look back and decide which ones you want to polish and have shine through as the defining moral of your writing.  \n  \nAgain I really hope I'm not starting to sound like I'm being a condescending asshole or something, but when you use the word 'gravitas' that makes me recoil just a bit. I'd be very wary of making that your goal above telling the story itself -- Lots of people want to write the next *1984*, *Beyond Good and Evil*, or *Notes from the Underground*; very few are able to get away with putting the cart before the horse like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to struggle with theme, morals, and motif a lot during the planning stages of my writing, but ultimately I think you run a high risk of coming off preachy, obtuse, or just plain boring if you approach your project with a predetermined theme you want to get across. That&amp;#39;s not to sound condescending of course, you might be great at writing from a pre-constructed set of themes -- I&amp;#39;m just personally not so hot at it. I think if you&amp;#39;re trying to create the moral before the story, you can end up like Ayn Rand beating someone over the head with the free market for the entirety of the novel.  &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also nothing wrong with using the editorial process to polish up themes that will be naturally emergent from your story. Example: You&amp;#39;re writing a premise similar to Battle Royale but don&amp;#39;t think it&amp;#39;s dealing with higher themes? I disagree! In a setting like that (basing these suggestions off Battle Royale itself), you can end up dealing with the savagery of human nature, the compassion of humanity in the worst of times, the dangers of submission to authority, the consequences of society normalizing the cruel and unjust, the ethical turmoil of compromising one&amp;#39;s morality for the sake of survival... There&amp;#39;s a lot of potential themes that can occur and once you&amp;#39;re done, you get to look back and decide which ones you want to polish and have shine through as the defining moral of your writing.  &lt;/p&gt;\n\n&lt;p&gt;Again I really hope I&amp;#39;m not starting to sound like I&amp;#39;m being a condescending asshole or something, but when you use the word &amp;#39;gravitas&amp;#39; that makes me recoil just a bit. I&amp;#39;d be very wary of making that your goal above telling the story itself -- Lots of people want to write the next &lt;em&gt;1984&lt;/em&gt;, &lt;em&gt;Beyond Good and Evil&lt;/em&gt;, or &lt;em&gt;Notes from the Underground&lt;/em&gt;; very few are able to get away with putting the cart before the horse like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbvtlk", "score_hidden": false, "stickied": false, "created": 1492364027.0, "created_utc": 1492335227.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": "", "user_reports": [], "id": "dgcg2ua", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "laxnut90", "parent_id": "t1_dgc0w9o", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It is a fine line.  I agree you should never \"manufacture\" problems, but legitimate controversies will have characters on opposite sides.  Having opposite sides meet/clash is almost always necessary to resolve a controversy in any context.\n\nI enjoy writing characters that go against my own personal opinions.  I write multiple protagonists and try to place them on sides such that no character agrees with me, the author, all the time.  I find that this strategy makes my characters stronger since I relate partially to all of them while avoiding Mary Sue territory.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is a fine line.  I agree you should never &amp;quot;manufacture&amp;quot; problems, but legitimate controversies will have characters on opposite sides.  Having opposite sides meet/clash is almost always necessary to resolve a controversy in any context.&lt;/p&gt;\n\n&lt;p&gt;I enjoy writing characters that go against my own personal opinions.  I write multiple protagonists and try to place them on sides such that no character agrees with me, the author, all the time.  I find that this strategy makes my characters stronger since I relate partially to all of them while avoiding Mary Sue territory.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgcg2ua", "score_hidden": false, "stickied": false, "created": 1492399523.0, "created_utc": 1492370723.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0w9o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Breadloaf24601", "parent_id": "t1_dgbzh8n", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I've tried writing stories manufacturing controversies and problems for my characters in order to give them something to do. However this way of writing is boring for me. I wouldn't be interested in creating an ensemble of characters to fit the various sides of a given conflict: that would be paramount to television writing: which prolongs conflict at the expense of narrative impact. \n\nI would rather write a book that is incredibly biased with characters that offer up the most interesting point of view (including villainous characters). I think being called preachy is a risk worth taking, and expected, if you want to write something that is supposed to have a real impact on the reader. If I'm passive writing the story then I should expect the reader to be just as passive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve tried writing stories manufacturing controversies and problems for my characters in order to give them something to do. However this way of writing is boring for me. I wouldn&amp;#39;t be interested in creating an ensemble of characters to fit the various sides of a given conflict: that would be paramount to television writing: which prolongs conflict at the expense of narrative impact. &lt;/p&gt;\n\n&lt;p&gt;I would rather write a book that is incredibly biased with characters that offer up the most interesting point of view (including villainous characters). I think being called preachy is a risk worth taking, and expected, if you want to write something that is supposed to have a real impact on the reader. If I&amp;#39;m passive writing the story then I should expect the reader to be just as passive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgc0w9o", "score_hidden": false, "stickied": false, "created": 1492378150.0, "created_utc": 1492349350.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzh8n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "laxnut90", "parent_id": "t3_65o6si", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It is oftentimes better to start with characters instead of themes.  Themes will develop naturally if you have strong characters that conflict with each other.  I would recommend inserting one or several problems/controversies in your novel and placing perfectly reasonable characters on both sides of the issue.  Otherwise, you will get a book like 1984 or Atlas Shrugged which are good books, but are extremely preachy and have themes which overpower the characters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is oftentimes better to start with characters instead of themes.  Themes will develop naturally if you have strong characters that conflict with each other.  I would recommend inserting one or several problems/controversies in your novel and placing perfectly reasonable characters on both sides of the issue.  Otherwise, you will get a book like 1984 or Atlas Shrugged which are good books, but are extremely preachy and have themes which overpower the characters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgbzh8n", "score_hidden": false, "stickied": false, "created": 1492375196.0, "created_utc": 1492346396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65o6si", "likes": null, "replies": "", "user_reports": [], "id": "dgcdhy2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KeeperofAmmut7", "parent_id": "t3_65o6si", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "*The premise is wide open in terms of the themes it deals with, such as 1) What is the essence of a person? 2) Are we born predisposed for good or evil?*  \n\nMy own current novel is quite close to this premise, except for it's an experiment with identical twins. One is from an abusive, dirt poor, hillbilly single parent home and the other is from upper middle class, 2 parent, sahm home, and how each turns out. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;The premise is wide open in terms of the themes it deals with, such as 1) What is the essence of a person? 2) Are we born predisposed for good or evil?&lt;/em&gt;  &lt;/p&gt;\n\n&lt;p&gt;My own current novel is quite close to this premise, except for it&amp;#39;s an experiment with identical twins. One is from an abusive, dirt poor, hillbilly single parent home and the other is from upper middle class, 2 parent, sahm home, and how each turns out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgcdhy2", "score_hidden": false, "stickied": false, "created": 1492396071.0, "created_utc": 1492367271.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]