[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "writing", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve got 2 characters in my story. One is a primary character, while the person he bickers with is more of a secondary character, but an important character nonetheless.&lt;/p&gt;\n\n&lt;p&gt;They have clashing personalities and don&amp;#39;t get along very well (especially in the beginning) but work together and the workplace is a main setting. &lt;/p&gt;\n\n&lt;p&gt;I want them to bicker and it actually feels natural for them to do so when I&amp;#39;m writing but I worry its forced sometimes or will come off as annoying. How can I avoid this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've got 2 characters in my story. One is a primary character, while the person he bickers with is more of a secondary character, but an important character nonetheless.\n\n\nThey have clashing personalities and don't get along very well (especially in the beginning) but work together and the workplace is a main setting. \n\n\nI want them to bicker and it actually feels natural for them to do so when I'm writing but I worry its forced sometimes or will come off as annoying. How can I avoid this?\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65tg3k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "dancingonbroadway", "saved": false, "mod_reports": [], "name": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "approved_by": null, "over_18": false, "domain": "self.writing", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh2n", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/writing/comments/65tg3k/writing_characters_who_bicker_without_it_being/", "num_reports": null, "locked": false, "stickied": false, "created": 1492430825.0, "url": "https://www.reddit.com/r/writing/comments/65tg3k/writing_characters_who_bicker_without_it_being/", "author_flair_text": null, "quarantine": false, "title": "Writing characters who bicker without it being forced/annoying?", "created_utc": 1492402025.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 10, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgd3co7", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "spacehurps", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I'm writing this exact dynamic right now. :D One thing to consider is *why* they're bickering over a particular thing. Is it underlying frustration bubbling out and they're taking it out on each other? Are they genuinely at odds over something? Are they just giving each other shit just because? Are they arguing because there's something unmanageably big going on, and bickering is something they can handle right now?\n\nWhat are they saying, and what aren't they saying? Do they mean what they say? Let their real thoughts bleed out indirectly through their interactions.\n\nKenny vs. Spenny and Peep Show might be of help to you. Both feature belligerent friends who bicker constantly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m writing this exact dynamic right now. :D One thing to consider is &lt;em&gt;why&lt;/em&gt; they&amp;#39;re bickering over a particular thing. Is it underlying frustration bubbling out and they&amp;#39;re taking it out on each other? Are they genuinely at odds over something? Are they just giving each other shit just because? Are they arguing because there&amp;#39;s something unmanageably big going on, and bickering is something they can handle right now?&lt;/p&gt;\n\n&lt;p&gt;What are they saying, and what aren&amp;#39;t they saying? Do they mean what they say? Let their real thoughts bleed out indirectly through their interactions.&lt;/p&gt;\n\n&lt;p&gt;Kenny vs. Spenny and Peep Show might be of help to you. Both feature belligerent friends who bicker constantly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgd3co7", "score_hidden": false, "stickied": false, "created": 1492431179.0, "created_utc": 1492402379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgd9y5f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NikStalwart", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "If it feels forced, it probably is.\n\nBickering isn't bad itself, but the context and the amount of time you devote to it can take it from amusing to annoying in less time than it takes to delete an ebook and skip the recycle bin.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it feels forced, it probably is.&lt;/p&gt;\n\n&lt;p&gt;Bickering isn&amp;#39;t bad itself, but the context and the amount of time you devote to it can take it from amusing to annoying in less time than it takes to delete an ebook and skip the recycle bin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgd9y5f", "score_hidden": false, "stickied": false, "created": 1492445947.0, "created_utc": 1492417147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgddtue", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pablohoneyy", "parent_id": "t1_dgdbfml", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Exactly this. If your premise is strong, and the facts underlying the characters' disagreements are compelling enough, the bickering serves as an entertaining way for me, the reader, to get closer to the conflict at the centre of your story. The bickering itself isn't really the focus.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly this. If your premise is strong, and the facts underlying the characters&amp;#39; disagreements are compelling enough, the bickering serves as an entertaining way for me, the reader, to get closer to the conflict at the centre of your story. The bickering itself isn&amp;#39;t really the focus.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgddtue", "score_hidden": false, "stickied": false, "created": 1492458210.0, "created_utc": 1492429410.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbfml", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sweetyi", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The important part is the subtext. You ever heard the expression that if someone is getting mad at you over a silly little thing, that's probably not what is actually bothering them?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The important part is the subtext. You ever heard the expression that if someone is getting mad at you over a silly little thing, that&amp;#39;s probably not what is actually bothering them?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgdbfml", "score_hidden": false, "stickied": false, "created": 1492451083.0, "created_utc": 1492422283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgdhc7w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lngwstksgk", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "It's all about the backstory and the history the two fighting characters have between them, the way the fight falls into familiar lines they both recognize, but can't always stop. Watch this little bit, a man visiting his sister-in-law whom he dislikes, and how they spar while maintaining apparent politeness.\n\n&gt; “It’s so wonderful you were able to make it tonight.” She beamed at him, her actions no more genuine than his own. “I had, of course, heard of your recent difficulties, and am glad to see they are no barrier to you.”\n\n&gt;Edward forced himself to return her smile. Very little could be done beyond maintaining external civility. “Your concern is refreshing, Emily. All of your children are well?” He allowed her to take his coat.\n\n&gt;Her face darkened for a moment, but she maintained the same cheerful tone. “Both of my dear ones are well, thank you. Young George will be at the meeting this evening as well, and you can see for yourself.”\n\nYou can tell something's up here between these two, but let me fill in the backstory that would be clear if you had this bit in context:\n\nEmily is Edward's sister-in-law, and they have never gotten along because Edward disagrees strongly with Emily's husband's politics. Meanwhile, Emily and her husband had a disabled first-born child, whom they abandoned. This child was taken in by a family member, and Edward helped to raise the child and is now mentoring him in a profession. Edward's health is poor, a fact which makes him \"less than\" in Emily's eyes, and about which he is very sensitive. Now knowing that, does the dialogue change in your eyes?\n\nEdit: Last paragraph, as I decided I could explain better.", "edited": 1492437053.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s all about the backstory and the history the two fighting characters have between them, the way the fight falls into familiar lines they both recognize, but can&amp;#39;t always stop. Watch this little bit, a man visiting his sister-in-law whom he dislikes, and how they spar while maintaining apparent politeness.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“It’s so wonderful you were able to make it tonight.” She beamed at him, her actions no more genuine than his own. “I had, of course, heard of your recent difficulties, and am glad to see they are no barrier to you.”&lt;/p&gt;\n\n&lt;p&gt;Edward forced himself to return her smile. Very little could be done beyond maintaining external civility. “Your concern is refreshing, Emily. All of your children are well?” He allowed her to take his coat.&lt;/p&gt;\n\n&lt;p&gt;Her face darkened for a moment, but she maintained the same cheerful tone. “Both of my dear ones are well, thank you. Young George will be at the meeting this evening as well, and you can see for yourself.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You can tell something&amp;#39;s up here between these two, but let me fill in the backstory that would be clear if you had this bit in context:&lt;/p&gt;\n\n&lt;p&gt;Emily is Edward&amp;#39;s sister-in-law, and they have never gotten along because Edward disagrees strongly with Emily&amp;#39;s husband&amp;#39;s politics. Meanwhile, Emily and her husband had a disabled first-born child, whom they abandoned. This child was taken in by a family member, and Edward helped to raise the child and is now mentoring him in a profession. Edward&amp;#39;s health is poor, a fact which makes him &amp;quot;less than&amp;quot; in Emily&amp;#39;s eyes, and about which he is very sensitive. Now knowing that, does the dialogue change in your eyes?&lt;/p&gt;\n\n&lt;p&gt;Edit: Last paragraph, as I decided I could explain better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgdhc7w", "score_hidden": false, "stickied": false, "created": 1492464929.0, "created_utc": 1492436129.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgdjmkl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jarmzet", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "Spread the arguing out across more than one scene and sort of limit the parts of the arguing you show to new, interesting, or important parts.  And have it gradually progress/get meaner/etc.  Like make the arguing uglier or more personal or have thing happen or be discovered that have an impact on the argument.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Spread the arguing out across more than one scene and sort of limit the parts of the arguing you show to new, interesting, or important parts.  And have it gradually progress/get meaner/etc.  Like make the arguing uglier or more personal or have thing happen or be discovered that have an impact on the argument.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgdjmkl", "score_hidden": false, "stickied": false, "created": 1492468242.0, "created_utc": 1492439442.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgdlwme", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tilfordkage", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "I had a co-worker that I actually despised. But here's the thing - when we worked together, we would actually get along, even though he felt the same way about me. Why? Because we had no one else to talk to. So when one of us would have a customer that was a pain, we had little choice about who we could complain to. We still got into plenty arguments at the end of the night or when it wasn't busy. \n\nThat's how co-workers bicker. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a co-worker that I actually despised. But here&amp;#39;s the thing - when we worked together, we would actually get along, even though he felt the same way about me. Why? Because we had no one else to talk to. So when one of us would have a customer that was a pain, we had little choice about who we could complain to. We still got into plenty arguments at the end of the night or when it wasn&amp;#39;t busy. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s how co-workers bicker. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgdlwme", "score_hidden": false, "stickied": false, "created": 1492471124.0, "created_utc": 1492442324.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgdprps", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TonyDiGerolamo", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "This is something I do a lot in my writing and I think I'm pretty good at it.  Here's my tips:\n\nFirst, their bickering should be organic.  It should always tie into the \"core\" of the character.  In It's Always Sunny in Philadelphia, the characters bicker about specific things, usually about how they will look or how much money they will make.  For Charlie, it always comes back to the Waitress, for Dennis, getting laid, for Frank, making money, etc.  \n\nOnce you've exhausted the obvious tie-ins, it's then fun to pick something that doesn't sound like money (like when Frank was all about guns), but then reveal it was really about his \"core\" (when it was revealed Frank ginned up the fear in the episode so people would buy guns so he could make money).  \n\nYou should have more than one thing for the characters to argue over.  The main thing, but they subsets of things that are important, but not THAT important.\n\nFinally, you can only take the bickering so far.  I'll have the dialogue go back and forth a couple of exchanges, break it up with some description of action, then go back and then end it.\n\nIn improv, we always heighten, so bickering should heighten, especially if you're going for comedy.  You pace of heightening shouldn't be too fast, especially if you're writing a novel, but each individual argument should heighten to a point.\n\nAnd understand that there is a reason characters bicker.  Usually it's because they like to do it.  The bigger reveal is that your characters probably like each other or need to bicker for some reason.  Maybe it's because they're avoiding something else, like dealing with their feelings.\n\nHope that helps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is something I do a lot in my writing and I think I&amp;#39;m pretty good at it.  Here&amp;#39;s my tips:&lt;/p&gt;\n\n&lt;p&gt;First, their bickering should be organic.  It should always tie into the &amp;quot;core&amp;quot; of the character.  In It&amp;#39;s Always Sunny in Philadelphia, the characters bicker about specific things, usually about how they will look or how much money they will make.  For Charlie, it always comes back to the Waitress, for Dennis, getting laid, for Frank, making money, etc.  &lt;/p&gt;\n\n&lt;p&gt;Once you&amp;#39;ve exhausted the obvious tie-ins, it&amp;#39;s then fun to pick something that doesn&amp;#39;t sound like money (like when Frank was all about guns), but then reveal it was really about his &amp;quot;core&amp;quot; (when it was revealed Frank ginned up the fear in the episode so people would buy guns so he could make money).  &lt;/p&gt;\n\n&lt;p&gt;You should have more than one thing for the characters to argue over.  The main thing, but they subsets of things that are important, but not THAT important.&lt;/p&gt;\n\n&lt;p&gt;Finally, you can only take the bickering so far.  I&amp;#39;ll have the dialogue go back and forth a couple of exchanges, break it up with some description of action, then go back and then end it.&lt;/p&gt;\n\n&lt;p&gt;In improv, we always heighten, so bickering should heighten, especially if you&amp;#39;re going for comedy.  You pace of heightening shouldn&amp;#39;t be too fast, especially if you&amp;#39;re writing a novel, but each individual argument should heighten to a point.&lt;/p&gt;\n\n&lt;p&gt;And understand that there is a reason characters bicker.  Usually it&amp;#39;s because they like to do it.  The bigger reveal is that your characters probably like each other or need to bicker for some reason.  Maybe it&amp;#39;s because they&amp;#39;re avoiding something else, like dealing with their feelings.&lt;/p&gt;\n\n&lt;p&gt;Hope that helps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgdprps", "score_hidden": false, "stickied": false, "created": 1492475538.0, "created_utc": 1492446738.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgduicc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "novelconcepts", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The problem with bickering is that it can fill up the pages of a novel and yet add absolutely nothing. Even in 100k, you don't have a lot of words to spare away from telling the story, showing the world, and developing the characters. Once you show your characters stoop to the level of bickering, what do all those words that are added to the story do to the actual story?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem with bickering is that it can fill up the pages of a novel and yet add absolutely nothing. Even in 100k, you don&amp;#39;t have a lot of words to spare away from telling the story, showing the world, and developing the characters. Once you show your characters stoop to the level of bickering, what do all those words that are added to the story do to the actual story?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgduicc", "score_hidden": false, "stickied": false, "created": 1492480781.0, "created_utc": 1492451981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh2n", "removal_reason": null, "link_id": "t3_65tg3k", "likes": null, "replies": "", "user_reports": [], "id": "dgdurc4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "superpositionquantum", "parent_id": "t3_65tg3k", "subreddit_name_prefixed": "r/writing", "controversiality": 0, "body": "The secret is to make it entertaining. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The secret is to make it entertaining. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "writing", "name": "t1_dgdurc4", "score_hidden": false, "stickied": false, "created": 1492481054.0, "created_utc": 1492452254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]