[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;staying in a small hut by the beach, me and my girlfriend stumbled upon someone selling Acid cookies. We each took a cookie (150μg) and chilled in the hut, smoking until the acid kicked in. As we came up, I myself saw hardly anything, my gf on the other hand stated she saw UV lighting, i.e. purple everywhere: she felt like purple was part of the universe.  as we emerge from out huts we started to walk down through the bar onto the beach. The bar was made for ACID as epic music coupled with strange hangings and bright colours gave our LSD fuelled brains amazing visuals. we sat down, my gf was holding on for dear life as the music, wind and beauty of our surroundings made her feel like she was going to be blown away. we giggled, we couldn&amp;#39;t stop, to us everything was unbelievable and hilarious - to others, we were mental. Just as we said &amp;quot;it just can&amp;#39;t get more ridiculous&amp;quot; a woman with a basket of bracelets balanced on her head calm waltzing in, we broke down and asked &amp;quot;is this for real?&amp;quot;, it was, it was perfect timing. The sun hot our faces, people were smiling at us and we felt like we were in a hollywood movie, this day was already perfect. We decided to walk down the beach which was crazy, as we looked it seemed like the whole beach was on a loop... eternal and never-ending. after walking 5 minutes we stopped and looked back...&amp;quot;do you remember where we are staying&amp;quot; my gf said... &amp;quot;no... should we turn back?, &amp;quot;no, let&amp;#39;s carry on&amp;quot; she replied. so we did, this is when it got crazier. I looked up at the trees on the beach, it was as if they were on fire, falling towards me! GREEN FIRE! it was crazy, I was mesmerized, it felt like they were enveloping me. We carried on walking when i felt reality start to take hold and my perception of normal returned. The waveyness and the burning trees had gone. I said to my gf that the acid must have worn off and she turns to me and says &amp;quot;no it hasn&amp;#39;t&amp;quot;... then it all came back with the vengeance as my sight went insane, the roaring trees burned green yet again and the sound of the ocean was overbearing. I run to the nearest sunbed and take a minute to ponder on what happened. Then we decided to turn back as the started to set and made a mission to find out hut. After much confusion and some panic we found the hut again a though a swim in the sea would be a nice place to peak. as we entered the water it was like the perfect ending to the perfect day. It was warm it was welcoming it was spectacular. it looked as if it was a Japanese tidal painting; pristine blue waves was scarred onto the back of a burned orange sky.We sat in the water as the sun went down it was truly mystical; sweet house music playing in the background as we bobbed around on the horizon. At night, my gf lay on the beach and stared up at the stars, she said they were coming down at her as if they were shooting down they straight back up into the sky. she lay there until the tide came in, she said she felt as if the universe was coming down to hug her. as we walked back down the beach to out hut the noises of the night were really prominent. A guy playing classical music on a piano at one bar, to the sounds of a BBQ roaring at another to the fire dancers at the end of the beach made it a remarkable ending to a perfect day. we sat down and attempted to eat food, and it tasted magnificent. We just ended up cuddling to liquid house and post rock at the end of the trip! btw, when we looked up to the sky I saw hexagons in the sky while my gf was the flower of life - truly beautiful. we will never forget this day, it was EPIC.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "staying in a small hut by the beach, me and my girlfriend stumbled upon someone selling Acid cookies. We each took a cookie (150μg) and chilled in the hut, smoking until the acid kicked in. As we came up, I myself saw hardly anything, my gf on the other hand stated she saw UV lighting, i.e. purple everywhere: she felt like purple was part of the universe.  as we emerge from out huts we started to walk down through the bar onto the beach. The bar was made for ACID as epic music coupled with strange hangings and bright colours gave our LSD fuelled brains amazing visuals. we sat down, my gf was holding on for dear life as the music, wind and beauty of our surroundings made her feel like she was going to be blown away. we giggled, we couldn't stop, to us everything was unbelievable and hilarious - to others, we were mental. Just as we said \"it just can't get more ridiculous\" a woman with a basket of bracelets balanced on her head calm waltzing in, we broke down and asked \"is this for real?\", it was, it was perfect timing. The sun hot our faces, people were smiling at us and we felt like we were in a hollywood movie, this day was already perfect. We decided to walk down the beach which was crazy, as we looked it seemed like the whole beach was on a loop... eternal and never-ending. after walking 5 minutes we stopped and looked back...\"do you remember where we are staying\" my gf said... \"no... should we turn back?, \"no, let's carry on\" she replied. so we did, this is when it got crazier. I looked up at the trees on the beach, it was as if they were on fire, falling towards me! GREEN FIRE! it was crazy, I was mesmerized, it felt like they were enveloping me. We carried on walking when i felt reality start to take hold and my perception of normal returned. The waveyness and the burning trees had gone. I said to my gf that the acid must have worn off and she turns to me and says \"no it hasn't\"... then it all came back with the vengeance as my sight went insane, the roaring trees burned green yet again and the sound of the ocean was overbearing. I run to the nearest sunbed and take a minute to ponder on what happened. Then we decided to turn back as the started to set and made a mission to find out hut. After much confusion and some panic we found the hut again a though a swim in the sea would be a nice place to peak. as we entered the water it was like the perfect ending to the perfect day. It was warm it was welcoming it was spectacular. it looked as if it was a Japanese tidal painting; pristine blue waves was scarred onto the back of a burned orange sky.We sat in the water as the sun went down it was truly mystical; sweet house music playing in the background as we bobbed around on the horizon. At night, my gf lay on the beach and stared up at the stars, she said they were coming down at her as if they were shooting down they straight back up into the sky. she lay there until the tide came in, she said she felt as if the universe was coming down to hug her. as we walked back down the beach to out hut the noises of the night were really prominent. A guy playing classical music on a piano at one bar, to the sounds of a BBQ roaring at another to the fire dancers at the end of the beach made it a remarkable ending to a perfect day. we sat down and attempted to eat food, and it tasted magnificent. We just ended up cuddling to liquid house and post rock at the end of the trip! btw, when we looked up to the sky I saw hexagons in the sky while my gf was the flower of life - truly beautiful. we will never forget this day, it was EPIC.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64skmi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Horobags", "saved": false, "mod_reports": [], "name": "t3_64skmi", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/64skmi/trip_report_150μg_on_the_beach/", "num_reports": null, "locked": false, "stickied": false, "created": 1491963003.0, "url": "https://www.reddit.com/r/Psychonaut/comments/64skmi/trip_report_150μg_on_the_beach/", "author_flair_text": null, "quarantine": false, "title": "Trip Report: 150μg on the beach", "created_utc": 1491934203.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64skmi", "likes": null, "replies": "", "user_reports": [], "id": "dg4pjdt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gravking", "parent_id": "t3_64skmi", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Thanks For the share. One of my favorite things is when I am tripping with friends and they say \"I think they are wearing off, or I might be ready for another\" I simply smile and watch them fall back into the colors. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks For the share. One of my favorite things is when I am tripping with friends and they say &amp;quot;I think they are wearing off, or I might be ready for another&amp;quot; I simply smile and watch them fall back into the colors. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg4pjdt", "score_hidden": false, "stickied": false, "created": 1491965078.0, "created_utc": 1491936278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64skmi", "likes": null, "replies": "", "user_reports": [], "id": "dg86nkh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Humpdat", "parent_id": "t3_64skmi", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I have a beach trip date set for this Saturday with 200mics in a sugar cube. We also bought a thc vape pen so we can smoke in the beach without the typical smell of a joint. Your story psyched me up ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a beach trip date set for this Saturday with 200mics in a sugar cube. We also bought a thc vape pen so we can smoke in the beach without the typical smell of a joint. Your story psyched me up &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg86nkh", "score_hidden": false, "stickied": false, "created": 1492144634.0, "created_utc": 1492115834.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]