[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last November I decided to take some shrooms (3 grams) and smoke some weed at the same time before the trip began. I&amp;#39;ve done shrooms twice before and didn&amp;#39;t experience anything like this. It started off with some terrible anxiety, which remained throughout the whole trip. The next most vivid part of the trip was where I told myself that I had to die, that the only way I could escape this was to kill myself. I knew my mom and sister would be devastated if I killed myself, so I decided that I would give myself lung cancer by smoking excessively.&lt;/p&gt;\n\n&lt;p&gt;I pictured myself lying naked in a restaurant or somewhere in public covered in my own feces and people staring at me in utter disgust. After a while I climbed into my bedsheets and closed my eyes. This was when the anxiety went down a little bit, but the trip turned to a whole new level. I felt like there were these things taking me to another dimension where I would play the role of &amp;quot;god&amp;quot; or the universe of whatever. I felt myself experiencing nothing but suffering, I felt me as a single entity transfer my consciousness into every person throughout time. I felt the pain of the Jews who were burned alive, the people in the scuff videos I saw online, my ex-boss who treated my like shit but I understood that he through was suffering quite a lot.&lt;/p&gt;\n\n&lt;p&gt;My trip ended when my roommate walked into our condo and I snapped back to reality. What followed however was a huge amount of anxiety from the thought of nihilism, that everything we do is completely useless. Nothing has a purpose and we&amp;#39;re all in this universe to suffer. It turned me inside out, I indulged in my own nihilistic thoughts and refused to talk to someone about it, and it really really fucked me up.&lt;/p&gt;\n\n&lt;p&gt;Thanks to &lt;a href=\"/r/meditation\"&gt;/r/meditation&lt;/a&gt; I&amp;#39;ve hit almost a month of daily meditation which has reduced my anxiety quite a bit, but I still get panic attacks. I was before living in a very solipsistic mindset, thinking that I was the only one who actually existed and everything, everyone was just a projection of my mind (hence having the power to give myself lung cancer) but this has almost completely gone away through meditation.&lt;/p&gt;\n\n&lt;p&gt;I always wonder, what is gonna happen when I die, will I live the lives of all of these people who have suffered all over again? At times I have thought about killing myself, but a while back I read on &lt;a href=\"/r/GlitchInTheMatrix\"&gt;/r/GlitchInTheMatrix&lt;/a&gt; (I know it sounds stupid, but its been feeding the fire in my head) that these people tried killing themselves, and woke up in a different reality; an identical reality with a slightly different timeline. What the fuck is the point of existing?\nI know that only I can find the answer to this question (maybe), and through meditation I have realized some things buried in my subconscious, like the people who bullied me when I was a kid, or the death of my father at a very young age. Things like that which I am now starting realize were the catalyst to my depression and anxiety, and look at them from a different perspective.&lt;/p&gt;\n\n&lt;p&gt;However, asking you guys is very comforting; I just wanna hear it from someone else before I figure it out for myself. Like a mother when she tells her kid that everything will be okay after they woke up from a nightmare.&lt;/p&gt;\n\n&lt;p&gt;What have you guys figured out on your journeys about the meaning of life? I don&amp;#39;t wanna keep living in this cynical mindset, it hurts.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sorry for the long post, I tried to make it as short as possible but I couldn&amp;#39;t summarize it anymore than this.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Last November I decided to take some shrooms (3 grams) and smoke some weed at the same time before the trip began. I've done shrooms twice before and didn't experience anything like this. It started off with some terrible anxiety, which remained throughout the whole trip. The next most vivid part of the trip was where I told myself that I had to die, that the only way I could escape this was to kill myself. I knew my mom and sister would be devastated if I killed myself, so I decided that I would give myself lung cancer by smoking excessively.\n\nI pictured myself lying naked in a restaurant or somewhere in public covered in my own feces and people staring at me in utter disgust. After a while I climbed into my bedsheets and closed my eyes. This was when the anxiety went down a little bit, but the trip turned to a whole new level. I felt like there were these things taking me to another dimension where I would play the role of \"god\" or the universe of whatever. I felt myself experiencing nothing but suffering, I felt me as a single entity transfer my consciousness into every person throughout time. I felt the pain of the Jews who were burned alive, the people in the scuff videos I saw online, my ex-boss who treated my like shit but I understood that he through was suffering quite a lot.\n\nMy trip ended when my roommate walked into our condo and I snapped back to reality. What followed however was a huge amount of anxiety from the thought of nihilism, that everything we do is completely useless. Nothing has a purpose and we're all in this universe to suffer. It turned me inside out, I indulged in my own nihilistic thoughts and refused to talk to someone about it, and it really really fucked me up.\n\nThanks to /r/meditation I've hit almost a month of daily meditation which has reduced my anxiety quite a bit, but I still get panic attacks. I was before living in a very solipsistic mindset, thinking that I was the only one who actually existed and everything, everyone was just a projection of my mind (hence having the power to give myself lung cancer) but this has almost completely gone away through meditation.\n\nI always wonder, what is gonna happen when I die, will I live the lives of all of these people who have suffered all over again? At times I have thought about killing myself, but a while back I read on /r/GlitchInTheMatrix (I know it sounds stupid, but its been feeding the fire in my head) that these people tried killing themselves, and woke up in a different reality; an identical reality with a slightly different timeline. What the fuck is the point of existing?\nI know that only I can find the answer to this question (maybe), and through meditation I have realized some things buried in my subconscious, like the people who bullied me when I was a kid, or the death of my father at a very young age. Things like that which I am now starting realize were the catalyst to my depression and anxiety, and look at them from a different perspective.\n\nHowever, asking you guys is very comforting; I just wanna hear it from someone else before I figure it out for myself. Like a mother when she tells her kid that everything will be okay after they woke up from a nightmare.\n\nWhat have you guys figured out on your journeys about the meaning of life? I don't wanna keep living in this cynical mindset, it hurts.\n\n**Sorry for the long post, I tried to make it as short as possible but I couldn't summarize it anymore than this.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64yk15", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "MilkForBones", "saved": false, "mod_reports": [], "name": "t3_64yk15", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/64yk15/fear_of_reality_its_terrifying_and_i_dont_know/", "num_reports": null, "locked": false, "stickied": false, "created": 1492036871.0, "url": "https://www.reddit.com/r/Psychonaut/comments/64yk15/fear_of_reality_its_terrifying_and_i_dont_know/", "author_flair_text": null, "quarantine": false, "title": "Fear of reality? It's terrifying and I don't know what to do", "created_utc": 1492008071.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64yk15", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64yk15", "likes": null, "replies": "", "user_reports": [], "id": "dg6bhgw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Triangularistan", "parent_id": "t1_dg69a58", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Wholeheartedly agree with this!  I've had a few bad trips and one that was the most terrifying and humbling experience I've ever had. I hated every minute of it while it was happening, but once I was on the other side of it and had time to reflect, it was clear that it had opened up something deep within me. \n\nThese types of experiences can shake us up, but your perspective on the matter can allow for you to extract fundamental insight on the errors of your own conscious perception of reality and much more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wholeheartedly agree with this!  I&amp;#39;ve had a few bad trips and one that was the most terrifying and humbling experience I&amp;#39;ve ever had. I hated every minute of it while it was happening, but once I was on the other side of it and had time to reflect, it was clear that it had opened up something deep within me. &lt;/p&gt;\n\n&lt;p&gt;These types of experiences can shake us up, but your perspective on the matter can allow for you to extract fundamental insight on the errors of your own conscious perception of reality and much more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6bhgw", "score_hidden": false, "stickied": false, "created": 1492050861.0, "created_utc": 1492022061.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69a58", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jafeelz", "parent_id": "t3_64yk15", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "This is awesome you experienced this! Now it will give you hella leverage when you are in times of distress, and you'll be able to see them for what they are\nBad trips like this are a huge blessing in disguise. \nI e had something very similar happen, and I'd say the bad trips I've had were some of the most important things to have happened to me.\nIf ya just keep an open mindset and look at them for an opportunity to learn, you'll have nowhere to go but forward! :D\nGreat thing picking up meditation too! Stay with it :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is awesome you experienced this! Now it will give you hella leverage when you are in times of distress, and you&amp;#39;ll be able to see them for what they are\nBad trips like this are a huge blessing in disguise. \nI e had something very similar happen, and I&amp;#39;d say the bad trips I&amp;#39;ve had were some of the most important things to have happened to me.\nIf ya just keep an open mindset and look at them for an opportunity to learn, you&amp;#39;ll have nowhere to go but forward! :D\nGreat thing picking up meditation too! Stay with it :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg69a58", "score_hidden": false, "stickied": false, "created": 1492048604.0, "created_utc": 1492019804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64yk15", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64yk15", "likes": null, "replies": "", "user_reports": [], "id": "dg718ne", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CosmicSattva", "parent_id": "t1_dg6cdsr", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I have generalized anxiety, borderline high BP, and occasionally panic attacks, and propranolol has helped me tremendously.  I think I could still improve, but it's amazing how much clearer you can think when you aren't constantly in red alert fight or flight mode... The physical and mental feelings definitely build on each other IMO.\n\nAs for meaning, I think we must all find our own passions in life and strive to do something with them that makes us feel happy, satisfied, and hopefully accomplished.  For me, my passions are mostly music, chemistry, and art.  Finding ways to contribute to those is one way I find meaning.  \n\nExistence needn't be about a greater purpose, trying to qualify for a better afterlife, or any prescribed significance--find what you love and do it (as long as it doesn't hurt others).  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have generalized anxiety, borderline high BP, and occasionally panic attacks, and propranolol has helped me tremendously.  I think I could still improve, but it&amp;#39;s amazing how much clearer you can think when you aren&amp;#39;t constantly in red alert fight or flight mode... The physical and mental feelings definitely build on each other IMO.&lt;/p&gt;\n\n&lt;p&gt;As for meaning, I think we must all find our own passions in life and strive to do something with them that makes us feel happy, satisfied, and hopefully accomplished.  For me, my passions are mostly music, chemistry, and art.  Finding ways to contribute to those is one way I find meaning.  &lt;/p&gt;\n\n&lt;p&gt;Existence needn&amp;#39;t be about a greater purpose, trying to qualify for a better afterlife, or any prescribed significance--find what you love and do it (as long as it doesn&amp;#39;t hurt others).  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg718ne", "score_hidden": false, "stickied": false, "created": 1492080840.0, "created_utc": 1492052040.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cdsr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AstralHippies", "parent_id": "t3_64yk15", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "&gt;I still get panic attacks.\n\nCan you manage those? It's damn hard to get in root of problem when your body responses it with cocktail of brain altering chemicals. \n\nI've had huge help from β-blockers (Propranolol), they do little to your actual mindset but they do help as your pulse doesn't go apeshit, you should consider asking your doctor for prescription.\n\n&gt;I always wonder, what is gonna happen when I die, will I live the lives of all of these people who have suffered all over again?\n\nThere's no way to know, hopefully we have something else to do by then, I think it's more related to the thought that if we eventually become \"gods\" of sort like you experienced, we must know what suffering feels like and what leads to it.\n\n&gt;What the fuck is the point of existing?\n\nSome say it's what you make of it, I believe that we have to choose our path wisely and be careful not to hurt others with our efforts.\n\nIf existence is endless loop, all we can do is accept it, think about it like this: If you or anyone else need to relive your live, all you can do is to make absolutely everything in your power that it would be enjoyable.\n\nI hope you can find solution to your situation, have faith friend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I still get panic attacks.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can you manage those? It&amp;#39;s damn hard to get in root of problem when your body responses it with cocktail of brain altering chemicals. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had huge help from β-blockers (Propranolol), they do little to your actual mindset but they do help as your pulse doesn&amp;#39;t go apeshit, you should consider asking your doctor for prescription.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I always wonder, what is gonna happen when I die, will I live the lives of all of these people who have suffered all over again?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There&amp;#39;s no way to know, hopefully we have something else to do by then, I think it&amp;#39;s more related to the thought that if we eventually become &amp;quot;gods&amp;quot; of sort like you experienced, we must know what suffering feels like and what leads to it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What the fuck is the point of existing?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Some say it&amp;#39;s what you make of it, I believe that we have to choose our path wisely and be careful not to hurt others with our efforts.&lt;/p&gt;\n\n&lt;p&gt;If existence is endless loop, all we can do is accept it, think about it like this: If you or anyone else need to relive your live, all you can do is to make absolutely everything in your power that it would be enjoyable.&lt;/p&gt;\n\n&lt;p&gt;I hope you can find solution to your situation, have faith friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6cdsr", "score_hidden": false, "stickied": false, "created": 1492051780.0, "created_utc": 1492022980.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64yk15", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64yk15", "likes": null, "replies": "", "user_reports": [], "id": "dg6uaj5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bonnofly", "parent_id": "t1_dg6l2p4", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I needed to read that, perfect way of looking at things. Felt overwhelmed after a dmt trip but now I think that we are here to express ourselves, whether it be through creation or destruction. Beauty or sadness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I needed to read that, perfect way of looking at things. Felt overwhelmed after a dmt trip but now I think that we are here to express ourselves, whether it be through creation or destruction. Beauty or sadness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6uaj5", "score_hidden": false, "stickied": false, "created": 1492072246.0, "created_utc": 1492043446.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6l2p4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HexagonOrNot", "parent_id": "t3_64yk15", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Suffering and Joy, ugly and beauty, love and hate. They will all be here for ever for you to experience. But both are there in every moment. Its just up to you to decide which one u´ll see. You can choose every moment again and again. And even if you choose to see the darkness in the next moment, isnt that kinda funny? Or atleast ironic? I mostly choose beauty and smile about it. There is not much else to do. Love it or hate it, the moment WONT change, just how you CHOOSE to remember it. Good luck, keep smiling. I love you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Suffering and Joy, ugly and beauty, love and hate. They will all be here for ever for you to experience. But both are there in every moment. Its just up to you to decide which one u´ll see. You can choose every moment again and again. And even if you choose to see the darkness in the next moment, isnt that kinda funny? Or atleast ironic? I mostly choose beauty and smile about it. There is not much else to do. Love it or hate it, the moment WONT change, just how you CHOOSE to remember it. Good luck, keep smiling. I love you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6l2p4", "score_hidden": false, "stickied": false, "created": 1492060919.0, "created_utc": 1492032119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64yk15", "likes": null, "replies": "", "user_reports": [], "id": "dg6l6ce", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vicvega1988", "parent_id": "t3_64yk15", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "First time poster here but I've taken mushrooms countless times and I've had good, bad, happy, and sad trips. The worst one I had though was very reminiscent of yours. At the time of the trip, I was working at a dead end job, in an unhappy marriage and addicted to cocaine and I dabbled in heroin frequently too. One night, after the urging of some close friends (who I thank everyday now) suggested I try mushrooms to get to the root of my unhappiness. True, it was right in front of me why I was unhappy but I couldn't see it because I was being blinded by all the negativity in my life. I decided to take 6g (not my first time dosing) and up the dose about 30 mins later which eventually came out to be around 14-15g. At first, the anxiety set in and the feelings of death rushed over me. It felt like my skin was being torn off and revealing a new person, an ugly person that I didn't like but I needed to see it. As I accepted it, my brain felt like it was in a vice and I felt the pressure all around me. I took this as a sign that shit wasn't good around me. Once my brain exploded and my trip got even more intense, I went outside to calm down and get some air. It was raining hard, harder than it normally did and I noticed that I was on a building. A voice kept telling me, \"You can keep playing dangerous and continue to scale this building or you can accept your death and jump.\" I remember that it felt like hours that I sat there on that ledge pondering the meaning of my life before I decided that this was the change I needed. I said \"Fuck it and jumped.\" With that, everything that I felt was negative in my life seemed to roll off my shoulders. While I did continue to use cocaine and heroin after that, I stopped shortly and have been clean for almost three years. I got out of my unhappy marriage and got a better job and I'm happier than ever.\n\n**TL;DR Accept the bad trip and read into it as a way of making changes and something that you needed to confront.**", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First time poster here but I&amp;#39;ve taken mushrooms countless times and I&amp;#39;ve had good, bad, happy, and sad trips. The worst one I had though was very reminiscent of yours. At the time of the trip, I was working at a dead end job, in an unhappy marriage and addicted to cocaine and I dabbled in heroin frequently too. One night, after the urging of some close friends (who I thank everyday now) suggested I try mushrooms to get to the root of my unhappiness. True, it was right in front of me why I was unhappy but I couldn&amp;#39;t see it because I was being blinded by all the negativity in my life. I decided to take 6g (not my first time dosing) and up the dose about 30 mins later which eventually came out to be around 14-15g. At first, the anxiety set in and the feelings of death rushed over me. It felt like my skin was being torn off and revealing a new person, an ugly person that I didn&amp;#39;t like but I needed to see it. As I accepted it, my brain felt like it was in a vice and I felt the pressure all around me. I took this as a sign that shit wasn&amp;#39;t good around me. Once my brain exploded and my trip got even more intense, I went outside to calm down and get some air. It was raining hard, harder than it normally did and I noticed that I was on a building. A voice kept telling me, &amp;quot;You can keep playing dangerous and continue to scale this building or you can accept your death and jump.&amp;quot; I remember that it felt like hours that I sat there on that ledge pondering the meaning of my life before I decided that this was the change I needed. I said &amp;quot;Fuck it and jumped.&amp;quot; With that, everything that I felt was negative in my life seemed to roll off my shoulders. While I did continue to use cocaine and heroin after that, I stopped shortly and have been clean for almost three years. I got out of my unhappy marriage and got a better job and I&amp;#39;m happier than ever.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR Accept the bad trip and read into it as a way of making changes and something that you needed to confront.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6l6ce", "score_hidden": false, "stickied": false, "created": 1492061039.0, "created_utc": 1492032239.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64yk15", "likes": null, "replies": "", "user_reports": [], "id": "dg6sejd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Orc_", "parent_id": "t3_64yk15", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "LSD did something to me but I got 99% over it. I only get panic attacks rarely, like last night I got a weird intense one.\n\nYou are probably like me and wish you had never takin a psychedelic, you may think you are now \"too wise\" to be in ignorant bliss.\n\nRead the trilogy of \"Conversation with God\", listen to Allan Watts too, good news that make sense for your tormented mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;LSD did something to me but I got 99% over it. I only get panic attacks rarely, like last night I got a weird intense one.&lt;/p&gt;\n\n&lt;p&gt;You are probably like me and wish you had never takin a psychedelic, you may think you are now &amp;quot;too wise&amp;quot; to be in ignorant bliss.&lt;/p&gt;\n\n&lt;p&gt;Read the trilogy of &amp;quot;Conversation with God&amp;quot;, listen to Allan Watts too, good news that make sense for your tormented mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6sejd", "score_hidden": false, "stickied": false, "created": 1492069910.0, "created_utc": 1492041110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]