[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am wondering because I have realized I don&amp;#39;t like tripping with people I don&amp;#39;t know EXTREMELY WELL.&lt;/p&gt;\n\n&lt;p&gt;Do you guys trip with anybody? If you do, how do you handle it?&lt;/p&gt;\n\n&lt;p&gt;I mostly trip on my own, a few times a year, for introspection and personal spiritual work. I take large doses when I trip alone, and medium/small when with other people.&lt;/p&gt;\n\n&lt;p&gt;I only like to trip with best friends. People I trust on a deep level, people I have known for a long time. People I KNOW know.&lt;/p&gt;\n\n&lt;p&gt;I made some friends in college and tripped with them, during the trip I realized I don&amp;#39;t want to trip with them anymore. &lt;/p&gt;\n\n&lt;p&gt;I like these guys but on psychedelics it felt weird to me. Like I couldn&amp;#39;t trust them enough to let go completely. It&amp;#39;s paranoia but it&amp;#39;s there. Whereas with friends from home, old friends, I trip and no socially related paranoia.&lt;/p&gt;\n\n&lt;p&gt;I also feel like to some people, the effects of psychedelics are not so deep as they are for me. Psychedelics changed my whole view on life. Psychedelics changed my life... They introduced me to yoga, zen, spirituality, personal development, health, etc...&lt;/p&gt;\n\n&lt;p&gt;To me, psychedelics are a spiritual tool to be used responsibly and respectably.&lt;/p&gt;\n\n&lt;p&gt;Girls I meet (2 so far) and have sexual relations with quickly come to realize I am a psychonaut, meditator, as this is a part of my life... I practice yoga and visit a zendo for zazen.&lt;/p&gt;\n\n&lt;p&gt;Both girls ended up wanting to trip with me, one for her first time, the other not. But I don&amp;#39;t want to trip with them. I know I would feel uncomfortable and have a difficult time. So I told them I did not want to, the one who has tripped before was a little bit mad and we no longer see each other, the other said she understood, even though she never took any psychedelics.&lt;/p&gt;\n\n&lt;p&gt;Why can&amp;#39;t I trip with just anyone?&lt;/p&gt;\n\n&lt;p&gt;Is it that I only want to trip with people I love? Albeit I don&amp;#39;t even know what love is exactly honestly.&lt;/p&gt;\n\n&lt;p&gt;Anyways...&lt;/p&gt;\n\n&lt;p&gt;TLDR: I can only enjoy tripping with very close friends, which is actually only 4 dudes in my life. Psychedelics are a sacred medicine to me, and I have trouble sharing the experience with people who do not see them the same way. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am wondering because I have realized I don't like tripping with people I don't know EXTREMELY WELL.\n\nDo you guys trip with anybody? If you do, how do you handle it?\n\nI mostly trip on my own, a few times a year, for introspection and personal spiritual work. I take large doses when I trip alone, and medium/small when with other people.\n\nI only like to trip with best friends. People I trust on a deep level, people I have known for a long time. People I KNOW know.\n\nI made some friends in college and tripped with them, during the trip I realized I don't want to trip with them anymore. \n\nI like these guys but on psychedelics it felt weird to me. Like I couldn't trust them enough to let go completely. It's paranoia but it's there. Whereas with friends from home, old friends, I trip and no socially related paranoia.\n\nI also feel like to some people, the effects of psychedelics are not so deep as they are for me. Psychedelics changed my whole view on life. Psychedelics changed my life... They introduced me to yoga, zen, spirituality, personal development, health, etc...\n\nTo me, psychedelics are a spiritual tool to be used responsibly and respectably.\n\nGirls I meet (2 so far) and have sexual relations with quickly come to realize I am a psychonaut, meditator, as this is a part of my life... I practice yoga and visit a zendo for zazen.\n\nBoth girls ended up wanting to trip with me, one for her first time, the other not. But I don't want to trip with them. I know I would feel uncomfortable and have a difficult time. So I told them I did not want to, the one who has tripped before was a little bit mad and we no longer see each other, the other said she understood, even though she never took any psychedelics.\n\nWhy can't I trip with just anyone?\n\nIs it that I only want to trip with people I love? Albeit I don't even know what love is exactly honestly.\n\nAnyways...\n\nTLDR: I can only enjoy tripping with very close friends, which is actually only 4 dudes in my life. Psychedelics are a sacred medicine to me, and I have trouble sharing the experience with people who do not see them the same way. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ztn8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "iamtruthandreality", "saved": false, "mod_reports": [], "name": "t3_64ztn8", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/64ztn8/anyone_else_restrict_who_they_trip_with/", "num_reports": null, "locked": false, "stickied": false, "created": 1492048778.0, "url": "https://www.reddit.com/r/Psychonaut/comments/64ztn8/anyone_else_restrict_who_they_trip_with/", "author_flair_text": null, "quarantine": false, "title": "Anyone else restrict who they trip with?", "created_utc": 1492019978.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64ztn8", "likes": null, "replies": "", "user_reports": [], "id": "dg6c7fw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "DustyFidelios", "parent_id": "t3_64ztn8", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I trip alone, which really means I trip with everyone. On the outside, people (me) are afraid to make real connections, but inside here, connections is all there is (you guys are all here with me, strange as that sounds.) In the IRL world, I think it's the *implications* of the psychedelic experience that is the most important to share, not necessarily the drug experience itself. Regardless, I think I'm probably missing an experience of direct loving connection by going this path alone. But I do think there's something to the idea of reserving oneself and releasing loving energy sparingly, at the right time where your presence will have the most power to heal and inspire. Maybe I'm making excuses for my own shut in mind, and I just need to 'open up', but there seems to be a regulation to this valve that does not operate well when either fully open or fully closed. Once half opened, it trembles a bit, but can steady itself. The valve can then focus its beam, thus translating the mysteries of both sides to eachother.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I trip alone, which really means I trip with everyone. On the outside, people (me) are afraid to make real connections, but inside here, connections is all there is (you guys are all here with me, strange as that sounds.) In the IRL world, I think it&amp;#39;s the &lt;em&gt;implications&lt;/em&gt; of the psychedelic experience that is the most important to share, not necessarily the drug experience itself. Regardless, I think I&amp;#39;m probably missing an experience of direct loving connection by going this path alone. But I do think there&amp;#39;s something to the idea of reserving oneself and releasing loving energy sparingly, at the right time where your presence will have the most power to heal and inspire. Maybe I&amp;#39;m making excuses for my own shut in mind, and I just need to &amp;#39;open up&amp;#39;, but there seems to be a regulation to this valve that does not operate well when either fully open or fully closed. Once half opened, it trembles a bit, but can steady itself. The valve can then focus its beam, thus translating the mysteries of both sides to eachother.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6c7fw", "score_hidden": false, "stickied": false, "created": 1492051597.0, "created_utc": 1492022797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64ztn8", "likes": null, "replies": "", "user_reports": [], "id": "dg6h6cn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "TheMassAwakening", "parent_id": "t3_64ztn8", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I've only ever tripped with two people I prefer to trip alone, comfortably in my room on a dose too high to socially interact with people. These trips are the most insightful, magical, Introspective and meaningful trips in my experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve only ever tripped with two people I prefer to trip alone, comfortably in my room on a dose too high to socially interact with people. These trips are the most insightful, magical, Introspective and meaningful trips in my experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6h6cn", "score_hidden": false, "stickied": false, "created": 1492056717.0, "created_utc": 1492027917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64ztn8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64ztn8", "likes": null, "replies": "", "user_reports": [], "id": "dg75te7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "needKnowledg3", "parent_id": "t1_dg6mg79", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Your post resonates pretty strongly with me. I trip by myself often and when I was younger it seemed I was the leader when it came to psychedelics. I haven't ever really had a \"bad trip\" and I've always been able to calm those around who are having bad experiences. Even strangers at raves. I don't like to trip in a public place like Walmart or regular world. Your speak a lot about trust. I've come to the conclusion that if you trust yourself and commit to the ride nothing can shake you. Everything that happens is meant to happen and there's nothing you can really do about it. Don't take it seriously and always try to have fun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your post resonates pretty strongly with me. I trip by myself often and when I was younger it seemed I was the leader when it came to psychedelics. I haven&amp;#39;t ever really had a &amp;quot;bad trip&amp;quot; and I&amp;#39;ve always been able to calm those around who are having bad experiences. Even strangers at raves. I don&amp;#39;t like to trip in a public place like Walmart or regular world. Your speak a lot about trust. I&amp;#39;ve come to the conclusion that if you trust yourself and commit to the ride nothing can shake you. Everything that happens is meant to happen and there&amp;#39;s nothing you can really do about it. Don&amp;#39;t take it seriously and always try to have fun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg75te7", "score_hidden": false, "stickied": false, "created": 1492087614.0, "created_utc": 1492058814.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mg79", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RadioKnife", "parent_id": "t3_64ztn8", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I love tripping with others especially in a big psy trance event, but usually when it's with friends I end up tripping with people who can't enjoy a moment of silence or have to be all up in my face trying to get all personal for the ENTIRE trip or can't NOT have something on the TV or making sound. BLEH! Haha. People like tripping with me though now as after enough times alone they can tell I can keep my shit together. The worse though for me is if people make sexual advances I don't want to escalate. Other people drive me nuts. So I cherish my single trips though I love the potential to bring yourself closer with those you trust enough to do it with.\n\nI think the important thing about being a regular tripper is being able to find your center and not stray too far from it. It will benefit yourself and others. When you are fully in your center, which takes some experience chipping away at to find and step into, you'll automatically be as natural as possible. *Being* in your center is a very powerful thing for yourself and others- those who do not know their center well will knowingly or unknowingly be swayed by your vibes and will either passively match them or go crazy until they run out of energy and then calm down and match them.  This all applies to non tripping, but especially for trips I find. So like you OP you said you couldnt let your guard down around other people, it takes you making the step to let your guard down and become natural for them to adjust, not the other way around as it might seem, at least from my experience. I like to be an anchor for others that need it in a group trip but that's just me tho :)", "edited": 1492034682.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love tripping with others especially in a big psy trance event, but usually when it&amp;#39;s with friends I end up tripping with people who can&amp;#39;t enjoy a moment of silence or have to be all up in my face trying to get all personal for the ENTIRE trip or can&amp;#39;t NOT have something on the TV or making sound. BLEH! Haha. People like tripping with me though now as after enough times alone they can tell I can keep my shit together. The worse though for me is if people make sexual advances I don&amp;#39;t want to escalate. Other people drive me nuts. So I cherish my single trips though I love the potential to bring yourself closer with those you trust enough to do it with.&lt;/p&gt;\n\n&lt;p&gt;I think the important thing about being a regular tripper is being able to find your center and not stray too far from it. It will benefit yourself and others. When you are fully in your center, which takes some experience chipping away at to find and step into, you&amp;#39;ll automatically be as natural as possible. &lt;em&gt;Being&lt;/em&gt; in your center is a very powerful thing for yourself and others- those who do not know their center well will knowingly or unknowingly be swayed by your vibes and will either passively match them or go crazy until they run out of energy and then calm down and match them.  This all applies to non tripping, but especially for trips I find. So like you OP you said you couldnt let your guard down around other people, it takes you making the step to let your guard down and become natural for them to adjust, not the other way around as it might seem, at least from my experience. I like to be an anchor for others that need it in a group trip but that&amp;#39;s just me tho :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6mg79", "score_hidden": false, "stickied": false, "created": 1492062552.0, "created_utc": 1492033752.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64ztn8", "likes": null, "replies": "", "user_reports": [], "id": "dg6wfo5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blacksox22", "parent_id": "t3_64ztn8", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I only trip alone. I have a couple friends who trip and I tried to trip with them but I realized it's just not a good idea. First, when you trip around other people it can distract you from your experience. Second, you have no idea what other people are going to do or say, even if they are close friends. You are inviting rogue elements into your trip when around other people. Anything they do that isn't 100% loving can send you into a not so fun trip. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I only trip alone. I have a couple friends who trip and I tried to trip with them but I realized it&amp;#39;s just not a good idea. First, when you trip around other people it can distract you from your experience. Second, you have no idea what other people are going to do or say, even if they are close friends. You are inviting rogue elements into your trip when around other people. Anything they do that isn&amp;#39;t 100% loving can send you into a not so fun trip. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6wfo5", "score_hidden": false, "stickied": false, "created": 1492074814.0, "created_utc": 1492046014.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64ztn8", "likes": null, "replies": "", "user_reports": [], "id": "dg6prrb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheSelfGoverned", "parent_id": "t3_64ztn8", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "It makes sense. Trips with \"friends\" is awful. There's no connection, and they end up hating you and judging you negatively for being in and accepting a state of emotional openness. In today's culture, that is equated to weakness or worse, insanity and danger.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It makes sense. Trips with &amp;quot;friends&amp;quot; is awful. There&amp;#39;s no connection, and they end up hating you and judging you negatively for being in and accepting a state of emotional openness. In today&amp;#39;s culture, that is equated to weakness or worse, insanity and danger.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6prrb", "score_hidden": false, "stickied": false, "created": 1492066651.0, "created_utc": 1492037851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64ztn8", "likes": null, "replies": "", "user_reports": [], "id": "dg7mrdu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheSempie", "parent_id": "t3_64ztn8", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Of course. If I'm not 100% sure about someone, I would never trip with that person. Trust is a requierement which is not open for discussion but a must have - for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course. If I&amp;#39;m not 100% sure about someone, I would never trip with that person. Trust is a requierement which is not open for discussion but a must have - for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg7mrdu", "score_hidden": false, "stickied": false, "created": 1492123170.0, "created_utc": 1492094370.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_64ztn8", "likes": null, "replies": "", "user_reports": [], "id": "dg7qwzp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheOriginalTomatoSal", "parent_id": "t3_64ztn8", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I used to trip with my friends that I met in high school and that showed me that they weren't my real friends and that I hadn't actually met my real friends yet, so I tripped alone most of the time after that. Had about 20 breakthroughs during this period.\n\nIn college through some crazy synchronicity I met some fellow psychonauts, immediately trusted them and tripped together within a few hours of meeting them. It went great and that semester ended up going by in an ocean of lysergia. After they graduated and left me behind at school I fell into a deep depression but I realized that that was always there, so I went back to tripping alone to get insight.\n\nSo yeah", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to trip with my friends that I met in high school and that showed me that they weren&amp;#39;t my real friends and that I hadn&amp;#39;t actually met my real friends yet, so I tripped alone most of the time after that. Had about 20 breakthroughs during this period.&lt;/p&gt;\n\n&lt;p&gt;In college through some crazy synchronicity I met some fellow psychonauts, immediately trusted them and tripped together within a few hours of meeting them. It went great and that semester ended up going by in an ocean of lysergia. After they graduated and left me behind at school I fell into a deep depression but I realized that that was always there, so I went back to tripping alone to get insight.&lt;/p&gt;\n\n&lt;p&gt;So yeah&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg7qwzp", "score_hidden": false, "stickied": false, "created": 1492127707.0, "created_utc": 1492098907.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]