[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To preface: have tripped a solid 60+ times on mostly LSD and 2C-B, occasionally shrooms.&lt;/p&gt;\n\n&lt;p&gt;Yesterday with a few close friends I dropped 250ug around midnight. The come-up was quite easy as I had taken ~60ug for a show around 6 hours prior.&lt;/p&gt;\n\n&lt;p&gt;At one point I sat down and decided to try and visualize myself holding a ball and see if it would my hand to drop. I out all my focus into visualizing a heavy ball. I started to roll my hands left to right as if it were there, eventually my hands reacted to physical sensations of weight on each pass. I then formed my hands into a position that resembled holding a small sphere and after channeling my focus into the space between I saw and felt a ball of &amp;quot;flowing&amp;quot; energy. It resembled a ball of bright fast paced visuals with a high density gyrating around at a fast pace. I started to play around with it and could make it larger, more dense, and maneuver it however I wanted. At one point I held both thumbs and pointer fingers very close, formed a dense ball, and tried to pull it apart. While doing so I felt the physical tension similar to pulling apart a rubber band, the harder I pulled it the more difficult it became, and it felt like my fingers were physically being pulled to the center.&lt;/p&gt;\n\n&lt;p&gt;I played around with this for hours and started making many more intricate shapes. I also figured out how to put more energy into one spot and it formed and even brighter object that pulsated and sparked with energy, and trying to pull it apart was extremely difficult and caused me to fell a much sharper electrical sensation in my fingertips as they started to glow, almost to the point of being slightly painful. I later learned how to project sound onto objects and have synesthesia, manipulate energy with just my eyes and mind, and fill my entire vision with physically interactive visual objects. &lt;/p&gt;\n\n&lt;p&gt;One of my friends, who had much experience tripping, had done this several times before. He suggested I add in a little Ketamine to help with the focus, I went slow at first, and was able to play with the energy much more easily creating fully interactive intricate objects. My friend then recommended getting a shower after doing a larger amount of K. &lt;/p&gt;\n\n&lt;p&gt;When the water started running I was blocked out from hearing outside sounds and thought I heard my friends calling my name from the other room, which turned into a cascade of different sounds I had heard throughout the night. I tried focusing on a specific sound I wanted to hear and was able to audibly hear &amp;quot;Chemicals - Tiesto &amp;amp; Don Diablos&amp;quot; play from his recent Ultra set. While doing so I had the idea to attempt and physically see the memory. I pinched and pulled diagonally and was able to open a screen showcasing a mix of the recorded set and from when I was there to see it live. The harder the K kicked in, the less control I had over the specifics of what I heard and saw. I felt it was possible, just not without more practice.&lt;/p&gt;\n\n&lt;p&gt;Throughout the night I also learned how to more easily channel thoughts from negative to positive ones, that with meditation you see yourself appear brighter and more filled with energy, and flow to music (in terms of movement) with the ball of energy. And the longer I did that and above, the easier and more accessible it came. There was also a feeling of &amp;quot;enhanced sobriety&amp;quot; that came with the practice. If I focused I was able to eliminate the majority of visuals and &amp;quot;trippy thoughts&amp;quot;, just not the overalll increased sensitivity. I felt quite functional but had the ability to intensify the trip again when I wanted.&lt;/p&gt;\n\n&lt;p&gt;I had no idea you could interact with the trip on that level! And believe that with enough experience one could possibly control the perception of most (if not all of the senses), and maybe even more things relating to the more &amp;quot;inside&amp;quot; parts of your experience. I feel like I&amp;#39;ve barely scratched the surface of whats possible. All this brings about so many questions about consciousness and perception. LSD is truly an amazing tool!&lt;/p&gt;\n\n&lt;p&gt;Has anyone experienced something similar? I searched a bit and didn&amp;#39;t find much, so I&amp;#39;m curious to hear other experiences.&lt;/p&gt;\n\n&lt;p&gt;TL;DR Tripped hard on 250ug of LSD, created and played with a ball of energy, made my own visuals along with synesthesia, took Ketamine, audibly heard a specific song I focused on, and replayed a memory (visibly and audibly). I discovered how to alter my reality on LSD.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "To preface: have tripped a solid 60+ times on mostly LSD and 2C-B, occasionally shrooms.\n\nYesterday with a few close friends I dropped 250ug around midnight. The come-up was quite easy as I had taken ~60ug for a show around 6 hours prior.\n\nAt one point I sat down and decided to try and visualize myself holding a ball and see if it would my hand to drop. I out all my focus into visualizing a heavy ball. I started to roll my hands left to right as if it were there, eventually my hands reacted to physical sensations of weight on each pass. I then formed my hands into a position that resembled holding a small sphere and after channeling my focus into the space between I saw and felt a ball of \"flowing\" energy. It resembled a ball of bright fast paced visuals with a high density gyrating around at a fast pace. I started to play around with it and could make it larger, more dense, and maneuver it however I wanted. At one point I held both thumbs and pointer fingers very close, formed a dense ball, and tried to pull it apart. While doing so I felt the physical tension similar to pulling apart a rubber band, the harder I pulled it the more difficult it became, and it felt like my fingers were physically being pulled to the center.\n\nI played around with this for hours and started making many more intricate shapes. I also figured out how to put more energy into one spot and it formed and even brighter object that pulsated and sparked with energy, and trying to pull it apart was extremely difficult and caused me to fell a much sharper electrical sensation in my fingertips as they started to glow, almost to the point of being slightly painful. I later learned how to project sound onto objects and have synesthesia, manipulate energy with just my eyes and mind, and fill my entire vision with physically interactive visual objects. \n\nOne of my friends, who had much experience tripping, had done this several times before. He suggested I add in a little Ketamine to help with the focus, I went slow at first, and was able to play with the energy much more easily creating fully interactive intricate objects. My friend then recommended getting a shower after doing a larger amount of K. \n\nWhen the water started running I was blocked out from hearing outside sounds and thought I heard my friends calling my name from the other room, which turned into a cascade of different sounds I had heard throughout the night. I tried focusing on a specific sound I wanted to hear and was able to audibly hear \"Chemicals - Tiesto &amp; Don Diablos\" play from his recent Ultra set. While doing so I had the idea to attempt and physically see the memory. I pinched and pulled diagonally and was able to open a screen showcasing a mix of the recorded set and from when I was there to see it live. The harder the K kicked in, the less control I had over the specifics of what I heard and saw. I felt it was possible, just not without more practice.\n\nThroughout the night I also learned how to more easily channel thoughts from negative to positive ones, that with meditation you see yourself appear brighter and more filled with energy, and flow to music (in terms of movement) with the ball of energy. And the longer I did that and above, the easier and more accessible it came. There was also a feeling of \"enhanced sobriety\" that came with the practice. If I focused I was able to eliminate the majority of visuals and \"trippy thoughts\", just not the overalll increased sensitivity. I felt quite functional but had the ability to intensify the trip again when I wanted.\n\nI had no idea you could interact with the trip on that level! And believe that with enough experience one could possibly control the perception of most (if not all of the senses), and maybe even more things relating to the more \"inside\" parts of your experience. I feel like I've barely scratched the surface of whats possible. All this brings about so many questions about consciousness and perception. LSD is truly an amazing tool!\n\nHas anyone experienced something similar? I searched a bit and didn't find much, so I'm curious to hear other experiences.\n\nTL;DR Tripped hard on 250ug of LSD, created and played with a ball of energy, made my own visuals along with synesthesia, took Ketamine, audibly heard a specific song I focused on, and replayed a memory (visibly and audibly). I discovered how to alter my reality on LSD.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650ob0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 25, "report_reasons": null, "author": "WrathOfKond", "saved": false, "mod_reports": [], "name": "t3_650ob0", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/650ob0/creating_your_own_experience_lsd_xpost_from_rdrugs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492056774.0, "url": "https://www.reddit.com/r/Psychonaut/comments/650ob0/creating_your_own_experience_lsd_xpost_from_rdrugs/", "author_flair_text": null, "quarantine": false, "title": "Creating your own experience - LSD (X-post from r/drugs)", "created_utc": 1492027974.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_650ob0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_650ob0", "likes": null, "replies": "", "user_reports": [], "id": "dgdfki8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Da_Dolphin", "parent_id": "t1_dg6tbx1", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Do you think it would work out with heavier problems? Like repressed memories and trauma? That's an extremely interesting method but wouldnt one need some peace of mind for it to be successful? If you have intrusive thoughts/loops for instance. There is a similar method called \"focusing\" where you can solve most psychological problems by focusing on a feeling you get in your guts area after mentally asking a question. It is a sort of blending between body scan and meditation.\n\nOn 1P-lsd i get to the point where i can see other perspectives without efforts. I can see how my current actions and behaviour within this context would compare to what i could do if i changed this or that part of myself, something i'm unable to do \"sober\". But once the effects wear off, it seems to fade away in my subconscious and my flaws come back as if nothing happened but of course something did change not just profoundly enough. This was with 100mcg. Should i up the dosage or rather take time to explore? I don't know how much of a difference it makes but i'm constantly dissociated (DPdr) so the effects of lsd are rather pleasant since i'm already in between worlds. And i know it could potentially be used to my advantage. For example, i experience no fear nor anxiety during the whole trip. It might change with higher dosage though. What i'm trying to do is, unlock my inner self and free my ego from its suffering and crippling perspective and get out of dpdr. ", "edited": 1492433616.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think it would work out with heavier problems? Like repressed memories and trauma? That&amp;#39;s an extremely interesting method but wouldnt one need some peace of mind for it to be successful? If you have intrusive thoughts/loops for instance. There is a similar method called &amp;quot;focusing&amp;quot; where you can solve most psychological problems by focusing on a feeling you get in your guts area after mentally asking a question. It is a sort of blending between body scan and meditation.&lt;/p&gt;\n\n&lt;p&gt;On 1P-lsd i get to the point where i can see other perspectives without efforts. I can see how my current actions and behaviour within this context would compare to what i could do if i changed this or that part of myself, something i&amp;#39;m unable to do &amp;quot;sober&amp;quot;. But once the effects wear off, it seems to fade away in my subconscious and my flaws come back as if nothing happened but of course something did change not just profoundly enough. This was with 100mcg. Should i up the dosage or rather take time to explore? I don&amp;#39;t know how much of a difference it makes but i&amp;#39;m constantly dissociated (DPdr) so the effects of lsd are rather pleasant since i&amp;#39;m already in between worlds. And i know it could potentially be used to my advantage. For example, i experience no fear nor anxiety during the whole trip. It might change with higher dosage though. What i&amp;#39;m trying to do is, unlock my inner self and free my ego from its suffering and crippling perspective and get out of dpdr. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdfki8", "score_hidden": false, "stickied": false, "created": 1492461917.0, "created_utc": 1492433117.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6tbx1", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "homeliss", "parent_id": "t3_650ob0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "A shift in consciousness can be so powerful, but the trick is to use it to have actual effects on your life.\n\nAs an example, imagine if you could heal the part of yourself that overthinks things. You would probably be able to do a lot more awesome things in life, right?\n\nImagine that part. Visualize it in your mind. It might appear as an inanimate object or as a person. What color is it? What shape? If it's a person in the corner of the room, consciously bring them right in front of you and make eye contact.\n\nTalk to it. Try to understand how it's protecting you. At some point your brain believed it would be beneficial to put it there, so even though it may no longer be serving you, know that at some point it did. \n\nUnderstand how by asking questions. Notice that it's been working tirelessly to protect you for all your life. How many family members or friends of yours can say the same? It at least deserves some gratitude, appreciation, and love, so send it some.\n\nRespect it for working so hard even though you've probably never thanked it, and most likely have hated and been ashamed of it.\n\nAt the end, if it feels loved and appreciated, ask it if it wants to go on holiday for a bit. Tell it you've been a good student and can take care of yourself from now on. Ask it if it's okay if you're in control for a bit. If it feels understood it will say yes.\n\nThis exercise is good enough sober, but doing it on LSD makes it COME ALIVE. In an hour I healed and solved decades worth of problems. My high lasted a month. I made permanent changes to my behavior.\n\nYou can literally do this with anything.", "edited": 1492042473.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A shift in consciousness can be so powerful, but the trick is to use it to have actual effects on your life.&lt;/p&gt;\n\n&lt;p&gt;As an example, imagine if you could heal the part of yourself that overthinks things. You would probably be able to do a lot more awesome things in life, right?&lt;/p&gt;\n\n&lt;p&gt;Imagine that part. Visualize it in your mind. It might appear as an inanimate object or as a person. What color is it? What shape? If it&amp;#39;s a person in the corner of the room, consciously bring them right in front of you and make eye contact.&lt;/p&gt;\n\n&lt;p&gt;Talk to it. Try to understand how it&amp;#39;s protecting you. At some point your brain believed it would be beneficial to put it there, so even though it may no longer be serving you, know that at some point it did. &lt;/p&gt;\n\n&lt;p&gt;Understand how by asking questions. Notice that it&amp;#39;s been working tirelessly to protect you for all your life. How many family members or friends of yours can say the same? It at least deserves some gratitude, appreciation, and love, so send it some.&lt;/p&gt;\n\n&lt;p&gt;Respect it for working so hard even though you&amp;#39;ve probably never thanked it, and most likely have hated and been ashamed of it.&lt;/p&gt;\n\n&lt;p&gt;At the end, if it feels loved and appreciated, ask it if it wants to go on holiday for a bit. Tell it you&amp;#39;ve been a good student and can take care of yourself from now on. Ask it if it&amp;#39;s okay if you&amp;#39;re in control for a bit. If it feels understood it will say yes.&lt;/p&gt;\n\n&lt;p&gt;This exercise is good enough sober, but doing it on LSD makes it COME ALIVE. In an hour I healed and solved decades worth of problems. My high lasted a month. I made permanent changes to my behavior.&lt;/p&gt;\n\n&lt;p&gt;You can literally do this with anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6tbx1", "score_hidden": false, "stickied": false, "created": 1492071080.0, "created_utc": 1492042280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_650ob0", "likes": null, "replies": "", "user_reports": [], "id": "dg6nltt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "kcorda", "parent_id": "t3_650ob0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "after tripping at concerts I can turn my head into a music box with very high accuracy. can create my own music/play music I know\n\nwhen sober if I stare at something long enough I can change the color of it, with my mental intentions. Any color.\n\nif I am tripping really hard I can alter reality to whatever I want, with enough will power. ex: I imagined my friend falling down and in my perception of reality he 100% did, even though he didn't irl.\n\nI am scared to further pursue this, at the highest level I imagine its possible to completely shape and create your own version of reality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;after tripping at concerts I can turn my head into a music box with very high accuracy. can create my own music/play music I know&lt;/p&gt;\n\n&lt;p&gt;when sober if I stare at something long enough I can change the color of it, with my mental intentions. Any color.&lt;/p&gt;\n\n&lt;p&gt;if I am tripping really hard I can alter reality to whatever I want, with enough will power. ex: I imagined my friend falling down and in my perception of reality he 100% did, even though he didn&amp;#39;t irl.&lt;/p&gt;\n\n&lt;p&gt;I am scared to further pursue this, at the highest level I imagine its possible to completely shape and create your own version of reality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg6nltt", "score_hidden": false, "stickied": false, "created": 1492063974.0, "created_utc": 1492035174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_650ob0", "likes": null, "replies": "", "user_reports": [], "id": "dg70ubr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ForgottenUsername3", "parent_id": "t3_650ob0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Wow, great experience. I've haven't had anything like that. My doses were either not strong enough to alter me in that way, or so strong that they blew me out of the water. I would definitely like an experience where interesting neurological crosstalk type things were happening but where I still had a degree of control. I felt that during a 150ug trip, I might have been able to do something interesting if I had been able to go off by myself to experiment. Thanks for sharing! Sounds super cool.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, great experience. I&amp;#39;ve haven&amp;#39;t had anything like that. My doses were either not strong enough to alter me in that way, or so strong that they blew me out of the water. I would definitely like an experience where interesting neurological crosstalk type things were happening but where I still had a degree of control. I felt that during a 150ug trip, I might have been able to do something interesting if I had been able to go off by myself to experiment. Thanks for sharing! Sounds super cool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg70ubr", "score_hidden": false, "stickied": false, "created": 1492080315.0, "created_utc": 1492051515.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_650ob0", "likes": null, "replies": "", "user_reports": [], "id": "dg70loo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "phyyr", "parent_id": "t3_650ob0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "the power of the mind", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the power of the mind&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg70loo", "score_hidden": false, "stickied": false, "created": 1492080002.0, "created_utc": 1492051202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_650ob0", "likes": null, "replies": "", "user_reports": [], "id": "dg75vx5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UndecipherdMoonrunes", "parent_id": "t3_650ob0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "While I've personally never gotten to that level of interaction, LSD has opened me up to the idea that consciousness is fundamental, and our \"physical\" reality is actually manifestations of a higher conscious entity. That our world really is as pliable like that as a virtual space. It is incredible that these chemicals can alter our perception in such a way that we become more aware and able to channel our consciousness. I feel like this would be a more common sober ability but that this society has effectively brainwashed us to not believe in the power of your own consciousness, that this universe is only comprised of unthinking matter, and that mind has very little interaction with it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While I&amp;#39;ve personally never gotten to that level of interaction, LSD has opened me up to the idea that consciousness is fundamental, and our &amp;quot;physical&amp;quot; reality is actually manifestations of a higher conscious entity. That our world really is as pliable like that as a virtual space. It is incredible that these chemicals can alter our perception in such a way that we become more aware and able to channel our consciousness. I feel like this would be a more common sober ability but that this society has effectively brainwashed us to not believe in the power of your own consciousness, that this universe is only comprised of unthinking matter, and that mind has very little interaction with it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg75vx5", "score_hidden": false, "stickied": false, "created": 1492087729.0, "created_utc": 1492058929.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_650ob0", "likes": null, "replies": "", "user_reports": [], "id": "dg7ytxp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "user-696", "parent_id": "t3_650ob0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "yes i loved making 3d objects they were very samll but it was awesome like at the end of my finger tips you could see the energy and create balls and stuff, also if you hold your hand like a pyramid you could see the waves and mess around with that ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yes i loved making 3d objects they were very samll but it was awesome like at the end of my finger tips you could see the energy and create balls and stuff, also if you hold your hand like a pyramid you could see the waves and mess around with that &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg7ytxp", "score_hidden": false, "stickied": false, "created": 1492136127.0, "created_utc": 1492107327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]