[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few years ago, I would experiment with drugs, did psychedelics (all at average doses) maybe around 10 times. This was a beyond transformative experience and I really understood myself and the universe for a while. &lt;/p&gt;\n\n&lt;p&gt;A few of those times, I did research chemicals (25i, 25c, 25b i believe) which resulted in some brain damage and for a while I had pretty bad brain fog and wasn&amp;#39;t stable emotionally so I quite doing drugs all together (I was 14-15 when I did this stuff so the damage was pretty substantial despite me not doing super excessive amounts). Edit: The damage from this is practically gone and I no longer hold any resentment about it.  &lt;/p&gt;\n\n&lt;p&gt;After that, I spent more time than I should have around people who functioned with lots of ego and ignorance in their minds so they subconsciously brought me further away from my spiritual path. I&amp;#39;ve done acid once since then, and it was horrible. Instead of emotional ups and downs that would help me grow the first few times I tripped, it was considerably more downs. I would feel self-conscious, depressed, uncomfortable in my skin, and feel embarrassed about my existence. It&amp;#39;s far too bad to use the trip to work on my ego, too much to work on connecting with and embracing my higher self. I can&amp;#39;t even smoke weed anymore because I go into the same mindset, even when smoking alone just with the one person I am by far most comfortable and closest with.&lt;/p&gt;\n\n&lt;p&gt;I know that I don&amp;#39;t need drugs to get back to who I want to be, but I&amp;#39;ve had so much difficulty with keeping motivated to do so. Sitting down and clearing my mind to meditate is so difficult for me, so is keeping to being mindful and stepping away from my ego and emotions. &lt;/p&gt;\n\n&lt;p&gt;Has anyone been in a similar situation? I was hoping for some advice!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A few years ago, I would experiment with drugs, did psychedelics (all at average doses) maybe around 10 times. This was a beyond transformative experience and I really understood myself and the universe for a while. \n\nA few of those times, I did research chemicals (25i, 25c, 25b i believe) which resulted in some brain damage and for a while I had pretty bad brain fog and wasn't stable emotionally so I quite doing drugs all together (I was 14-15 when I did this stuff so the damage was pretty substantial despite me not doing super excessive amounts). Edit: The damage from this is practically gone and I no longer hold any resentment about it.  \n\n\nAfter that, I spent more time than I should have around people who functioned with lots of ego and ignorance in their minds so they subconsciously brought me further away from my spiritual path. I've done acid once since then, and it was horrible. Instead of emotional ups and downs that would help me grow the first few times I tripped, it was considerably more downs. I would feel self-conscious, depressed, uncomfortable in my skin, and feel embarrassed about my existence. It's far too bad to use the trip to work on my ego, too much to work on connecting with and embracing my higher self. I can't even smoke weed anymore because I go into the same mindset, even when smoking alone just with the one person I am by far most comfortable and closest with.\n\nI know that I don't need drugs to get back to who I want to be, but I've had so much difficulty with keeping motivated to do so. Sitting down and clearing my mind to meditate is so difficult for me, so is keeping to being mindful and stepping away from my ego and emotions. \n\nHas anyone been in a similar situation? I was hoping for some advice!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659eqn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "hardchoriste", "saved": false, "mod_reports": [], "name": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": 1492134313.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/659eqn/i_cant_do_lsd_anymore_how_do_i_get_back_on_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492158329.0, "url": "https://www.reddit.com/r/Psychonaut/comments/659eqn/i_cant_do_lsd_anymore_how_do_i_get_back_on_my/", "author_flair_text": null, "quarantine": false, "title": "I can't do LSD anymore, how do I get back on my spiritual path?", "created_utc": 1492129529.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dg8m1ot", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "too_real_4_TV", "parent_id": "t1_dg8knsd", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Actually there is good evidence light to moderate alcohol consumption enhances memory and reasoning ability.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually there is good evidence light to moderate alcohol consumption enhances memory and reasoning ability.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8m1ot", "score_hidden": false, "stickied": false, "created": 1492164838.0, "created_utc": 1492136038.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8knsd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ninja180p", "parent_id": "t1_dg8ixts", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "The brain damage was inconclusive I reckon, did you declare you had it? Drinking causes brain damage. Depending on which spiritual path you're pursuing you can just join a subreddit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The brain damage was inconclusive I reckon, did you declare you had it? Drinking causes brain damage. Depending on which spiritual path you&amp;#39;re pursuing you can just join a subreddit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8knsd", "score_hidden": false, "stickied": false, "created": 1492162897.0, "created_utc": 1492134097.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ixts", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hardchoriste", "parent_id": "t1_dg8i2ef", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "The effects of the brain damage are mostly gone. I used to be super hung up on it, but worked through that and just accepted that it is what it is. I don't do drugs anymore. The most I'll do is drink occasionally.  The last acid trip i described was 2-3 years ago. I's say I'm pretty healthy, I don't think unfulfilled physical needs are the source of my \"funk\" but maybe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The effects of the brain damage are mostly gone. I used to be super hung up on it, but worked through that and just accepted that it is what it is. I don&amp;#39;t do drugs anymore. The most I&amp;#39;ll do is drink occasionally.  The last acid trip i described was 2-3 years ago. I&amp;#39;s say I&amp;#39;m pretty healthy, I don&amp;#39;t think unfulfilled physical needs are the source of my &amp;quot;funk&amp;quot; but maybe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8ixts", "score_hidden": false, "stickied": false, "created": 1492160524.0, "created_utc": 1492131724.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8i2ef", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Ninja180p", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "You sound like you have a lot of 'funk' in your mind, and should focus on lifestyle , proper diet and hydration and exercise, and generally you need to relax and ease up on the mindset of having incurred brain damage.\n\nYou either want to tread slowly on your drugs of choice or leave them be altogether. (Just a gentle nod, but lucy/mush makes me clear headed galore)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like you have a lot of &amp;#39;funk&amp;#39; in your mind, and should focus on lifestyle , proper diet and hydration and exercise, and generally you need to relax and ease up on the mindset of having incurred brain damage.&lt;/p&gt;\n\n&lt;p&gt;You either want to tread slowly on your drugs of choice or leave them be altogether. (Just a gentle nod, but lucy/mush makes me clear headed galore)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8i2ef", "score_hidden": false, "stickied": false, "created": 1492159342.0, "created_utc": 1492130542.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dg8t9yr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jchazu", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Your story very much mirrors my own; I tripped too hard once in my early twenties and was just \"not quite right\" spiritually speaking for several years. I had tried psychs again a few times but ultimately I learned that at this point in my path the next step was to integrate what I have already learned into my life and move on. You seem to be at a similar place - as you said, you know you don't need drugs. That's great! You don't. So proceed with grace and curiosity! This is the fun part. Something inside you is telling you that it doesn't like wearing the psychedelic hat anymore, so try on some different ones. Or maybe you'll find out you're best without a hat at all - who knows?\n\nMy advice would be to start with what you know, and work from there. Something's pulling you in a certain direction, otherwise you wouldn't be here asking this question. Explore that, see where it takes you. I very much recommend meditation also - it can be difficult if you look at it as achieving a completely clear mind (that rarely happens, and I've been meditating for years), so I'd encourage you to stick with it, and maybe change at how you look at it. What if you viewed meditation as the process of sitting and focusing on your breath, and then inevitably thinking because you're a human and that's what you're conditioned to do, but returning your attention to your breath when you realize it? If you just view it as the process of sitting and continually returning to the breath, you might find it far less difficult.\n\nHappy travels!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your story very much mirrors my own; I tripped too hard once in my early twenties and was just &amp;quot;not quite right&amp;quot; spiritually speaking for several years. I had tried psychs again a few times but ultimately I learned that at this point in my path the next step was to integrate what I have already learned into my life and move on. You seem to be at a similar place - as you said, you know you don&amp;#39;t need drugs. That&amp;#39;s great! You don&amp;#39;t. So proceed with grace and curiosity! This is the fun part. Something inside you is telling you that it doesn&amp;#39;t like wearing the psychedelic hat anymore, so try on some different ones. Or maybe you&amp;#39;ll find out you&amp;#39;re best without a hat at all - who knows?&lt;/p&gt;\n\n&lt;p&gt;My advice would be to start with what you know, and work from there. Something&amp;#39;s pulling you in a certain direction, otherwise you wouldn&amp;#39;t be here asking this question. Explore that, see where it takes you. I very much recommend meditation also - it can be difficult if you look at it as achieving a completely clear mind (that rarely happens, and I&amp;#39;ve been meditating for years), so I&amp;#39;d encourage you to stick with it, and maybe change at how you look at it. What if you viewed meditation as the process of sitting and focusing on your breath, and then inevitably thinking because you&amp;#39;re a human and that&amp;#39;s what you&amp;#39;re conditioned to do, but returning your attention to your breath when you realize it? If you just view it as the process of sitting and continually returning to the breath, you might find it far less difficult.&lt;/p&gt;\n\n&lt;p&gt;Happy travels!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8t9yr", "score_hidden": false, "stickied": false, "created": 1492176622.0, "created_utc": 1492147822.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dg8km7h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Johnmarmalade", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I feel like drugs aren't spiritually enriching if you don't have peace of mind as is. Obviously doing drugs to make life less shitty is not the right reason to do drugs.\n\nThere's plenty of other spiritually enriching things you can do. For me personally, Ive been 100% sober for about two months now. I found that waking up early before anyone else and having breakfast alone allowed me to clear my head and prep me for the day ahead. \n\nEveryone's different. I suggest try different things and hopefully you'll find something that can clear up the fog in your head whether it be painting, or taking care of a fish tank. \n\nI know its not much to go off of but I hope this helps", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like drugs aren&amp;#39;t spiritually enriching if you don&amp;#39;t have peace of mind as is. Obviously doing drugs to make life less shitty is not the right reason to do drugs.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s plenty of other spiritually enriching things you can do. For me personally, Ive been 100% sober for about two months now. I found that waking up early before anyone else and having breakfast alone allowed me to clear my head and prep me for the day ahead. &lt;/p&gt;\n\n&lt;p&gt;Everyone&amp;#39;s different. I suggest try different things and hopefully you&amp;#39;ll find something that can clear up the fog in your head whether it be painting, or taking care of a fish tank. &lt;/p&gt;\n\n&lt;p&gt;I know its not much to go off of but I hope this helps&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8km7h", "score_hidden": false, "stickied": false, "created": 1492162840.0, "created_utc": 1492134040.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dg8tctz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Compromeister", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "The problem I see is that you are focused on going back to gain what you had when that's not really want you wanted to begin with. If you want to be more spiritual then try to be in this present moment when you catch yourself stuck in the past. Psychedelics will not improve you, though they may show you what you need to improve to be the person you want to be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem I see is that you are focused on going back to gain what you had when that&amp;#39;s not really want you wanted to begin with. If you want to be more spiritual then try to be in this present moment when you catch yourself stuck in the past. Psychedelics will not improve you, though they may show you what you need to improve to be the person you want to be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8tctz", "score_hidden": false, "stickied": false, "created": 1492176773.0, "created_utc": 1492147973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dg8w6hj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dm_fucking_t", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I had a similar experience with lsd turning on me for a while. \nI'll give my two cents: \n\nthe fact that you are thinking about this and reaching out here shows that you are already getting back on your spiritual path! *fist bump\n\nEverything you need is in your body. It can be hard to listen to our bodies with our brains being loud, so whatever it is that quiets it, do that. It might be meditation, it could be skateboarding, or running, or cooking, or playing music. Whatever makes you happy. \n\nOne thing our bodies can tell us is when things are a joy to do. I suggest following that. A big part of my spiritual practice is trying to do what I love, and love it as hard as I can. \n\nI also recommend googling spiritual subjects that you have heard of and might be interested in and seeing what interests you. We live in a truly amazing time when you can learn endlessly about everything from Kundalini Yoga, to the Kabbalah, to channeling, to lucid dreaming! There are tons of amazing ways for us to explore our spirituality, and you can do whatever you want! \n\nIf sitting meditation is difficult for you, don't feel bad. That is only one way. It is very powerful, so people it works for often swear by it, which is awesome for that. But if I sit still its terrible. I hate it. I like to move. For that yoga, and more recently (and especially) kundalini yoga has been life changing. \n\nI wish you the best in your journey!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a similar experience with lsd turning on me for a while. \nI&amp;#39;ll give my two cents: &lt;/p&gt;\n\n&lt;p&gt;the fact that you are thinking about this and reaching out here shows that you are already getting back on your spiritual path! *fist bump&lt;/p&gt;\n\n&lt;p&gt;Everything you need is in your body. It can be hard to listen to our bodies with our brains being loud, so whatever it is that quiets it, do that. It might be meditation, it could be skateboarding, or running, or cooking, or playing music. Whatever makes you happy. &lt;/p&gt;\n\n&lt;p&gt;One thing our bodies can tell us is when things are a joy to do. I suggest following that. A big part of my spiritual practice is trying to do what I love, and love it as hard as I can. &lt;/p&gt;\n\n&lt;p&gt;I also recommend googling spiritual subjects that you have heard of and might be interested in and seeing what interests you. We live in a truly amazing time when you can learn endlessly about everything from Kundalini Yoga, to the Kabbalah, to channeling, to lucid dreaming! There are tons of amazing ways for us to explore our spirituality, and you can do whatever you want! &lt;/p&gt;\n\n&lt;p&gt;If sitting meditation is difficult for you, don&amp;#39;t feel bad. That is only one way. It is very powerful, so people it works for often swear by it, which is awesome for that. But if I sit still its terrible. I hate it. I like to move. For that yoga, and more recently (and especially) kundalini yoga has been life changing. &lt;/p&gt;\n\n&lt;p&gt;I wish you the best in your journey!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8w6hj", "score_hidden": false, "stickied": false, "created": 1492183555.0, "created_utc": 1492154755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dg8xctk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LaxRelaxRepeat", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I took a break from drugs and just started dreaming dreams at night seeing what that has to do with my subconscious and where I stand in life at the moment. Dreams can be crazy and take your mind to some real far out places ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I took a break from drugs and just started dreaming dreams at night seeing what that has to do with my subconscious and where I stand in life at the moment. Dreams can be crazy and take your mind to some real far out places &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8xctk", "score_hidden": false, "stickied": false, "created": 1492187049.0, "created_utc": 1492158249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dg9f84d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zamonie", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "&gt; After that, I spent more time than I should have around people who functioned with lots of ego and ignorance in their minds so they subconsciously brought me further away from my spiritual path.\n\nTo me your post sounds like you may have difficulties drawing boundaries between toxic behaviours of other people and what you know is healthy. You might have difficulties drawing boundaries to those toxic people even if you technically have no contact with them. I have no contact with my father since 3 years and am still, unfortunately, too much in contact with him in a toxic way. (Improving it though.) Cutting people out is a good and healthy step but it does not necessarily mean we cut them out emotionally. Conversely, it's possible to be in contact with toxic people but to be selective in your own mind so that they don't harm us (or hardly harm us), similar to someone with a fulll-body armour treating someone with ebola. Their hands and face and mind are there, working on the ebola patient, but a very specific protection ensures that no ebola viruses harm them.\n\nWhat people try here on this sub is enhancing your mind with substances. But in this sentence - \"enhancing your mind with substances\", it includes two things - the substances - but also your mind. Meditation and substances don't *automatically* make certain things happen, like mindfulness. If you find that substances bring out painful parts of your mind, maybe the message is that you need to work on them in a \"hands-on\" way? Maybe the acid showed you in which way you are having difficulties with those people and that you can't avoid them by just not doing what they do, but that you'd need more work on this, maybe. Different solutions to the ones you're currently using.\n\nWhat helped me bring peace to myself in a considerable way and not \"join in\" with those harmful energies by other people was to understand what made people become narcissistic. That way, I could disregard their narcissistic influences very specifically without having to avoid them altogether as a person. Cognitive understanding is a tool that shouldn't be underestimated and that, to me at least, brought great relief.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;After that, I spent more time than I should have around people who functioned with lots of ego and ignorance in their minds so they subconsciously brought me further away from my spiritual path.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To me your post sounds like you may have difficulties drawing boundaries between toxic behaviours of other people and what you know is healthy. You might have difficulties drawing boundaries to those toxic people even if you technically have no contact with them. I have no contact with my father since 3 years and am still, unfortunately, too much in contact with him in a toxic way. (Improving it though.) Cutting people out is a good and healthy step but it does not necessarily mean we cut them out emotionally. Conversely, it&amp;#39;s possible to be in contact with toxic people but to be selective in your own mind so that they don&amp;#39;t harm us (or hardly harm us), similar to someone with a fulll-body armour treating someone with ebola. Their hands and face and mind are there, working on the ebola patient, but a very specific protection ensures that no ebola viruses harm them.&lt;/p&gt;\n\n&lt;p&gt;What people try here on this sub is enhancing your mind with substances. But in this sentence - &amp;quot;enhancing your mind with substances&amp;quot;, it includes two things - the substances - but also your mind. Meditation and substances don&amp;#39;t &lt;em&gt;automatically&lt;/em&gt; make certain things happen, like mindfulness. If you find that substances bring out painful parts of your mind, maybe the message is that you need to work on them in a &amp;quot;hands-on&amp;quot; way? Maybe the acid showed you in which way you are having difficulties with those people and that you can&amp;#39;t avoid them by just not doing what they do, but that you&amp;#39;d need more work on this, maybe. Different solutions to the ones you&amp;#39;re currently using.&lt;/p&gt;\n\n&lt;p&gt;What helped me bring peace to myself in a considerable way and not &amp;quot;join in&amp;quot; with those harmful energies by other people was to understand what made people become narcissistic. That way, I could disregard their narcissistic influences very specifically without having to avoid them altogether as a person. Cognitive understanding is a tool that shouldn&amp;#39;t be underestimated and that, to me at least, brought great relief.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg9f84d", "score_hidden": false, "stickied": false, "created": 1492218557.0, "created_utc": 1492189757.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dgbpu3f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "youwritinabookhippie", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "You should stop if it's not good anymore.  It's just my opinion but I think these drugs are only a helpful for a little while. Eventually life has to become your trip.  Everything changes.  For me that is the primary lesson.  \n\nChange up your routine for a bit. Try some new practices.  There is no escape from life so when we try we find suffering down the road.", "edited": 1492319652.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should stop if it&amp;#39;s not good anymore.  It&amp;#39;s just my opinion but I think these drugs are only a helpful for a little while. Eventually life has to become your trip.  Everything changes.  For me that is the primary lesson.  &lt;/p&gt;\n\n&lt;p&gt;Change up your routine for a bit. Try some new practices.  There is no escape from life so when we try we find suffering down the road.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbpu3f", "score_hidden": false, "stickied": false, "created": 1492348147.0, "created_utc": 1492319347.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_659eqn", "likes": null, "replies": "", "user_reports": [], "id": "dg8tluh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "-Intronaut-", "parent_id": "t1_dg8sj9s", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Hello sista! It's the minds nature to wander, all you gotta do is watch without judgement or attaching any feeling to the thoughts that the mind throws at you. Keep going and soon you will have a firmer grip on who you really are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello sista! It&amp;#39;s the minds nature to wander, all you gotta do is watch without judgement or attaching any feeling to the thoughts that the mind throws at you. Keep going and soon you will have a firmer grip on who you really are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8tluh", "score_hidden": false, "stickied": false, "created": 1492177285.0, "created_utc": 1492148485.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8sj9s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "hardchoriste", "parent_id": "t1_dg8ryjx", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I'm already vegan, and I cut out all negative people from my life long ago. and I'll keep trying to meditate, it's just so difficult to not let my mind wander. Also *sister lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m already vegan, and I cut out all negative people from my life long ago. and I&amp;#39;ll keep trying to meditate, it&amp;#39;s just so difficult to not let my mind wander. Also *sister lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8sj9s", "score_hidden": false, "stickied": false, "created": 1492175170.0, "created_utc": 1492146370.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ryjx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "-Intronaut-", "parent_id": "t3_659eqn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Eat fresh food, avoid meat, go out, leave the old set of friends and find new ones. Meditation is a must brother or the mind gonna abuse you. Get to know who you are and what the mind is. Once you are able to distance yourself from mind you will come to closer to your true self and happiness will flow from within. No need for external stimulants or sedatives of any kind. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eat fresh food, avoid meat, go out, leave the old set of friends and find new ones. Meditation is a must brother or the mind gonna abuse you. Get to know who you are and what the mind is. Once you are able to distance yourself from mind you will come to closer to your true self and happiness will flow from within. No need for external stimulants or sedatives of any kind. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg8ryjx", "score_hidden": false, "stickied": false, "created": 1492174081.0, "created_utc": 1492145281.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]