[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Below is the playlist I was listening to when I had the following experience while on LSD. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://soundcloud.com/hardfest/hsmf16-official-mixtape-series-3-louis-the-child\"&gt;https://soundcloud.com/hardfest/hsmf16-official-mixtape-series-3-louis-the-child&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It was about 8pm when I took the first tab. I was hanging out at a friends house, but I was the only one that was tripping that night. My friends were watching Taboo on one tv and since I was tripping and didn&amp;#39;t want to be scared and peak watching Taboo, I put my headphones in and played FIFA on the second tv (he has a 2 TV set up in the living room). Time went by and I didn&amp;#39;t start peaking of the first tab till around 11pm. My friends left an hour later to go to bed. So I was by myself at that point, I was feeling pretty good and figured that at this point it was just gonna be all visuals (I&amp;#39;ve taken this batch a few times already), so I decided to take a 2nd tab to make the visuals a little more intense.&lt;/p&gt;\n\n&lt;p&gt;Midnight comes around and I can&amp;#39;t play FIFA anymore, it&amp;#39;s too much to handle and it&amp;#39;s kinda hard to use the XBox controller. So I decided to watch something. I kick on Hulu, search: Documentary, scroll all the way down to: NASA Documentaries, then I click on &amp;quot;Cosmic Vistas&amp;quot; and I scroll through all the episodes and click on a random one.. then I just stick back on the couch and watch the screen for the visuals.&lt;/p&gt;\n\n&lt;p&gt;Now at this point the playlist comes on, it&amp;#39;s pitch dark in the living room. All I see is the 50&amp;quot; TV in front of me. As the music plays on I loose myself in my thoughts. I begin to talk to myself in my head and then on the screen a man appears, he&amp;#39;s saying something but I can&amp;#39;t hear because I have my headphones in. So come up with what he&amp;#39;s says to me. &amp;quot;Okay listen man, you&amp;#39;re about to see something incredible. Something immense. Just stay calm, just go with it and everything will be okay.&amp;quot; Gave me 2 thumps up and then the screen went black. The corners of the wall behind the tv and around the room collapsed. All I saw was black. And then I saw the tv screen light up with a lot of little tiny lights, millions of them, they were stars. I was in the universe. With my finger I pointed at a section of stars, I was zoomed into that section. Then I was in that section and within that section I picked out a single star. And I was zoomed into that star. And what I saw was unbelievable.I was floating around this nebula, like if I was inside the cockpit of a small aircraft, and while I was floating out side of the nebula I felt this immense force pin me down. I couldn&amp;#39;t move and I got scared, but then I remembered the man say &amp;quot;just go with it..&amp;quot; and so I did. All that fear went away, and just as it went away I entered this nebula. And it was the most beautiful thing I had ever seen. It was shaped like a dome, I looked up and saw how HUGE this was, and there were columns (like in Roman buildings) where Blue and Pink &amp;quot;dust&amp;quot; was coming together and what seemed like was forming new stars. And then I realized I was witnessing the creation of stars. And then it became too much for me. &lt;/p&gt;\n\n&lt;p&gt;I got scared again. And I was zoomed out from inside the nebula. And I saw it&amp;#39;s enormous size from the outside. I was zoomed out again. And I saw all the millions and millions of stars. And then i was zoomed out one more time and turned around.. and I saw Earth. Floating there, I was looking at it from the moon... I closed my eyes and everything went away and I was back in my friends apartment. I took my headphones out, turned off Hulu because I couldn&amp;#39;t watch the universe anymore. I was panting, sweating, I turn on Netflix and the first thing that is given as an option to play is Africa, a documentary by BBC. And it just have this awesome powerful introduction to the documentary saying why Africa&amp;#39;s wildlife and why it&amp;#39;s as beautiful as it is. I started crying and because overwhelmed with happiness and joy. At that moment I realized that everything that exists was designed so carefully in detail. Everything that exists as far as life, was designed perfectly by someone/thing, maybe a higher being, I don&amp;#39;t know... at this point it&amp;#39;s 3am. For the remaining time of my trip I just start thinking about how thankful I am to be here. How I&amp;#39;m just a tiny part of this HUGE cycle. And because of what I experienced I want to be as perfect as possible. &lt;/p&gt;\n\n&lt;p&gt;Thank you guys for reading, sorry for the long story lol but let me me know what you guys think or if anyone has had an similar experiences! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Below is the playlist I was listening to when I had the following experience while on LSD. \n\nhttps://soundcloud.com/hardfest/hsmf16-official-mixtape-series-3-louis-the-child\n\nIt was about 8pm when I took the first tab. I was hanging out at a friends house, but I was the only one that was tripping that night. My friends were watching Taboo on one tv and since I was tripping and didn't want to be scared and peak watching Taboo, I put my headphones in and played FIFA on the second tv (he has a 2 TV set up in the living room). Time went by and I didn't start peaking of the first tab till around 11pm. My friends left an hour later to go to bed. So I was by myself at that point, I was feeling pretty good and figured that at this point it was just gonna be all visuals (I've taken this batch a few times already), so I decided to take a 2nd tab to make the visuals a little more intense.\n\nMidnight comes around and I can't play FIFA anymore, it's too much to handle and it's kinda hard to use the XBox controller. So I decided to watch something. I kick on Hulu, search: Documentary, scroll all the way down to: NASA Documentaries, then I click on \"Cosmic Vistas\" and I scroll through all the episodes and click on a random one.. then I just stick back on the couch and watch the screen for the visuals.\n\nNow at this point the playlist comes on, it's pitch dark in the living room. All I see is the 50\" TV in front of me. As the music plays on I loose myself in my thoughts. I begin to talk to myself in my head and then on the screen a man appears, he's saying something but I can't hear because I have my headphones in. So come up with what he's says to me. \"Okay listen man, you're about to see something incredible. Something immense. Just stay calm, just go with it and everything will be okay.\" Gave me 2 thumps up and then the screen went black. The corners of the wall behind the tv and around the room collapsed. All I saw was black. And then I saw the tv screen light up with a lot of little tiny lights, millions of them, they were stars. I was in the universe. With my finger I pointed at a section of stars, I was zoomed into that section. Then I was in that section and within that section I picked out a single star. And I was zoomed into that star. And what I saw was unbelievable.I was floating around this nebula, like if I was inside the cockpit of a small aircraft, and while I was floating out side of the nebula I felt this immense force pin me down. I couldn't move and I got scared, but then I remembered the man say \"just go with it..\" and so I did. All that fear went away, and just as it went away I entered this nebula. And it was the most beautiful thing I had ever seen. It was shaped like a dome, I looked up and saw how HUGE this was, and there were columns (like in Roman buildings) where Blue and Pink \"dust\" was coming together and what seemed like was forming new stars. And then I realized I was witnessing the creation of stars. And then it became too much for me. \n\nI got scared again. And I was zoomed out from inside the nebula. And I saw it's enormous size from the outside. I was zoomed out again. And I saw all the millions and millions of stars. And then i was zoomed out one more time and turned around.. and I saw Earth. Floating there, I was looking at it from the moon... I closed my eyes and everything went away and I was back in my friends apartment. I took my headphones out, turned off Hulu because I couldn't watch the universe anymore. I was panting, sweating, I turn on Netflix and the first thing that is given as an option to play is Africa, a documentary by BBC. And it just have this awesome powerful introduction to the documentary saying why Africa's wildlife and why it's as beautiful as it is. I started crying and because overwhelmed with happiness and joy. At that moment I realized that everything that exists was designed so carefully in detail. Everything that exists as far as life, was designed perfectly by someone/thing, maybe a higher being, I don't know... at this point it's 3am. For the remaining time of my trip I just start thinking about how thankful I am to be here. How I'm just a tiny part of this HUGE cycle. And because of what I experienced I want to be as perfect as possible. \n\nThank you guys for reading, sorry for the long story lol but let me me know what you guys think or if anyone has had an similar experiences! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65for6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "beanboy008", "saved": false, "mod_reports": [], "name": "t3_65for6", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/5kgbJEtI_c6aeYQm05zsam1Q8HNm1zlYadEvCemk6kk.jpg?s=04a8a19c6a2b0b2fc1afff164928e6fd", "width": 500, "height": 500}, "resolutions": [{"url": "https://i.redditmedia.com/5kgbJEtI_c6aeYQm05zsam1Q8HNm1zlYadEvCemk6kk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=895ac2290ffa7bf7f9438cca9eede602", "width": 108, "height": 108}, {"url": "https://i.redditmedia.com/5kgbJEtI_c6aeYQm05zsam1Q8HNm1zlYadEvCemk6kk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=91dcfdb0eb37db41135adf73545e0590", "width": 216, "height": 216}, {"url": "https://i.redditmedia.com/5kgbJEtI_c6aeYQm05zsam1Q8HNm1zlYadEvCemk6kk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=3b8473134507c6fad21e2e9e03962e1e", "width": 320, "height": 320}], "variants": {}, "id": "p9LbVH2sFdmQL0zNStwZOnhiEenffrnnyksMkA4zqdM"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/65for6/best_trip_of_my_life/", "num_reports": null, "locked": false, "stickied": false, "created": 1492237824.0, "url": "https://www.reddit.com/r/Psychonaut/comments/65for6/best_trip_of_my_life/", "author_flair_text": null, "quarantine": false, "title": "Best Trip of my Life", "created_utc": 1492209024.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65for6", "likes": null, "replies": "", "user_reports": [], "id": "dg9v4i1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beanboy008", "parent_id": "t3_65for6", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "*I apologize for typos", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;*I apologize for typos&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dg9v4i1", "score_hidden": false, "stickied": false, "created": 1492237952.0, "created_utc": 1492209152.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65for6", "likes": null, "replies": "", "user_reports": [], "id": "dga86bh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "justrealizednarciss", "parent_id": "t3_65for6", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Listening to the playlist while reading your story and imagining the lights on the TV sounds fucking aweeesome\n\nis LSD really that safe that so many people are trying it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Listening to the playlist while reading your story and imagining the lights on the TV sounds fucking aweeesome&lt;/p&gt;\n\n&lt;p&gt;is LSD really that safe that so many people are trying it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dga86bh", "score_hidden": false, "stickied": false, "created": 1492256027.0, "created_utc": 1492227227.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65for6", "likes": null, "replies": "", "user_reports": [], "id": "dga98cb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "beanboy008", "parent_id": "t3_65for6", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "It was one of the best experiences of my life. Hands down. And honestly yes. I was so tweaked out when I got asked to do it first, I didn't want to at first but I was curious so I did a lot of reading on it. Ultimately it comes down to you going into the trip with a positive state of mind, surround yourself in positive vibes and you're guaranteed a good time! Smoke some weed, play some chill tunes and you're set and ready to go my friend! \n\nhttps://soundcloud.com/allan_ramirez/sets/catching-waves\n\nhttps://m.soundcloud.com/allan_ramirez/sets/up-up-away\n\nThose are two pretty dope playlist with some chill tunes if you can listen to while tripping, if you ever decided to do it :) \n\nWatch Cosmos or any animal documentary and listen to the songs in either playlist lol swear it syncs perfectly haha\n\nPS. Also recommend watching \"Valley Uprising\" on Netflix, and just really zone in when you're watching it. Won't regret it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was one of the best experiences of my life. Hands down. And honestly yes. I was so tweaked out when I got asked to do it first, I didn&amp;#39;t want to at first but I was curious so I did a lot of reading on it. Ultimately it comes down to you going into the trip with a positive state of mind, surround yourself in positive vibes and you&amp;#39;re guaranteed a good time! Smoke some weed, play some chill tunes and you&amp;#39;re set and ready to go my friend! &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://soundcloud.com/allan_ramirez/sets/catching-waves\"&gt;https://soundcloud.com/allan_ramirez/sets/catching-waves&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://m.soundcloud.com/allan_ramirez/sets/up-up-away\"&gt;https://m.soundcloud.com/allan_ramirez/sets/up-up-away&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Those are two pretty dope playlist with some chill tunes if you can listen to while tripping, if you ever decided to do it :) &lt;/p&gt;\n\n&lt;p&gt;Watch Cosmos or any animal documentary and listen to the songs in either playlist lol swear it syncs perfectly haha&lt;/p&gt;\n\n&lt;p&gt;PS. Also recommend watching &amp;quot;Valley Uprising&amp;quot; on Netflix, and just really zone in when you&amp;#39;re watching it. Won&amp;#39;t regret it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dga98cb", "score_hidden": false, "stickied": false, "created": 1492257752.0, "created_utc": 1492228952.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]