[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The feeling is that everything is coming together.  Everything that has been experienced were little puzzle pieces that are all beginning to fit together.  There is this large culmination of everything concluding, everything showing me how it all, finally, comes together and ends.  No more puzzles, all answers are given, everything makes sense.  &lt;/p&gt;\n\n&lt;p&gt;All happy things are done, all contrived things are done, all necessary evils and unnecessary evils are done, you&amp;#39;ve had the most amazing life experience of all entities that have ever existed in an infinite universe, and you realize that it&amp;#39;s all over.  It has all lead to this.  The true realization that you are it.  But now you are done.&lt;/p&gt;\n\n&lt;p&gt;And somewhere, right outside of all of this, is the hysterical laughter of &amp;quot;what, you wanted more than &lt;em&gt;everything&lt;/em&gt;?&amp;quot; and how it&amp;#39;s all uproarious because they, or it, is laughing at you.  You are laughing at you.  Foolish you.  You know you&amp;#39;re about to give it all up, trying to take that last feeling of satisfaction.  Saying &amp;quot;ok ok you win&amp;quot; to the void.  Breathing your last struggled breath of the selfish self-absorbed &amp;quot;everything is about me, me and I can never die.&amp;quot;  I can keep trying to hang on and it&amp;#39;d be pitiful, or I can dive into the cavern willing to accept something I cannot predict.  The absolute nothingness.&lt;/p&gt;\n\n&lt;p&gt;Aaaaaaaaaaand something ... but the whole thing echoes like the watching of an old movie time and time again.  I&amp;#39;ve been here before, but backed out before the end?  Aaaaaaaaaaand something.  Like the final bounces of a tired bouncing ball, you&amp;#39;re about to say &amp;quot;fuck it&amp;quot; and let go into that timeless abyss of nothing.  Aaaaaaaaaaand something.  But what if there&amp;#39;s one more thing to figure out?  What if with that one final thing, you wouldn&amp;#39;t have to give it all up, that it wasn&amp;#39;t all a big joke, that you actually &lt;em&gt;are&lt;/em&gt; everything, and can &lt;em&gt;do&lt;/em&gt; anything, and can &lt;em&gt;be&lt;/em&gt; anything.  What if all you had to do, was forget the whole mess of it?  All the pieces can rearrange themselves into infinity again and I can simply be myself again, in a smaller place.  I can start over without everything known and facing the inevitable end.  &lt;/p&gt;\n\n&lt;p&gt;This thought alone opens up a new possibility!  Maybe I can stay!  Under what conditions would that even be feasible since everything is mine and everything that could been done has been done?\nAaaaaaaaaaand something.  Bounce, bounce, bounce.&lt;/p&gt;\n\n&lt;p&gt;Are you gonna make it?  Are you gonna figure out that one final thing?  Everything outside is wide-eyed in anticipation of your ... failure...? and your tumbling headfirst into black.  Like &amp;quot;ha, ha.&amp;quot;  How can there be something out there?  What else is there?  What haven&amp;#39;t I figured out?  Bounce, bounce.  Running out of time ... there&amp;#39;s one decision - to give up - that is final.  Are you gonna make it?  Are you gonna give up?  It&amp;#39;s been like this forever, this state is infinite, and the only escape is surrender.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s over, you&amp;#39;re tired, they win, you&amp;#39;re done.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This is my death.  This is everything ending.  All is done.  It&amp;#39;s ok to rest.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s ok to stop fighting.  It&amp;#39;s ok to be happy and thankful.  It&amp;#39;s ok to...&lt;/p&gt;\n\n&lt;p&gt;Bounce.&lt;/p&gt;\n\n&lt;p&gt;Aaaaaaaaaaand something.  There&amp;#39;s that note - there&amp;#39;s that song of the universe finally ending: the final note of the final chord of the final symphony.  And it&amp;#39;s magnificent.  Becoming a smaller and smaller dot, as everything slows to a stop.&lt;/p&gt;\n\n&lt;p&gt;Aaaaaaaaaaand something.  And I open my eyes.  And I&amp;#39;m back.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The feeling is that everything is coming together.  Everything that has been experienced were little puzzle pieces that are all beginning to fit together.  There is this large culmination of everything concluding, everything showing me how it all, finally, comes together and ends.  No more puzzles, all answers are given, everything makes sense.  \n\n\nAll happy things are done, all contrived things are done, all necessary evils and unnecessary evils are done, you've had the most amazing life experience of all entities that have ever existed in an infinite universe, and you realize that it's all over.  It has all lead to this.  The true realization that you are it.  But now you are done.\n\n\nAnd somewhere, right outside of all of this, is the hysterical laughter of \"what, you wanted more than *everything*?\" and how it's all uproarious because they, or it, is laughing at you.  You are laughing at you.  Foolish you.  You know you're about to give it all up, trying to take that last feeling of satisfaction.  Saying \"ok ok you win\" to the void.  Breathing your last struggled breath of the selfish self-absorbed \"everything is about me, me and I can never die.\"  I can keep trying to hang on and it'd be pitiful, or I can dive into the cavern willing to accept something I cannot predict.  The absolute nothingness.\n\n\nAaaaaaaaaaand something ... but the whole thing echoes like the watching of an old movie time and time again.  I've been here before, but backed out before the end?  Aaaaaaaaaaand something.  Like the final bounces of a tired bouncing ball, you're about to say \"fuck it\" and let go into that timeless abyss of nothing.  Aaaaaaaaaaand something.  But what if there's one more thing to figure out?  What if with that one final thing, you wouldn't have to give it all up, that it wasn't all a big joke, that you actually *are* everything, and can *do* anything, and can *be* anything.  What if all you had to do, was forget the whole mess of it?  All the pieces can rearrange themselves into infinity again and I can simply be myself again, in a smaller place.  I can start over without everything known and facing the inevitable end.  \n\n\nThis thought alone opens up a new possibility!  Maybe I can stay!  Under what conditions would that even be feasible since everything is mine and everything that could been done has been done?\nAaaaaaaaaaand something.  Bounce, bounce, bounce.\n\n\nAre you gonna make it?  Are you gonna figure out that one final thing?  Everything outside is wide-eyed in anticipation of your ... failure...? and your tumbling headfirst into black.  Like \"ha, ha.\"  How can there be something out there?  What else is there?  What haven't I figured out?  Bounce, bounce.  Running out of time ... there's one decision - to give up - that is final.  Are you gonna make it?  Are you gonna give up?  It's been like this forever, this state is infinite, and the only escape is surrender.\n\n\nIt's over, you're tired, they win, you're done.\n\n\n\"This is my death.  This is everything ending.  All is done.  It's ok to rest.\"\n\n\nIt's ok to stop fighting.  It's ok to be happy and thankful.  It's ok to...\n\n\nBounce.\n\n\nAaaaaaaaaaand something.  There's that note - there's that song of the universe finally ending: the final note of the final chord of the final symphony.  And it's magnificent.  Becoming a smaller and smaller dot, as everything slows to a stop.\n\n\nAaaaaaaaaaand something.  And I open my eyes.  And I'm back.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65fzkn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "yesyouaregod", "saved": false, "mod_reports": [], "name": "t3_65fzkn", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/65fzkn/what_did_i_choose_to_forget/", "num_reports": null, "locked": false, "stickied": false, "created": 1492241312.0, "url": "https://www.reddit.com/r/Psychonaut/comments/65fzkn/what_did_i_choose_to_forget/", "author_flair_text": null, "quarantine": false, "title": "What did I choose to forget?", "created_utc": 1492212512.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65fzkn", "likes": null, "replies": "", "user_reports": [], "id": "dgc0i3z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blowaway420", "parent_id": "t3_65fzkn", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": ":D\n\nMake a song...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:D&lt;/p&gt;\n\n&lt;p&gt;Make a song...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgc0i3z", "score_hidden": false, "stickied": false, "created": 1492377388.0, "created_utc": 1492348588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]