[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I posted this about 2 months ago and got overwhelmingly positive responses, but not many people actually saw it, so I figured it&amp;#39;s time to repost.  Hope you enjoy&lt;/p&gt;\n\n&lt;p&gt;After a strange and indescribable experience which I can only rationalize as reliving my own birth, I was transported to the middle of the woods. Somehow, I knew immediately that the woods were a metaphor for something, and the route I chose through these woods was a metaphor for my entire life up to now. It was a cold, dark, and windy night. I was scared, running blindly with no sense of where I was headed. From the blackness, vicious wild animals emerged and chased me as I ran. Behind every tree were evil monsters waiting to maim me when I passed. Terrified, I ran faster.  It did not help.  The animals and monsters remained right on my heels. I tripped and stumbled over roots as I frantically tried to escape. All of the sudden, a single word popped into my head: &lt;em&gt;Why?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Now I was sprinting as fast as my legs would carry me deeper and deeper into the woods. As I went, the night grew darker, the cold got colder, and the sky began to storm violently.  The way ahead became overgrown and nearly impassable.  I was fought through thickets of briars ignoring the painful scratches all over my body.  Through the shaking trees, the monsters were getting closer.  I kept falling in the mud and struggling back to my feet only to continue pressing forward. Again, the question rang in my ears, louder this time: &lt;em&gt;WHY?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The animals were upon me now.  Wolves began to take bites out of my legs from behind. From either side, the monsters clawed into my flesh. Despite my injuries, I continued in my futile effort to scramble away from the savage beasts intent on my annihilation. - &lt;em&gt;Why?&lt;/em&gt; -  I could feel the intense pain from my gaping, bleeding wounds. I could taste the mud, the blood, and the freezing rain. Still I struggled forward into the unknown. - &lt;em&gt;WHY?&lt;/em&gt; - The wolves took bigger and bigger bites.  My entire body was being ravaged to a bloody mess.  I knew I could not survive this way for much longer, but still I ran. - &lt;em&gt;Why am I doing this to myself?  For what reason?  Where am I going?  Why this?  Why not something different?&lt;/em&gt;  &lt;em&gt;Why? WHY? WHY?!? WHYYYY?!!!!!! WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY&lt;/em&gt;&lt;/p&gt;\n\n&lt;h1&gt;POW&lt;/h1&gt;\n\n&lt;p&gt;I was struck with a blinding golden light emanating from all directions.  It was so powerful it knocked me flat on the ground.  Dazed, I slumped up to a sitting position and saw that the woods had vanished.  In an instant, the horrible demonic creatures were gone as well.  I was in a silent grassy meadow that stretched as far my eyes could see.  I felt a glowing warmth wash over me as my wounds magically healed.  All was still and peaceful.  I looked up to the sky to discover the source of the heavenly light, but I could not.  It was &lt;em&gt;everywhere.&lt;/em&gt;  I now knew there was nothing left to fear, no reason to run anymore.  Relieved, I lay back down to fully enjoy this newfound tranquility.  Still gazing skyward, the golden light gave way to the depths of outer space.  I could peer infinitely far.  I witnessed stardust coalescing into bright burning orbs.  I watched those stars gather into rotating galaxies, the galaxies into massive superclusters.  Soon, the weight of my body disappeared as I floated up into the heavens.  I left this world and sailed among the stars.  Before I knew it, my body was gone, and so was the thing I call &amp;quot;I&amp;quot;.  All became one.  This was the final destination.  Things remained this way for an immeasurable amount of time.  It could have been eternity; it might have been a microsecond.  Time had no meaning anymore.  &lt;/p&gt;\n\n&lt;p&gt;Finally, I opened my eyes and found myself back in my living room.  I was alone and very much at peace.  The signature stink of DMT was still hanging in the air.  I felt something wet and saw my shirt was soaked with vomit.  &amp;quot;Why do I always throw up?  Oh well,&amp;quot; I thought.  I still needed time to get used to having a body again, so I just lay there on my beanbag for awhile breathing slowly, taking it all in.  Eventually, I rose to my feet to go shower and ponder what had just happened to me.  &amp;quot;What the fuck?&amp;quot; I said out loud as I looked at my olive-sized pupils in the mirror.  The whole point of this trip had been to find inspiration so I could write a song for a girl I was talking to.  I did not expect things to take a turn like this.  I certainly got everything I was looking for and a lot more...&lt;/p&gt;\n\n&lt;p&gt;Of all the countless times I have smoked DMT, this is the experience I remember the most vividly.  I have had many spiritual awakenings on the drug (and on a few other drugs as well), but this was different somehow.  After that day, I could no longer get to such extreme places with DMT.  I have blasted off and left my body about 10 times since then, but it was never like it used to be.  I think the DMT gods gave me my final lesson in that trip.  It&amp;#39;s a lesson from which I have drawn endless meaning.  It definitely changed me as a person.  I decided that I had nothing left to gain from smoking any more of it.  Now, almost 3 years later, I still have that same stash.  The only use I have for it is to help others begin their own journeys through space and time.  I like to think of it as my little way of giving back.&lt;/p&gt;\n\n&lt;p&gt;TL;DR&lt;/p&gt;\n\n&lt;p&gt;I went on my most meaningful DMT trip ever.  I almost got destroyed by monsters only to be saved by a heavenly light.  It altered the direction of my life. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "   I posted this about 2 months ago and got overwhelmingly positive responses, but not many people actually saw it, so I figured it's time to repost.  Hope you enjoy\n\n   After a strange and indescribable experience which I can only rationalize as reliving my own birth, I was transported to the middle of the woods. Somehow, I knew immediately that the woods were a metaphor for something, and the route I chose through these woods was a metaphor for my entire life up to now. It was a cold, dark, and windy night. I was scared, running blindly with no sense of where I was headed. From the blackness, vicious wild animals emerged and chased me as I ran. Behind every tree were evil monsters waiting to maim me when I passed. Terrified, I ran faster.  It did not help.  The animals and monsters remained right on my heels. I tripped and stumbled over roots as I frantically tried to escape. All of the sudden, a single word popped into my head: *Why?*\n\n   Now I was sprinting as fast as my legs would carry me deeper and deeper into the woods. As I went, the night grew darker, the cold got colder, and the sky began to storm violently.  The way ahead became overgrown and nearly impassable.  I was fought through thickets of briars ignoring the painful scratches all over my body.  Through the shaking trees, the monsters were getting closer.  I kept falling in the mud and struggling back to my feet only to continue pressing forward. Again, the question rang in my ears, louder this time: *WHY?*\n\n   The animals were upon me now.  Wolves began to take bites out of my legs from behind. From either side, the monsters clawed into my flesh. Despite my injuries, I continued in my futile effort to scramble away from the savage beasts intent on my annihilation. - *Why?* -  I could feel the intense pain from my gaping, bleeding wounds. I could taste the mud, the blood, and the freezing rain. Still I struggled forward into the unknown. - *WHY?* - The wolves took bigger and bigger bites.  My entire body was being ravaged to a bloody mess.  I knew I could not survive this way for much longer, but still I ran. - *Why am I doing this to myself?  For what reason?  Where am I going?  Why this?  Why not something different?*  *Why? WHY? WHY?!? WHYYYY?!!!!!! WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY WHY*\n\n# POW\n\nI was struck with a blinding golden light emanating from all directions.  It was so powerful it knocked me flat on the ground.  Dazed, I slumped up to a sitting position and saw that the woods had vanished.  In an instant, the horrible demonic creatures were gone as well.  I was in a silent grassy meadow that stretched as far my eyes could see.  I felt a glowing warmth wash over me as my wounds magically healed.  All was still and peaceful.  I looked up to the sky to discover the source of the heavenly light, but I could not.  It was *everywhere.*  I now knew there was nothing left to fear, no reason to run anymore.  Relieved, I lay back down to fully enjoy this newfound tranquility.  Still gazing skyward, the golden light gave way to the depths of outer space.  I could peer infinitely far.  I witnessed stardust coalescing into bright burning orbs.  I watched those stars gather into rotating galaxies, the galaxies into massive superclusters.  Soon, the weight of my body disappeared as I floated up into the heavens.  I left this world and sailed among the stars.  Before I knew it, my body was gone, and so was the thing I call \"I\".  All became one.  This was the final destination.  Things remained this way for an immeasurable amount of time.  It could have been eternity; it might have been a microsecond.  Time had no meaning anymore.  \n\nFinally, I opened my eyes and found myself back in my living room.  I was alone and very much at peace.  The signature stink of DMT was still hanging in the air.  I felt something wet and saw my shirt was soaked with vomit.  \"Why do I always throw up?  Oh well,\" I thought.  I still needed time to get used to having a body again, so I just lay there on my beanbag for awhile breathing slowly, taking it all in.  Eventually, I rose to my feet to go shower and ponder what had just happened to me.  \"What the fuck?\" I said out loud as I looked at my olive-sized pupils in the mirror.  The whole point of this trip had been to find inspiration so I could write a song for a girl I was talking to.  I did not expect things to take a turn like this.  I certainly got everything I was looking for and a lot more...\n\nOf all the countless times I have smoked DMT, this is the experience I remember the most vividly.  I have had many spiritual awakenings on the drug (and on a few other drugs as well), but this was different somehow.  After that day, I could no longer get to such extreme places with DMT.  I have blasted off and left my body about 10 times since then, but it was never like it used to be.  I think the DMT gods gave me my final lesson in that trip.  It's a lesson from which I have drawn endless meaning.  It definitely changed me as a person.  I decided that I had nothing left to gain from smoking any more of it.  Now, almost 3 years later, I still have that same stash.  The only use I have for it is to help others begin their own journeys through space and time.  I like to think of it as my little way of giving back.\n\nTL;DR\n\nI went on my most meaningful DMT trip ever.  I almost got destroyed by monsters only to be saved by a heavenly light.  It altered the direction of my life. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hx2k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 15, "report_reasons": null, "author": "PsychoticSpaceWizard", "saved": false, "mod_reports": [], "name": "t3_65hx2k", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": 1492242053.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/65hx2k/why_a_post_about_how_dmt_changed_my_life/", "num_reports": null, "locked": false, "stickied": false, "created": 1492269493.0, "url": "https://www.reddit.com/r/Psychonaut/comments/65hx2k/why_a_post_about_how_dmt_changed_my_life/", "author_flair_text": null, "quarantine": false, "title": "\"Why?\": a post about how DMT changed my life", "created_utc": 1492240693.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65hx2k", "likes": null, "replies": "", "user_reports": [], "id": "dgbm17w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "eosophos", "parent_id": "t3_65hx2k", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "So what was the meaning or lesson?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what was the meaning or lesson?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbm17w", "score_hidden": false, "stickied": false, "created": 1492341733.0, "created_utc": 1492312933.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65hx2k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65hx2k", "likes": null, "replies": "", "user_reports": [], "id": "dgcj9v8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PsychoticSpaceWizard", "parent_id": "t1_dgc5y1q", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "That's a good way to describe it.  I was living a very dangerous and self-destructive lifestyle.  I was risking my life constantly and breaking every law I could in the process. It was all for nothing.  At that moment, I knew exactly what I needed to do to reverse my life.  \n\nI have no idea what form of DMT it was.  It was yellowish-white solid crystal, and I smoked it out of an oil rig.  Idk the dosage either.  Probably .1-.15 g", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a good way to describe it.  I was living a very dangerous and self-destructive lifestyle.  I was risking my life constantly and breaking every law I could in the process. It was all for nothing.  At that moment, I knew exactly what I needed to do to reverse my life.  &lt;/p&gt;\n\n&lt;p&gt;I have no idea what form of DMT it was.  It was yellowish-white solid crystal, and I smoked it out of an oil rig.  Idk the dosage either.  Probably .1-.15 g&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgcj9v8", "score_hidden": false, "stickied": false, "created": 1492403664.0, "created_utc": 1492374864.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5y1q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Da_Dolphin", "parent_id": "t3_65hx2k", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Werent the monsters part of yourself? Like you were running from these ugly parts of yourself to finally acknowledge the futility of running away when in the end it would consume you? I wish i could have a similar experience, i badly need it to unknot my mind.\n\nDid you take 4-AcO-DMT? What dosage?", "edited": 1492357625.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Werent the monsters part of yourself? Like you were running from these ugly parts of yourself to finally acknowledge the futility of running away when in the end it would consume you? I wish i could have a similar experience, i badly need it to unknot my mind.&lt;/p&gt;\n\n&lt;p&gt;Did you take 4-AcO-DMT? What dosage?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgc5y1q", "score_hidden": false, "stickied": false, "created": 1492386065.0, "created_utc": 1492357265.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]