[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The dissolving of our egos show us the roots of our being, and that&amp;#39;s that we are nothing at all, deep down. This can either be a terrifying thing, a comforting thing, or a thing that you just don&amp;#39;t really give a shit about anyway. Now, each reaction to the experience of ego loss is based on how your ego is structured, how you are as a personality, what your character is. &lt;/p&gt;\n\n&lt;p&gt;Similarly, your &lt;em&gt;interpretation&lt;/em&gt; of what the ego is, is also based upon your own ego&amp;#39;s structure, your character. So, if you view ego as &amp;quot;evil&amp;quot;, &amp;quot;stupid&amp;quot;, &amp;quot;good&amp;quot;, &amp;quot;beneficial&amp;quot;, that&amp;#39;s just a concept projected from your own ego, upon your own ego. Hell, whatever concept you have of ego is a product of your mind, it doesn&amp;#39;t matter what it is.&lt;/p&gt;\n\n&lt;p&gt;Even my own concept of ego is just a construct of my mind. Yet, for the sake of sharing ideas, I&amp;#39;d like to throw out the idea of ego being your character, and without it, interaction with the environment and the world is damn near impossible. &lt;/p&gt;\n\n&lt;p&gt;Your personalities are your characters. Regardless of whether your character was chosen for you or there was a chance to choose said character before your lives, or whether it was spontaneous, it&amp;#39;s a part of how you express yourself. I mean, it grew from being raised in the environments you were surrounded by, and it was further structured through influences from media, culture, friends, family, strangers even. Then there were your decisions toward allowing yourself to be influenced by certain things, and your choices on possibly acting out the opposite of what you were told to do... it&amp;#39;s a complex process. The point is, you are who you are today because of a multitude of experiences, influences, and choices... I think everyone on this site know that to a certain extent.&lt;/p&gt;\n\n&lt;p&gt;There are many here that are attempting to completely dissolve their egos to achieve enlightenment. Which is cool, you can do what you wish, but there&amp;#39;s a catch - &lt;em&gt;our attempts to dissolve the ego is just as much the ego&amp;#39;s doing as it is to inflate ourselves.&lt;/em&gt; But, since our egos are our characters anyway, it&amp;#39;s simply our own doings to either try and dissolve the ego, or to inflate it. &lt;/p&gt;\n\n&lt;p&gt;Even the gurus have a character. This concept that the gurus are egoless... is flawed. These gurus have &lt;em&gt;softened egos&lt;/em&gt; however, understanding that what they are is nothing at the deepest root, and that there really isn&amp;#39;t anything they necessarily &lt;em&gt;have&lt;/em&gt; to do because life is just a happening anyway. So, they choose to play the role of the one who shares their wisdom, or perhaps commits acts of charity. They develop the role of the wise one, they wear this mask, understanding that it is only when the &amp;quot;play&amp;quot; is finished that they are truly egoless, because the play ends as soon as we die.&lt;/p&gt;\n\n&lt;p&gt;Death is the one time where our egos will be completely dissolved and washed away, because we will no longer have a reason to hold it, since we are no longer interacting with life and existence. In fact, because our egos will become dissolved in death, there will be no such thing as a &amp;quot;we&amp;quot; or &amp;quot;I&amp;quot;, because there will be nothing to identify with. &lt;/p&gt;\n\n&lt;p&gt;Ego is everywhere. Our world is ego. Each culture is a character of a country and a certain ethnicity of people. Each personality is a character of an individual. Each concept surfaces in alignment with how one is, or how a group of people are. The angels and gods have egos. The DMT entities have egos. The Christian God has an ego. Because these are all characters in the existential act, in Lila. &lt;/p&gt;\n\n&lt;p&gt;If you wanted to be completely egoless, take away your personality, your concepts, your influences, your likes and dislikes, your emotions. Put them all to the side. Become a blank slate. Become unreactive to the environment around you. Don&amp;#39;t laugh, smile, cry, yell, nothing... or you could just let your emotions explode without any acting upon them... I mean, so long as you aren&amp;#39;t interacting with the world. Just let things go by as they are. That is &amp;quot;egolessness&amp;quot;, because then you will have no character to play, and you will have no reason to interact with the world knowing it is nothing more than an act. Knowing that everything is simply a happening. Just be a blank slate, and simply observe what is going on, but view life as if it were an exhibit that you cannot touch or interact with.&lt;/p&gt;\n\n&lt;p&gt;Now, in my opinion, that isn&amp;#39;t fun, so I find that softening the ego and balancing your character is the ideal path to go. But that&amp;#39;s my own path, everyone has a different way to go. Because here&amp;#39;s the thing - Jesus and Buddha didn&amp;#39;t seem to be egoless, they just had softened egos. Yet, they still had characters they acted out as. Just like the gurus I talked about. Because interacting with the world around us is damn near impossible if you don&amp;#39;t have an ego, but it&amp;#39;s how one uses their egos that really matters how the dance of life shifts and sways. &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s &lt;em&gt;fun&lt;/em&gt; about the ego, is that you can soften it, harden it, neutralize it, make it small or large, change it&amp;#39;s color and shape, it&amp;#39;s style, and then apply it to your life. It is how you form your ego/character that really determines how your life will unfold. Think about it as if your were in a character creation page of a video game - you can change yourself like that at any time you want, if you understand that you can change yourself into anything in the first place, since &amp;quot;you&amp;quot; are nothing at the basic root of your being.&lt;/p&gt;\n\n&lt;p&gt;All I&amp;#39;m really throwing out here, is that the ego is &lt;em&gt;so&lt;/em&gt; important to our existence, so important in fact, that you can&amp;#39;t escape it so long as you live, because even your attempts to destroy the ego, that is just a character and role you play. It&amp;#39;s just as much a role as one&amp;#39;s attempt to inflate their ego. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just a matter of how you utilize your ego... &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The dissolving of our egos show us the roots of our being, and that's that we are nothing at all, deep down. This can either be a terrifying thing, a comforting thing, or a thing that you just don't really give a shit about anyway. Now, each reaction to the experience of ego loss is based on how your ego is structured, how you are as a personality, what your character is. \n\nSimilarly, your *interpretation* of what the ego is, is also based upon your own ego's structure, your character. So, if you view ego as \"evil\", \"stupid\", \"good\", \"beneficial\", that's just a concept projected from your own ego, upon your own ego. Hell, whatever concept you have of ego is a product of your mind, it doesn't matter what it is.\n\nEven my own concept of ego is just a construct of my mind. Yet, for the sake of sharing ideas, I'd like to throw out the idea of ego being your character, and without it, interaction with the environment and the world is damn near impossible. \n\nYour personalities are your characters. Regardless of whether your character was chosen for you or there was a chance to choose said character before your lives, or whether it was spontaneous, it's a part of how you express yourself. I mean, it grew from being raised in the environments you were surrounded by, and it was further structured through influences from media, culture, friends, family, strangers even. Then there were your decisions toward allowing yourself to be influenced by certain things, and your choices on possibly acting out the opposite of what you were told to do... it's a complex process. The point is, you are who you are today because of a multitude of experiences, influences, and choices... I think everyone on this site know that to a certain extent.\n\nThere are many here that are attempting to completely dissolve their egos to achieve enlightenment. Which is cool, you can do what you wish, but there's a catch - *our attempts to dissolve the ego is just as much the ego's doing as it is to inflate ourselves.* But, since our egos are our characters anyway, it's simply our own doings to either try and dissolve the ego, or to inflate it. \n\nEven the gurus have a character. This concept that the gurus are egoless... is flawed. These gurus have *softened egos* however, understanding that what they are is nothing at the deepest root, and that there really isn't anything they necessarily *have* to do because life is just a happening anyway. So, they choose to play the role of the one who shares their wisdom, or perhaps commits acts of charity. They develop the role of the wise one, they wear this mask, understanding that it is only when the \"play\" is finished that they are truly egoless, because the play ends as soon as we die.\n\nDeath is the one time where our egos will be completely dissolved and washed away, because we will no longer have a reason to hold it, since we are no longer interacting with life and existence. In fact, because our egos will become dissolved in death, there will be no such thing as a \"we\" or \"I\", because there will be nothing to identify with. \n\nEgo is everywhere. Our world is ego. Each culture is a character of a country and a certain ethnicity of people. Each personality is a character of an individual. Each concept surfaces in alignment with how one is, or how a group of people are. The angels and gods have egos. The DMT entities have egos. The Christian God has an ego. Because these are all characters in the existential act, in Lila. \n\nIf you wanted to be completely egoless, take away your personality, your concepts, your influences, your likes and dislikes, your emotions. Put them all to the side. Become a blank slate. Become unreactive to the environment around you. Don't laugh, smile, cry, yell, nothing... or you could just let your emotions explode without any acting upon them... I mean, so long as you aren't interacting with the world. Just let things go by as they are. That is \"egolessness\", because then you will have no character to play, and you will have no reason to interact with the world knowing it is nothing more than an act. Knowing that everything is simply a happening. Just be a blank slate, and simply observe what is going on, but view life as if it were an exhibit that you cannot touch or interact with.\n\nNow, in my opinion, that isn't fun, so I find that softening the ego and balancing your character is the ideal path to go. But that's my own path, everyone has a different way to go. Because here's the thing - Jesus and Buddha didn't seem to be egoless, they just had softened egos. Yet, they still had characters they acted out as. Just like the gurus I talked about. Because interacting with the world around us is damn near impossible if you don't have an ego, but it's how one uses their egos that really matters how the dance of life shifts and sways. \n\nWhat's *fun* about the ego, is that you can soften it, harden it, neutralize it, make it small or large, change it's color and shape, it's style, and then apply it to your life. It is how you form your ego/character that really determines how your life will unfold. Think about it as if your were in a character creation page of a video game - you can change yourself like that at any time you want, if you understand that you can change yourself into anything in the first place, since \"you\" are nothing at the basic root of your being.\n\nAll I'm really throwing out here, is that the ego is *so* important to our existence, so important in fact, that you can't escape it so long as you live, because even your attempts to destroy the ego, that is just a character and role you play. It's just as much a role as one's attempt to inflate their ego. \n\nIt's just a matter of how you utilize your ego... ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65k9lf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "cosmiclybreathing", "saved": false, "mod_reports": [], "name": "t3_65k9lf", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/65k9lf/the_thing_about_ego/", "num_reports": null, "locked": false, "stickied": false, "created": 1492306004.0, "url": "https://www.reddit.com/r/Psychonaut/comments/65k9lf/the_thing_about_ego/", "author_flair_text": null, "quarantine": false, "title": "The Thing About Ego...", "created_utc": 1492277204.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": "", "user_reports": [], "id": "dgb3yvg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "derpfacedman", "parent_id": "t1_dgb3tvt", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Really liked your writing, got my mind juices flowing :) Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really liked your writing, got my mind juices flowing :) Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgb3yvg", "score_hidden": false, "stickied": false, "created": 1492315941.0, "created_utc": 1492287141.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3tvt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cosmiclybreathing", "parent_id": "t1_dgb3oag", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Makes plenty of sense, thanks for contributing! :D\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Makes plenty of sense, thanks for contributing! :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgb3tvt", "score_hidden": false, "stickied": false, "created": 1492315749.0, "created_utc": 1492286949.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3oag", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "derpfacedman", "parent_id": "t3_65k9lf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I totally agree, however - I feel like the blank slate state (so to say) is a good starting point from where to create your new character. Before this happens your character is created by external forces - your parents, your friends, society, etc. We are taught to measure ourselves by how we affect our environment, since we cannot measure ourselves - we need something other than the 'I' to compare to for some kind of traits to appear. \"I make people laugh, therefor I must be funny\". This is what I feel creates anxiety and uncertainess - because we keep measuring ourselves in comparison to others and also living up to the past measurements we have made. \"I used to make people laugh, why can't I do it anymore?\". Also there won't always be someone to compare to, and there will be times when we are surrounded by people who seem to be much funnier than we are (to stick to the example). \n\nOnly when you come to the point when you realize that you are a blank page \"again\", so to say, the thought \"oh, I can do whatever I want here\" suddenly pops up. Atleast this is how it was for me. And this is what set me free. I don't need to compare to others because I am whatever I am in a given moment. There is no need to change. There is no need to adjust. Just be in the situation and the situation will unfold itself, no matter what I do.\nTo be egoless is not only to be blank, it is also the ability to take on all of the roles in life - as long as you don't do it because you can later brag about it, or because you profit from it - just do it because it is the thing to do.\n\nHope that made some sense, the small text box on reddit made it feel incoherrent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I totally agree, however - I feel like the blank slate state (so to say) is a good starting point from where to create your new character. Before this happens your character is created by external forces - your parents, your friends, society, etc. We are taught to measure ourselves by how we affect our environment, since we cannot measure ourselves - we need something other than the &amp;#39;I&amp;#39; to compare to for some kind of traits to appear. &amp;quot;I make people laugh, therefor I must be funny&amp;quot;. This is what I feel creates anxiety and uncertainess - because we keep measuring ourselves in comparison to others and also living up to the past measurements we have made. &amp;quot;I used to make people laugh, why can&amp;#39;t I do it anymore?&amp;quot;. Also there won&amp;#39;t always be someone to compare to, and there will be times when we are surrounded by people who seem to be much funnier than we are (to stick to the example). &lt;/p&gt;\n\n&lt;p&gt;Only when you come to the point when you realize that you are a blank page &amp;quot;again&amp;quot;, so to say, the thought &amp;quot;oh, I can do whatever I want here&amp;quot; suddenly pops up. Atleast this is how it was for me. And this is what set me free. I don&amp;#39;t need to compare to others because I am whatever I am in a given moment. There is no need to change. There is no need to adjust. Just be in the situation and the situation will unfold itself, no matter what I do.\nTo be egoless is not only to be blank, it is also the ability to take on all of the roles in life - as long as you don&amp;#39;t do it because you can later brag about it, or because you profit from it - just do it because it is the thing to do.&lt;/p&gt;\n\n&lt;p&gt;Hope that made some sense, the small text box on reddit made it feel incoherrent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgb3oag", "score_hidden": false, "stickied": false, "created": 1492315531.0, "created_utc": 1492286731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": "", "user_reports": [], "id": "dgboy1m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Timasino", "parent_id": "t1_dgbcjbe", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Wait until you get the full realization that the ego isn't real. You'll have a different perspective then. It won't be important at all. Anything to do with it will seem like folly and pointless. It changes the entire perspective. It is so liberating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wait until you get the full realization that the ego isn&amp;#39;t real. You&amp;#39;ll have a different perspective then. It won&amp;#39;t be important at all. Anything to do with it will seem like folly and pointless. It changes the entire perspective. It is so liberating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgboy1m", "score_hidden": false, "stickied": false, "created": 1492346507.0, "created_utc": 1492317707.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcjbe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cosmiclybreathing", "parent_id": "t1_dgb8zyg", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Boom, exactly. I can definitely relate with you on this.\n\nThere's definitely a more laid-back feeling when we come to recognize that the ego is actually a beautiful part of ourselves that simply needs maintenance, guidance, and development.\n\nThank you for sharing! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Boom, exactly. I can definitely relate with you on this.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s definitely a more laid-back feeling when we come to recognize that the ego is actually a beautiful part of ourselves that simply needs maintenance, guidance, and development.&lt;/p&gt;\n\n&lt;p&gt;Thank you for sharing! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbcjbe", "score_hidden": false, "stickied": false, "created": 1492328001.0, "created_utc": 1492299201.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": "", "user_reports": [], "id": "dgbou6f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Timasino", "parent_id": "t1_dgb8zyg", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "But once you have the full realization stone cold sober that the ego is a thought construct of the mind composed of nothing but beliefs, it makes it kind of hard to ever take it serious again. It starts to get in the way of increased awareness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But once you have the full realization stone cold sober that the ego is a thought construct of the mind composed of nothing but beliefs, it makes it kind of hard to ever take it serious again. It starts to get in the way of increased awareness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbou6f", "score_hidden": false, "stickied": false, "created": 1492346312.0, "created_utc": 1492317512.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8zyg", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Be-Bop-Brew", "parent_id": "t3_65k9lf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I remember when i first started taking LSD i looked at the ego as evil. Like something that shouldn't be there. But that was my ego talking. And the states in which i thought i was ego less, was just a softened ego. \nI find when i remove the outer layers of the ego with Psych's it removes all of my anxieties and negative thought patterns and just leaves a mellow ego without worries. \n\nBut i love my ego, because it's me. I don't want to lose myself, which is why i do the feel the need to aim for a complete ego death anymore.\n\nShape it into something you're proud of, and into something that would be pleasing for others to be around. It's not so much caring about what people think of you, it's more that if you relax the people around you then that will make you feel relaxed, making the journey more enjoyable. \n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember when i first started taking LSD i looked at the ego as evil. Like something that shouldn&amp;#39;t be there. But that was my ego talking. And the states in which i thought i was ego less, was just a softened ego. \nI find when i remove the outer layers of the ego with Psych&amp;#39;s it removes all of my anxieties and negative thought patterns and just leaves a mellow ego without worries. &lt;/p&gt;\n\n&lt;p&gt;But i love my ego, because it&amp;#39;s me. I don&amp;#39;t want to lose myself, which is why i do the feel the need to aim for a complete ego death anymore.&lt;/p&gt;\n\n&lt;p&gt;Shape it into something you&amp;#39;re proud of, and into something that would be pleasing for others to be around. It&amp;#39;s not so much caring about what people think of you, it&amp;#39;s more that if you relax the people around you then that will make you feel relaxed, making the journey more enjoyable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgb8zyg", "score_hidden": false, "stickied": false, "created": 1492322866.0, "created_utc": 1492294066.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": "", "user_reports": [], "id": "dgb391k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheDavidRokkedahl", "parent_id": "t3_65k9lf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "come to think of it\nEgo = being on autopilot\n\nbeing egoless is taking a step back and acting upon life instead of reacting to it. Hope this makes sense. \n\nLove", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;come to think of it\nEgo = being on autopilot&lt;/p&gt;\n\n&lt;p&gt;being egoless is taking a step back and acting upon life instead of reacting to it. Hope this makes sense. &lt;/p&gt;\n\n&lt;p&gt;Love&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgb391k", "score_hidden": false, "stickied": false, "created": 1492314934.0, "created_utc": 1492286134.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": "", "user_reports": [], "id": "dgb2j8n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheDavidRokkedahl", "parent_id": "t3_65k9lf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "to live without an ego is to shed anything remotely human from oneself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;to live without an ego is to shed anything remotely human from oneself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgb2j8n", "score_hidden": false, "stickied": false, "created": 1492313974.0, "created_utc": 1492285174.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": "", "user_reports": [], "id": "dgcvmsm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Timasino", "parent_id": "t1_dgcplpf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Check out their videos. It's very interesting. I don't see any of that \"I'm better\" in either one of them. Paul Hedderman is a character and can be very amusing as well. Weber is as dry as toast but he's a science guy that is researching the physiology in the brain of what happened to him by losing his sense of identity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Check out their videos. It&amp;#39;s very interesting. I don&amp;#39;t see any of that &amp;quot;I&amp;#39;m better&amp;quot; in either one of them. Paul Hedderman is a character and can be very amusing as well. Weber is as dry as toast but he&amp;#39;s a science guy that is researching the physiology in the brain of what happened to him by losing his sense of identity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgcvmsm", "score_hidden": false, "stickied": false, "created": 1492420210.0, "created_utc": 1492391410.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcplpf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "derpfacedman", "parent_id": "t1_dgc1whl", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "No that is not what I meant. I always consider everyone I meet a teacher of some sort - but I have a hard time believing people that label themselves as teachers or know-it-alls. The best thing I know is meeting someone who shares their experience. Perhaps the word 'preacher' is better in terms of what I wrote before, people who believe themselves to be better just because they have had some insight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No that is not what I meant. I always consider everyone I meet a teacher of some sort - but I have a hard time believing people that label themselves as teachers or know-it-alls. The best thing I know is meeting someone who shares their experience. Perhaps the word &amp;#39;preacher&amp;#39; is better in terms of what I wrote before, people who believe themselves to be better just because they have had some insight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgcplpf", "score_hidden": false, "stickied": false, "created": 1492412055.0, "created_utc": 1492383255.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1whl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Timasino", "parent_id": "t1_dgbyfdf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "So there's nothing other people are aware of that you can't learn from? They want to share their awareness of something most people haven't experienced. You don't even know what they have to offer and you already think you know. If you met them I'm sure they would discuss it with you. They don't even consider themselves teachers. They're just sharing. Don't be so cynical. I hope you watch some of their videos. You'll learn a lot if you open your mind just a crack, but your ego may not want to learn it because it definitely threatens that false creation of identity in your mind that believes \"teachers\" are ego feeders.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So there&amp;#39;s nothing other people are aware of that you can&amp;#39;t learn from? They want to share their awareness of something most people haven&amp;#39;t experienced. You don&amp;#39;t even know what they have to offer and you already think you know. If you met them I&amp;#39;m sure they would discuss it with you. They don&amp;#39;t even consider themselves teachers. They&amp;#39;re just sharing. Don&amp;#39;t be so cynical. I hope you watch some of their videos. You&amp;#39;ll learn a lot if you open your mind just a crack, but your ego may not want to learn it because it definitely threatens that false creation of identity in your mind that believes &amp;quot;teachers&amp;quot; are ego feeders.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgc1whl", "score_hidden": false, "stickied": false, "created": 1492379989.0, "created_utc": 1492351189.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbyfdf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "derpfacedman", "parent_id": "t1_dgbol2r", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Before I have seen their videos I'd like to say that I've always seen \"teachers\" as ego feeders. I mean, why do they go around teach and hold presentations? Does it make them feel good? I feel like having a discussion rather than a presentation would make much more sense in terms of \"ego teachings\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Before I have seen their videos I&amp;#39;d like to say that I&amp;#39;ve always seen &amp;quot;teachers&amp;quot; as ego feeders. I mean, why do they go around teach and hold presentations? Does it make them feel good? I feel like having a discussion rather than a presentation would make much more sense in terms of &amp;quot;ego teachings&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbyfdf", "score_hidden": false, "stickied": false, "created": 1492372515.0, "created_utc": 1492343715.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbol2r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Timasino", "parent_id": "t3_65k9lf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "There are people such as Gary Weber and Paul Heddermen that claim they don't have a sense of self which is the ego. They still act normally and function in society. Paul Heddermen laughs like crazy but he says he gets nothing out of it because there isn't a \"HE\" there but he is highly amused. Watch youtube videos of the two and maybe you'll get a better idea of what it means to be egoless. Gary Weber is very much into the neuroscience aspect of certain parts of our brain that cause the self. It's called something like the defaut network and when it stops communicating with other parts of the brain a person loses the sense of self. They both say it is wonderful and they actually function much better and always in the current moment. They just say they don't have a sense of identity. They are both very active in teaching people and do numerous talks and presentations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are people such as Gary Weber and Paul Heddermen that claim they don&amp;#39;t have a sense of self which is the ego. They still act normally and function in society. Paul Heddermen laughs like crazy but he says he gets nothing out of it because there isn&amp;#39;t a &amp;quot;HE&amp;quot; there but he is highly amused. Watch youtube videos of the two and maybe you&amp;#39;ll get a better idea of what it means to be egoless. Gary Weber is very much into the neuroscience aspect of certain parts of our brain that cause the self. It&amp;#39;s called something like the defaut network and when it stops communicating with other parts of the brain a person loses the sense of self. They both say it is wonderful and they actually function much better and always in the current moment. They just say they don&amp;#39;t have a sense of identity. They are both very active in teaching people and do numerous talks and presentations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbol2r", "score_hidden": false, "stickied": false, "created": 1492345876.0, "created_utc": 1492317076.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": "", "user_reports": [], "id": "dgc31wp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Timasino", "parent_id": "t1_dgbp7tv", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I agree, but I think the ego is that sense of self that only sees itself as the individual identity that is separate from everyone else and everything. Once the sense of self expands beyond that, then I don't consider it to be the definition of the ego. There is a sense of self that isn't ego. We had it as a very young child or baby before we were taught our identity and it began to form by what other identities presented to us as what we were. It is a sense of presence and awareness at the core of our being that we can still find as adults when we get past individual identity. That is which is the same in everyone. That awareness is what expands and includes everyone and everything. The ego is just a bunch of beliefs, ideas and thoughts identifying itself. It is nothing more than a belief system that only exists in thoughts in the mind. It is the mind making itself into an identity. A sense of self can be egoless and function even better in society and life. People are doing it quite successfully today.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, but I think the ego is that sense of self that only sees itself as the individual identity that is separate from everyone else and everything. Once the sense of self expands beyond that, then I don&amp;#39;t consider it to be the definition of the ego. There is a sense of self that isn&amp;#39;t ego. We had it as a very young child or baby before we were taught our identity and it began to form by what other identities presented to us as what we were. It is a sense of presence and awareness at the core of our being that we can still find as adults when we get past individual identity. That is which is the same in everyone. That awareness is what expands and includes everyone and everything. The ego is just a bunch of beliefs, ideas and thoughts identifying itself. It is nothing more than a belief system that only exists in thoughts in the mind. It is the mind making itself into an identity. A sense of self can be egoless and function even better in society and life. People are doing it quite successfully today.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgc31wp", "score_hidden": false, "stickied": false, "created": 1492381848.0, "created_utc": 1492353048.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbp7tv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lintrone", "parent_id": "t3_65k9lf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I have a slightly different perspective.  To me, the ego is the feeling that you are different/separate from everything else.  When your ego is dissolving, it's not that there is no sense of self, but your \"self\" has expanded to include your immediate surroundings, your friends and family, the environment, even the universe itself.  There is naturally less focus on *you*, the self confined to your body, because you now are considerate of a greatly expanded self.  In a sense, I'd say, ego loss is a misnomer -- your ego is actually expanding!  You have now become concerned with the well being of a much larger portion of humanity/life/the universe.\n\nNow, it's absolutely true that the ego is essential to survival.  If you're not paying attention to the physical you, you're not going to eat, sleep, or defend yourself from tigers.  But when someone is labelled egotistical, we mean they are giving importance to themselves at the expense of others.  Egoism in extremes then leads to nationalism, xenophobia, hoarding, obsessions with fame and power, etc.\n\nEgo loss confronts you with feelings of deep empathy for the people and things surrounding you, to the point that you feel like those people and things *are* you, and I think that's an incredibly good thing for most people.  Assuming you agree that too much selfishness is a \"bad\" thing, and the long term survival and flourishing of life is a \"good\" thing, experiencing ego loss can only make you a better person.\n\nI'm not of the opinion that permanently dissolving/expanding your ego is necessary or even wise, but I do think it's something that most people should experience at least once.  If most people *did* experience it, I think humanity as a whole would benefit greatly.", "edited": 1492323093.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a slightly different perspective.  To me, the ego is the feeling that you are different/separate from everything else.  When your ego is dissolving, it&amp;#39;s not that there is no sense of self, but your &amp;quot;self&amp;quot; has expanded to include your immediate surroundings, your friends and family, the environment, even the universe itself.  There is naturally less focus on &lt;em&gt;you&lt;/em&gt;, the self confined to your body, because you now are considerate of a greatly expanded self.  In a sense, I&amp;#39;d say, ego loss is a misnomer -- your ego is actually expanding!  You have now become concerned with the well being of a much larger portion of humanity/life/the universe.&lt;/p&gt;\n\n&lt;p&gt;Now, it&amp;#39;s absolutely true that the ego is essential to survival.  If you&amp;#39;re not paying attention to the physical you, you&amp;#39;re not going to eat, sleep, or defend yourself from tigers.  But when someone is labelled egotistical, we mean they are giving importance to themselves at the expense of others.  Egoism in extremes then leads to nationalism, xenophobia, hoarding, obsessions with fame and power, etc.&lt;/p&gt;\n\n&lt;p&gt;Ego loss confronts you with feelings of deep empathy for the people and things surrounding you, to the point that you feel like those people and things &lt;em&gt;are&lt;/em&gt; you, and I think that&amp;#39;s an incredibly good thing for most people.  Assuming you agree that too much selfishness is a &amp;quot;bad&amp;quot; thing, and the long term survival and flourishing of life is a &amp;quot;good&amp;quot; thing, experiencing ego loss can only make you a better person.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not of the opinion that permanently dissolving/expanding your ego is necessary or even wise, but I do think it&amp;#39;s something that most people should experience at least once.  If most people &lt;em&gt;did&lt;/em&gt; experience it, I think humanity as a whole would benefit greatly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbp7tv", "score_hidden": false, "stickied": false, "created": 1492346998.0, "created_utc": 1492318198.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65k9lf", "likes": null, "replies": "", "user_reports": [], "id": "dgcc589", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "limethyl", "parent_id": "t3_65k9lf", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Thx", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thx&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgcc589", "score_hidden": false, "stickied": false, "created": 1492394263.0, "created_utc": 1492365463.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]