[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s weird, when I take psychedelics in dreams, they don&amp;#39;t work. And (not exaggerating) I&amp;#39;ve tripped over 1000 times. Bizarre too, acid(in my dream) will be like a vitamin that I take regularly or something along those lines.. &lt;/p&gt;\n\n&lt;p&gt;There have been a few crazy dreams I&amp;#39;ve had though that are somewhat dmt esque. &lt;/p&gt;\n\n&lt;p&gt;For example, I&amp;#39;ll keep this short. But I once had the most insane dream that I&amp;#39;ve ever had. This guy was teaching me powers, teaching me out to teleport across the beach by running really fast and then &amp;#39;boom&amp;#39; Im at the other end with a frog in my hand... He eventually taught me to fly to the top of a cliff. Then I went to find him, got shot at.. Dodged the bullets by teleporting...&lt;/p&gt;\n\n&lt;p&gt;The guy ended up turning against me(picture this guy as a boss dude wearing clothes from the matrix. The guy was like Keanu Reeves.) so I flew as high and far and as fast as possible. &lt;/p&gt;\n\n&lt;p&gt;During this, as flying is a direct link to how I figure out that I am dreaming, thus becoming aware that I&amp;#39;m dreaming while it&amp;#39;s happening. I become lucid, I know I&amp;#39;m dreaming. So I fly super fast and far. I ended up leaving the planet and flying around the earth as fast as possible(like on the original superman where he turns back time). Anyways, so I&amp;#39;m flying SO fast and around the earth, I&amp;#39;m having fun, but it was impossible to fly accurately, I kept making eclipses instead of circles around the earth.&lt;/p&gt;\n\n&lt;p&gt;Keep in mind that at this point I was lucid and was aware that I was dreaming.&lt;/p&gt;\n\n&lt;p&gt;So I see this orange interchanging block made of Alex gray type art that was about the size of the moon, right next to the moon. I fly there as fast as possible. &lt;/p&gt;\n\n&lt;p&gt;I finally get near this block and it looks like crazy dmt visuals, so naturally, I go inside of it. It took forever to get inside, or at least deep enough to get immersed. &lt;/p&gt;\n\n&lt;p&gt;What happened when I was immersed inside of this block was the cool part. I had no body anymore. I was inside of a complete dmt trip(think Vaping 65-100mg of good dmt all at onceand blasting off).&lt;/p&gt;\n\n&lt;p&gt;There was entity contact, an irrefutable overwhelming sensation of love.. Beings &amp;#39;showing me things&amp;#39; just like if I had smoked dmt. And the &amp;#39;patterns&amp;#39; were exactly the same as a very deep dmt trip. Past the &amp;#39;waiting room&amp;#39; you know, it got deeper than just seeing the columns and mandalas. I completely broke through.&lt;/p&gt;\n\n&lt;p&gt;Eventually I get to the center of this &amp;#39;block&amp;#39; and there is this light that was essentially God. An orgasmic source of love and compassion filled with light. &lt;/p&gt;\n\n&lt;p&gt;After I bathed in this for some time, I woke up.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m in my bed with visuals everywhere for about 30 seconds, crying out of happiness. It was SO lucid and SO amazing. It was exactly like if I were to be coming off of an extremely deep DMT or ayahuasca trip. Amazingly therapeutic. &lt;/p&gt;\n\n&lt;p&gt;I realized that I woke up 30 minutes before my alarm went off so I made my girlfriend bed in breakfast and exclaimed from my heart how deeply I loved her. Also me.. The universe.. You know.. Dmt..&lt;/p&gt;\n\n&lt;p&gt;The coolest part about this is that in any lucid dreams now, that block is always right next to the moon. And if I have enough time without forgetting that I&amp;#39;m dreaming, I go to it. And the same thing happens. &lt;/p&gt;\n\n&lt;p&gt;I can literally trip on DMT during lucid dreams whenever I want and it basically happens about once every week, two weeks, a month... &lt;/p&gt;\n\n&lt;p&gt;Anyways, that&amp;#39;s all I have to say. I hope someone enjoys reading. To me, it&amp;#39;s fascinating. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's weird, when I take psychedelics in dreams, they don't work. And (not exaggerating) I've tripped over 1000 times. Bizarre too, acid(in my dream) will be like a vitamin that I take regularly or something along those lines.. \n\nThere have been a few crazy dreams I've had though that are somewhat dmt esque. \n\nFor example, I'll keep this short. But I once had the most insane dream that I've ever had. This guy was teaching me powers, teaching me out to teleport across the beach by running really fast and then 'boom' Im at the other end with a frog in my hand... He eventually taught me to fly to the top of a cliff. Then I went to find him, got shot at.. Dodged the bullets by teleporting...\n\nThe guy ended up turning against me(picture this guy as a boss dude wearing clothes from the matrix. The guy was like Keanu Reeves.) so I flew as high and far and as fast as possible. \n\nDuring this, as flying is a direct link to how I figure out that I am dreaming, thus becoming aware that I'm dreaming while it's happening. I become lucid, I know I'm dreaming. So I fly super fast and far. I ended up leaving the planet and flying around the earth as fast as possible(like on the original superman where he turns back time). Anyways, so I'm flying SO fast and around the earth, I'm having fun, but it was impossible to fly accurately, I kept making eclipses instead of circles around the earth.\n\nKeep in mind that at this point I was lucid and was aware that I was dreaming.\n\nSo I see this orange interchanging block made of Alex gray type art that was about the size of the moon, right next to the moon. I fly there as fast as possible. \n\nI finally get near this block and it looks like crazy dmt visuals, so naturally, I go inside of it. It took forever to get inside, or at least deep enough to get immersed. \n\nWhat happened when I was immersed inside of this block was the cool part. I had no body anymore. I was inside of a complete dmt trip(think Vaping 65-100mg of good dmt all at onceand blasting off).\n\nThere was entity contact, an irrefutable overwhelming sensation of love.. Beings 'showing me things' just like if I had smoked dmt. And the 'patterns' were exactly the same as a very deep dmt trip. Past the 'waiting room' you know, it got deeper than just seeing the columns and mandalas. I completely broke through.\n\nEventually I get to the center of this 'block' and there is this light that was essentially God. An orgasmic source of love and compassion filled with light. \n\nAfter I bathed in this for some time, I woke up.\n\n\nI'm in my bed with visuals everywhere for about 30 seconds, crying out of happiness. It was SO lucid and SO amazing. It was exactly like if I were to be coming off of an extremely deep DMT or ayahuasca trip. Amazingly therapeutic. \n\nI realized that I woke up 30 minutes before my alarm went off so I made my girlfriend bed in breakfast and exclaimed from my heart how deeply I loved her. Also me.. The universe.. You know.. Dmt..\n\nThe coolest part about this is that in any lucid dreams now, that block is always right next to the moon. And if I have enough time without forgetting that I'm dreaming, I go to it. And the same thing happens. \n\nI can literally trip on DMT during lucid dreams whenever I want and it basically happens about once every week, two weeks, a month... \n\nAnyways, that's all I have to say. I hope someone enjoys reading. To me, it's fascinating. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65n2ga", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 16, "report_reasons": null, "author": "Plymanthium", "saved": false, "mod_reports": [], "name": "t3_65n2ga", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/65n2ga/dreams_and_psychedelics/", "num_reports": null, "locked": false, "stickied": false, "created": 1492340259.0, "url": "https://www.reddit.com/r/Psychonaut/comments/65n2ga/dreams_and_psychedelics/", "author_flair_text": null, "quarantine": false, "title": "Dreams and psychedelics", "created_utc": 1492311459.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": "", "user_reports": [], "id": "dgdb3z9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Plymanthium", "parent_id": "t1_dgbsxx4", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Well I've lucid dreamt since I was a young kid, I thought everyone could do it until I explained it to some teacher in elementary school and she told me to stop fibbing. \n\nI worked on it intentionally when I was about 15 and ever since then I've went lucid maybe once a month or so.. Now it's more frequent, especially since not consuming as much cannabis. \n\nThis specific dream happened a year and a half ago. So I'd say that this scenario has been playing out, on average, bi-weekly since then. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;ve lucid dreamt since I was a young kid, I thought everyone could do it until I explained it to some teacher in elementary school and she told me to stop fibbing. &lt;/p&gt;\n\n&lt;p&gt;I worked on it intentionally when I was about 15 and ever since then I&amp;#39;ve went lucid maybe once a month or so.. Now it&amp;#39;s more frequent, especially since not consuming as much cannabis. &lt;/p&gt;\n\n&lt;p&gt;This specific dream happened a year and a half ago. So I&amp;#39;d say that this scenario has been playing out, on average, bi-weekly since then. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdb3z9", "score_hidden": false, "stickied": false, "created": 1492449963.0, "created_utc": 1492421163.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbsxx4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VapeYo", "parent_id": "t3_65n2ga", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "How long did it take you to achieve your current state of dreams? I've had dreams similar to the one you described, except with some old hippie dude and lots of marijuana ( in dream).  I'm not looking for an answer really, just curious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How long did it take you to achieve your current state of dreams? I&amp;#39;ve had dreams similar to the one you described, except with some old hippie dude and lots of marijuana ( in dream).  I&amp;#39;m not looking for an answer really, just curious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbsxx4", "score_hidden": false, "stickied": false, "created": 1492355102.0, "created_utc": 1492326302.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": "", "user_reports": [], "id": "dgbx1xz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_ze_", "parent_id": "t3_65n2ga", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Nice.  \nI also never had any drugs in dreams work, maybe some very mild/fuzzy and inaccurate sort of effects a few times, but mostly like you say, like taking a vitamin.  \nThis included dmt up until the time i tried it for real, and since then i've had full-on realistic dream dmt trips, in various ways, too! First thing ever to start working completely and accurately within dreams.  \nThough dream cannabis has also started working a little better at times, also maybe booze?, but that kinda feels more like my brain's just starting to learn how? haha... dunno if it's at all related to dmt.  \nI like how you have a nice clean trigger for it. I think it's good to keep it anchored to something like that, which kinda gives it a proper set &amp; setting and deliberateness.  \nNice experience with it too, thank you for sharing it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice.&lt;br/&gt;\nI also never had any drugs in dreams work, maybe some very mild/fuzzy and inaccurate sort of effects a few times, but mostly like you say, like taking a vitamin.&lt;br/&gt;\nThis included dmt up until the time i tried it for real, and since then i&amp;#39;ve had full-on realistic dream dmt trips, in various ways, too! First thing ever to start working completely and accurately within dreams.&lt;br/&gt;\nThough dream cannabis has also started working a little better at times, also maybe booze?, but that kinda feels more like my brain&amp;#39;s just starting to learn how? haha... dunno if it&amp;#39;s at all related to dmt.&lt;br/&gt;\nI like how you have a nice clean trigger for it. I think it&amp;#39;s good to keep it anchored to something like that, which kinda gives it a proper set &amp;amp; setting and deliberateness.&lt;br/&gt;\nNice experience with it too, thank you for sharing it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgbx1xz", "score_hidden": false, "stickied": false, "created": 1492368302.0, "created_utc": 1492339502.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": "", "user_reports": [], "id": "dgdb6ng", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Plymanthium", "parent_id": "t1_dgc3fdo", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Try flying into space and 'believing/creating' the block that I explained and see how that goes! \n\nI don't do anything to lucid dream so frequently, honesty. It just happens. I think using ayahuasca a lot a couple years ago may have something to do with the dreams. Also taking Kratom for pains(you know how opiates make dreams a little vivid and weird). \n\nI think there's logic on both sides of your last question. It could be the effect of a weirded ass brain or it could be something deeper, maybe I'm activating dmt voluntarily on my own with my imagination by believing it to have these experiences.. There is no telling in my opinion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try flying into space and &amp;#39;believing/creating&amp;#39; the block that I explained and see how that goes! &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t do anything to lucid dream so frequently, honesty. It just happens. I think using ayahuasca a lot a couple years ago may have something to do with the dreams. Also taking Kratom for pains(you know how opiates make dreams a little vivid and weird). &lt;/p&gt;\n\n&lt;p&gt;I think there&amp;#39;s logic on both sides of your last question. It could be the effect of a weirded ass brain or it could be something deeper, maybe I&amp;#39;m activating dmt voluntarily on my own with my imagination by believing it to have these experiences.. There is no telling in my opinion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdb6ng", "score_hidden": false, "stickied": false, "created": 1492450220.0, "created_utc": 1492421420.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3fdo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "madtraxmerno", "parent_id": "t3_65n2ga", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "This is great. I have long been dabbling in lucid dreaming as well as DMT and have wished for something like this. Normally in lucid dreams I forget the possibilities and stick to flying through my city or something similar. It's fun, but when I wake up I regret not taking it further. What are some things you do in order to lucid dream so frequently? Also, out of curiosity, what do you make of this floating block near the moon? Do you think it has a deeper meaning? Or do you think it's just an affect of a weirded-out brain?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is great. I have long been dabbling in lucid dreaming as well as DMT and have wished for something like this. Normally in lucid dreams I forget the possibilities and stick to flying through my city or something similar. It&amp;#39;s fun, but when I wake up I regret not taking it further. What are some things you do in order to lucid dream so frequently? Also, out of curiosity, what do you make of this floating block near the moon? Do you think it has a deeper meaning? Or do you think it&amp;#39;s just an affect of a weirded-out brain?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgc3fdo", "score_hidden": false, "stickied": false, "created": 1492382423.0, "created_utc": 1492353623.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": "", "user_reports": [], "id": "dgc91se", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ProphetSun", "parent_id": "t3_65n2ga", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Your brain waves on psychedelics most closely resembles your brain waves during REM sleep. Tripping is close to dreaming while you're awake ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your brain waves on psychedelics most closely resembles your brain waves during REM sleep. Tripping is close to dreaming while you&amp;#39;re awake &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgc91se", "score_hidden": false, "stickied": false, "created": 1492390224.0, "created_utc": 1492361424.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": "", "user_reports": [], "id": "dgco0ms", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Plymanthium", "parent_id": "t1_dgccjqr", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Oh I get it, somewhat my philosophy, 'don't take the psychedelic experiences too seriously'", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I get it, somewhat my philosophy, &amp;#39;don&amp;#39;t take the psychedelic experiences too seriously&amp;#39;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgco0ms", "score_hidden": false, "stickied": false, "created": 1492409877.0, "created_utc": 1492381077.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccjqr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheSempie", "parent_id": "t3_65n2ga", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "1000 Trips uh? \nDon't get me wrong, I wish everyone the best an tripped a lot as well. However, I think one can lose some boundaries to other people. What we experience while tripping is not imaginable for most people and we should spend effort to sort thinks out. This surely isn't new to you, however: \nNot everything we experience while tripping should be taken serious. Ideas can come up which are far from reality and we should always remember that, on LSD and such, we are somewhat insane. \nAs I said! Don't get me wrong. I trip a somewhat often and surely took a lot of use of it. Still, don't take everything too serious. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1000 Trips uh? \nDon&amp;#39;t get me wrong, I wish everyone the best an tripped a lot as well. However, I think one can lose some boundaries to other people. What we experience while tripping is not imaginable for most people and we should spend effort to sort thinks out. This surely isn&amp;#39;t new to you, however: \nNot everything we experience while tripping should be taken serious. Ideas can come up which are far from reality and we should always remember that, on LSD and such, we are somewhat insane. \nAs I said! Don&amp;#39;t get me wrong. I trip a somewhat often and surely took a lot of use of it. Still, don&amp;#39;t take everything too serious. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgccjqr", "score_hidden": false, "stickied": false, "created": 1492394800.0, "created_utc": 1492366000.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": "", "user_reports": [], "id": "dgdb9ea", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Plymanthium", "parent_id": "t1_dgcum5s", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "No problem man. Haha when I first learned to fly lucid I was probably 14-15.. I was in this library with tons of books and globes and sextants and stuff..  I thought 'hey I'm gonna try to fly' so I would jump in the air to fly and then float back down to the ground. I thought, well hey.. This isn't working..\n\nSo I started flapping my arms and I got up into the air and that was the start of it.\n\nNow I run as fast as I can and imagine myself as a ball of energy, the ball is lodged kind of where my heart is and it is me.\n\nI take off and control this 'ball' that is me. This allows me to superman fly. \n\nHaha your dream sounds interesting! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem man. Haha when I first learned to fly lucid I was probably 14-15.. I was in this library with tons of books and globes and sextants and stuff..  I thought &amp;#39;hey I&amp;#39;m gonna try to fly&amp;#39; so I would jump in the air to fly and then float back down to the ground. I thought, well hey.. This isn&amp;#39;t working..&lt;/p&gt;\n\n&lt;p&gt;So I started flapping my arms and I got up into the air and that was the start of it.&lt;/p&gt;\n\n&lt;p&gt;Now I run as fast as I can and imagine myself as a ball of energy, the ball is lodged kind of where my heart is and it is me.&lt;/p&gt;\n\n&lt;p&gt;I take off and control this &amp;#39;ball&amp;#39; that is me. This allows me to superman fly. &lt;/p&gt;\n\n&lt;p&gt;Haha your dream sounds interesting! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdb9ea", "score_hidden": false, "stickied": false, "created": 1492450480.0, "created_utc": 1492421680.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcum5s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "derpfacedman", "parent_id": "t3_65n2ga", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "One of my favourite dreams is when I met something (or someone?) that looks like a transformer and teaches me how to fly. That was the beginning of my lucid journey. Your text inspired me to look for more  irregularities in the surroindings next time, thanks for that! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of my favourite dreams is when I met something (or someone?) that looks like a transformer and teaches me how to fly. That was the beginning of my lucid journey. Your text inspired me to look for more  irregularities in the surroindings next time, thanks for that! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgcum5s", "score_hidden": false, "stickied": false, "created": 1492418870.0, "created_utc": 1492390070.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65n2ga", "likes": null, "replies": "", "user_reports": [], "id": "dgd8vpd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jake_megabyte", "parent_id": "t3_65n2ga", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "The same thing happened to me a couple weeks ago. I had a lucid dream where I basically ran into the machine elves and they were bouncing in and out of my chest, and there was a full on Logos voice talking to me. It ended in the white light also... I wonder if there is DMT being released during dreams? And especially during lucid dreams?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The same thing happened to me a couple weeks ago. I had a lucid dream where I basically ran into the machine elves and they were bouncing in and out of my chest, and there was a full on Logos voice talking to me. It ended in the white light also... I wonder if there is DMT being released during dreams? And especially during lucid dreams?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgd8vpd", "score_hidden": false, "stickied": false, "created": 1492442649.0, "created_utc": 1492413849.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]