[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Someone I know recently got his hands on some 60x concentrate Salvia. he and another friend of mine decided to spend the night at my place, after a small hangout with some other friends where we smoked a lot of weed, he offered to give the two of us Salvia, being it the first time either of us had tried it.&lt;/p&gt;\n\n&lt;p&gt;I was interested in trying Salvia after reports from my other friends about it. They described it as essentially a brief 10-15 minute mind fuck, and research I did on it essentially confirmed that. We decided to take them staggered, and we loaded up a pipe with a small-to-moderate amount of the Salvia and they helped me smoke it.&lt;/p&gt;\n\n&lt;p&gt;It was around 2:30 am, but we were in a well-lit room, and our set and setting was okay, albeit we had smoked a fair amount of weed and were tired from the busy day.&lt;/p&gt;\n\n&lt;p&gt;After taking the hit, I began to lean back, and I closed my eyes. As soon as my head touched the bed, the visuals began flooding in. Almost instantly, it felt like I was falling through reality, as my friends&amp;#39; voice echoed around me.&lt;/p&gt;\n\n&lt;p&gt;Almost instantly, I woke up in a completely different dimension. This universe was a vast white void, populated by vast, seemingly infinite &amp;#39;sheets&amp;#39; of material. These sheets were almost grooved, or covered in a pattern of ridges that could mesh together, almost like the teeth on a gear.&lt;/p&gt;\n\n&lt;p&gt;Everything was white, but as I observed these &amp;#39;sheets&amp;#39; I noticed that had a very basic color scheme of primary red, blue, green, and yellow colors. The best way I could describe it would be the same colors that Lego traditionally used for the various bricks. I soon came to the realization that this was the true universe, either like this was the building blocks/foundation of reality, or was a parallel dimension to our own.&lt;/p&gt;\n\n&lt;p&gt;At one point it felt like these sheets were making up various things, which is where the building blocks thing comes from. I soon realized as well that I was one of many innumerable entities that inhabited these vast structures, almost like a single unit amongst many. I then observed some event that transpired, I wasn&amp;#39;t able to really figure out what it was, but it was like I was observing a scene of a person&amp;#39;s shoe making contact with the pavement as he walked down the street.&lt;/p&gt;\n\n&lt;p&gt;In this instant, I think I realized that time existed, and everything I was observing up to this point was moving in time. Suddenly, everything began to go slow-motion and seconds would last eternities of this event of a guy&amp;#39;s shoe touching the pavement. It was almost like viewing this event in frames, like if you took a video into an editor and slowed it down to just the still frames. &lt;/p&gt;\n\n&lt;p&gt;Meanwhile, from my perspective, it like I was part of one of these sheets as another sheet collided with my own, almost like we were on a subatomic/subphysical level, experiencing this event of the shoe and pavement making contact, and the grooves would mesh together, and would also be violently ripping away from each other as the shoe also was leaving the pavement.&lt;/p&gt;\n\n&lt;p&gt;I instantly began to panic as I realized that I also couldn&amp;#39;t move and nothing I tried to do to break free or stop this event would do anything. It was like I was physically trapped, but my mind was free to think. At some point I remember it was like I was trapped, stuck within this state, and I was experiencing these events and this universe as though I was an inanimate object with no free will as time passed, almost like everything was planned on a set course, and I was stuck to simply observe within this universe.&lt;/p&gt;\n\n&lt;p&gt;It was like I awoke from out of the matrix, because all of this was as vivid as real life. It was like I just broke through into a different dimension and was experiencing it as it was. I tried to speak with the other &amp;#39;units&amp;#39; surrounding me, who either were perhaps still stuck in the &amp;#39;matrix&amp;#39; or were unable to hear, or unable to speak if they could hear.&lt;/p&gt;\n\n&lt;p&gt;But I began screaming to these other entities in a panic, telling them that I just awoke in this universe, and that something was wrong, and that we need to do something to either stop this or get out.&lt;/p&gt;\n\n&lt;p&gt;I began to actually scream out, as the two held me down. I recall screaming in a fake language. It probably sounded like I was speaking in tongues. It was like I was trying to describe things that didn&amp;#39;t exist within our language, so I came up with different, new words to describe, or give a name to them, hoping the inflection and tone of different syllables of the words would be enough to make sense to these beings, even though I was saying essentially gibberish, yet it all came as second nature to me.&lt;/p&gt;\n\n&lt;p&gt;According to my friend, he remembers me saying &amp;quot;We have to favava&amp;quot;, as one of the things I was screaming out.&lt;/p&gt;\n\n&lt;p&gt;At this point, my goal is to return back to reality, and I think this is when I open my eyes and stand up. Still panicking and wanting to come back to reality, I&amp;#39;m begging for someone to take me to the hospital because I&amp;#39;m positive that I&amp;#39;ve broken my brain and driven myself mad out of merely witnessing this insane shit, almost like how looking at Lovecraftian entities drives you irredeemably insane in Lovecraft lore.&lt;/p&gt;\n\n&lt;p&gt;Much of this I can&amp;#39;t remember clearly, because I woke up my roommate, who I spoke to during this freak out and essentially told him I was tripping major balls and was &amp;#39;on fucked up drugs&amp;#39;. He had no idea I had ever done any psychedelic, so he was very concerned, but eventually the others got him to calm down and leave.&lt;/p&gt;\n\n&lt;p&gt;I sit down and immediately I&amp;#39;m relieved to be out of that universe, but I&amp;#39;m still very distressed because I still am having major visuals. I was essentially at one point blinded by the visuals I believe, despite having my eyes wide open.&lt;/p&gt;\n\n&lt;p&gt;After I began to calm down, I tried to relay what I experienced back to my friend who gave us the Salvia. All things considered, he was very good at helping me ground myself back in reality, and helped explain things that I may have been feeling. Even after &amp;#39;breaking free&amp;#39; from the alternate universe, it was like I was inbetween, but slowly coming back. Like I was stepping through a window back to Earth. The visuals were causing me to still see the vast array of infinite sheets beyond my field of vision, almost like the &amp;#39;underside&amp;#39; of this universe. I described it like, I was experiencing the universe turned inside out.&lt;/p&gt;\n\n&lt;p&gt;But when I was back and calm enough to talk things out and have a conversation, I had little to no concept of who I was, where I was, or what basic fundamentals of reality were, like time and space, yet it all seemed familiar.&lt;/p&gt;\n\n&lt;p&gt;Eventually things calmed down and we went to bed. We decided to skip my other friend&amp;#39;s trip opting not risking waking up my roommate again, and not putting my other friend though something similar.&lt;/p&gt;\n\n&lt;p&gt;It hasn&amp;#39;t been 24 hours since experiencing this, but I can say hands down that it was the most terrifying experience of my life. It wasn&amp;#39;t a physical fear, or a mental fear, but like an existential fear, but it was still very vivid and very real. I&amp;#39;m recovering well, and am not really bothered by it. It was simply a very terrifying experience that I didn&amp;#39;t learn anything from or get anything worthy out of. I would perhaps do it again for kicks, but probably not unless the opportunity was just right, so I don&amp;#39;t have such a bad trip again.&lt;/p&gt;\n\n&lt;p&gt;I guess my best advice is to be prepared, don&amp;#39;t do it in an uncomfortable place, make sure everyone knows to be calm, and make sure that you remind yourself it&amp;#39;s all in your head.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Someone I know recently got his hands on some 60x concentrate Salvia. he and another friend of mine decided to spend the night at my place, after a small hangout with some other friends where we smoked a lot of weed, he offered to give the two of us Salvia, being it the first time either of us had tried it.\n\nI was interested in trying Salvia after reports from my other friends about it. They described it as essentially a brief 10-15 minute mind fuck, and research I did on it essentially confirmed that. We decided to take them staggered, and we loaded up a pipe with a small-to-moderate amount of the Salvia and they helped me smoke it.\n\nIt was around 2:30 am, but we were in a well-lit room, and our set and setting was okay, albeit we had smoked a fair amount of weed and were tired from the busy day.\n\nAfter taking the hit, I began to lean back, and I closed my eyes. As soon as my head touched the bed, the visuals began flooding in. Almost instantly, it felt like I was falling through reality, as my friends' voice echoed around me.\n\nAlmost instantly, I woke up in a completely different dimension. This universe was a vast white void, populated by vast, seemingly infinite 'sheets' of material. These sheets were almost grooved, or covered in a pattern of ridges that could mesh together, almost like the teeth on a gear.\n\nEverything was white, but as I observed these 'sheets' I noticed that had a very basic color scheme of primary red, blue, green, and yellow colors. The best way I could describe it would be the same colors that Lego traditionally used for the various bricks. I soon came to the realization that this was the true universe, either like this was the building blocks/foundation of reality, or was a parallel dimension to our own.\n\nAt one point it felt like these sheets were making up various things, which is where the building blocks thing comes from. I soon realized as well that I was one of many innumerable entities that inhabited these vast structures, almost like a single unit amongst many. I then observed some event that transpired, I wasn't able to really figure out what it was, but it was like I was observing a scene of a person's shoe making contact with the pavement as he walked down the street.\n\nIn this instant, I think I realized that time existed, and everything I was observing up to this point was moving in time. Suddenly, everything began to go slow-motion and seconds would last eternities of this event of a guy's shoe touching the pavement. It was almost like viewing this event in frames, like if you took a video into an editor and slowed it down to just the still frames. \n\nMeanwhile, from my perspective, it like I was part of one of these sheets as another sheet collided with my own, almost like we were on a subatomic/subphysical level, experiencing this event of the shoe and pavement making contact, and the grooves would mesh together, and would also be violently ripping away from each other as the shoe also was leaving the pavement.\n\nI instantly began to panic as I realized that I also couldn't move and nothing I tried to do to break free or stop this event would do anything. It was like I was physically trapped, but my mind was free to think. At some point I remember it was like I was trapped, stuck within this state, and I was experiencing these events and this universe as though I was an inanimate object with no free will as time passed, almost like everything was planned on a set course, and I was stuck to simply observe within this universe.\n\nIt was like I awoke from out of the matrix, because all of this was as vivid as real life. It was like I just broke through into a different dimension and was experiencing it as it was. I tried to speak with the other 'units' surrounding me, who either were perhaps still stuck in the 'matrix' or were unable to hear, or unable to speak if they could hear.\n\nBut I began screaming to these other entities in a panic, telling them that I just awoke in this universe, and that something was wrong, and that we need to do something to either stop this or get out.\n\nI began to actually scream out, as the two held me down. I recall screaming in a fake language. It probably sounded like I was speaking in tongues. It was like I was trying to describe things that didn't exist within our language, so I came up with different, new words to describe, or give a name to them, hoping the inflection and tone of different syllables of the words would be enough to make sense to these beings, even though I was saying essentially gibberish, yet it all came as second nature to me.\n\nAccording to my friend, he remembers me saying \"We have to favava\", as one of the things I was screaming out.\n\nAt this point, my goal is to return back to reality, and I think this is when I open my eyes and stand up. Still panicking and wanting to come back to reality, I'm begging for someone to take me to the hospital because I'm positive that I've broken my brain and driven myself mad out of merely witnessing this insane shit, almost like how looking at Lovecraftian entities drives you irredeemably insane in Lovecraft lore.\n\nMuch of this I can't remember clearly, because I woke up my roommate, who I spoke to during this freak out and essentially told him I was tripping major balls and was 'on fucked up drugs'. He had no idea I had ever done any psychedelic, so he was very concerned, but eventually the others got him to calm down and leave.\n\nI sit down and immediately I'm relieved to be out of that universe, but I'm still very distressed because I still am having major visuals. I was essentially at one point blinded by the visuals I believe, despite having my eyes wide open.\n\nAfter I began to calm down, I tried to relay what I experienced back to my friend who gave us the Salvia. All things considered, he was very good at helping me ground myself back in reality, and helped explain things that I may have been feeling. Even after 'breaking free' from the alternate universe, it was like I was inbetween, but slowly coming back. Like I was stepping through a window back to Earth. The visuals were causing me to still see the vast array of infinite sheets beyond my field of vision, almost like the 'underside' of this universe. I described it like, I was experiencing the universe turned inside out.\n\nBut when I was back and calm enough to talk things out and have a conversation, I had little to no concept of who I was, where I was, or what basic fundamentals of reality were, like time and space, yet it all seemed familiar.\n\nEventually things calmed down and we went to bed. We decided to skip my other friend's trip opting not risking waking up my roommate again, and not putting my other friend though something similar.\n\nIt hasn't been 24 hours since experiencing this, but I can say hands down that it was the most terrifying experience of my life. It wasn't a physical fear, or a mental fear, but like an existential fear, but it was still very vivid and very real. I'm recovering well, and am not really bothered by it. It was simply a very terrifying experience that I didn't learn anything from or get anything worthy out of. I would perhaps do it again for kicks, but probably not unless the opportunity was just right, so I don't have such a bad trip again.\n\nI guess my best advice is to be prepared, don't do it in an uncomfortable place, make sure everyone knows to be calm, and make sure that you remind yourself it's all in your head.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65sp2e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "Lord_Edge", "saved": false, "mod_reports": [], "name": "t3_65sp2e", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/65sp2e/easter_morning_salvia_trip_report_most_terrifying/", "num_reports": null, "locked": false, "stickied": false, "created": 1492421102.0, "url": "https://www.reddit.com/r/Psychonaut/comments/65sp2e/easter_morning_salvia_trip_report_most_terrifying/", "author_flair_text": null, "quarantine": false, "title": "Easter morning Salvia trip report. Most terrifying experience of my life.", "created_utc": 1492392302.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65sp2e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65sp2e", "likes": null, "replies": "", "user_reports": [], "id": "dgcy04v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lord_Edge", "parent_id": "t1_dgcxcfo", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Yeah, duly noted. Thanks man! I hope I'll be able to try this stuff in the future again. I'm still very much a novice when it comes to Psychedelics, so the advice certainly helps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, duly noted. Thanks man! I hope I&amp;#39;ll be able to try this stuff in the future again. I&amp;#39;m still very much a novice when it comes to Psychedelics, so the advice certainly helps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgcy04v", "score_hidden": false, "stickied": false, "created": 1492423373.0, "created_utc": 1492394573.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxcfo", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "DrSnowMonkey", "parent_id": "t3_65sp2e", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Glad you're feeling better man; for powerful trips like that you gotta get the blankets out and kind of nurture yourself back into this reality like a kid with time.\n\nHey, now you know the headspace you'll be in next time you visit Salvia again (if you do). Use that as a starting point to prepare for the next one, im pretty sure if you get your own technique to get mentally ready for powerful eye opening psych's, you'll start enjoying yourself more.\n\nAnyways theres my 2 cents on that, btw not recommending or condoning use of psych's (use with discretion!) \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad you&amp;#39;re feeling better man; for powerful trips like that you gotta get the blankets out and kind of nurture yourself back into this reality like a kid with time.&lt;/p&gt;\n\n&lt;p&gt;Hey, now you know the headspace you&amp;#39;ll be in next time you visit Salvia again (if you do). Use that as a starting point to prepare for the next one, im pretty sure if you get your own technique to get mentally ready for powerful eye opening psych&amp;#39;s, you&amp;#39;ll start enjoying yourself more.&lt;/p&gt;\n\n&lt;p&gt;Anyways theres my 2 cents on that, btw not recommending or condoning use of psych&amp;#39;s (use with discretion!) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgcxcfo", "score_hidden": false, "stickied": false, "created": 1492422451.0, "created_utc": 1492393651.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65sp2e", "likes": null, "replies": "", "user_reports": [], "id": "dgdb5hw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TripResort", "parent_id": "t3_65sp2e", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Hey, thanks for sharing.\n\nHere is a video of a guided Salvia trip for contrast: https://vimeo.com/192521478 (hits at 2:45). The clip is from Hamiltons.Pharmacopeia.S01E03", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, thanks for sharing.&lt;/p&gt;\n\n&lt;p&gt;Here is a video of a guided Salvia trip for contrast: &lt;a href=\"https://vimeo.com/192521478\"&gt;https://vimeo.com/192521478&lt;/a&gt; (hits at 2:45). The clip is from Hamiltons.Pharmacopeia.S01E03&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdb5hw", "score_hidden": false, "stickied": false, "created": 1492450110.0, "created_utc": 1492421310.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65sp2e", "likes": null, "replies": "", "user_reports": [], "id": "dgdb6g9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "derpfacedman", "parent_id": "t3_65sp2e", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "The good thing is that you now know what happens when you do stuff you're not really ready for and will hopefully respect the psychedelics more in the future.\n\nTry some meditation and practice just observing, not being able to change what is happening doesn't make you trapped, just watch the show as it unfolds and realize you don't need to be in total control all of the time. Things will turn out OK anyway, everything is fine :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The good thing is that you now know what happens when you do stuff you&amp;#39;re not really ready for and will hopefully respect the psychedelics more in the future.&lt;/p&gt;\n\n&lt;p&gt;Try some meditation and practice just observing, not being able to change what is happening doesn&amp;#39;t make you trapped, just watch the show as it unfolds and realize you don&amp;#39;t need to be in total control all of the time. Things will turn out OK anyway, everything is fine :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdb6g9", "score_hidden": false, "stickied": false, "created": 1492450202.0, "created_utc": 1492421402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65sp2e", "likes": null, "replies": "", "user_reports": [], "id": "dgdb7df", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Siggydooju", "parent_id": "t3_65sp2e", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Interesting. definitely some parallels between this and my own experience. the horrible ripping of sheets, in mine the image was a ball almost being caught by a glove but suspended in mid-air...suspended in time...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting. definitely some parallels between this and my own experience. the horrible ripping of sheets, in mine the image was a ball almost being caught by a glove but suspended in mid-air...suspended in time...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdb7df", "score_hidden": false, "stickied": false, "created": 1492450289.0, "created_utc": 1492421489.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65sp2e", "likes": null, "replies": "", "user_reports": [], "id": "dgd84f5", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Junglepuker", "parent_id": "t3_65sp2e", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Hey, let's fuck around with ridiculously powerful plants. What could go wrong?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, let&amp;#39;s fuck around with ridiculously powerful plants. What could go wrong?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgd84f5", "score_hidden": false, "stickied": false, "created": 1492440826.0, "created_utc": 1492412026.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]