[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The title sounds stupid as hell but I didn&amp;#39;t know what else to write...&lt;/p&gt;\n\n&lt;p&gt;I hope this doesn&amp;#39;t make me sound self-righteous, we all know not everyone wants the same things nor is anyone more important than anyone else. I just felt the need to say that first...&lt;/p&gt;\n\n&lt;p&gt;Ever since I was a little kid I wanted more than anything to be a big time businessman who made lots of money, and it didn&amp;#39;t seem as silly as it does right now writing this down. Back then I wanted to be super important and get everyones attention but after I started taking psychedelics the dream stayed the same but the reasons why totally changed. I mention this because I feel it could be an important piece of the puzzle.  &lt;/p&gt;\n\n&lt;p&gt;More importantly, I somehow intrinsically knew that I just had to get my, and I hate using this word, but I just had to get my spirituality corrected/in tuned/whatever you want to call it, and everything else would be given to me. I also knew, like you would know you would one day buy a house, that all this would come to me at the age of 25.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how to describe this without pulling out some major woo-woo but it is what it is. The past several years its like my consciousness and the universal consciousness has been slowly dissolving together, rejoining each other, and the process seems to get faster as time goes on. This is how it FEELS, I don&amp;#39;t really know whats happening but I can feel it happening like how you can feel a trip is starting to kick in.&lt;/p&gt;\n\n&lt;p&gt;During this time my life was slowly starting to crumble and I can now see it was important that this was happening. All my old friends are almost completely out of the picture and I am starting to make friends more in tune with who I really am, its quite marvelous to look back on it from this seat in time, especially since it seemed like things were just going to get  worse forever. So if your life is going to shit right, know that the reason why things are falling apart is because you outgrew all that and something greater is going to be built. You can&amp;#39;t build a new building without tearing the old one down first.&lt;/p&gt;\n\n&lt;p&gt;Things are really starting to get crazy now. The past couple weeks I&amp;#39;ve had this vision of a beautiful, spacious condo. Two weeks went by and I found myself at a party where I was in a hotel room that looked exactly like the vision I was having. I was hanging around these rich people for a few days and I don&amp;#39;t know how to explain it but it was like the vision went from a dream to a reality, like I was truly envisioning it for the first time, I could feel that I was rich with every fiber of my being. These visions I have now are just so intense its like they&amp;#39;re real. It isn&amp;#39;t just me thinking, it comes with vivid imagery and I get a feeling like I am immersed in that vision. &lt;/p&gt;\n\n&lt;p&gt;The craziest part is that I started a tech company a year ago and when I came home from this long party I got a call from someone wanting to buy my company and threw out a number that made my jaw drop. All this happening and being 25 is about half a year away. &lt;/p&gt;\n\n&lt;p&gt;To be honest I never believed in synchronization until all this happened and always thought people were really reaching when describing it. I can&amp;#39;t remember who said it, I think i was Gandhi or Einstein but someone said something like &amp;quot;thoughts are just glimpses of our future&amp;quot;. That&amp;#39;s probably way off but it was something like that. I am starting to think our lives are already planned out, like a book or movie is planned out and we just have to watch it. Being on some heavy ass trips, its easy to understand that time is an illusion and if time is an illusion, maybe there is a part of us that already knows what&amp;#39;s happening, hence we get these leaks called visions.&lt;/p&gt;\n\n&lt;p&gt;One more thing I would like to add is that it was like when I finally gave up on my dream, everything started to happen. It is hard to describe the kind of relationship I had with this vision but it was always there, in the back of my mind. It was kind of like you overhearing you are getting something cool for Christmas but you don&amp;#39;t have it yet so as it gets closer to Christmas you&amp;#39;re almost freaking out that it was all just a trick and you&amp;#39;re not going to get what you put so much weight on. I was thinking to myself &amp;quot;shit, 25 is around the corner and there is no sign that any of this shit was going to happen&amp;quot; but as soon as I let go thats when everything started happening. &lt;/p&gt;\n\n&lt;p&gt;I really have no idea about anything anymore, all I know is that there is a higher aspect of ourselves that is much greater than we can ever comprehend. It&amp;#39;s like we are the puppet master experiencing the show from the puppet. We are in control but not from our perspective necessarily. I don&amp;#39;t know, every time I try to pin down what this crazy thing called life really is, it just escapes. &lt;/p&gt;\n\n&lt;p&gt;Watch that guy change his mind about buying my company now lol. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "The title sounds stupid as hell but I didn't know what else to write...\n\nI hope this doesn't make me sound self-righteous, we all know not everyone wants the same things nor is anyone more important than anyone else. I just felt the need to say that first...\n\nEver since I was a little kid I wanted more than anything to be a big time businessman who made lots of money, and it didn't seem as silly as it does right now writing this down. Back then I wanted to be super important and get everyones attention but after I started taking psychedelics the dream stayed the same but the reasons why totally changed. I mention this because I feel it could be an important piece of the puzzle.  \n\nMore importantly, I somehow intrinsically knew that I just had to get my, and I hate using this word, but I just had to get my spirituality corrected/in tuned/whatever you want to call it, and everything else would be given to me. I also knew, like you would know you would one day buy a house, that all this would come to me at the age of 25.\n\nI don't know how to describe this without pulling out some major woo-woo but it is what it is. The past several years its like my consciousness and the universal consciousness has been slowly dissolving together, rejoining each other, and the process seems to get faster as time goes on. This is how it FEELS, I don't really know whats happening but I can feel it happening like how you can feel a trip is starting to kick in.\n\nDuring this time my life was slowly starting to crumble and I can now see it was important that this was happening. All my old friends are almost completely out of the picture and I am starting to make friends more in tune with who I really am, its quite marvelous to look back on it from this seat in time, especially since it seemed like things were just going to get  worse forever. So if your life is going to shit right, know that the reason why things are falling apart is because you outgrew all that and something greater is going to be built. You can't build a new building without tearing the old one down first.\n\nThings are really starting to get crazy now. The past couple weeks I've had this vision of a beautiful, spacious condo. Two weeks went by and I found myself at a party where I was in a hotel room that looked exactly like the vision I was having. I was hanging around these rich people for a few days and I don't know how to explain it but it was like the vision went from a dream to a reality, like I was truly envisioning it for the first time, I could feel that I was rich with every fiber of my being. These visions I have now are just so intense its like they're real. It isn't just me thinking, it comes with vivid imagery and I get a feeling like I am immersed in that vision. \n\nThe craziest part is that I started a tech company a year ago and when I came home from this long party I got a call from someone wanting to buy my company and threw out a number that made my jaw drop. All this happening and being 25 is about half a year away. \n\nTo be honest I never believed in synchronization until all this happened and always thought people were really reaching when describing it. I can't remember who said it, I think i was Gandhi or Einstein but someone said something like \"thoughts are just glimpses of our future\". That's probably way off but it was something like that. I am starting to think our lives are already planned out, like a book or movie is planned out and we just have to watch it. Being on some heavy ass trips, its easy to understand that time is an illusion and if time is an illusion, maybe there is a part of us that already knows what's happening, hence we get these leaks called visions.\n\nOne more thing I would like to add is that it was like when I finally gave up on my dream, everything started to happen. It is hard to describe the kind of relationship I had with this vision but it was always there, in the back of my mind. It was kind of like you overhearing you are getting something cool for Christmas but you don't have it yet so as it gets closer to Christmas you're almost freaking out that it was all just a trick and you're not going to get what you put so much weight on. I was thinking to myself \"shit, 25 is around the corner and there is no sign that any of this shit was going to happen\" but as soon as I let go thats when everything started happening. \n\nI really have no idea about anything anymore, all I know is that there is a higher aspect of ourselves that is much greater than we can ever comprehend. It's like we are the puppet master experiencing the show from the puppet. We are in control but not from our perspective necessarily. I don't know, every time I try to pin down what this crazy thing called life really is, it just escapes. \n\nWatch that guy change his mind about buying my company now lol. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wnv0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 106, "report_reasons": null, "author": "blacksox22", "saved": false, "mod_reports": [], "name": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/65wnv0/synchronization_is_tripper_than_10g_of_mushrooms/", "num_reports": null, "locked": false, "stickied": false, "created": 1492475913.0, "url": "https://www.reddit.com/r/Psychonaut/comments/65wnv0/synchronization_is_tripper_than_10g_of_mushrooms/", "author_flair_text": null, "quarantine": false, "title": "synchronization is tripper than 10g of mushrooms", "created_utc": 1492447113.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 31, "visited": false, "subreddit_type": "public", "ups": 106}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgenaab", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "loukall", "parent_id": "t1_dge1id4", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Don't take this too harsh, but it might be failing because you're still holding back in reserve out of fear. Just remember that \"success\" (however YOU define it) comes with determination and situation. Be determined to put yourself in good situations. Doesn't work out? Fuck it, time to reassess and came at the problem from a different point. The grind sucks. There will be a lot of doubt, my friend. Forge ahead and surround yourself with positive encouragement and constructive critics. Intention is real, you can bring on a whole new reality. You have to be THAT true, authentic self, for you and your circle. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t take this too harsh, but it might be failing because you&amp;#39;re still holding back in reserve out of fear. Just remember that &amp;quot;success&amp;quot; (however YOU define it) comes with determination and situation. Be determined to put yourself in good situations. Doesn&amp;#39;t work out? Fuck it, time to reassess and came at the problem from a different point. The grind sucks. There will be a lot of doubt, my friend. Forge ahead and surround yourself with positive encouragement and constructive critics. Intention is real, you can bring on a whole new reality. You have to be THAT true, authentic self, for you and your circle. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgenaab", "score_hidden": true, "stickied": false, "created": 1492515681.0, "created_utc": 1492486881.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge1id4", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "johannthegoatman", "parent_id": "t1_dgdud19", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Man, I am always on the fence between giving up and keeping going. One part of me is like, I can create the reality that I want using intention etc. But another part of me recognizes that most of the time I put a lot of effort into something, it fails. So I'm torn between both. Also I don't know what I would do if I \"gave up.\" Actually I do, but I don't know how I would make enough money to live etc. I \"gave up\" once before and it didn't work out, ended up having to get a job I hated and being really confused/unhappy for a long time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, I am always on the fence between giving up and keeping going. One part of me is like, I can create the reality that I want using intention etc. But another part of me recognizes that most of the time I put a lot of effort into something, it fails. So I&amp;#39;m torn between both. Also I don&amp;#39;t know what I would do if I &amp;quot;gave up.&amp;quot; Actually I do, but I don&amp;#39;t know how I would make enough money to live etc. I &amp;quot;gave up&amp;quot; once before and it didn&amp;#39;t work out, ended up having to get a job I hated and being really confused/unhappy for a long time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dge1id4", "score_hidden": false, "stickied": false, "created": 1492488682.0, "created_utc": 1492459882.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdud19", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "SirPsychalot", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I can relate to your post a lot. Looking back, the day I \"gave up\" on my life is when it started to turn into what I always wanted it to be. Congrats on your success, I hope it's the first of many for you! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate to your post a lot. Looking back, the day I &amp;quot;gave up&amp;quot; on my life is when it started to turn into what I always wanted it to be. Congrats on your success, I hope it&amp;#39;s the first of many for you! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdud19", "score_hidden": false, "stickied": false, "created": 1492480619.0, "created_utc": 1492451819.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgdunmx", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "AcidCoyote", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Loved what you had to say man, thanks for sharing. \nI appreciate the skepticism you carry but also the sense of wonder/the inexplicable you hold on to, mainly because I feel the same.\n\nI wish you luck! Hope that guy buys you out for a fat amount lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Loved what you had to say man, thanks for sharing. \nI appreciate the skepticism you carry but also the sense of wonder/the inexplicable you hold on to, mainly because I feel the same.&lt;/p&gt;\n\n&lt;p&gt;I wish you luck! Hope that guy buys you out for a fat amount lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdunmx", "score_hidden": false, "stickied": false, "created": 1492480942.0, "created_utc": 1492452142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgduz1g", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "be_it_known", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "My life was getting real tuned in at 25...one of the best years of losing and finding myself. Just be careful because darkness lies in 3 corners...it sounds like you are golden, but I say this wishing someone had warned me about that metaphorical cliff I fell off of at 30. I'm got the game back, just follow that intuition strongly and your friction will glide softly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My life was getting real tuned in at 25...one of the best years of losing and finding myself. Just be careful because darkness lies in 3 corners...it sounds like you are golden, but I say this wishing someone had warned me about that metaphorical cliff I fell off of at 30. I&amp;#39;m got the game back, just follow that intuition strongly and your friction will glide softly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgduz1g", "score_hidden": false, "stickied": false, "created": 1492481294.0, "created_utc": 1492452494.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgefy7u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TrickyTramp", "parent_id": "t1_dge3gsa", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I know all this stuff on an intellectual level, but my greatest difficulty is not being able to eliminate this heavy weight of self doubt. I feel like I have a great rational mind that works to my detriment when aimed at myself.\n\nHow do we work through that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know all this stuff on an intellectual level, but my greatest difficulty is not being able to eliminate this heavy weight of self doubt. I feel like I have a great rational mind that works to my detriment when aimed at myself.&lt;/p&gt;\n\n&lt;p&gt;How do we work through that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgefy7u", "score_hidden": false, "stickied": false, "created": 1492506519.0, "created_utc": 1492477719.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dge3gsa", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "peepeeland", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Remember that your own doubts take energy to perceive, and your perception affects your actions.  If things don't turn out as planned or hoped, you're prepared for that, so there is no need for wasting yourself with doubt.  Be free, and accept what you want to come into being; prepare for that by acting in ways to setup such context.   \n   \nIn school years, most have experienced not being able to talk to the girl/guy who they crushed on so hard, even when approached by them-- this is rejecting EXACTLY what one wants, due to having doubts.  Adult life may not seem as simplistic, but it is.   \n   \nFor those who have found themselves- to truly manifest at a high level- there can be no room for doubt.  \"No doubt\" does not mean being arrogantly confident that something will 100% happen-- it means not even having to answer questions of doubt, because you live towards what you want, daily.  From a technical perspective, yes, anything can be manifested instantaneously, but from a day to day perspective- and if you're reading this- it's important to know that all it takes to manifest what will make you happy, is consistently.  Keeping true to yourself and your values, with every action, always.   \n   \nDo what needs to be done.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Remember that your own doubts take energy to perceive, and your perception affects your actions.  If things don&amp;#39;t turn out as planned or hoped, you&amp;#39;re prepared for that, so there is no need for wasting yourself with doubt.  Be free, and accept what you want to come into being; prepare for that by acting in ways to setup such context.   &lt;/p&gt;\n\n&lt;p&gt;In school years, most have experienced not being able to talk to the girl/guy who they crushed on so hard, even when approached by them-- this is rejecting EXACTLY what one wants, due to having doubts.  Adult life may not seem as simplistic, but it is.   &lt;/p&gt;\n\n&lt;p&gt;For those who have found themselves- to truly manifest at a high level- there can be no room for doubt.  &amp;quot;No doubt&amp;quot; does not mean being arrogantly confident that something will 100% happen-- it means not even having to answer questions of doubt, because you live towards what you want, daily.  From a technical perspective, yes, anything can be manifested instantaneously, but from a day to day perspective- and if you&amp;#39;re reading this- it&amp;#39;s important to know that all it takes to manifest what will make you happy, is consistently.  Keeping true to yourself and your values, with every action, always.   &lt;/p&gt;\n\n&lt;p&gt;Do what needs to be done.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dge3gsa", "score_hidden": false, "stickied": false, "created": 1492490863.0, "created_utc": 1492462063.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgdymm0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SB_LDN", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Big ups you bro. Stay connected, stay humble", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Big ups you bro. Stay connected, stay humble&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdymm0", "score_hidden": false, "stickied": false, "created": 1492485424.0, "created_utc": 1492456624.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgdwod8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "phyyr", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "awesome, well thought. im trying to change who i surround myself with, ive made some bad choices. integrating ones experiences with reality is a trip in and of itself. thanks a lot for sharing, helped me out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;awesome, well thought. im trying to change who i surround myself with, ive made some bad choices. integrating ones experiences with reality is a trip in and of itself. thanks a lot for sharing, helped me out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdwod8", "score_hidden": false, "stickied": false, "created": 1492483212.0, "created_utc": 1492454412.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgefsv8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NorthernAvo", "parent_id": "t1_dgee3qs", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "That's exactly it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s exactly it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgefsv8", "score_hidden": false, "stickied": false, "created": 1492506330.0, "created_utc": 1492477530.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgee3qs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "IndustrialTreeHugger", "parent_id": "t1_dgdz20r", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Well you just summed up my adult life.  This whole experience is incredibly scary, but for the first time in my life I feel like this is the right path.... like I'm giving in to nature rather than fighting it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well you just summed up my adult life.  This whole experience is incredibly scary, but for the first time in my life I feel like this is the right path.... like I&amp;#39;m giving in to nature rather than fighting it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgee3qs", "score_hidden": false, "stickied": false, "created": 1492504237.0, "created_utc": 1492475437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdz20r", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "NorthernAvo", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I think I know what you're saying, though lately I've thought I'm simply delusional and this is all wishful thinking. I understand that pattern you're describing, it's very trippy indeed. The Law of Attraction *is* a thing which exists, you must simply do in the direction of your desires, but these desires need to be true to *who you are*. I was chasing a profession previously with all my heart and soul, it stemmed from everything I'd loved as a kid, but it crashed and burned in some pretty nasty ways, the universe simply said \"no. this isn't the one for you.\" and it spun me around and around, I felt lost, and that's when I began to find myself, to see what truly defines \"success\", and I realized how misled I'd been. That failure made me understand how wrong I was about so many things and how fragile I was, depending on objectifiable measurements to define my self-worth. It all led me down the path I'm now, and it's so weird how right it feels, how good the people are, how perfect the work is. And the pursuits I have now are sometimes met with hesitant remarks or assumptions. The funny part is that these \"new\" pursuits of mine (because they're actually things I've loved since I was a kid as well) stem from the same branch as my previous endeavour, so they're all tied in together in some intrinsic manner. Overlaps where you'd assume none. People are too afraid to go against the current and pursue what really matters. You've gotta take a risk in life to truly succeed. Good luck to you, I really wish the best for you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I know what you&amp;#39;re saying, though lately I&amp;#39;ve thought I&amp;#39;m simply delusional and this is all wishful thinking. I understand that pattern you&amp;#39;re describing, it&amp;#39;s very trippy indeed. The Law of Attraction &lt;em&gt;is&lt;/em&gt; a thing which exists, you must simply do in the direction of your desires, but these desires need to be true to &lt;em&gt;who you are&lt;/em&gt;. I was chasing a profession previously with all my heart and soul, it stemmed from everything I&amp;#39;d loved as a kid, but it crashed and burned in some pretty nasty ways, the universe simply said &amp;quot;no. this isn&amp;#39;t the one for you.&amp;quot; and it spun me around and around, I felt lost, and that&amp;#39;s when I began to find myself, to see what truly defines &amp;quot;success&amp;quot;, and I realized how misled I&amp;#39;d been. That failure made me understand how wrong I was about so many things and how fragile I was, depending on objectifiable measurements to define my self-worth. It all led me down the path I&amp;#39;m now, and it&amp;#39;s so weird how right it feels, how good the people are, how perfect the work is. And the pursuits I have now are sometimes met with hesitant remarks or assumptions. The funny part is that these &amp;quot;new&amp;quot; pursuits of mine (because they&amp;#39;re actually things I&amp;#39;ve loved since I was a kid as well) stem from the same branch as my previous endeavour, so they&amp;#39;re all tied in together in some intrinsic manner. Overlaps where you&amp;#39;d assume none. People are too afraid to go against the current and pursue what really matters. You&amp;#39;ve gotta take a risk in life to truly succeed. Good luck to you, I really wish the best for you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgdz20r", "score_hidden": false, "stickied": false, "created": 1492485917.0, "created_utc": 1492457117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dge21nw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dm_fucking_t", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I'm going through something similar, with synchronicity laying a heavy hand in my life. Though not as dramatic. I believe the dramatic positive changes are still ahead for me. I always have known that I would find a way to use all of my talents (especially my talents of communication, self expression and charisma) to play an important role in something that is important to me and the earth. Still don't know what that will be though! I have many passions. But I've been called to move to central america as part of this journey, and that move is happening late this summer :)\n\nI've also more and more been tuned in to the idea that this sort of thing is happening to millions of people right now. That this is something that has always happened to people, but it is happening to more and more of us as we (re)awaken spiritually as a species. \n\nGood thing too! We need it :)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going through something similar, with synchronicity laying a heavy hand in my life. Though not as dramatic. I believe the dramatic positive changes are still ahead for me. I always have known that I would find a way to use all of my talents (especially my talents of communication, self expression and charisma) to play an important role in something that is important to me and the earth. Still don&amp;#39;t know what that will be though! I have many passions. But I&amp;#39;ve been called to move to central america as part of this journey, and that move is happening late this summer :)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also more and more been tuned in to the idea that this sort of thing is happening to millions of people right now. That this is something that has always happened to people, but it is happening to more and more of us as we (re)awaken spiritually as a species. &lt;/p&gt;\n\n&lt;p&gt;Good thing too! We need it :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dge21nw", "score_hidden": false, "stickied": false, "created": 1492489276.0, "created_utc": 1492460476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgeam5r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_AstralNaut", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Don't shy away from spirtuality - although organized religion is no longer something I like to identify with, a solid connection to a \"higher power\" is a truly valuable relationship to have in your life.\n\nCongrats man, sounds like you're on a great track.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t shy away from spirtuality - although organized religion is no longer something I like to identify with, a solid connection to a &amp;quot;higher power&amp;quot; is a truly valuable relationship to have in your life.&lt;/p&gt;\n\n&lt;p&gt;Congrats man, sounds like you&amp;#39;re on a great track.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeam5r", "score_hidden": false, "stickied": false, "created": 1492499760.0, "created_utc": 1492470960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgec6r0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gemeinsam", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "This was a very touching read, thank you. It made me realize something about myself. I have a negative vision of myself based on fear. Can you provide some advise. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was a very touching read, thank you. It made me realize something about myself. I have a negative vision of myself based on fear. Can you provide some advise. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgec6r0", "score_hidden": false, "stickied": false, "created": 1492501789.0, "created_utc": 1492472989.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgehuie", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BenGetsHigh", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "dude i feel you. i have been experiencing synchronization out the ass in the past 24 hours. a month or so ago i quit my job that i hated and i was making no money. I'm a student currently in college for context, and single. (trying to get my shit together without too many female distractions) well yesterday i was talking to a friend about being a little upset about applying for all of these jobs and especially one i really wanted that starts at $13. she said just hold out and keep my head up. well right when i woke up to shower before class today i get a call from the exact company i wanted and i have an interview this thursday! then i had an amazing day in class and then me and this girl i used to talk to a lot both reached out to each other almost at the exact same time and we have been texting for the past 3 hours. today has been one of the best ive had in a while. peace and love and good luck on your journey!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dude i feel you. i have been experiencing synchronization out the ass in the past 24 hours. a month or so ago i quit my job that i hated and i was making no money. I&amp;#39;m a student currently in college for context, and single. (trying to get my shit together without too many female distractions) well yesterday i was talking to a friend about being a little upset about applying for all of these jobs and especially one i really wanted that starts at $13. she said just hold out and keep my head up. well right when i woke up to shower before class today i get a call from the exact company i wanted and i have an interview this thursday! then i had an amazing day in class and then me and this girl i used to talk to a lot both reached out to each other almost at the exact same time and we have been texting for the past 3 hours. today has been one of the best ive had in a while. peace and love and good luck on your journey!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgehuie", "score_hidden": false, "stickied": false, "created": 1492508861.0, "created_utc": 1492480061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgejc80", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SANDER22", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "This story is exactly how I feel about life, except nothing has crumbled yet and I am 21 years old in college, and I am getting closer to my dreams of changing the world with tech. My whole life, with many highs and lows,  so far has lined up from what psychics I have seen told me when I was in middle school, along with my own powerful thoughts I've had on trips and even when sober. Life (consciousness) truly is a crazy special thing, and listening to your own self is what makes dreams unravel, and fall apart at the same time. I truly believe there is one predetermined outcome, although every one exists in different dimensions, and every little quantum particle transformation has led you to make every decision in your life/ make others do the things they say/do is all part of a higher power and grand scheme of things which people, including myself, may never learn about or have empirical proof that it exists. I can talk about this for hours haha, but I need to focus on my homework now. Given your into tech I advise you to start reading about deep learning software/ AI, because that shit is truly going to take over the world in a very incredible way; It is what I am into currently, and what I will get into in my career. Something deep down inside me had been driving me towards this industry since I took the Deep/Machine Learning classes at my university. Would love to hear more about the comanpy you sold too; awesome stuff!!!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This story is exactly how I feel about life, except nothing has crumbled yet and I am 21 years old in college, and I am getting closer to my dreams of changing the world with tech. My whole life, with many highs and lows,  so far has lined up from what psychics I have seen told me when I was in middle school, along with my own powerful thoughts I&amp;#39;ve had on trips and even when sober. Life (consciousness) truly is a crazy special thing, and listening to your own self is what makes dreams unravel, and fall apart at the same time. I truly believe there is one predetermined outcome, although every one exists in different dimensions, and every little quantum particle transformation has led you to make every decision in your life/ make others do the things they say/do is all part of a higher power and grand scheme of things which people, including myself, may never learn about or have empirical proof that it exists. I can talk about this for hours haha, but I need to focus on my homework now. Given your into tech I advise you to start reading about deep learning software/ AI, because that shit is truly going to take over the world in a very incredible way; It is what I am into currently, and what I will get into in my career. Something deep down inside me had been driving me towards this industry since I took the Deep/Machine Learning classes at my university. Would love to hear more about the comanpy you sold too; awesome stuff!!!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgejc80", "score_hidden": false, "stickied": false, "created": 1492510615.0, "created_utc": 1492481815.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dge040v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "thisdyyd", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "What kind of tech comp do you have? I was in similar situation with a possible buyer. Can you pm?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kind of tech comp do you have? I was in similar situation with a possible buyer. Can you pm?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dge040v", "score_hidden": false, "stickied": false, "created": 1492487107.0, "created_utc": 1492458307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dge8d0y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wolark", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "What kind of tech company? And man, I hope I experience something similar someday", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kind of tech company? And man, I hope I experience something similar someday&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dge8d0y", "score_hidden": false, "stickied": false, "created": 1492496807.0, "created_utc": 1492468007.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dge8rdd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "royal_fucktard", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "You say time is an illusion, maybe when you let go of the \"25 is around the corner\" thought, you were finally honest about it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You say time is an illusion, maybe when you let go of the &amp;quot;25 is around the corner&amp;quot; thought, you were finally honest about it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dge8rdd", "score_hidden": false, "stickied": false, "created": 1492497327.0, "created_utc": 1492468527.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgehr93", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aborted_bubble", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I'm sure the hundreds of kids who died from preventable diseases in the time it took you to write that are glad your vision of going from the top 3% to the top .3% richest in the world is coming true. Thank mushrooms.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure the hundreds of kids who died from preventable diseases in the time it took you to write that are glad your vision of going from the top 3% to the top .3% richest in the world is coming true. Thank mushrooms.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgehr93", "score_hidden": false, "stickied": false, "created": 1492508757.0, "created_utc": 1492479957.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgeq372", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nefandi", "parent_id": "t1_dgeq1y5", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "&gt; Because you don't know what the best vision is until it's proven best in retrospect?\n\nThat would mean you didn't get into business with the intent to sell out, right?  It would mean you ran a fine business for a while, but then maybe you got old, or you developed a new hobby or something, and you have to sell when there is a significant life change.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Because you don&amp;#39;t know what the best vision is until it&amp;#39;s proven best in retrospect?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That would mean you didn&amp;#39;t get into business with the intent to sell out, right?  It would mean you ran a fine business for a while, but then maybe you got old, or you developed a new hobby or something, and you have to sell when there is a significant life change.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeq372", "score_hidden": true, "stickied": false, "created": 1492519935.0, "created_utc": 1492491135.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeq1y5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trielm", "parent_id": "t1_dgep2bl", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Because you don't know what the best vision is until it's proven best in retrospect? And even your belief changes over time because you're not in a constant world where variables are non-existent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because you don&amp;#39;t know what the best vision is until it&amp;#39;s proven best in retrospect? And even your belief changes over time because you&amp;#39;re not in a constant world where variables are non-existent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeq1y5", "score_hidden": true, "stickied": false, "created": 1492519874.0, "created_utc": 1492491074.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgep2bl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nefandi", "parent_id": "t1_dgeoe7b", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "&gt; Maybe a sell-out means a relief from all the burden? Or you make some big money to pursue another life goal?\n\nJust based on this transaction alone, one might think buying your way back into business is much harder than selling out.  If you're selling out of this venture, then the question is, is there *any* venture anywhere at all that you will want to keep invested in?  If the answer is \"no,\" then I suggest the path of renunciation.  On the other hand, if there is something that indeed you'd want to keep invested in, then why isn't that something the first thing you've done to begin with?  Why delay the best vision?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Maybe a sell-out means a relief from all the burden? Or you make some big money to pursue another life goal?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just based on this transaction alone, one might think buying your way back into business is much harder than selling out.  If you&amp;#39;re selling out of this venture, then the question is, is there &lt;em&gt;any&lt;/em&gt; venture anywhere at all that you will want to keep invested in?  If the answer is &amp;quot;no,&amp;quot; then I suggest the path of renunciation.  On the other hand, if there is something that indeed you&amp;#39;d want to keep invested in, then why isn&amp;#39;t that something the first thing you&amp;#39;ve done to begin with?  Why delay the best vision?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgep2bl", "score_hidden": true, "stickied": false, "created": 1492518304.0, "created_utc": 1492489504.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeoe7b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trielm", "parent_id": "t1_dgenjob", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Not always true. Some startups don't charge users any money while others make some sales enough to survive, in which sense, you're still shooting in the dark and worrying everyday whether this will eventually work out. Entrepreneurial stress is tough.\n\nMaybe a sell-out means a relief from all the burden? Or you make some big money to pursue another life goal? Or even an exit is a life goal itself. I can understand the joy, but what you said earlier makes lots of sense to me regardless of the context :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not always true. Some startups don&amp;#39;t charge users any money while others make some sales enough to survive, in which sense, you&amp;#39;re still shooting in the dark and worrying everyday whether this will eventually work out. Entrepreneurial stress is tough.&lt;/p&gt;\n\n&lt;p&gt;Maybe a sell-out means a relief from all the burden? Or you make some big money to pursue another life goal? Or even an exit is a life goal itself. I can understand the joy, but what you said earlier makes lots of sense to me regardless of the context :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeoe7b", "score_hidden": true, "stickied": false, "created": 1492517309.0, "created_utc": 1492488509.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgenjob", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nefandi", "parent_id": "t1_dgele03", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "&gt;  When somebody acquires your tech product, that means your vision is finally being recognized and you know it's worth it for countless nights of getting wired in on the computer and shooting in the dark.\n\nWith regard to having a sense of validation in business, how about having paying customers?  Is it really necessary to sell out to feel accepted?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;When somebody acquires your tech product, that means your vision is finally being recognized and you know it&amp;#39;s worth it for countless nights of getting wired in on the computer and shooting in the dark.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;With regard to having a sense of validation in business, how about having paying customers?  Is it really necessary to sell out to feel accepted?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgenjob", "score_hidden": true, "stickied": false, "created": 1492516056.0, "created_utc": 1492487256.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgele03", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "trielm", "parent_id": "t1_dgek1ij", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Very good insight here man, I certainly don't have anything else to add, although in the tech startup industry, a sale is usually more than a trade, they call it an exit. It seems like OP had a positive exit which is almost all entrepreneurs' goal.\n\nI don't really think the joy comes from the \"perceived disparity of values\", perhaps not in this context. When somebody acquires your tech product, that means your vision is finally being recognized and you know it's worth it for countless nights of getting wired in on the computer and shooting in the dark.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very good insight here man, I certainly don&amp;#39;t have anything else to add, although in the tech startup industry, a sale is usually more than a trade, they call it an exit. It seems like OP had a positive exit which is almost all entrepreneurs&amp;#39; goal.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really think the joy comes from the &amp;quot;perceived disparity of values&amp;quot;, perhaps not in this context. When somebody acquires your tech product, that means your vision is finally being recognized and you know it&amp;#39;s worth it for countless nights of getting wired in on the computer and shooting in the dark.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgele03", "score_hidden": false, "stickied": false, "created": 1492513136.0, "created_utc": 1492484336.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgek1ij", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nefandi", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I read the entire post before replying.  There is something that strikes me as strange about your cognition.  It's your level of excitement surrounding the prospect of the sale.  Each sale is a trade, and if you're getting this ebullient about a trade, it means there is some perceived disparity of values in your cognition.  Where that disparity is, I certainly have a clue, but I don't want to make it too explicit.  Let me just say that if you trade one thing of value for another thing of roughly the same value, your feeling should be one of contentment and peaceful joy, and not one of jumping for joy.  Is the prospective purchaser a moron and you're about to walk out of a very very \"lucky\" trade?  Or, are you the one who undervalues that which you are selling?  But if the latter is true, you shouldn't be jumping for joy, but you should be crying instead.  Or maybe it's something else entirely.  I just know one thing, I've had many good trades in my life, but I've never had to jump for joy regarding a trade if everything was as expected and above board.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read the entire post before replying.  There is something that strikes me as strange about your cognition.  It&amp;#39;s your level of excitement surrounding the prospect of the sale.  Each sale is a trade, and if you&amp;#39;re getting this ebullient about a trade, it means there is some perceived disparity of values in your cognition.  Where that disparity is, I certainly have a clue, but I don&amp;#39;t want to make it too explicit.  Let me just say that if you trade one thing of value for another thing of roughly the same value, your feeling should be one of contentment and peaceful joy, and not one of jumping for joy.  Is the prospective purchaser a moron and you&amp;#39;re about to walk out of a very very &amp;quot;lucky&amp;quot; trade?  Or, are you the one who undervalues that which you are selling?  But if the latter is true, you shouldn&amp;#39;t be jumping for joy, but you should be crying instead.  Or maybe it&amp;#39;s something else entirely.  I just know one thing, I&amp;#39;ve had many good trades in my life, but I&amp;#39;ve never had to jump for joy regarding a trade if everything was as expected and above board.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgek1ij", "score_hidden": false, "stickied": false, "created": 1492511444.0, "created_utc": 1492482644.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgeispw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Letsbereal", "parent_id": "t1_dge9b23", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "no dude, hes about to land a super sweet condo, everything in the world is all good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no dude, hes about to land a super sweet condo, everything in the world is all good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeispw", "score_hidden": false, "stickied": false, "created": 1492509991.0, "created_utc": 1492481191.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge9b23", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "falsesleep", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Cool. Now just dream of things that make the world a better place, rather than to feed the ego.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cool. Now just dream of things that make the world a better place, rather than to feed the ego.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dge9b23", "score_hidden": false, "stickied": false, "created": 1492498045.0, "created_utc": 1492469245.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_65wnv0", "likes": null, "replies": "", "user_reports": [], "id": "dgeio52", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Letsbereal", "parent_id": "t3_65wnv0", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "If your dream is becoming rich, idk what to tell you man. \n\nLife is literally just something to enjoy. Having no financial stress helps, but like millions of other people, you'll ask yourself, \"what now\" when you land in your nice condo with a nice view etc etc. With alot of money, the opportunities for distraction are immense, and the whole point of modern technological society is to increase those distractions. But if you actually care about the meaning of life, you'll always get to a point where you ask, \"what now.\" \n\nYou'll decide to travel, and sight-see to distract yourself from the 'what now'. And meet new people, and sight-see more, etc. Some people can keep this up till they die, but they live in only the neutral mode of life, passion. Passion ain't bad, but it aint necessarily 'good' either. Theres three modes of life: goodness, passion, and ignorance. Once you get into the goodness mode, you won't be asking 'what now'.\n\nThe question is, how do you enjoy life eternally. How do you get to a mode where you are always satisfied, and there is no 'what now'? After all the distractions are used up, after the friends are gone, after the families grown up or dead, you'll be alone, and if you've been putting off that 'what now' question, you'll suffer.  Human life is suffering, so how is it possible to overcome that and attain eternal happiness.\n\nThere is a real simple answer to that, and it sure aint money :P\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your dream is becoming rich, idk what to tell you man. &lt;/p&gt;\n\n&lt;p&gt;Life is literally just something to enjoy. Having no financial stress helps, but like millions of other people, you&amp;#39;ll ask yourself, &amp;quot;what now&amp;quot; when you land in your nice condo with a nice view etc etc. With alot of money, the opportunities for distraction are immense, and the whole point of modern technological society is to increase those distractions. But if you actually care about the meaning of life, you&amp;#39;ll always get to a point where you ask, &amp;quot;what now.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll decide to travel, and sight-see to distract yourself from the &amp;#39;what now&amp;#39;. And meet new people, and sight-see more, etc. Some people can keep this up till they die, but they live in only the neutral mode of life, passion. Passion ain&amp;#39;t bad, but it aint necessarily &amp;#39;good&amp;#39; either. Theres three modes of life: goodness, passion, and ignorance. Once you get into the goodness mode, you won&amp;#39;t be asking &amp;#39;what now&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;The question is, how do you enjoy life eternally. How do you get to a mode where you are always satisfied, and there is no &amp;#39;what now&amp;#39;? After all the distractions are used up, after the friends are gone, after the families grown up or dead, you&amp;#39;ll be alone, and if you&amp;#39;ve been putting off that &amp;#39;what now&amp;#39; question, you&amp;#39;ll suffer.  Human life is suffering, so how is it possible to overcome that and attain eternal happiness.&lt;/p&gt;\n\n&lt;p&gt;There is a real simple answer to that, and it sure aint money :P&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeio52", "score_hidden": false, "stickied": false, "created": 1492509844.0, "created_utc": 1492481044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]