[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Psychonaut", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I usually try to keep a reasonable head, so I&amp;#39;m just going to throw my idea out simply as an idea or possibility, and nothing more.... I also want everyone to know that the imagery was mental, but intensified. These were stream of consciousness thoughts and images. &lt;/p&gt;\n\n&lt;p&gt;I had a pretty fuckin&amp;#39; extreme cannabis edible high recently. I&amp;#39;ve had these types of experiences before on edibles, but not to this degree. I was experiencing hypnogogic images and concepts of geometric patterns, with a cathedral-like appearance to them. These geometric patterns would have a crystalline look to them, as I could see in my mind&amp;#39;s eye. They would wave and breath and roll in and out in a variety of different speeds depending on the structure or pattern, and with these rolls and fluid in and out movements, there would be a geometric shape and pattern of multi-dimensional properties, that would be shifting into a variety of different positions and outputs, almost like an infinitely complex rubix cube that also spun around occasionally. &lt;/p&gt;\n\n&lt;p&gt;In my mind&amp;#39;s eye, it seemed as if it the quality of the images, or how they looked, were as if it was in HD times 100. Also, the colors. Red, greens, oranges, golds, yellows... those were the main colors that the crystalline structures would be in. &lt;/p&gt;\n\n&lt;p&gt;I consistently see a woman... or a being that was mostly feminine, and in the back of my head I kept thinking, &amp;quot;Higher self, higher self, higher self.&amp;quot; She smiled warmly, and she was a form of golden light. She had the look as if she was a mixed ethnicity of asian, caucasian, african, indian, middle-eastern, and native american qualities. And &lt;em&gt;holy shit&lt;/em&gt; she was beautiful. I vividly held an image of her speaking to me, &amp;quot;You are doing well.&amp;quot; She smiled and then disappeared. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://youtu.be/JxPvIdM5PpY\"&gt;Nxxxxs - Potential Weather&lt;/a&gt; starts playing. Fuck, the conceptualizations.. they weren&amp;#39;t visuals but goddamn were they intense mental images. I see these crystalline beings, they&amp;#39;re all dancing to the beat of the song, and the geometric patterns were spinning and waving. The beings moved their shoulders and torsos as if they were snakes... swaying back and forth while they had a pipe in their hand, smoking it and having this face of a casual sort of ecstasy, with a hint of holding an aggressive sort of personality. It&amp;#39;s like they liked being lords and goddesses of these substances they took consistently. They smiled wickedly but cooly, and I had an idea that they viewed many of our psychedelics as if it was child&amp;#39;s play. Especially the edible I was on, I imagined them laughing because of the fact that I was tripping out, yet they were still somewhat chill toward me. &lt;/p&gt;\n\n&lt;p&gt;Look, &amp;quot;imagined&amp;quot; isn&amp;#39;t the correct term... &lt;em&gt;visualize&lt;/em&gt; however is better. I was visualizing all of this as if it was some sort of stream of consciousness. The feminine being I presumed was my higher self, these other beings were like some sort of psychonautic gods that viewed life and existence as just a wild fucking ride, and they didn&amp;#39;t give to much of a damn on what would happen, because they knew they were safe with &amp;quot;Source&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Source, I was now conceptualizing this source. I visualized an infinite sort of... light? Regardless, this formless... seed was a balancing force, not really giving mind to what happens because it all is what it is - a growth and flourishing of Itself. &lt;/p&gt;\n\n&lt;p&gt;Next, I realize that this whole geometric, crystalline, energetic expanse, is the realm of &amp;quot;souls&amp;quot;. They conceptualize anything and everything, and then they channel these ideas into worlds and realities and universes to experience. I start visualizing these floating black voids with sparkles of galaxies within, all while the geometric expanse surrounds it. These beings choose a life, or a specific sequence of lives, or just choose the spontaneous option, and experience a reality and its universes. These simulations give a more intense experience of life, a more intense and in-depth interaction with their concepts. They designed these simulations to forget about themselves and what they are, so they their consciousness can identify fully as the form they choose to inhabit. &lt;/p&gt;\n\n&lt;p&gt;I see every experience these beings choose, whether murderous and destructive, or peaceful and happy, or sexy and lustful, they don&amp;#39;t mind. There is no &amp;quot;good&amp;quot; or &amp;quot;bad&amp;quot; in their heads, just experiential. Life is like the ultimate video game to them. &lt;/p&gt;\n\n&lt;p&gt;I visualize an infinite number of these realities, each with different multiverses, and different stylizations of perception, and different natural laws. Holy fucking shit. This truly is a simulation to them. They just play their concepts out and then afterwards they celebrate, get turnt, or maybe focus on creating a new reality, or maybe make love, or maybe just have a general conversation of their experiences, as if it were some casual happening to them, yet they were never bored. &lt;/p&gt;\n\n&lt;p&gt;The dancing beings laughed, and smiled at me with lowered eyes and a smug, toothy grin. They think it&amp;#39;s funny that I&amp;#39;m visualizing this shit on something as mildly psychedelic as cannabis is. They continue dancing, and then I meet my higher self again. She tells me, &amp;quot;You did well.&amp;quot; Smiles, closes her eyes, and fades away. &lt;/p&gt;\n\n&lt;p&gt;I fade away with the music. I still feel that subtle cathedral like phenomena. &lt;/p&gt;\n\n&lt;p&gt;So, I&amp;#39;m taking into serious consideration that this universe and reality is simply a simulation/virtual reality thing for these higher entities, which are what our &amp;quot;souls&amp;quot; actually are, to consistently experience their concepts of existence through. In other words, I am a result not only of the physical unraveling of the universe, but am conscious because I decided, &amp;quot;hey, this seems like it&amp;#39;ll be fun to try out&amp;quot;, and here I am. My life is just a blink of the eye if not shorter to these highly complex, highly intelligent beyond our comprehension, energetic, and crystalline like beings beyond this universe. I am just experiencing to experience, and nothing more, and everything is damn near trivial.... although simultaneously fucking incredible...&lt;/p&gt;\n\n&lt;p&gt;What the fuck was this guys? I&amp;#39;ve only taken LSD, and Cannabis in terms of psyches. Nothing else. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; I ate an edible and ended up visualizing a whole other realm of existence filled with geometric, crystalline entities that experience a multitude of lives and realities as almost a form of entertainment. There are infinite realities and universes that are simulations, ours being one of them.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I usually try to keep a reasonable head, so I'm just going to throw my idea out simply as an idea or possibility, and nothing more.... I also want everyone to know that the imagery was mental, but intensified. These were stream of consciousness thoughts and images. \n\nI had a pretty fuckin' extreme cannabis edible high recently. I've had these types of experiences before on edibles, but not to this degree. I was experiencing hypnogogic images and concepts of geometric patterns, with a cathedral-like appearance to them. These geometric patterns would have a crystalline look to them, as I could see in my mind's eye. They would wave and breath and roll in and out in a variety of different speeds depending on the structure or pattern, and with these rolls and fluid in and out movements, there would be a geometric shape and pattern of multi-dimensional properties, that would be shifting into a variety of different positions and outputs, almost like an infinitely complex rubix cube that also spun around occasionally. \n\nIn my mind's eye, it seemed as if it the quality of the images, or how they looked, were as if it was in HD times 100. Also, the colors. Red, greens, oranges, golds, yellows... those were the main colors that the crystalline structures would be in. \n\nI consistently see a woman... or a being that was mostly feminine, and in the back of my head I kept thinking, \"Higher self, higher self, higher self.\" She smiled warmly, and she was a form of golden light. She had the look as if she was a mixed ethnicity of asian, caucasian, african, indian, middle-eastern, and native american qualities. And *holy shit* she was beautiful. I vividly held an image of her speaking to me, \"You are doing well.\" She smiled and then disappeared. \n\n[Nxxxxs - Potential Weather](https://youtu.be/JxPvIdM5PpY) starts playing. Fuck, the conceptualizations.. they weren't visuals but goddamn were they intense mental images. I see these crystalline beings, they're all dancing to the beat of the song, and the geometric patterns were spinning and waving. The beings moved their shoulders and torsos as if they were snakes... swaying back and forth while they had a pipe in their hand, smoking it and having this face of a casual sort of ecstasy, with a hint of holding an aggressive sort of personality. It's like they liked being lords and goddesses of these substances they took consistently. They smiled wickedly but cooly, and I had an idea that they viewed many of our psychedelics as if it was child's play. Especially the edible I was on, I imagined them laughing because of the fact that I was tripping out, yet they were still somewhat chill toward me. \n\nLook, \"imagined\" isn't the correct term... *visualize* however is better. I was visualizing all of this as if it was some sort of stream of consciousness. The feminine being I presumed was my higher self, these other beings were like some sort of psychonautic gods that viewed life and existence as just a wild fucking ride, and they didn't give to much of a damn on what would happen, because they knew they were safe with \"Source\".\n\nSource, I was now conceptualizing this source. I visualized an infinite sort of... light? Regardless, this formless... seed was a balancing force, not really giving mind to what happens because it all is what it is - a growth and flourishing of Itself. \n\nNext, I realize that this whole geometric, crystalline, energetic expanse, is the realm of \"souls\". They conceptualize anything and everything, and then they channel these ideas into worlds and realities and universes to experience. I start visualizing these floating black voids with sparkles of galaxies within, all while the geometric expanse surrounds it. These beings choose a life, or a specific sequence of lives, or just choose the spontaneous option, and experience a reality and its universes. These simulations give a more intense experience of life, a more intense and in-depth interaction with their concepts. They designed these simulations to forget about themselves and what they are, so they their consciousness can identify fully as the form they choose to inhabit. \n\nI see every experience these beings choose, whether murderous and destructive, or peaceful and happy, or sexy and lustful, they don't mind. There is no \"good\" or \"bad\" in their heads, just experiential. Life is like the ultimate video game to them. \n\nI visualize an infinite number of these realities, each with different multiverses, and different stylizations of perception, and different natural laws. Holy fucking shit. This truly is a simulation to them. They just play their concepts out and then afterwards they celebrate, get turnt, or maybe focus on creating a new reality, or maybe make love, or maybe just have a general conversation of their experiences, as if it were some casual happening to them, yet they were never bored. \n\nThe dancing beings laughed, and smiled at me with lowered eyes and a smug, toothy grin. They think it's funny that I'm visualizing this shit on something as mildly psychedelic as cannabis is. They continue dancing, and then I meet my higher self again. She tells me, \"You did well.\" Smiles, closes her eyes, and fades away. \n\nI fade away with the music. I still feel that subtle cathedral like phenomena. \n\nSo, I'm taking into serious consideration that this universe and reality is simply a simulation/virtual reality thing for these higher entities, which are what our \"souls\" actually are, to consistently experience their concepts of existence through. In other words, I am a result not only of the physical unraveling of the universe, but am conscious because I decided, \"hey, this seems like it'll be fun to try out\", and here I am. My life is just a blink of the eye if not shorter to these highly complex, highly intelligent beyond our comprehension, energetic, and crystalline like beings beyond this universe. I am just experiencing to experience, and nothing more, and everything is damn near trivial.... although simultaneously fucking incredible...\n\nWhat the fuck was this guys? I've only taken LSD, and Cannabis in terms of psyches. Nothing else. \n\n**TL;DR** I ate an edible and ended up visualizing a whole other realm of existence filled with geometric, crystalline entities that experience a multitude of lives and realities as almost a form of entertainment. There are infinite realities and universes that are simulations, ours being one of them.  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "66011w", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "imadeaquickaccount", "saved": false, "mod_reports": [], "name": "t3_66011w", "subreddit_name_prefixed": "r/Psychonaut", "approved_by": null, "over_18": false, "domain": "self.Psychonaut", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/4e54SHlqAUPgH0x0ZvOgG1Ye-VOF_RIKDkOd5sb1TTc.jpg?s=d73262d703a567fc0cb14af243033ced", "width": 480, "height": 360}, "resolutions": [{"url": "https://i.redditmedia.com/4e54SHlqAUPgH0x0ZvOgG1Ye-VOF_RIKDkOd5sb1TTc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=367d2217c71fafea3cd3d86f50c4e7a0", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/4e54SHlqAUPgH0x0ZvOgG1Ye-VOF_RIKDkOd5sb1TTc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=286acccb45828f559e394f3f1e711c4e", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/4e54SHlqAUPgH0x0ZvOgG1Ye-VOF_RIKDkOd5sb1TTc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=c4d7cca082fd718ec32dbf1ccebf79b6", "width": 320, "height": 240}], "variants": {}, "id": "BTbverg4qmN6GD6seKCnS_hZDmqBZdULomLoaFec9TU"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2qplv", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Psychonaut/comments/66011w/ate_an_edible_met_my_higher_self_some_crystalline/", "num_reports": null, "locked": false, "stickied": false, "created": 1492509966.0, "url": "https://www.reddit.com/r/Psychonaut/comments/66011w/ate_an_edible_met_my_higher_self_some_crystalline/", "author_flair_text": null, "quarantine": false, "title": "Ate an edible, met my higher self, some crystalline entities, and realized this could all be a highly advanced simulation.", "created_utc": 1492481166.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_66011w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_66011w", "likes": null, "replies": "", "user_reports": [], "id": "dgeqn7p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imadeaquickaccount", "parent_id": "t1_dgen24e", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Will check him out! I'll be more careful next time though thank you haha\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Will check him out! I&amp;#39;ll be more careful next time though thank you haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeqn7p", "score_hidden": true, "stickied": false, "created": 1492520892.0, "created_utc": 1492492092.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgen24e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "c0sm0nautt", "parent_id": "t3_66011w", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Have you ever read any of Tom Campbell's stuff? He wrote a trilogy of books called My Big TOE (Theory of Everything) which is his theory of reality based on years of self induced out-of-body experiences. In short, he believes our reality system is in place for consciousness to learn and grow in - he is a physicist by trade and uses the scientific term \"reduce entropy.\" \n\nAlso, be careful with edibles man! The only \"bad\" trips I've ever had came from high dose edibles. I've been sent to the dark void of space on those things. Nowadays I stick too a small amount of vaporization. :) Weed is psychedelic in high edible dosages... now you know. =D", "edited": 1492487287.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever read any of Tom Campbell&amp;#39;s stuff? He wrote a trilogy of books called My Big TOE (Theory of Everything) which is his theory of reality based on years of self induced out-of-body experiences. In short, he believes our reality system is in place for consciousness to learn and grow in - he is a physicist by trade and uses the scientific term &amp;quot;reduce entropy.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Also, be careful with edibles man! The only &amp;quot;bad&amp;quot; trips I&amp;#39;ve ever had came from high dose edibles. I&amp;#39;ve been sent to the dark void of space on those things. Nowadays I stick too a small amount of vaporization. :) Weed is psychedelic in high edible dosages... now you know. =D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgen24e", "score_hidden": false, "stickied": false, "created": 1492515349.0, "created_utc": 1492486549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_66011w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_66011w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_66011w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_66011w", "likes": null, "replies": "", "user_reports": [], "id": "dgeqmio", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imadeaquickaccount", "parent_id": "t1_dgeoxl4", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "I'll still take a read on this, but honestly, I personally feel as if these beings weren't above us but more *are* us. \n\nLike, we're just \"souls\" experiencing all of this. A created simulation to experience as many realities and lives as we want. \n\nAnd quite honestly - as well as the motherly comfort of my supposed higher self - I felt some damn good comfort with the visualized hyper-evolved substance deities haha. They seemed fucking wicked cool.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll still take a read on this, but honestly, I personally feel as if these beings weren&amp;#39;t above us but more &lt;em&gt;are&lt;/em&gt; us. &lt;/p&gt;\n\n&lt;p&gt;Like, we&amp;#39;re just &amp;quot;souls&amp;quot; experiencing all of this. A created simulation to experience as many realities and lives as we want. &lt;/p&gt;\n\n&lt;p&gt;And quite honestly - as well as the motherly comfort of my supposed higher self - I felt some damn good comfort with the visualized hyper-evolved substance deities haha. They seemed fucking wicked cool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeqmio", "score_hidden": true, "stickied": false, "created": 1492520859.0, "created_utc": 1492492059.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgeoxl4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DrSnowMonkey", "parent_id": "t1_dgemv8i", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "For real man, im done trying to scare myself with dark shit. Time to not worry about all that rn, and enjoy this pretty easy going journey", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For real man, im done trying to scare myself with dark shit. Time to not worry about all that rn, and enjoy this pretty easy going journey&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeoxl4", "score_hidden": true, "stickied": false, "created": 1492518100.0, "created_utc": 1492489300.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemv8i", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "c0sm0nautt", "parent_id": "t1_dgekdne", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "His stuff is too dark. I think there is balance to everything. I was walking around today and just experiencing the beautiful blooming trees all around my neighborhood felt so good. I'd rather focus on that stuff then be on my computer worried that we are trapped in a interdimensional prison by evil hyperdimensional beings. I do believe that we are in a simulation of sorts and ultimately consciousnesses is the fundamental to reality, not matter. I just don't see the world as a prison, but rather a reality with a rule set that allows choice and growth.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His stuff is too dark. I think there is balance to everything. I was walking around today and just experiencing the beautiful blooming trees all around my neighborhood felt so good. I&amp;#39;d rather focus on that stuff then be on my computer worried that we are trapped in a interdimensional prison by evil hyperdimensional beings. I do believe that we are in a simulation of sorts and ultimately consciousnesses is the fundamental to reality, not matter. I just don&amp;#39;t see the world as a prison, but rather a reality with a rule set that allows choice and growth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgemv8i", "score_hidden": false, "stickied": false, "created": 1492515081.0, "created_utc": 1492486281.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgekdne", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "corn_of_action", "parent_id": "t3_66011w", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "Check out montalk.net if you haven't already, it describes the ideas around  the stuff you experienced in some detail", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Check out montalk.net if you haven&amp;#39;t already, it describes the ideas around  the stuff you experienced in some detail&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgekdne", "score_hidden": false, "stickied": false, "created": 1492511861.0, "created_utc": 1492483061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_66011w", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qplv", "removal_reason": null, "link_id": "t3_66011w", "likes": null, "replies": "", "user_reports": [], "id": "dgeqovf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imadeaquickaccount", "parent_id": "t1_dgemk98", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "The cookie was 450 mg THC. I ate not even half, more half a quarter. Underestimated the hell out of that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The cookie was 450 mg THC. I ate not even half, more half a quarter. Underestimated the hell out of that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgeqovf", "score_hidden": true, "stickied": false, "created": 1492520966.0, "created_utc": 1492492166.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgemk98", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "masterhunter666", "parent_id": "t3_66011w", "subreddit_name_prefixed": "r/Psychonaut", "controversiality": 0, "body": "That sounds pretty insane especially from an edible. I've had similar themes on a LSD trip. Do you know how much weed was in the edible? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds pretty insane especially from an edible. I&amp;#39;ve had similar themes on a LSD trip. Do you know how much weed was in the edible? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Psychonaut", "name": "t1_dgemk98", "score_hidden": false, "stickied": false, "created": 1492514661.0, "created_utc": 1492485861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]