[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "OutOfTheLoop", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I keep on hearing about somebody in the competitive Pokemon scene named Versilify and see that he gets a lot of hate thrown his way, but does anyone know why he gets so much hate? I&amp;#39;m really curious. Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So, I keep on hearing about somebody in the competitive Pokemon scene named Versilify and see that he gets a lot of hate thrown his way, but does anyone know why he gets so much hate? I'm really curious. Thanks.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Answered", "id": "652uir", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "The-Bigger-Fish", "saved": false, "mod_reports": [], "name": "t3_652uir", "subreddit_name_prefixed": "r/OutOfTheLoop", "approved_by": null, "over_18": false, "domain": "self.OutOfTheLoop", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2xinb", "edited": false, "link_flair_css_class": "flair c", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/OutOfTheLoop/comments/652uir/why_do_people_hate_versilify/", "num_reports": null, "locked": false, "stickied": false, "created": 1492079902.0, "url": "https://www.reddit.com/r/OutOfTheLoop/comments/652uir/why_do_people_hate_versilify/", "author_flair_text": null, "quarantine": false, "title": "Why do people hate Versilify?", "created_utc": 1492051102.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xinb", "removal_reason": null, "link_id": "t3_652uir", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xinb", "removal_reason": null, "link_id": "t3_652uir", "likes": null, "replies": "", "user_reports": [], "id": "dg8bw05", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "The-Bigger-Fish", "parent_id": "t1_dg8751l", "subreddit_name_prefixed": "r/OutOfTheLoop", "controversiality": 0, "body": "Thanks, this honestly explains a lot about the situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, this honestly explains a lot about the situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OutOfTheLoop", "name": "t1_dg8bw05", "score_hidden": false, "stickied": false, "created": 1492151019.0, "created_utc": 1492122219.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8751l", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "potentialPizza", "parent_id": "t3_652uir", "subreddit_name_prefixed": "r/OutOfTheLoop", "controversiality": 0, "body": "[An old comment that explains a lot of it better than I can.](https://www.reddit.com/r/pokemon/comments/2inrxk/verlisify_community_impressions/cl45fne/)\n\nI haven't been that deep into competitive Pokémon for quite some time, so some of this might be outdated, and Verlisify might have changed for the better. But I can sum up why, in the past, he's been criticized.\n\nVerlisify was, in the past notorious for insulting things he doesn't understand and then playing the victim when people call him out. \n\nFor a bit of context, a large part of competitive Pokémon is centered around Smogon – an online community that set up its own rules and sets Pokémon into tiers – something a lot of people misunderstand, but essentially are a healthy and good thing for the metagame (they don't divide Pokémon into unnecessary categories, but instead allow you to use certain Pokémon in environments where using them doesn't massively decrease your chances of winning). Smogon does not try to sell its rules as official; they exist for the community to use. Nobody is forced to play with them.\n\nThe other major competitive Pokémon scene is VGC – the official one, controlled by The Pokémon Company. It has a different format – Double Battles instead of Single Battles, a system where you bring 6 Pokémon and only use 4, and a different system of bans.\n\nBoth are healthy, fun, and going strong. It's hard to judge which is bigger, and doing so doesn't really mean anything anyway, as one has official support and therefore plenty of money behind it, while the other is entirely community-driven. Most people just have fun playing whatever they prefer.\n\nNow, Verlisify. He stirred up a lot of drama and got extremely mad at the fact that Smogon is so popular despite being unofficial – even suggesting that people instead play VGC singles, which isn't a thing that exists.\n\nHe criticized Smogon's rulesets, saying that they \"ban things they can't beat\" – which is a fallacy on multiple levels. First of all, Smogon is a competitive scene, and people play to win. They *use* the things they ban, and if something overcentralizes the metagame (in other words, is so good that you need to be using it or something that specifically counters it (but might be useless otherwise) in order to succeed), it's tested and then voted on to be banned or not. Secondly, he said shit like (and this is outdated as hell) Slurpuff can counter Mega-Kangaskhan, which is honestly incredibly stupid and shows a total ignorance of how competitive Pokémon even works. He was easily not someone to trust on what should or shouldn't be banned. He also became notorious for spreading sets that are just plain awful. [This is more a meme than an argument](https://www.youtube.com/watch?v=NvaW7EMTVWk), but it represents how most people who knew what they were talking about saw the sets that Verlisify would suggest. [This](https://www.youtube.com/watch?v=XJefn1X1nFw) should show anybody who understands competitive Pokémon how poor his understanding was.\n\nAlso, he defended Evasion as a legitimate skill-based strategy. That's right, *Evasion*. Something entirely dependent on luck that any reasonable competitive format would ban. This destroyed a lot of his credibility.\n\nNow, all of this were his opinions. A lot of them were pretty dumb opinions, given that he would present them as fact even though he didn't even understand what he was talking about and people could easily disprove him. But they were his opinions.\n\nUnfortunately, he had no respect for the idea that anybody should just play what they want to play and have fun. Instead, he got pissed at people who played and enjoyed Smogon's formats, stirred up drama over it, and then played the victim whenever he was called out.\n\n[This](https://www.youtube.com/watch?v=7GQo1oSccNI) is a pretty interesting, unbiased interview that might shed some light on the guy, and also just say a lot of interesting things about competitive Pokémon. [This](https://www.youtube.com/watch?v=5FUd-QvJioI) is a fairly biased rant about the guy, that might go into more detail than I have about the problems people had about him.\n\nAnd for a couple of examples him starting shit and then playing the victim, watch [this](https://www.youtube.com/watch?v=872IxzeupAk), and then [this](https://www.youtube.com/watch?v=1oSQUEugVSY). He started fights, then acted like he was the one who was attacked. He shit talked an entire community and then played the victim. He went on about people insulting him (which was shitty of them to do, don't get me wrong) but then acted as though that means everyone who disagreed with him was wrong. As a whole, he had no respect for differing opinions, while most of the people who were mad at him were against him for being a jackass, not for disagreeing.\n\nBut I'd like to repeat, this is all from a while back. I'm not really that familiar with how he is right now, but I believe that he's stopped stirring up drama and stopped shit talking Smogon.", "edited": 1492122626.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/pokemon/comments/2inrxk/verlisify_community_impressions/cl45fne/\"&gt;An old comment that explains a lot of it better than I can.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t been that deep into competitive Pokémon for quite some time, so some of this might be outdated, and Verlisify might have changed for the better. But I can sum up why, in the past, he&amp;#39;s been criticized.&lt;/p&gt;\n\n&lt;p&gt;Verlisify was, in the past notorious for insulting things he doesn&amp;#39;t understand and then playing the victim when people call him out. &lt;/p&gt;\n\n&lt;p&gt;For a bit of context, a large part of competitive Pokémon is centered around Smogon – an online community that set up its own rules and sets Pokémon into tiers – something a lot of people misunderstand, but essentially are a healthy and good thing for the metagame (they don&amp;#39;t divide Pokémon into unnecessary categories, but instead allow you to use certain Pokémon in environments where using them doesn&amp;#39;t massively decrease your chances of winning). Smogon does not try to sell its rules as official; they exist for the community to use. Nobody is forced to play with them.&lt;/p&gt;\n\n&lt;p&gt;The other major competitive Pokémon scene is VGC – the official one, controlled by The Pokémon Company. It has a different format – Double Battles instead of Single Battles, a system where you bring 6 Pokémon and only use 4, and a different system of bans.&lt;/p&gt;\n\n&lt;p&gt;Both are healthy, fun, and going strong. It&amp;#39;s hard to judge which is bigger, and doing so doesn&amp;#39;t really mean anything anyway, as one has official support and therefore plenty of money behind it, while the other is entirely community-driven. Most people just have fun playing whatever they prefer.&lt;/p&gt;\n\n&lt;p&gt;Now, Verlisify. He stirred up a lot of drama and got extremely mad at the fact that Smogon is so popular despite being unofficial – even suggesting that people instead play VGC singles, which isn&amp;#39;t a thing that exists.&lt;/p&gt;\n\n&lt;p&gt;He criticized Smogon&amp;#39;s rulesets, saying that they &amp;quot;ban things they can&amp;#39;t beat&amp;quot; – which is a fallacy on multiple levels. First of all, Smogon is a competitive scene, and people play to win. They &lt;em&gt;use&lt;/em&gt; the things they ban, and if something overcentralizes the metagame (in other words, is so good that you need to be using it or something that specifically counters it (but might be useless otherwise) in order to succeed), it&amp;#39;s tested and then voted on to be banned or not. Secondly, he said shit like (and this is outdated as hell) Slurpuff can counter Mega-Kangaskhan, which is honestly incredibly stupid and shows a total ignorance of how competitive Pokémon even works. He was easily not someone to trust on what should or shouldn&amp;#39;t be banned. He also became notorious for spreading sets that are just plain awful. &lt;a href=\"https://www.youtube.com/watch?v=NvaW7EMTVWk\"&gt;This is more a meme than an argument&lt;/a&gt;, but it represents how most people who knew what they were talking about saw the sets that Verlisify would suggest. &lt;a href=\"https://www.youtube.com/watch?v=XJefn1X1nFw\"&gt;This&lt;/a&gt; should show anybody who understands competitive Pokémon how poor his understanding was.&lt;/p&gt;\n\n&lt;p&gt;Also, he defended Evasion as a legitimate skill-based strategy. That&amp;#39;s right, &lt;em&gt;Evasion&lt;/em&gt;. Something entirely dependent on luck that any reasonable competitive format would ban. This destroyed a lot of his credibility.&lt;/p&gt;\n\n&lt;p&gt;Now, all of this were his opinions. A lot of them were pretty dumb opinions, given that he would present them as fact even though he didn&amp;#39;t even understand what he was talking about and people could easily disprove him. But they were his opinions.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, he had no respect for the idea that anybody should just play what they want to play and have fun. Instead, he got pissed at people who played and enjoyed Smogon&amp;#39;s formats, stirred up drama over it, and then played the victim whenever he was called out.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=7GQo1oSccNI\"&gt;This&lt;/a&gt; is a pretty interesting, unbiased interview that might shed some light on the guy, and also just say a lot of interesting things about competitive Pokémon. &lt;a href=\"https://www.youtube.com/watch?v=5FUd-QvJioI\"&gt;This&lt;/a&gt; is a fairly biased rant about the guy, that might go into more detail than I have about the problems people had about him.&lt;/p&gt;\n\n&lt;p&gt;And for a couple of examples him starting shit and then playing the victim, watch &lt;a href=\"https://www.youtube.com/watch?v=872IxzeupAk\"&gt;this&lt;/a&gt;, and then &lt;a href=\"https://www.youtube.com/watch?v=1oSQUEugVSY\"&gt;this&lt;/a&gt;. He started fights, then acted like he was the one who was attacked. He shit talked an entire community and then played the victim. He went on about people insulting him (which was shitty of them to do, don&amp;#39;t get me wrong) but then acted as though that means everyone who disagreed with him was wrong. As a whole, he had no respect for differing opinions, while most of the people who were mad at him were against him for being a jackass, not for disagreeing.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;d like to repeat, this is all from a while back. I&amp;#39;m not really that familiar with how he is right now, but I believe that he&amp;#39;s stopped stirring up drama and stopped shit talking Smogon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OutOfTheLoop", "name": "t1_dg8751l", "score_hidden": false, "stickied": false, "created": 1492145190.0, "created_utc": 1492116390.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2xinb", "removal_reason": null, "link_id": "t3_652uir", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xinb", "removal_reason": null, "link_id": "t3_652uir", "likes": null, "replies": "", "user_reports": [], "id": "dg8exnz", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "presidenttrump_2016", "parent_id": "t1_dg7l58l", "subreddit_name_prefixed": "r/OutOfTheLoop", "controversiality": 0, "body": "&gt; people feel he deliberately tries to stir up drama in the competitive Pokémon community for attention,\n\nA furry seeking out attention, not surprising.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;people feel he deliberately tries to stir up drama in the competitive Pokémon community for attention,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;A furry seeking out attention, not surprising.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OutOfTheLoop", "name": "t1_dg8exnz", "score_hidden": false, "stickied": false, "created": 1492155070.0, "created_utc": 1492126270.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2xinb", "removal_reason": null, "link_id": "t3_652uir", "likes": null, "replies": "", "user_reports": [], "id": "dg7prjs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The-Bigger-Fish", "parent_id": "t1_dg7l58l", "subreddit_name_prefixed": "r/OutOfTheLoop", "controversiality": 0, "body": "Thanks, I'll look into it some more as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, I&amp;#39;ll look into it some more as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OutOfTheLoop", "name": "t1_dg7prjs", "score_hidden": false, "stickied": false, "created": 1492126486.0, "created_utc": 1492097686.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7l58l", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "akornfan", "parent_id": "t3_652uir", "subreddit_name_prefixed": "r/OutOfTheLoop", "controversiality": 0, "body": "I don't really follow high-level Pokémon competition but here's my understanding.\n\nsome of it isn't justified and is stupid--he is a furry and wears a collar, which is silly but not worthy of hate--but the big reason is that he often accuses top-tier players of cheating or similar things.\n\npeople feel he deliberately tries to stir up drama in the competitive Pokémon community for attention, and that would be one thing if he were an exceedingly talented player consistently knockin' people down and takin' names with a bad habit, but he's just decent, and he uses a lot of weird strats that don't really work.\n\nI'm trying to be neutral but I personally think he's a huge jerk. it's nice to have a villain sometimes tho.\n\n(also it's spelled *Verlisify* if you want to search YouTube or Twitter and see a little more of what people are saying! easy mistake to make spelling-wise since it's not a real word.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really follow high-level Pokémon competition but here&amp;#39;s my understanding.&lt;/p&gt;\n\n&lt;p&gt;some of it isn&amp;#39;t justified and is stupid--he is a furry and wears a collar, which is silly but not worthy of hate--but the big reason is that he often accuses top-tier players of cheating or similar things.&lt;/p&gt;\n\n&lt;p&gt;people feel he deliberately tries to stir up drama in the competitive Pokémon community for attention, and that would be one thing if he were an exceedingly talented player consistently knockin&amp;#39; people down and takin&amp;#39; names with a bad habit, but he&amp;#39;s just decent, and he uses a lot of weird strats that don&amp;#39;t really work.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m trying to be neutral but I personally think he&amp;#39;s a huge jerk. it&amp;#39;s nice to have a villain sometimes tho.&lt;/p&gt;\n\n&lt;p&gt;(also it&amp;#39;s spelled &lt;em&gt;Verlisify&lt;/em&gt; if you want to search YouTube or Twitter and see a little more of what people are saying! easy mistake to make spelling-wise since it&amp;#39;s not a real word.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OutOfTheLoop", "name": "t1_dg7l58l", "score_hidden": false, "stickied": false, "created": 1492121246.0, "created_utc": 1492092446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2xinb", "removal_reason": null, "link_id": "t3_652uir", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xinb", "removal_reason": null, "link_id": "t3_652uir", "likes": null, "replies": "", "user_reports": [], "id": "dg8jmqd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The-Bigger-Fish", "parent_id": "t1_dg8jh32", "subreddit_name_prefixed": "r/OutOfTheLoop", "controversiality": 0, "body": "Thanks for more explanations about him. He sounds like an interesting specimen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for more explanations about him. He sounds like an interesting specimen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OutOfTheLoop", "name": "t1_dg8jmqd", "score_hidden": false, "stickied": false, "created": 1492161483.0, "created_utc": 1492132683.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8jh32", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "dirkdragonslayer", "parent_id": "t3_652uir", "subreddit_name_prefixed": "r/OutOfTheLoop", "controversiality": 0, "body": "To add onto what /u/akornfan said, Verlisify is really outspoken against genning Pokemon, which is the act of creating duplicates or new copies of pokemon using third party software, like Pokegen. Now I enjoy putting a movie or documentary on and running in circles and hatching eggs, but many people need the instant gratification or want a quicker way to be tournament ready, thus they start generating Pokemon.\n\nNow whether we have evidence they do it or not, the guy attacks people who he suspects genned pokemon, which is illegal in tournaments. Telling factors are illegal pokeballs, extremely rare moves on perfect IV pokemon(I.E. This Linoone could only learn Extreme Speed in a transfer from an extremely obscure Gamecube game, but somehow you have a perfect shiny one with Extreme Speed? Fishy.) mismatched trainer IDs, etc. While he is well intentioned, he can also be overly aggressive in his methods and kind of be a dick about it. Also although Genning pokemon is very much Taboo, and he very much supports this, there is a large amount of people who disagree with it being as such, and thus disagree with his stance on it.\n\nAlso if someone wears a collar and is different from them, is part of various communities or subcultures such as furries, ponies, or whatever, people will tend to pick on them, but that is different from the main reason people dislike him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add onto what &lt;a href=\"/u/akornfan\"&gt;/u/akornfan&lt;/a&gt; said, Verlisify is really outspoken against genning Pokemon, which is the act of creating duplicates or new copies of pokemon using third party software, like Pokegen. Now I enjoy putting a movie or documentary on and running in circles and hatching eggs, but many people need the instant gratification or want a quicker way to be tournament ready, thus they start generating Pokemon.&lt;/p&gt;\n\n&lt;p&gt;Now whether we have evidence they do it or not, the guy attacks people who he suspects genned pokemon, which is illegal in tournaments. Telling factors are illegal pokeballs, extremely rare moves on perfect IV pokemon(I.E. This Linoone could only learn Extreme Speed in a transfer from an extremely obscure Gamecube game, but somehow you have a perfect shiny one with Extreme Speed? Fishy.) mismatched trainer IDs, etc. While he is well intentioned, he can also be overly aggressive in his methods and kind of be a dick about it. Also although Genning pokemon is very much Taboo, and he very much supports this, there is a large amount of people who disagree with it being as such, and thus disagree with his stance on it.&lt;/p&gt;\n\n&lt;p&gt;Also if someone wears a collar and is different from them, is part of various communities or subcultures such as furries, ponies, or whatever, people will tend to pick on them, but that is different from the main reason people dislike him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OutOfTheLoop", "name": "t1_dg8jh32", "score_hidden": false, "stickied": false, "created": 1492161257.0, "created_utc": 1492132457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]