[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FancyFollicles", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I bleached my hair the other day and finally got it light enough for my liking [my original hair color is black and most salons refused to bleach my hair from black to blonde for some reason, they&amp;#39;ll go as far as lightening it to a light brown color] I did a shadow box type thing. &lt;/p&gt;\n\n&lt;p&gt;I was wondering if it would be okay to start bleaching again or if I should wait a bit. I&amp;#39;ve also read about people using toner and was wondering how that plays into things. When I went to Sally&amp;#39;s to get the supplies I was just shown the bleach powder and volume creme. What does the toner actually do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I bleached my hair the other day and finally got it light enough for my liking [my original hair color is black and most salons refused to bleach my hair from black to blonde for some reason, they'll go as far as lightening it to a light brown color] I did a shadow box type thing. \n\nI was wondering if it would be okay to start bleaching again or if I should wait a bit. I've also read about people using toner and was wondering how that plays into things. When I went to Sally's to get the supplies I was just shown the bleach powder and volume creme. What does the toner actually do?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657913", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "tankytank", "saved": false, "mod_reports": [], "name": "t3_657913", "subreddit_name_prefixed": "r/FancyFollicles", "approved_by": null, "over_18": false, "domain": "self.FancyFollicles", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2sa9a", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FancyFollicles/comments/657913/how_often_can_you_bleach_where_does_toner_come_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492136180.0, "url": "https://www.reddit.com/r/FancyFollicles/comments/657913/how_often_can_you_bleach_where_does_toner_come_in/", "author_flair_text": null, "quarantine": false, "title": "How often can you bleach? Where does toner come in?", "created_utc": 1492107380.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa9a", "removal_reason": null, "link_id": "t3_657913", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa9a", "removal_reason": null, "link_id": "t3_657913", "likes": null, "replies": "", "user_reports": [], "id": "dg8dra8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tankytank", "parent_id": "t1_dg8d95u", "subreddit_name_prefixed": "r/FancyFollicles", "controversiality": 0, "body": "Thanks for the detailed response. Very informative. I always wondered how some people got that silvery/greyish hair when mine always turned orangey/yellow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the detailed response. Very informative. I always wondered how some people got that silvery/greyish hair when mine always turned orangey/yellow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FancyFollicles", "name": "t1_dg8dra8", "score_hidden": false, "stickied": false, "created": 1492153496.0, "created_utc": 1492124696.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8d95u", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "synedocheny", "parent_id": "t3_657913", "subreddit_name_prefixed": "r/FancyFollicles", "controversiality": 0, "body": "This response is going to be extremely long-winded, but please trust that I'm going somewhere with it and I will specifically address both the question of how long you should wait between bleaching and what the purpose of toner is.\n\n&amp;nbsp;\n\nIn my experience, bleach damage is primarily influenced by the total number of processes rather than the waiting period between the processes. Your hair is just long strands of protein and has no mechanism to heal itself. As it is exposed to peroxide in the presence of strong oxidizing agents (bleaches and most permanent dyes), the individual strands will lose their structural integrity, which will eventually result in changes in texture, appearance, ability to maintain moisture, and potentially breakage. The outermost layer of your hair, the cuticle, is composed of scales, which are kind of similar to the bark of a tree. Oxidizing agents can cause the protein matrix that keeps the scale smooth to weaken, causing it to appear to peel back and become rough. This also gradually  exposes the interior cortex of your hair. Since more surface area is exposed with each process, the breakdown of the structural bonds within the protein becomes easier, and I generally find that the amount of apparent damage increases. If the bleach manages to significantly weaken the protein structure in the cortex, your hair may not be able to support its own weight, and you'll give yourself a chemical cut.\n\n&amp;nbsp;\n\nNow, while the accumulation of damage is inevitable, my experience has been that the quality of hair immediately after bleaching is not necessarily what it has to be in your daily life. Bleach generally causes some pH changes which raise the cuticle more. These changes are reversible by rinsing with a weak acid or just using certain conditioners. Generally, bleaching also strips my hair of its moisture and there are plenty of products that can help add it back. Also, your scalp will continue to product oils and as those re-distribute through your hair, it should also change the appearance. Products with silicones can help create a barrier on the surface of your hair, smoothing the texture. Products with protein can help fill in the gaps created by the peeling cuticle, also appearing to smooth the texture. Of course, all of these measures are temporary and do nothing to improve the structural integrity of hair. At some point, the damage to the cuticle will be too great to be sufficiently countered products. As a result, you should always think of new growth as having a finite number of processes that can be done to it, regardless of waiting time. For me, three processes is the threshold before I find my hair to be unacceptable and too difficult to manage. It does vary from person to person, both due to differences in hair texture and tolerance for changes to your hair.\n\n&amp;nbsp;\n\nNow, given hair cannot totally heal itself, the obvious conclusion is that you might as well just do as many processes as you'd like in one day. Based on my experience, there's two main counterpoints to that logic:\n\n1. Bleach often strips your scalp of all of its oils and a second process may be extremely painful and cause blistering and chemical burns. If you're working on the scalp, you should wait for it to regain its moisture.\n2. The overall weakening of your hair's protein structure means it is also more susceptible to damage from everyday factors such as friction from brushing or tension from ponytails. Your heat styling settings may become too aggressive, your hair may not retain moisture as well as it once did, and your curl pattern may significantly change. These things are not generally readily apparent, so you may want to take some time to evaluate these things. \n\nThe decision here should be based primarily on experience and knowing your hair's limits. If you're every unsure if you should move forward, a strand test is an absolute must.\n\n&amp;nbsp;\n\nNow, onto the toner discussion. The primary purpose of toner is to add a neutralising pigment to your hair (generally a blue-ish purple) to counteract the natural warm tones in your hair to create a more white look. There are many types of toners, but some (like Wella Color Charm) require developer and provide a small amount of lift in addition to depositing the neutralising tones. They will be somewhat damaging to your hair, as mentioned above. Other types of toners are basically just like purple shampoo and just deposit the pigment. I have not really found a lot of situations where Wella toners last longer than deposit-only toners, so I'm not a huge fan of them. I can definitely imagine a scenario where you only need a tiny extra bit of lift before you can tone, and Wella could get that done in one step. However, I think a lot of people use it once their hair is already platinum (could use non-damaging methods) or when they still have extremely noticeable warm tones (too dark for significant results) and just cause unnecessarily damage. At the end of the day, I think you should always try non-damaging techniques before damaging ones.\n\nIn an effort not to try to throw even more information up here, I just wanted to make a quick note about Olaplex and similar products. They do create bonds that help reinforce the structure of your hair when you bleach, but these bonds are not the same as what you have in your virgin hair. Also, there is an extremely limited window of time where these bonds can actually get formed, so it's generally better to use it mixed in with the bleach. I know many people who have had success with this type of product, but it's important to consider that it is not the same as virgin hair. You can read a little more about it [here](http://www.labmuffin.com/how-does-olaplex-hair-treatment-work/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This response is going to be extremely long-winded, but please trust that I&amp;#39;m going somewhere with it and I will specifically address both the question of how long you should wait between bleaching and what the purpose of toner is.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;In my experience, bleach damage is primarily influenced by the total number of processes rather than the waiting period between the processes. Your hair is just long strands of protein and has no mechanism to heal itself. As it is exposed to peroxide in the presence of strong oxidizing agents (bleaches and most permanent dyes), the individual strands will lose their structural integrity, which will eventually result in changes in texture, appearance, ability to maintain moisture, and potentially breakage. The outermost layer of your hair, the cuticle, is composed of scales, which are kind of similar to the bark of a tree. Oxidizing agents can cause the protein matrix that keeps the scale smooth to weaken, causing it to appear to peel back and become rough. This also gradually  exposes the interior cortex of your hair. Since more surface area is exposed with each process, the breakdown of the structural bonds within the protein becomes easier, and I generally find that the amount of apparent damage increases. If the bleach manages to significantly weaken the protein structure in the cortex, your hair may not be able to support its own weight, and you&amp;#39;ll give yourself a chemical cut.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Now, while the accumulation of damage is inevitable, my experience has been that the quality of hair immediately after bleaching is not necessarily what it has to be in your daily life. Bleach generally causes some pH changes which raise the cuticle more. These changes are reversible by rinsing with a weak acid or just using certain conditioners. Generally, bleaching also strips my hair of its moisture and there are plenty of products that can help add it back. Also, your scalp will continue to product oils and as those re-distribute through your hair, it should also change the appearance. Products with silicones can help create a barrier on the surface of your hair, smoothing the texture. Products with protein can help fill in the gaps created by the peeling cuticle, also appearing to smooth the texture. Of course, all of these measures are temporary and do nothing to improve the structural integrity of hair. At some point, the damage to the cuticle will be too great to be sufficiently countered products. As a result, you should always think of new growth as having a finite number of processes that can be done to it, regardless of waiting time. For me, three processes is the threshold before I find my hair to be unacceptable and too difficult to manage. It does vary from person to person, both due to differences in hair texture and tolerance for changes to your hair.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Now, given hair cannot totally heal itself, the obvious conclusion is that you might as well just do as many processes as you&amp;#39;d like in one day. Based on my experience, there&amp;#39;s two main counterpoints to that logic:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Bleach often strips your scalp of all of its oils and a second process may be extremely painful and cause blistering and chemical burns. If you&amp;#39;re working on the scalp, you should wait for it to regain its moisture.&lt;/li&gt;\n&lt;li&gt;The overall weakening of your hair&amp;#39;s protein structure means it is also more susceptible to damage from everyday factors such as friction from brushing or tension from ponytails. Your heat styling settings may become too aggressive, your hair may not retain moisture as well as it once did, and your curl pattern may significantly change. These things are not generally readily apparent, so you may want to take some time to evaluate these things. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The decision here should be based primarily on experience and knowing your hair&amp;#39;s limits. If you&amp;#39;re every unsure if you should move forward, a strand test is an absolute must.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Now, onto the toner discussion. The primary purpose of toner is to add a neutralising pigment to your hair (generally a blue-ish purple) to counteract the natural warm tones in your hair to create a more white look. There are many types of toners, but some (like Wella Color Charm) require developer and provide a small amount of lift in addition to depositing the neutralising tones. They will be somewhat damaging to your hair, as mentioned above. Other types of toners are basically just like purple shampoo and just deposit the pigment. I have not really found a lot of situations where Wella toners last longer than deposit-only toners, so I&amp;#39;m not a huge fan of them. I can definitely imagine a scenario where you only need a tiny extra bit of lift before you can tone, and Wella could get that done in one step. However, I think a lot of people use it once their hair is already platinum (could use non-damaging methods) or when they still have extremely noticeable warm tones (too dark for significant results) and just cause unnecessarily damage. At the end of the day, I think you should always try non-damaging techniques before damaging ones.&lt;/p&gt;\n\n&lt;p&gt;In an effort not to try to throw even more information up here, I just wanted to make a quick note about Olaplex and similar products. They do create bonds that help reinforce the structure of your hair when you bleach, but these bonds are not the same as what you have in your virgin hair. Also, there is an extremely limited window of time where these bonds can actually get formed, so it&amp;#39;s generally better to use it mixed in with the bleach. I know many people who have had success with this type of product, but it&amp;#39;s important to consider that it is not the same as virgin hair. You can read a little more about it &lt;a href=\"http://www.labmuffin.com/how-does-olaplex-hair-treatment-work/\"&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FancyFollicles", "name": "t1_dg8d95u", "score_hidden": false, "stickied": false, "created": 1492152825.0, "created_utc": 1492124025.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa9a", "removal_reason": null, "link_id": "t3_657913", "likes": null, "replies": "", "user_reports": [], "id": "dg808tu", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "AirAdmiral", "parent_id": "t3_657913", "subreddit_name_prefixed": "r/FancyFollicles", "controversiality": 0, "body": "I will tell you that bleaching too often will be basically the only (normal) thing that can truly ruin your hair. That said, I went from bottle black to pink earlier this year and I probably ended up bleaching my hair 3 or 4 times in the span of a month to lighten it adequately and my hair survived. It is deff healthier for your hair to wait but I am impatient and want results so here are my tips for lightening repeatedly without killing your hair:\n\n1. Don't leave the bleach on for more than 30 or 45 mins. After that, rinse it and do another treatment if needed. After the first 45 it will lighten as much as it is going to without completely screwing your hair and you will get much better results from two treatments 45 each than one 90.\n\n2. Try to be discerning about where you apply the bleach. Your roots will likely only the the one lightening treatment but your ends will need several. Only apply the dye where you need it.\n\n3. Hot oil treatments and deep conditioner are your friends. Put it on. Let it sit as long as you can. Do at least one in between each treatment save for consecutive treatments and do it after a treatment too when your hair is open and porous from the stripping.\n\n4. Idk how blonde you want to go, but if you want uniform platinum blonde, it will probably not happen. Dirty blonde is doable. Even fairly light blonde is going to be hard without damage and time. That is why the salon wouldn't do it, because for most stylists it would be like 4 sessions min $100 and the results are usually not what you want. If you aren't dying your hair with a semipermanent color after (what I do) you may very well not like the results. It will be fairly orange and kind of ombre if you have dyed your ends more than your roots. You can also try products that take the orange out of your hair. I know manic panic has one which I have used with mixed results but it is certainly nicer to your hair than bleach.\n\nAnyway, good luck, be patient, use lots of conditioner, don't let bleach process any longer than you have to and you will be okay. My hair got pretty straw like at one point and I've been able to bring it back to life with lots of conditioner treatments so you should be just fine as long as you are careful.", "edited": 1492112722.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will tell you that bleaching too often will be basically the only (normal) thing that can truly ruin your hair. That said, I went from bottle black to pink earlier this year and I probably ended up bleaching my hair 3 or 4 times in the span of a month to lighten it adequately and my hair survived. It is deff healthier for your hair to wait but I am impatient and want results so here are my tips for lightening repeatedly without killing your hair:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Don&amp;#39;t leave the bleach on for more than 30 or 45 mins. After that, rinse it and do another treatment if needed. After the first 45 it will lighten as much as it is going to without completely screwing your hair and you will get much better results from two treatments 45 each than one 90.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Try to be discerning about where you apply the bleach. Your roots will likely only the the one lightening treatment but your ends will need several. Only apply the dye where you need it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Hot oil treatments and deep conditioner are your friends. Put it on. Let it sit as long as you can. Do at least one in between each treatment save for consecutive treatments and do it after a treatment too when your hair is open and porous from the stripping.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Idk how blonde you want to go, but if you want uniform platinum blonde, it will probably not happen. Dirty blonde is doable. Even fairly light blonde is going to be hard without damage and time. That is why the salon wouldn&amp;#39;t do it, because for most stylists it would be like 4 sessions min $100 and the results are usually not what you want. If you aren&amp;#39;t dying your hair with a semipermanent color after (what I do) you may very well not like the results. It will be fairly orange and kind of ombre if you have dyed your ends more than your roots. You can also try products that take the orange out of your hair. I know manic panic has one which I have used with mixed results but it is certainly nicer to your hair than bleach.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Anyway, good luck, be patient, use lots of conditioner, don&amp;#39;t let bleach process any longer than you have to and you will be okay. My hair got pretty straw like at one point and I&amp;#39;ve been able to bring it back to life with lots of conditioner treatments so you should be just fine as long as you are careful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FancyFollicles", "name": "t1_dg808tu", "score_hidden": false, "stickied": false, "created": 1492137632.0, "created_utc": 1492108832.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sa9a", "removal_reason": null, "link_id": "t3_657913", "likes": null, "replies": "", "user_reports": [], "id": "dg8pmbh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "blackkitteycat", "parent_id": "t3_657913", "subreddit_name_prefixed": "r/FancyFollicles", "controversiality": 0, "body": "I bleached my hair around 4 times in a month and a half and most of it had to be cut off. It was super strange feeling, my mom said it didn't even feel like real hair. It had an almost plastic-y feel to it", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I bleached my hair around 4 times in a month and a half and most of it had to be cut off. It was super strange feeling, my mom said it didn&amp;#39;t even feel like real hair. It had an almost plastic-y feel to it&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FancyFollicles", "name": "t1_dg8pmbh", "score_hidden": false, "stickied": false, "created": 1492170161.0, "created_utc": 1492141361.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]