[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FancyFollicles", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Using a throwaway because I don&amp;#39;t want pictures of myself on my main account.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m apparently the female version of Patrick Stewart, at least in terms of hair. My hair started to thin when I was around twenty years old. My scalp is very visible, and any sweat or oil makes it clump and look even worse. (I&amp;#39;m trying Rogaine foam and biotin supplements, although I have a while to go before I might start to see results. Check back at the end of summer.) &lt;/p&gt;\n\n&lt;p&gt;Checked with my doctor about hormone issues and vitamin deficiencies. As far as I&amp;#39;ve been able to tell so far, I&amp;#39;m just at the far left end of the hair loss bell curve. Honestly, if it weren&amp;#39;t for my probably unfounded worries about being mistaken for a cancer patient and having to make awkward conversation with well-meaning strangers, I&amp;#39;d be tempted to just shave it off and go with a &lt;em&gt;deliberate&lt;/em&gt; public display of scalp.&lt;/p&gt;\n\n&lt;p&gt;Right now it&amp;#39;s about shoulder length and approaching the longest I&amp;#39;d want it; I usually get it cut to about the bottom of my ears. I had a shorter cut once and hated it, but that was before the thinning began. I&amp;#39;d be willing to try one again; at worst it&amp;#39;ll grow back out in a year or so... or I&amp;#39;ll shave it.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never dyed it. I usually don&amp;#39;t do much to style it-- I use a volumizing shampoo, and for special occasions I&amp;#39;ll use a wee bit of volumizing moose near the roots and blow dry, then side part it. Most days I just let it air dry with no product, then brush it. (I wear a hat at work, so no point in doing anything to my hair on work days.)&lt;/p&gt;\n\n&lt;p&gt;This is how it looks about ten hours after a shower with no product or special treatment aside from brushing it-- it&amp;#39;s fluffier right out of the shower, but because it&amp;#39;s so thin, scalp oil makes it clump up fast.  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.dropbox.com/s/cwve5gimnmptlto/front.jpg?dl=0\"&gt;https://www.dropbox.com/s/cwve5gimnmptlto/front.jpg?dl=0&lt;/a&gt;\n&lt;a href=\"https://www.dropbox.com/s/w5zv7wefmg90wt7/top.jpg?dl=0\"&gt;https://www.dropbox.com/s/w5zv7wefmg90wt7/top.jpg?dl=0&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not expecting miracles, but anything that might help from a styling perspective that I&amp;#39;m not already doing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Using a throwaway because I don't want pictures of myself on my main account.\n\nI'm apparently the female version of Patrick Stewart, at least in terms of hair. My hair started to thin when I was around twenty years old. My scalp is very visible, and any sweat or oil makes it clump and look even worse. (I'm trying Rogaine foam and biotin supplements, although I have a while to go before I might start to see results. Check back at the end of summer.) \n\nChecked with my doctor about hormone issues and vitamin deficiencies. As far as I've been able to tell so far, I'm just at the far left end of the hair loss bell curve. Honestly, if it weren't for my probably unfounded worries about being mistaken for a cancer patient and having to make awkward conversation with well-meaning strangers, I'd be tempted to just shave it off and go with a *deliberate* public display of scalp.\n\nRight now it's about shoulder length and approaching the longest I'd want it; I usually get it cut to about the bottom of my ears. I had a shorter cut once and hated it, but that was before the thinning began. I'd be willing to try one again; at worst it'll grow back out in a year or so... or I'll shave it.\n\nI've never dyed it. I usually don't do much to style it-- I use a volumizing shampoo, and for special occasions I'll use a wee bit of volumizing moose near the roots and blow dry, then side part it. Most days I just let it air dry with no product, then brush it. (I wear a hat at work, so no point in doing anything to my hair on work days.)\n\nThis is how it looks about ten hours after a shower with no product or special treatment aside from brushing it-- it's fluffier right out of the shower, but because it's so thin, scalp oil makes it clump up fast.  \n\nhttps://www.dropbox.com/s/cwve5gimnmptlto/front.jpg?dl=0\nhttps://www.dropbox.com/s/w5zv7wefmg90wt7/top.jpg?dl=0\n\nI'm not expecting miracles, but anything that might help from a styling perspective that I'm not already doing?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65te6x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "i-sort-of-miss-hair", "saved": false, "mod_reports": [], "name": "t3_65te6x", "subreddit_name_prefixed": "r/FancyFollicles", "approved_by": null, "over_18": false, "domain": "self.FancyFollicles", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/k_wjcsVUD_2szp5jLD2gpb73Yeurd1f9Fuu1R8MgA_k.jpg?s=e25e9f4a7d610492c0728831053473d9", "width": 768, "height": 1024}, "resolutions": [{"url": "https://i.redditmedia.com/k_wjcsVUD_2szp5jLD2gpb73Yeurd1f9Fuu1R8MgA_k.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=e16ece84a83479c008bdcfb55e5d86a8", "width": 108, "height": 144}, {"url": "https://i.redditmedia.com/k_wjcsVUD_2szp5jLD2gpb73Yeurd1f9Fuu1R8MgA_k.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=8c961af30b7d775aea980817d6660b7a", "width": 216, "height": 288}, {"url": "https://i.redditmedia.com/k_wjcsVUD_2szp5jLD2gpb73Yeurd1f9Fuu1R8MgA_k.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=8eddd6d0a2073672a617d25072fbbc8e", "width": 320, "height": 426}, {"url": "https://i.redditmedia.com/k_wjcsVUD_2szp5jLD2gpb73Yeurd1f9Fuu1R8MgA_k.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=b85b43b11edf29dd8d458a9d711dd9c1", "width": 640, "height": 853}], "variants": {}, "id": "tSt5xNh0i98K8jWlNy4-8AE8H5z7K8bgA56ijRyc9KU"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2sa9a", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FancyFollicles/comments/65te6x/looking_for_haircutstyle_advice_for_superthin_hair/", "num_reports": null, "locked": false, "stickied": false, "created": 1492430141.0, "url": "https://www.reddit.com/r/FancyFollicles/comments/65te6x/looking_for_haircutstyle_advice_for_superthin_hair/", "author_flair_text": null, "quarantine": false, "title": "Looking for haircut/style advice for super-thin hair", "created_utc": 1492401341.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sa9a", "removal_reason": null, "link_id": "t3_65te6x", "likes": null, "replies": "", "user_reports": [], "id": "dgdgz80", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "heroinehabit", "parent_id": "t3_65te6x", "subreddit_name_prefixed": "r/FancyFollicles", "controversiality": 0, "body": "Are you using men or women's strength Rogaine? I know the men's says not for women to use, but that's generally because women don't have as severe hair loss. I'd suggest using men's strength if you aren't already- the extra 3% of minoxodil is very important. As a side note, however, I learned in a product knowledge class for Nioxin (uses the same chemicals as Rogaine, except has a shampoo and conditioner as well so they tend to be more effective) that if you don't notice an increase in thickness, it's because the product has stopped your hairloss from becoming even worse, and if you stop using it, you might notice hair loss again... Is this an issues with all the women in your family? Hair loss is normally genetic or chemical, but you said you'd ruled chemical out. As for styling, blow drying and a powder volumizer are always awesome- put some mousse in while your hair is wet, blow dry either round brushing your hair up, or leaning over the dryer, and then put some powder volumizer at the root (taking about inch thick sections, going across your scalp forward to back).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you using men or women&amp;#39;s strength Rogaine? I know the men&amp;#39;s says not for women to use, but that&amp;#39;s generally because women don&amp;#39;t have as severe hair loss. I&amp;#39;d suggest using men&amp;#39;s strength if you aren&amp;#39;t already- the extra 3% of minoxodil is very important. As a side note, however, I learned in a product knowledge class for Nioxin (uses the same chemicals as Rogaine, except has a shampoo and conditioner as well so they tend to be more effective) that if you don&amp;#39;t notice an increase in thickness, it&amp;#39;s because the product has stopped your hairloss from becoming even worse, and if you stop using it, you might notice hair loss again... Is this an issues with all the women in your family? Hair loss is normally genetic or chemical, but you said you&amp;#39;d ruled chemical out. As for styling, blow drying and a powder volumizer are always awesome- put some mousse in while your hair is wet, blow dry either round brushing your hair up, or leaning over the dryer, and then put some powder volumizer at the root (taking about inch thick sections, going across your scalp forward to back).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FancyFollicles", "name": "t1_dgdgz80", "score_hidden": false, "stickied": false, "created": 1492464348.0, "created_utc": 1492435548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]