[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Windows10", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been using Windows for more than 20 years.&lt;/p&gt;\n\n&lt;p&gt;This operating system always had some UI inconsistency compared to macOS and major Linux distributions both of which look and feel very polished and uniform for the most part.&lt;/p&gt;\n\n&lt;p&gt;This inconsistency, however, was almost always limited to third party applications. For some reason, not every developer felt like it was important that their applications seamlessly fit into the operating system they&amp;#39;re targeting. I don&amp;#39;t know why a developer would wanna do something like that, but I can&amp;#39;t complain much as long as the applications are functional.&lt;/p&gt;\n\n&lt;p&gt;The operating system itself looked and felt consistent enough at the very least.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to 2012. Windows itself has now gradually started to look and feel inconsistent. As of right now with fully updated Windows 10, it is a, pardon my French, clusterfuck of different UI styles. Within 2 minutes, I come across 5 menus with completely distinct look and feel, and I don&amp;#39;t even have to use third party applications for this.&lt;/p&gt;\n\n&lt;p&gt;The Start menu has other issues. All application icons are made smaller and boxed in ugly blue rectangles. It looks like one of those bad quality icon themes one could&amp;#39;ve found many years ago on Android. On the right side, if I make tiles of any non-Microsoft application, the icon is tiny inside, you guessed it, yet another blue rectangle. I can see the true scalability of these icons by simply increasing their size in Windows Explorer or Desktop. They&amp;#39;re sharp and clear no matter how big they are. Yet, for some strange reason, they can&amp;#39;t be scaled over there. This looks quite ugly once again.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also inherent inconsistency from mixing both Modern and non-Modern UI elements all over the system. Often it feels like, I&amp;#39;m using a VM inside Windows even though they&amp;#39;re all supposed to be native, core applications.&lt;/p&gt;\n\n&lt;p&gt;There are two main settings-like options -- Windows Settings and Control Panel. Why? There are so many redundant things all across the operating system.&lt;/p&gt;\n\n&lt;p&gt;Finally, in 2017, most people use widescreen monitors. It only makes sense to eat away from the sides of the screen to save the most screen real estate since there&amp;#39;s simply (a lot) more room there. Taskbars at the bottom are objectively worse for screen real estate. Both macOS and all Linux distributions allow users to easily move their dock/dash/taskbar/whatever-you-wanna-call-it to the sides (typically left). Some Linux distributions even default to that. Windows also allows users to move its taskbar to the sides, but it doesn&amp;#39;t accommodate it as well as the other two. There&amp;#39;s no way to customize the clock to look more fitting on vertical panels. There&amp;#39;s no way to make the taskbar as slim as it is when it is at the bottom. It&amp;#39;s always a bit fatter on the sides. However, I must admit that, at least, Windows made it viable at all because of the changes they brought to the taskbar back in Windows 7. Before that, it wouldn&amp;#39;t even have been viable because of the lack of an icon-only setup.&lt;/p&gt;\n\n&lt;p&gt;Overall, there&amp;#39;s nothing wrong with how Windows functions. It&amp;#39;s rock solid. Windows animations are smooth and fast. All applications run moderately well. However, while this isn&amp;#39;t the case overall nor other sectors of computing, it is by far the most popular operating system for desktop use. I hope Windows 11 or whatever they decide to call the upcoming version irons out all (or at least, most) of these inconsistency issues. I hope this clusterfuck of modern and non-modern UI elements come to an end, and we move to one of those two environments entirely. I think it&amp;#39;s too late to expect third party applications to look seamless like they do in macOS and Linux distributions, but I&amp;#39;ll be happy as long as Windows itself looks consistent enough.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not very judgmental about the default look and feel in Linux distributions or Android. But, I am about macOS and Windows, because they allow very little customization. Linux desktop environments have &amp;quot;themes&amp;quot;. Windows doesn&amp;#39;t have &amp;quot;themes&amp;quot;. They have recolors. That&amp;#39;s fine, but because of that, defaults are important.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading my little rant.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been using Windows for more than 20 years.\n\nThis operating system always had some UI inconsistency compared to macOS and major Linux distributions both of which look and feel very polished and uniform for the most part.\n\nThis inconsistency, however, was almost always limited to third party applications. For some reason, not every developer felt like it was important that their applications seamlessly fit into the operating system they're targeting. I don't know why a developer would wanna do something like that, but I can't complain much as long as the applications are functional.\n\nThe operating system itself looked and felt consistent enough at the very least.\n\nFast forward to 2012. Windows itself has now gradually started to look and feel inconsistent. As of right now with fully updated Windows 10, it is a, pardon my French, clusterfuck of different UI styles. Within 2 minutes, I come across 5 menus with completely distinct look and feel, and I don't even have to use third party applications for this.\n\nThe Start menu has other issues. All application icons are made smaller and boxed in ugly blue rectangles. It looks like one of those bad quality icon themes one could've found many years ago on Android. On the right side, if I make tiles of any non-Microsoft application, the icon is tiny inside, you guessed it, yet another blue rectangle. I can see the true scalability of these icons by simply increasing their size in Windows Explorer or Desktop. They're sharp and clear no matter how big they are. Yet, for some strange reason, they can't be scaled over there. This looks quite ugly once again.\n\nThere's also inherent inconsistency from mixing both Modern and non-Modern UI elements all over the system. Often it feels like, I'm using a VM inside Windows even though they're all supposed to be native, core applications.\n\nThere are two main settings-like options -- Windows Settings and Control Panel. Why? There are so many redundant things all across the operating system.\n\nFinally, in 2017, most people use widescreen monitors. It only makes sense to eat away from the sides of the screen to save the most screen real estate since there's simply (a lot) more room there. Taskbars at the bottom are objectively worse for screen real estate. Both macOS and all Linux distributions allow users to easily move their dock/dash/taskbar/whatever-you-wanna-call-it to the sides (typically left). Some Linux distributions even default to that. Windows also allows users to move its taskbar to the sides, but it doesn't accommodate it as well as the other two. There's no way to customize the clock to look more fitting on vertical panels. There's no way to make the taskbar as slim as it is when it is at the bottom. It's always a bit fatter on the sides. However, I must admit that, at least, Windows made it viable at all because of the changes they brought to the taskbar back in Windows 7. Before that, it wouldn't even have been viable because of the lack of an icon-only setup.\n\nOverall, there's nothing wrong with how Windows functions. It's rock solid. Windows animations are smooth and fast. All applications run moderately well. However, while this isn't the case overall nor other sectors of computing, it is by far the most popular operating system for desktop use. I hope Windows 11 or whatever they decide to call the upcoming version irons out all (or at least, most) of these inconsistency issues. I hope this clusterfuck of modern and non-modern UI elements come to an end, and we move to one of those two environments entirely. I think it's too late to expect third party applications to look seamless like they do in macOS and Linux distributions, but I'll be happy as long as Windows itself looks consistent enough.\n\nI'm not very judgmental about the default look and feel in Linux distributions or Android. But, I am about macOS and Windows, because they allow very little customization. Linux desktop environments have \"themes\". Windows doesn't have \"themes\". They have recolors. That's fine, but because of that, defaults are important.\n\nThank you for reading my little rant.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "65xrn9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "The_Discussion", "saved": false, "mod_reports": [], "name": "t3_65xrn9", "subreddit_name_prefixed": "r/Windows10", "approved_by": null, "over_18": false, "domain": "self.Windows10", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2u9xs", "edited": 1492457884.0, "link_flair_css_class": "discussion", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Windows10/comments/65xrn9/rant_the_ui_and_a_few_other_aspects_of_windows_as/", "num_reports": null, "locked": false, "stickied": false, "created": 1492486241.0, "url": "https://www.reddit.com/r/Windows10/comments/65xrn9/rant_the_ui_and_a_few_other_aspects_of_windows_as/", "author_flair_text": null, "quarantine": false, "title": "[Rant] The UI and a few other aspects of Windows as it is now provide some of the most inconsistent desktop experience I've ever had.", "created_utc": 1492457441.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u9xs", "removal_reason": null, "link_id": "t3_65xrn9", "likes": null, "replies": "", "user_reports": [], "id": "dge08hp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Max_Emerson", "parent_id": "t3_65xrn9", "subreddit_name_prefixed": "r/Windows10", "controversiality": 0, "body": "This article might be interesting to you https://mspoweruser.com/project-neon-windows-10-first-look/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This article might be interesting to you &lt;a href=\"https://mspoweruser.com/project-neon-windows-10-first-look/\"&gt;https://mspoweruser.com/project-neon-windows-10-first-look/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Windows10", "name": "t1_dge08hp", "score_hidden": false, "stickied": false, "created": 1492487246.0, "created_utc": 1492458446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u9xs", "removal_reason": null, "link_id": "t3_65xrn9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u9xs", "removal_reason": null, "link_id": "t3_65xrn9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2u9xs", "removal_reason": null, "link_id": "t3_65xrn9", "likes": null, "replies": "", "user_reports": [], "id": "dge6dhr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Maxdec94", "parent_id": "t1_dgdzuwc", "subreddit_name_prefixed": "r/Windows10", "controversiality": 0, "body": "It's called Windows as a Service.\n\n&gt; There are two main settings-like options -- Windows Settings and Control Panel. Why? There are so many redundant things all across the operating system.\n\nThey're slowly phasing out the old Control Panel and moving things to Settings. It's a long process though and not all sections have been moved yet, so that's why CP is still there.", "edited": 1492466255.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s called Windows as a Service.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;There are two main settings-like options -- Windows Settings and Control Panel. Why? There are so many redundant things all across the operating system.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They&amp;#39;re slowly phasing out the old Control Panel and moving things to Settings. It&amp;#39;s a long process though and not all sections have been moved yet, so that&amp;#39;s why CP is still there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Windows10", "name": "t1_dge6dhr", "score_hidden": false, "stickied": false, "created": 1492494308.0, "created_utc": 1492465508.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u9xs", "removal_reason": null, "link_id": "t3_65xrn9", "likes": null, "replies": "", "user_reports": [], "id": "dgdzzw7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AndyCR19", "parent_id": "t1_dgdzuwc", "subreddit_name_prefixed": "r/Windows10", "controversiality": 0, "body": "Yup.(1) November Update (2) Anniversary Update (3) Creators Update [Latest]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup.(1) November Update (2) Anniversary Update (3) Creators Update [Latest]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Windows10", "name": "t1_dgdzzw7", "score_hidden": false, "stickied": false, "created": 1492486980.0, "created_utc": 1492458180.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzuwc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "The_Discussion", "parent_id": "t1_dgdzqfb", "subreddit_name_prefixed": "r/Windows10", "controversiality": 0, "body": "&gt; Windows 10 will be last ,with the major update every 8-10 months they will bring out new feautres and closes the gap of inconsistency one by one.\n\nWhoah. That's news to me. So, they're going for something like a rolling distribution? I'm very interested in that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Windows 10 will be last ,with the major update every 8-10 months they will bring out new feautres and closes the gap of inconsistency one by one.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Whoah. That&amp;#39;s news to me. So, they&amp;#39;re going for something like a rolling distribution? I&amp;#39;m very interested in that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Windows10", "name": "t1_dgdzuwc", "score_hidden": false, "stickied": false, "created": 1492486825.0, "created_utc": 1492458025.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzqfb", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "AndyCR19", "parent_id": "t3_65xrn9", "subreddit_name_prefixed": "r/Windows10", "controversiality": 0, "body": "What MSFT took was a long time aim for consistency.They went wrong with win8 UI so to fix and bring desktop UI win10 was introduced with streamlined experience but yes it's still inconsistent because of two platforms running together.Win32 and UWP.UWP is the aim for MSFT to bring all devices together with consistent UI.It will take long time to take out every single WIN32 and convert to UWP.Thete will be no Windows 11.Windows 10 will be last ,with the major update every 8-10 months they will bring out new feautres and closes the gap of inconsistency one by one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What MSFT took was a long time aim for consistency.They went wrong with win8 UI so to fix and bring desktop UI win10 was introduced with streamlined experience but yes it&amp;#39;s still inconsistent because of two platforms running together.Win32 and UWP.UWP is the aim for MSFT to bring all devices together with consistent UI.It will take long time to take out every single WIN32 and convert to UWP.Thete will be no Windows 11.Windows 10 will be last ,with the major update every 8-10 months they will bring out new feautres and closes the gap of inconsistency one by one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Windows10", "name": "t1_dgdzqfb", "score_hidden": false, "stickied": false, "created": 1492486688.0, "created_utc": 1492457888.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2u9xs", "removal_reason": null, "link_id": "t3_65xrn9", "likes": null, "replies": "", "user_reports": [], "id": "dgeu6es", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "epicguff", "parent_id": "t3_65xrn9", "subreddit_name_prefixed": "r/Windows10", "controversiality": 0, "body": "&gt;  I am about macOS and Windows, because they allow very little customization.\n\nClearly you don't use windows as much as you think you do If you haven't learnt to customise it in all of your so called \"more than 20 years\".\n\nThe reason every application can look and function as they do on windows is because as an operating system every developer was empowered to make what they wanted NOT the same programs that looked exactly the same. that's why android is where it is now, because its basically doing what windows was doing during XP days.\n\nI remember using rainmeter to customise my PC so much so that it was unrecognisable to anyone but me. Now I cant be bothered since I get paid to do actual work on my computer which is just a tool, it doesn't have to be pretty, it just has to work when I need it to.\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I am about macOS and Windows, because they allow very little customization.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Clearly you don&amp;#39;t use windows as much as you think you do If you haven&amp;#39;t learnt to customise it in all of your so called &amp;quot;more than 20 years&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;The reason every application can look and function as they do on windows is because as an operating system every developer was empowered to make what they wanted NOT the same programs that looked exactly the same. that&amp;#39;s why android is where it is now, because its basically doing what windows was doing during XP days.&lt;/p&gt;\n\n&lt;p&gt;I remember using rainmeter to customise my PC so much so that it was unrecognisable to anyone but me. Now I cant be bothered since I get paid to do actual work on my computer which is just a tool, it doesn&amp;#39;t have to be pretty, it just has to work when I need it to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Windows10", "name": "t1_dgeu6es", "score_hidden": true, "stickied": false, "created": 1492528744.0, "created_utc": 1492499944.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]