[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am turning 23 this year, and have been at university since 2012. I have no degree, and $38,000 in student debt so far. Just today I dropped out of two more units, after the census date, costing me $2400 total. I&amp;#39;ll have to take these units again next semester.&lt;/p&gt;\n\n&lt;p&gt;All of my friends have either graduated and are earning $100,000 at their first jobs, or in second or third year medicine--I am where I am.&lt;/p&gt;\n\n&lt;p&gt;I can honestly say I haven&amp;#39;t worked hard at university since I got here, I spent a majority of my time 2012 - 2014 focusing on social improvement, I was always told I was smart as a kid and so I assumed I could sit back relax and continue to get good grades. During those days I used university as a tool to meet people; even when I could see I was doing poorly it didn&amp;#39;t matter to me. In 2014 I suffered a hugely traumatic experience whereby I shut down socially, and to this day I feel broken and un-genuine. 2014 was simultaneously the best and worst year of my life by a country mile.&lt;/p&gt;\n\n&lt;p&gt;I want to study medicine, I know that with all certainty. In order to study medicine I need an average grade no less than 80% over the course of a 3 year undergraduate degree, so in 2015 I changed out of my old degree into a new one so I could have a fresh start. I came down with depression, which I think was always there since 2012, and had to drop out. I accomplished nothing in 2015 academically, socially, or personally.&lt;/p&gt;\n\n&lt;p&gt;2016 was the first year I completed full-time study, until that point I had always done a semester part-time or dropped out of units and only done 75% of a full-time load. I didn&amp;#39;t get good grades, I averaged 68% for the year. In the holidays leading up to this years semester I felt excited to start university, to really show I can get 80s and meet my dream of becoming a doctor. Almost immediately I started procrastinating, I am afraid of failing (getting less than 80%) and me being a student for 5 years now while all of my friends are earning huge amounts of money or finishing up medicine themselves is making me anxious, paranoid, and envious to the point where I am now latently angry all the time not only at myself but at other people. I am disgusted with the person I have become, someone who cannot express genuine emotion, someone who looks down all the time, someone who cannot hold a decent conversation and who inspires no love amongst his friends.&lt;/p&gt;\n\n&lt;p&gt;I can feel myself slipping away and becoming thinner and thinner and I have no idea what to do. I have such a huge personal debt from my time wasted at university, and I have such a huge burden on my shoulders to achieve my dream from seemingly the worst possible state ever I don&amp;#39;t trust myself to live out the rest of the year and still have hopes for life or a life worth living.&lt;/p&gt;\n\n&lt;p&gt;I want to meet girls, I want to have friends who invite me out places, I want to feel confident about myself even though I have pretty bad acne scars, I want to feel like I have something to offer and not be the ugly person I consider myself to be both physically and emotionally, I want to be smart, I want to achieve my goal, and I want a life worth living.&lt;/p&gt;\n\n&lt;p&gt;Right now, while I have no desire to, I feel like its a countdown to the time where I give up and commit suicide out of shame for who I am and how little I have achieved.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am turning 23 this year, and have been at university since 2012. I have no degree, and $38,000 in student debt so far. Just today I dropped out of two more units, after the census date, costing me $2400 total. I'll have to take these units again next semester.\n\nAll of my friends have either graduated and are earning $100,000 at their first jobs, or in second or third year medicine--I am where I am.\n\nI can honestly say I haven't worked hard at university since I got here, I spent a majority of my time 2012 - 2014 focusing on social improvement, I was always told I was smart as a kid and so I assumed I could sit back relax and continue to get good grades. During those days I used university as a tool to meet people; even when I could see I was doing poorly it didn't matter to me. In 2014 I suffered a hugely traumatic experience whereby I shut down socially, and to this day I feel broken and un-genuine. 2014 was simultaneously the best and worst year of my life by a country mile.\n\nI want to study medicine, I know that with all certainty. In order to study medicine I need an average grade no less than 80% over the course of a 3 year undergraduate degree, so in 2015 I changed out of my old degree into a new one so I could have a fresh start. I came down with depression, which I think was always there since 2012, and had to drop out. I accomplished nothing in 2015 academically, socially, or personally.\n\n2016 was the first year I completed full-time study, until that point I had always done a semester part-time or dropped out of units and only done 75% of a full-time load. I didn't get good grades, I averaged 68% for the year. In the holidays leading up to this years semester I felt excited to start university, to really show I can get 80s and meet my dream of becoming a doctor. Almost immediately I started procrastinating, I am afraid of failing (getting less than 80%) and me being a student for 5 years now while all of my friends are earning huge amounts of money or finishing up medicine themselves is making me anxious, paranoid, and envious to the point where I am now latently angry all the time not only at myself but at other people. I am disgusted with the person I have become, someone who cannot express genuine emotion, someone who looks down all the time, someone who cannot hold a decent conversation and who inspires no love amongst his friends.\n\nI can feel myself slipping away and becoming thinner and thinner and I have no idea what to do. I have such a huge personal debt from my time wasted at university, and I have such a huge burden on my shoulders to achieve my dream from seemingly the worst possible state ever I don't trust myself to live out the rest of the year and still have hopes for life or a life worth living.\n\nI want to meet girls, I want to have friends who invite me out places, I want to feel confident about myself even though I have pretty bad acne scars, I want to feel like I have something to offer and not be the ugly person I consider myself to be both physically and emotionally, I want to be smart, I want to achieve my goal, and I want a life worth living.\n\nRight now, while I have no desire to, I feel like its a countdown to the time where I give up and commit suicide out of shame for who I am and how little I have achieved.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64pq8f", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 118, "report_reasons": null, "author": "auetefiti", "saved": false, "mod_reports": [], "name": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/64pq8f/needadvice_im_destroying_my_future_and_incurring/", "num_reports": null, "locked": false, "stickied": false, "created": 1491930363.0, "url": "https://www.reddit.com/r/getdisciplined/comments/64pq8f/needadvice_im_destroying_my_future_and_incurring/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] I'm destroying my future, and incurring huge debt. I cannot match my thoughts to my actions, I need serious help.", "created_utc": 1491901563.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 118}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg48zps", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Itsallanonswhocares", "parent_id": "t1_dg426lm", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Good answers, get your shit together incrementally by making daily meaningful changes to your routine at a sustainable pace. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good answers, get your shit together incrementally by making daily meaningful changes to your routine at a sustainable pace. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg48zps", "score_hidden": false, "stickied": false, "created": 1491946267.0, "created_utc": 1491917467.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg426lm", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "mlsoccer2", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Jeez this sounds a bit like me a few months ago. I wish I could write a few paragraphs worth of advice, which I've done before, but it's like 5am where I am and I haven't slept at all lol. Have you considered going to a psychiatrist and maybe a therapist too? I've done both and those helped me quite a bit. Sounds like you're from India right? Well anywho, I'd try not being so hard on yourself because you're beating yourself up to the point that it's not letting you come back up.\n\nI've gone through some pretty traumatic stuff 2 years ago and I'm just now starting to really get out of that hole. It takes time but uh... I'd take it easy for now and know that it's not a race, and that you should take as long as you need to finish that degree. Shit dude, I just withdrew 2/3 of my classes and I feel horrible about it but that just means I need to focus on taking care of myself and doing the things I'm already doing but better. Not everyone can study full time because not everyone has depression, not everyone has the same brain structure to do the same shit exactly like everyone else does it.\n\nHow much longer do you need to finish your degree? If it's not long, then just take it slowly and finish it. If you're in the middle of it, then take a small break and try to enjoy life before coming back and finishing your degree. Burnout is a real thing and it sounds like you're pretty burnt out. And that's ok because you have a mental disorder and it's a lot tougher for people who do have mental disorders to do things. You can pm me if you'd like. Also looks like ive accidently written a few paragraphs worth of advice. Woops.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jeez this sounds a bit like me a few months ago. I wish I could write a few paragraphs worth of advice, which I&amp;#39;ve done before, but it&amp;#39;s like 5am where I am and I haven&amp;#39;t slept at all lol. Have you considered going to a psychiatrist and maybe a therapist too? I&amp;#39;ve done both and those helped me quite a bit. Sounds like you&amp;#39;re from India right? Well anywho, I&amp;#39;d try not being so hard on yourself because you&amp;#39;re beating yourself up to the point that it&amp;#39;s not letting you come back up.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve gone through some pretty traumatic stuff 2 years ago and I&amp;#39;m just now starting to really get out of that hole. It takes time but uh... I&amp;#39;d take it easy for now and know that it&amp;#39;s not a race, and that you should take as long as you need to finish that degree. Shit dude, I just withdrew 2/3 of my classes and I feel horrible about it but that just means I need to focus on taking care of myself and doing the things I&amp;#39;m already doing but better. Not everyone can study full time because not everyone has depression, not everyone has the same brain structure to do the same shit exactly like everyone else does it.&lt;/p&gt;\n\n&lt;p&gt;How much longer do you need to finish your degree? If it&amp;#39;s not long, then just take it slowly and finish it. If you&amp;#39;re in the middle of it, then take a small break and try to enjoy life before coming back and finishing your degree. Burnout is a real thing and it sounds like you&amp;#39;re pretty burnt out. And that&amp;#39;s ok because you have a mental disorder and it&amp;#39;s a lot tougher for people who do have mental disorders to do things. You can pm me if you&amp;#39;d like. Also looks like ive accidently written a few paragraphs worth of advice. Woops.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg426lm", "score_hidden": false, "stickied": false, "created": 1491931692.0, "created_utc": 1491902892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg4lcbv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "howdoistopobsessing", "parent_id": "t1_dg47vyr", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "How do you suggest we figure out what makes us happy?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you suggest we figure out what makes us happy?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4lcbv", "score_hidden": false, "stickied": false, "created": 1491960482.0, "created_utc": 1491931682.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47vyr", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Camrod91", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I think you should take off of uni and go to work. At work you will have a place, be part of a team. You can even start paying back the debt (which you don't have a lot) \n\n\n\nAlso, you seem to crave social attention. That is fine unless it becomes a problem...which it sounds like it is. You need to find a hobby that you can do alone, in your spare time ro make YOU happy. Live to impress yourself. \n\n\nYou are looking for someone else to make you happy...I feel like you should try to make yourself happy. I've been in your situation, it feels like a hole that I couldn't get out...I learned to make myself happy and all is good. \n\n\nGoodluck bud\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should take off of uni and go to work. At work you will have a place, be part of a team. You can even start paying back the debt (which you don&amp;#39;t have a lot) &lt;/p&gt;\n\n&lt;p&gt;Also, you seem to crave social attention. That is fine unless it becomes a problem...which it sounds like it is. You need to find a hobby that you can do alone, in your spare time ro make YOU happy. Live to impress yourself. &lt;/p&gt;\n\n&lt;p&gt;You are looking for someone else to make you happy...I feel like you should try to make yourself happy. I&amp;#39;ve been in your situation, it feels like a hole that I couldn&amp;#39;t get out...I learned to make myself happy and all is good. &lt;/p&gt;\n\n&lt;p&gt;Goodluck bud&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg47vyr", "score_hidden": false, "stickied": false, "created": 1491944659.0, "created_utc": 1491915859.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg4430p", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "EnigmaticMentat", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I totally agree that it would be good for you to see a therapist. They can hep you with through some of this stuff, especially what you went through in 2014, and the latent anger. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I totally agree that it would be good for you to see a therapist. They can hep you with through some of this stuff, especially what you went through in 2014, and the latent anger. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4430p", "score_hidden": false, "stickied": false, "created": 1491937292.0, "created_utc": 1491908492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg448t6", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "beathelas", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Maybe consider that university may not be right for you. \n\nI don't really know what your life is like, but your story sounds similar to my experience in Uni. I breezed through high school which sadly left me academically very unprepared for secondary education. When I got there, I was more concerned with socializing than studying and I couldn't keep my grades up. I switched majors a couple times and ended up dropping out more than once. \n\nI had some rough years, but what I experienced was how much having the right job or being in the right program can change someone's life. Myself, I did poorly in uni because I don't have enough personal initiative. I did better in high school and college because the programs don't demand as much independence.  I do fine at my job for the same reason.\n\nSo the advice I want to offer is the advice I wish I could give my 17 year old self, take a college program, 2 years, for a specific job like IT or Business or engineering or whatever you know you're good at and get to work ASAP. \n\nYou may be shocked how having a full time job and the paycheck that comes with it can change your life. And a degree is only worth the doors it opens. \n\n*edit* also, you're only 23, you're still really young, you have a ton of time to figure things out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe consider that university may not be right for you. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really know what your life is like, but your story sounds similar to my experience in Uni. I breezed through high school which sadly left me academically very unprepared for secondary education. When I got there, I was more concerned with socializing than studying and I couldn&amp;#39;t keep my grades up. I switched majors a couple times and ended up dropping out more than once. &lt;/p&gt;\n\n&lt;p&gt;I had some rough years, but what I experienced was how much having the right job or being in the right program can change someone&amp;#39;s life. Myself, I did poorly in uni because I don&amp;#39;t have enough personal initiative. I did better in high school and college because the programs don&amp;#39;t demand as much independence.  I do fine at my job for the same reason.&lt;/p&gt;\n\n&lt;p&gt;So the advice I want to offer is the advice I wish I could give my 17 year old self, take a college program, 2 years, for a specific job like IT or Business or engineering or whatever you know you&amp;#39;re good at and get to work ASAP. &lt;/p&gt;\n\n&lt;p&gt;You may be shocked how having a full time job and the paycheck that comes with it can change your life. And a degree is only worth the doors it opens. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;edit&lt;/em&gt; also, you&amp;#39;re only 23, you&amp;#39;re still really young, you have a ton of time to figure things out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg448t6", "score_hidden": false, "stickied": false, "created": 1491937695.0, "created_utc": 1491908895.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg49c3x", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "piratebroadcast", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Read this book: https://www.amazon.com/10-Happier-Self-Help-Actually-Works/dp/0062265423", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read this book: &lt;a href=\"https://www.amazon.com/10-Happier-Self-Help-Actually-Works/dp/0062265423\"&gt;https://www.amazon.com/10-Happier-Self-Help-Actually-Works/dp/0062265423&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg49c3x", "score_hidden": false, "stickied": false, "created": 1491946736.0, "created_utc": 1491917936.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg48nio", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "drewhardinwwz", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Get professional help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get professional help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg48nio", "score_hidden": false, "stickied": false, "created": 1491945794.0, "created_utc": 1491916994.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg486ef", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "OhhhValencia", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Dear lord, honey! I'm so sorry you're going through this. I can sympathize with you-- it took me a lonnngg time to get my life together. \n\nDon't do this alone. It's too hard. Go to a doctor and talk to them about getting treated for depression/ADHD. Get a life coach or a therapist who can help you plot out your goals. And just so you don't get frustrated, know that getting into a therapist's office could take 6 months- especially if it's a place that offers service to people with low income. \n\nRight now, your top priority is YOU. What are your obstacles and how can you REALLY fix them? Use the Toyota technique of 7 why's. Get deeper into why you're not achieving your goals because \"I just need to buckle down and study hard\" hasn't worked. It didn't work for me, either. I had to have systems in place- I had to acknowledge a fear of failure. You have to find, deep down, what is stopping you.\n\nLast, you need to realistically look at your major. Maybe there is a field that would be just as rewarding you could pursue- sports medicine, various therapies, etc. This may be the time in your life where you need to face some harsh realities. Not everyone gets to be an astronaut. Go find something else you can be awesome at. \n\nYour early 20's are rough, but work tirelessly to improve yourself-- even if your life is such a mess that it seems absurd. Change will not happen all at once, it comes in little bits. If you work to improve, things will get better. Dig deep. Godspeed!\n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dear lord, honey! I&amp;#39;m so sorry you&amp;#39;re going through this. I can sympathize with you-- it took me a lonnngg time to get my life together. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t do this alone. It&amp;#39;s too hard. Go to a doctor and talk to them about getting treated for depression/ADHD. Get a life coach or a therapist who can help you plot out your goals. And just so you don&amp;#39;t get frustrated, know that getting into a therapist&amp;#39;s office could take 6 months- especially if it&amp;#39;s a place that offers service to people with low income. &lt;/p&gt;\n\n&lt;p&gt;Right now, your top priority is YOU. What are your obstacles and how can you REALLY fix them? Use the Toyota technique of 7 why&amp;#39;s. Get deeper into why you&amp;#39;re not achieving your goals because &amp;quot;I just need to buckle down and study hard&amp;quot; hasn&amp;#39;t worked. It didn&amp;#39;t work for me, either. I had to have systems in place- I had to acknowledge a fear of failure. You have to find, deep down, what is stopping you.&lt;/p&gt;\n\n&lt;p&gt;Last, you need to realistically look at your major. Maybe there is a field that would be just as rewarding you could pursue- sports medicine, various therapies, etc. This may be the time in your life where you need to face some harsh realities. Not everyone gets to be an astronaut. Go find something else you can be awesome at. &lt;/p&gt;\n\n&lt;p&gt;Your early 20&amp;#39;s are rough, but work tirelessly to improve yourself-- even if your life is such a mess that it seems absurd. Change will not happen all at once, it comes in little bits. If you work to improve, things will get better. Dig deep. Godspeed!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg486ef", "score_hidden": false, "stickied": false, "created": 1491945106.0, "created_utc": 1491916306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg446lq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "alex0919", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I'm a neuroscience major at a top state school and wanting to go into medicine. If you don't know by now that to be competitive for medical school your life must be studying and clinical volunteering, NOT partying and making a bunch of fake friends, then you're mistaken/not in the right vocation. I got a 2.5 my first semester for that reason, but now I pull 4.0's. People tease me for studying so much, but then I compare where I'm progressing to and where they're stuck at.\n\nClearly all those people before had conditional relationships with you, they don't give a shit now that you're depressed. Talk to your fucking family, in my late teens/early twenties I regretted not valuing my familial relationships. Pursue your passion and don't worry about others liking and disliking you--I probably have more people that dislike me than like me, but I value medicine and having real friends/girlfriends than maintaining superficial relationships.\n\nTake action because of your fear, your anxiety, your depression--do it anyway. Plan 4h+ a day to study and look for some clinical opportunities--you're going to die, make your time here worth remembering. Technically, you'll probably need a post baccalaureate to get a 3.5+ GPA (e.g. a good minimum to be sorta-competitive). Set some goals, find some forum communities about pre-medicine/medical school.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a neuroscience major at a top state school and wanting to go into medicine. If you don&amp;#39;t know by now that to be competitive for medical school your life must be studying and clinical volunteering, NOT partying and making a bunch of fake friends, then you&amp;#39;re mistaken/not in the right vocation. I got a 2.5 my first semester for that reason, but now I pull 4.0&amp;#39;s. People tease me for studying so much, but then I compare where I&amp;#39;m progressing to and where they&amp;#39;re stuck at.&lt;/p&gt;\n\n&lt;p&gt;Clearly all those people before had conditional relationships with you, they don&amp;#39;t give a shit now that you&amp;#39;re depressed. Talk to your fucking family, in my late teens/early twenties I regretted not valuing my familial relationships. Pursue your passion and don&amp;#39;t worry about others liking and disliking you--I probably have more people that dislike me than like me, but I value medicine and having real friends/girlfriends than maintaining superficial relationships.&lt;/p&gt;\n\n&lt;p&gt;Take action because of your fear, your anxiety, your depression--do it anyway. Plan 4h+ a day to study and look for some clinical opportunities--you&amp;#39;re going to die, make your time here worth remembering. Technically, you&amp;#39;ll probably need a post baccalaureate to get a 3.5+ GPA (e.g. a good minimum to be sorta-competitive). Set some goals, find some forum communities about pre-medicine/medical school.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg446lq", "score_hidden": false, "stickied": false, "created": 1491937544.0, "created_utc": 1491908744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg44inj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "potallegta", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I can relate. 2016 was probably one of the worst year of my life, I suffered from a traumatic experience and I ended up shunning myself off from my friends (and even the close ones), now they're slowly slipping into \"just acquaintances\" compared to the close relationships that we once have. I also lost my productivity and my productive habit last year to a point where I just procrastinate, sleeping all day, and indulging in entertainments without any real motivation to do anything useful. Nowadays I'm still trying to recover and it takes a lot of practices trying to discipline myself again and again. Just don't think of yourself as a lost cause and keep trying again and again once you slip back into being unproductive.\n\nDo you have any support system? Maybe try to go to a psychiatrist or just pour your heart out about your problems to your friends and family. Just try, they might be more caring compared to your own mind and difficult mental state. It's such a relieving experience to be able to share your stories with people instead of keeping it to yourself while drowning in negativity.\n\nYou might also want to try meditating. It definitely help your mind to focus on important things compared to dwelling on depressive thoughts. Or at least try to take some deep breaths once in a while if you start feeling worse.\n\nThe important thing is to actually sort your mental state first and take some small steps, as small as it might feel. Don't push yourself too hard while also trying not to fall back to the trap of procrastination and escapism. Balancing is the key. I know that it's not as easy as it sound but just try to keep forgiving yourself and your past mistakes and try to shift your focus on the next important things to do. Sometimes it might be as simple as taking a shower, striking a conversation with other people, other times when you're ready, to start becoming productive again, and any progress as small as it is is very crucial.\n\nSo, good luck. Rearranging your life is not an easy thing to do and can't be done in a short time. Just make sure that you know you want to head that way and sometimes in the future you'll see your problems now as a huge lesson in making you a better person.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can relate. 2016 was probably one of the worst year of my life, I suffered from a traumatic experience and I ended up shunning myself off from my friends (and even the close ones), now they&amp;#39;re slowly slipping into &amp;quot;just acquaintances&amp;quot; compared to the close relationships that we once have. I also lost my productivity and my productive habit last year to a point where I just procrastinate, sleeping all day, and indulging in entertainments without any real motivation to do anything useful. Nowadays I&amp;#39;m still trying to recover and it takes a lot of practices trying to discipline myself again and again. Just don&amp;#39;t think of yourself as a lost cause and keep trying again and again once you slip back into being unproductive.&lt;/p&gt;\n\n&lt;p&gt;Do you have any support system? Maybe try to go to a psychiatrist or just pour your heart out about your problems to your friends and family. Just try, they might be more caring compared to your own mind and difficult mental state. It&amp;#39;s such a relieving experience to be able to share your stories with people instead of keeping it to yourself while drowning in negativity.&lt;/p&gt;\n\n&lt;p&gt;You might also want to try meditating. It definitely help your mind to focus on important things compared to dwelling on depressive thoughts. Or at least try to take some deep breaths once in a while if you start feeling worse.&lt;/p&gt;\n\n&lt;p&gt;The important thing is to actually sort your mental state first and take some small steps, as small as it might feel. Don&amp;#39;t push yourself too hard while also trying not to fall back to the trap of procrastination and escapism. Balancing is the key. I know that it&amp;#39;s not as easy as it sound but just try to keep forgiving yourself and your past mistakes and try to shift your focus on the next important things to do. Sometimes it might be as simple as taking a shower, striking a conversation with other people, other times when you&amp;#39;re ready, to start becoming productive again, and any progress as small as it is is very crucial.&lt;/p&gt;\n\n&lt;p&gt;So, good luck. Rearranging your life is not an easy thing to do and can&amp;#39;t be done in a short time. Just make sure that you know you want to head that way and sometimes in the future you&amp;#39;ll see your problems now as a huge lesson in making you a better person.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg44inj", "score_hidden": false, "stickied": false, "created": 1491938354.0, "created_utc": 1491909554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg49ld4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GrassDash", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I think I can't give you any advice that you haven't heard. Just remember to be patient, the only way to get out of such a shithole is with babysteps... Remember that there are a lot of people (including me atm) that are in a similar situation. You're not the only one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think I can&amp;#39;t give you any advice that you haven&amp;#39;t heard. Just remember to be patient, the only way to get out of such a shithole is with babysteps... Remember that there are a lot of people (including me atm) that are in a similar situation. You&amp;#39;re not the only one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg49ld4", "score_hidden": false, "stickied": false, "created": 1491947079.0, "created_utc": 1491918279.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg4be3j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brmlb", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "you can only do 1 thing really well at a time, in life.\n\nunless, you're a naturally gifted, if you want good grades, you have to cut out other people and a daily social life (weekends are okay)\n\nremember, the people who were doing this 20 years ago didnt have daily distractions of social media and smart phones and video games.\n\nive been through this before on the engineering side.  Temporarily cut everyone out, focus on your goals.  These other people you worry about wont be around in 5 years anyway", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you can only do 1 thing really well at a time, in life.&lt;/p&gt;\n\n&lt;p&gt;unless, you&amp;#39;re a naturally gifted, if you want good grades, you have to cut out other people and a daily social life (weekends are okay)&lt;/p&gt;\n\n&lt;p&gt;remember, the people who were doing this 20 years ago didnt have daily distractions of social media and smart phones and video games.&lt;/p&gt;\n\n&lt;p&gt;ive been through this before on the engineering side.  Temporarily cut everyone out, focus on your goals.  These other people you worry about wont be around in 5 years anyway&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4be3j", "score_hidden": false, "stickied": false, "created": 1491949389.0, "created_utc": 1491920589.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg4btz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AndySaturn", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "If you have supportive family I would highly recommend telling them everything ASAP and ask for their help/support rearranging things and getting them back in order. \n\nYou've been open and honest here; the next step is to be open and honest in real life. Once you accept you need to change then you can begin the process.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you have supportive family I would highly recommend telling them everything ASAP and ask for their help/support rearranging things and getting them back in order. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve been open and honest here; the next step is to be open and honest in real life. Once you accept you need to change then you can begin the process.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4btz4", "score_hidden": false, "stickied": false, "created": 1491949924.0, "created_utc": 1491921124.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg4guab", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tangerineeniregnat", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "If you can't do 4-5 classes do 2-3 instead. The quickest way to finish and do well is to do it right the first time", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you can&amp;#39;t do 4-5 classes do 2-3 instead. The quickest way to finish and do well is to do it right the first time&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4guab", "score_hidden": false, "stickied": false, "created": 1491955565.0, "created_utc": 1491926765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg4k290", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "killbot9000", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "&gt; I want to meet girls, I want to have friends who invite me out places, I want to feel confident about myself even though I have pretty bad acne scars, I want to feel like I have something to offer and not be the ugly person I consider myself to be both physically and emotionally, I want to be smart, I want to achieve my goal, and I want a life worth living.\n\nRight now you need to choose one goal to be \"my goal\" and work on that exclusively every day until you are satisfied with your results. You listed seven and you don't seem able to balance them all at once. One at a time.\n\n*I'm not with the \"go see a doctor and have someone else solve this for you\" camp. I think you just have too many goals to possibly achieve at once. As a good friend once said to me, \"suck it up.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I want to meet girls, I want to have friends who invite me out places, I want to feel confident about myself even though I have pretty bad acne scars, I want to feel like I have something to offer and not be the ugly person I consider myself to be both physically and emotionally, I want to be smart, I want to achieve my goal, and I want a life worth living.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Right now you need to choose one goal to be &amp;quot;my goal&amp;quot; and work on that exclusively every day until you are satisfied with your results. You listed seven and you don&amp;#39;t seem able to balance them all at once. One at a time.&lt;/p&gt;\n\n&lt;p&gt;*I&amp;#39;m not with the &amp;quot;go see a doctor and have someone else solve this for you&amp;quot; camp. I think you just have too many goals to possibly achieve at once. As a good friend once said to me, &amp;quot;suck it up.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4k290", "score_hidden": false, "stickied": false, "created": 1491959076.0, "created_utc": 1491930276.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg50fx1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cg996", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Have you considered the merchant navy?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered the merchant navy?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg50fx1", "score_hidden": false, "stickied": false, "created": 1491977399.0, "created_utc": 1491948599.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg5bitn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Guitarnooob", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "transfer universities, reset your gpa", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;transfer universities, reset your gpa&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg5bitn", "score_hidden": false, "stickied": false, "created": 1491991999.0, "created_utc": 1491963199.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64pq8f", "likes": null, "replies": "", "user_reports": [], "id": "dg7tliz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aznology", "parent_id": "t3_64pq8f", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Here lemme put it into my perspective for you. Girls don't wanna meet some broke ass, lazy ass guy who thinks he's a smart ass. They wanna meet humans who save other people's lives, who are coincidentally wealthy because they provide value to other's lives. Heh, be a doctor, you think it was gonna be easy huh? You have friends, cast them away, you have social life throw it out. These things aren't necessary, wallow in the depths of depression, fight it be angry, rechannel that anger into something productive. IF IT DOESN'T WORK ITS OKAY THERE ARE MANY WAYS TO THE TOP, BUT KNOW ONE THING YOU GAVE IT YOUR ALL.\n\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here lemme put it into my perspective for you. Girls don&amp;#39;t wanna meet some broke ass, lazy ass guy who thinks he&amp;#39;s a smart ass. They wanna meet humans who save other people&amp;#39;s lives, who are coincidentally wealthy because they provide value to other&amp;#39;s lives. Heh, be a doctor, you think it was gonna be easy huh? You have friends, cast them away, you have social life throw it out. These things aren&amp;#39;t necessary, wallow in the depths of depression, fight it be angry, rechannel that anger into something productive. IF IT DOESN&amp;#39;T WORK ITS OKAY THERE ARE MANY WAYS TO THE TOP, BUT KNOW ONE THING YOU GAVE IT YOUR ALL.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg7tliz", "score_hidden": false, "stickied": false, "created": 1492130569.0, "created_utc": 1492101769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]