[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey everyone,  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve hit a bit of a wall and I decided to ask for some help. I feel like my life has been on pause so to speak for a while now, and it&amp;#39;s getting to be a really frustrating feeling. I put a lot of my time and energy into work, and while that&amp;#39;s helped me out financially, it&amp;#39;s started to take over my life. There&amp;#39;s a lot of stuff that I really enjoy doing (concerts, day trips, etc.) that I just can&amp;#39;t find the time to do anymore because I spend so much time working. And, when I&amp;#39;m not working, I feel guilty about not working... It&amp;#39;s kind of a cycle. I have a lot of great friends, but because of scheduling conflicts I can go weeks without getting to spend even a phone call with them.&lt;br/&gt;\nMy dissatisfaction with my personal life has spread into my work life. I&amp;#39;m a lot snappier and rude than I used to be. I try actively to avoid that behavior, but every now and again I still lash out at someone for something that really isn&amp;#39;t their fault. There&amp;#39;s a sloppiness in my work that didn&amp;#39;t exist when I had a good personal/work life balance. And so if I&amp;#39;m not doing well at work, and I&amp;#39;m not doing well at home, I think I need some changes. I know I need to change aspects of my life, but I&amp;#39;m not sure where and how to start.&lt;br/&gt;\nThe first thing I&amp;#39;ve decided on is to establish a sleep schedule. I cut out late night TV, cell phone use, etc and I have a set bed time that I only break for emergencies. This has been a really rough first step for me and I realize that it will take me a while to really adjust to this new sleep schedule, but I&amp;#39;ve noticed it&amp;#39;s already had a positive impact.&lt;br/&gt;\nI&amp;#39;m looking for any suggestions or tips or just stories of how other people have coped with crazy work schedules. If your suggestion is  flexible and doesn&amp;#39;t require a set time/place that&amp;#39;s the better for me, because I work at all hours (mornings, nights, weekdays, weekends, holidays... I&amp;#39;m never working all those in the same week but it&amp;#39;s all on the table for me). Thanks in advance for any advice :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey everyone,  \n  \nI've hit a bit of a wall and I decided to ask for some help. I feel like my life has been on pause so to speak for a while now, and it's getting to be a really frustrating feeling. I put a lot of my time and energy into work, and while that's helped me out financially, it's started to take over my life. There's a lot of stuff that I really enjoy doing (concerts, day trips, etc.) that I just can't find the time to do anymore because I spend so much time working. And, when I'm not working, I feel guilty about not working... It's kind of a cycle. I have a lot of great friends, but because of scheduling conflicts I can go weeks without getting to spend even a phone call with them.  \nMy dissatisfaction with my personal life has spread into my work life. I'm a lot snappier and rude than I used to be. I try actively to avoid that behavior, but every now and again I still lash out at someone for something that really isn't their fault. There's a sloppiness in my work that didn't exist when I had a good personal/work life balance. And so if I'm not doing well at work, and I'm not doing well at home, I think I need some changes. I know I need to change aspects of my life, but I'm not sure where and how to start.  \nThe first thing I've decided on is to establish a sleep schedule. I cut out late night TV, cell phone use, etc and I have a set bed time that I only break for emergencies. This has been a really rough first step for me and I realize that it will take me a while to really adjust to this new sleep schedule, but I've noticed it's already had a positive impact.  \nI'm looking for any suggestions or tips or just stories of how other people have coped with crazy work schedules. If your suggestion is  flexible and doesn't require a set time/place that's the better for me, because I work at all hours (mornings, nights, weekdays, weekends, holidays... I'm never working all those in the same week but it's all on the table for me). Thanks in advance for any advice :)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qcwm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "fantana_row", "saved": false, "mod_reports": [], "name": "t3_64qcwm", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/64qcwm/needadvice_where_to_start_with_getting_it_together/", "num_reports": null, "locked": false, "stickied": false, "created": 1491940613.0, "url": "https://www.reddit.com/r/getdisciplined/comments/64qcwm/needadvice_where_to_start_with_getting_it_together/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] Where to Start with Getting it Together", "created_utc": 1491911813.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64qcwm", "likes": null, "replies": "", "user_reports": [], "id": "dg5zc9n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "vegannazi", "parent_id": "t3_64qcwm", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "&gt; I think I need some changes. I know I need to change aspects of my life, but I'm not sure where and how to start.\n\nNo work advice from me but throwing out and giving away my shit has been really helpful. I was feeling pretty stuck and overwhelmed recently, got rid of so.much.shit. and things somehow got... clearer. Look up The Minimalists and The 40 Bags in 40 Days challenge. Getting rid of stuff frees up some space in your head too somehow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think I need some changes. I know I need to change aspects of my life, but I&amp;#39;m not sure where and how to start.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No work advice from me but throwing out and giving away my shit has been really helpful. I was feeling pretty stuck and overwhelmed recently, got rid of so.much.shit. and things somehow got... clearer. Look up The Minimalists and The 40 Bags in 40 Days challenge. Getting rid of stuff frees up some space in your head too somehow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg5zc9n", "score_hidden": false, "stickied": false, "created": 1492038154.0, "created_utc": 1492009354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]