[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I mean an irrational fear. I know the steps I need to do but I&amp;#39;m a pussy. Maybe this is psicological and I carry insecurities. But I wish to turn this around.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I mean an irrational fear. I know the steps I need to do but I'm a pussy. Maybe this is psicological and I carry insecurities. But I wish to turn this around.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64rdu5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "nemodot", "saved": false, "mod_reports": [], "name": "t3_64rdu5", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/64rdu5/needadvice_have_you_ever_experienced_irration/", "num_reports": null, "locked": false, "stickied": false, "created": 1491952019.0, "url": "https://www.reddit.com/r/getdisciplined/comments/64rdu5/needadvice_have_you_ever_experienced_irration/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] Have you ever experienced irration fear at doing stuff?", "created_utc": 1491923219.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": "", "user_reports": [], "id": "dg4jirk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bunnymags", "parent_id": "t1_dg4j80b", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Try watching a tony Robbins motivational video or documentary on Netflix. Yea they're cheesy but might work for some! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try watching a tony Robbins motivational video or documentary on Netflix. Yea they&amp;#39;re cheesy but might work for some! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4jirk", "score_hidden": false, "stickied": false, "created": 1491958487.0, "created_utc": 1491929687.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4j80b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nemodot", "parent_id": "t1_dg4i4vv", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I'm sitting in a large and comfortable area, completely clean. I have the motivation to do simple task, but not daunting ones.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sitting in a large and comfortable area, completely clean. I have the motivation to do simple task, but not daunting ones.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4j80b", "score_hidden": false, "stickied": false, "created": 1491958165.0, "created_utc": 1491929365.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4i4vv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bunnymags", "parent_id": "t3_64rdu5", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Yes. A year ago I lived in a tiny room and I believe the tiny space made me physically feel fucked up. I didn't want to do anything. I was depressed. I woke up only to want to go back to sleep and not live reality. \n\nI moved out to somewhere bigger and instantly felt better. Got a new job. Started some healthy routine. \n\nBetter things started to happen and I now live in an amazing apartment in Manhattan and have my life kind of together. Yoga also helped me shut off my overthinking mind and create better conversation with myself \n\nIt will pass when you change up your environment sometimes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. A year ago I lived in a tiny room and I believe the tiny space made me physically feel fucked up. I didn&amp;#39;t want to do anything. I was depressed. I woke up only to want to go back to sleep and not live reality. &lt;/p&gt;\n\n&lt;p&gt;I moved out to somewhere bigger and instantly felt better. Got a new job. Started some healthy routine. &lt;/p&gt;\n\n&lt;p&gt;Better things started to happen and I now live in an amazing apartment in Manhattan and have my life kind of together. Yoga also helped me shut off my overthinking mind and create better conversation with myself &lt;/p&gt;\n\n&lt;p&gt;It will pass when you change up your environment sometimes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4i4vv", "score_hidden": false, "stickied": false, "created": 1491956972.0, "created_utc": 1491928172.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": "", "user_reports": [], "id": "dg4jbdd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Torreau", "parent_id": "t1_dg4iw2v", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "This, definitely. I have a friend that used to be absolutely petrified of spiders. She couldn't even be in a room with a book that she knew had photos of spiders, it was that bad. She decided to get some help, did exposure therapy, and within 3 months she was able to hold large spiders without incident. Exposure works, works well, and works quickly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This, definitely. I have a friend that used to be absolutely petrified of spiders. She couldn&amp;#39;t even be in a room with a book that she knew had photos of spiders, it was that bad. She decided to get some help, did exposure therapy, and within 3 months she was able to hold large spiders without incident. Exposure works, works well, and works quickly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4jbdd", "score_hidden": false, "stickied": false, "created": 1491958265.0, "created_utc": 1491929465.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64rdu5", "likes": null, "replies": "", "user_reports": [], "id": "dg4nyd1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DancingNerd", "parent_id": "t1_dg4ksjm", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Ooh, I feel that. It's really difficult to do anything when it feels like nothing matters. Speaking personally, I also have a really hard time feeling like stuff matters, whether it's school, work, whatever.\n\nIt absolutely makes sense for you to feel like hedonism is the only thing that matters. In fact, even though they don't say it out loud, I'd honestly bet that most people agree with you. Nobody is ever going to enjoy a thing they have to do as much as they enjoy doing what they want to do. That's why I can focus on video games for hours but need a break half an hour into a study session.\n\nI think getting other people involved is a really good call; it's a lot easier to stay motivated when you've got people with you, which is why I can do like three times as many crunches in a fitness class as I can alone at home. Your boss sounds great, and I'd maybe talk to them about what keeps them going.\n\nI think coming to terms with doing stuff you don't want to do is like 80% of being a responsible person. It's hard though. I find that practicing gratefulness helps a lot (\"this job might not be inspiring but at least I get to go home afterwards and do what I want with the money I've earned, which is more than a kid of people get\") and mindfulness is awesome, but there's a lot of trial and error in figuring out what works for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ooh, I feel that. It&amp;#39;s really difficult to do anything when it feels like nothing matters. Speaking personally, I also have a really hard time feeling like stuff matters, whether it&amp;#39;s school, work, whatever.&lt;/p&gt;\n\n&lt;p&gt;It absolutely makes sense for you to feel like hedonism is the only thing that matters. In fact, even though they don&amp;#39;t say it out loud, I&amp;#39;d honestly bet that most people agree with you. Nobody is ever going to enjoy a thing they have to do as much as they enjoy doing what they want to do. That&amp;#39;s why I can focus on video games for hours but need a break half an hour into a study session.&lt;/p&gt;\n\n&lt;p&gt;I think getting other people involved is a really good call; it&amp;#39;s a lot easier to stay motivated when you&amp;#39;ve got people with you, which is why I can do like three times as many crunches in a fitness class as I can alone at home. Your boss sounds great, and I&amp;#39;d maybe talk to them about what keeps them going.&lt;/p&gt;\n\n&lt;p&gt;I think coming to terms with doing stuff you don&amp;#39;t want to do is like 80% of being a responsible person. It&amp;#39;s hard though. I find that practicing gratefulness helps a lot (&amp;quot;this job might not be inspiring but at least I get to go home afterwards and do what I want with the money I&amp;#39;ve earned, which is more than a kid of people get&amp;quot;) and mindfulness is awesome, but there&amp;#39;s a lot of trial and error in figuring out what works for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4nyd1", "score_hidden": false, "stickied": false, "created": 1491963344.0, "created_utc": 1491934544.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ksjm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nemodot", "parent_id": "t1_dg4k5ya", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "It's not that I feel unsafe, It's that I feel that it's meaningless to do anything. Tasks are only important if they involve other people. Like my boss, who makes me value my work (I find it useless most of the times and its a problem). \n\nIt's like nothing matters. The only thing that matters is hedonism. That's why I enjoy so much drinking beer and listening to music. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not that I feel unsafe, It&amp;#39;s that I feel that it&amp;#39;s meaningless to do anything. Tasks are only important if they involve other people. Like my boss, who makes me value my work (I find it useless most of the times and its a problem). &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like nothing matters. The only thing that matters is hedonism. That&amp;#39;s why I enjoy so much drinking beer and listening to music. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4ksjm", "score_hidden": false, "stickied": false, "created": 1491959880.0, "created_utc": 1491931080.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4k5ya", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DancingNerd", "parent_id": "t1_dg4jv2j", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Hmm, that's really interesting! I wonder if it's not because you've driven to work so many times during the week that you know you'll probably be safe if you drive to work, but you drive less on the weekends, so you're not as certain you'll be safe? \n\nRoutine makes a really big difference. It's fully possible to be anxious about something in one situation, but not another. For example, in some situations, like dances, I have absolutely no problem being social and talking to people. In others, like parties or business stuff, I can't think of a single thing to say and I get really nervous. \n\nSome stuff takes a while to get accustomed to, or it's so uncomfortable that it might be more reasonable to find a way around it. Is that an option, or would that cause more problems? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm, that&amp;#39;s really interesting! I wonder if it&amp;#39;s not because you&amp;#39;ve driven to work so many times during the week that you know you&amp;#39;ll probably be safe if you drive to work, but you drive less on the weekends, so you&amp;#39;re not as certain you&amp;#39;ll be safe? &lt;/p&gt;\n\n&lt;p&gt;Routine makes a really big difference. It&amp;#39;s fully possible to be anxious about something in one situation, but not another. For example, in some situations, like dances, I have absolutely no problem being social and talking to people. In others, like parties or business stuff, I can&amp;#39;t think of a single thing to say and I get really nervous. &lt;/p&gt;\n\n&lt;p&gt;Some stuff takes a while to get accustomed to, or it&amp;#39;s so uncomfortable that it might be more reasonable to find a way around it. Is that an option, or would that cause more problems? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4k5ya", "score_hidden": false, "stickied": false, "created": 1491959188.0, "created_utc": 1491930388.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jv2j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nemodot", "parent_id": "t1_dg4iw2v", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "The thing is I never manage to get accustomed to the fearful task. For instance. I'm afraid of driving around with my car by myself on the weekend, but I'm completely okay to do it on week days whenever I drive to work. It's weird.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is I never manage to get accustomed to the fearful task. For instance. I&amp;#39;m afraid of driving around with my car by myself on the weekend, but I&amp;#39;m completely okay to do it on week days whenever I drive to work. It&amp;#39;s weird.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4jv2j", "score_hidden": false, "stickied": false, "created": 1491958855.0, "created_utc": 1491930055.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iw2v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DancingNerd", "parent_id": "t3_64rdu5", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Absolutely! \n\nIrrational fears have stopped me from working out at times, because I'm worried about being stared at; they've stopped me from talking to people, because I'm scared people wouldn't actually want me around once they got to know me; they've stopped me from enjoying a lot of situations, because I've been so busy worrying. The good news is, it's gotten a lot better, because I've gotten better at identifying my irrational fears and working through them\n \n\nIrrational fear and anxieties suck. They're not usually something you can talk yourself out of just because you know it's irrational -- it's about the feeling, not the thought process. The trick is to identify the feeling, and think through it. \n\nCBT, or cognitive behavioral therapy, is a really effective way of dealing with irrational thoughts and fears. [This page] (https://www.helpguide.org/articles/anxiety/therapy-for-anxiety-disorders.htm) goes into some detail on techniques that help you identify and combat anxious thoughts. One of the most effective ways of getting rid of them is systematic desensitization -- figure out what you're scared of, and expose yourself to it until you're no longer scared. It sucks at first, but it works pretty damn quickly, compared to other therapies, and you don't necessarily need a therapist to use the techniques. \n\nFor example, if you were scared of snakes, a potential way of treating it would be to hang out in a room with a snake. You'd be stressed at first, but eventually your brain gets tired of sending you \"aah I'm gonna die\" signals and chills out. You learn that snakes don't actually pose an immediate threat to you, and you're less scared than before. It's kind of corny to say \"face your fears\" because fears are real and facing them is, well, scary. But it definitely gets less scary. :) \n\n", "edited": 1491929244.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely! &lt;/p&gt;\n\n&lt;p&gt;Irrational fears have stopped me from working out at times, because I&amp;#39;m worried about being stared at; they&amp;#39;ve stopped me from talking to people, because I&amp;#39;m scared people wouldn&amp;#39;t actually want me around once they got to know me; they&amp;#39;ve stopped me from enjoying a lot of situations, because I&amp;#39;ve been so busy worrying. The good news is, it&amp;#39;s gotten a lot better, because I&amp;#39;ve gotten better at identifying my irrational fears and working through them&lt;/p&gt;\n\n&lt;p&gt;Irrational fear and anxieties suck. They&amp;#39;re not usually something you can talk yourself out of just because you know it&amp;#39;s irrational -- it&amp;#39;s about the feeling, not the thought process. The trick is to identify the feeling, and think through it. &lt;/p&gt;\n\n&lt;p&gt;CBT, or cognitive behavioral therapy, is a really effective way of dealing with irrational thoughts and fears. &lt;a href=\"https://www.helpguide.org/articles/anxiety/therapy-for-anxiety-disorders.htm\"&gt;This page&lt;/a&gt; goes into some detail on techniques that help you identify and combat anxious thoughts. One of the most effective ways of getting rid of them is systematic desensitization -- figure out what you&amp;#39;re scared of, and expose yourself to it until you&amp;#39;re no longer scared. It sucks at first, but it works pretty damn quickly, compared to other therapies, and you don&amp;#39;t necessarily need a therapist to use the techniques. &lt;/p&gt;\n\n&lt;p&gt;For example, if you were scared of snakes, a potential way of treating it would be to hang out in a room with a snake. You&amp;#39;d be stressed at first, but eventually your brain gets tired of sending you &amp;quot;aah I&amp;#39;m gonna die&amp;quot; signals and chills out. You learn that snakes don&amp;#39;t actually pose an immediate threat to you, and you&amp;#39;re less scared than before. It&amp;#39;s kind of corny to say &amp;quot;face your fears&amp;quot; because fears are real and facing them is, well, scary. But it definitely gets less scary. :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg4iw2v", "score_hidden": false, "stickied": false, "created": 1491957810.0, "created_utc": 1491929010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]