[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all. Looking for some techniques that I can use everyday to stop the constant eating.&lt;/p&gt;\n\n&lt;p&gt;All day whilst i&amp;#39;m working I cannot stop eating. I constantly crave shit food and after I eat it I wish I didn&amp;#39;t. I have been like this for a long time and its affecting everything in my life from how productive I am to how much my wife wants to be with me.&lt;/p&gt;\n\n&lt;p&gt;Some stats: I&amp;#39;m 34, male, married, father of 2, work a desk job in IT, 6&amp;#39;1, 108 Kg and I actually do not know the last time that I was in a healthy weight range. I exercise 4 times a week (hard exercise) but don&amp;#39;t loose any weight. Fortunately or unfortunately (depending on how you look at it I guess) the exercise is preventing me from getting bigger.&lt;/p&gt;\n\n&lt;p&gt;I constantly say everyday, that I need to take it one day at a time and yet I fail every day. Once I fail, thats a leave pass for me to eat worse. Its a constant fucking cycle.&lt;/p&gt;\n\n&lt;p&gt;If anyone has any advice on what I can do to curb the mental thoughts of putting food into my mouth, I would really appreciate it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all. Looking for some techniques that I can use everyday to stop the constant eating.\n\nAll day whilst i'm working I cannot stop eating. I constantly crave shit food and after I eat it I wish I didn't. I have been like this for a long time and its affecting everything in my life from how productive I am to how much my wife wants to be with me.\n\nSome stats: I'm 34, male, married, father of 2, work a desk job in IT, 6'1, 108 Kg and I actually do not know the last time that I was in a healthy weight range. I exercise 4 times a week (hard exercise) but don't loose any weight. Fortunately or unfortunately (depending on how you look at it I guess) the exercise is preventing me from getting bigger.\n\nI constantly say everyday, that I need to take it one day at a time and yet I fail every day. Once I fail, thats a leave pass for me to eat worse. Its a constant fucking cycle.\n\nIf anyone has any advice on what I can do to curb the mental thoughts of putting food into my mouth, I would really appreciate it.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64wj5g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "wavvo", "saved": false, "mod_reports": [], "name": "t3_64wj5g", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/64wj5g/need_advice_cannot_stop_eating/", "num_reports": null, "locked": false, "stickied": false, "created": 1492007504.0, "url": "https://www.reddit.com/r/getdisciplined/comments/64wj5g/need_advice_cannot_stop_eating/", "author_flair_text": null, "quarantine": false, "title": "[Need Advice] Cannot stop eating!", "created_utc": 1491978704.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64wj5g", "likes": null, "replies": "", "user_reports": [], "id": "dg6dsqb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "preds", "parent_id": "t3_64wj5g", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I actively tried and failed to lose weight for 12 years. It's a vicious cycle of hating yourself and eating crap which makes you feel better (although I didn't realise this was what was happening at the time). I spent about 6 years reading about various diets and exercise programs before I finally got my act together and worked out a program that would work for me and lost 25kgs in a year. I can tell you what that program was (cyclic ketogenic diet/bike to work/skip breakfast) but ultimately there are a myriad of ways to lose weight - the key ingredient in my opinion is definitely creating a sustainable habit and understanding your own shortcomings. You won't read some step by step guide on the internet that you'll follow and finally lose weight, if it was that easy you would've done it already. The key is understanding yourself, why you act the way you do and addressing the root of the issue. Are you tired and use sugar to wake yourself up? Are you feeling down and food gives you a dopamine hit? Do you just have an ingrained habit that when 3pm rolls around and everyone else is having a snack you have one too? You don't *want* to be eating what you are so there has to be some trigger you can identify and when you do, you can replace the eating outcome of your trigger with something healthier.\n\nTo address a couple of things that jumped out to me from your post:\na) Losing weight is 90% diet, 10% exercise. Do not fool yourself into thinking you can out-exercise a shitty diet. Short of quitting your job and exercising 6 hours a day this is practically impossible. You need to focus your efforts on eating better.\nb) The all or nothing attitude is one I'm most certainly guilty of. Oh, I had a slice of cake diet ruined I'm going to go buy some chocolate now awww yeah this will be so good aaaand fuck I've turned a minor speedbump into a massive roadblock (not the best analogy but you get the idea). Perfect is the enemy of good. Work out what you can add into your diet while remaining under calories to give yourself a bit of reprieve from a super strict diet. I found some yogurt and berries that I would eat instead of something worse when I had that itch. Some people have had success replacing their sugar cravings with things like tea or gum - feel like eating some candy? Go make a cup of tea instead. Drink 12 cups. There are too many strategies for dealing with this to list here but the most important step is just to recognise this is an issue you're having that you need to overcome.\n\nFinally. Sleep! So fucking important and incredible under-rated in modern society. Did you know that without sufficient sleep your body acts differently in regards to how it decides to store fat? Cravings are also that much worse and hard to deal with when you haven't slept properly, if you keep a diary of what you eat and how much sleep you've had I guarantee you'll see a correlation. Sleep properly - priority #1.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actively tried and failed to lose weight for 12 years. It&amp;#39;s a vicious cycle of hating yourself and eating crap which makes you feel better (although I didn&amp;#39;t realise this was what was happening at the time). I spent about 6 years reading about various diets and exercise programs before I finally got my act together and worked out a program that would work for me and lost 25kgs in a year. I can tell you what that program was (cyclic ketogenic diet/bike to work/skip breakfast) but ultimately there are a myriad of ways to lose weight - the key ingredient in my opinion is definitely creating a sustainable habit and understanding your own shortcomings. You won&amp;#39;t read some step by step guide on the internet that you&amp;#39;ll follow and finally lose weight, if it was that easy you would&amp;#39;ve done it already. The key is understanding yourself, why you act the way you do and addressing the root of the issue. Are you tired and use sugar to wake yourself up? Are you feeling down and food gives you a dopamine hit? Do you just have an ingrained habit that when 3pm rolls around and everyone else is having a snack you have one too? You don&amp;#39;t &lt;em&gt;want&lt;/em&gt; to be eating what you are so there has to be some trigger you can identify and when you do, you can replace the eating outcome of your trigger with something healthier.&lt;/p&gt;\n\n&lt;p&gt;To address a couple of things that jumped out to me from your post:\na) Losing weight is 90% diet, 10% exercise. Do not fool yourself into thinking you can out-exercise a shitty diet. Short of quitting your job and exercising 6 hours a day this is practically impossible. You need to focus your efforts on eating better.\nb) The all or nothing attitude is one I&amp;#39;m most certainly guilty of. Oh, I had a slice of cake diet ruined I&amp;#39;m going to go buy some chocolate now awww yeah this will be so good aaaand fuck I&amp;#39;ve turned a minor speedbump into a massive roadblock (not the best analogy but you get the idea). Perfect is the enemy of good. Work out what you can add into your diet while remaining under calories to give yourself a bit of reprieve from a super strict diet. I found some yogurt and berries that I would eat instead of something worse when I had that itch. Some people have had success replacing their sugar cravings with things like tea or gum - feel like eating some candy? Go make a cup of tea instead. Drink 12 cups. There are too many strategies for dealing with this to list here but the most important step is just to recognise this is an issue you&amp;#39;re having that you need to overcome.&lt;/p&gt;\n\n&lt;p&gt;Finally. Sleep! So fucking important and incredible under-rated in modern society. Did you know that without sufficient sleep your body acts differently in regards to how it decides to store fat? Cravings are also that much worse and hard to deal with when you haven&amp;#39;t slept properly, if you keep a diary of what you eat and how much sleep you&amp;#39;ve had I guarantee you&amp;#39;ll see a correlation. Sleep properly - priority #1.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg6dsqb", "score_hidden": false, "stickied": false, "created": 1492053253.0, "created_utc": 1492024453.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64wj5g", "likes": null, "replies": "", "user_reports": [], "id": "dg5qu9m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hessenuk", "parent_id": "t3_64wj5g", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Make one change at a time and just focus on discipline around that one change.  \nPut a two litre bottle of water on your desk at work and change one meal (I recommend changing breakfast).  \nDo everything else as normal but stick with that one change for a couple of weeks and then go from there.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make one change at a time and just focus on discipline around that one change.&lt;br/&gt;\nPut a two litre bottle of water on your desk at work and change one meal (I recommend changing breakfast).&lt;br/&gt;\nDo everything else as normal but stick with that one change for a couple of weeks and then go from there.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg5qu9m", "score_hidden": false, "stickied": false, "created": 1492025637.0, "created_utc": 1491996837.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64wj5g", "likes": null, "replies": "", "user_reports": [], "id": "dg5v61y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jabberhakke", "parent_id": "t3_64wj5g", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "How are you trying to go about this so far? Are you trying to cut out snacking altogether, all at once? Will power is a limited resource. You'll get more and more of it if you practice it regularly, but you need to start out slowly. Here are my favorites of the tips I've found across many dieting/discipline resources. Some of them helped me a lot with a similar problem:  \n\nFirst of all, make it as easy as possible for yourself to do the right thing. Keeping healthy foods readily available, and distance yourself from junk food. Meal prepping helped me (check out /r/mealprepsunday). Perhaps you could do that for lunches/snacks. I bring things to work like salads, soups, wraps, fruit, greek yogurt, carrots &amp; hummus. I bring three or four things every day. I don't feel like I'm depriving myself because I do get to snack. Plus, it takes more effort to go buy junk food than to eat what I brought. I also have several flavors of tea available all the time, and chewing gum.   \n\nWhen you're starting out, take small steps. Perhaps choose one junk food to replace with one healthy food for a few weeks. Then start working on another one. Pick a replacement food that you enjoy eating, which might take a bit of trial and error. Junk foods usually have a ton of seasoning, especially salt. If you're used to that, other foods might taste bland at first. So, season them! Make them spicy, use lots of herbs, lemon, etc. Your tastes will also adjust. At least mine did. I used to drink several mtn dews a day, and when I tried some after years without it, it tasted absolutely disgusting to me.   \n\nSince willpower is a limited resource, do the best you can to make sure you aren't \"using up\" willpower on other things. Getting enough sleep is a big one. Staying hydrated is another big one. If you're uncomfortable, you're more likely to give into cravings. Try to pay attention to your cravings, and ask yourself what starts them in the first place. Do you want a cookie because you want a cookie? Or because you're tired? Or because you're bored? Or because you're stressed? Or because you're mad at someone? Instead of eating the cookie, can you address the underlying problem?    \n\nFinally, forgive yourself when you slip. Beating yourself up about it doesn't break the cycle. Junk foods, especially sugar, are literally addictive, their manufacturers are trying to get people addicted to them, and it's a difficult thing to tackle. So, show yourself some compassion for mishaps. Maybe also find some like-minded people who you can talk to to stay on track/get back on track. Is your family involved? Are they working for or against your goals? What about other people at your job?    \n\nHope this helps, and best of luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How are you trying to go about this so far? Are you trying to cut out snacking altogether, all at once? Will power is a limited resource. You&amp;#39;ll get more and more of it if you practice it regularly, but you need to start out slowly. Here are my favorites of the tips I&amp;#39;ve found across many dieting/discipline resources. Some of them helped me a lot with a similar problem:  &lt;/p&gt;\n\n&lt;p&gt;First of all, make it as easy as possible for yourself to do the right thing. Keeping healthy foods readily available, and distance yourself from junk food. Meal prepping helped me (check out &lt;a href=\"/r/mealprepsunday\"&gt;/r/mealprepsunday&lt;/a&gt;). Perhaps you could do that for lunches/snacks. I bring things to work like salads, soups, wraps, fruit, greek yogurt, carrots &amp;amp; hummus. I bring three or four things every day. I don&amp;#39;t feel like I&amp;#39;m depriving myself because I do get to snack. Plus, it takes more effort to go buy junk food than to eat what I brought. I also have several flavors of tea available all the time, and chewing gum.   &lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re starting out, take small steps. Perhaps choose one junk food to replace with one healthy food for a few weeks. Then start working on another one. Pick a replacement food that you enjoy eating, which might take a bit of trial and error. Junk foods usually have a ton of seasoning, especially salt. If you&amp;#39;re used to that, other foods might taste bland at first. So, season them! Make them spicy, use lots of herbs, lemon, etc. Your tastes will also adjust. At least mine did. I used to drink several mtn dews a day, and when I tried some after years without it, it tasted absolutely disgusting to me.   &lt;/p&gt;\n\n&lt;p&gt;Since willpower is a limited resource, do the best you can to make sure you aren&amp;#39;t &amp;quot;using up&amp;quot; willpower on other things. Getting enough sleep is a big one. Staying hydrated is another big one. If you&amp;#39;re uncomfortable, you&amp;#39;re more likely to give into cravings. Try to pay attention to your cravings, and ask yourself what starts them in the first place. Do you want a cookie because you want a cookie? Or because you&amp;#39;re tired? Or because you&amp;#39;re bored? Or because you&amp;#39;re stressed? Or because you&amp;#39;re mad at someone? Instead of eating the cookie, can you address the underlying problem?    &lt;/p&gt;\n\n&lt;p&gt;Finally, forgive yourself when you slip. Beating yourself up about it doesn&amp;#39;t break the cycle. Junk foods, especially sugar, are literally addictive, their manufacturers are trying to get people addicted to them, and it&amp;#39;s a difficult thing to tackle. So, show yourself some compassion for mishaps. Maybe also find some like-minded people who you can talk to to stay on track/get back on track. Is your family involved? Are they working for or against your goals? What about other people at your job?    &lt;/p&gt;\n\n&lt;p&gt;Hope this helps, and best of luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg5v61y", "score_hidden": false, "stickied": false, "created": 1492033075.0, "created_utc": 1492004275.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64wj5g", "likes": null, "replies": "", "user_reports": [], "id": "dg5ydsi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vegannazi", "parent_id": "t3_64wj5g", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Are you sleeping well? Sleep deprivation reduces leptin levels.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you sleeping well? Sleep deprivation reduces leptin levels.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg5ydsi", "score_hidden": false, "stickied": false, "created": 1492037069.0, "created_utc": 1492008269.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64wj5g", "likes": null, "replies": "", "user_reports": [], "id": "dg6ps4f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "m74407", "parent_id": "t3_64wj5g", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "IMO... the change you need is in your mindset and relationship with yourself. You need to address the core issue / restlessness / anxiety / whatever that you are using food to soothe", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IMO... the change you need is in your mindset and relationship with yourself. You need to address the core issue / restlessness / anxiety / whatever that you are using food to soothe&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg6ps4f", "score_hidden": false, "stickied": false, "created": 1492066663.0, "created_utc": 1492037863.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_64wj5g", "likes": null, "replies": "", "user_reports": [], "id": "dg76k7l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CaseySJ", "parent_id": "t3_64wj5g", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Couple thoughts that may help you:\n\n1) Try not to buy junk food. When you don't see it, you won't eat it. Start small - IMHO, cutting everything at once can be painful and too stressful. \n\n2) Drink plenty of water. Make sure it's near whenever you're working or watching TV. Drink it when you start feeling these cravings for junk food. \n\n3) Create a schedule when you eat normal (healthy) food: set up the time for breakfast, lunch, and dinner. Make sure you eat frequently, but smaller amount of food. It takes time but it worth it. As soon as this habit is formed, you'll feel much better. \n\n4) Organize some snacks - nuts, dried fruits or anything else that you like, but what's healthier. Make sure you have SMALL amount of these nearby, don't overeat. \n\nStart small, one change at a time, no hurry, no panic. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Couple thoughts that may help you:&lt;/p&gt;\n\n&lt;p&gt;1) Try not to buy junk food. When you don&amp;#39;t see it, you won&amp;#39;t eat it. Start small - IMHO, cutting everything at once can be painful and too stressful. &lt;/p&gt;\n\n&lt;p&gt;2) Drink plenty of water. Make sure it&amp;#39;s near whenever you&amp;#39;re working or watching TV. Drink it when you start feeling these cravings for junk food. &lt;/p&gt;\n\n&lt;p&gt;3) Create a schedule when you eat normal (healthy) food: set up the time for breakfast, lunch, and dinner. Make sure you eat frequently, but smaller amount of food. It takes time but it worth it. As soon as this habit is formed, you&amp;#39;ll feel much better. &lt;/p&gt;\n\n&lt;p&gt;4) Organize some snacks - nuts, dried fruits or anything else that you like, but what&amp;#39;s healthier. Make sure you have SMALL amount of these nearby, don&amp;#39;t overeat. &lt;/p&gt;\n\n&lt;p&gt;Start small, one change at a time, no hurry, no panic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg76k7l", "score_hidden": false, "stickied": false, "created": 1492088877.0, "created_utc": 1492060077.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]