[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Preface: I&amp;#39;m a web developer by day, and an aspiring entrepreneur with horrible habits and a laundry list of half-finished projects by night. This problem happens quite frequently, I feel like I could be (or should be) doing something better, in order to achieve what I want in life faster.&lt;/p&gt;\n\n&lt;p&gt;To start off, I&amp;#39;ll give you the most recent example. I came across the &amp;quot;Binging With Babish&amp;quot; videos on YouTube and saw what a sensation the guy is becoming, even checking out what he&amp;#39;s bringing in on Patreon. I thought to myself &amp;quot;Wow, I cook pretty well, have experience in film editing, and could probably promote myself in a similar fashion. But he&amp;#39;s already grabbed this niche, I wonder if there&amp;#39;s another way out there I could do something similar.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;That becomes my obsession&lt;/strong&gt;, and I can&amp;#39;t stand it. I spend hours, sometimes even days just thinking about what I could do to hit that level of success (monetary, attention, or otherwise). Ultimately one of two things usually happens, either I think of some half-assed idea and try to go all-in giving up on what I&amp;#39;m currently working on, or I eventually put it in the back of my mind and move past it while it consistently nags me that I should revisit the idea.&lt;/p&gt;\n\n&lt;p&gt;But this happens pretty often, be it YouTube &amp;#39;celebrities&amp;#39; that I come across, or reddit threads about people making it with website stores, or stories of simple start-ups hitting it big. &lt;strong&gt;It makes me want to put my ideas and projects that I&amp;#39;m working on right on the back burner and make whatever someone else is doing (or something similar) my main focus.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Preface: I'm a web developer by day, and an aspiring entrepreneur with horrible habits and a laundry list of half-finished projects by night. This problem happens quite frequently, I feel like I could be (or should be) doing something better, in order to achieve what I want in life faster.\n\nTo start off, I'll give you the most recent example. I came across the \"Binging With Babish\" videos on YouTube and saw what a sensation the guy is becoming, even checking out what he's bringing in on Patreon. I thought to myself \"Wow, I cook pretty well, have experience in film editing, and could probably promote myself in a similar fashion. But he's already grabbed this niche, I wonder if there's another way out there I could do something similar.\"\n\n**That becomes my obsession**, and I can't stand it. I spend hours, sometimes even days just thinking about what I could do to hit that level of success (monetary, attention, or otherwise). Ultimately one of two things usually happens, either I think of some half-assed idea and try to go all-in giving up on what I'm currently working on, or I eventually put it in the back of my mind and move past it while it consistently nags me that I should revisit the idea.\n\nBut this happens pretty often, be it YouTube 'celebrities' that I come across, or reddit threads about people making it with website stores, or stories of simple start-ups hitting it big. **It makes me want to put my ideas and projects that I'm working on right on the back burner and make whatever someone else is doing (or something similar) my main focus.**", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "650e5v", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "ten_cents_a_nickel", "saved": false, "mod_reports": [], "name": "t3_650e5v", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/650e5v/question_i_obsess_over_others_successes_how_can_i/", "num_reports": null, "locked": false, "stickied": false, "created": 1492054157.0, "url": "https://www.reddit.com/r/getdisciplined/comments/650e5v/question_i_obsess_over_others_successes_how_can_i/", "author_flair_text": null, "quarantine": false, "title": "[Question] I obsess over others' successes, how can I prevent this from taking up my time and distracting me from my goals?", "created_utc": 1492025357.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_650e5v", "likes": null, "replies": "", "user_reports": [], "id": "dg6m2ss", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "winwithzach", "parent_id": "t3_650e5v", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "That's something I've struggled with as well. What I've learned is to stop judging success based on others and focus on what I want success to look like for me. I don't know if that helps at all. A book that really helped me with this is the 7 Habits of Highly Effective People by Stephen Covey, specifically Habit 2.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s something I&amp;#39;ve struggled with as well. What I&amp;#39;ve learned is to stop judging success based on others and focus on what I want success to look like for me. I don&amp;#39;t know if that helps at all. A book that really helped me with this is the 7 Habits of Highly Effective People by Stephen Covey, specifically Habit 2.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg6m2ss", "score_hidden": false, "stickied": false, "created": 1492062107.0, "created_utc": 1492033307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_650e5v", "likes": null, "replies": "", "user_reports": [], "id": "dg6zpnl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CritterJones", "parent_id": "t3_650e5v", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Oh my goodness, yes.  I'm struggling with this and I'm sure many others on this subreddit are in the same boat.  I feel like it's such a common affliction in our goal-oriented society that if something's not a clear path to making money, fame, or any other culturally approved designator of \"success\", we think what's the point of doing it?  Corporations operate on the principle of growth, and our peers, parents, and colleagues often expect our lives to follow this same path.  But real life is so much more messy than that.  We as individuals hit road blocks and encounter fears and anxiety.  When we scrutinize our own lives, we feel stagnation must be an indicator of failure.\n\nI feel this way about my art.  When I post to social media it often feels like I'm throwing my work into the ether.  It's so easy to look on Instagram and find thousands of artists with a larger following than me.  And better work than mine.  It's so easy to scroll, admire their work, and think... Why am I even doing this?\n\nThe biggest thing you need to do right now is ALLOW YOURSELF A BREAK from social media.  Step away from it for a day, a week, however long you need.  Don't get on YouTube, don't get on Facebook.  That seems to be a big source of where the anxiety of comparison for you comes from, so the biggest way to staunch the hurt of anxiety is to step away from the source.  If you are anything like me, I feel a \"need\" to go on social media for \"research\", like I'll miss some key super important tip for my art to really take off.  This is a lie.\n\nAnother thing to keep in mind is that gaining fame and attention is entirely out of our control.  For me, attention is so alluring because in a way it's a replacement for self-esteem.  I don't need to tell myself I'm good enough, because other people can do it for me.  Although it's not up to me what people say about my work or if they follow it or care about it.  There are ways I can slowly increase a following, but nobody can possibly predict if something will go viral or hit it big. \n Concentrating on something you can't control is a guaranteed way to drive you crazy.\n\nI think it would also benefit you to journal or reflect.  What really makes you happy?  It's not entirely clear from what you've written here.  I see that entrepreneurship intrigues you, but what seems to intrigue you most about it is the benefits afterwards, not the actual process of creating a company or making an idea come to life.  Just some food for thought.  Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my goodness, yes.  I&amp;#39;m struggling with this and I&amp;#39;m sure many others on this subreddit are in the same boat.  I feel like it&amp;#39;s such a common affliction in our goal-oriented society that if something&amp;#39;s not a clear path to making money, fame, or any other culturally approved designator of &amp;quot;success&amp;quot;, we think what&amp;#39;s the point of doing it?  Corporations operate on the principle of growth, and our peers, parents, and colleagues often expect our lives to follow this same path.  But real life is so much more messy than that.  We as individuals hit road blocks and encounter fears and anxiety.  When we scrutinize our own lives, we feel stagnation must be an indicator of failure.&lt;/p&gt;\n\n&lt;p&gt;I feel this way about my art.  When I post to social media it often feels like I&amp;#39;m throwing my work into the ether.  It&amp;#39;s so easy to look on Instagram and find thousands of artists with a larger following than me.  And better work than mine.  It&amp;#39;s so easy to scroll, admire their work, and think... Why am I even doing this?&lt;/p&gt;\n\n&lt;p&gt;The biggest thing you need to do right now is ALLOW YOURSELF A BREAK from social media.  Step away from it for a day, a week, however long you need.  Don&amp;#39;t get on YouTube, don&amp;#39;t get on Facebook.  That seems to be a big source of where the anxiety of comparison for you comes from, so the biggest way to staunch the hurt of anxiety is to step away from the source.  If you are anything like me, I feel a &amp;quot;need&amp;quot; to go on social media for &amp;quot;research&amp;quot;, like I&amp;#39;ll miss some key super important tip for my art to really take off.  This is a lie.&lt;/p&gt;\n\n&lt;p&gt;Another thing to keep in mind is that gaining fame and attention is entirely out of our control.  For me, attention is so alluring because in a way it&amp;#39;s a replacement for self-esteem.  I don&amp;#39;t need to tell myself I&amp;#39;m good enough, because other people can do it for me.  Although it&amp;#39;s not up to me what people say about my work or if they follow it or care about it.  There are ways I can slowly increase a following, but nobody can possibly predict if something will go viral or hit it big. \n Concentrating on something you can&amp;#39;t control is a guaranteed way to drive you crazy.&lt;/p&gt;\n\n&lt;p&gt;I think it would also benefit you to journal or reflect.  What really makes you happy?  It&amp;#39;s not entirely clear from what you&amp;#39;ve written here.  I see that entrepreneurship intrigues you, but what seems to intrigue you most about it is the benefits afterwards, not the actual process of creating a company or making an idea come to life.  Just some food for thought.  Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg6zpnl", "score_hidden": false, "stickied": false, "created": 1492078885.0, "created_utc": 1492050085.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_650e5v", "likes": null, "replies": "", "user_reports": [], "id": "dg7nsx6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "keiwawa", "parent_id": "t3_650e5v", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Be fair to yourself, only compare your current self to your past self, and not others. Do your thing, whatever makes you feel accomplished. :) Success comes to those who does things and persevere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be fair to yourself, only compare your current self to your past self, and not others. Do your thing, whatever makes you feel accomplished. :) Success comes to those who does things and persevere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg7nsx6", "score_hidden": false, "stickied": false, "created": 1492124350.0, "created_utc": 1492095550.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_650e5v", "likes": null, "replies": "", "user_reports": [], "id": "dg7vebf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mr_Decipher", "parent_id": "t3_650e5v", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "\"I spend hours, sometimes even days just thinking about what I could do to hit that level of success (monetary, attention, or otherwise).\"\n\n- The reason for this is that you are focusing on the end result. The end result is what everyone admires but you don't know that person struggle and what it took for them to get there.\n\nAlso, you are trying to do what other people love and have a passion for. Find what you love and have a passion for. It might be a pain in the a** to complete and you will continually fail but you will eventually succeed because you love it.\n\nOne thing I have learnt is if you measure success by Money or Fame. Then you will never succeed. Measure success with something different like adding value to people lives. Or your happiness level from doing what you are passionate about.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I spend hours, sometimes even days just thinking about what I could do to hit that level of success (monetary, attention, or otherwise).&amp;quot;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The reason for this is that you are focusing on the end result. The end result is what everyone admires but you don&amp;#39;t know that person struggle and what it took for them to get there.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Also, you are trying to do what other people love and have a passion for. Find what you love and have a passion for. It might be a pain in the a** to complete and you will continually fail but you will eventually succeed because you love it.&lt;/p&gt;\n\n&lt;p&gt;One thing I have learnt is if you measure success by Money or Fame. Then you will never succeed. Measure success with something different like adding value to people lives. Or your happiness level from doing what you are passionate about.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg7vebf", "score_hidden": false, "stickied": false, "created": 1492132476.0, "created_utc": 1492103676.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]