[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;How do you get the motivation?&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Let me explain. If your ability to get work done is dependent on being in the right mood, then it will be sporadic, random, short-lived, messy and at constant risk of being junked in a tantrum when you&amp;#39;re feeling shitty and low.&lt;/p&gt;\n\n&lt;p&gt;Emotions are chaotic and fickle beasts. You don&amp;#39;t want your ability to work to be dependent on them. It just won&amp;#39;t work out too well.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll get stuck in the situation that, well, I presume you&amp;#39;re already in, if you&amp;#39;re asking this question in earnest from personal experience of struggling to be motivated. You&amp;#39;ve been there, so you know this already.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t wait until you&amp;#39;re in the right mood to do work. Just start doing the work anyway and you&amp;#39;ll put yourself in the right mood.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s an extension of the old advice on tackling &amp;quot;writer&amp;#39;s block&amp;quot;. You&amp;#39;ve probably heard it.&lt;/p&gt;\n\n&lt;p&gt;How do you cure writer&amp;#39;s block? You just start writing.&lt;/p&gt;\n\n&lt;p&gt;Write something. Anything. It doesn&amp;#39;t matter what. For example, describe a bus journey you were on. Describe the people on the bus. Come up with some imaginary back stories for these people. Invent a story of where they&amp;#39;re going and why.&lt;/p&gt;\n\n&lt;p&gt;Yes. Purely mechanical. You&amp;#39;re not in the mood for this. But do it anyway.&lt;/p&gt;\n\n&lt;p&gt;And you&amp;#39;ll find that what I&amp;#39;m saying comes true. Don&amp;#39;t wait to be in the right mood to do the work. Just do the work and you&amp;#39;ll find yourself getting into the right mood as you go along.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t put the cart in front of the horses. Put the cart behind the horses and let those horses pull the cart forward.&lt;/p&gt;\n\n&lt;p&gt;In practice, this means that you should schedule doing daily work. Start modestly with an hour a day. Pick a time - say, 3pm - and then from 3pm to 4pm, you&amp;#39;re doing work.&lt;/p&gt;\n\n&lt;p&gt;No matter your mood. No matter how you&amp;#39;re feeling. From 3pm to 4pm is &amp;quot;work hour&amp;quot;. Indeed, as this is ruled by the clock and not by how you feel, then you&amp;#39;ll find yourself in all manner of different random moods when &amp;quot;work hour&amp;quot; begins.&lt;/p&gt;\n\n&lt;p&gt;Good. You&amp;#39;re learning how to get started on work, regardless of your mood and motivation. Keep doing this until you&amp;#39;ve formed this &amp;quot;good habit&amp;quot; of just getting things done regardless.&lt;/p&gt;\n\n&lt;p&gt;I probably don&amp;#39;t even need to tell you to gradually expand that &amp;quot;work hour&amp;quot; from one hour to longer amounts of time. It&amp;#39;ll happen anyway.&lt;/p&gt;\n\n&lt;p&gt;Because, as I say, what you&amp;#39;ll discover from following this is, like I said, you&amp;#39;re not waiting to be in the right mood to work. You&amp;#39;re working and then you&amp;#39;ll find your mood will change to be the right mood.&lt;/p&gt;\n\n&lt;p&gt;The work itself will put you in the mood. You&amp;#39;ll be following your &amp;quot;work hour&amp;quot; daily routine and then you will look up one day and realise that, carried away in what you were doing, you ended up doing three or four hours.&lt;/p&gt;\n\n&lt;p&gt;To quote the philosopher Aristotle: &amp;quot;We are what we repeatedly do; Excellence, therefore, is not an act but a habit&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;We are what we repeatedly do. So choose what you want to be and then just keep repeatedly doing it until - oh, look - you&amp;#39;ve become it. Because you&amp;#39;re the guy who knocks out the work every single day, come hell or high water.&lt;/p&gt;\n\n&lt;p&gt;So the open secret of how you get the motivation to keep working is that you don&amp;#39;t. You rather keep working regardless and then that becomes your motivation.&lt;/p&gt;\n\n&lt;p&gt;Practical tricks to help you achieve this include:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;The calendar method. Get a calendar and mark an &amp;quot;x&amp;quot; on it for a successful day of work. Once you&amp;#39;ve got a good chain of &amp;quot;x&amp;quot; along the calendar then just don&amp;#39;t break that chain.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Book an appointment with your work. Yes, schedule a meeting with your work. Put it in your dairy like any other meeting or appointment, and keep to it exactly as you would keep to an appointment with the doctor or a business meeting or whatever. You&amp;#39;re having a &amp;quot;meeting&amp;quot; with your work to &amp;quot;discuss&amp;quot; with it how to move your project forward.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Folks who do regular exercise - like running - will understand the concept of not waiting until you feel like it, but doing it anyway and then finding that you feel like it.&lt;/p&gt;\n\n&lt;p&gt;No-one initially wants to go running. Doesn&amp;#39;t happen. But the point is that if you push yourself to go running those first few times, then what you&amp;#39;ll find is that it lifts your spirits. It puts you in a better mood. The achievement of doing it motivates you to want to keep going.&lt;/p&gt;\n\n&lt;p&gt;As it becomes habitual to go running regularly, then you&amp;#39;ll actually start having the urge - the craving - to go running. You don&amp;#39;t have to find the motivation, as you&amp;#39;ve got it already. And so forth.&lt;/p&gt;\n\n&lt;p&gt;But if you just sit there on the couch, waiting for that moment when you feel you&amp;#39;re &amp;quot;in the right mood&amp;quot; to go running, then you&amp;#39;ll likely be sitting there forever.&lt;/p&gt;\n\n&lt;p&gt;Note that this also explains how folks tend not to have any great problems being motivated to do their day job. Because, well, it just doesn&amp;#39;t come into it.&lt;/p&gt;\n\n&lt;p&gt;Your job starts at 9am. Regardless of whether you feel like it or not. You&amp;#39;ve got a meeting at 12pm. You have no choice about attending.&lt;/p&gt;\n\n&lt;p&gt;You get the gist. Your average day job is, in fact, naturally structured how I&amp;#39;m suggesting it ought to be. &lt;/p&gt;\n\n&lt;p&gt;And we, indeed, don&amp;#39;t see shop keepers who only open their shops when they&amp;#39;re &amp;quot;in the right mood&amp;quot;. No, they open their shop every day, at the regular hours, and the crucial point I&amp;#39;m getting at here is that, by doing so, they&amp;#39;ll put themselves &amp;quot;in the right mood&amp;quot; for shop keeping.&lt;/p&gt;\n\n&lt;p&gt;I guess another way to look at it is inertia and momentum.&lt;/p&gt;\n\n&lt;p&gt;When something&amp;#39;s not moving and you try to push it into movement, you&amp;#39;ll have inertia. It&amp;#39;ll initially resist moving.&lt;/p&gt;\n\n&lt;p&gt;But when something&amp;#39;s already moving, then it&amp;#39;ll have momentum. It&amp;#39;ll want to keep moving of its own accord.&lt;/p&gt;\n\n&lt;p&gt;Yes, you initially have to fight that inertia. Just do the work regardless and you might well not remotely feel like it to begin with. But once you&amp;#39;ve got going, you&amp;#39;ll have momentum. You&amp;#39;ll be in the mood, you&amp;#39;ll be going places, you&amp;#39;ll have your achievements to motivate you further. Indeed, once you&amp;#39;ve got a good dose of momentum on your side, then you&amp;#39;ll increasingly have the reverse problem - how do I slow myself down?&lt;/p&gt;\n\n&lt;p&gt;Well, this unintentional essay has gone on long enough. You, no doubt, get the gist of what I&amp;#39;m getting at here and, hopefully, it&amp;#39;ll help you through your motivation problems.&lt;/p&gt;\n\n&lt;p&gt;The trick is realising that, no, you don&amp;#39;t wait for the motivation to come to you. You create the motivation out of the very work you&amp;#39;re doing.&lt;/p&gt;\n\n&lt;p&gt;So just do it and keep doing it.&lt;/p&gt;\n\n&lt;p&gt;(One last quote: &amp;quot;Failure is not falling down. Failure is staying down&amp;quot;.)﻿&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;by &lt;a href=\"https://www.youtube.com/user/KlaxonCow\"&gt;https://www.youtube.com/user/KlaxonCow&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "How do you get the motivation?\n\nYou don't.\n\nLet me explain. If your ability to get work done is dependent on being in the right mood, then it will be sporadic, random, short-lived, messy and at constant risk of being junked in a tantrum when you're feeling shitty and low.\n\nEmotions are chaotic and fickle beasts. You don't want your ability to work to be dependent on them. It just won't work out too well.\n\nYou'll get stuck in the situation that, well, I presume you're already in, if you're asking this question in earnest from personal experience of struggling to be motivated. You've been there, so you know this already.\n\nDon't wait until you're in the right mood to do work. Just start doing the work anyway and you'll put yourself in the right mood.\n\nThat's an extension of the old advice on tackling \"writer's block\". You've probably heard it.\n\nHow do you cure writer's block? You just start writing.\n\nWrite something. Anything. It doesn't matter what. For example, describe a bus journey you were on. Describe the people on the bus. Come up with some imaginary back stories for these people. Invent a story of where they're going and why.\n\nYes. Purely mechanical. You're not in the mood for this. But do it anyway.\n\nAnd you'll find that what I'm saying comes true. Don't wait to be in the right mood to do the work. Just do the work and you'll find yourself getting into the right mood as you go along.\n\nDon't put the cart in front of the horses. Put the cart behind the horses and let those horses pull the cart forward.\n\nIn practice, this means that you should schedule doing daily work. Start modestly with an hour a day. Pick a time - say, 3pm - and then from 3pm to 4pm, you're doing work.\n\nNo matter your mood. No matter how you're feeling. From 3pm to 4pm is \"work hour\". Indeed, as this is ruled by the clock and not by how you feel, then you'll find yourself in all manner of different random moods when \"work hour\" begins.\n\nGood. You're learning how to get started on work, regardless of your mood and motivation. Keep doing this until you've formed this \"good habit\" of just getting things done regardless.\n\nI probably don't even need to tell you to gradually expand that \"work hour\" from one hour to longer amounts of time. It'll happen anyway.\n\nBecause, as I say, what you'll discover from following this is, like I said, you're not waiting to be in the right mood to work. You're working and then you'll find your mood will change to be the right mood.\n\nThe work itself will put you in the mood. You'll be following your \"work hour\" daily routine and then you will look up one day and realise that, carried away in what you were doing, you ended up doing three or four hours.\n\nTo quote the philosopher Aristotle: \"We are what we repeatedly do; Excellence, therefore, is not an act but a habit\".\n\nWe are what we repeatedly do. So choose what you want to be and then just keep repeatedly doing it until - oh, look - you've become it. Because you're the guy who knocks out the work every single day, come hell or high water.\n\nSo the open secret of how you get the motivation to keep working is that you don't. You rather keep working regardless and then that becomes your motivation.\n\nPractical tricks to help you achieve this include:\n\n1. The calendar method. Get a calendar and mark an \"x\" on it for a successful day of work. Once you've got a good chain of \"x\" along the calendar then just don't break that chain.\n\n2. Book an appointment with your work. Yes, schedule a meeting with your work. Put it in your dairy like any other meeting or appointment, and keep to it exactly as you would keep to an appointment with the doctor or a business meeting or whatever. You're having a \"meeting\" with your work to \"discuss\" with it how to move your project forward.\n\nFolks who do regular exercise - like running - will understand the concept of not waiting until you feel like it, but doing it anyway and then finding that you feel like it.\n\nNo-one initially wants to go running. Doesn't happen. But the point is that if you push yourself to go running those first few times, then what you'll find is that it lifts your spirits. It puts you in a better mood. The achievement of doing it motivates you to want to keep going.\n\nAs it becomes habitual to go running regularly, then you'll actually start having the urge - the craving - to go running. You don't have to find the motivation, as you've got it already. And so forth.\n\nBut if you just sit there on the couch, waiting for that moment when you feel you're \"in the right mood\" to go running, then you'll likely be sitting there forever.\n\nNote that this also explains how folks tend not to have any great problems being motivated to do their day job. Because, well, it just doesn't come into it.\n\nYour job starts at 9am. Regardless of whether you feel like it or not. You've got a meeting at 12pm. You have no choice about attending.\n\nYou get the gist. Your average day job is, in fact, naturally structured how I'm suggesting it ought to be. \n\nAnd we, indeed, don't see shop keepers who only open their shops when they're \"in the right mood\". No, they open their shop every day, at the regular hours, and the crucial point I'm getting at here is that, by doing so, they'll put themselves \"in the right mood\" for shop keeping.\n\nI guess another way to look at it is inertia and momentum.\n\nWhen something's not moving and you try to push it into movement, you'll have inertia. It'll initially resist moving.\n\nBut when something's already moving, then it'll have momentum. It'll want to keep moving of its own accord.\n\nYes, you initially have to fight that inertia. Just do the work regardless and you might well not remotely feel like it to begin with. But once you've got going, you'll have momentum. You'll be in the mood, you'll be going places, you'll have your achievements to motivate you further. Indeed, once you've got a good dose of momentum on your side, then you'll increasingly have the reverse problem - how do I slow myself down?\n\nWell, this unintentional essay has gone on long enough. You, no doubt, get the gist of what I'm getting at here and, hopefully, it'll help you through your motivation problems.\n\nThe trick is realising that, no, you don't wait for the motivation to come to you. You create the motivation out of the very work you're doing.\n\nSo just do it and keep doing it.\n\n(One last quote: \"Failure is not falling down. Failure is staying down\".)﻿\n\n---\n\nby https://www.youtube.com/user/KlaxonCow", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "654znh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "JamieVardyOnFire", "saved": false, "mod_reports": [], "name": "t3_654znh", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/654znh/advice_found_this_in_youtube_comments/", "num_reports": null, "locked": false, "stickied": false, "created": 1492113284.0, "url": "https://www.reddit.com/r/getdisciplined/comments/654znh/advice_found_this_in_youtube_comments/", "author_flair_text": null, "quarantine": false, "title": "[Advice] Found this in Youtube comments..", "created_utc": 1492084484.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_654znh", "likes": null, "replies": "", "user_reports": [], "id": "dg7rff2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "potatowithglasses", "parent_id": "t3_654znh", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I always find myself struggling to work bc I'm not \"in the right mood.\" Especially over the last few days. This is really helpful advice. Thank you for sharing!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always find myself struggling to work bc I&amp;#39;m not &amp;quot;in the right mood.&amp;quot; Especially over the last few days. This is really helpful advice. Thank you for sharing!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg7rff2", "score_hidden": false, "stickied": false, "created": 1492128254.0, "created_utc": 1492099454.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]