[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a UK student with big exams coming up in 2.5 weeks, and I really should have been working hard throughout the year, but I&amp;#39;ve been slacking due to laziness and procrastination. Even over the past 1-2 weeks, I&amp;#39;ve been trying to come to the campus library (on my own) to get some productive work done, but most days I get about 2 hours of work for the 10 hours I spend there - considering by this stage I need to be doing 6-7 hours of work daily.&lt;/p&gt;\n\n&lt;p&gt;This is hugely affecting my life as I actually feel stressed about everything, to the point that both my physical and mental health are being affected quite a lot, but I keep distracting myself and procrastinating, and finding any excuse not to do any work.&lt;/p&gt;\n\n&lt;p&gt;Another huge issue I have is that I&amp;#39;m pretty sure I have a full-on addiction to my phone. I find myself scrolling past the same Facebook/Instagram posts for really long periods of time - and even though nothing has changed on the feeds I can&amp;#39;t put my phone down and start working.&lt;/p&gt;\n\n&lt;p&gt;If I fail these exams there is a chance I&amp;#39;ll be kicked out of uni - and in my 2nd year of a 6 year course, I really don&amp;#39;t even want the smallest possibility of that happening.&lt;/p&gt;\n\n&lt;p&gt;If someone, anyone, has any advice to help me, to get me back on track ASAP, I&amp;#39;d really appreciate it - I&amp;#39;ll try anything at this stage.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a UK student with big exams coming up in 2.5 weeks, and I really should have been working hard throughout the year, but I've been slacking due to laziness and procrastination. Even over the past 1-2 weeks, I've been trying to come to the campus library (on my own) to get some productive work done, but most days I get about 2 hours of work for the 10 hours I spend there - considering by this stage I need to be doing 6-7 hours of work daily.\n\nThis is hugely affecting my life as I actually feel stressed about everything, to the point that both my physical and mental health are being affected quite a lot, but I keep distracting myself and procrastinating, and finding any excuse not to do any work.\n\nAnother huge issue I have is that I'm pretty sure I have a full-on addiction to my phone. I find myself scrolling past the same Facebook/Instagram posts for really long periods of time - and even though nothing has changed on the feeds I can't put my phone down and start working.\n\nIf I fail these exams there is a chance I'll be kicked out of uni - and in my 2nd year of a 6 year course, I really don't even want the smallest possibility of that happening.\n\nIf someone, anyone, has any advice to help me, to get me back on track ASAP, I'd really appreciate it - I'll try anything at this stage.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6580a3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "nnssns", "saved": false, "mod_reports": [], "name": "t3_6580a3", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/6580a3/needadvice_need_urgent_help_cant_get_studying_at/", "num_reports": null, "locked": false, "stickied": false, "created": 1492143398.0, "url": "https://www.reddit.com/r/getdisciplined/comments/6580a3/needadvice_need_urgent_help_cant_get_studying_at/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] Need urgent help... can't get studying at all", "created_utc": 1492114598.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_6580a3", "likes": null, "replies": "", "user_reports": [], "id": "dg8bc9i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "habits4life", "parent_id": "t3_6580a3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Do you have any friends who can be your study buddy? Hand them your phone, sit at desks near each other, maybe even make an explicit pact to work and not procrastinate?\n\nCan you leave your phone home when you go to the library?\n\nBesides that, work on strengthening your intent. When you leave home, stop and specifically review what you're going to do when you get there: you're going to find a desk, and start working.\n\nWhen you get to the library, review what you're about to do: you're going to find a desk, open your books, not get distracted, and study for 30 minutes.\n\nWhen you find a desk, remind yourself what you're about to do next: sit down and study.\n\nWhen you get up from a break, make a plan: you're going to go to the restroom, go by the water fountain and have a drink, walk around the perimeter of the floor to stretch your legs, then return and sit down and continue studying.\n\nEtc.\n\nOnward!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have any friends who can be your study buddy? Hand them your phone, sit at desks near each other, maybe even make an explicit pact to work and not procrastinate?&lt;/p&gt;\n\n&lt;p&gt;Can you leave your phone home when you go to the library?&lt;/p&gt;\n\n&lt;p&gt;Besides that, work on strengthening your intent. When you leave home, stop and specifically review what you&amp;#39;re going to do when you get there: you&amp;#39;re going to find a desk, and start working.&lt;/p&gt;\n\n&lt;p&gt;When you get to the library, review what you&amp;#39;re about to do: you&amp;#39;re going to find a desk, open your books, not get distracted, and study for 30 minutes.&lt;/p&gt;\n\n&lt;p&gt;When you find a desk, remind yourself what you&amp;#39;re about to do next: sit down and study.&lt;/p&gt;\n\n&lt;p&gt;When you get up from a break, make a plan: you&amp;#39;re going to go to the restroom, go by the water fountain and have a drink, walk around the perimeter of the floor to stretch your legs, then return and sit down and continue studying.&lt;/p&gt;\n\n&lt;p&gt;Etc.&lt;/p&gt;\n\n&lt;p&gt;Onward!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg8bc9i", "score_hidden": false, "stickied": false, "created": 1492150298.0, "created_utc": 1492121498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]