[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It sounds stupidly simple, doesn&amp;#39;t it? Because that&amp;#39;s how I perceive it, too. That I should just be able to wake up in the morning and say &lt;strong&gt;&amp;quot;Alright, proftables, you need to work on these things today and that other thing finished up.&amp;quot;&lt;/strong&gt;, and then just start doing what I need to do. It doesn&amp;#39;t work that way though.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s basically what the root of my procrastination and discipline problem boils down to, is I just don&amp;#39;t do what I need to do. I know that I need to get started on work for one of my clients, so that I can put out a well-organized and functional end-product that I can be proud of. And I know that I need to do the dishes in the sink and clean up around the house. &lt;strong&gt;Those are two things that can be accomplished in my day, yet it&amp;#39;ll be a miracle if they do.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Why? I have no idea other than &lt;strong&gt;I just love putting things off&lt;/strong&gt;. I love being distracted from what I have to do. My mind instead starts reeling about things like, &amp;quot;Hey, let&amp;#39;s not work. Instead, let&amp;#39;s think about that personal project you want to do. Yeah, it&amp;#39;s a great idea and you should get it done as soon as possible. But wait, what about that &lt;em&gt;other&lt;/em&gt; idea you had for a project, that one is pretty good to. Hey, it&amp;#39;s been a couple of hours, you should get started on your work. Oh, but we have to leave in like 30 minutes to run an errand, no use in starting now. Let&amp;#39;s wait until later. Hey, are you &lt;em&gt;sure&lt;/em&gt; that what you&amp;#39;re doing right now is what you should be doing?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;No exaggeration, that&amp;#39;s basically my thoughts throughout the day. Then suddenly it&amp;#39;s getting late so I either decide to do the dishes and clean up, or throw together some half-assed feature on the client project and figure out an excuse that I can use for tomorrow to explain why it&amp;#39;s not done yet.&lt;/p&gt;\n\n&lt;p&gt;I guess to summarize this whole rant, &lt;strong&gt;I constantly feel like I&amp;#39;m being pulled away from what I need to be doing, and constantly self-doubt my decisions and goals for what I want to do.&lt;/strong&gt; I end up flip-flopping on hobbies and side projects all the time, and never end up fully finishing something I&amp;#39;m proud of for work or home. I just want to be able to tell myself &amp;quot;I&amp;#39;m going to do this today&amp;quot; and then when it comes time to do that, I&amp;#39;m able to push the negative thoughts out, the self-doubt, and confidently get it done.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It sounds stupidly simple, doesn't it? Because that's how I perceive it, too. That I should just be able to wake up in the morning and say **\"Alright, proftables, you need to work on these things today and that other thing finished up.\"**, and then just start doing what I need to do. It doesn't work that way though.\n\nThat's basically what the root of my procrastination and discipline problem boils down to, is I just don't do what I need to do. I know that I need to get started on work for one of my clients, so that I can put out a well-organized and functional end-product that I can be proud of. And I know that I need to do the dishes in the sink and clean up around the house. **Those are two things that can be accomplished in my day, yet it'll be a miracle if they do.**\n\nWhy? I have no idea other than **I just love putting things off**. I love being distracted from what I have to do. My mind instead starts reeling about things like, \"Hey, let's not work. Instead, let's think about that personal project you want to do. Yeah, it's a great idea and you should get it done as soon as possible. But wait, what about that *other* idea you had for a project, that one is pretty good to. Hey, it's been a couple of hours, you should get started on your work. Oh, but we have to leave in like 30 minutes to run an errand, no use in starting now. Let's wait until later. Hey, are you *sure* that what you're doing right now is what you should be doing?\"\n\nNo exaggeration, that's basically my thoughts throughout the day. Then suddenly it's getting late so I either decide to do the dishes and clean up, or throw together some half-assed feature on the client project and figure out an excuse that I can use for tomorrow to explain why it's not done yet.\n\nI guess to summarize this whole rant, **I constantly feel like I'm being pulled away from what I need to be doing, and constantly self-doubt my decisions and goals for what I want to do.** I end up flip-flopping on hobbies and side projects all the time, and never end up fully finishing something I'm proud of for work or home. I just want to be able to tell myself \"I'm going to do this today\" and then when it comes time to do that, I'm able to push the negative thoughts out, the self-doubt, and confidently get it done.\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65dp66", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 35, "report_reasons": null, "author": "ProfTables", "saved": false, "mod_reports": [], "name": "t3_65dp66", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65dp66/needadvice_i_want_to_become_someone_who_says/", "num_reports": null, "locked": false, "stickied": false, "created": 1492217788.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65dp66/needadvice_i_want_to_become_someone_who_says/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] I want to become someone who says \"Today I need to do X, Y, and Z\" and then actually do X, Y, and Z.", "created_utc": 1492188988.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 35}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dp66", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dp66", "likes": null, "replies": "", "user_reports": [], "id": "dga6wah", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EnigmaticMentat", "parent_id": "t1_dg9u8yk", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I love this perspective! Than you so much for this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this perspective! Than you so much for this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dga6wah", "score_hidden": false, "stickied": false, "created": 1492254046.0, "created_utc": 1492225246.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9u8yk", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "FancyFish", "parent_id": "t3_65dp66", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I had (and still have) this problem too.\n\nSomething that helped me was reframing my thoughts. Instead of 'needing' to do X, Y and Z, try saying I 'want' to do X, Y, and Z. It goes from \"I need to implement that new feature\" to \"I want to deliver a great product.\"\n\nIt also helps because needing to do something makes it all or nothing. Either you get everything done, or you're worthless and you might as well have done nothing. When you want to do it, you have more flexibility in what you actually accomplish. I can count on one hand the amount of times that I properly estimated how long a new task would take. So, I'd lose an entire day without checking anything of my list. But I still was doing things that I wanted.\n\nThis is a bit of a shift in perspective, so think of it this way: you don't \"need\" to do anything. You could spend your entire day in bed every day if you wanted to. So everything beyond that is driven by a want. A want for food, company, comfort or success. Once life isn't happening to you, it's easier to start the unpleasant stuff. Hope this helps!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had (and still have) this problem too.&lt;/p&gt;\n\n&lt;p&gt;Something that helped me was reframing my thoughts. Instead of &amp;#39;needing&amp;#39; to do X, Y and Z, try saying I &amp;#39;want&amp;#39; to do X, Y, and Z. It goes from &amp;quot;I need to implement that new feature&amp;quot; to &amp;quot;I want to deliver a great product.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It also helps because needing to do something makes it all or nothing. Either you get everything done, or you&amp;#39;re worthless and you might as well have done nothing. When you want to do it, you have more flexibility in what you actually accomplish. I can count on one hand the amount of times that I properly estimated how long a new task would take. So, I&amp;#39;d lose an entire day without checking anything of my list. But I still was doing things that I wanted.&lt;/p&gt;\n\n&lt;p&gt;This is a bit of a shift in perspective, so think of it this way: you don&amp;#39;t &amp;quot;need&amp;quot; to do anything. You could spend your entire day in bed every day if you wanted to. So everything beyond that is driven by a want. A want for food, company, comfort or success. Once life isn&amp;#39;t happening to you, it&amp;#39;s easier to start the unpleasant stuff. Hope this helps!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg9u8yk", "score_hidden": false, "stickied": false, "created": 1492236786.0, "created_utc": 1492207986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dp66", "likes": null, "replies": "", "user_reports": [], "id": "dg9kr30", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Breannam611", "parent_id": "t3_65dp66", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Consider writing down any of the thoughts that distract you as you start on what you want to do. I tend to have a pad of paper near me so I can write down those weird thoughts so they don't distract me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider writing down any of the thoughts that distract you as you start on what you want to do. I tend to have a pad of paper near me so I can write down those weird thoughts so they don&amp;#39;t distract me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg9kr30", "score_hidden": false, "stickied": false, "created": 1492225063.0, "created_utc": 1492196263.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dp66", "likes": null, "replies": "", "user_reports": [], "id": "dgapgqz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "threwitoverthefence", "parent_id": "t3_65dp66", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "After 20+ years of reading self-help books (and then r/getdisciplined, which I still browse for fun), for me, the one thing that finally increased my productivity was a decision I made to completely, lovingly accept myself.  Total acceptance of anything I did or felt, especially when I started feeling myself saying, \"Oh you should've done this,\" \"You shouldn't have done that,\" or \"You should be doing this right now.\" This may or may not relate to your own issues, but self-doubt and an inability to make decisions seems to often stem from a lack of self-love.  Just throwing this possibility out there. Maybe try this method for a little while and see what happens:  no negativity allowed, especially about yourself.  No more scolding yourself time and time again. Of course, those thoughts will start to happen, but you can catch them happening, and then it is up to you to stop the negative thought. Can you do this? \n\nYou may think - well if I do that, if I'm so totally forgiving of myself, won't I just do more bad things?  All I can say is that's not what happened to me, not at all. I can guess many reasons for why that is, but I won't go into those theories.\n\nRemember, it takes years to build the neural pathways in our brains that lead to automatic negative thinking and ultimately, depression and anxiety.  It may take a year or so of complete compassion for yourself to rebuild those pathways into healthier ones. But when you do, life starts to feel like a fun, almost limitless game again. Or that's just what I've found.  That doesn't mean you won't have troughs -- they will just be fewer and farther between, and won't go nearly as deep.  Just one person's experience.\n\nEDIT:\n\nI haven't used my throwaway account in ages, but if you look at my post history you'll see that over a year ago I was exactly in your shoes.  Exactly.  This new practice really did change things for me significantly enough over the course of a year or so that I am willing to put it out there as one of those rare things that actually improved someone's quality of life.  I feel like I've been thriving for a while now, for the first time in years, all because I started being completely forgiving of myself.  \n\nAlso, I wanted to clarify something:  when I say more productive... I am earning close to six figures by doing about 5 hours of good work/day.  Before radical self-acceptance, I thought I need to work 12 hours a day -- and I'd be lucky to work 2.  5 hours a day, and yet the people in my organization are so supportive of and impressed by (not to pat myself on the back, just to explain) the work I do, and my enthusiasm for it.  The enthusiasm and quality of the work stems from the fact that it is no longer forced. I am doing what I want to do for as long as my brain wants to do it.  Then I congratulate my brain and give it as much time off as it wants. Guilt-free. It seems to work.", "edited": 1492268364.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After 20+ years of reading self-help books (and then &lt;a href=\"/r/getdisciplined\"&gt;r/getdisciplined&lt;/a&gt;, which I still browse for fun), for me, the one thing that finally increased my productivity was a decision I made to completely, lovingly accept myself.  Total acceptance of anything I did or felt, especially when I started feeling myself saying, &amp;quot;Oh you should&amp;#39;ve done this,&amp;quot; &amp;quot;You shouldn&amp;#39;t have done that,&amp;quot; or &amp;quot;You should be doing this right now.&amp;quot; This may or may not relate to your own issues, but self-doubt and an inability to make decisions seems to often stem from a lack of self-love.  Just throwing this possibility out there. Maybe try this method for a little while and see what happens:  no negativity allowed, especially about yourself.  No more scolding yourself time and time again. Of course, those thoughts will start to happen, but you can catch them happening, and then it is up to you to stop the negative thought. Can you do this? &lt;/p&gt;\n\n&lt;p&gt;You may think - well if I do that, if I&amp;#39;m so totally forgiving of myself, won&amp;#39;t I just do more bad things?  All I can say is that&amp;#39;s not what happened to me, not at all. I can guess many reasons for why that is, but I won&amp;#39;t go into those theories.&lt;/p&gt;\n\n&lt;p&gt;Remember, it takes years to build the neural pathways in our brains that lead to automatic negative thinking and ultimately, depression and anxiety.  It may take a year or so of complete compassion for yourself to rebuild those pathways into healthier ones. But when you do, life starts to feel like a fun, almost limitless game again. Or that&amp;#39;s just what I&amp;#39;ve found.  That doesn&amp;#39;t mean you won&amp;#39;t have troughs -- they will just be fewer and farther between, and won&amp;#39;t go nearly as deep.  Just one person&amp;#39;s experience.&lt;/p&gt;\n\n&lt;p&gt;EDIT:&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t used my throwaway account in ages, but if you look at my post history you&amp;#39;ll see that over a year ago I was exactly in your shoes.  Exactly.  This new practice really did change things for me significantly enough over the course of a year or so that I am willing to put it out there as one of those rare things that actually improved someone&amp;#39;s quality of life.  I feel like I&amp;#39;ve been thriving for a while now, for the first time in years, all because I started being completely forgiving of myself.  &lt;/p&gt;\n\n&lt;p&gt;Also, I wanted to clarify something:  when I say more productive... I am earning close to six figures by doing about 5 hours of good work/day.  Before radical self-acceptance, I thought I need to work 12 hours a day -- and I&amp;#39;d be lucky to work 2.  5 hours a day, and yet the people in my organization are so supportive of and impressed by (not to pat myself on the back, just to explain) the work I do, and my enthusiasm for it.  The enthusiasm and quality of the work stems from the fact that it is no longer forced. I am doing what I want to do for as long as my brain wants to do it.  Then I congratulate my brain and give it as much time off as it wants. Guilt-free. It seems to work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgapgqz", "score_hidden": false, "stickied": false, "created": 1492295856.0, "created_utc": 1492267056.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dp66", "likes": null, "replies": "", "user_reports": [], "id": "dgahr4z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaivalagiclare", "parent_id": "t3_65dp66", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Are you breaking down those projects into little steps? That can help you to get started. \n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you breaking down those projects into little steps? That can help you to get started. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgahr4z", "score_hidden": false, "stickied": false, "created": 1492277724.0, "created_utc": 1492248924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]