[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello, noble men and women of discipline! Recently I was developing an idea which seems very promising to me, but I want to know opinions of others, whether you think this can be useful.&lt;/p&gt;\n\n&lt;p&gt;(disclaimer: religious people might not like my post.)&lt;/p&gt;\n\n&lt;p&gt;My problem was always lack of internal support. The thing is I used to think very deeply about questions of existance, and it led to two results: 1) I realized life is much more harsh than we&amp;#39;d want it to be, 2) I realized there was no god and our universe is 100% matter.&lt;/p&gt;\n\n&lt;p&gt;You see, people tend to stick to religions and supernatural beliefs for support. That&amp;#39;s proven that there&amp;#39;s a special neural center in our brains which is responsible for those kinds of feeling. It helps some, but I can&amp;#39;t do it. I felt powerless when I thought about my life as futile in a non-caring universe. Needless to say, I couldn&amp;#39;t even start to get really disciplined. I procrastinated, I felt anxious and I was never really calm.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when I realized I needed something inside me, some mental, or dare I say spiritual skeleton to build upon. The trick is, I couldn&amp;#39;t retreat to established religions and paradigms, because I fully agree with none of them, and totally disagree with many of them. I love myths and symbols, because they&amp;#39;re inspiring and there&amp;#39;s beauty in them, but I can&amp;#39;t accept a religion, a new age fluffy spiritual movement or anything like that because I have a critical mind and I scrutinize them and I can&amp;#39;t accept them.&lt;/p&gt;\n\n&lt;p&gt;So I thought: &amp;quot;I should try and create a whole paradigm of principles of life, scrutinize and develop it thoroughly, add symbolism to it and make it my spiritual (or, if you don&amp;#39;t like the term, mental) path and fundament.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;What I did was taking my already developed perception of life and universe, formulate it and write it down. Then I worked on it and formed principles to stick to (this is all a work in progress though). And I&amp;#39;m posting it here because getting disciplined is one of the core points in my paradigm (it also takes some from stoicism, some from buddhism, some from taoism, and many other things, some of them borrowed, most of them original). Basically, I did it because I wanted to improve my discipline and life.&lt;/p&gt;\n\n&lt;p&gt;And you know what, it works wonders! I feel inspired because of it. I finally could do what I couldn&amp;#39;t do before. I can now do things I procrastinated from before, simply out of thinking about following my newfound/newcreated path. I feel my anxiety decrease and my discipline level up. What I&amp;#39;m doing, I think, is tricking my brain into activating spiritual wires without actually believing in false concepts. I just took bare truths, coated them as spiritual path, and here you go.&lt;/p&gt;\n\n&lt;p&gt;So, now I have some questions and I need certain advice.&lt;/p&gt;\n\n&lt;p&gt;1) Do you generally think this is a good idea? Or is this hypocrisy not worthy of continuing? Did anyone of you do that before? Did it work for you?&lt;/p&gt;\n\n&lt;p&gt;2) Buddhists have sangha, which is worldwide community of Buddhists. Christians have churches. And I&amp;#39;m probably going to be alone on my path. If you were me, would you just go on or would you try to share this paradigm to create a community, although a tiny one? I ask this for two reasons: first, people can help polish and develop the paradigm, and more, mere sense of support from not being alone on the path could really help to keep going and improve. Right now I can&amp;#39;t choose between just keeping it for myself, because it&amp;#39;s just my personal lifeview, or sharing it in hope someone will, too, find it useful and inspiring and help develop.&lt;/p&gt;\n\n&lt;p&gt;P.S. Sorry for the long post. Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello, noble men and women of discipline! Recently I was developing an idea which seems very promising to me, but I want to know opinions of others, whether you think this can be useful.\n\n(disclaimer: religious people might not like my post.)\n\nMy problem was always lack of internal support. The thing is I used to think very deeply about questions of existance, and it led to two results: 1) I realized life is much more harsh than we'd want it to be, 2) I realized there was no god and our universe is 100% matter.\n\nYou see, people tend to stick to religions and supernatural beliefs for support. That's proven that there's a special neural center in our brains which is responsible for those kinds of feeling. It helps some, but I can't do it. I felt powerless when I thought about my life as futile in a non-caring universe. Needless to say, I couldn't even start to get really disciplined. I procrastinated, I felt anxious and I was never really calm.\n\nThat's when I realized I needed something inside me, some mental, or dare I say spiritual skeleton to build upon. The trick is, I couldn't retreat to established religions and paradigms, because I fully agree with none of them, and totally disagree with many of them. I love myths and symbols, because they're inspiring and there's beauty in them, but I can't accept a religion, a new age fluffy spiritual movement or anything like that because I have a critical mind and I scrutinize them and I can't accept them.\n\nSo I thought: \"I should try and create a whole paradigm of principles of life, scrutinize and develop it thoroughly, add symbolism to it and make it my spiritual (or, if you don't like the term, mental) path and fundament.\"\n\nWhat I did was taking my already developed perception of life and universe, formulate it and write it down. Then I worked on it and formed principles to stick to (this is all a work in progress though). And I'm posting it here because getting disciplined is one of the core points in my paradigm (it also takes some from stoicism, some from buddhism, some from taoism, and many other things, some of them borrowed, most of them original). Basically, I did it because I wanted to improve my discipline and life.\n\nAnd you know what, it works wonders! I feel inspired because of it. I finally could do what I couldn't do before. I can now do things I procrastinated from before, simply out of thinking about following my newfound/newcreated path. I feel my anxiety decrease and my discipline level up. What I'm doing, I think, is tricking my brain into activating spiritual wires without actually believing in false concepts. I just took bare truths, coated them as spiritual path, and here you go.\n\nSo, now I have some questions and I need certain advice.\n\n1) Do you generally think this is a good idea? Or is this hypocrisy not worthy of continuing? Did anyone of you do that before? Did it work for you?\n\n2) Buddhists have sangha, which is worldwide community of Buddhists. Christians have churches. And I'm probably going to be alone on my path. If you were me, would you just go on or would you try to share this paradigm to create a community, although a tiny one? I ask this for two reasons: first, people can help polish and develop the paradigm, and more, mere sense of support from not being alone on the path could really help to keep going and improve. Right now I can't choose between just keeping it for myself, because it's just my personal lifeview, or sharing it in hope someone will, too, find it useful and inspiring and help develop.\n\nP.S. Sorry for the long post. Thanks!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65dza1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "seamustobanney", "saved": false, "mod_reports": [], "name": "t3_65dza1", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": 1492191844.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65dza1/needadvice_developing_a_whole_internal_spiritual/", "num_reports": null, "locked": false, "stickied": false, "created": 1492220438.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65dza1/needadvice_developing_a_whole_internal_spiritual/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] Developing a whole internal spiritual paradigm from scratch", "created_utc": 1492191638.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 7, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dza1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dza1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dza1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dza1", "likes": null, "replies": "", "user_reports": [], "id": "dgatx8n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "seamustobanney", "parent_id": "t1_dgatjg2", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Well said! I think that's true.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well said! I think that&amp;#39;s true.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgatx8n", "score_hidden": false, "stickied": false, "created": 1492302250.0, "created_utc": 1492273450.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatjg2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Korroboro", "parent_id": "t1_dgadq7d", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "&gt; since the void won't care about life, then we are to care and cherish it\n\nI agree with you on this and the same goes with fairness: the Universe couldn’t care less about fairness, but we humans can understand the value of fairness and we can try to make our environment as just as we can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;since the void won&amp;#39;t care about life, then we are to care and cherish it&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree with you on this and the same goes with fairness: the Universe couldn’t care less about fairness, but we humans can understand the value of fairness and we can try to make our environment as just as we can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgatjg2", "score_hidden": false, "stickied": false, "created": 1492301705.0, "created_utc": 1492272905.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dza1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dza1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65dza1", "likes": null, "replies": "", "user_reports": [], "id": "dgb699m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PeaceH", "parent_id": "t1_dgatwn4", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Good to hear! I will send you the essay by PM. It is only about 3 pages long. Unfortunately I did not write it in English but I ran it through google translate and then corrected some words to make it more understandable.\n\nYour post also reminds me of a post I have seen previously by a reddit poster. He/she (\"Philosofer\")has formulated their own philosophy of life and continously updates it. I am sure there are some parallells with your own philosophy. It has a nice layout anyway. Look at his/her latest revision here: https://philosofer123.files.wordpress.com/2017/02/my-philosophy-by-philo-sofer.pdf", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good to hear! I will send you the essay by PM. It is only about 3 pages long. Unfortunately I did not write it in English but I ran it through google translate and then corrected some words to make it more understandable.&lt;/p&gt;\n\n&lt;p&gt;Your post also reminds me of a post I have seen previously by a reddit poster. He/she (&amp;quot;Philosofer&amp;quot;)has formulated their own philosophy of life and continously updates it. I am sure there are some parallells with your own philosophy. It has a nice layout anyway. Look at his/her latest revision here: &lt;a href=\"https://philosofer123.files.wordpress.com/2017/02/my-philosophy-by-philo-sofer.pdf\"&gt;https://philosofer123.files.wordpress.com/2017/02/my-philosophy-by-philo-sofer.pdf&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb699m", "score_hidden": false, "stickied": false, "created": 1492319062.0, "created_utc": 1492290262.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatwn4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "seamustobanney", "parent_id": "t1_dgaodrh", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "You're guessing right, it's I kind of Camusean absurd in essence! I'm glad to know you're interested in the philosophy of absurdism. Actually, if you don't mind, I'd like to read the essay you've mentioned! I'll take my time to better stitch various theoretical and practical implications of the idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re guessing right, it&amp;#39;s I kind of Camusean absurd in essence! I&amp;#39;m glad to know you&amp;#39;re interested in the philosophy of absurdism. Actually, if you don&amp;#39;t mind, I&amp;#39;d like to read the essay you&amp;#39;ve mentioned! I&amp;#39;ll take my time to better stitch various theoretical and practical implications of the idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgatwn4", "score_hidden": false, "stickied": false, "created": 1492302227.0, "created_utc": 1492273427.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaodrh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PeaceH", "parent_id": "t1_dgadq7d", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Sounds a lot like Absurdism (man searches for meaning but there is none) with a sprinkle of Stoicism (the practical bits on how to deal with that) maybe? You mention Stoicism, but are you also familiar with Absurdism? They are two very different theories but have some practical similarities. Anyways, I'm sure there are people interested in what you describe. I've written an essay on Absurdism and how/if it can be practically applied, so I'll be the first to say that I want to read whatever you want to publish of your findings.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds a lot like Absurdism (man searches for meaning but there is none) with a sprinkle of Stoicism (the practical bits on how to deal with that) maybe? You mention Stoicism, but are you also familiar with Absurdism? They are two very different theories but have some practical similarities. Anyways, I&amp;#39;m sure there are people interested in what you describe. I&amp;#39;ve written an essay on Absurdism and how/if it can be practically applied, so I&amp;#39;ll be the first to say that I want to read whatever you want to publish of your findings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgaodrh", "score_hidden": false, "stickied": false, "created": 1492294080.0, "created_utc": 1492265280.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgadq7d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "seamustobanney", "parent_id": "t1_dg9uwc8", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Hi and thanks for your reply!\n\nMy paradigm is, in it's very core, that the universe is unconscious and therefore uncaring, but it's laws are impossible to overcome. So, conscious beings will never always get what they want and have to adjust and accept the universe. My path is a path of becoming calm in serene in face of paradox between conscious mind and universal void. It nevertheless sees life as precious, because, since the void won't care about life, then we are to care and cherish it. See, nothing paranormal, just a (though maybe not optimistic) view of universe.\n\n1. This is probably because I used to be an outspoken anti-religious/anti-spiritual person, and people know I used to be against all kinds of spiritual paradigms. I later developed a more detailed and thorough understanding of the problem, so my views shifted to more acceptance, but maybe I still feel a bit ashamed that my views have changed. I know this is irrational shame and I'm working on it.\n\n2. I think I'm sorry I didn't do that before. It's an experiment, but a serious one to me. I'm now thinking that I have to thoroughly formulate the ideas, make it solid, and then maybe publish my findings in some blog or anything.  I sure don't want anyone to be indoctrinated under my \"authority\", but I'll really fancy if someone walked the path alongside me. Still, the path needs to be more clear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi and thanks for your reply!&lt;/p&gt;\n\n&lt;p&gt;My paradigm is, in it&amp;#39;s very core, that the universe is unconscious and therefore uncaring, but it&amp;#39;s laws are impossible to overcome. So, conscious beings will never always get what they want and have to adjust and accept the universe. My path is a path of becoming calm in serene in face of paradox between conscious mind and universal void. It nevertheless sees life as precious, because, since the void won&amp;#39;t care about life, then we are to care and cherish it. See, nothing paranormal, just a (though maybe not optimistic) view of universe.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;This is probably because I used to be an outspoken anti-religious/anti-spiritual person, and people know I used to be against all kinds of spiritual paradigms. I later developed a more detailed and thorough understanding of the problem, so my views shifted to more acceptance, but maybe I still feel a bit ashamed that my views have changed. I know this is irrational shame and I&amp;#39;m working on it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I think I&amp;#39;m sorry I didn&amp;#39;t do that before. It&amp;#39;s an experiment, but a serious one to me. I&amp;#39;m now thinking that I have to thoroughly formulate the ideas, make it solid, and then maybe publish my findings in some blog or anything.  I sure don&amp;#39;t want anyone to be indoctrinated under my &amp;quot;authority&amp;quot;, but I&amp;#39;ll really fancy if someone walked the path alongside me. Still, the path needs to be more clear.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgadq7d", "score_hidden": false, "stickied": false, "created": 1492266429.0, "created_utc": 1492237629.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9uwc8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PeaceH", "parent_id": "t3_65dza1", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Hello. Interesting post. I'll attempt your questions. Note that it is hard to give you a good objective answer as we have no idea of what your paradigm entails.\n\n- 1. I think it's a good idea. If you have belief, you have a will. This is the essence of what most motivational speakers try to create in others, but it is never as genuine and long-lasting as self-imposed beliefs. If you took \"bare truths\" and formulated them as spiritual ones, why is that a hypocrisy? Why are you afraid of this eventual hypocrisy?\n- 2. I am not sure. It depends on how you view your \"path\". If it is an experiment that has yielded good results, share it to someone/everyone and see if they have anything to say on it. If you are more serious or truly convinced that this is something crucial to your life, wait a while. Live for a few years... or a decade, on your path, then make a more informed and serious decision about what this mental system means to you and how it could be of help to others. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello. Interesting post. I&amp;#39;ll attempt your questions. Note that it is hard to give you a good objective answer as we have no idea of what your paradigm entails.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;1. I think it&amp;#39;s a good idea. If you have belief, you have a will. This is the essence of what most motivational speakers try to create in others, but it is never as genuine and long-lasting as self-imposed beliefs. If you took &amp;quot;bare truths&amp;quot; and formulated them as spiritual ones, why is that a hypocrisy? Why are you afraid of this eventual hypocrisy?&lt;/li&gt;\n&lt;li&gt;2. I am not sure. It depends on how you view your &amp;quot;path&amp;quot;. If it is an experiment that has yielded good results, share it to someone/everyone and see if they have anything to say on it. If you are more serious or truly convinced that this is something crucial to your life, wait a while. Live for a few years... or a decade, on your path, then make a more informed and serious decision about what this mental system means to you and how it could be of help to others. &lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg9uwc8", "score_hidden": false, "stickied": false, "created": 1492237645.0, "created_utc": 1492208845.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]