[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello all!&lt;/p&gt;\n\n&lt;p&gt;I have been really focused on self-improving the past couple of months due to being diagnosed with anxiety and a mild depression a couple of months ago.&lt;/p&gt;\n\n&lt;p&gt;I have had progress , Such as going to the gym, yoga, getting involved with issues that I care about, studying very hard, aroma therapy, therapy, and just being very productive. However, I have noticed there are some other issues I am not a fan of that I want to change/fix.&lt;/p&gt;\n\n&lt;p&gt;last year, my parents met my boyfriend and basically were not a fan of him because he wasn&amp;#39;t the same culture of us. I am still angry about this, I brought it up briefly but it is still something affecting me internally. I dont know how to bring it up to them again or where to start. It somewhat ruined my relationship where my BF decided to emotionally abuse and manipulate me to end it.&lt;/p&gt;\n\n&lt;p&gt;I sometimes feel I let too many people into my personal issues. I really regret telling my coworkers about my BF issue. Even though, I haven&amp;#39;t recently done it but I feel I let too many people in.&lt;/p&gt;\n\n&lt;p&gt;I feel quite indecisive with my decisions in general. I mean, one minute I want to end it with my boyfriend and then I feel different.&lt;/p&gt;\n\n&lt;p&gt;I want to stand up for what I want to my parents in general. I do come from a not so easy culture, so if I want to travel solo its a no, and mostly I want to because I feel like I can&amp;#39;t wait for people and that life is too short and sometimes its okay to experience life by yourself.&lt;/p&gt;\n\n&lt;p&gt;I sometimes feel anxious around others like I dont belong in the group or something. I dont want to feel so left out or feel so awkward in situations.&lt;/p&gt;\n\n&lt;p&gt;When to know when your friends are your friends and to know when they aren&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;To stop having an opinion on when someone else does something negative. Like yesterday I saw someone be rude to an elder even when that elder said good night or that someone put on an act and basically is lying to every one.&lt;/p&gt;\n\n&lt;p&gt;I know I probably sound silly, but I just have sense of really influencing my life in a more positive direction.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello all!\n\n\nI have been really focused on self-improving the past couple of months due to being diagnosed with anxiety and a mild depression a couple of months ago.\n\n\nI have had progress , Such as going to the gym, yoga, getting involved with issues that I care about, studying very hard, aroma therapy, therapy, and just being very productive. However, I have noticed there are some other issues I am not a fan of that I want to change/fix.\n\n\nlast year, my parents met my boyfriend and basically were not a fan of him because he wasn't the same culture of us. I am still angry about this, I brought it up briefly but it is still something affecting me internally. I dont know how to bring it up to them again or where to start. It somewhat ruined my relationship where my BF decided to emotionally abuse and manipulate me to end it.\n\n\nI sometimes feel I let too many people into my personal issues. I really regret telling my coworkers about my BF issue. Even though, I haven't recently done it but I feel I let too many people in.\n\n\nI feel quite indecisive with my decisions in general. I mean, one minute I want to end it with my boyfriend and then I feel different.\n\n\nI want to stand up for what I want to my parents in general. I do come from a not so easy culture, so if I want to travel solo its a no, and mostly I want to because I feel like I can't wait for people and that life is too short and sometimes its okay to experience life by yourself.\n\n\n\nI sometimes feel anxious around others like I dont belong in the group or something. I dont want to feel so left out or feel so awkward in situations.\n\n\nWhen to know when your friends are your friends and to know when they aren't.\n\n\n\nTo stop having an opinion on when someone else does something negative. Like yesterday I saw someone be rude to an elder even when that elder said good night or that someone put on an act and basically is lying to every one.\n\n\nI know I probably sound silly, but I just have sense of really influencing my life in a more positive direction.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65eflj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "faysayshey", "saved": false, "mod_reports": [], "name": "t3_65eflj", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65eflj/needadvice_not_sure_if_appropriate_here_but_i_f23/", "num_reports": null, "locked": false, "stickied": false, "created": 1492224835.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65eflj/needadvice_not_sure_if_appropriate_here_but_i_f23/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] Not sure if appropriate here, but I (F/23) want to self improve and get negative things out of my life.", "created_utc": 1492196035.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65eflj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65eflj", "likes": null, "replies": "", "user_reports": [], "id": "dg9v5pb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "faysayshey", "parent_id": "t1_dg9u9xt", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Wow, thanks for this! Definitely, taking your suggestions! Not that I make a negative view on certain people but if someone does something negative/rude I will notice it, like be kind to others lol. I am a little worried for people to see me in a negative light, like lets say I do something then I get worried if people are going to judge me and I say this because I noticed with some people I used to surround myself with, constantly looked at others and make fun of them, judge them, that sort of things. \n\n\nRealy like your friends view, I think this is very true.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, thanks for this! Definitely, taking your suggestions! Not that I make a negative view on certain people but if someone does something negative/rude I will notice it, like be kind to others lol. I am a little worried for people to see me in a negative light, like lets say I do something then I get worried if people are going to judge me and I say this because I noticed with some people I used to surround myself with, constantly looked at others and make fun of them, judge them, that sort of things. &lt;/p&gt;\n\n&lt;p&gt;Realy like your friends view, I think this is very true.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg9v5pb", "score_hidden": false, "stickied": false, "created": 1492237999.0, "created_utc": 1492209199.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9u9xt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PeaceH", "parent_id": "t3_65eflj", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "You list a lot of issues you want to handle. They may not be that related to self-discipline, but I think making decisions and solving issues can require self-discipline. In other words, if you want to know WHAT to do about each issue, this may be the wrong subreddit, but if you want to do something about it, this is it. The easiest way to make decisions is to make a list like you did, and then handle one thing at a time. When a decision stresses you out, it is sometimes better to make a decision (any), so that it gets off your mind. Burning bridges, if you will.\n\nIf you need more arguments behind you decisions, make a list of pro and cons, and give points to each argument. Then make your decision.\n\nI can't tell you what to do with your boyfriend. Do you trust him? Can you see yourself still with him in five years? Would life be better or worse without him? Make a commitment to stay, or don't.\n\nThe reason you tell people around you about issues is probably because you are \"indecisive\". If they were not bothering you, and you trusted yourself, would you talk about them as much?\n\nTravelling solo: your parents say \"no\", but do you understand why? Is it since they care for you, since they understand something you don't, or are they overly protective? You are 23 and can decide for yourself. But understand that if you choose to travel solo, whether as a man or woman, there are risks, and other people may view with envy, or disapproval. Is it worth it or not right now? \n\nPersonally I have a realistic view on friendships. The vast majority of friends we have in life are just people we have a lot in common with. That would be in regard to age, interests, beliefs, social group, gender, occupation etc. Being able to relate is the essence of it. This is also the reason why friendships are hard to keep when circumstances change. But on the good side, new friends are always around the corner. Unless you have known someone for the majority of your life, or they are family, they will rarely ever be \"true\" and completely loyal friends. \n\nAlso, do not take offense at this, but worrying about whether friends are loyal or not may be some sort of projection. You mention yourself that you sometimes take a negative view on certain people. Are you scared of others doing the same to you, spreading lies, rumours etc.?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You list a lot of issues you want to handle. They may not be that related to self-discipline, but I think making decisions and solving issues can require self-discipline. In other words, if you want to know WHAT to do about each issue, this may be the wrong subreddit, but if you want to do something about it, this is it. The easiest way to make decisions is to make a list like you did, and then handle one thing at a time. When a decision stresses you out, it is sometimes better to make a decision (any), so that it gets off your mind. Burning bridges, if you will.&lt;/p&gt;\n\n&lt;p&gt;If you need more arguments behind you decisions, make a list of pro and cons, and give points to each argument. Then make your decision.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t tell you what to do with your boyfriend. Do you trust him? Can you see yourself still with him in five years? Would life be better or worse without him? Make a commitment to stay, or don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;The reason you tell people around you about issues is probably because you are &amp;quot;indecisive&amp;quot;. If they were not bothering you, and you trusted yourself, would you talk about them as much?&lt;/p&gt;\n\n&lt;p&gt;Travelling solo: your parents say &amp;quot;no&amp;quot;, but do you understand why? Is it since they care for you, since they understand something you don&amp;#39;t, or are they overly protective? You are 23 and can decide for yourself. But understand that if you choose to travel solo, whether as a man or woman, there are risks, and other people may view with envy, or disapproval. Is it worth it or not right now? &lt;/p&gt;\n\n&lt;p&gt;Personally I have a realistic view on friendships. The vast majority of friends we have in life are just people we have a lot in common with. That would be in regard to age, interests, beliefs, social group, gender, occupation etc. Being able to relate is the essence of it. This is also the reason why friendships are hard to keep when circumstances change. But on the good side, new friends are always around the corner. Unless you have known someone for the majority of your life, or they are family, they will rarely ever be &amp;quot;true&amp;quot; and completely loyal friends. &lt;/p&gt;\n\n&lt;p&gt;Also, do not take offense at this, but worrying about whether friends are loyal or not may be some sort of projection. You mention yourself that you sometimes take a negative view on certain people. Are you scared of others doing the same to you, spreading lies, rumours etc.?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dg9u9xt", "score_hidden": false, "stickied": false, "created": 1492236822.0, "created_utc": 1492208022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]