[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Summary&lt;/strong&gt;: Mindful meditation helps you stay present which plays a key part in being social. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Intro:&lt;/strong&gt; This is my own opinion, so don&amp;#39;t take everything written here as 100% truth. Absorb my theory and adapt it to your own world view.  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;I had a bit of free time after my workout, so I decided to meditate on the bench across from my gym. About ten minutes pass and my phone vibrates. I open my eyes and see my girl calling me. I walk up behind her and surprise her by grabbing her ass. My frame was unbreakable and we had a great time that night.    &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Body&lt;/strong&gt;:&lt;br/&gt;\nI try to meditate immediately before going out or seeing my girl. It puts me into a present state of mind which allows me to socialize more fluidly. Mindfulness definitely plays a role in frame control, which as a result enhances your social skills.    &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Social benefits from meditation&lt;/strong&gt;&lt;br/&gt;\n- Presence&lt;br/&gt;\n- Conversations&lt;br/&gt;\n- Charisma&lt;br/&gt;\n- Happiness  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;All of these benefits come directly from mindfulness and presence. I wouldn&amp;#39;t say that it makes you think quicker, but that it allows you to think more effectively. The ability to hold a conversation, charm others, and be witty is drastically improved when you&amp;#39;re present to the moment.      &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conversations&lt;/strong&gt; - We all know those people who can&amp;#39;t hold a conversation. It&amp;#39;s awkward, but I understand where they&amp;#39;re coming from. They&amp;#39;re just always up in their heads. You can tell they are thinking about other things and simply can&amp;#39;t bring themselves to the moment. It&amp;#39;s like they&amp;#39;re in their own little world. Don&amp;#39;t be that person.  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;Being present allows you to process what others are saying more effectively. It&amp;#39;s inefficient to constantly return to the presence in order gather what others are saying. Then to process that information you must go back into your head and think of your response. Think of all the nonverbal social cues that were missed during that time. It&amp;#39;s a wasteful way of communicating and one should train themselves to process information from a present state of mind.  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Charisma&lt;/strong&gt; - What is charisma? It&amp;#39;s the ability to capture attention, persuade, and charm. Growing up I was not a charismatic person, but I&amp;#39;ve learned the techniques and social skills from masters in the art of persuasion. It&amp;#39;s not something you&amp;#39;re born with but something you gain out of necessity from your life situation. It&amp;#39;s a learned set of behaviors people gain as a survival mechanism.    &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;How does meditation help with charisma? Olivia Fox Cabane discovered three attributes of charismatic people: presence, power, and warmth. We&amp;#39;re going to touch on presence and save the last two for another in-depth charisma post. Being present to a conversation means you are listening and giving someone your valuable time. As we know mindful meditation enhances your ability to be present, making yourself instantly more charismatic.  &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Wit&lt;/strong&gt; - I firmly believe that wit is the root of game and an essential social skill. A person who is quick with their wit has nothing to worry about when it comes to personal attacks. Lots of people are smart, but not all of them are skilled in the art of finesse. Pay attention to Kevin O&amp;#39;Leary and the other sharks in Shark Tank for prime examples of cunning and wit.   &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;Half the challenge of being witty is to acknowledge that a game is being played and attacks are going to come your way. It&amp;#39;s essential to incorporate amused mastery into your lifestyle. Amused mastery is recognizing darkness and cunning in others, and masterfully playing with it. The more you meditate on this concept the easier it is to understand.     &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;The other half is being quick enough to notice an attack and respond accordingly. I&amp;#39;ll admit that there are times where I recognize an attack too late and can&amp;#39;t think of a witty reply in time simply because I wasn&amp;#39;t present to the moment. Attacks are usually subtle, and one must be present to realize one.     &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Lessons Learned:&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Meditation improves your conversation skills.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Being present enhances your charisma.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Wit is the root of game.&lt;br/&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;nbsp;  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://mindfulalpha.com/\"&gt;The Mindful Alpha Blog&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Summary**: Mindful meditation helps you stay present which plays a key part in being social. \n  \n&amp;nbsp;  \n  \n**Intro:** This is my own opinion, so don't take everything written here as 100% truth. Absorb my theory and adapt it to your own world view.  \n  \n&amp;nbsp;  \n  \nI had a bit of free time after my workout, so I decided to meditate on the bench across from my gym. About ten minutes pass and my phone vibrates. I open my eyes and see my girl calling me. I walk up behind her and surprise her by grabbing her ass. My frame was unbreakable and we had a great time that night.    \n  \n&amp;nbsp;  \n  \n**Body**:  \nI try to meditate immediately before going out or seeing my girl. It puts me into a present state of mind which allows me to socialize more fluidly. Mindfulness definitely plays a role in frame control, which as a result enhances your social skills.    \n  \n&amp;nbsp;  \n  \n**Social benefits from meditation**  \n- Presence  \n- Conversations  \n- Charisma  \n- Happiness  \n  \n&amp;nbsp;  \n  \nAll of these benefits come directly from mindfulness and presence. I wouldn't say that it makes you think quicker, but that it allows you to think more effectively. The ability to hold a conversation, charm others, and be witty is drastically improved when you're present to the moment.      \n  \n&amp;nbsp;  \n  \n**Conversations** - We all know those people who can't hold a conversation. It's awkward, but I understand where they're coming from. They're just always up in their heads. You can tell they are thinking about other things and simply can't bring themselves to the moment. It's like they're in their own little world. Don't be that person.  \n  \n&amp;nbsp;  \n  \nBeing present allows you to process what others are saying more effectively. It's inefficient to constantly return to the presence in order gather what others are saying. Then to process that information you must go back into your head and think of your response. Think of all the nonverbal social cues that were missed during that time. It's a wasteful way of communicating and one should train themselves to process information from a present state of mind.  \n  \n&amp;nbsp;  \n  \n**Charisma** - What is charisma? It's the ability to capture attention, persuade, and charm. Growing up I was not a charismatic person, but I've learned the techniques and social skills from masters in the art of persuasion. It's not something you're born with but something you gain out of necessity from your life situation. It's a learned set of behaviors people gain as a survival mechanism.    \n  \n&amp;nbsp;  \n  \nHow does meditation help with charisma? Olivia Fox Cabane discovered three attributes of charismatic people: presence, power, and warmth. We're going to touch on presence and save the last two for another in-depth charisma post. Being present to a conversation means you are listening and giving someone your valuable time. As we know mindful meditation enhances your ability to be present, making yourself instantly more charismatic.  \n  \n&amp;nbsp;  \n  \n**Wit** - I firmly believe that wit is the root of game and an essential social skill. A person who is quick with their wit has nothing to worry about when it comes to personal attacks. Lots of people are smart, but not all of them are skilled in the art of finesse. Pay attention to Kevin O'Leary and the other sharks in Shark Tank for prime examples of cunning and wit.   \n  \n&amp;nbsp;  \n  \nHalf the challenge of being witty is to acknowledge that a game is being played and attacks are going to come your way. It's essential to incorporate amused mastery into your lifestyle. Amused mastery is recognizing darkness and cunning in others, and masterfully playing with it. The more you meditate on this concept the easier it is to understand.     \n  \n&amp;nbsp;  \n  \nThe other half is being quick enough to notice an attack and respond accordingly. I'll admit that there are times where I recognize an attack too late and can't think of a witty reply in time simply because I wasn't present to the moment. Attacks are usually subtle, and one must be present to realize one.     \n  \n&amp;nbsp;  \n  \n**Lessons Learned:**  \n   \n- Meditation improves your conversation skills.    \n- Being present enhances your charisma.  \n- Wit is the root of game.  \n  \n&amp;nbsp;  \n  \n[The Mindful Alpha Blog](https://mindfulalpha.com/)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65hkj2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "MindfulAlpha", "saved": false, "mod_reports": [], "name": "t3_65hkj2", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65hkj2/advice_meditation_improves_social_skills/", "num_reports": null, "locked": false, "stickied": false, "created": 1492263141.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65hkj2/advice_meditation_improves_social_skills/", "author_flair_text": null, "quarantine": false, "title": "[Advice] Meditation Improves Social Skills", "created_utc": 1492234341.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65hkj2", "likes": null, "replies": "", "user_reports": [], "id": "dgazsxv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "andrewnious", "parent_id": "t3_65hkj2", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Too much duality, too much fear ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Too much duality, too much fear &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgazsxv", "score_hidden": false, "stickied": false, "created": 1492310328.0, "created_utc": 1492281528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]