[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;No matter what I try to start doing, (dieting, exercise, working on a business idea, or even getting up early) I find myself doing well for a few weeks, up to a month or 2. And then I lose motivation and go on some kind of binge. And it&amp;#39;s always a while before I even try again.\nHow can I keep motivation/discipline and maintain it? And if I do mess up, how can I keep from letting everything unravel?\nI&amp;#39;ve had this problem for as long as I can remember. Please help&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "No matter what I try to start doing, (dieting, exercise, working on a business idea, or even getting up early) I find myself doing well for a few weeks, up to a month or 2. And then I lose motivation and go on some kind of binge. And it's always a while before I even try again.\nHow can I keep motivation/discipline and maintain it? And if I do mess up, how can I keep from letting everything unravel?\nI've had this problem for as long as I can remember. Please help", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65i7b3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 33, "report_reasons": null, "author": "deartothesun", "saved": false, "mod_reports": [], "name": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65i7b3/needadvice_cant_maintain_discipline/", "num_reports": null, "locked": false, "stickied": false, "created": 1492275550.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65i7b3/needadvice_cant_maintain_discipline/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] Can't maintain discipline", "created_utc": 1492246750.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgal7wl", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "H3LI3", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "The majority of the population can't. \nOtherwise we'd all be super fit/achieving big goals. \n\nIt takes effort above average to maintain proper discipline. \nAccept it's going to be hard, make the choice to work hard, prepare for when it's hard... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The majority of the population can&amp;#39;t. \nOtherwise we&amp;#39;d all be super fit/achieving big goals. &lt;/p&gt;\n\n&lt;p&gt;It takes effort above average to maintain proper discipline. \nAccept it&amp;#39;s going to be hard, make the choice to work hard, prepare for when it&amp;#39;s hard... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgal7wl", "score_hidden": false, "stickied": false, "created": 1492287835.0, "created_utc": 1492259035.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgal85b", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "1nfinitezer0", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Sounds like you might be hitting what Seth Godin calls 'the dip'. In essence, it is that results are inconsistent and often look great at the beginning, but then have some diminishing return until you push through the slow part on your way to mastery.\n\nThe binges are coming as self-sabotage. You can think of it as your ego having one last gasp to say: \"No!! We liked that destructive behaviour in the moment, it brought us comfort. If we give up we might never find anything as comforting again!\" (The ego is really good at being wildly fearful, an irrational streak in an otherwise reasonably rational approach.\n\nBut yeah, these desires to binge are the opportunity to push past. To really succeed, you must be able to get past them. You see it as a pattern, so now you know that they will be coming. Thus you can plan for them. So think of a plan right now!\n\n* When are you often hitting those dips? Is there a pattern? How will you recognize when you're about to react, or just started reacting to it?\n*  What's your rescue plan? Expect to fail and make mistakes. That's part of learning, but true failure is only one of two conditions: not doing it at all, or giving up. Everything else is learning on the way to success. So how are you going to push through? If you can't think of anything, give us a situation to work with and we can brainstorm in this thread.\n* Forgive yourself. Accept that these things happen. Accept that it does not mean that you've lost your discipline. Accept that it's not the end of your world. See them as speedbumps rather than roadblocks and it'll be easier to keep driving.\n* Be clear about why you are doing this. What's the end goal? How does that feed your motivation? Can you return to that inspiration or delayed gratification in the hard moments? Who can you reach out to for support when you need some cheerleading or a check-in?\n* Evaluate if it's worth doing. Have you established clear goals or metrics to see if you're achieving what you want? Were those even reasonable? When starting a business or other thing in a new domain it's easy to set overly ambitious goals and then get discouraged when you discover they were impossible to meet. Set yourself up for success - it will also help you feed your motivation through continual small wins. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you might be hitting what Seth Godin calls &amp;#39;the dip&amp;#39;. In essence, it is that results are inconsistent and often look great at the beginning, but then have some diminishing return until you push through the slow part on your way to mastery.&lt;/p&gt;\n\n&lt;p&gt;The binges are coming as self-sabotage. You can think of it as your ego having one last gasp to say: &amp;quot;No!! We liked that destructive behaviour in the moment, it brought us comfort. If we give up we might never find anything as comforting again!&amp;quot; (The ego is really good at being wildly fearful, an irrational streak in an otherwise reasonably rational approach.&lt;/p&gt;\n\n&lt;p&gt;But yeah, these desires to binge are the opportunity to push past. To really succeed, you must be able to get past them. You see it as a pattern, so now you know that they will be coming. Thus you can plan for them. So think of a plan right now!&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;When are you often hitting those dips? Is there a pattern? How will you recognize when you&amp;#39;re about to react, or just started reacting to it?&lt;/li&gt;\n&lt;li&gt; What&amp;#39;s your rescue plan? Expect to fail and make mistakes. That&amp;#39;s part of learning, but true failure is only one of two conditions: not doing it at all, or giving up. Everything else is learning on the way to success. So how are you going to push through? If you can&amp;#39;t think of anything, give us a situation to work with and we can brainstorm in this thread.&lt;/li&gt;\n&lt;li&gt;Forgive yourself. Accept that these things happen. Accept that it does not mean that you&amp;#39;ve lost your discipline. Accept that it&amp;#39;s not the end of your world. See them as speedbumps rather than roadblocks and it&amp;#39;ll be easier to keep driving.&lt;/li&gt;\n&lt;li&gt;Be clear about why you are doing this. What&amp;#39;s the end goal? How does that feed your motivation? Can you return to that inspiration or delayed gratification in the hard moments? Who can you reach out to for support when you need some cheerleading or a check-in?&lt;/li&gt;\n&lt;li&gt;Evaluate if it&amp;#39;s worth doing. Have you established clear goals or metrics to see if you&amp;#39;re achieving what you want? Were those even reasonable? When starting a business or other thing in a new domain it&amp;#39;s easy to set overly ambitious goals and then get discouraged when you discover they were impossible to meet. Set yourself up for success - it will also help you feed your motivation through continual small wins. &lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgal85b", "score_hidden": false, "stickied": false, "created": 1492287851.0, "created_utc": 1492259051.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgb1t00", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sharlock93", "parent_id": "t1_dgazt71", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Understanding that lesson is quite hard, im not gonna be a hypocrite, i suffer too from such things, we are weird ass creatures. I literally have problems going out because I was rejected by a girl, it slaps like a bitch, but we have to deal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Understanding that lesson is quite hard, im not gonna be a hypocrite, i suffer too from such things, we are weird ass creatures. I literally have problems going out because I was rejected by a girl, it slaps like a bitch, but we have to deal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb1t00", "score_hidden": false, "stickied": false, "created": 1492312998.0, "created_utc": 1492284198.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazt71", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "AdminsHelpMePlz", "parent_id": "t1_dgakbx6", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I love these posts. \n\nNo one coming to save you haha \n\nThat bitch slap is the call to action\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love these posts. &lt;/p&gt;\n\n&lt;p&gt;No one coming to save you haha &lt;/p&gt;\n\n&lt;p&gt;That bitch slap is the call to action&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgazt71", "score_hidden": false, "stickied": false, "created": 1492310339.0, "created_utc": 1492281539.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakbx6", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Sharlock93", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Here is the truth, nobody will help you, nobody is coming to save you, you are most definitely alone, most come here expecting on size fits all, it doesn't work that way, it doesn't work for anyone that way, we all have our stuff we struggle with, nobody has a solution to 'how to maintain discipline?' because it doesn't exist, if it did, you would have known about it long ago, matter of fact is, next time you lose motivation, sit down ask yourself why? dig deep, you come to realize that you might have other problems that might get in the way, you must have a solid foundation of reason that will protect you from 'demotivation', look at eating or drinking water for example: why is it you don't need motivation for those? Because you bloody well eat and drink or you will die. Now that is a solid foundation of reason. So next time just think, and come to terms if those things That you wanna do are really stuff you want to do. \n\nEdit: as something of a positive note so that when someone reads this they don't feel too much down, its okay to be broken, its okay to feel down and fall down, its okay to lose confidence, its okay be hate life sometimes, its all okay to break your habits, a personal example is that I didn't brush my teeth until like a year or two ago, im freaking 23, i hated myself for it every damn time, when I was at dorm, I would be consistent about it, but when I was at home, i would forget, it was something about home that made me forget to do that, but gradually it changed, I had an 'X' factor card (basically a calendar card that you cross each day out for a habit), then I also failed that sometimes and also gave up, but then i still went back to it, and now I don't go to sleep if I don't brush my teeth, but hey even then some random days, I forget it, and you know what ? I feel bad about it too, but just keep at it man, just keep at it, there is no requirement in life except for those that you make for yourself, know full well that you and you alone are responsible for your actions, like you want to murder a child? you can do that, you have that freedom, but do expect the results and be prepared to take the responsibility, you want to cheat on your wife? go a head, do it, then lie about it, then lie some more, but expect the responsibility and take it on. and don't think of yourself as being too pure, if you were a German back in Nazi Germany, you would be one of the guards of Auschwitz and you would be torturing people, we all have the  power to be bad and we all have the power to be what we want to be, so don't give up just because you lost a week in a two month run, and you are planning to do this for your entire life, you don't expect a baby to walk on day one, and you don't expect it to just randomly not fall when its starting to learn, so why are you expecting not to fail when you are trying to change or learning something about yourself?", "edited": 1492370022.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here is the truth, nobody will help you, nobody is coming to save you, you are most definitely alone, most come here expecting on size fits all, it doesn&amp;#39;t work that way, it doesn&amp;#39;t work for anyone that way, we all have our stuff we struggle with, nobody has a solution to &amp;#39;how to maintain discipline?&amp;#39; because it doesn&amp;#39;t exist, if it did, you would have known about it long ago, matter of fact is, next time you lose motivation, sit down ask yourself why? dig deep, you come to realize that you might have other problems that might get in the way, you must have a solid foundation of reason that will protect you from &amp;#39;demotivation&amp;#39;, look at eating or drinking water for example: why is it you don&amp;#39;t need motivation for those? Because you bloody well eat and drink or you will die. Now that is a solid foundation of reason. So next time just think, and come to terms if those things That you wanna do are really stuff you want to do. &lt;/p&gt;\n\n&lt;p&gt;Edit: as something of a positive note so that when someone reads this they don&amp;#39;t feel too much down, its okay to be broken, its okay to feel down and fall down, its okay to lose confidence, its okay be hate life sometimes, its all okay to break your habits, a personal example is that I didn&amp;#39;t brush my teeth until like a year or two ago, im freaking 23, i hated myself for it every damn time, when I was at dorm, I would be consistent about it, but when I was at home, i would forget, it was something about home that made me forget to do that, but gradually it changed, I had an &amp;#39;X&amp;#39; factor card (basically a calendar card that you cross each day out for a habit), then I also failed that sometimes and also gave up, but then i still went back to it, and now I don&amp;#39;t go to sleep if I don&amp;#39;t brush my teeth, but hey even then some random days, I forget it, and you know what ? I feel bad about it too, but just keep at it man, just keep at it, there is no requirement in life except for those that you make for yourself, know full well that you and you alone are responsible for your actions, like you want to murder a child? you can do that, you have that freedom, but do expect the results and be prepared to take the responsibility, you want to cheat on your wife? go a head, do it, then lie about it, then lie some more, but expect the responsibility and take it on. and don&amp;#39;t think of yourself as being too pure, if you were a German back in Nazi Germany, you would be one of the guards of Auschwitz and you would be torturing people, we all have the  power to be bad and we all have the power to be what we want to be, so don&amp;#39;t give up just because you lost a week in a two month run, and you are planning to do this for your entire life, you don&amp;#39;t expect a baby to walk on day one, and you don&amp;#39;t expect it to just randomly not fall when its starting to learn, so why are you expecting not to fail when you are trying to change or learning something about yourself?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgakbx6", "score_hidden": false, "stickied": false, "created": 1492285631.0, "created_utc": 1492256831.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgal9ro", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ophiusa100", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Hey hey, I also had the issue you described. What ended up working for me was rewards. For example: give myself a really nice and calm breakfast if I wake up early.\n\nIt's not the pinnacle of discipline but worked for me in the beginning. I couldn't maintain a habit that felt like \"work\" cause the bad feeling would overpower the \"good side\" after a few weeks. For example cooking everyday would eventually feel like too much work just for being healthy.\n\nSo I made the habits feel good and not just like work. I would stop running and instead went to play a sport with friends for the fun. Cooking with someone as a shared experience. Wake up earlier to read my fav book before work. and etc.\n\nEventually this helped change my mindset about life and now it's easier to do something unpleasant to have benefits in the long run. Don't try to rush it, discipline is a skill that takes time to learn and going to fast might make you feel worse and quit altogether. \n\nBest of luck ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey hey, I also had the issue you described. What ended up working for me was rewards. For example: give myself a really nice and calm breakfast if I wake up early.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not the pinnacle of discipline but worked for me in the beginning. I couldn&amp;#39;t maintain a habit that felt like &amp;quot;work&amp;quot; cause the bad feeling would overpower the &amp;quot;good side&amp;quot; after a few weeks. For example cooking everyday would eventually feel like too much work just for being healthy.&lt;/p&gt;\n\n&lt;p&gt;So I made the habits feel good and not just like work. I would stop running and instead went to play a sport with friends for the fun. Cooking with someone as a shared experience. Wake up earlier to read my fav book before work. and etc.&lt;/p&gt;\n\n&lt;p&gt;Eventually this helped change my mindset about life and now it&amp;#39;s easier to do something unpleasant to have benefits in the long run. Don&amp;#39;t try to rush it, discipline is a skill that takes time to learn and going to fast might make you feel worse and quit altogether. &lt;/p&gt;\n\n&lt;p&gt;Best of luck &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgal9ro", "score_hidden": false, "stickied": false, "created": 1492287961.0, "created_utc": 1492259161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgam9aq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "basyt", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "The binges are going to happen. No one is immune to them. You have to figure how to recover from them. At least that is what I think.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The binges are going to happen. No one is immune to them. You have to figure how to recover from them. At least that is what I think.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgam9aq", "score_hidden": false, "stickied": false, "created": 1492290111.0, "created_utc": 1492261311.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgau8y1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MsCrazyPants70", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Not all people thrive working on things alone, and some need a bit more creativity to creating their habits.  You might check out some of the other subreddits to get motivation buddies, accountability partners, or even find someone local to your area that is trying to build the same habit.  Find something you are good at and work that into building your next habit.  \n\nIn my case, I'm good at showing up when someone expects me to be somewhere. That's what I use to build habits when it works for me.  Think of it this way, no normal person just doesn't show up for work.  You get up and go to work 95% of the time.  That's a solid habit, because your boss will know if you don't go.  Even though there are consequences, you're not really *forced* to work.  People choose to go to work. That's a kind of discipline most develop.  Oddly enough, there are people who can't seem to develop that habit for whatever reason.\n\n\nIt's the same with brushing your teeth.  Most develop that habit. With brushing teeth, most people have a \"trigger\" that makes them do it.  It could be when they wake up and when heading to bed. Some it's after they eat.  No matter what the trigger is, they suddenly don't feel right if they don't do that action at the set time. This is one that parents tend to help instill, but it still counts.\n\n\nLastly, most habits have to be revisited and strengthened again.  Maybe once a month you need to treat the habit like you're starting all over and restrengthen it.\n\n\n1)  Find what you're already good at and use that habit.\n\n2)  Find partners\n\n3)  Find triggers that indicate it's time to do that habit.\n\n4)  Practice mindfulness (I didn't go into this one, but it helps with habits as well.)\n\nDiscipline is really just developing habits. Use all the possible habit tricks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not all people thrive working on things alone, and some need a bit more creativity to creating their habits.  You might check out some of the other subreddits to get motivation buddies, accountability partners, or even find someone local to your area that is trying to build the same habit.  Find something you are good at and work that into building your next habit.  &lt;/p&gt;\n\n&lt;p&gt;In my case, I&amp;#39;m good at showing up when someone expects me to be somewhere. That&amp;#39;s what I use to build habits when it works for me.  Think of it this way, no normal person just doesn&amp;#39;t show up for work.  You get up and go to work 95% of the time.  That&amp;#39;s a solid habit, because your boss will know if you don&amp;#39;t go.  Even though there are consequences, you&amp;#39;re not really &lt;em&gt;forced&lt;/em&gt; to work.  People choose to go to work. That&amp;#39;s a kind of discipline most develop.  Oddly enough, there are people who can&amp;#39;t seem to develop that habit for whatever reason.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s the same with brushing your teeth.  Most develop that habit. With brushing teeth, most people have a &amp;quot;trigger&amp;quot; that makes them do it.  It could be when they wake up and when heading to bed. Some it&amp;#39;s after they eat.  No matter what the trigger is, they suddenly don&amp;#39;t feel right if they don&amp;#39;t do that action at the set time. This is one that parents tend to help instill, but it still counts.&lt;/p&gt;\n\n&lt;p&gt;Lastly, most habits have to be revisited and strengthened again.  Maybe once a month you need to treat the habit like you&amp;#39;re starting all over and restrengthen it.&lt;/p&gt;\n\n&lt;p&gt;1)  Find what you&amp;#39;re already good at and use that habit.&lt;/p&gt;\n\n&lt;p&gt;2)  Find partners&lt;/p&gt;\n\n&lt;p&gt;3)  Find triggers that indicate it&amp;#39;s time to do that habit.&lt;/p&gt;\n\n&lt;p&gt;4)  Practice mindfulness (I didn&amp;#39;t go into this one, but it helps with habits as well.)&lt;/p&gt;\n\n&lt;p&gt;Discipline is really just developing habits. Use all the possible habit tricks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgau8y1", "score_hidden": false, "stickied": false, "created": 1492302700.0, "created_utc": 1492273900.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgawkgh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ForWHOLE", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Cabin in the Yukon. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cabin in the Yukon. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgawkgh", "score_hidden": false, "stickied": false, "created": 1492305912.0, "created_utc": 1492277112.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgbtidc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sweanix", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "People often give up because they set a goal with an completely random guess at how long a person has to spend being bad at a thing before you make progress. Then when their uninformed guess is wrong they feel bad and give up when really their mind set should be something like \"I'm not bad at this a person must just have to spend more than X hours before they make progress at it\" \nTo work on discipline you need to train it like a muscle group at the gym. You should pick something you have no interest in at all and will not benefit you. You can't have a desire to do it as that gives you the get outs \"I'm not sure I actually want to/ it's not worth the effort. Set yourself an endgame goal and when you have started and get an idea of how you are progressing do smaller ones e.g  today I will be able to walk/jog for X minutes longer. The one rule being you have to spend at least one hour a week at it and not stop until you get there. I did this learning to unicycle and it gives you a much better idea of how long it takes for progress to be made and helps keep drive to achieve a thing", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People often give up because they set a goal with an completely random guess at how long a person has to spend being bad at a thing before you make progress. Then when their uninformed guess is wrong they feel bad and give up when really their mind set should be something like &amp;quot;I&amp;#39;m not bad at this a person must just have to spend more than X hours before they make progress at it&amp;quot; \nTo work on discipline you need to train it like a muscle group at the gym. You should pick something you have no interest in at all and will not benefit you. You can&amp;#39;t have a desire to do it as that gives you the get outs &amp;quot;I&amp;#39;m not sure I actually want to/ it&amp;#39;s not worth the effort. Set yourself an endgame goal and when you have started and get an idea of how you are progressing do smaller ones e.g  today I will be able to walk/jog for X minutes longer. The one rule being you have to spend at least one hour a week at it and not stop until you get there. I did this learning to unicycle and it gives you a much better idea of how long it takes for progress to be made and helps keep drive to achieve a thing&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgbtidc", "score_hidden": false, "stickied": false, "created": 1492356648.0, "created_utc": 1492327848.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i7b3", "likes": null, "replies": "", "user_reports": [], "id": "dgak8z1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ukralibre", "parent_id": "t3_65i7b3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "The first thing: discipline does not hold on motivation. Second one: if it is binge it may have something to bipolar disorder, better to find out earlier. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The first thing: discipline does not hold on motivation. Second one: if it is binge it may have something to bipolar disorder, better to find out earlier. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgak8z1", "score_hidden": false, "stickied": false, "created": 1492285407.0, "created_utc": 1492256607.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]