[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m either starving or binging. I didn&amp;#39;t eat over 2,000 calories Monday-Thursday this week. Yesterday I ate 1,400. Today I ate 2,800. Rinse and repeat all the time.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 18 now. This has been my entire life, and I&amp;#39;m to the point where I don&amp;#39;t want to live anymore if this internal cycle continues. I&amp;#39;ve felt fat since I was in 4th grade. I started starving myself in 6th. I&amp;#39;m vegetarian and recently found out I&amp;#39;m lactose intolerant, and I don&amp;#39;t know how to cut dairy out. I ate pizza to the point of having diarrhea the other day. I also feel like there&amp;#39;s always some excuse by someone in my family or friend group to get me to overeat so they don&amp;#39;t feel bad about themselves (oh it&amp;#39;s one slice of pizza, one bag of chips, one chocolate bar, every day, every week). If I choose not to eat something my friend makes this joke which has gotten old as hell where she says &amp;quot;Oh, I ate last week.&amp;quot; And it&amp;#39;s just not fair because she&amp;#39;s 7 inches taller than I am and I&amp;#39;ve seen her TDEE. She can eat 500 more calories than I can.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t care if I have to cook. I like cooking. I don&amp;#39;t care if I have to cut foods out. I&amp;#39;m not eating meat and I need to cut out dairy, anyway. But someone will want to force me to eat it out of their own self-interest I&amp;#39;m sure. I don&amp;#39;t know how to curb my own cravings, and I don&amp;#39;t know how to say no to people who seem to crave the idea of shoving food down my throat. I&amp;#39;m so tired of struggling because of food.&lt;/p&gt;\n\n&lt;p&gt;Please please please help me somehow. I feel like I&amp;#39;ve exhausted every avenue and I don&amp;#39;t know what to do anymore. I quit therapy for the time being today because I dread going, and I don&amp;#39;t feel like it helps anymore. I want to die because I see people accomplish the goals they want to with food and I just can&amp;#39;t. I can&amp;#39;t and I don&amp;#39;t know what&amp;#39;s wrong with me. This is my last resort.&lt;/p&gt;\n\n&lt;p&gt;Edit: Hi, I really appreciate everyone replying. Wowie. I&amp;#39;ll reply to people individually when I can. I haven&amp;#39;t taken the time to read most replies yet because I&amp;#39;m overwhelmed by the positive response--I really thought people wouldn&amp;#39;t reply or would do so negatively. Thank you all. Hoppy bunny eve. :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm either starving or binging. I didn't eat over 2,000 calories Monday-Thursday this week. Yesterday I ate 1,400. Today I ate 2,800. Rinse and repeat all the time.\n\nI'm 18 now. This has been my entire life, and I'm to the point where I don't want to live anymore if this internal cycle continues. I've felt fat since I was in 4th grade. I started starving myself in 6th. I'm vegetarian and recently found out I'm lactose intolerant, and I don't know how to cut dairy out. I ate pizza to the point of having diarrhea the other day. I also feel like there's always some excuse by someone in my family or friend group to get me to overeat so they don't feel bad about themselves (oh it's one slice of pizza, one bag of chips, one chocolate bar, every day, every week). If I choose not to eat something my friend makes this joke which has gotten old as hell where she says \"Oh, I ate last week.\" And it's just not fair because she's 7 inches taller than I am and I've seen her TDEE. She can eat 500 more calories than I can.\n\nI don't care if I have to cook. I like cooking. I don't care if I have to cut foods out. I'm not eating meat and I need to cut out dairy, anyway. But someone will want to force me to eat it out of their own self-interest I'm sure. I don't know how to curb my own cravings, and I don't know how to say no to people who seem to crave the idea of shoving food down my throat. I'm so tired of struggling because of food.\n\nPlease please please help me somehow. I feel like I've exhausted every avenue and I don't know what to do anymore. I quit therapy for the time being today because I dread going, and I don't feel like it helps anymore. I want to die because I see people accomplish the goals they want to with food and I just can't. I can't and I don't know what's wrong with me. This is my last resort.\n\nEdit: Hi, I really appreciate everyone replying. Wowie. I'll reply to people individually when I can. I haven't taken the time to read most replies yet because I'm overwhelmed by the positive response--I really thought people wouldn't reply or would do so negatively. Thank you all. Hoppy bunny eve. :)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65i8iu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 149, "report_reasons": null, "author": "OuEstLaPiscine", "saved": false, "mod_reports": [], "name": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": 1492300417.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65i8iu/needadvice_i_dont_know_how_to_have_a_healthy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492276289.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65i8iu/needadvice_i_dont_know_how_to_have_a_healthy/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] I don't know how to have a healthy relationship with food", "created_utc": 1492247489.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 63, "visited": false, "subreddit_type": "public", "ups": 149}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgaop93", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "taytermuffin", "parent_id": "t1_dgakqkw", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "This is an awesome response, and it helped me too, so thank you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is an awesome response, and it helped me too, so thank you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgaop93", "score_hidden": false, "stickied": false, "created": 1492294613.0, "created_utc": 1492265813.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgb887a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "K80_k", "parent_id": "t1_dgawkvt", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Whoa... the points about bingeing hit home", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whoa... the points about bingeing hit home&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb887a", "score_hidden": false, "stickied": false, "created": 1492321792.0, "created_utc": 1492292992.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd3zjt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgawkvt", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I agree with binge eating as a symptom of something. My relationships are all nonexistent right now and I don't have a legitimate friend I feel I can reach out to. And I'm now turning more toward educating myself about everything rather than letting media do that for me :)\n\nThank you lots.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with binge eating as a symptom of something. My relationships are all nonexistent right now and I don&amp;#39;t have a legitimate friend I feel I can reach out to. And I&amp;#39;m now turning more toward educating myself about everything rather than letting media do that for me :)&lt;/p&gt;\n\n&lt;p&gt;Thank you lots.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd3zjt", "score_hidden": false, "stickied": false, "created": 1492432250.0, "created_utc": 1492403450.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawkvt", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "dashrimpofdoom", "parent_id": "t1_dgakqkw", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "&gt; Develop some life goals. Take your mind of food and weight. Food and body is not the be-all-end-all of life.\n\nFucking THIS. As a young adult, you're trying to define your identity and tend to worry about your external appearance vs other people's and how others see you *a lot*. I've been there, too. But know that having a \"great body\" will not magically make your life great. A \"great body\" will not bring you complete, constant happiness. A \"great body\" won't help you face all your life's challenges. Hell, even the notion of \"a great body\" varies wildly from person to person, from culture to culture. Just look at the Western cultural preference shift from #thinspo to #bootyqueen, from #thighgap to #thick. \n\nA healthy relationship with your food and your body image at any size and shape is way more sustainable in the long run than white-knuckling through bingeing and purgeing to keep yourself thin. Who cares if you're carrying x more pounds than your thinner friend if you're happy in love, have your life in order, are passionate about your job/studies, and can eat whatever you like with no second thoughts or shame?\n\nOne more final thought: the bingeing can be a symptom of a much bigger problem in your life, which is your relationship with other people. If you feel lonely or out of place, or if your friends, parents and immediate family don't support your life choices, bingeing can be used as a coping mechanism. If you feel this resonates with you, I strongly recommend you to seek the help of a (different) therapist who is able to support you in building a) better (ie non-toxic) relationships with people and b) a better relationship with food. Educating yourself about nutrition, if you're not already doing that, would be also tremendously beneficial to your situation. \n\nIn the meantime, don't hesitate to talk to me if you need some support! Good luck :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Develop some life goals. Take your mind of food and weight. Food and body is not the be-all-end-all of life.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Fucking THIS. As a young adult, you&amp;#39;re trying to define your identity and tend to worry about your external appearance vs other people&amp;#39;s and how others see you &lt;em&gt;a lot&lt;/em&gt;. I&amp;#39;ve been there, too. But know that having a &amp;quot;great body&amp;quot; will not magically make your life great. A &amp;quot;great body&amp;quot; will not bring you complete, constant happiness. A &amp;quot;great body&amp;quot; won&amp;#39;t help you face all your life&amp;#39;s challenges. Hell, even the notion of &amp;quot;a great body&amp;quot; varies wildly from person to person, from culture to culture. Just look at the Western cultural preference shift from #thinspo to #bootyqueen, from #thighgap to #thick. &lt;/p&gt;\n\n&lt;p&gt;A healthy relationship with your food and your body image at any size and shape is way more sustainable in the long run than white-knuckling through bingeing and purgeing to keep yourself thin. Who cares if you&amp;#39;re carrying x more pounds than your thinner friend if you&amp;#39;re happy in love, have your life in order, are passionate about your job/studies, and can eat whatever you like with no second thoughts or shame?&lt;/p&gt;\n\n&lt;p&gt;One more final thought: the bingeing can be a symptom of a much bigger problem in your life, which is your relationship with other people. If you feel lonely or out of place, or if your friends, parents and immediate family don&amp;#39;t support your life choices, bingeing can be used as a coping mechanism. If you feel this resonates with you, I strongly recommend you to seek the help of a (different) therapist who is able to support you in building a) better (ie non-toxic) relationships with people and b) a better relationship with food. Educating yourself about nutrition, if you&amp;#39;re not already doing that, would be also tremendously beneficial to your situation. &lt;/p&gt;\n\n&lt;p&gt;In the meantime, don&amp;#39;t hesitate to talk to me if you need some support! Good luck :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgawkvt", "score_hidden": false, "stickied": false, "created": 1492305927.0, "created_utc": 1492277127.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgb0rrg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "throwaway98462", "parent_id": "t1_dgakqkw", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "The bit about losing just a pound a week really got to me. I really wish I had thought about it like that years ago, I would be at a better weight now.\n\nI think one of the factors that goes into it is that you see all these things in the media about all these people losing ridiculous amounts of weight in such a short period of time.  Whether it be the Biggest Loser, supermarket ads, Oprah's latest plan, etc. we see these things and think \"why can't I do that when they can?\" (Of course, we know that there's an army behind that giant weight loss, but it still stings)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The bit about losing just a pound a week really got to me. I really wish I had thought about it like that years ago, I would be at a better weight now.&lt;/p&gt;\n\n&lt;p&gt;I think one of the factors that goes into it is that you see all these things in the media about all these people losing ridiculous amounts of weight in such a short period of time.  Whether it be the Biggest Loser, supermarket ads, Oprah&amp;#39;s latest plan, etc. we see these things and think &amp;quot;why can&amp;#39;t I do that when they can?&amp;quot; (Of course, we know that there&amp;#39;s an army behind that giant weight loss, but it still stings)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb0rrg", "score_hidden": false, "stickied": false, "created": 1492311640.0, "created_utc": 1492282840.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd3swt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgazmvy", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "&gt; this (improving my health) is important to me and if you care about me, you will support me in this. If you won't support me, I won't be able to share meals and so forth with you\n\nThis is worded so beautifully. I'd personally end there because if my family hears the word \"sabotage,\" that's the only part they will respond you. I'm going to type up things like this to say to family and friends and print it. Thank you\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;this (improving my health) is important to me and if you care about me, you will support me in this. If you won&amp;#39;t support me, I won&amp;#39;t be able to share meals and so forth with you&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is worded so beautifully. I&amp;#39;d personally end there because if my family hears the word &amp;quot;sabotage,&amp;quot; that&amp;#39;s the only part they will respond you. I&amp;#39;m going to type up things like this to say to family and friends and print it. Thank you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd3swt", "score_hidden": false, "stickied": false, "created": 1492431938.0, "created_utc": 1492403138.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgazmvy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sedorner", "parent_id": "t1_dgakqkw", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Good advice. \n\nRegarding friends and family, say to them, this (improving my health) is important to me and if you care about me, you will support me in this. If you won't support me, I won't be able to share meals and so forth with you because you are sabotaging me. \n\nRegarding goals and the achievement of them, you schedule things that are important, so schedule fitness time like you would anything important. \n\nConsider volunteering for causes you believe in. Making a difference is powerful. \n\nDon't say anything to yourself you wouldn't say to someone you love. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good advice. &lt;/p&gt;\n\n&lt;p&gt;Regarding friends and family, say to them, this (improving my health) is important to me and if you care about me, you will support me in this. If you won&amp;#39;t support me, I won&amp;#39;t be able to share meals and so forth with you because you are sabotaging me. &lt;/p&gt;\n\n&lt;p&gt;Regarding goals and the achievement of them, you schedule things that are important, so schedule fitness time like you would anything important. &lt;/p&gt;\n\n&lt;p&gt;Consider volunteering for causes you believe in. Making a difference is powerful. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t say anything to yourself you wouldn&amp;#39;t say to someone you love. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgazmvy", "score_hidden": false, "stickied": false, "created": 1492310099.0, "created_utc": 1492281299.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd3p1m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgakqkw", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I definitely struggle with emotional eating. Especially because it's involved in everything my family does. I can't even listen to music on YouTube without hearing someone trying to sell me food. I would love to start self-consciously thinking about food as fuel, not comfort. I've been practicing self-talk recently, specifically reminding myself of food's purpose, and reminding myself that I don't *have* to eat *anything* anyone gives me--I think that's a good start?\n\nNo, I definitely needed to have the math laid out for me. Thank you so much for the perspective.\n\nI have life goals, at least, but I agree that they aren't fully developed because I'm so focused on food. It's to the point that I don't feel like I can accomplish anything until I'm as thin as I want to be and I'm not worried about food.\n\nThank you so much. I'll go look those reading suggestions up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I definitely struggle with emotional eating. Especially because it&amp;#39;s involved in everything my family does. I can&amp;#39;t even listen to music on YouTube without hearing someone trying to sell me food. I would love to start self-consciously thinking about food as fuel, not comfort. I&amp;#39;ve been practicing self-talk recently, specifically reminding myself of food&amp;#39;s purpose, and reminding myself that I don&amp;#39;t &lt;em&gt;have&lt;/em&gt; to eat &lt;em&gt;anything&lt;/em&gt; anyone gives me--I think that&amp;#39;s a good start?&lt;/p&gt;\n\n&lt;p&gt;No, I definitely needed to have the math laid out for me. Thank you so much for the perspective.&lt;/p&gt;\n\n&lt;p&gt;I have life goals, at least, but I agree that they aren&amp;#39;t fully developed because I&amp;#39;m so focused on food. It&amp;#39;s to the point that I don&amp;#39;t feel like I can accomplish anything until I&amp;#39;m as thin as I want to be and I&amp;#39;m not worried about food.&lt;/p&gt;\n\n&lt;p&gt;Thank you so much. I&amp;#39;ll go look those reading suggestions up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd3p1m", "score_hidden": false, "stickied": false, "created": 1492431760.0, "created_utc": 1492402960.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakqkw", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "wishicouldsimplify", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I can understand your predicament. I have been there. I have recovered. I relapse sometimes, but it is rare, and I don't beat myself up over it. From your post, I can see that we must address many issues. \n\nLets start with the most basic issue. Your calories. Are you eating enough? I'm guessing from your post history that you are a girl, and I have seen time and time again that girls tend to be overly restrictive when it comes to calorie reduction. When you do this, you tend to stick to your diet for some time, but ultimately, when the opportunity arrises (a party, family gathering, general emotional highs/lows), your cravings overcome you, and you binge. Maybe cravings isn't even the right word. You try to find comfort in food. This is the most common cause of binging. This issue can be addressed in two ways. Firstly, you must be eating calories below maintenance, but not to the point where food is always on your mind. Find out your TRUE TDEE and macros. If you need help with this, shoot me a PM. \n\nSecondly, you must stop your emotional eating. Ups and downs are a part of life, but you shouldn't try to fill in a void or express happiness with food. You should understand that food is basically just fuel for the body. I know it is hard to think this way, with the way media is shoving food up our faces all day, but you have to think along these lines to change your actions. I am not saying that you should go full Buddhist-mode and have complete detachment with food, but you should learn to cultivate the proper balance. \n\nThe next issue we must address is the pressure to eat from friends and family. I have faced this too. They will tell you to eat more, they will mock you, they will show how they eat whatever they want and are still fit. I have learnt that you cannot change people. You should at least once tell your family and friends that you have a goal to achieve and they should not berate you. If they do not understand, and still keep on compelling you to eat (which in my experience, they will), then you should distance yourself from them. They do not understand your desires and respect your choices. They are not worth it. I know it can seen trivial to distance yourself from friends and family on the basis of food, but let me tell you, this nature of theirs runs deeper than just food. Maybe you have realized this by now, maybe you will realize this later. \n\nFinally, we must address the major issue at hand. Your self-image and self-discipline. As this is a self-discipline, sub, let us first get this out of the way. You say that you have felt fat since Grade 4, and have been starving yourself since Grade 6. Going by your age, you should be in Grade 11-12 now. So in 5-6 years, you have been unable to get un-fat? If you were to lose even a lousy 1 lbs a month, you would have lost upwards of 60 lbs in this time frame. I don't think you were carrying around that much fat when you were in Grade 6. Why are you still trying to lose weight? With proper discipline, losing a lbs of fat a week, you should have lost the required weight within a few short months, and should now well be on the way of bulking (GAINING WEIGHT!), so as to build a better muscular frame. Have you been spinning your wheels for these many years?\n\nI am not trying to belittle you. I am trying to put into numbers that you have to pull yourself up by the bootstraps, and finish what you have started (weight loss). Don't prolong this. Weight loss should not be a life long endeavour. Which leads me into the next point. \n\nDevelop some life goals. Take your mind of food and weight. Food and body is not the be-all-end-all of life. When you begin to chase some truly big goal in life, be it academic, spiritual, financial etc, you will not only shift your focus away from food, making dieting easier, but will slowly boost your self-esteem and begin to change your self image. You don't want to look back after a few years, and be disappointed that you wasted the prime of your life thinking about food and body, when you could have done something bigger than yourself. \n\nOkay, this was a long response. It is coming from a place of experience and pain.\n\nActionable Steps.\n1. Calculate your true TDEE and Macros and stick to them. Don't listen to what family and friends have to say. Select a time-line and get the weight loss over with. Be bold, be assertive. Stand up for yourself where you need to. \n2. Change your self image, and choose some life-goals. For this, I would recommend you read Awaken the Giant Within.\n3. Cultivate new positive habits. I recommend you read The Power of Habit. \n\nIf you follow these three steps, I can guarantee your life will change. But you will need to remain disciplined. You will need to believe in yourself.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can understand your predicament. I have been there. I have recovered. I relapse sometimes, but it is rare, and I don&amp;#39;t beat myself up over it. From your post, I can see that we must address many issues. &lt;/p&gt;\n\n&lt;p&gt;Lets start with the most basic issue. Your calories. Are you eating enough? I&amp;#39;m guessing from your post history that you are a girl, and I have seen time and time again that girls tend to be overly restrictive when it comes to calorie reduction. When you do this, you tend to stick to your diet for some time, but ultimately, when the opportunity arrises (a party, family gathering, general emotional highs/lows), your cravings overcome you, and you binge. Maybe cravings isn&amp;#39;t even the right word. You try to find comfort in food. This is the most common cause of binging. This issue can be addressed in two ways. Firstly, you must be eating calories below maintenance, but not to the point where food is always on your mind. Find out your TRUE TDEE and macros. If you need help with this, shoot me a PM. &lt;/p&gt;\n\n&lt;p&gt;Secondly, you must stop your emotional eating. Ups and downs are a part of life, but you shouldn&amp;#39;t try to fill in a void or express happiness with food. You should understand that food is basically just fuel for the body. I know it is hard to think this way, with the way media is shoving food up our faces all day, but you have to think along these lines to change your actions. I am not saying that you should go full Buddhist-mode and have complete detachment with food, but you should learn to cultivate the proper balance. &lt;/p&gt;\n\n&lt;p&gt;The next issue we must address is the pressure to eat from friends and family. I have faced this too. They will tell you to eat more, they will mock you, they will show how they eat whatever they want and are still fit. I have learnt that you cannot change people. You should at least once tell your family and friends that you have a goal to achieve and they should not berate you. If they do not understand, and still keep on compelling you to eat (which in my experience, they will), then you should distance yourself from them. They do not understand your desires and respect your choices. They are not worth it. I know it can seen trivial to distance yourself from friends and family on the basis of food, but let me tell you, this nature of theirs runs deeper than just food. Maybe you have realized this by now, maybe you will realize this later. &lt;/p&gt;\n\n&lt;p&gt;Finally, we must address the major issue at hand. Your self-image and self-discipline. As this is a self-discipline, sub, let us first get this out of the way. You say that you have felt fat since Grade 4, and have been starving yourself since Grade 6. Going by your age, you should be in Grade 11-12 now. So in 5-6 years, you have been unable to get un-fat? If you were to lose even a lousy 1 lbs a month, you would have lost upwards of 60 lbs in this time frame. I don&amp;#39;t think you were carrying around that much fat when you were in Grade 6. Why are you still trying to lose weight? With proper discipline, losing a lbs of fat a week, you should have lost the required weight within a few short months, and should now well be on the way of bulking (GAINING WEIGHT!), so as to build a better muscular frame. Have you been spinning your wheels for these many years?&lt;/p&gt;\n\n&lt;p&gt;I am not trying to belittle you. I am trying to put into numbers that you have to pull yourself up by the bootstraps, and finish what you have started (weight loss). Don&amp;#39;t prolong this. Weight loss should not be a life long endeavour. Which leads me into the next point. &lt;/p&gt;\n\n&lt;p&gt;Develop some life goals. Take your mind of food and weight. Food and body is not the be-all-end-all of life. When you begin to chase some truly big goal in life, be it academic, spiritual, financial etc, you will not only shift your focus away from food, making dieting easier, but will slowly boost your self-esteem and begin to change your self image. You don&amp;#39;t want to look back after a few years, and be disappointed that you wasted the prime of your life thinking about food and body, when you could have done something bigger than yourself. &lt;/p&gt;\n\n&lt;p&gt;Okay, this was a long response. It is coming from a place of experience and pain.&lt;/p&gt;\n\n&lt;p&gt;Actionable Steps.\n1. Calculate your true TDEE and Macros and stick to them. Don&amp;#39;t listen to what family and friends have to say. Select a time-line and get the weight loss over with. Be bold, be assertive. Stand up for yourself where you need to. \n2. Change your self image, and choose some life-goals. For this, I would recommend you read Awaken the Giant Within.\n3. Cultivate new positive habits. I recommend you read The Power of Habit. &lt;/p&gt;\n\n&lt;p&gt;If you follow these three steps, I can guarantee your life will change. But you will need to remain disciplined. You will need to believe in yourself.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgakqkw", "score_hidden": false, "stickied": false, "created": 1492286661.0, "created_utc": 1492257861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgbmw3e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ninabinaaa", "parent_id": "t1_dgaiyk3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "100% want to recommend these books.  There's also an Intuitive Eating workbook that has just been released that might be helpful", "edited": 1492314464.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;100% want to recommend these books.  There&amp;#39;s also an Intuitive Eating workbook that has just been released that might be helpful&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgbmw3e", "score_hidden": false, "stickied": false, "created": 1492343039.0, "created_utc": 1492314239.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgef306", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgdhlsy", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I'm trying to practice that a lot. I stopped myself during two binge opportunities yesterday. I get this weird feeling that you may relate to where I know what I want long term and I can remind myself of that, but what I want short term (food) will trump that. But that wasn't the case yesterday. :)\n\nI like that you said \"thoughts and feelings are harmless\" because I know that, but I needed to read it. My thoughts and feelings do scare me into ignoring them sometimes and I am really trying to face them now. And thank you for everything you said in the next paragraph. It's amazingly getting to me because of how you worded it--like I know I shouldn't compare myself to others, but I really understand it now that you mention \"you will never be better than someone else than that someone else.\"\n\nI really appreciate all you've said--and even if you are stuck in a hole like me, know that you've given me tools to dig myself out with this comment (so I know you can find the tools yourself as well:)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to practice that a lot. I stopped myself during two binge opportunities yesterday. I get this weird feeling that you may relate to where I know what I want long term and I can remind myself of that, but what I want short term (food) will trump that. But that wasn&amp;#39;t the case yesterday. :)&lt;/p&gt;\n\n&lt;p&gt;I like that you said &amp;quot;thoughts and feelings are harmless&amp;quot; because I know that, but I needed to read it. My thoughts and feelings do scare me into ignoring them sometimes and I am really trying to face them now. And thank you for everything you said in the next paragraph. It&amp;#39;s amazingly getting to me because of how you worded it--like I know I shouldn&amp;#39;t compare myself to others, but I really understand it now that you mention &amp;quot;you will never be better than someone else than that someone else.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I really appreciate all you&amp;#39;ve said--and even if you are stuck in a hole like me, know that you&amp;#39;ve given me tools to dig myself out with this comment (so I know you can find the tools yourself as well:)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgef306", "score_hidden": false, "stickied": false, "created": 1492505447.0, "created_utc": 1492476647.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdhlsy", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "closetgunner", "parent_id": "t1_dgczx6u", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "It boils down to this:\n\nI struggle with my relationship with food a lot. It's constantly always on my minds—the next meal, the last meal, whether I overate, whether the event I'm going to later will have hors d'oeuvre, whether I will binge on them, whether I will go to bed hungry, whether I will stay up 3 hours past my anticipated bed time to gorge on food, etc. It's endless. BUT. I will tell you this:\n\nRecognize that *you* are in control of your actions. You control what goes into your mouth. When you start getting anxious over food and you generally fall into a binge, STOP, breathe. Look at what you're doing. You're the driver of your vehicle, no longer have you been relegated to the backseat to watch something else steer your vehicle. The first step is to STOP the cycle. Recognize that you're doing what you're doing. \n\nSecond step: invite that feeling into your inner-home for coffee and get to know that feeling. We as humans so often want to \"forget\" all these uncomfortable \"feelings\" so we check Facebook, binge, watch Netflix, etc. all for that quick dopamine hit... all the while that nasty feeling is waiting outside your door. Guess what—it's not going to leave until you invite it in, sit down with it, and *really get to know it*. Don't be afraid of your urges to binge... It's nothing to be afraid of. It's merely a thought and feeling... and thoughts nad feelings are harmless. Invite that person into your home, give it a hug, and ask what it wants and why it feels like it does. \n\nPersonally, it seems to me that you're struggling with a sense of deflated self-worth. I struggle with the same thing—always comparing myself to others around me. But I will say this: it's a losing game. You will NEVER be a better someone else than that someone else. You be you. You love you. You be thankful for YOU. You are an amazing person, filled to the brim with unlimited potential. You just have to be able to step back, step out of the rut that you're *telling yourself* you're in, and breathe and move forward. Life is way to short to be living someone else's life. \n\nSorry, this is a ramble, but I can sympathize. My eating issue has driven me into a sad, sorry, and lonely existence. I've isolated myself from nearly all things social for a monk-life existence that revolves around studying and fitness. It's very lonely and I am afraid to admit that I hate the hole in which I've dug myself. I have a lot to learn, but life is a constant self-discovery quest. \n\nIf you ever want to chat, PM me. I don't know how much I can help, but I can just offer you some advice that actually has helped me get a hold of my relationship with food and recognize the faulty thoughts that were leading me down horrible, dark places. \n\nYou have one life. I don't know where you live, but just take a 15 minute walk outside today and breathe—try to appreciate the tiny little miracle that each moment of existence brings. Remember that you can decide to change anything about your life—you are not a hostage—you are limitless. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It boils down to this:&lt;/p&gt;\n\n&lt;p&gt;I struggle with my relationship with food a lot. It&amp;#39;s constantly always on my minds—the next meal, the last meal, whether I overate, whether the event I&amp;#39;m going to later will have hors d&amp;#39;oeuvre, whether I will binge on them, whether I will go to bed hungry, whether I will stay up 3 hours past my anticipated bed time to gorge on food, etc. It&amp;#39;s endless. BUT. I will tell you this:&lt;/p&gt;\n\n&lt;p&gt;Recognize that &lt;em&gt;you&lt;/em&gt; are in control of your actions. You control what goes into your mouth. When you start getting anxious over food and you generally fall into a binge, STOP, breathe. Look at what you&amp;#39;re doing. You&amp;#39;re the driver of your vehicle, no longer have you been relegated to the backseat to watch something else steer your vehicle. The first step is to STOP the cycle. Recognize that you&amp;#39;re doing what you&amp;#39;re doing. &lt;/p&gt;\n\n&lt;p&gt;Second step: invite that feeling into your inner-home for coffee and get to know that feeling. We as humans so often want to &amp;quot;forget&amp;quot; all these uncomfortable &amp;quot;feelings&amp;quot; so we check Facebook, binge, watch Netflix, etc. all for that quick dopamine hit... all the while that nasty feeling is waiting outside your door. Guess what—it&amp;#39;s not going to leave until you invite it in, sit down with it, and &lt;em&gt;really get to know it&lt;/em&gt;. Don&amp;#39;t be afraid of your urges to binge... It&amp;#39;s nothing to be afraid of. It&amp;#39;s merely a thought and feeling... and thoughts nad feelings are harmless. Invite that person into your home, give it a hug, and ask what it wants and why it feels like it does. &lt;/p&gt;\n\n&lt;p&gt;Personally, it seems to me that you&amp;#39;re struggling with a sense of deflated self-worth. I struggle with the same thing—always comparing myself to others around me. But I will say this: it&amp;#39;s a losing game. You will NEVER be a better someone else than that someone else. You be you. You love you. You be thankful for YOU. You are an amazing person, filled to the brim with unlimited potential. You just have to be able to step back, step out of the rut that you&amp;#39;re &lt;em&gt;telling yourself&lt;/em&gt; you&amp;#39;re in, and breathe and move forward. Life is way to short to be living someone else&amp;#39;s life. &lt;/p&gt;\n\n&lt;p&gt;Sorry, this is a ramble, but I can sympathize. My eating issue has driven me into a sad, sorry, and lonely existence. I&amp;#39;ve isolated myself from nearly all things social for a monk-life existence that revolves around studying and fitness. It&amp;#39;s very lonely and I am afraid to admit that I hate the hole in which I&amp;#39;ve dug myself. I have a lot to learn, but life is a constant self-discovery quest. &lt;/p&gt;\n\n&lt;p&gt;If you ever want to chat, PM me. I don&amp;#39;t know how much I can help, but I can just offer you some advice that actually has helped me get a hold of my relationship with food and recognize the faulty thoughts that were leading me down horrible, dark places. &lt;/p&gt;\n\n&lt;p&gt;You have one life. I don&amp;#39;t know where you live, but just take a 15 minute walk outside today and breathe—try to appreciate the tiny little miracle that each moment of existence brings. Remember that you can decide to change anything about your life—you are not a hostage—you are limitless. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgdhlsy", "score_hidden": false, "stickied": false, "created": 1492465344.0, "created_utc": 1492436544.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgczx6u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgaiyk3", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I've actually read the first and the last one. I guess self-help books aren't my thing, as much as I want them to be. I can't remember which one it was, but one recommended writing a specific list of conditional and never foods, and it led to me making a long, unhealthy list that could be summarized as don't eat anything that isn't ~sad~ a plant.\nIf you have recommendations for non-food related self-help books, I'll take them. Sometimes I like to look at general advice, then apply it to a narrow aspect of my life. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve actually read the first and the last one. I guess self-help books aren&amp;#39;t my thing, as much as I want them to be. I can&amp;#39;t remember which one it was, but one recommended writing a specific list of conditional and never foods, and it led to me making a long, unhealthy list that could be summarized as don&amp;#39;t eat anything that isn&amp;#39;t ~sad~ a plant.\nIf you have recommendations for non-food related self-help books, I&amp;#39;ll take them. Sometimes I like to look at general advice, then apply it to a narrow aspect of my life. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgczx6u", "score_hidden": false, "stickied": false, "created": 1492426044.0, "created_utc": 1492397244.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaiyk3", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "closetgunner", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I can't offer any direct advice but 3 books that *may* provide some help:\n\n*Never Binge Again*\n\n*Intuitive Eating*\n\n*Brain Over Binge*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t offer any direct advice but 3 books that &lt;em&gt;may&lt;/em&gt; provide some help:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Never Binge Again&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Intuitive Eating&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Brain Over Binge&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgaiyk3", "score_hidden": false, "stickied": false, "created": 1492281601.0, "created_utc": 1492252801.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd33f7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dganlqa", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I'm not in group therapy, actually (not sure what that is, I'm guessing with other people?), just one-on-one.\n\nI agree with the week thing, however my relationship with food is a lot more emotional than it is a balance. Purposely underrating doesn't help me excuse myself when I overeat or even eat at maintenance.\n\nYeah, my goals definitely aren't simple. They get out of hand. But I just have one main, simple goal to lose weight, and I haven't yet gotten to where I want to be.\n\nThank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not in group therapy, actually (not sure what that is, I&amp;#39;m guessing with other people?), just one-on-one.&lt;/p&gt;\n\n&lt;p&gt;I agree with the week thing, however my relationship with food is a lot more emotional than it is a balance. Purposely underrating doesn&amp;#39;t help me excuse myself when I overeat or even eat at maintenance.&lt;/p&gt;\n\n&lt;p&gt;Yeah, my goals definitely aren&amp;#39;t simple. They get out of hand. But I just have one main, simple goal to lose weight, and I haven&amp;#39;t yet gotten to where I want to be.&lt;/p&gt;\n\n&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd33f7", "score_hidden": false, "stickied": false, "created": 1492430763.0, "created_utc": 1492401963.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dganlqa", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "buriedinthyeyes", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "O girl I'm so sorry. I know you must be having a really hard time right now and I feel for you. \n\n&gt; I quit therapy for the time being today because I dread going\n\nThis is my first advice: go back. It sounds like you're in group therapy, so it may be more easy to consider doing one on one instead? Whatever it is, you need someone to help you with this, it'll be much easier than going it alone.   \n\n&gt; I didn't eat over 2,000 calories Monday-Thursday this week. Yesterday I ate 1,400. Today I ate 2,800. \n\nI just want to point out one thing: People tend to look at calories like a day-by-day thing when sometimes it is more helpful to look at it as a week-by-week thing. \n\nWhat I mean is this: there are a lot of healthy eaters who will eat under maintenance on the weekday (cooking and packed lunches) to eat over maintenance on the weekend (alcohol, restaurants, desserts) and they *still* manage to overall maintain their weight. Why? Because your body isn't very careful about how it \"logs\" its calories: so long as you GENERALLY eat in a balanced way it doesn't matter. So when you're a healthy eater, reaching for that extra slice of pizza even if it's because of peer pressure isn't that big of a deal because you can just take it easy the next day or couple of days to make up for it. \n\nThat always takes the pressure off of me a little bit: knowing that its more of a fluid process helps you to feel less bad about yourself if you do happen to eat too much somedays. \n\nI also have a background of disordered eating during my teen years. At one point I was at 1200 a day every day for a year. it was a nightmare. in college when i started eating more regularly i actually grew two inches taller, so it was definitely stunting my growth. It's important to address it but feel hopeful that the damage at this point is completely addressable. I'm very happy and a healthy weight and I eat generally whatever I want, which tends to be everything from pizza to broccoli salads to greek yogurt to steak. So have hope! You CAN and WILL get better. \n\n&gt; I see people accomplish the goals they want to with food and I just can't. \n\nWhat about setting easier goals? What kind of goals have you been setting? Can you set one that simpler or easier to accomplish?  \n\n&gt; I don't know how to curb my own cravings\n\nIf you are undereating you are NOT going to curb them, because your cravings are your body's way of telling you to stop undereating. If you ate at maintenance for a few weeks to a month you should eat your cravings decrease. Also, if you're a vegetarian, you might want to consider adding more fats and proteins to your diet -- they satiate hunger (but only if you're eating a decent amount of food to begin with). \n\n&gt; But someone will want to force me to eat it out of their own self-interest I'm sure  \n\nI'm confused about this. Do you really have people forcing you to eat dairy products even when you're lactose intolerant? I feel like just saying \"I'm lactose-intolerant\" should be enough. Why do you think people are forcing you to eat? What self-interests does that serve? Just trying to understand what's going on :)\n\nPlease, please, PM me and we can continue this conversation further. And reach out to your therapist or another adult that you trust. Stay strong lady, if I did it you can do it!\n\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;O girl I&amp;#39;m so sorry. I know you must be having a really hard time right now and I feel for you. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I quit therapy for the time being today because I dread going&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is my first advice: go back. It sounds like you&amp;#39;re in group therapy, so it may be more easy to consider doing one on one instead? Whatever it is, you need someone to help you with this, it&amp;#39;ll be much easier than going it alone.   &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I didn&amp;#39;t eat over 2,000 calories Monday-Thursday this week. Yesterday I ate 1,400. Today I ate 2,800. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I just want to point out one thing: People tend to look at calories like a day-by-day thing when sometimes it is more helpful to look at it as a week-by-week thing. &lt;/p&gt;\n\n&lt;p&gt;What I mean is this: there are a lot of healthy eaters who will eat under maintenance on the weekday (cooking and packed lunches) to eat over maintenance on the weekend (alcohol, restaurants, desserts) and they &lt;em&gt;still&lt;/em&gt; manage to overall maintain their weight. Why? Because your body isn&amp;#39;t very careful about how it &amp;quot;logs&amp;quot; its calories: so long as you GENERALLY eat in a balanced way it doesn&amp;#39;t matter. So when you&amp;#39;re a healthy eater, reaching for that extra slice of pizza even if it&amp;#39;s because of peer pressure isn&amp;#39;t that big of a deal because you can just take it easy the next day or couple of days to make up for it. &lt;/p&gt;\n\n&lt;p&gt;That always takes the pressure off of me a little bit: knowing that its more of a fluid process helps you to feel less bad about yourself if you do happen to eat too much somedays. &lt;/p&gt;\n\n&lt;p&gt;I also have a background of disordered eating during my teen years. At one point I was at 1200 a day every day for a year. it was a nightmare. in college when i started eating more regularly i actually grew two inches taller, so it was definitely stunting my growth. It&amp;#39;s important to address it but feel hopeful that the damage at this point is completely addressable. I&amp;#39;m very happy and a healthy weight and I eat generally whatever I want, which tends to be everything from pizza to broccoli salads to greek yogurt to steak. So have hope! You CAN and WILL get better. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I see people accomplish the goals they want to with food and I just can&amp;#39;t. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What about setting easier goals? What kind of goals have you been setting? Can you set one that simpler or easier to accomplish?  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t know how to curb my own cravings&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you are undereating you are NOT going to curb them, because your cravings are your body&amp;#39;s way of telling you to stop undereating. If you ate at maintenance for a few weeks to a month you should eat your cravings decrease. Also, if you&amp;#39;re a vegetarian, you might want to consider adding more fats and proteins to your diet -- they satiate hunger (but only if you&amp;#39;re eating a decent amount of food to begin with). &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But someone will want to force me to eat it out of their own self-interest I&amp;#39;m sure  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m confused about this. Do you really have people forcing you to eat dairy products even when you&amp;#39;re lactose intolerant? I feel like just saying &amp;quot;I&amp;#39;m lactose-intolerant&amp;quot; should be enough. Why do you think people are forcing you to eat? What self-interests does that serve? Just trying to understand what&amp;#39;s going on :)&lt;/p&gt;\n\n&lt;p&gt;Please, please, PM me and we can continue this conversation further. And reach out to your therapist or another adult that you trust. Stay strong lady, if I did it you can do it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dganlqa", "score_hidden": false, "stickied": false, "created": 1492292713.0, "created_utc": 1492263913.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd2q6a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ordinaryrendition", "parent_id": "t1_dgd0eeu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Your history of issues with parents and impersonal relationships with your gparents is a bit telling about your definite need for some help.\n\nI won't comment much on the therapist situation - it is not my wheelhouse (I'll finish med school in 1 week but not going into pysch).  I do think you should see an MD though so that any medication needs or issues can be worked out. They can also direct you to certain types of therapists.\n\nI do appreciate you clarifying the intent of your writing style, however. I don't necessarily need you to disclose your disorder (but I'm going to guess borderline personality disorder). If so, being aware of it and accepting it are good steps to making better decisions in the future. Go see your doctor man!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your history of issues with parents and impersonal relationships with your gparents is a bit telling about your definite need for some help.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t comment much on the therapist situation - it is not my wheelhouse (I&amp;#39;ll finish med school in 1 week but not going into pysch).  I do think you should see an MD though so that any medication needs or issues can be worked out. They can also direct you to certain types of therapists.&lt;/p&gt;\n\n&lt;p&gt;I do appreciate you clarifying the intent of your writing style, however. I don&amp;#39;t necessarily need you to disclose your disorder (but I&amp;#39;m going to guess borderline personality disorder). If so, being aware of it and accepting it are good steps to making better decisions in the future. Go see your doctor man!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd2q6a", "score_hidden": false, "stickied": false, "created": 1492430160.0, "created_utc": 1492401360.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0eeu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgapujy", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Thank you for the concern, it's honestly much more than I've gotten from anyone before. I'm not living with my parents and probably won't be again. I'm living at my grandparents, but I don't really have a personal relationship with them.\n\nI've seen multiple therapists since I was in 8th grade. I saw \"mine\" for two years and I've made definite progress, but I feel like I'm stuck at a wall right now and he doesn't have the right tools for me. I don't want to go through the process of finding another therapist again just to add their name to the list of adults I'm supposed to trust who have let me down in some way\n\nWhat I have is more complicated than just anxiety/depression and I feel like there's no help from me. From what I've read my disorder is permanent and anything about it online has a negative connotation (especially on reddit), so I feel like there's nothing that will help me.\n\nWhat I just wrote sounds like a suicide note, so I'm just clarifying that the perception of it only motivates me to work harder. I just think I'm at a point where I have to make the bulk of the effort to get over the wall I mentioned earlier. :) I'm trying to educate myself and build healthy habits first and foremost.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the concern, it&amp;#39;s honestly much more than I&amp;#39;ve gotten from anyone before. I&amp;#39;m not living with my parents and probably won&amp;#39;t be again. I&amp;#39;m living at my grandparents, but I don&amp;#39;t really have a personal relationship with them.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen multiple therapists since I was in 8th grade. I saw &amp;quot;mine&amp;quot; for two years and I&amp;#39;ve made definite progress, but I feel like I&amp;#39;m stuck at a wall right now and he doesn&amp;#39;t have the right tools for me. I don&amp;#39;t want to go through the process of finding another therapist again just to add their name to the list of adults I&amp;#39;m supposed to trust who have let me down in some way&lt;/p&gt;\n\n&lt;p&gt;What I have is more complicated than just anxiety/depression and I feel like there&amp;#39;s no help from me. From what I&amp;#39;ve read my disorder is permanent and anything about it online has a negative connotation (especially on reddit), so I feel like there&amp;#39;s nothing that will help me.&lt;/p&gt;\n\n&lt;p&gt;What I just wrote sounds like a suicide note, so I&amp;#39;m just clarifying that the perception of it only motivates me to work harder. I just think I&amp;#39;m at a point where I have to make the bulk of the effort to get over the wall I mentioned earlier. :) I&amp;#39;m trying to educate myself and build healthy habits first and foremost.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd0eeu", "score_hidden": false, "stickied": false, "created": 1492426719.0, "created_utc": 1492397919.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapujy", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ordinaryrendition", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Go see your doctor with these concerns NOW. \"I want to die\" is never in the phrases people with normally functioning moods use to describe their eating issues.\n\nMake your appointment now. Don't scroll to the next comment, don't make an excuse. Tell your parents (if you guys have a good relationship) about this and make your appointment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go see your doctor with these concerns NOW. &amp;quot;I want to die&amp;quot; is never in the phrases people with normally functioning moods use to describe their eating issues.&lt;/p&gt;\n\n&lt;p&gt;Make your appointment now. Don&amp;#39;t scroll to the next comment, don&amp;#39;t make an excuse. Tell your parents (if you guys have a good relationship) about this and make your appointment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgapujy", "score_hidden": false, "stickied": false, "created": 1492296434.0, "created_utc": 1492267634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd0jny", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgaituk", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Thank you. :) That was my therapist's go-to one-word answer for everything, but I feel like there are definitely people who try to infringe on my boundaries (and others', it's just a certain type of person), and I'm not strong enough to keep them away most times", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. :) That was my therapist&amp;#39;s go-to one-word answer for everything, but I feel like there are definitely people who try to infringe on my boundaries (and others&amp;#39;, it&amp;#39;s just a certain type of person), and I&amp;#39;m not strong enough to keep them away most times&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd0jny", "score_hidden": false, "stickied": false, "created": 1492426922.0, "created_utc": 1492398122.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaituk", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Tiffanniwi", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Boundaries. Please love yourself enough to make your own choices and let others have their opinion and love them anyway but do not feel obligated to do what they want you to do. \n\nTake responsibility for your actions, deal with emotions, get active, make better choices and reward yourself for making those better choices! Hugs and I needed to hear this myself so no judgment coming from here!  ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Boundaries. Please love yourself enough to make your own choices and let others have their opinion and love them anyway but do not feel obligated to do what they want you to do. &lt;/p&gt;\n\n&lt;p&gt;Take responsibility for your actions, deal with emotions, get active, make better choices and reward yourself for making those better choices! Hugs and I needed to hear this myself so no judgment coming from here!  ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgaituk", "score_hidden": false, "stickied": false, "created": 1492281187.0, "created_utc": 1492252387.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd2y74", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgam4yl", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I'm trying to be more environmentally-friendly as well, so that's also a good \"excuse\" (in quotation marks because it won't be a lie).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to be more environmentally-friendly as well, so that&amp;#39;s also a good &amp;quot;excuse&amp;quot; (in quotation marks because it won&amp;#39;t be a lie).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd2y74", "score_hidden": false, "stickied": false, "created": 1492430526.0, "created_utc": 1492401726.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgam4yl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dum_dums", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I wouldn't be preaching if it wasn't for the fact that you are already vegetarian so these things probably resonate with you. Cheese and milk have a ton of calories, but there's good reasons not to eat them besides your health. Maybe that can be a good motivator to tell your friends no whenever they offer something. Microwave pizza, Chips or chocolate bars often have something like palm oil in them, which is devastating to the environment. \n\nI don't want to drone on about the evils of dairy and palm oil, but I think your diet would be a lot healthier if you stop eating them, so if you need some motivation besides your health you could check out /r/vegan. The sidebar has a lot of good information.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t be preaching if it wasn&amp;#39;t for the fact that you are already vegetarian so these things probably resonate with you. Cheese and milk have a ton of calories, but there&amp;#39;s good reasons not to eat them besides your health. Maybe that can be a good motivator to tell your friends no whenever they offer something. Microwave pizza, Chips or chocolate bars often have something like palm oil in them, which is devastating to the environment. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to drone on about the evils of dairy and palm oil, but I think your diet would be a lot healthier if you stop eating them, so if you need some motivation besides your health you could check out &lt;a href=\"/r/vegan\"&gt;/r/vegan&lt;/a&gt;. The sidebar has a lot of good information.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgam4yl", "score_hidden": false, "stickied": false, "created": 1492289861.0, "created_utc": 1492261061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgam5mn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "basyt", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "You are a teenager and as such you will have cravings and swings. Don't get too mad if you eat too much every once in a while. Try to integrate exercise /running/walking in your daily routine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are a teenager and as such you will have cravings and swings. Don&amp;#39;t get too mad if you eat too much every once in a while. Try to integrate exercise /running/walking in your daily routine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgam5mn", "score_hidden": false, "stickied": false, "created": 1492289900.0, "created_utc": 1492261100.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgamifo", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "danijjjjj", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "You should post this to [r/BingeEatingDisorder](https://www.reddit.com/r/BingeEatingDisorder/?st=J1JA4IJZ&amp;sh=64e5b0c1) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should post this to &lt;a href=\"https://www.reddit.com/r/BingeEatingDisorder/?st=J1JA4IJZ&amp;amp;sh=64e5b0c1\"&gt;r/BingeEatingDisorder&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgamifo", "score_hidden": false, "stickied": false, "created": 1492290633.0, "created_utc": 1492261833.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd0m0v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgas5f0", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I've been tracking on MyFitnessPal for a long time, which I guess is similar. I feel like for me it's more emotional. I will binge on something I hate just because it's sitting there. Although I don't doubt the sugar correlation for me as well :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been tracking on MyFitnessPal for a long time, which I guess is similar. I feel like for me it&amp;#39;s more emotional. I will binge on something I hate just because it&amp;#39;s sitting there. Although I don&amp;#39;t doubt the sugar correlation for me as well :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd0m0v", "score_hidden": false, "stickied": false, "created": 1492427014.0, "created_utc": 1492398214.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgas5f0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "1enigma1", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "It sounds to me like the food that your are over eating is making you over eat.\n\nStart keeping a journal of what you eat and how you feel (both emotionally and physically).  Doing so you will be able to figure out what your trigger foods are pretty quickly.\n\nI sort of did this accidentally and found that consuming high amounts of sugary foods (and other simple carbs like breads and pastas) cause me to plunge into a negative emotional spiral.  After about a day of eating poorly I'd feel really crappy which caused me to eat the same foods for comfort.  This resulted in effectively a feedback loop/spiral of feeling and eating really bad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds to me like the food that your are over eating is making you over eat.&lt;/p&gt;\n\n&lt;p&gt;Start keeping a journal of what you eat and how you feel (both emotionally and physically).  Doing so you will be able to figure out what your trigger foods are pretty quickly.&lt;/p&gt;\n\n&lt;p&gt;I sort of did this accidentally and found that consuming high amounts of sugary foods (and other simple carbs like breads and pastas) cause me to plunge into a negative emotional spiral.  After about a day of eating poorly I&amp;#39;d feel really crappy which caused me to eat the same foods for comfort.  This resulted in effectively a feedback loop/spiral of feeling and eating really bad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgas5f0", "score_hidden": false, "stickied": false, "created": 1492299775.0, "created_utc": 1492270975.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgavx1j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kindalike", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Stop counting calories, and start listening to your body. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop counting calories, and start listening to your body. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgavx1j", "score_hidden": false, "stickied": false, "created": 1492305035.0, "created_utc": 1492276235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd0o05", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgawlf8", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Hahahaha I wish. I would get along very well with Joey", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hahahaha I wish. I would get along very well with Joey&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd0o05", "score_hidden": false, "stickied": false, "created": 1492427094.0, "created_utc": 1492398294.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgawlf8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LanAkou", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I don't have any useful input, but just based on the title I thought this was an issue of learning how to share food with your SO. [Like Joey from friends](https://s-media-cache-ak0.pinimg.com/564x/ba/83/16/ba831661e2fa010ea4e151c65ad3b6e6.jpg).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any useful input, but just based on the title I thought this was an issue of learning how to share food with your SO. &lt;a href=\"https://s-media-cache-ak0.pinimg.com/564x/ba/83/16/ba831661e2fa010ea4e151c65ad3b6e6.jpg\"&gt;Like Joey from friends&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgawlf8", "score_hidden": false, "stickied": false, "created": 1492305946.0, "created_utc": 1492277146.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgb8sil", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Fishing_For_Pandas", "parent_id": "t1_dgb8qku", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Additionally, excercising let's you eat more if you do it right. I love food and it works because I run 25+ miles a week.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Additionally, excercising let&amp;#39;s you eat more if you do it right. I love food and it works because I run 25+ miles a week.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb8sil", "score_hidden": false, "stickied": false, "created": 1492322575.0, "created_utc": 1492293775.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8qku", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Fishing_For_Pandas", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Here's my anecdotal advice. The best way not to binge is to eat consistently.  You should aim to reach your calories but not exceed everyday.  Best way for me to do this was to get MyFitnessPal, and set it for 1 lbs loss per week. Just log everything.  Additionally, I am not personally a vegetarian but I do know you need to be incredibly careful to get the correct nutrients.  With being lactose too, research what foods you need to hit your protein needs.  Many vegitarians I know eat way too much pasta and chips to make up for the lack of filling meat and that can be a huge calorie trap.  I'm not sure why you're vegitarian but looking into switching to pescitarian might help alot.  Hope this helps!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s my anecdotal advice. The best way not to binge is to eat consistently.  You should aim to reach your calories but not exceed everyday.  Best way for me to do this was to get MyFitnessPal, and set it for 1 lbs loss per week. Just log everything.  Additionally, I am not personally a vegetarian but I do know you need to be incredibly careful to get the correct nutrients.  With being lactose too, research what foods you need to hit your protein needs.  Many vegitarians I know eat way too much pasta and chips to make up for the lack of filling meat and that can be a huge calorie trap.  I&amp;#39;m not sure why you&amp;#39;re vegitarian but looking into switching to pescitarian might help alot.  Hope this helps!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb8qku", "score_hidden": false, "stickied": false, "created": 1492322499.0, "created_utc": 1492293699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgde6jz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "skedaddled", "parent_id": "t1_dgd0xta", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I just recently found The Great British Baking Show on Netflix so I haven't even finished Season 1 but I love it. Somehow, though, since it's a longer show and focuses so much on the cooking with just a bit on the finished product, it doesn't make me want to raid the pantry or run out for a bag of junk food like endless food commercials do.\n\nI grew up in a family that used food to fix sadness and upsets so it wasn't until I got my own place and made different friends that I started changing my old habits. I'm still not perfect but I never tried to fix my kids problems or make up for a fight with a pan of cookies; we'd get out in nature instead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just recently found The Great British Baking Show on Netflix so I haven&amp;#39;t even finished Season 1 but I love it. Somehow, though, since it&amp;#39;s a longer show and focuses so much on the cooking with just a bit on the finished product, it doesn&amp;#39;t make me want to raid the pantry or run out for a bag of junk food like endless food commercials do.&lt;/p&gt;\n\n&lt;p&gt;I grew up in a family that used food to fix sadness and upsets so it wasn&amp;#39;t until I got my own place and made different friends that I started changing my old habits. I&amp;#39;m still not perfect but I never tried to fix my kids problems or make up for a fight with a pan of cookies; we&amp;#39;d get out in nature instead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgde6jz", "score_hidden": false, "stickied": false, "created": 1492459046.0, "created_utc": 1492430246.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd0xta", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgaoikn", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Yeah, I hate when non-food-related things revolve around *food.* I'm actually joining a jiu-jitsu gym which I'm really excited about--I signed up two weeks ago, but I haven't been able to go until this week because there's only three days a week I can viably go and I had other things planned for me. But the same gym has yoga lessons that I could go to in the morning before school that I plan to do just so I can start something (even though I personally dislike yoga, I'll just be glad to move at all, no matter how slow it is :)\n\nThank you for your last few sentences. And skipping commercials is smart. One of my favorite shows is \"The Great British Baking Show\" however :( but I have chosen to watch it instead of snacking before, so there's that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I hate when non-food-related things revolve around &lt;em&gt;food.&lt;/em&gt; I&amp;#39;m actually joining a jiu-jitsu gym which I&amp;#39;m really excited about--I signed up two weeks ago, but I haven&amp;#39;t been able to go until this week because there&amp;#39;s only three days a week I can viably go and I had other things planned for me. But the same gym has yoga lessons that I could go to in the morning before school that I plan to do just so I can start something (even though I personally dislike yoga, I&amp;#39;ll just be glad to move at all, no matter how slow it is :)&lt;/p&gt;\n\n&lt;p&gt;Thank you for your last few sentences. And skipping commercials is smart. One of my favorite shows is &amp;quot;The Great British Baking Show&amp;quot; however :( but I have chosen to watch it instead of snacking before, so there&amp;#39;s that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd0xta", "score_hidden": false, "stickied": false, "created": 1492427489.0, "created_utc": 1492398689.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaoikn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "skedaddled", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Maybe make some new friends or join groups that aren't food centered. Volleyball, kickball, walking clubs, art classes, volunteering at a pet shelter are all centered around that activity instead of eating. I quit a couple groups because there was food at every meeting and I couldn't handle the pressure to eat. I just built more non-food activities into my life and that included turning off the TV or recording programs and skipping the commercials which are almost all food. You're young and you've been fighting so hard. Time to stop the fight and start living with and around people who aren't fixated on food. It's just body fuel, is shouldn't be entertainment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe make some new friends or join groups that aren&amp;#39;t food centered. Volleyball, kickball, walking clubs, art classes, volunteering at a pet shelter are all centered around that activity instead of eating. I quit a couple groups because there was food at every meeting and I couldn&amp;#39;t handle the pressure to eat. I just built more non-food activities into my life and that included turning off the TV or recording programs and skipping the commercials which are almost all food. You&amp;#39;re young and you&amp;#39;ve been fighting so hard. Time to stop the fight and start living with and around people who aren&amp;#39;t fixated on food. It&amp;#39;s just body fuel, is shouldn&amp;#39;t be entertainment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgaoikn", "score_hidden": false, "stickied": false, "created": 1492294306.0, "created_utc": 1492265506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd2kkp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jackboy93", "parent_id": "t1_dgd166b", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "No problem. And I totally understand, being skeptical is an ideal trait. And yes, I also had the same relation with certain junk foods (trigger foods). My partner can have McDonalds, Tim Hortons etc. in moderation but I find that it kicks off a habit, and I'm then eating other bad things such as ice cream, sweets and whatever else. I don't feel in control.\n\nAnd for those who haven't been there, they'll never understand it... As junk food in moderation, for a lot of people, is absolutely fine... And productive!\n\nBest of luck with everything :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No problem. And I totally understand, being skeptical is an ideal trait. And yes, I also had the same relation with certain junk foods (trigger foods). My partner can have McDonalds, Tim Hortons etc. in moderation but I find that it kicks off a habit, and I&amp;#39;m then eating other bad things such as ice cream, sweets and whatever else. I don&amp;#39;t feel in control.&lt;/p&gt;\n\n&lt;p&gt;And for those who haven&amp;#39;t been there, they&amp;#39;ll never understand it... As junk food in moderation, for a lot of people, is absolutely fine... And productive!&lt;/p&gt;\n\n&lt;p&gt;Best of luck with everything :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd2kkp", "score_hidden": false, "stickied": false, "created": 1492429910.0, "created_utc": 1492401110.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd166b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgaxhgl", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I was skimming through it to see whether it was bs (sorry), but I am so thankful of you for posting this! I saw this sentence and almost choked: \n\n&gt; Although the “everything in moderation” message may work for some people, this advice is a complete disaster for food addicts.\n\nI sent my friend a text earlier about my struggles with binge eating and basically said this. To her a slice of pizza is a slice of pizza, but to me it represents failure (so I might as well eat the entire rest of the pizza). I feel like I'd succeed in eliminating foods because I feel much stronger if I don't have any of a given food at all than if I have even the tiniest nibble of it. It's when people offer it that I feel like I can't refuse. Anyway, I'm excited to read the rest of this, thank you. :)", "edited": 1492399242.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was skimming through it to see whether it was bs (sorry), but I am so thankful of you for posting this! I saw this sentence and almost choked: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Although the “everything in moderation” message may work for some people, this advice is a complete disaster for food addicts.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I sent my friend a text earlier about my struggles with binge eating and basically said this. To her a slice of pizza is a slice of pizza, but to me it represents failure (so I might as well eat the entire rest of the pizza). I feel like I&amp;#39;d succeed in eliminating foods because I feel much stronger if I don&amp;#39;t have any of a given food at all than if I have even the tiniest nibble of it. It&amp;#39;s when people offer it that I feel like I can&amp;#39;t refuse. Anyway, I&amp;#39;m excited to read the rest of this, thank you. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd166b", "score_hidden": false, "stickied": false, "created": 1492427827.0, "created_utc": 1492399027.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxhgl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jackboy93", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "https://authoritynutrition.com/how-to-overcome-food-addiction/ may help. This article is highly ranked in my books. I have posted this to someone before and want to state that I have no affiliation with that blog, it's just my recommended article.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://authoritynutrition.com/how-to-overcome-food-addiction/\"&gt;https://authoritynutrition.com/how-to-overcome-food-addiction/&lt;/a&gt; may help. This article is highly ranked in my books. I have posted this to someone before and want to state that I have no affiliation with that blog, it&amp;#39;s just my recommended article.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgaxhgl", "score_hidden": false, "stickied": false, "created": 1492307154.0, "created_utc": 1492278354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgaz3ks", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CaesarRoyale", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I don't know much about addiction, but /r/mealprepsunday might be good for you because it'll let you have certain sized portions that you can space at proper times through the day. That might help proper amounts at the proper intervals ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know much about addiction, but &lt;a href=\"/r/mealprepsunday\"&gt;/r/mealprepsunday&lt;/a&gt; might be good for you because it&amp;#39;ll let you have certain sized portions that you can space at proper times through the day. That might help proper amounts at the proper intervals &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgaz3ks", "score_hidden": false, "stickied": false, "created": 1492309348.0, "created_utc": 1492280548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgb2agt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aznology", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Hey, I have the same problem as you, and have gone down the path of counting calories and such but always ended up at the same place. So, I decided a new method, where I no longer disappoint myself by forgetting to track calories and such. A hands off approach with one simple rule. You only eat once a day! So, far I've had huge success with it matter of fact lost about 7 pounds in 4 days. Here's a [link](https://disciplinehacker.wordpress.com/2017/04/12/pros-and-cons-of-one-meal-a-day/)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I have the same problem as you, and have gone down the path of counting calories and such but always ended up at the same place. So, I decided a new method, where I no longer disappoint myself by forgetting to track calories and such. A hands off approach with one simple rule. You only eat once a day! So, far I&amp;#39;ve had huge success with it matter of fact lost about 7 pounds in 4 days. Here&amp;#39;s a &lt;a href=\"https://disciplinehacker.wordpress.com/2017/04/12/pros-and-cons-of-one-meal-a-day/\"&gt;link&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb2agt", "score_hidden": false, "stickied": false, "created": 1492313647.0, "created_utc": 1492284847.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd1sqa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgb2qqq", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "That sounds really interesting. I'll check it out, thank you. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That sounds really interesting. I&amp;#39;ll check it out, thank you. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd1sqa", "score_hidden": false, "stickied": false, "created": 1492428731.0, "created_utc": 1492399931.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2qqq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cyhyraethz", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "If you feel like it, check out [this podcast interview with Chef AJ](http://pca.st/ZBGp). It's about her journey from a junk food vegan to a whole food plant based chef. It's also about her struggle with food addiction and how she managed to overcome it. I found it to be a really interesting interview.\n\nIf you decide to check it out then I hope it helps you.\n\nP.S. The download button is just under the red oval that says \"Open in Pocket Casts\". It's the one on the left with the arrow pointing straight down at a horizontal line. You may have to right click the button and \"Save Link As\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you feel like it, check out &lt;a href=\"http://pca.st/ZBGp\"&gt;this podcast interview with Chef AJ&lt;/a&gt;. It&amp;#39;s about her journey from a junk food vegan to a whole food plant based chef. It&amp;#39;s also about her struggle with food addiction and how she managed to overcome it. I found it to be a really interesting interview.&lt;/p&gt;\n\n&lt;p&gt;If you decide to check it out then I hope it helps you.&lt;/p&gt;\n\n&lt;p&gt;P.S. The download button is just under the red oval that says &amp;quot;Open in Pocket Casts&amp;quot;. It&amp;#39;s the one on the left with the arrow pointing straight down at a horizontal line. You may have to right click the button and &amp;quot;Save Link As&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb2qqq", "score_hidden": false, "stickied": false, "created": 1492314255.0, "created_utc": 1492285455.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd269s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgb3j2o", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I wish I could. I've never lived alone and probably won't for a long time (dorming in university this winter). And not really sadly, but I'm starting BJJ lessons this Friday. I'm planning on going to yoga tomorrow.\n\nI do want to take up drawing. I don't know what I'll draw, but that's the beauty of it. :) I'll start next time I have a craving. Which is now, actually, but I haven't gone to the kitchen yet. I could just not walk to the kitchen, but I'm also thirsty", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I could. I&amp;#39;ve never lived alone and probably won&amp;#39;t for a long time (dorming in university this winter). And not really sadly, but I&amp;#39;m starting BJJ lessons this Friday. I&amp;#39;m planning on going to yoga tomorrow.&lt;/p&gt;\n\n&lt;p&gt;I do want to take up drawing. I don&amp;#39;t know what I&amp;#39;ll draw, but that&amp;#39;s the beauty of it. :) I&amp;#39;ll start next time I have a craving. Which is now, actually, but I haven&amp;#39;t gone to the kitchen yet. I could just not walk to the kitchen, but I&amp;#39;m also thirsty&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd269s", "score_hidden": false, "stickied": false, "created": 1492429293.0, "created_utc": 1492400493.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3j2o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wisdomination", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Have you tried imposing environmental constraints on yourself?\n\nIf you’re out of the house, ideally moving around, that makes it hard to eat constantly. \n\nIn cases of lack of discipline and/or compulsive habits - sounds like it - tinkering with what you even *can* do tends to be a big help. Definitely better than willpower-bruteforcing it.\n\nIn a related vein, if you’re surrounded by people who are making things worse, how about expanding your social circle? Are there any people in your extended circle who you think would guide you in better ways? I’m not saying \"cut off contact with your family\", but \"reconnect with that one fit guy and just spend more time with him and let social pressure work FOR you for a change\". \n\nThose are examples, but the main idea is to help as much as possible structure your *environment* to help you in your desired direction instead of fighting a mental battle. Tilt the playing field in your favour.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried imposing environmental constraints on yourself?&lt;/p&gt;\n\n&lt;p&gt;If you’re out of the house, ideally moving around, that makes it hard to eat constantly. &lt;/p&gt;\n\n&lt;p&gt;In cases of lack of discipline and/or compulsive habits - sounds like it - tinkering with what you even &lt;em&gt;can&lt;/em&gt; do tends to be a big help. Definitely better than willpower-bruteforcing it.&lt;/p&gt;\n\n&lt;p&gt;In a related vein, if you’re surrounded by people who are making things worse, how about expanding your social circle? Are there any people in your extended circle who you think would guide you in better ways? I’m not saying &amp;quot;cut off contact with your family&amp;quot;, but &amp;quot;reconnect with that one fit guy and just spend more time with him and let social pressure work FOR you for a change&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Those are examples, but the main idea is to help as much as possible structure your &lt;em&gt;environment&lt;/em&gt; to help you in your desired direction instead of fighting a mental battle. Tilt the playing field in your favour.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgb3j2o", "score_hidden": false, "stickied": false, "created": 1492315326.0, "created_utc": 1492286526.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd27wx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgbaaeg", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I was in one-on-one therapy. Thank you, but I didn't feel like I was progressing anywhere. I've seen multiple therapists since I was in eighth grade five years ago, but I appreciate your message nonetheless :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in one-on-one therapy. Thank you, but I didn&amp;#39;t feel like I was progressing anywhere. I&amp;#39;ve seen multiple therapists since I was in eighth grade five years ago, but I appreciate your message nonetheless :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd27wx", "score_hidden": false, "stickied": false, "created": 1492429362.0, "created_utc": 1492400562.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbaaeg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "perljen", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "More than the food you need support outside the family. Go to one on one therapy. Commit to six sessions. After that, I promise you will be in a much more rational state, you will have superior emotional support, and you will feel much more rational and at ease whilst coping with your behavior issues. Good luck. Don't let anyone diminish the importance of your journey.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;More than the food you need support outside the family. Go to one on one therapy. Commit to six sessions. After that, I promise you will be in a much more rational state, you will have superior emotional support, and you will feel much more rational and at ease whilst coping with your behavior issues. Good luck. Don&amp;#39;t let anyone diminish the importance of your journey.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgbaaeg", "score_hidden": false, "stickied": false, "created": 1492324723.0, "created_utc": 1492295923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgbdqs8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tuvanga", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Bodybuilding. Get seriously into bodybuilding and eventually try out for a show. In the process of doing this, you will rehabilitate your metabolism by eating frequent small meals and building muscle. And designing the body of your choice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bodybuilding. Get seriously into bodybuilding and eventually try out for a show. In the process of doing this, you will rehabilitate your metabolism by eating frequent small meals and building muscle. And designing the body of your choice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgbdqs8", "score_hidden": false, "stickied": false, "created": 1492329661.0, "created_utc": 1492300861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd2n6o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgbib2v", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I didn't know there were apps like that. Truly, thank you for the suggestion because I sometimes get into the habit of weighing myself everyday, and it's really discouraging.\n\nI'm 5'3.75 and from what I've found, my sedentary TDEE tends to be ~1580 calories. It's difficult because people have the idea that eating below 1200 is starving yourself, but I can't lose even one pound a week if I don't eat below 1100. And I've seen restaurant meals state on the menu that they are 1200 calories.\n\nAlso--congratulations! I am wondering how you avoided overeating or eating at all at social outings of any sort?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t know there were apps like that. Truly, thank you for the suggestion because I sometimes get into the habit of weighing myself everyday, and it&amp;#39;s really discouraging.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 5&amp;#39;3.75 and from what I&amp;#39;ve found, my sedentary TDEE tends to be ~1580 calories. It&amp;#39;s difficult because people have the idea that eating below 1200 is starving yourself, but I can&amp;#39;t lose even one pound a week if I don&amp;#39;t eat below 1100. And I&amp;#39;ve seen restaurant meals state on the menu that they are 1200 calories.&lt;/p&gt;\n\n&lt;p&gt;Also--congratulations! I am wondering how you avoided overeating or eating at all at social outings of any sort?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd2n6o", "score_hidden": false, "stickied": false, "created": 1492430024.0, "created_utc": 1492401224.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbib2v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wynter_Phoenyx", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I feel you. I've been there and it was hell. I was overweight from 5 til 21 and hated every minute of it. At the age of 14-15 I started doing fad diets and \"watching my calories\" (to the tune of 2000kcal, waaaay over what a 5'4\" 14 yo needs), but was never able to lose anything. So I get where you're coming from. \n\nAs others have mentioned, find your true TDEE and make sure it's set to sedentary, people have a tendency to way overestimate their exercise. Second, if you have issues with the up and down of the scale download Libra or HappyScale and weight yourself everyday. These programs create a trend line to show you where you're *actually* at. Also, depending on how short you are, 1400 is not starving yourself. Neither is 1200 or even less if you're *really* short and close to middle of healthy. You also do not have to eat at set times or in set amounts. Three meals a day sounds good to you? Go for it. Only hungry for one around dinner time? That's fine too. You do not have to eat breakfast if you're not hungry for it. You do not have to eat full meals if you prefer to graze all day. Do what works for you, your metabolism with not stop or anything (and if it did you'd be dead). You also do not need to exercise at a 500+ deficit, it's good if you want to, but not necessary. \n\nAs for the binging: ask yourself why you keep doing it. If it's a lack of self control, buckle down and do it. If it's something else, figure out the why's behind that and address the issues. For me, I was using food as a punishment system: eating nothing if I'd wronged someone else, and binging if I so much as ate a Hershey's kiss during my strictest times. \n\nJust to show you it can be done, I'll give you my stats: my staring weight was 175 at 5'4.5\" and I started my calories at 1600. This was way too high for me, I only lost 10lbs in that first year. After dropping to 1200kcal (then to 1100kcal) my weight loss finally took off and I reached my goal of 130lbs. I *never* thought I'd make it, weight loss *is* possible. I'm not maintaining just yet (going down to 110 to then start a bulk/cut Cycle). \n\nI hope I've helped and if you have any questions feel free to ask. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel you. I&amp;#39;ve been there and it was hell. I was overweight from 5 til 21 and hated every minute of it. At the age of 14-15 I started doing fad diets and &amp;quot;watching my calories&amp;quot; (to the tune of 2000kcal, waaaay over what a 5&amp;#39;4&amp;quot; 14 yo needs), but was never able to lose anything. So I get where you&amp;#39;re coming from. &lt;/p&gt;\n\n&lt;p&gt;As others have mentioned, find your true TDEE and make sure it&amp;#39;s set to sedentary, people have a tendency to way overestimate their exercise. Second, if you have issues with the up and down of the scale download Libra or HappyScale and weight yourself everyday. These programs create a trend line to show you where you&amp;#39;re &lt;em&gt;actually&lt;/em&gt; at. Also, depending on how short you are, 1400 is not starving yourself. Neither is 1200 or even less if you&amp;#39;re &lt;em&gt;really&lt;/em&gt; short and close to middle of healthy. You also do not have to eat at set times or in set amounts. Three meals a day sounds good to you? Go for it. Only hungry for one around dinner time? That&amp;#39;s fine too. You do not have to eat breakfast if you&amp;#39;re not hungry for it. You do not have to eat full meals if you prefer to graze all day. Do what works for you, your metabolism with not stop or anything (and if it did you&amp;#39;d be dead). You also do not need to exercise at a 500+ deficit, it&amp;#39;s good if you want to, but not necessary. &lt;/p&gt;\n\n&lt;p&gt;As for the binging: ask yourself why you keep doing it. If it&amp;#39;s a lack of self control, buckle down and do it. If it&amp;#39;s something else, figure out the why&amp;#39;s behind that and address the issues. For me, I was using food as a punishment system: eating nothing if I&amp;#39;d wronged someone else, and binging if I so much as ate a Hershey&amp;#39;s kiss during my strictest times. &lt;/p&gt;\n\n&lt;p&gt;Just to show you it can be done, I&amp;#39;ll give you my stats: my staring weight was 175 at 5&amp;#39;4.5&amp;quot; and I started my calories at 1600. This was way too high for me, I only lost 10lbs in that first year. After dropping to 1200kcal (then to 1100kcal) my weight loss finally took off and I reached my goal of 130lbs. I &lt;em&gt;never&lt;/em&gt; thought I&amp;#39;d make it, weight loss &lt;em&gt;is&lt;/em&gt; possible. I&amp;#39;m not maintaining just yet (going down to 110 to then start a bulk/cut Cycle). &lt;/p&gt;\n\n&lt;p&gt;I hope I&amp;#39;ve helped and if you have any questions feel free to ask. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgbib2v", "score_hidden": false, "stickied": false, "created": 1492336205.0, "created_utc": 1492307405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgbx1zn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "youtubefactsbot", "parent_id": "t1_dgbx1xi", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "&gt;[**The End of Dieting,  How to Prevent Disease by Joel Fuhrman MD [88:17]**](http://youtu.be/uXMzWkzqkao)\n\n&gt;&gt;Expert Panel Host: Joel Fuhrman MD\n\n&gt; [*^The ^Real ^Truth ^About ^Health*](https://www.youtube.com/channel/UCp_ShZAUGtFLpYkgcTrayRQ) ^in ^Science ^&amp; ^Technology\n\n&gt;*^89,399 ^views ^since ^Feb ^2016*\n\n[^bot ^info](/r/youtubefactsbot/wiki/index)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&lt;a href=\"http://youtu.be/uXMzWkzqkao\"&gt;&lt;strong&gt;The End of Dieting,  How to Prevent Disease by Joel Fuhrman MD [88:17]&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Expert Panel Host: Joel Fuhrman MD&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/channel/UCp_ShZAUGtFLpYkgcTrayRQ\"&gt;&lt;em&gt;&lt;sup&gt;The&lt;/sup&gt; &lt;sup&gt;Real&lt;/sup&gt; &lt;sup&gt;Truth&lt;/sup&gt; &lt;sup&gt;About&lt;/sup&gt; &lt;sup&gt;Health&lt;/sup&gt;&lt;/em&gt;&lt;/a&gt; &lt;sup&gt;in&lt;/sup&gt; &lt;sup&gt;Science&lt;/sup&gt; &lt;sup&gt;&amp;amp;&lt;/sup&gt; &lt;sup&gt;Technology&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&lt;sup&gt;89,399&lt;/sup&gt; &lt;sup&gt;views&lt;/sup&gt; &lt;sup&gt;since&lt;/sup&gt; &lt;sup&gt;Feb&lt;/sup&gt; &lt;sup&gt;2016&lt;/sup&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"/r/youtubefactsbot/wiki/index\"&gt;&lt;sup&gt;bot&lt;/sup&gt; &lt;sup&gt;info&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgbx1zn", "score_hidden": false, "stickied": false, "created": 1492368307.0, "created_utc": 1492339507.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgeenl0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgdc4j9", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Thank you so much! I'll give it a watch. Also I really agree, and I'd prefer my diet to look like that pyramid. Im proud of how I've eaten today at least, but I'm not surrounded by family and friends. I feel like people in this thread have already given me some good tactics I haven't considered before for combating environmental influence, because it takes more than willpower", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much! I&amp;#39;ll give it a watch. Also I really agree, and I&amp;#39;d prefer my diet to look like that pyramid. Im proud of how I&amp;#39;ve eaten today at least, but I&amp;#39;m not surrounded by family and friends. I feel like people in this thread have already given me some good tactics I haven&amp;#39;t considered before for combating environmental influence, because it takes more than willpower&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgeenl0", "score_hidden": false, "stickied": false, "created": 1492504918.0, "created_utc": 1492476118.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdc4j9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Question209209", "parent_id": "t1_dgd2pbu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "The average diet focuses on macros (carbs, fats, proteins) and calories, but doesn't have many micros. That's why you eat a lot and still feel hungry.\n\nThe way to get those micros is to eat as much vegetables and fruits as possible. [Pyramid](https://2.bp.blogspot.com/-xErqU9aSCcI/UyR8s4PwKkI/AAAAAAAAAso/RxV7ZhDZzGA/s1600/Fuhrman.food.pyramid.new.Eat.to.Live.jpg). This diet is crazy effective I lost all my fat and never felt hungry in the process. It is also recommended by Firas Zahabi who is currently considered the best mma coach.\n\nFor your junk food binging problem: understand that sugar is addictive and works in a very similar way to cocaine - that means when you quit it, you will feel symptoms of withdrawal and first 2-4 weeks are going to suck big time, but after that you won't even want to touch it. \n\nFor the social problem: the fact that you will get results on pure willpower is a myth. You need to control things that control you. I would seriously reconsider your friends if they keep you down just so they can feel better about themselves.\n\nThat's my 0.02$ hope it helps", "edited": 1492424980.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The average diet focuses on macros (carbs, fats, proteins) and calories, but doesn&amp;#39;t have many micros. That&amp;#39;s why you eat a lot and still feel hungry.&lt;/p&gt;\n\n&lt;p&gt;The way to get those micros is to eat as much vegetables and fruits as possible. &lt;a href=\"https://2.bp.blogspot.com/-xErqU9aSCcI/UyR8s4PwKkI/AAAAAAAAAso/RxV7ZhDZzGA/s1600/Fuhrman.food.pyramid.new.Eat.to.Live.jpg\"&gt;Pyramid&lt;/a&gt;. This diet is crazy effective I lost all my fat and never felt hungry in the process. It is also recommended by Firas Zahabi who is currently considered the best mma coach.&lt;/p&gt;\n\n&lt;p&gt;For your junk food binging problem: understand that sugar is addictive and works in a very similar way to cocaine - that means when you quit it, you will feel symptoms of withdrawal and first 2-4 weeks are going to suck big time, but after that you won&amp;#39;t even want to touch it. &lt;/p&gt;\n\n&lt;p&gt;For the social problem: the fact that you will get results on pure willpower is a myth. You need to control things that control you. I would seriously reconsider your friends if they keep you down just so they can feel better about themselves.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s my 0.02$ hope it helps&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgdc4j9", "score_hidden": false, "stickied": false, "created": 1492453389.0, "created_utc": 1492424589.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2pbu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgbx1xi", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I don't mind watching long videos, but could you tell me a sentence or so about what he recommends?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t mind watching long videos, but could you tell me a sentence or so about what he recommends?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd2pbu", "score_hidden": false, "stickied": false, "created": 1492430120.0, "created_utc": 1492401320.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbx1xi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Question209209", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "https://www.youtube.com/watch?v=uXMzWkzqkao", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=uXMzWkzqkao\"&gt;https://www.youtube.com/watch?v=uXMzWkzqkao&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgbx1xi", "score_hidden": false, "stickied": false, "created": 1492368301.0, "created_utc": 1492339501.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd1zr0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Tiffanniwi", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Sounds like you need to find a new therapist. You can communicate with love even though you're saying \"Hey, I don't need to have you butt into this part of my life\". It's an art and it takes practice. And if people do t respect that boundary you have to choose between being with them or not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you need to find a new therapist. You can communicate with love even though you&amp;#39;re saying &amp;quot;Hey, I don&amp;#39;t need to have you butt into this part of my life&amp;quot;. It&amp;#39;s an art and it takes practice. And if people do t respect that boundary you have to choose between being with them or not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd1zr0", "score_hidden": false, "stickied": false, "created": 1492429023.0, "created_utc": 1492400223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd3r6r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "perljen", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Very good… That makes you a good consumer of therapy. Please keep trying for one on one compatibility. You are young enough that it will make a profound difference in the long run. Thank you for responding to my post and God bless you on your progressive journey. PM me anytime. I was in the same boat as you and did come out the other side.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very good… That makes you a good consumer of therapy. Please keep trying for one on one compatibility. You are young enough that it will make a profound difference in the long run. Thank you for responding to my post and God bless you on your progressive journey. PM me anytime. I was in the same boat as you and did come out the other side.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd3r6r", "score_hidden": false, "stickied": false, "created": 1492431861.0, "created_utc": 1492403061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgdfw4i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "allsam", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "- you are fighting a losing battle if you are surrounded by pizza, chips and chocolate", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;you are fighting a losing battle if you are surrounded by pizza, chips and chocolate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgdfw4i", "score_hidden": false, "stickied": false, "created": 1492462512.0, "created_utc": 1492433712.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgd2wh1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgatp63", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I love that \"normal eating\" paper, thank you. I wonder sometimes how most people maintain their weight, because I have a hard time accepting food is in front of me and not eating it. I'll remember that, thank you for sharing. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love that &amp;quot;normal eating&amp;quot; paper, thank you. I wonder sometimes how most people maintain their weight, because I have a hard time accepting food is in front of me and not eating it. I&amp;#39;ll remember that, thank you for sharing. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd2wh1", "score_hidden": false, "stickied": false, "created": 1492430448.0, "created_utc": 1492401648.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgatp63", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "WaffleFoxes", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "It took me 15 years more of the pattern you're in now to finally stop it.  I finally learned a hard truth:\n\nYou can't out diet an emotional issue.\n\nYour body is doing its damndest to take care of you.  There's something your weight is doing for you, you have to get to the bottom of what that is.\n\nI'm seeing a dietician now who specializes in binge eating disorder.  Buckle up because you're about to be shocked at the eating plan she has prescribed:\n\nEat 6 times a day.\n\nBalance a carb and a protein.\n\nNo reading labels.\n\nNo scales.\n\nIf I want more, eat more.\n\nNo food restrictions.\n\nI'm eating less than half what I used to and am extremely satisfied because I know that nothing is against my plan.  It's no longer about willpower and discipline because I can have what I want.  It's slower, but it's working for me.  I suggest you find a therapist that specializes in eating disorders.\n\n\nAlso- my therapist gave me [this paper](https://imgur.com/a/Jblw8) on normal eating.  It might help inspire you too.\n\nFeel free to contact me if you'd like to talk about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It took me 15 years more of the pattern you&amp;#39;re in now to finally stop it.  I finally learned a hard truth:&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t out diet an emotional issue.&lt;/p&gt;\n\n&lt;p&gt;Your body is doing its damndest to take care of you.  There&amp;#39;s something your weight is doing for you, you have to get to the bottom of what that is.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m seeing a dietician now who specializes in binge eating disorder.  Buckle up because you&amp;#39;re about to be shocked at the eating plan she has prescribed:&lt;/p&gt;\n\n&lt;p&gt;Eat 6 times a day.&lt;/p&gt;\n\n&lt;p&gt;Balance a carb and a protein.&lt;/p&gt;\n\n&lt;p&gt;No reading labels.&lt;/p&gt;\n\n&lt;p&gt;No scales.&lt;/p&gt;\n\n&lt;p&gt;If I want more, eat more.&lt;/p&gt;\n\n&lt;p&gt;No food restrictions.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m eating less than half what I used to and am extremely satisfied because I know that nothing is against my plan.  It&amp;#39;s no longer about willpower and discipline because I can have what I want.  It&amp;#39;s slower, but it&amp;#39;s working for me.  I suggest you find a therapist that specializes in eating disorders.&lt;/p&gt;\n\n&lt;p&gt;Also- my therapist gave me &lt;a href=\"https://imgur.com/a/Jblw8\"&gt;this paper&lt;/a&gt; on normal eating.  It might help inspire you too.&lt;/p&gt;\n\n&lt;p&gt;Feel free to contact me if you&amp;#39;d like to talk about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgatp63", "score_hidden": false, "stickied": false, "created": 1492301932.0, "created_utc": 1492273132.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgcz9jq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "So it's Easter and I'm uncomfortably full, but I'm finally sitting down to respond to these. First--\n\nSome people asked about my friends, and I'll use an example from today to explain why I feel like I can't refuse my best friend: She brought some leftover cookies from her family over while hanging out this morning. I made sure to only eat one (I wouldn't eat more in front of another person, but if she wasn't there, I would have eaten plural). I tried to be firm, which was the last (generic) piece of advice my therapist gave me, and asked her to take the cookies home. She blatantly refused. I tried to be general but honest and said if they're around, I will for sure binge on them. And she REFUSED to take them home. I held them out and she set her arms down (before you guys think I was being rude, they were store-bought cookies and half of them were eaten when she brought them over--she didn't even ask if I wanted them). At that point I was desperate and told her she needed to take them. She said \"I can't believe you are getting so worked up about this.\" I honestly think I handled it well, and I never raised my voice or said anything rude to her, so that comment upset me and I just turned around and told her I'd see her later. *Then* she texted me later and asked if I was okay, and I beat around the bush because talking about my eating habits makes me uncomfortable, but I just sent her a long message (written in a non-accusatory way, I just told her about my eating habits which led into why I asked her to take the cookies--because I didn't want to purge that week). She took it really well and apologized and I think she understands where I'm at now. So, one friend is no longer an issue.\n\nAlso, I realistically *should* be the weight I want to be considering the time frame I gave, so I'll add some numbers. I'm 5'3.75. My highest weight was 137 pounds last May. I ate about 1200 calories a day, which turned into 900, then 800, then 500 until I was down to 112 pounds in September. Then, I don't know how it happened, but I binged my way back up to 125 about two months ago. Then I starved myself down to 120 (most days I only ate one apple with half a tablespoon of melted peanut butter). I'm about 125 again. I've always stayed between 115 and 130 pounds, which to be honest is a large range. This past year has been the worst for me as far as binge eating goes.\n\nAnyway, I've eaten 62 gingersnaps over the past two days, and I made myself puke in the bathroom during a comedy show yesterday, so reading these should be the highlight of my weekend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So it&amp;#39;s Easter and I&amp;#39;m uncomfortably full, but I&amp;#39;m finally sitting down to respond to these. First--&lt;/p&gt;\n\n&lt;p&gt;Some people asked about my friends, and I&amp;#39;ll use an example from today to explain why I feel like I can&amp;#39;t refuse my best friend: She brought some leftover cookies from her family over while hanging out this morning. I made sure to only eat one (I wouldn&amp;#39;t eat more in front of another person, but if she wasn&amp;#39;t there, I would have eaten plural). I tried to be firm, which was the last (generic) piece of advice my therapist gave me, and asked her to take the cookies home. She blatantly refused. I tried to be general but honest and said if they&amp;#39;re around, I will for sure binge on them. And she REFUSED to take them home. I held them out and she set her arms down (before you guys think I was being rude, they were store-bought cookies and half of them were eaten when she brought them over--she didn&amp;#39;t even ask if I wanted them). At that point I was desperate and told her she needed to take them. She said &amp;quot;I can&amp;#39;t believe you are getting so worked up about this.&amp;quot; I honestly think I handled it well, and I never raised my voice or said anything rude to her, so that comment upset me and I just turned around and told her I&amp;#39;d see her later. &lt;em&gt;Then&lt;/em&gt; she texted me later and asked if I was okay, and I beat around the bush because talking about my eating habits makes me uncomfortable, but I just sent her a long message (written in a non-accusatory way, I just told her about my eating habits which led into why I asked her to take the cookies--because I didn&amp;#39;t want to purge that week). She took it really well and apologized and I think she understands where I&amp;#39;m at now. So, one friend is no longer an issue.&lt;/p&gt;\n\n&lt;p&gt;Also, I realistically &lt;em&gt;should&lt;/em&gt; be the weight I want to be considering the time frame I gave, so I&amp;#39;ll add some numbers. I&amp;#39;m 5&amp;#39;3.75. My highest weight was 137 pounds last May. I ate about 1200 calories a day, which turned into 900, then 800, then 500 until I was down to 112 pounds in September. Then, I don&amp;#39;t know how it happened, but I binged my way back up to 125 about two months ago. Then I starved myself down to 120 (most days I only ate one apple with half a tablespoon of melted peanut butter). I&amp;#39;m about 125 again. I&amp;#39;ve always stayed between 115 and 130 pounds, which to be honest is a large range. This past year has been the worst for me as far as binge eating goes.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I&amp;#39;ve eaten 62 gingersnaps over the past two days, and I made myself puke in the bathroom during a comedy show yesterday, so reading these should be the highlight of my weekend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgcz9jq", "score_hidden": false, "stickied": false, "created": 1492425135.0, "created_utc": 1492396335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65i8iu", "likes": null, "replies": "", "user_reports": [], "id": "dgde4ac", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jabberhakke", "parent_id": "t1_dgd2qj0", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "That's great! I hope that makes things easier for you. I had success having that conversation with many of my family/friends. My cousin is most of my social life, and we meet every week to watch movies. We used to order pizza, but we began cooking instead, and now the cooking has become as big a part of our entertainment as the movies.  \n\nI do have some family members who get offended if I don't eat second helpings of their cooking, my strategy is asking for leftovers to go. \"I'm too full right now, but I'd love to take some for lunch tomorrow because it was so delicious\". If you have those situations, maybe that response could work for you too.  \n\nBest of luck!!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s great! I hope that makes things easier for you. I had success having that conversation with many of my family/friends. My cousin is most of my social life, and we meet every week to watch movies. We used to order pizza, but we began cooking instead, and now the cooking has become as big a part of our entertainment as the movies.  &lt;/p&gt;\n\n&lt;p&gt;I do have some family members who get offended if I don&amp;#39;t eat second helpings of their cooking, my strategy is asking for leftovers to go. &amp;quot;I&amp;#39;m too full right now, but I&amp;#39;d love to take some for lunch tomorrow because it was so delicious&amp;quot;. If you have those situations, maybe that response could work for you too.  &lt;/p&gt;\n\n&lt;p&gt;Best of luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgde4ac", "score_hidden": false, "stickied": false, "created": 1492458899.0, "created_utc": 1492430099.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2qj0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OuEstLaPiscine", "parent_id": "t1_dgaldiy", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I just told one tonight and she was pretty understanding. I won't see her for a week so I'll seen then how she behaves when we are actually around food, but she hasn't pushed the issue at all as of right now. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just told one tonight and she was pretty understanding. I won&amp;#39;t see her for a week so I&amp;#39;ll seen then how she behaves when we are actually around food, but she hasn&amp;#39;t pushed the issue at all as of right now. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd2qj0", "score_hidden": false, "stickied": false, "created": 1492430177.0, "created_utc": 1492401377.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaldiy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jabberhakke", "parent_id": "t3_65i8iu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "This doesn't sound like a discipline issue to me, this sounds like a body image/self esteem issue, and you need to address those underlying problems. If therapy wasn't working, find a different therapist.  \n\nIt also sounds like your friends don't understand how serious this issue is for you. Have you told them? It might be a good thing for them to learn not to push food at people, since so many people struggle with their weight and diet (you won't be the only one they ever meet!) If they do understand and they continue to talk to you this way, it might be time to find new friends. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This doesn&amp;#39;t sound like a discipline issue to me, this sounds like a body image/self esteem issue, and you need to address those underlying problems. If therapy wasn&amp;#39;t working, find a different therapist.  &lt;/p&gt;\n\n&lt;p&gt;It also sounds like your friends don&amp;#39;t understand how serious this issue is for you. Have you told them? It might be a good thing for them to learn not to push food at people, since so many people struggle with their weight and diet (you won&amp;#39;t be the only one they ever meet!) If they do understand and they continue to talk to you this way, it might be time to find new friends. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgaldiy", "score_hidden": false, "stickied": false, "created": 1492288199.0, "created_utc": 1492259399.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]