[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=XozPzXuv8do\"&gt;Video (6 mins)&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Hey &lt;a href=\"/r/getdisciplined\"&gt;/r/getdisciplined&lt;/a&gt;. I orginally wrote this post for &lt;a href=\"/r/nosurf\"&gt;/r/nosurf&lt;/a&gt; but would like to cross post it here because one thing that has stood in the way of my self-discipline in the past is my laptop/phone use. I&amp;#39;m sure some of you guys have realized this in your own lives and I wouldn&amp;#39;t be surprised if many of you haven&amp;#39;t already taken disciplined steps with regards to your social media/reddit/internet surfing. For those of you who are still struggling with wasting a lot of time online, I think this discussion can really help, and it&amp;#39;s exactly why I&amp;#39;m sharing this post with you today.&lt;/p&gt;\n\n&lt;p&gt;My video was inspired by an essay I read called &lt;a href=\"http://www.forumromanum.org/literature/seneca_younger/brev_e.html\"&gt;&amp;quot;On the Shortness of Life&amp;quot;&lt;/a&gt; by Lucius Annaeus Seneca, a famous stoic philosopher. It made me sit down and reflect on the way I viewed my time and the rest of my life. I realized that internally I&amp;#39;ve been holding the belief that I have a long stretch of life ahead of me, when this is far from a reasonable guarantee.&lt;/p&gt;\n\n&lt;p&gt;I came to the conclusion that this kind of thinking is not only irrational, but has held me back for the majority of my life. A famous criticism of immortality is that most people would sit idly by instead of doing things because after all, they&amp;#39;d have all the time in the world to eventually get around to it. When you imagine a long life ahead of you, hints of this lethargy creep in. Or rather, maybe not so much that hints of lethargy creep in, but &lt;em&gt;you lose the urgency that reality demands of you.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The truth is that we can only count on &lt;strong&gt;today.&lt;/strong&gt; This truth not only calls for immediate action, it inspires it. It&amp;#39;s one of the best remedies for people struggling with the way they spend time, especially on the internet using phones and laptops. Your actions stem from your outlooks. When you change the way you view this minute, this hour, this day, you change the way you spend them. When you change the way you view what remains of this life, &lt;em&gt;you change the way you live it.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Video (6 mins)](https://www.youtube.com/watch?v=XozPzXuv8do)\n______________________________________________________________\nHey /r/getdisciplined. I orginally wrote this post for /r/nosurf but would like to cross post it here because one thing that has stood in the way of my self-discipline in the past is my laptop/phone use. I'm sure some of you guys have realized this in your own lives and I wouldn't be surprised if many of you haven't already taken disciplined steps with regards to your social media/reddit/internet surfing. For those of you who are still struggling with wasting a lot of time online, I think this discussion can really help, and it's exactly why I'm sharing this post with you today.\n\nMy video was inspired by an essay I read called [\"On the Shortness of Life\"](http://www.forumromanum.org/literature/seneca_younger/brev_e.html) by Lucius Annaeus Seneca, a famous stoic philosopher. It made me sit down and reflect on the way I viewed my time and the rest of my life. I realized that internally I've been holding the belief that I have a long stretch of life ahead of me, when this is far from a reasonable guarantee.\n\nI came to the conclusion that this kind of thinking is not only irrational, but has held me back for the majority of my life. A famous criticism of immortality is that most people would sit idly by instead of doing things because after all, they'd have all the time in the world to eventually get around to it. When you imagine a long life ahead of you, hints of this lethargy creep in. Or rather, maybe not so much that hints of lethargy creep in, but *you lose the urgency that reality demands of you.*\n\nThe truth is that we can only count on **today.** This truth not only calls for immediate action, it inspires it. It's one of the best remedies for people struggling with the way they spend time, especially on the internet using phones and laptops. Your actions stem from your outlooks. When you change the way you view this minute, this hour, this day, you change the way you spend them. When you change the way you view what remains of this life, *you change the way you live it.*", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65sch1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Thunderbolt_Tzu", "saved": false, "mod_reports": [], "name": "t3_65sch1", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65sch1/advice_on_the_shortness_of_life_and_wasting_time/", "num_reports": null, "locked": false, "stickied": false, "created": 1492416777.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65sch1/advice_on_the_shortness_of_life_and_wasting_time/", "author_flair_text": null, "quarantine": false, "title": "[Advice] On the shortness of life and wasting time online", "created_utc": 1492387977.0, "distinguished": null, "media": null, "upvote_ratio": 0.68, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65sch1", "likes": null, "replies": "", "user_reports": [], "id": "dgd6ysz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aznology", "parent_id": "t3_65sch1", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Yes, but sometimes there is a tomorrow, Buddhist suggest a Middle Path. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, but sometimes there is a tomorrow, Buddhist suggest a Middle Path. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgd6ysz", "score_hidden": false, "stickied": false, "created": 1492438179.0, "created_utc": 1492409379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]