[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t seem to push myself to be more ambitious at work. My career allows me to take certification exams that will improve my salary and responsibilities resulting in a significant salary bump, however the increase in salary just can&amp;#39;t motivate me enough to take the time to study. I have the time. I just moved to a new city and have a close to non-existent social life so time is not the issue. I don&amp;#39;t &amp;quot;need&amp;quot; the extra money and it&amp;#39;s maybe because I don&amp;#39;t want it enough to put in the time to study for these damn exams... I do good work. If I can find a career that allows me to avoid these damn exams altogether, then I will definitely make the switch. &lt;/p&gt;\n\n&lt;p&gt;The reason I ask why I wonder if discipline is a finite resourse is that I am disciplined in other facets of my life. I work out religiously, in fact I enjoy working out. I am very tidy, I read books. I used to hate cooking and now I cook more meals than I eat out. I just can&amp;#39;t understand why I can&amp;#39;t push myself to do these exams? Everyone in my life seems to think I am crazy for not doing them. My coworkers think I&amp;#39;m nuts. &lt;/p&gt;\n\n&lt;p&gt;Anybody else find themselves in the same boat? Can people just be naturally disciplined in ALL facets of their lives? OR is &amp;quot;discipline&amp;quot; by definition doing something you&amp;#39;d rather not do. I work out because it makes me feel better about myself so I like doing it. So because I like doing it, does it mean that it doesn&amp;#39;t require discipline and that I&amp;#39;m just lazy by not writing these exams?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I can't seem to push myself to be more ambitious at work. My career allows me to take certification exams that will improve my salary and responsibilities resulting in a significant salary bump, however the increase in salary just can't motivate me enough to take the time to study. I have the time. I just moved to a new city and have a close to non-existent social life so time is not the issue. I don't \"need\" the extra money and it's maybe because I don't want it enough to put in the time to study for these damn exams... I do good work. If I can find a career that allows me to avoid these damn exams altogether, then I will definitely make the switch. \n\nThe reason I ask why I wonder if discipline is a finite resourse is that I am disciplined in other facets of my life. I work out religiously, in fact I enjoy working out. I am very tidy, I read books. I used to hate cooking and now I cook more meals than I eat out. I just can't understand why I can't push myself to do these exams? Everyone in my life seems to think I am crazy for not doing them. My coworkers think I'm nuts. \n\nAnybody else find themselves in the same boat? Can people just be naturally disciplined in ALL facets of their lives? OR is \"discipline\" by definition doing something you'd rather not do. I work out because it makes me feel better about myself so I like doing it. So because I like doing it, does it mean that it doesn't require discipline and that I'm just lazy by not writing these exams?\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ue9c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 20, "report_reasons": null, "author": "ButtSweatandFears", "saved": false, "mod_reports": [], "name": "t3_65ue9c", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65ue9c/discussion_is_discipline_a_finite_resource_or_is/", "num_reports": null, "locked": false, "stickied": false, "created": 1492446811.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65ue9c/discussion_is_discipline_a_finite_resource_or_is/", "author_flair_text": null, "quarantine": false, "title": "[Discussion] is discipline a finite resource or is it by definition, the will power to do something you'd rather not do?", "created_utc": 1492418011.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65ue9c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65ue9c", "likes": null, "replies": "", "user_reports": [], "id": "dgdmzqe", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ILikeGrilledPumpkin", "parent_id": "t1_dgdevcx", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Thanks for the well-written post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the well-written post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgdmzqe", "score_hidden": false, "stickied": false, "created": 1492472390.0, "created_utc": 1492443590.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdevcx", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Dux0r", "parent_id": "t3_65ue9c", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Neither, it's a process which makes doing things you don't want to do more likely or occur more often.\n\nMotivation and discipline aren't things you should strive for in and of themselves- you should strive to get whatever it is you want to get done, done, and discipline and motivation develop as a result, over time. Motivation has never been a barrier to entry and never will- that's the lie the self help industry is sold on. Like anything in life, simply doing what's required is the only way to do what's required, but discipline is the process of mitigating the negatives of that.\n\nIn your salary raise example your lack of motivation is irrelevant- either you want it or you don't- deciding whether you want it or not is best left to rationale like comparing pros and cons of with and without the raise, etc. Once you've decided it's something you don't want it's a non issue, or once you've decided it's something you want the frustration of dealing with the exams becomes part of the process. Motivation should never be a factor when you utilise discipline.\n\nAssuming you've made the choice that the increase in salary is the best choice you might set aside 1 hour per day to study, this low barrier to entry means you're able to build discipline immediately and less likely to give up or get distracted. Again, no motivation anywhere to be seen.\n\n&gt;Can people just be naturally disciplined in ALL facets of their lives? OR is \"discipline\" by definition doing something you'd rather not do.\n\nAgain, neither. It's a process of habit building and best practices which help get things done and minimise frustration when facing obstacles or dealing with stresses etc. Nobody is naturally disciplined, no.\n\n&gt;I work out because it makes me feel better about myself so I like doing it. \n\n\nSimilarly, I love to work out because I know the benefits. But when I started out I hated every minute of it because I was in discomfort and pain and wasting hours of time without knowing if there'd be any changes or benefits. But I'd made the choice to work out regularly for the rest of my life and there was no reason to doubt the rationale that it would make me fitter, healthier and happier, so I simply kept suffering until one day it didn't suck any more. Only discipline helped me accomplish that routine and habit, so much so that at times I aimed to simply have the discipline to turn up at the gym and work out for 5 minutes.\n\nIt still requires discipline because I still deal with mild frustrations like  not hitting my PRs, and dealing with poor grip and things, but like anything, it's become simpler with repetition and habit and requires much less discipline and far less often.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Neither, it&amp;#39;s a process which makes doing things you don&amp;#39;t want to do more likely or occur more often.&lt;/p&gt;\n\n&lt;p&gt;Motivation and discipline aren&amp;#39;t things you should strive for in and of themselves- you should strive to get whatever it is you want to get done, done, and discipline and motivation develop as a result, over time. Motivation has never been a barrier to entry and never will- that&amp;#39;s the lie the self help industry is sold on. Like anything in life, simply doing what&amp;#39;s required is the only way to do what&amp;#39;s required, but discipline is the process of mitigating the negatives of that.&lt;/p&gt;\n\n&lt;p&gt;In your salary raise example your lack of motivation is irrelevant- either you want it or you don&amp;#39;t- deciding whether you want it or not is best left to rationale like comparing pros and cons of with and without the raise, etc. Once you&amp;#39;ve decided it&amp;#39;s something you don&amp;#39;t want it&amp;#39;s a non issue, or once you&amp;#39;ve decided it&amp;#39;s something you want the frustration of dealing with the exams becomes part of the process. Motivation should never be a factor when you utilise discipline.&lt;/p&gt;\n\n&lt;p&gt;Assuming you&amp;#39;ve made the choice that the increase in salary is the best choice you might set aside 1 hour per day to study, this low barrier to entry means you&amp;#39;re able to build discipline immediately and less likely to give up or get distracted. Again, no motivation anywhere to be seen.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Can people just be naturally disciplined in ALL facets of their lives? OR is &amp;quot;discipline&amp;quot; by definition doing something you&amp;#39;d rather not do.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Again, neither. It&amp;#39;s a process of habit building and best practices which help get things done and minimise frustration when facing obstacles or dealing with stresses etc. Nobody is naturally disciplined, no.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I work out because it makes me feel better about myself so I like doing it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Similarly, I love to work out because I know the benefits. But when I started out I hated every minute of it because I was in discomfort and pain and wasting hours of time without knowing if there&amp;#39;d be any changes or benefits. But I&amp;#39;d made the choice to work out regularly for the rest of my life and there was no reason to doubt the rationale that it would make me fitter, healthier and happier, so I simply kept suffering until one day it didn&amp;#39;t suck any more. Only discipline helped me accomplish that routine and habit, so much so that at times I aimed to simply have the discipline to turn up at the gym and work out for 5 minutes.&lt;/p&gt;\n\n&lt;p&gt;It still requires discipline because I still deal with mild frustrations like  not hitting my PRs, and dealing with poor grip and things, but like anything, it&amp;#39;s become simpler with repetition and habit and requires much less discipline and far less often.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgdevcx", "score_hidden": false, "stickied": false, "created": 1492460547.0, "created_utc": 1492431747.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65ue9c", "likes": null, "replies": "", "user_reports": [], "id": "dgdcosb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jabberhakke", "parent_id": "t3_65ue9c", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "This is just a hunch and could be wrong, but perhaps this is a signal that you are dissatisfied with your field as a whole? Is there an entirely different area of work that appeals to you more?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is just a hunch and could be wrong, but perhaps this is a signal that you are dissatisfied with your field as a whole? Is there an entirely different area of work that appeals to you more?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgdcosb", "score_hidden": false, "stickied": false, "created": 1492455152.0, "created_utc": 1492426352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65ue9c", "likes": null, "replies": "", "user_reports": [], "id": "dgdobtd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Retro21", "parent_id": "t3_65ue9c", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "Have you ever failed anything? Might it be you are scared to fail? Would sitting a mock one give you the wake up call you need? \n\nAnother thing that might motivate you is to think about what the money means in the future, for when you have a family to support or want to retire? \n\nAlternatively, if there is no time limit on the exams, just leave them until you *do* feel motivated. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever failed anything? Might it be you are scared to fail? Would sitting a mock one give you the wake up call you need? &lt;/p&gt;\n\n&lt;p&gt;Another thing that might motivate you is to think about what the money means in the future, for when you have a family to support or want to retire? &lt;/p&gt;\n\n&lt;p&gt;Alternatively, if there is no time limit on the exams, just leave them until you &lt;em&gt;do&lt;/em&gt; feel motivated. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgdobtd", "score_hidden": false, "stickied": false, "created": 1492473917.0, "created_utc": 1492445117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]