[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "getdisciplined", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Genuine question: &amp;quot;It&amp;#39;s Not What You Know. It&amp;#39;s Who You Know&amp;quot; - &lt;/p&gt;\n\n&lt;p&gt;This advice keeps popping up from time to time and is tearing me apart. Should I keep spend my time studying or just enjoy life and socialize more? I can see how others can achieve more just by being a nice person, relaxed, and maybe not that technical.&lt;/p&gt;\n\n&lt;p&gt;But here I read you have to push your limits which was always my intuitive belief as well. Just focus on your goal, exclude everything and f**k everybody else. But this burns me out, I&amp;#39;m not a fun person to be around, limits my possibilities in other ways and obviously not a good way to be.&lt;/p&gt;\n\n&lt;p&gt;Thinking about this the Whiplash (2014) movie comes to my mind where the instructor is a jerk and I don&amp;#39;t think he would have been able to get results out of people in real life. The kid works hard, but maybe if he&amp;#39;s a cool fun guy he could have been happier with the girl on his side? Staying at home drumming will make you happy up to a point; I read some articles on the internet (so it must be true lol) that people who are connected the happiest just because how humans are wired.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m confused here, I guess balance would be the key but I&amp;#39;m interested in different points of view. Some inspiration is also welcome (similar movies, books or quotes), I&amp;#39;m feeling a bit depressed at the moment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Genuine question: \"It's Not What You Know. It's Who You Know\" - \n\nThis advice keeps popping up from time to time and is tearing me apart. Should I keep spend my time studying or just enjoy life and socialize more? I can see how others can achieve more just by being a nice person, relaxed, and maybe not that technical.\n\nBut here I read you have to push your limits which was always my intuitive belief as well. Just focus on your goal, exclude everything and f**k everybody else. But this burns me out, I'm not a fun person to be around, limits my possibilities in other ways and obviously not a good way to be.\n\nThinking about this the Whiplash (2014) movie comes to my mind where the instructor is a jerk and I don't think he would have been able to get results out of people in real life. The kid works hard, but maybe if he's a cool fun guy he could have been happier with the girl on his side? Staying at home drumming will make you happy up to a point; I read some articles on the internet (so it must be true lol) that people who are connected the happiest just because how humans are wired.\n\nSo I'm confused here, I guess balance would be the key but I'm interested in different points of view. Some inspiration is also welcome (similar movies, books or quotes), I'm feeling a bit depressed at the moment.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wuuu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "leviathaan", "saved": false, "mod_reports": [], "name": "t3_65wuuu", "subreddit_name_prefixed": "r/getdisciplined", "approved_by": null, "over_18": false, "domain": "self.getdisciplined", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2uzju", "author_cakeday": true, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/getdisciplined/comments/65wuuu/needadvice_knowing_your_stuff_vs_knowing_people/", "num_reports": null, "locked": false, "stickied": false, "created": 1492477711.0, "url": "https://www.reddit.com/r/getdisciplined/comments/65wuuu/needadvice_knowing_your_stuff_vs_knowing_people/", "author_flair_text": null, "quarantine": false, "title": "[NeedAdvice] Knowing your stuff vs Knowing people", "created_utc": 1492448911.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2uzju", "removal_reason": null, "link_id": "t3_65wuuu", "likes": null, "replies": "", "user_reports": [], "id": "dgdxopn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KrozFan", "parent_id": "t3_65wuuu", "subreddit_name_prefixed": "r/getdisciplined", "controversiality": 0, "body": "I set goals in seven areas of my life, financial, physical, social, personal development, spiritual, family, and career.  The worksheets and method I use are in [the wiki](https://www.reddit.com/r/GetMotivated/wiki/) of /r/GetMotivated.  So I don't sacrifice time with friends for \"success\".  I'll be playing poker with some friends tonight, like I do almost every Monday night, and I do that because it's part of my goals.  I don't do it in spite of my goals.  (I do it because it's fun too but we're talking about working towards goals and achieving things right now.)\n\nI don't agree with everything you've read here.  Maybe I just don't agree with the interpretation or the sound byte nature of them.  \n\n&gt; Just focus on your goal\n\nGoals.  Plural.  Again, tonight I'm focusing on some of my goals by going out and playing cards.  Focus on your goals instead of watching TV.  Focus on your goals instead of eating garbage.  Focus on your goals by going out with friends because it's important to you.\n\n&gt; exclude everything\n\nSame basic thing.  Exclude the things that aren't important.  \n\n&gt; f**k everybody else\n\nI don't think this is really meant to be leave people behind.  I think a lot of it is towards the people who drag you down.  I'm typically one of the first to leave poker every week because I go home to go to bed.  I spend time with my friends and I enjoy it but I don't get completely sidetracked.  I don't let time with my friends interfere with my health or my job.  \n\nAlso, your original question about \"It's not what you know.  It's who you know\" is really geared towards jobs.  It's because your network can help you find jobs before they get posted to the whole world.  You still need the knowledge to do the job though.  You may have a friend who can point you in the right direction for some of your other goals but it's still a lot about what you know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I set goals in seven areas of my life, financial, physical, social, personal development, spiritual, family, and career.  The worksheets and method I use are in &lt;a href=\"https://www.reddit.com/r/GetMotivated/wiki/\"&gt;the wiki&lt;/a&gt; of &lt;a href=\"/r/GetMotivated\"&gt;/r/GetMotivated&lt;/a&gt;.  So I don&amp;#39;t sacrifice time with friends for &amp;quot;success&amp;quot;.  I&amp;#39;ll be playing poker with some friends tonight, like I do almost every Monday night, and I do that because it&amp;#39;s part of my goals.  I don&amp;#39;t do it in spite of my goals.  (I do it because it&amp;#39;s fun too but we&amp;#39;re talking about working towards goals and achieving things right now.)&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t agree with everything you&amp;#39;ve read here.  Maybe I just don&amp;#39;t agree with the interpretation or the sound byte nature of them.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Just focus on your goal&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Goals.  Plural.  Again, tonight I&amp;#39;m focusing on some of my goals by going out and playing cards.  Focus on your goals instead of watching TV.  Focus on your goals instead of eating garbage.  Focus on your goals by going out with friends because it&amp;#39;s important to you.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;exclude everything&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Same basic thing.  Exclude the things that aren&amp;#39;t important.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;f**k everybody else&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think this is really meant to be leave people behind.  I think a lot of it is towards the people who drag you down.  I&amp;#39;m typically one of the first to leave poker every week because I go home to go to bed.  I spend time with my friends and I enjoy it but I don&amp;#39;t get completely sidetracked.  I don&amp;#39;t let time with my friends interfere with my health or my job.  &lt;/p&gt;\n\n&lt;p&gt;Also, your original question about &amp;quot;It&amp;#39;s not what you know.  It&amp;#39;s who you know&amp;quot; is really geared towards jobs.  It&amp;#39;s because your network can help you find jobs before they get posted to the whole world.  You still need the knowledge to do the job though.  You may have a friend who can point you in the right direction for some of your other goals but it&amp;#39;s still a lot about what you know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "getdisciplined", "name": "t1_dgdxopn", "score_hidden": false, "stickied": false, "created": 1492484354.0, "created_utc": 1492455554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]