[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "femalefashionadvice", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m one of those total fashion newbies who has been carefully reading through the various FFA guides to get up to speed. I recently decided to supplement it with MFA, and I noticed that their Color Guides are pretty different from FFA&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;In particular, the FFA color guide emphasizes dressing for YOUR complexion. If you google &amp;quot;femalefashionadvice color season&amp;quot; the results are uniformly about the &amp;quot;seasonal color analysis&amp;quot; that groups people by complexion.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, MFA seems to place a high emphasis on dressing for THE season- wearing summery colors in the summer and wintry colors in the winter etc.&lt;/p&gt;\n\n&lt;p&gt;Of course, those aren&amp;#39;t necessarily incompatible goals. There are all sorts of tricks you can employ to do both: stick to the &amp;quot;summer end&amp;quot; of the colors that look good on you on the summer, mix and match colors that look good on you but aren&amp;#39;t seasonal-appropriate with colors that don&amp;#39;t but are, etc.&lt;/p&gt;\n\n&lt;p&gt;Still, I just found the disparity in focus interesting. I&amp;#39;ve been thinking about it especially because well... I look amazing in deep brown. I don&amp;#39;t even like brown all that much, but there&amp;#39;s no ignoring that it is one of my best colors, so I use it as a neutral and pair it with colors that I like- but doing so always make the outfit give off a &amp;quot;fall&amp;quot;/&amp;quot;coffeeshop&amp;quot; vibe, regardless of how summery the rest of the outfit might look. Very few &amp;quot;summer neutrals&amp;quot; look as good on me. (I&amp;#39;m an Autumn.)&lt;/p&gt;\n\n&lt;p&gt;As I look towards my summer wardrobe, I&amp;#39;m wondering if I should ditch brown for the season and stick to summer neutrals, or at least neutrals that aren&amp;#39;t as in-your-face about fitting into a different season. On the other hand, I don&amp;#39;t particularly care about looking fashionable (as long as I don&amp;#39;t look dowdy)- I care much more about looking good.&lt;/p&gt;\n\n&lt;p&gt;I dunno. FFA, what do you personally prioritize in a seasonal wardrobe?&lt;/p&gt;\n\n&lt;p&gt;(Sorry if this question has been posed before, as I noted, it&amp;#39;s sort of hard to google!)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I'm one of those total fashion newbies who has been carefully reading through the various FFA guides to get up to speed. I recently decided to supplement it with MFA, and I noticed that their Color Guides are pretty different from FFA's.\n\nIn particular, the FFA color guide emphasizes dressing for YOUR complexion. If you google \"femalefashionadvice color season\" the results are uniformly about the \"seasonal color analysis\" that groups people by complexion.\n\nOn the other hand, MFA seems to place a high emphasis on dressing for THE season- wearing summery colors in the summer and wintry colors in the winter etc.\n\nOf course, those aren't necessarily incompatible goals. There are all sorts of tricks you can employ to do both: stick to the \"summer end\" of the colors that look good on you on the summer, mix and match colors that look good on you but aren't seasonal-appropriate with colors that don't but are, etc.\n\nStill, I just found the disparity in focus interesting. I've been thinking about it especially because well... I look amazing in deep brown. I don't even like brown all that much, but there's no ignoring that it is one of my best colors, so I use it as a neutral and pair it with colors that I like- but doing so always make the outfit give off a \"fall\"/\"coffeeshop\" vibe, regardless of how summery the rest of the outfit might look. Very few \"summer neutrals\" look as good on me. (I'm an Autumn.)\n\nAs I look towards my summer wardrobe, I'm wondering if I should ditch brown for the season and stick to summer neutrals, or at least neutrals that aren't as in-your-face about fitting into a different season. On the other hand, I don't particularly care about looking fashionable (as long as I don't look dowdy)- I care much more about looking good.\n\nI dunno. FFA, what do you personally prioritize in a seasonal wardrobe?\n\n(Sorry if this question has been posed before, as I noted, it's sort of hard to google!)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wl0p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 69, "report_reasons": null, "author": "backpackquestionffa", "saved": false, "mod_reports": [], "name": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "approved_by": null, "over_18": false, "domain": "self.femalefashionadvice", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2s8o5", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/femalefashionadvice/comments/65wl0p/color_dressing_for_your_season_vs_dressing_for/", "num_reports": null, "locked": false, "stickied": false, "created": 1492475162.0, "url": "https://www.reddit.com/r/femalefashionadvice/comments/65wl0p/color_dressing_for_your_season_vs_dressing_for/", "author_flair_text": null, "quarantine": false, "title": "Color: dressing for your season vs. dressing for the season", "created_utc": 1492446362.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 26, "visited": false, "subreddit_type": "public", "ups": 69}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgdrha5", "gilded": 0, "archived": false, "score": 97, "report_reasons": null, "author": "groovyfinch", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I think dressing for a season is as much about the texture, weight, and drape of your clothes as it is about color.\n\nMy palette is black, charcoal, navy, teal, white, off-white, and pink. I'm not radically changing my color choices for summer, just the cut and weight of the clothes I wear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think dressing for a season is as much about the texture, weight, and drape of your clothes as it is about color.&lt;/p&gt;\n\n&lt;p&gt;My palette is black, charcoal, navy, teal, white, off-white, and pink. I&amp;#39;m not radically changing my color choices for summer, just the cut and weight of the clothes I wear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdrha5", "score_hidden": false, "stickied": false, "created": 1492477432.0, "created_utc": 1492448632.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 97}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dge6zw4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "hd_21", "parent_id": "t1_dge59lq", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I totally agree on all points.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I totally agree on all points.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dge6zw4", "score_hidden": false, "stickied": false, "created": 1492495090.0, "created_utc": 1492466290.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dge59lq", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "justgoodenough", "parent_id": "t1_dge4agl", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "Oh, I think that men can really benefit from a little bit of color analysis. I think people notice it less when a color doesn't really compliment a man's complexion, but when it works? Wow. \n\nAnyway, my point was really that MFA and FFA are going to approach the topic of colors really differently because color has not played the same role in men's fashion, traditionally, as it has in women's fashion. Also, the majority of the users seeking advice on MFA are not looking for such individualized guidance in general. They are more like \"give me a checklist and when I do everything, I will look good\" and FFA is more like, \"clothing as a creative outlet.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, I think that men can really benefit from a little bit of color analysis. I think people notice it less when a color doesn&amp;#39;t really compliment a man&amp;#39;s complexion, but when it works? Wow. &lt;/p&gt;\n\n&lt;p&gt;Anyway, my point was really that MFA and FFA are going to approach the topic of colors really differently because color has not played the same role in men&amp;#39;s fashion, traditionally, as it has in women&amp;#39;s fashion. Also, the majority of the users seeking advice on MFA are not looking for such individualized guidance in general. They are more like &amp;quot;give me a checklist and when I do everything, I will look good&amp;quot; and FFA is more like, &amp;quot;clothing as a creative outlet.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dge59lq", "score_hidden": false, "stickied": false, "created": 1492492956.0, "created_utc": 1492464156.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dge4agl", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "hd_21", "parent_id": "t1_dgdy66x", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "&gt;[V]ery rarely will someone look at a man and ask if he is \"tired\" or sick because he wore the wrong shade of blue that day.\n\nI think this is true, and yet, men do have colors that work better for them than others. It wouldn't hurt them to learn a little about color analysis if they're interested (and I know that many aren't interested and that's fine too). I've thought a lot about my husband's \"season\" just because I'm interested in color and spend a lot of time looking at him (lol). He wears a lot of different colors and I have noticed that some do more for him than others. I'm a light summer so I have a pretty restricted palette myself, and it's kind of fun to see what other people can get away with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;[V]ery rarely will someone look at a man and ask if he is &amp;quot;tired&amp;quot; or sick because he wore the wrong shade of blue that day.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think this is true, and yet, men do have colors that work better for them than others. It wouldn&amp;#39;t hurt them to learn a little about color analysis if they&amp;#39;re interested (and I know that many aren&amp;#39;t interested and that&amp;#39;s fine too). I&amp;#39;ve thought a lot about my husband&amp;#39;s &amp;quot;season&amp;quot; just because I&amp;#39;m interested in color and spend a lot of time looking at him (lol). He wears a lot of different colors and I have noticed that some do more for him than others. I&amp;#39;m a light summer so I have a pretty restricted palette myself, and it&amp;#39;s kind of fun to see what other people can get away with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dge4agl", "score_hidden": false, "stickied": false, "created": 1492491792.0, "created_utc": 1492462992.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dge9fua", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Drakkanrider", "parent_id": "t1_dgdy66x", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "&gt; Men's clothing actually has a much more restricted color palette than women's clothing, so even if a man decided that he wanted an orange shirt, finding the perfect orange to compliment his complexion in a style that he wants is... Not easy.\n\nThis is endlessly frustrating for my bf and I.  He has a springy/bright wintery coloring and looks amazing in bright, cool, saturated blues, greens, and yellows.  Basically de-pastel an easter palette and put it on his body and he suddenly looks 5 years younger and like he's never missed an hour of sleep in his life.  But it is IMPOSSIBLE to find men's shirts in those colors.  It's such a shame!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Men&amp;#39;s clothing actually has a much more restricted color palette than women&amp;#39;s clothing, so even if a man decided that he wanted an orange shirt, finding the perfect orange to compliment his complexion in a style that he wants is... Not easy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is endlessly frustrating for my bf and I.  He has a springy/bright wintery coloring and looks amazing in bright, cool, saturated blues, greens, and yellows.  Basically de-pastel an easter palette and put it on his body and he suddenly looks 5 years younger and like he&amp;#39;s never missed an hour of sleep in his life.  But it is IMPOSSIBLE to find men&amp;#39;s shirts in those colors.  It&amp;#39;s such a shame!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dge9fua", "score_hidden": false, "stickied": false, "created": 1492498222.0, "created_utc": 1492469422.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy66x", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "justgoodenough", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I'm not surprised that there is this difference because, frankly, there is a lot less scrutiny on men's appearance. This is not to say that their appearance isn't important, but very rarely will someone look at a man and ask if he is \"tired\" or sick because he wore the wrong shade of blue that day. It's just not the most important factor when people take in a man's appearance.\n\nMen's clothing actually has a *much* more restricted color palette than women's clothing, so even if a man decided that he wanted an orange shirt, finding the perfect orange to compliment his complexion in a style that he wants is... Not easy. In fact, all the orange shirts in stores will probably be the same type of orange that happens to be trendy that year or maybe just a deep, rusty orange because people think of that as a masculine color. Anyway, my point is that due to the limitations of what is available for men, they don't really even have the option of choosing their colors based on what looks best with their complexion.\n\nAs another user mentioned, seasonal clothing is as much about weight and texture as it is about color. A thick wool coat still reads as winter, even if it's white. A black dress can read as summer if it's sleeveless and linen. A brown shirt could still seem summery if the sleeves are rolled and it's worn untucked over denim shorts. But when you put that shirt on under a sweater and pair it with jeans and ankle boots, it reads as fall or winter.\n\nIf people find that they look best in certain colors, but those colors are often associated with a real season (like light pink is great for spring or mustard is good for fall), I would recommend that they put those colors near their face and then use the rest of their outfit to try and set the tone in terms of the actual season/weather. So if you look great in light pink, maybe in the fall pair wear a light pink shirt under a light grey cardigan or pair it with a forest green item or even with maroon pants to create a interesting monochrome color palette. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not surprised that there is this difference because, frankly, there is a lot less scrutiny on men&amp;#39;s appearance. This is not to say that their appearance isn&amp;#39;t important, but very rarely will someone look at a man and ask if he is &amp;quot;tired&amp;quot; or sick because he wore the wrong shade of blue that day. It&amp;#39;s just not the most important factor when people take in a man&amp;#39;s appearance.&lt;/p&gt;\n\n&lt;p&gt;Men&amp;#39;s clothing actually has a &lt;em&gt;much&lt;/em&gt; more restricted color palette than women&amp;#39;s clothing, so even if a man decided that he wanted an orange shirt, finding the perfect orange to compliment his complexion in a style that he wants is... Not easy. In fact, all the orange shirts in stores will probably be the same type of orange that happens to be trendy that year or maybe just a deep, rusty orange because people think of that as a masculine color. Anyway, my point is that due to the limitations of what is available for men, they don&amp;#39;t really even have the option of choosing their colors based on what looks best with their complexion.&lt;/p&gt;\n\n&lt;p&gt;As another user mentioned, seasonal clothing is as much about weight and texture as it is about color. A thick wool coat still reads as winter, even if it&amp;#39;s white. A black dress can read as summer if it&amp;#39;s sleeveless and linen. A brown shirt could still seem summery if the sleeves are rolled and it&amp;#39;s worn untucked over denim shorts. But when you put that shirt on under a sweater and pair it with jeans and ankle boots, it reads as fall or winter.&lt;/p&gt;\n\n&lt;p&gt;If people find that they look best in certain colors, but those colors are often associated with a real season (like light pink is great for spring or mustard is good for fall), I would recommend that they put those colors near their face and then use the rest of their outfit to try and set the tone in terms of the actual season/weather. So if you look great in light pink, maybe in the fall pair wear a light pink shirt under a light grey cardigan or pair it with a forest green item or even with maroon pants to create a interesting monochrome color palette. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdy66x", "score_hidden": false, "stickied": false, "created": 1492484906.0, "created_utc": 1492456106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgduslf", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "littleornithopter", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "It's definitely interesting. I'm a deep autumn and while I don't always pay attention to it, I know I look awful in pastels and overly light colors so I struggle a bit to transition to warm seasons but then decide I sweat too much to be picky.\n\nI wonder if the difference between the two subs just goes back to what people have said a lot before - that MFA tends to have a more prescriptive approach to dressing and FFA, well, does not.\n\nI'm also thinking about this from looking at the men in my life. They almost all have very short hair while most of the women in my life have at least bob-length hair if not longer. It's hard to divorce the color of the hair from the visual impact it has on the women's outfits and overall look. Also, making an exception for a few men, most of the ones I see regularly seem to dress from the same limited color palette to begin with (they might wear bright red to support a sports team, but it's not a frequently occurring color in their wardrobe; they might wear a light pink cotton shirt, but only one I know actively wears a hot pink one; the greens tend to either be very light or very deep and few kelly greens outside of sports or St. Patrick's day; etc etc). Sure, my dad, also a deep autumn, would look very washed out in pastels. But the only thing he wears that's even close to a pastel is those light blue (OCBD I suppose) shirts to work or with a suit. My bf wears what colors he wants to wear and I let him know which ones suit him particularly well, but if I told him a color made him look washed out, he wouldn't really care as long as he was happy with the outfit itself. I think women also have a much larger chunk of the colorwheel to play with for outfits. Perhaps it ties back to just the importance placed on people's looks and the difference of that between the genders. For women, it's probably still usually sufficient that we dress nicely and neatly in fitting clothes, but caring about the colors suiting us is part of the extra factor of what makes a woman's outfit go from a nice outfit to \"oh that looks great ON HER\" versus for men, who already have a smaller and more prescriptive set of clothes for each occasion, it's typically sufficient that the clothes be nice and fit him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s definitely interesting. I&amp;#39;m a deep autumn and while I don&amp;#39;t always pay attention to it, I know I look awful in pastels and overly light colors so I struggle a bit to transition to warm seasons but then decide I sweat too much to be picky.&lt;/p&gt;\n\n&lt;p&gt;I wonder if the difference between the two subs just goes back to what people have said a lot before - that MFA tends to have a more prescriptive approach to dressing and FFA, well, does not.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also thinking about this from looking at the men in my life. They almost all have very short hair while most of the women in my life have at least bob-length hair if not longer. It&amp;#39;s hard to divorce the color of the hair from the visual impact it has on the women&amp;#39;s outfits and overall look. Also, making an exception for a few men, most of the ones I see regularly seem to dress from the same limited color palette to begin with (they might wear bright red to support a sports team, but it&amp;#39;s not a frequently occurring color in their wardrobe; they might wear a light pink cotton shirt, but only one I know actively wears a hot pink one; the greens tend to either be very light or very deep and few kelly greens outside of sports or St. Patrick&amp;#39;s day; etc etc). Sure, my dad, also a deep autumn, would look very washed out in pastels. But the only thing he wears that&amp;#39;s even close to a pastel is those light blue (OCBD I suppose) shirts to work or with a suit. My bf wears what colors he wants to wear and I let him know which ones suit him particularly well, but if I told him a color made him look washed out, he wouldn&amp;#39;t really care as long as he was happy with the outfit itself. I think women also have a much larger chunk of the colorwheel to play with for outfits. Perhaps it ties back to just the importance placed on people&amp;#39;s looks and the difference of that between the genders. For women, it&amp;#39;s probably still usually sufficient that we dress nicely and neatly in fitting clothes, but caring about the colors suiting us is part of the extra factor of what makes a woman&amp;#39;s outfit go from a nice outfit to &amp;quot;oh that looks great ON HER&amp;quot; versus for men, who already have a smaller and more prescriptive set of clothes for each occasion, it&amp;#39;s typically sufficient that the clothes be nice and fit him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgduslf", "score_hidden": false, "stickied": false, "created": 1492481093.0, "created_utc": 1492452293.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgedndh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "blackanklesocks", "parent_id": "t1_dge1tfh", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "&gt; Blue acts differently when it's part of a plaid or floral. I figured out what types of prints I will and won't wear.\n\nThis is super interesting! Do you mind explaining? I've never heard this before but would love to learn.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Blue acts differently when it&amp;#39;s part of a plaid or floral. I figured out what types of prints I will and won&amp;#39;t wear.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is super interesting! Do you mind explaining? I&amp;#39;ve never heard this before but would love to learn.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgedndh", "score_hidden": false, "stickied": false, "created": 1492503662.0, "created_utc": 1492474862.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dge1tfh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "noliflere", "parent_id": "t1_dgdxx2w", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "Yes, I don't think people think enough about prints when they do color analysis!  Blue acts differently when it's part of a plaid or floral.  I figured out what types of prints I will and won't wear.  Yes to plaid and boho-type prints, no to houndstooth and polka dots.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I don&amp;#39;t think people think enough about prints when they do color analysis!  Blue acts differently when it&amp;#39;s part of a plaid or floral.  I figured out what types of prints I will and won&amp;#39;t wear.  Yes to plaid and boho-type prints, no to houndstooth and polka dots.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dge1tfh", "score_hidden": false, "stickied": false, "created": 1492489021.0, "created_utc": 1492460221.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxx2w", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ghettorevival", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "&gt;I use it as a neutral and pair it with colors that I like- but doing so always make the outfit give off a \"fall\"/\"coffeeshop\" vibe, regardless of how summery the rest of the outfit might look\n\nIt's funny you say this because earth tone shades, which are an autumn's best friends, are largely present in boho/festival wear that reads very, very summery to me. It may of course not be your style but I don't think autumn shades have to read as fall. I'm an autumn too and I tend toward muted, earth-tone shades year round. In the summer the only modifications I make are that I add A LOT more creams/off-whites into the mix since I live in a city that is appallingly hot and humid in the summer so I wouldn't survive with some of my darker toned tops, no matter their linen content. I do sometimes go a shade lighter on the spectrum for the warmer months so, for instance, instead of a deep, brown-olive that I love in the fall/winter, I will go to a lighter olive. \n\nI do think a lot of the problem is the availability of colors in summer clothing cuts and textures which may add to some of the prescriptivist advice out there about looking seasonally appropriate. It's frankly hard AF to find a good selection of clothes outside of the whites, pastels and neons that tend to come trotting out in the summer whereas fall tends to be loads easier for autumns.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I use it as a neutral and pair it with colors that I like- but doing so always make the outfit give off a &amp;quot;fall&amp;quot;/&amp;quot;coffeeshop&amp;quot; vibe, regardless of how summery the rest of the outfit might look&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s funny you say this because earth tone shades, which are an autumn&amp;#39;s best friends, are largely present in boho/festival wear that reads very, very summery to me. It may of course not be your style but I don&amp;#39;t think autumn shades have to read as fall. I&amp;#39;m an autumn too and I tend toward muted, earth-tone shades year round. In the summer the only modifications I make are that I add A LOT more creams/off-whites into the mix since I live in a city that is appallingly hot and humid in the summer so I wouldn&amp;#39;t survive with some of my darker toned tops, no matter their linen content. I do sometimes go a shade lighter on the spectrum for the warmer months so, for instance, instead of a deep, brown-olive that I love in the fall/winter, I will go to a lighter olive. &lt;/p&gt;\n\n&lt;p&gt;I do think a lot of the problem is the availability of colors in summer clothing cuts and textures which may add to some of the prescriptivist advice out there about looking seasonally appropriate. It&amp;#39;s frankly hard AF to find a good selection of clothes outside of the whites, pastels and neons that tend to come trotting out in the summer whereas fall tends to be loads easier for autumns.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdxx2w", "score_hidden": false, "stickied": false, "created": 1492484614.0, "created_utc": 1492455814.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgdzdw8", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ModestMalka", "parent_id": "t1_dgdrgg4", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "Agreed! I have [this brown linen summer dress](http://m.imgur.com/SGjTiHj?r) and [this pleated one](http://m.imgur.com/chQClBM?r). They work even better with white shoes or sandals.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed! I have &lt;a href=\"http://m.imgur.com/SGjTiHj?r\"&gt;this brown linen summer dress&lt;/a&gt; and &lt;a href=\"http://m.imgur.com/chQClBM?r\"&gt;this pleated one&lt;/a&gt;. They work even better with white shoes or sandals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdzdw8", "score_hidden": false, "stickied": false, "created": 1492486293.0, "created_utc": 1492457493.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrgg4", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "eloreb", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I kind of think you're overthinking it, especially if don't particularly care about looking fashionable. If you look amazing in deep brown, then wear it whenever you want!\n\nSome ideas for you for summer:\n\n* Wear one deep brown piece and put it together with lighter colors for spring/summer (light blue denim, whites/creams, etc.).\n* Only wear deep brown in lighter fabrics like linen or cotton for warm months.\n* Avoid wearing anything that's obviously *not* for summer... turtlenecks, cords, sweaters, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I kind of think you&amp;#39;re overthinking it, especially if don&amp;#39;t particularly care about looking fashionable. If you look amazing in deep brown, then wear it whenever you want!&lt;/p&gt;\n\n&lt;p&gt;Some ideas for you for summer:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Wear one deep brown piece and put it together with lighter colors for spring/summer (light blue denim, whites/creams, etc.).&lt;/li&gt;\n&lt;li&gt;Only wear deep brown in lighter fabrics like linen or cotton for warm months.&lt;/li&gt;\n&lt;li&gt;Avoid wearing anything that&amp;#39;s obviously &lt;em&gt;not&lt;/em&gt; for summer... turtlenecks, cords, sweaters, etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdrgg4", "score_hidden": false, "stickied": false, "created": 1492477407.0, "created_utc": 1492448607.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgdwwq3", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MrsValentine", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "Dressing in the colours of the season can work out really well for certain events, for example spring weddings, where you can flounce around swishing your skirts in cute pastels or floral dresses. However, most of the time it's just silly and restrictive. If I want to wear a bright pop of cheery colour in the middle of winter, I will. If I want to feel edgy and mysterious in all black during summer, I will. Who says you HAVE to dress in X colours in X season, especially if those colours don't suit you? \n\nAlso, winter and summer take different forms in different places. Maybe someone who lives in a tropical area finds the idea of wearing knitwear and other heavyweight fabrics during summer odd. However, someone else may live somewhere that doesn't get very hot in summer and need those fabrics to keep warm. \n\nPeople should just wear the colours and fabrics they feel comfortable and enjoy wearing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dressing in the colours of the season can work out really well for certain events, for example spring weddings, where you can flounce around swishing your skirts in cute pastels or floral dresses. However, most of the time it&amp;#39;s just silly and restrictive. If I want to wear a bright pop of cheery colour in the middle of winter, I will. If I want to feel edgy and mysterious in all black during summer, I will. Who says you HAVE to dress in X colours in X season, especially if those colours don&amp;#39;t suit you? &lt;/p&gt;\n\n&lt;p&gt;Also, winter and summer take different forms in different places. Maybe someone who lives in a tropical area finds the idea of wearing knitwear and other heavyweight fabrics during summer odd. However, someone else may live somewhere that doesn&amp;#39;t get very hot in summer and need those fabrics to keep warm. &lt;/p&gt;\n\n&lt;p&gt;People should just wear the colours and fabrics they feel comfortable and enjoy wearing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdwwq3", "score_hidden": false, "stickied": false, "created": 1492483473.0, "created_utc": 1492454673.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgdsewn", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "backpackquestionffa", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I don't think there's a \"right\" answer here to be clear; I just found the contrast in perspectives interesting. I noticed that what you prioritize influences how you go about deciding pieces- whether you start from \"these are good colors for the season, here's how to tweak it for your complexion\" or, by contrast, \"these are the best colors for your complexion, here's how to tweak it for the season\", to \"as long as the outfit works, it works\" to... \n\nI haven't really decided what approach I want to take yet. So, this question was more about, \"what do you all personally prioritize and how does that influence how you dress\"- probably should have worded it better, hah.\n\n(Although the advice is also very welcome, thank you all!)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think there&amp;#39;s a &amp;quot;right&amp;quot; answer here to be clear; I just found the contrast in perspectives interesting. I noticed that what you prioritize influences how you go about deciding pieces- whether you start from &amp;quot;these are good colors for the season, here&amp;#39;s how to tweak it for your complexion&amp;quot; or, by contrast, &amp;quot;these are the best colors for your complexion, here&amp;#39;s how to tweak it for the season&amp;quot;, to &amp;quot;as long as the outfit works, it works&amp;quot; to... &lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t really decided what approach I want to take yet. So, this question was more about, &amp;quot;what do you all personally prioritize and how does that influence how you dress&amp;quot;- probably should have worded it better, hah.&lt;/p&gt;\n\n&lt;p&gt;(Although the advice is also very welcome, thank you all!)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdsewn", "score_hidden": false, "stickied": false, "created": 1492478474.0, "created_utc": 1492449674.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgdw23p", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mexhaz87", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I wear what I want when I want. I really don't care if it doesn't look seasonal. If I am happy and comfortable in an outfit then I wear it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wear what I want when I want. I really don&amp;#39;t care if it doesn&amp;#39;t look seasonal. If I am happy and comfortable in an outfit then I wear it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdw23p", "score_hidden": false, "stickied": false, "created": 1492482512.0, "created_utc": 1492453712.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dge2zwv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "jessi1834", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "Yay! I'm an autumn too. When it comes to work clothes, most of my clothes are geared more towards fall and winter, and I too struggle with the spring and summer clothing (mostly because I like to stay covered up for work, and winter clothes equal more fabric). I'm also from up north, so dark colors were always in style no matter the season but now that I'm in the south it's hot and everyone wears light colors. Like you, I do well with chocolate browns but they can get heavy.\n\nFor spring and summer I've been trying to go more towards the light end of the warm tones that I look good in. So instead of brown, I'll do beige or tan. Instead of reds, I'll do pinks and blush. I'll also mix and match. So pairing a light shirt (beige/tan/cream) with my red skirt for summer. Or still wearing my berry three-quarter sleeve shirt to the office, but putting it with a light bottom.  I do gold jewelry year-round simply because I don't look all that great in silver. I usually swap black for brown, white for creams, navy for warm blues, and true green for olives. I just discovered the color season concept a little under two years ago, so I'm learning as well. But the color season rule of thumb has changed my wardrobe, and I love everything I purchase now.\n\nI can't afford high end fashion by any means, but put together a little [inspiration album](http://imgur.com/a/fTXPE) for you...mostly to illustrate some of the colors I gravitate towards. I'll try to add more to the album if I can!\n\nEdit: found the [Forever 21 Kimono](http://www.forever21.com/Product/Product.aspx?BR=f21&amp;Category=outerwear_coats-and-jackets&amp;ProductID=2000285720&amp;VariantID=). Turns out it's not yellow but is instead listed as vanilla/pink!", "edited": 1492471044.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yay! I&amp;#39;m an autumn too. When it comes to work clothes, most of my clothes are geared more towards fall and winter, and I too struggle with the spring and summer clothing (mostly because I like to stay covered up for work, and winter clothes equal more fabric). I&amp;#39;m also from up north, so dark colors were always in style no matter the season but now that I&amp;#39;m in the south it&amp;#39;s hot and everyone wears light colors. Like you, I do well with chocolate browns but they can get heavy.&lt;/p&gt;\n\n&lt;p&gt;For spring and summer I&amp;#39;ve been trying to go more towards the light end of the warm tones that I look good in. So instead of brown, I&amp;#39;ll do beige or tan. Instead of reds, I&amp;#39;ll do pinks and blush. I&amp;#39;ll also mix and match. So pairing a light shirt (beige/tan/cream) with my red skirt for summer. Or still wearing my berry three-quarter sleeve shirt to the office, but putting it with a light bottom.  I do gold jewelry year-round simply because I don&amp;#39;t look all that great in silver. I usually swap black for brown, white for creams, navy for warm blues, and true green for olives. I just discovered the color season concept a little under two years ago, so I&amp;#39;m learning as well. But the color season rule of thumb has changed my wardrobe, and I love everything I purchase now.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t afford high end fashion by any means, but put together a little &lt;a href=\"http://imgur.com/a/fTXPE\"&gt;inspiration album&lt;/a&gt; for you...mostly to illustrate some of the colors I gravitate towards. I&amp;#39;ll try to add more to the album if I can!&lt;/p&gt;\n\n&lt;p&gt;Edit: found the &lt;a href=\"http://www.forever21.com/Product/Product.aspx?BR=f21&amp;amp;Category=outerwear_coats-and-jackets&amp;amp;ProductID=2000285720&amp;amp;VariantID=\"&gt;Forever 21 Kimono&lt;/a&gt;. Turns out it&amp;#39;s not yellow but is instead listed as vanilla/pink!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dge2zwv", "score_hidden": false, "stickied": false, "created": 1492490337.0, "created_utc": 1492461537.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgduk1j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FogWalkerWithaBag", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I'm also an Autumn, and find that I can pull off the [Warm Spring](https://i0.wp.com/cardiganempire.com/wp-content/uploads/2012/08/color-seasons-complexion-warm-spring1.png) palate during the warmer months for daytime looks. For nighttime I still gear toward the darker Deep Autumn tones, but in lighter fabrics, and usually sleeveless. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m also an Autumn, and find that I can pull off the &lt;a href=\"https://i0.wp.com/cardiganempire.com/wp-content/uploads/2012/08/color-seasons-complexion-warm-spring1.png\"&gt;Warm Spring&lt;/a&gt; palate during the warmer months for daytime looks. For nighttime I still gear toward the darker Deep Autumn tones, but in lighter fabrics, and usually sleeveless. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgduk1j", "score_hidden": false, "stickied": false, "created": 1492480833.0, "created_utc": 1492452033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgdul12", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "lucidlotus", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I always dress for my complexion and don't think too hard about whether the colors are OK for the season. Though in summer I might avoid extreme things like head-to-toe black.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always dress for my complexion and don&amp;#39;t think too hard about whether the colors are OK for the season. Though in summer I might avoid extreme things like head-to-toe black.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdul12", "score_hidden": false, "stickied": false, "created": 1492480864.0, "created_utc": 1492452064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dge1fhc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "noliflere", "parent_id": "t1_dgdrc7y", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "Honestly this is what I do (I'm also an autumn.). Dark brown really brings out my eyes, but I am not really a fan of the color.  Colors are associated with different seasons, but they also have connotations beyond that.  Brown has connotations of being drab and plain and folksy, just as red has connotations like \"high energy\" and \"vampy.\"  For me, warm charcoal gray and navy blue are good neutrals, and they are also considered more \"chic\" than brown, so I use those instead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly this is what I do (I&amp;#39;m also an autumn.). Dark brown really brings out my eyes, but I am not really a fan of the color.  Colors are associated with different seasons, but they also have connotations beyond that.  Brown has connotations of being drab and plain and folksy, just as red has connotations like &amp;quot;high energy&amp;quot; and &amp;quot;vampy.&amp;quot;  For me, warm charcoal gray and navy blue are good neutrals, and they are also considered more &amp;quot;chic&amp;quot; than brown, so I use those instead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dge1fhc", "score_hidden": false, "stickied": false, "created": 1492488591.0, "created_utc": 1492459791.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrc7y", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "TequilaMockingbirdLn", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "Deep Autumns look amazing in deep brown but they also look fantastic in deep purple, yellow gold, teal, and turquoise. I would save the deep brown for fall/winter and try out other colors that are more suitable for summer but still in your palette.  If you're looking for a neutral to pair these colors with Deep Autumns look best in a soft white.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Deep Autumns look amazing in deep brown but they also look fantastic in deep purple, yellow gold, teal, and turquoise. I would save the deep brown for fall/winter and try out other colors that are more suitable for summer but still in your palette.  If you&amp;#39;re looking for a neutral to pair these colors with Deep Autumns look best in a soft white.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdrc7y", "score_hidden": false, "stickied": false, "created": 1492477275.0, "created_utc": 1492448475.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgdsssy", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "blorence", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I wear the same color palette in all seasons, and I add and subtract layers to accommodate the weather.  My color+season decisions are mostly practical - most of my pieces aren't distinct between seasons.  However, my current city is HOT and SUNNY, so while I'd like to wear my usual black, I do feel especially roasted in black.\n\nI don't actually have any idea what ~my season~ is, though I'd like to venture into that realm sometime.  I don't spend any time on MFA so I know nothing about their norms, but it's interesting that they wouldn't also dip their toes in PCA.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wear the same color palette in all seasons, and I add and subtract layers to accommodate the weather.  My color+season decisions are mostly practical - most of my pieces aren&amp;#39;t distinct between seasons.  However, my current city is HOT and SUNNY, so while I&amp;#39;d like to wear my usual black, I do feel especially roasted in black.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t actually have any idea what ~my season~ is, though I&amp;#39;d like to venture into that realm sometime.  I don&amp;#39;t spend any time on MFA so I know nothing about their norms, but it&amp;#39;s interesting that they wouldn&amp;#39;t also dip their toes in PCA.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgdsssy", "score_hidden": false, "stickied": false, "created": 1492478906.0, "created_utc": 1492450106.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgeg0xm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "leslienope1290", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "I agree with u/groovyfinch - the style and texture of the clothing is really what makes it seasonal. I do tend to swap in more bright colors in the summer, but honestly I don't pay much mind to 'dressing to my season', I just wear what I'm feeling that day, what makes me feel good and confident and stylish, and I trust that I pick things out that generally look good. Yes, some things look BETTER - like I look AMAZING in navy, but I wear jeans to work a lot so navy tops don't really work. \n\nIn the summer I tend to go for lots of bright pinks paired with neutrals or complementary colors, as well as the all-white-and-beige vibe, but it is truly how *light* the clothes feel that make them summery: linen, soft cotton, lace and eyelet.... and then of course drapey silhouettes and more dresses with open-toed shoes, a denim jacket and sunglasses... it's really about so much more than color! Also you can rock *any* color if you just wear it confidently :)\n\nAlso CHEERS to u/justgoodenough for this comment: \n\"there is a lot less scrutiny on men's appearance. This is not to say that their appearance isn't important, but very rarely will someone look at a man and ask if he is \"tired\" or sick because he wore the wrong shade of blue that day.\" -- AMEN\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with &lt;a href=\"/u/groovyfinch\"&gt;u/groovyfinch&lt;/a&gt; - the style and texture of the clothing is really what makes it seasonal. I do tend to swap in more bright colors in the summer, but honestly I don&amp;#39;t pay much mind to &amp;#39;dressing to my season&amp;#39;, I just wear what I&amp;#39;m feeling that day, what makes me feel good and confident and stylish, and I trust that I pick things out that generally look good. Yes, some things look BETTER - like I look AMAZING in navy, but I wear jeans to work a lot so navy tops don&amp;#39;t really work. &lt;/p&gt;\n\n&lt;p&gt;In the summer I tend to go for lots of bright pinks paired with neutrals or complementary colors, as well as the all-white-and-beige vibe, but it is truly how &lt;em&gt;light&lt;/em&gt; the clothes feel that make them summery: linen, soft cotton, lace and eyelet.... and then of course drapey silhouettes and more dresses with open-toed shoes, a denim jacket and sunglasses... it&amp;#39;s really about so much more than color! Also you can rock &lt;em&gt;any&lt;/em&gt; color if you just wear it confidently :)&lt;/p&gt;\n\n&lt;p&gt;Also CHEERS to &lt;a href=\"/u/justgoodenough\"&gt;u/justgoodenough&lt;/a&gt; for this comment: \n&amp;quot;there is a lot less scrutiny on men&amp;#39;s appearance. This is not to say that their appearance isn&amp;#39;t important, but very rarely will someone look at a man and ask if he is &amp;quot;tired&amp;quot; or sick because he wore the wrong shade of blue that day.&amp;quot; -- AMEN&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgeg0xm", "score_hidden": false, "stickied": false, "created": 1492506609.0, "created_utc": 1492477809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgegue3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meow_-_Meow", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "My summer wardrobe shifts from mostly black with some white, grey and navy to mostly white and navy with some black and grey. Part of that is a conscious choice to look \"summery,\" and part of it is availability; it's easier to find lighter fabrics in white or navy, and I think they tend to look better with things like marinieres and straw sun hats.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My summer wardrobe shifts from mostly black with some white, grey and navy to mostly white and navy with some black and grey. Part of that is a conscious choice to look &amp;quot;summery,&amp;quot; and part of it is availability; it&amp;#39;s easier to find lighter fabrics in white or navy, and I think they tend to look better with things like marinieres and straw sun hats.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgegue3", "score_hidden": false, "stickied": false, "created": 1492507643.0, "created_utc": 1492478843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2s8o5", "removal_reason": null, "link_id": "t3_65wl0p", "likes": null, "replies": "", "user_reports": [], "id": "dgehndr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ScoutFinch12", "parent_id": "t1_dge8r8a", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "Why so hostile?  So you don't care.  Some people do.  You don't need to threadshit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why so hostile?  So you don&amp;#39;t care.  Some people do.  You don&amp;#39;t need to threadshit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dgehndr", "score_hidden": false, "stickied": false, "created": 1492508631.0, "created_utc": 1492479831.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dge8r8a", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "n_e_r_d", "parent_id": "t3_65wl0p", "subreddit_name_prefixed": "r/femalefashionadvice", "controversiality": 0, "body": "my season is: I don't give a fuck\n\nthe current season is: hmmm...let me check to see how many fucks I give...oh look none!!!!\n\nI wear what I fucking want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;my season is: I don&amp;#39;t give a fuck&lt;/p&gt;\n\n&lt;p&gt;the current season is: hmmm...let me check to see how many fucks I give...oh look none!!!!&lt;/p&gt;\n\n&lt;p&gt;I wear what I fucking want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "femalefashionadvice", "name": "t1_dge8r8a", "score_hidden": false, "stickied": false, "created": 1492497322.0, "created_utc": 1492468522.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}]