[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve met an amazing woman. I&amp;#39;ll spare the details since I&amp;#39;d like to keep this as anonymous as possible. Great conversationalist, intelligent, well-read, interesting opinions and hobbies. Heart-breakingly beautiful. I have a hard time keeping my hands off her body.&lt;/p&gt;\n\n&lt;p&gt;On our third date, she came over to my place to watch a movie. Afterwards, we went right from our first kiss to taking clothes off. I prefer to take things slowly; and when she stopped me and said the same, I admit I was glad. Rock hard, disappointed  — but glad. Because it meant she was taking this as seriously as I was. I held her, we cuddled, we shared secrets and insecurities.&lt;/p&gt;\n\n&lt;p&gt;Our next date was at her place — and we ended up in her bed. I was confused but trying not to question it. I didn&amp;#39;t know what had changed since our last date, but clearly, all of a sudden, she was ready. And just as suddenly, I wasn&amp;#39;t. I went from full mast to a half chub. As soon as I started thinking about my erection like that, I entered a vicious circle of insecurity. I tried to put the condom on, which was actually way more painful than I remember&lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t had sex in ten years, and I haven&amp;#39;t been in a long-term relationship for even longer than that. And because I was an irresponsible ass, I can count on one hand the number of times I&amp;#39;ve used a condom. (Part of the reason I&amp;#39;d taken a break from the dating scene was to get my head on right about respecting myself and my sexual partners, making better choices, etc. Getting back into the dating scene once I&amp;#39;d made those changes was... difficult. So ten years went by.)&lt;/p&gt;\n\n&lt;p&gt;She knows the rough details. I had told her it&amp;#39;d been a long time since I&amp;#39;d been on a date, that&amp;#39;d I&amp;#39;d taken a break from it to work on myself and afterwards found it difficult to get back into the pool.&lt;/p&gt;\n\n&lt;p&gt;Anyway, after I went soft, I went down on her to give myself time - and also because I fucking love giving cunnilingus. She seemed to enjoy it. Had an orgasm. I think. It&amp;#39;s been a while since I&amp;#39;ve seen one. Anyway, afterward, she rolled me onto my back, took the condom off, and gave me head. It felt great! But I was still trapped in that vicious cycle of boner monitoring, so for as much pleasure as she was giving me I wasn&amp;#39;t coming. I ended up taking myself in hand, and I was able to come after I told her to put her hand on mine. The orgasm I had was really intense.&lt;/p&gt;\n\n&lt;p&gt;We didn&amp;#39;t talk about the ED. I could tell she was disappointed. She went to sleep. I stayed awake for hours staring at the ceiling.&lt;/p&gt;\n\n&lt;p&gt;She left town for about a week the next day. We parted on good terms. I ultimately blamed the ED on the condom, and while she was gone I tried to find a way to wear the brand I&amp;#39;d bought so it didn&amp;#39;t feel like it was going to twist my dick off. No success. I checked the size with a length/girth calculator online, which recommended — the exact brand I&amp;#39;d bought. I masturbated a couple of times with a condom on, as a test run. It took longer than usual, but I was able to keep an erection until I came.&lt;/p&gt;\n\n&lt;p&gt;I had a terrible knot in my stomach all week. I thought it was something I ate for a couple days but then I realized it was pure anxiety.&lt;/p&gt;\n\n&lt;p&gt;Last night was our fifth date. Again, great conversation, sparks, laughter. We end up making out on her couch. As I&amp;#39;m fingering her, I realize I&amp;#39;ve tensed my stomach really hard to get a better angle into her, and that knot of anxiety has become agonizing. I&amp;#39;m at about half mast, but as soon as we go into the bedroom I&amp;#39;m flaccid. Worse, because of the pain I&amp;#39;m in, it&amp;#39;s like I&amp;#39;ve been in cold water for hours. I go down on her, but I can tell she has given up. She tells me she&amp;#39;s tired, and just wants to sleep.&lt;/p&gt;\n\n&lt;p&gt;I ask her if she wants me to go. She shakes her head. It&amp;#39;s dark but I don&amp;#39;t think she&amp;#39;s meeting my eyes.&lt;/p&gt;\n\n&lt;p&gt;Again, I lay for hours, wide awake. The lump in my stomach is beyond anxiety now. It&amp;#39;s dread.&lt;/p&gt;\n\n&lt;p&gt;During the night, she lets me put an arm around her. She rests her hand on mine.&lt;/p&gt;\n\n&lt;p&gt;Morning finally broke, and as she made us coffee I told her, by way of explanation, I was going to lay off wine next time (we&amp;#39;d split a bottle), and I confessed I&amp;#39;ve always had a lot of body shame.&lt;/p&gt;\n\n&lt;p&gt;She understood - but then she told me how important it is to her that she be with someone who&amp;#39;s attracted to her. She told me there are a lot of people out there, and that if I&amp;#39;m not attracted to her I should just be honest.&lt;/p&gt;\n\n&lt;p&gt;I tried to reassure her, but she seemed resigned to believing that my mouth was lying and my dick was telling the truth.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t know how to interpret what she&amp;#39;d just said. Was it an ultimatum, as in &amp;quot;There are plenty of men out there who can get it up for me, so figure out your shit, quick?&amp;quot; Or was she trying to let me off the hook, like, &amp;quot;Don&amp;#39;t feel like you have force it if you&amp;#39;re not feeling it, just because we happened to hit it off and had a couple nice dates.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;We kissed before I left for work, so passionately that I found myself stirring. But I was already cutting it close, so I left.&lt;/p&gt;\n\n&lt;p&gt;The implied ultimatum in what she told me is freaking me out. I&amp;#39;m seeing her again in two days. There&amp;#39;s lots of great advice on this sub about meditation and mindfulness, exercises, dietary considerations, no masturbation, etc. I&amp;#39;m following as much of that advice as I can between now and then, but... I&amp;#39;m really, really scared. Which is precisely the problem.&lt;/p&gt;\n\n&lt;p&gt;I could really use a pep talk. Thanks for reading all this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've met an amazing woman. I'll spare the details since I'd like to keep this as anonymous as possible. Great conversationalist, intelligent, well-read, interesting opinions and hobbies. Heart-breakingly beautiful. I have a hard time keeping my hands off her body.\n\nOn our third date, she came over to my place to watch a movie. Afterwards, we went right from our first kiss to taking clothes off. I prefer to take things slowly; and when she stopped me and said the same, I admit I was glad. Rock hard, disappointed  — but glad. Because it meant she was taking this as seriously as I was. I held her, we cuddled, we shared secrets and insecurities.\n\nOur next date was at her place — and we ended up in her bed. I was confused but trying not to question it. I didn't know what had changed since our last date, but clearly, all of a sudden, she was ready. And just as suddenly, I wasn't. I went from full mast to a half chub. As soon as I started thinking about my erection like that, I entered a vicious circle of insecurity. I tried to put the condom on, which was actually way more painful than I remember\n\nI haven't had sex in ten years, and I haven't been in a long-term relationship for even longer than that. And because I was an irresponsible ass, I can count on one hand the number of times I've used a condom. (Part of the reason I'd taken a break from the dating scene was to get my head on right about respecting myself and my sexual partners, making better choices, etc. Getting back into the dating scene once I'd made those changes was... difficult. So ten years went by.)\n\nShe knows the rough details. I had told her it'd been a long time since I'd been on a date, that'd I'd taken a break from it to work on myself and afterwards found it difficult to get back into the pool.\n\nAnyway, after I went soft, I went down on her to give myself time - and also because I fucking love giving cunnilingus. She seemed to enjoy it. Had an orgasm. I think. It's been a while since I've seen one. Anyway, afterward, she rolled me onto my back, took the condom off, and gave me head. It felt great! But I was still trapped in that vicious cycle of boner monitoring, so for as much pleasure as she was giving me I wasn't coming. I ended up taking myself in hand, and I was able to come after I told her to put her hand on mine. The orgasm I had was really intense.\n\nWe didn't talk about the ED. I could tell she was disappointed. She went to sleep. I stayed awake for hours staring at the ceiling.\n\nShe left town for about a week the next day. We parted on good terms. I ultimately blamed the ED on the condom, and while she was gone I tried to find a way to wear the brand I'd bought so it didn't feel like it was going to twist my dick off. No success. I checked the size with a length/girth calculator online, which recommended — the exact brand I'd bought. I masturbated a couple of times with a condom on, as a test run. It took longer than usual, but I was able to keep an erection until I came.\n\nI had a terrible knot in my stomach all week. I thought it was something I ate for a couple days but then I realized it was pure anxiety.\n\nLast night was our fifth date. Again, great conversation, sparks, laughter. We end up making out on her couch. As I'm fingering her, I realize I've tensed my stomach really hard to get a better angle into her, and that knot of anxiety has become agonizing. I'm at about half mast, but as soon as we go into the bedroom I'm flaccid. Worse, because of the pain I'm in, it's like I've been in cold water for hours. I go down on her, but I can tell she has given up. She tells me she's tired, and just wants to sleep.\n\nI ask her if she wants me to go. She shakes her head. It's dark but I don't think she's meeting my eyes.\n\nAgain, I lay for hours, wide awake. The lump in my stomach is beyond anxiety now. It's dread.\n\nDuring the night, she lets me put an arm around her. She rests her hand on mine.\n\nMorning finally broke, and as she made us coffee I told her, by way of explanation, I was going to lay off wine next time (we'd split a bottle), and I confessed I've always had a lot of body shame.\n\nShe understood - but then she told me how important it is to her that she be with someone who's attracted to her. She told me there are a lot of people out there, and that if I'm not attracted to her I should just be honest.\n\nI tried to reassure her, but she seemed resigned to believing that my mouth was lying and my dick was telling the truth.\n\nI didn't know how to interpret what she'd just said. Was it an ultimatum, as in \"There are plenty of men out there who can get it up for me, so figure out your shit, quick?\" Or was she trying to let me off the hook, like, \"Don't feel like you have force it if you're not feeling it, just because we happened to hit it off and had a couple nice dates.\"\n\nWe kissed before I left for work, so passionately that I found myself stirring. But I was already cutting it close, so I left.\n\nThe implied ultimatum in what she told me is freaking me out. I'm seeing her again in two days. There's lots of great advice on this sub about meditation and mindfulness, exercises, dietary considerations, no masturbation, etc. I'm following as much of that advice as I can between now and then, but... I'm really, really scared. Which is precisely the problem.\n\nI could really use a pep talk. Thanks for reading all this.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64oafc", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 26, "report_reasons": null, "author": "throwawayedpa", "saved": false, "mod_reports": [], "name": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/64oafc/my_penis_is_not_a_lie_detector_performance/", "num_reports": null, "locked": false, "stickied": false, "created": 1491908066.0, "url": "https://www.reddit.com/r/sex/comments/64oafc/my_penis_is_not_a_lie_detector_performance/", "author_flair_text": null, "quarantine": false, "title": "My penis is not a lie detector. [Performance anxiety; long]", "created_utc": 1491879266.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 23, "visited": false, "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg3yr1h", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "Whatchamathing", "parent_id": "t1_dg3reie", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; Some women confuse performance anxiety with lack of attraction.\n\nUnless he's explained it better to her than he suggests in his post, OP hasn't actually really *told* her it's performance anxiety, leaving her to draw conclusions according to her own insecurities", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Some women confuse performance anxiety with lack of attraction.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Unless he&amp;#39;s explained it better to her than he suggests in his post, OP hasn&amp;#39;t actually really &lt;em&gt;told&lt;/em&gt; her it&amp;#39;s performance anxiety, leaving her to draw conclusions according to her own insecurities&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg3yr1h", "score_hidden": false, "stickied": false, "created": 1491921727.0, "created_utc": 1491892927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg3x42b", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "tvec", "parent_id": "t1_dg3reie", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I had a long spell with no sex and was nervous. I did this. I used the cialis a few times and don't worry about it anymore. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a long spell with no sex and was nervous. I did this. I used the cialis a few times and don&amp;#39;t worry about it anymore. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg3x42b", "score_hidden": false, "stickied": false, "created": 1491917980.0, "created_utc": 1491889180.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3reie", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "ra__account", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Some women confuse performance anxiety with lack of attraction.\n\nTalk with a doctor about trying Viagra or Cialis. You may not need to take it on an ongoing basis, just long enough to build back up your comfort level with intercourse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some women confuse performance anxiety with lack of attraction.&lt;/p&gt;\n\n&lt;p&gt;Talk with a doctor about trying Viagra or Cialis. You may not need to take it on an ongoing basis, just long enough to build back up your comfort level with intercourse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg3reie", "score_hidden": false, "stickied": false, "created": 1491908652.0, "created_utc": 1491879852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg3ypa0", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Whatchamathing", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I just want to point out this GIANT blind spot you seem to be having. \n\n&gt; We didn't talk about the ED. I could tell she was disappointed. She went to sleep. I stayed awake for hours staring at the ceiling.\n\n[..]\n\n&gt; I had a terrible knot in my stomach all week. I thought it was something I ate for a couple days but then I realized it was pure anxiety.\n\n[...]\n\n&gt; As I'm fingering her, I realize I've tensed my stomach really hard to get a better angle into her, and that knot of anxiety has become agonizing. I'm at about half mast, but as soon as we go into the bedroom I'm flaccid. Worse, because of the pain I'm in, it's like I've been in cold water for hours. I go down on her, but I can tell she has given up. She tells me she's tired, and just wants to sleep.\n\n[...]\n\n&gt; Again, I lay for hours, wide awake. The lump in my stomach is beyond anxiety now. It's dread.\n\n[...]\n\n&gt; Morning finally broke, and as she made us coffee I told her, by way of explanation, I was going to lay off wine next time (we'd split a bottle), and I confessed I've always had a lot of body shame.\n\n**HER VAGINA IS NOT A LIE DETECTOR EITHER.** \n\nUnless you talked more and in more detail than you've mentioned here, you've said nothing, nothing, and blamed it on the wine (which she knew was a lie) with a mention of 'body shame'. You've never actually TOLD her 'Hey, *I'm really into you*, and because it matters so much to me that this thing with you goes well, I put a lot of pressure on myself, and that makes my dick not show up'\n\nYou've made some vague references, but what she needs to hear about is that vicious spiral of eagerness/investment and anxiety, and the sense that this amazing budding relationship is slipping through your fingers, which just makes it worse. She thinks this is happening because you're not into her, and it's actually happening *because* you're really into her, no? I bet if you were feeling 'whatever' about her you wouldn't have this (or as much) kind of trouble. \n\n&gt; She understood - but then she told me how important it is to her that she be with someone who's attracted to her. She told me there are a lot of people out there, and that if I'm not attracted to her I should just be honest.\n\nTo me that sounds like somebody who is hurt and insecure and trying to let you off the hook. You need to take some of the eloquence and clear wording you've put in this post and give it to her. Hell, maybe you should let her read this post. I bet it would clarify a lot for her. \n\nYou're both insecure and both afraid of getting hurt. Don't let a connection with this kind of potential slip away through lack of clear communication. Good luck", "edited": 1491895954.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want to point out this GIANT blind spot you seem to be having. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We didn&amp;#39;t talk about the ED. I could tell she was disappointed. She went to sleep. I stayed awake for hours staring at the ceiling.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;[..]&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I had a terrible knot in my stomach all week. I thought it was something I ate for a couple days but then I realized it was pure anxiety.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;[...]&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As I&amp;#39;m fingering her, I realize I&amp;#39;ve tensed my stomach really hard to get a better angle into her, and that knot of anxiety has become agonizing. I&amp;#39;m at about half mast, but as soon as we go into the bedroom I&amp;#39;m flaccid. Worse, because of the pain I&amp;#39;m in, it&amp;#39;s like I&amp;#39;ve been in cold water for hours. I go down on her, but I can tell she has given up. She tells me she&amp;#39;s tired, and just wants to sleep.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;[...]&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Again, I lay for hours, wide awake. The lump in my stomach is beyond anxiety now. It&amp;#39;s dread.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;[...]&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Morning finally broke, and as she made us coffee I told her, by way of explanation, I was going to lay off wine next time (we&amp;#39;d split a bottle), and I confessed I&amp;#39;ve always had a lot of body shame.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;HER VAGINA IS NOT A LIE DETECTOR EITHER.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Unless you talked more and in more detail than you&amp;#39;ve mentioned here, you&amp;#39;ve said nothing, nothing, and blamed it on the wine (which she knew was a lie) with a mention of &amp;#39;body shame&amp;#39;. You&amp;#39;ve never actually TOLD her &amp;#39;Hey, &lt;em&gt;I&amp;#39;m really into you&lt;/em&gt;, and because it matters so much to me that this thing with you goes well, I put a lot of pressure on myself, and that makes my dick not show up&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve made some vague references, but what she needs to hear about is that vicious spiral of eagerness/investment and anxiety, and the sense that this amazing budding relationship is slipping through your fingers, which just makes it worse. She thinks this is happening because you&amp;#39;re not into her, and it&amp;#39;s actually happening &lt;em&gt;because&lt;/em&gt; you&amp;#39;re really into her, no? I bet if you were feeling &amp;#39;whatever&amp;#39; about her you wouldn&amp;#39;t have this (or as much) kind of trouble. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She understood - but then she told me how important it is to her that she be with someone who&amp;#39;s attracted to her. She told me there are a lot of people out there, and that if I&amp;#39;m not attracted to her I should just be honest.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;To me that sounds like somebody who is hurt and insecure and trying to let you off the hook. You need to take some of the eloquence and clear wording you&amp;#39;ve put in this post and give it to her. Hell, maybe you should let her read this post. I bet it would clarify a lot for her. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re both insecure and both afraid of getting hurt. Don&amp;#39;t let a connection with this kind of potential slip away through lack of clear communication. Good luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg3ypa0", "score_hidden": false, "stickied": false, "created": 1491921605.0, "created_utc": 1491892805.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg3ui6t", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "knowitallz", "parent_id": "t1_dg3ri33", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah it's like if a lady can't cum from sex/oral from a new partner . It's not anyone it's just nervousness, anxiety, doubt", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it&amp;#39;s like if a lady can&amp;#39;t cum from sex/oral from a new partner . It&amp;#39;s not anyone it&amp;#39;s just nervousness, anxiety, doubt&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg3ui6t", "score_hidden": false, "stickied": false, "created": 1491913241.0, "created_utc": 1491884441.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg486yk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "imp_of_santa", "parent_id": "t1_dg44v3v", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; That's happened to me and it was devastating.\n\nI'm sorry that happened to you.  The only consolation is that the nature of the problem prevented you from having sex with the jerkass more often.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That&amp;#39;s happened to me and it was devastating.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m sorry that happened to you.  The only consolation is that the nature of the problem prevented you from having sex with the jerkass more often.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg486yk", "score_hidden": false, "stickied": false, "created": 1491945129.0, "created_utc": 1491916329.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg4bgqs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "briber67", "parent_id": "t1_dg4a9kp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Everything you are saying is correct. \n\nGuys fear being discarded for being defective.\n\nI'm glad we are calling it erectile dysfunction. The favored term used to be \"impotent.\"\n\nThat was a rough term. \n\nA guy 'has' ED whereas a guy 'is' impotent. The former is a problem to be dealt with. The latter is a fundamental flaw in a person's being.\n\nLanguage matters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everything you are saying is correct. &lt;/p&gt;\n\n&lt;p&gt;Guys fear being discarded for being defective.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad we are calling it erectile dysfunction. The favored term used to be &amp;quot;impotent.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That was a rough term. &lt;/p&gt;\n\n&lt;p&gt;A guy &amp;#39;has&amp;#39; ED whereas a guy &amp;#39;is&amp;#39; impotent. The former is a problem to be dealt with. The latter is a fundamental flaw in a person&amp;#39;s being.&lt;/p&gt;\n\n&lt;p&gt;Language matters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4bgqs", "score_hidden": false, "stickied": false, "created": 1491949477.0, "created_utc": 1491920677.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4a9kp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Whatchamathing", "parent_id": "t1_dg48rfe", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; From the guys perspective, if she feels that her attractiveness is the issue, she may wish to prove that she is desirable by attempting a future sexual encounter.\n\nI'm by no means saying that I represent every woman, but I interact with a lot of women and have been on several boards like these for about ten years now. So I like to think I have a bit of insight. And I genuinely can't imagine a woman responding like that. \n\nI think the fact that they are getting along well outside of bed and that there is a future date despite the issues is more likely to mean that she really likes OP and has some hopes about this becoming a real relationship. She's probably confused and insecure about the mixed signals she's getting, and I can't blame her. \n\n&gt; If she knows that the erection problems are entirely his own issue and have nothing to do with her, he may fear that she would want nothing to do with a man that can't even operate his own penis.\n\nBut the problems DO have to do with her, just not in the way she interprets - OP is experiencing a lot of pressure and anxiety *because he really likes her*. He's super into her! He wants this budding relationship to succeed and that is stacking on the fear of failure. Since they're still in that fragile early stage of tempered hopes, each stuck with their insecurities, knowing the problems are because OP is so into her might actually be an enormous relief! It's certainly much more likely to lead to a way forward as a couple than continuing to let her think he's not attracted to her. ", "edited": 1491919453.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;From the guys perspective, if she feels that her attractiveness is the issue, she may wish to prove that she is desirable by attempting a future sexual encounter.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m by no means saying that I represent every woman, but I interact with a lot of women and have been on several boards like these for about ten years now. So I like to think I have a bit of insight. And I genuinely can&amp;#39;t imagine a woman responding like that. &lt;/p&gt;\n\n&lt;p&gt;I think the fact that they are getting along well outside of bed and that there is a future date despite the issues is more likely to mean that she really likes OP and has some hopes about this becoming a real relationship. She&amp;#39;s probably confused and insecure about the mixed signals she&amp;#39;s getting, and I can&amp;#39;t blame her. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If she knows that the erection problems are entirely his own issue and have nothing to do with her, he may fear that she would want nothing to do with a man that can&amp;#39;t even operate his own penis.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But the problems DO have to do with her, just not in the way she interprets - OP is experiencing a lot of pressure and anxiety &lt;em&gt;because he really likes her&lt;/em&gt;. He&amp;#39;s super into her! He wants this budding relationship to succeed and that is stacking on the fear of failure. Since they&amp;#39;re still in that fragile early stage of tempered hopes, each stuck with their insecurities, knowing the problems are because OP is so into her might actually be an enormous relief! It&amp;#39;s certainly much more likely to lead to a way forward as a couple than continuing to let her think he&amp;#39;s not attracted to her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4a9kp", "score_hidden": false, "stickied": false, "created": 1491947959.0, "created_utc": 1491919159.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48rfe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "briber67", "parent_id": "t1_dg44v3v", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "There another insidious element to this situation.\n\nFrom the guys perspective, if she feels that her attractiveness is the issue, she may wish to prove that she is desirable by attempting a future sexual encounter.\n\nIf she knows that the erection problems are entirely his own issue and have nothing to do with her, he may fear that she would want nothing to do with a man that can't even operate his own penis.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There another insidious element to this situation.&lt;/p&gt;\n\n&lt;p&gt;From the guys perspective, if she feels that her attractiveness is the issue, she may wish to prove that she is desirable by attempting a future sexual encounter.&lt;/p&gt;\n\n&lt;p&gt;If she knows that the erection problems are entirely his own issue and have nothing to do with her, he may fear that she would want nothing to do with a man that can&amp;#39;t even operate his own penis.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg48rfe", "score_hidden": false, "stickied": false, "created": 1491945950.0, "created_utc": 1491917150.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44v3v", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Whatchamathing", "parent_id": "t1_dg3ri33", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; It's never you.\n\n&gt;  It just isn't. Or at least, it's never your bodies.\n\nSadly sometimes guys prefer to say that it IS. That's happened to me and it was devastating. In hindsight I can read the signs as probably performance anxiety, but I guess he felt it saved his ego to lay the blame with me and break up with me. And since society already pushes the idea that it's women's jobs to be attractive enough to turn guys on, I can't blame women for drawing that conclusion when they don't get much to counter it.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s never you.&lt;/p&gt;\n\n&lt;p&gt;It just isn&amp;#39;t. Or at least, it&amp;#39;s never your bodies.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sadly sometimes guys prefer to say that it IS. That&amp;#39;s happened to me and it was devastating. In hindsight I can read the signs as probably performance anxiety, but I guess he felt it saved his ego to lay the blame with me and break up with me. And since society already pushes the idea that it&amp;#39;s women&amp;#39;s jobs to be attractive enough to turn guys on, I can&amp;#39;t blame women for drawing that conclusion when they don&amp;#39;t get much to counter it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg44v3v", "score_hidden": false, "stickied": false, "created": 1491939152.0, "created_utc": 1491910352.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3ri33", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "imp_of_santa", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "First a word for the ladies:\n\n# It's never you.\n\nIt just isn't.  Or at least, it's never your bodies.  Some relationships get so toxic that the guy's penis is just the first part of him out the door.\n\nBut that's rare.  99 times out of a 100, it's the OP's problem: he had one bad inning and it totally threw him off his game.\n\nOP, normally, I would say, let it go as it came, naturally.  A few weeks, and the lead will find its way back to your pencil.\n\nHowever, you aren't in a normal situation.  You are at a fragile stage of the relationship, and you are dating a woman with a poor self-image.  You don't _have_ a few weeks.\n\nTomorrow, first thing, make an appointment with some telemedicine outfit like [Doctor On Demand](http://www.doctorondemand.com), tell the nice lady your problem, and get a script for the good stuff:  Viagra, Cialis, Levitra.  We are living in a Brave New World and these chemicals could raise an erection on a decapitated corpse.\n\nThe company web-sites for the drugs usually offer half-off coupons, free samples, stuff like that.\n\nOf course, you can't stay on Blue Heaven forever, you're going to have to wean yourself off gradually, but give it a few weeks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First a word for the ladies:&lt;/p&gt;\n\n&lt;h1&gt;It&amp;#39;s never you.&lt;/h1&gt;\n\n&lt;p&gt;It just isn&amp;#39;t.  Or at least, it&amp;#39;s never your bodies.  Some relationships get so toxic that the guy&amp;#39;s penis is just the first part of him out the door.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s rare.  99 times out of a 100, it&amp;#39;s the OP&amp;#39;s problem: he had one bad inning and it totally threw him off his game.&lt;/p&gt;\n\n&lt;p&gt;OP, normally, I would say, let it go as it came, naturally.  A few weeks, and the lead will find its way back to your pencil.&lt;/p&gt;\n\n&lt;p&gt;However, you aren&amp;#39;t in a normal situation.  You are at a fragile stage of the relationship, and you are dating a woman with a poor self-image.  You don&amp;#39;t &lt;em&gt;have&lt;/em&gt; a few weeks.&lt;/p&gt;\n\n&lt;p&gt;Tomorrow, first thing, make an appointment with some telemedicine outfit like &lt;a href=\"http://www.doctorondemand.com\"&gt;Doctor On Demand&lt;/a&gt;, tell the nice lady your problem, and get a script for the good stuff:  Viagra, Cialis, Levitra.  We are living in a Brave New World and these chemicals could raise an erection on a decapitated corpse.&lt;/p&gt;\n\n&lt;p&gt;The company web-sites for the drugs usually offer half-off coupons, free samples, stuff like that.&lt;/p&gt;\n\n&lt;p&gt;Of course, you can&amp;#39;t stay on Blue Heaven forever, you&amp;#39;re going to have to wean yourself off gradually, but give it a few weeks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg3ri33", "score_hidden": false, "stickied": false, "created": 1491908787.0, "created_utc": 1491879987.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg4b81r", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JessMcNutt", "parent_id": "t1_dg4arpk", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yay! Please update us after the convo, good idea not to go to pills for the help. It's a good start to the relationship to be able to talk and get past it together. You won't need viagra, soon it will all just click! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yay! Please update us after the convo, good idea not to go to pills for the help. It&amp;#39;s a good start to the relationship to be able to talk and get past it together. You won&amp;#39;t need viagra, soon it will all just click! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4b81r", "score_hidden": false, "stickied": false, "created": 1491949184.0, "created_utc": 1491920384.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg4cpb7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Whatchamathing", "parent_id": "t1_dg4arpk", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Bravely leading with your heart, man. Kudos. \n\nYou might want to add a bit more explanation about performance anxiety just to spell it out; something like 'I've been going 'Oh wow, she's so great, I want this to be amazing' and the pressure of that turned into anxiety, and that's causing the physical problem.' \n\nPlease let us know how it turns out. I have good hopes for you guys - everything you've written about her makes it sound like she's really into you too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bravely leading with your heart, man. Kudos. &lt;/p&gt;\n\n&lt;p&gt;You might want to add a bit more explanation about performance anxiety just to spell it out; something like &amp;#39;I&amp;#39;ve been going &amp;#39;Oh wow, she&amp;#39;s so great, I want this to be amazing&amp;#39; and the pressure of that turned into anxiety, and that&amp;#39;s causing the physical problem.&amp;#39; &lt;/p&gt;\n\n&lt;p&gt;Please let us know how it turns out. I have good hopes for you guys - everything you&amp;#39;ve written about her makes it sound like she&amp;#39;s really into you too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4cpb7", "score_hidden": false, "stickied": false, "created": 1491950945.0, "created_utc": 1491922145.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg5tz2h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "richalba", "parent_id": "t1_dg4arpk", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Awesome approach, as a woman who had had a partner with similar issues this is the best way to deal with it! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome approach, as a woman who had had a partner with similar issues this is the best way to deal with it! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5tz2h", "score_hidden": false, "stickied": false, "created": 1492031355.0, "created_utc": 1492002555.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4arpk", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "throwawayedpa", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "A sincere thank you to everyone who has commented.\n\nAt first, when so many of you said, \"Well, why haven't you just told her?\" I kind of scoffed and thought I already had. Then I went back in my mind and realized... no... no, not really. I kind of muttered, \"Sorry, I'm in my own head\" at one point, but that's not exactly clear and effective communication, is it?\n\nI'm going to find a moment during our next date to tell her plainly, Look, I've been doing the dude thing where I hide my feelings and hope a problem will just go away, but that's not going to work. And by not just being honest with you, I've given you reason to believe I'm not attracted to you. I'm sorry. Nothing could be further from the truth. If this had just been a one-night stand, I wouldn't have had a problem keeping it up. Because I wouldn't have cared.\n\nBut I care about you. And I'm attracted to you in a lot of ways, including physically. I don't *just* want to have sex with you. I want to have good sex with you. That's why I have performance anxiety.\n\nLet's just take some time to enjoy each other's bodies. I want to know the ways you liked to be touched best. I really enjoyed going down on you, and it felt so good when you went down on me. Let's take time to enjoy that. The less I worry about what's coming next, the more ready I'll be for it.\n\n*\n\nA couple of you recommended pills, and I thought about it but something didn't sit right with me. I think I see now it's the idea that taking them to get my confidence back is a good one, but to me it would still be like lying to her if she didn't know I was taking them. I think if I'm communicative with her, and she still insists on PIV sex, then I'll broach the idea of Viagra in the meantime as a stopgap measure.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A sincere thank you to everyone who has commented.&lt;/p&gt;\n\n&lt;p&gt;At first, when so many of you said, &amp;quot;Well, why haven&amp;#39;t you just told her?&amp;quot; I kind of scoffed and thought I already had. Then I went back in my mind and realized... no... no, not really. I kind of muttered, &amp;quot;Sorry, I&amp;#39;m in my own head&amp;quot; at one point, but that&amp;#39;s not exactly clear and effective communication, is it?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to find a moment during our next date to tell her plainly, Look, I&amp;#39;ve been doing the dude thing where I hide my feelings and hope a problem will just go away, but that&amp;#39;s not going to work. And by not just being honest with you, I&amp;#39;ve given you reason to believe I&amp;#39;m not attracted to you. I&amp;#39;m sorry. Nothing could be further from the truth. If this had just been a one-night stand, I wouldn&amp;#39;t have had a problem keeping it up. Because I wouldn&amp;#39;t have cared.&lt;/p&gt;\n\n&lt;p&gt;But I care about you. And I&amp;#39;m attracted to you in a lot of ways, including physically. I don&amp;#39;t &lt;em&gt;just&lt;/em&gt; want to have sex with you. I want to have good sex with you. That&amp;#39;s why I have performance anxiety.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s just take some time to enjoy each other&amp;#39;s bodies. I want to know the ways you liked to be touched best. I really enjoyed going down on you, and it felt so good when you went down on me. Let&amp;#39;s take time to enjoy that. The less I worry about what&amp;#39;s coming next, the more ready I&amp;#39;ll be for it.&lt;/p&gt;\n\n&lt;p&gt;*&lt;/p&gt;\n\n&lt;p&gt;A couple of you recommended pills, and I thought about it but something didn&amp;#39;t sit right with me. I think I see now it&amp;#39;s the idea that taking them to get my confidence back is a good one, but to me it would still be like lying to her if she didn&amp;#39;t know I was taking them. I think if I&amp;#39;m communicative with her, and she still insists on PIV sex, then I&amp;#39;ll broach the idea of Viagra in the meantime as a stopgap measure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4arpk", "score_hidden": false, "stickied": false, "created": 1491948616.0, "created_utc": 1491919816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg3tvh3", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "bigredr00ster", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Uggghhhh i hate how society has ingrained into people that dudes are ravenous sex beasts that walk around with boners 24/7 and can't control themselves sexually whenever they see a woman. And so when a couple get together to have sex and a dude actually feels nervousness and cant get hard, it's ultimately a turn off for the woman because she expects him to be all over her. It just doesn't work that way for a lot of dudes. It's not realistic. And it has nothing to do with the woman either. It's frustrating because these women internalize the guy's issue as their own when it's completely out of their control. And then they throw out ultimatums or dump the dude because they view him as broken, gay, or whatever else. Women need to put their egos aside and be more supportive of guys in these situations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uggghhhh i hate how society has ingrained into people that dudes are ravenous sex beasts that walk around with boners 24/7 and can&amp;#39;t control themselves sexually whenever they see a woman. And so when a couple get together to have sex and a dude actually feels nervousness and cant get hard, it&amp;#39;s ultimately a turn off for the woman because she expects him to be all over her. It just doesn&amp;#39;t work that way for a lot of dudes. It&amp;#39;s not realistic. And it has nothing to do with the woman either. It&amp;#39;s frustrating because these women internalize the guy&amp;#39;s issue as their own when it&amp;#39;s completely out of their control. And then they throw out ultimatums or dump the dude because they view him as broken, gay, or whatever else. Women need to put their egos aside and be more supportive of guys in these situations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg3tvh3", "score_hidden": false, "stickied": false, "created": 1491912214.0, "created_utc": 1491883414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg3uzvq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Emmanola", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;\"Don't feel like you have force it if you're not feeling it, just because we happened to hit it off and had a couple nice dates.\"\n\nI have little doubt that *that's* what she meant.  I'm female and it's frustrating to *me* that she is not believing you that it's not to do at all with not being attracted to her.  On the other hand, I'm not sure you've explained it as well as you can, say, as well as you did right here.  \n\nI think the Viagra/Cialis solution is a fine one.  But I also hope that you can explain to her this thing that happens to so many men -- as imp_of_santa put it: you had one bad inning and it's totally thrown off your game.  I guess a lot of women don't understand how easily that can happen.  And it's probably *more* likely to happen if you're very attracted to the woman.  Yes?? You can tell her that!  It's just the opposite of what she's assuming....\n\nYeah, telling her the whole truth would be good.  It's not unsexy to be vulnerable like that...(just the opposite for me).  \n\nWishing you the best with this. : )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Don&amp;#39;t feel like you have force it if you&amp;#39;re not feeling it, just because we happened to hit it off and had a couple nice dates.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have little doubt that &lt;em&gt;that&amp;#39;s&lt;/em&gt; what she meant.  I&amp;#39;m female and it&amp;#39;s frustrating to &lt;em&gt;me&lt;/em&gt; that she is not believing you that it&amp;#39;s not to do at all with not being attracted to her.  On the other hand, I&amp;#39;m not sure you&amp;#39;ve explained it as well as you can, say, as well as you did right here.  &lt;/p&gt;\n\n&lt;p&gt;I think the Viagra/Cialis solution is a fine one.  But I also hope that you can explain to her this thing that happens to so many men -- as imp_of_santa put it: you had one bad inning and it&amp;#39;s totally thrown off your game.  I guess a lot of women don&amp;#39;t understand how easily that can happen.  And it&amp;#39;s probably &lt;em&gt;more&lt;/em&gt; likely to happen if you&amp;#39;re very attracted to the woman.  Yes?? You can tell her that!  It&amp;#39;s just the opposite of what she&amp;#39;s assuming....&lt;/p&gt;\n\n&lt;p&gt;Yeah, telling her the whole truth would be good.  It&amp;#39;s not unsexy to be vulnerable like that...(just the opposite for me).  &lt;/p&gt;\n\n&lt;p&gt;Wishing you the best with this. : )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg3uzvq", "score_hidden": false, "stickied": false, "created": 1491914049.0, "created_utc": 1491885249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg4680f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Burner2169", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sit her down and tell her exactly what you told us.\n\nCommunication is always key, without good communication any relationship is bound to fail eventually.\n\nAnd maybe just telling her relieves some of your anxiety.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sit her down and tell her exactly what you told us.&lt;/p&gt;\n\n&lt;p&gt;Communication is always key, without good communication any relationship is bound to fail eventually.&lt;/p&gt;\n\n&lt;p&gt;And maybe just telling her relieves some of your anxiety.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4680f", "score_hidden": false, "stickied": false, "created": 1491941899.0, "created_utc": 1491913099.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg46wko", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TinyCynner", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Well, okay, it'd be one thing if you say it's performance anxiety and she's not believing you. But you haven't actually done that. You've given her excuse after excuse, and she can tell you're lying *but she doesn't know what about*. \"It's the condom, it's the wine.\" Bullshit. And she knows it. But why are you lying? That, she doesn't know. So she's left guessing about whether it's about you... or about her.\n\nSO maybe just talk to her. Tell her the truth! It's okay to be nervous!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, okay, it&amp;#39;d be one thing if you say it&amp;#39;s performance anxiety and she&amp;#39;s not believing you. But you haven&amp;#39;t actually done that. You&amp;#39;ve given her excuse after excuse, and she can tell you&amp;#39;re lying &lt;em&gt;but she doesn&amp;#39;t know what about&lt;/em&gt;. &amp;quot;It&amp;#39;s the condom, it&amp;#39;s the wine.&amp;quot; Bullshit. And she knows it. But why are you lying? That, she doesn&amp;#39;t know. So she&amp;#39;s left guessing about whether it&amp;#39;s about you... or about her.&lt;/p&gt;\n\n&lt;p&gt;SO maybe just talk to her. Tell her the truth! It&amp;#39;s okay to be nervous!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg46wko", "score_hidden": false, "stickied": false, "created": 1491943094.0, "created_utc": 1491914294.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg4aog3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "JessMcNutt", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Okay I'm a bit late to this, but me and my SO were the same. He was a virgin so we took it slow, one time he didn't get hard and it was pretty early on so I was like okay no rush. Then I stayed at his and we were really up for it and he went flaccid. I'm insecure and thought maybe he didn't fancy me, I cried and everything. He was so frustrated because he was saying how much he fancied and thinks he loves me and doesn't know what's going on. \n\nAnyway I ended up talking to my best friend about it and she explained that men get anxiety about these things even if it's subconscious, especially if it's been a while/they're virgins and that I totally over reacted. \n\nSo I just communicated with my SO about it - and eventually he was fine. He actually since we managed to start our sex life will last over an hour which gets a bit tiring! Haha. But I'm happy that we can now. We've been together over 2 years now and we're so happy. \n\nYou just need to communicate and take your time, I'm surprised she's not making the most of the oral! \nMaybe just so that she does not feel it's because of her show her lots of affection, tell her how attractive she is. \n\nIt's like for women, if we aren't comfortable you aren't going to get in to us, you just need to relax, stop thinking about your dick and be in the moment. Think about her body and what you're feeling in the moment, the sooner you're confortable, the sooner you'll be able to have penatrive sex. \n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay I&amp;#39;m a bit late to this, but me and my SO were the same. He was a virgin so we took it slow, one time he didn&amp;#39;t get hard and it was pretty early on so I was like okay no rush. Then I stayed at his and we were really up for it and he went flaccid. I&amp;#39;m insecure and thought maybe he didn&amp;#39;t fancy me, I cried and everything. He was so frustrated because he was saying how much he fancied and thinks he loves me and doesn&amp;#39;t know what&amp;#39;s going on. &lt;/p&gt;\n\n&lt;p&gt;Anyway I ended up talking to my best friend about it and she explained that men get anxiety about these things even if it&amp;#39;s subconscious, especially if it&amp;#39;s been a while/they&amp;#39;re virgins and that I totally over reacted. &lt;/p&gt;\n\n&lt;p&gt;So I just communicated with my SO about it - and eventually he was fine. He actually since we managed to start our sex life will last over an hour which gets a bit tiring! Haha. But I&amp;#39;m happy that we can now. We&amp;#39;ve been together over 2 years now and we&amp;#39;re so happy. &lt;/p&gt;\n\n&lt;p&gt;You just need to communicate and take your time, I&amp;#39;m surprised she&amp;#39;s not making the most of the oral! \nMaybe just so that she does not feel it&amp;#39;s because of her show her lots of affection, tell her how attractive she is. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like for women, if we aren&amp;#39;t comfortable you aren&amp;#39;t going to get in to us, you just need to relax, stop thinking about your dick and be in the moment. Think about her body and what you&amp;#39;re feeling in the moment, the sooner you&amp;#39;re confortable, the sooner you&amp;#39;ll be able to have penatrive sex. &lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4aog3", "score_hidden": false, "stickied": false, "created": 1491948499.0, "created_utc": 1491919699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg46aa5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DasDing1337", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Tbh I had that problem more than twice. Both times it was right at the start of a relationship. Just performance issues. But after seeing the girls more and more often it just disappeared. Can you talk to her about that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tbh I had that problem more than twice. Both times it was right at the start of a relationship. Just performance issues. But after seeing the girls more and more often it just disappeared. Can you talk to her about that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg46aa5", "score_hidden": false, "stickied": false, "created": 1491942012.0, "created_utc": 1491913212.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg4z22m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chewy_pnt", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This happened to my boyfriend when we first started dating. He had been in a twenty something year marriage and I was only his second post divorce. ED the first few times, but we talked about it while it was happening. He went to his doc (we are both in our early 50's and his doc said that can happen) got a prescription for the blue pill and now use them on a pretty reg basis. I sometimes tease him about it (we call his natural erection german cock or mail order cock, since we order them online now). I think the key for us was communication. And on the nights that we drink alcohol I'll ask if he took a pill and tell him I want to fuck mail order cock all night, for some reason this cracks us up. We've been dating three years and fuck like rabbits. :) Good luck and talk to your girl before it's too late.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This happened to my boyfriend when we first started dating. He had been in a twenty something year marriage and I was only his second post divorce. ED the first few times, but we talked about it while it was happening. He went to his doc (we are both in our early 50&amp;#39;s and his doc said that can happen) got a prescription for the blue pill and now use them on a pretty reg basis. I sometimes tease him about it (we call his natural erection german cock or mail order cock, since we order them online now). I think the key for us was communication. And on the nights that we drink alcohol I&amp;#39;ll ask if he took a pill and tell him I want to fuck mail order cock all night, for some reason this cracks us up. We&amp;#39;ve been dating three years and fuck like rabbits. :) Good luck and talk to your girl before it&amp;#39;s too late.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4z22m", "score_hidden": false, "stickied": false, "created": 1491975693.0, "created_utc": 1491946893.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64oafc", "likes": null, "replies": "", "user_reports": [], "id": "dg5oqx9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThatsWhatSheSaid777", "parent_id": "t3_64oafc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Show her what you wrote. \nDon't try to tell her how and why and what, just show her this post OP, she will understand and she'll love you for being that honest with her. \nIt's perfect. Every little detail of your post will make her feel good about you. \nHer confidence struggle will be gone and she will start trying with you and give you all the time in the world. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Show her what you wrote. \nDon&amp;#39;t try to tell her how and why and what, just show her this post OP, she will understand and she&amp;#39;ll love you for being that honest with her. \nIt&amp;#39;s perfect. Every little detail of your post will make her feel good about you. \nHer confidence struggle will be gone and she will start trying with you and give you all the time in the world. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5oqx9", "score_hidden": false, "stickied": false, "created": 1492019933.0, "created_utc": 1491991133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]