[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Backstory:\nMy wife does this thing where after sex she just gets upset sometimes, even if I feel that it was an intense lovemaking session, I always ask her if she wants more after I finish which if she says yes, would be some fingering while she holds her vibrator (magic wand) to her clitoris. During foreplay she doesn&amp;#39;t like receiving oral, nor does she like for me to finger her, she only wants penetration. I have an average penis size which is 5.5 inches and I have somewhat above average girth but I&amp;#39;m no pornstar in terms of stamina etc. The standard advice on this sub seems to be please your woman using fingers or tongue before the actual penetration part, which I can&amp;#39;t do since she doesn&amp;#39;t like it. Yes we&amp;#39;ve tried it many times in the past and I think she used to like it when it was new for her but she once suddenly stopped liking it. I thought I was bad at it so I watched the Nina Hartley video everyone recommends and even read the entire book she comes first and convinced her to give it another shot a few times after she said she doesn&amp;#39;t like it. And no I didn&amp;#39;t mention orgasming or anything like that during those times, I just asked her to enjoy it. She stopped me after 5 minutes every time stating it doesn&amp;#39;t feel good. It&amp;#39;s common knowledge that 5 minutes is barely getting started for oral. And  bye the way when I say &amp;#39;stopped&amp;#39; I mean she physically will move my head and close her legs even after I truthfully proclaimed that I love the way she tastes and I love licking her, I really don&amp;#39;t want to stop, telling her I haven&amp;#39;t even touched the clitoris yet etc. she won&amp;#39;t ever talk to me about what she likes, what feels good what doesn&amp;#39;t. She barely talks at all during sex besides answering questions I ask her. She says it feels weird to talk. So ultimately I gave up on trying oral because she&amp;#39;s obviously not having it. &lt;/p&gt;\n\n&lt;p&gt;My wife has never had sex with anyone else before me. She also does not masturbade at all. She has  never had an orgasm. She also does this weird thing which I&amp;#39;m 99% sure is part of the problem, where when I used to give her oral or when we play with the vibrator, she&amp;#39;ll start shaking, I&amp;#39;m talking both legs, stomach, hands legit (what I&amp;#39;ve seen from porn) pre-orgasm type shaking. She lets the shaking happen once or twice and then stops. And again I don&amp;#39;t want anyone to say you shouldn&amp;#39;t let her stop or you shouldn&amp;#39;t stop licking or fingering her until she comes so let me say this again, she will physically pull me out of there and shut down all access. I&amp;#39;ve tried many times to tie her hands and feet up (with her permission) but she will start yelling and screaming if she gets that far, and close up with the little leeway that she has to the point that it is uncomfortable and frankly a bit rapey for me to continue. &lt;/p&gt;\n\n&lt;p&gt;So for about a year or so now we&amp;#39;ve been just having sex like this; foreplay (kissing, touching, her giving me oral, me kissing her everywhere), penetration (various versions of missionary , cowgirl, doggy etc.) followed by me fingering her while she holds the wand up to her clit if she asks for more. Yesterday after I finished I asked if she&amp;#39;s in the mood for some more and she angrily said no and ran to the bathroom. She came back My wife did something that no husband ever wants to hear, feel, or experience and started straight up crying. Saying stuff like she doesn&amp;#39;t get from sex what I do and every time we have sex and she doesn&amp;#39;t enjoy it she feels like she&amp;#39;s being used. Keep in mind that I&amp;#39;m being blindsided by all of this, except her being upset after sex which happens often. She also said she feels something is wrong with her which is why she&amp;#39;s the way she is. &lt;/p&gt;\n\n&lt;p&gt;It hurt a lot to hear that. Honestly typing that up I had to hold back my emotions. I always figured that she enjoyed sex to a degree since she moans during penetration, and sometimes asks me to fuck her in a certain way but I knew that degree wasnt on par with mine  (which seems common in marriages and relationships in general) but I had no idea that she felt &amp;#39;used&amp;#39;. In the moment I didn&amp;#39;t show my emotions towards what she said but I told her that maybe we&amp;#39;re trying to find a building inside her that she doesn&amp;#39;t herself know the directions to and for it to be enjoyable she will have to find out how to get there and show me the way so I can help her go there. I also said that it&amp;#39;s almost like we&amp;#39;re both trying to solve this Rubik&amp;#39;s cube and we can turn and turn and turn but we won&amp;#39;t magically get there without her knowing the algorithms. (Sorry I do this weird thing with examples) I begged her to explore herself on her own time and even told her to get any new toy her heart so desires, she only has the wand so far. She agreed and said she would do some research. I asked her what the whole &amp;#39;used&amp;#39; this was about and she said she didn&amp;#39;t mean it the way it sounded but she meant the sex is only for me and that&amp;#39;s not how it&amp;#39;s supposed to be. But those words won&amp;#39;t stop ringing it my head, my stomach has been in this weird knot ever since. &lt;/p&gt;\n\n&lt;p&gt;About me: I just basically told you all that&amp;#39;s wrong with my wife in bed but believe me I still love her to bits and pieces. However I also have many flaws. When she first started getting upset after sex it kind of made sex less fun. So i started jerking off more frequently and I&amp;#39;ll admit I adapted to a &amp;#39;deathgrip&amp;#39; which I&amp;#39;m working on. My dick isn&amp;#39;t as hard as it used to be and there have been times where I couldn&amp;#39;t get it up or keep it up. (More often than id like to admit) but I&amp;#39;ve been working on it by jerking off less frequently, buying toys for myself (to avoid death grip), medicating with drugs like weed/cialis etc. also since we first started dating I&amp;#39;ve put on some weight and so has she to be fair.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Backstory:\nMy wife does this thing where after sex she just gets upset sometimes, even if I feel that it was an intense lovemaking session, I always ask her if she wants more after I finish which if she says yes, would be some fingering while she holds her vibrator (magic wand) to her clitoris. During foreplay she doesn't like receiving oral, nor does she like for me to finger her, she only wants penetration. I have an average penis size which is 5.5 inches and I have somewhat above average girth but I'm no pornstar in terms of stamina etc. The standard advice on this sub seems to be please your woman using fingers or tongue before the actual penetration part, which I can't do since she doesn't like it. Yes we've tried it many times in the past and I think she used to like it when it was new for her but she once suddenly stopped liking it. I thought I was bad at it so I watched the Nina Hartley video everyone recommends and even read the entire book she comes first and convinced her to give it another shot a few times after she said she doesn't like it. And no I didn't mention orgasming or anything like that during those times, I just asked her to enjoy it. She stopped me after 5 minutes every time stating it doesn't feel good. It's common knowledge that 5 minutes is barely getting started for oral. And  bye the way when I say 'stopped' I mean she physically will move my head and close her legs even after I truthfully proclaimed that I love the way she tastes and I love licking her, I really don't want to stop, telling her I haven't even touched the clitoris yet etc. she won't ever talk to me about what she likes, what feels good what doesn't. She barely talks at all during sex besides answering questions I ask her. She says it feels weird to talk. So ultimately I gave up on trying oral because she's obviously not having it. \n\n\nMy wife has never had sex with anyone else before me. She also does not masturbade at all. She has  never had an orgasm. She also does this weird thing which I'm 99% sure is part of the problem, where when I used to give her oral or when we play with the vibrator, she'll start shaking, I'm talking both legs, stomach, hands legit (what I've seen from porn) pre-orgasm type shaking. She lets the shaking happen once or twice and then stops. And again I don't want anyone to say you shouldn't let her stop or you shouldn't stop licking or fingering her until she comes so let me say this again, she will physically pull me out of there and shut down all access. I've tried many times to tie her hands and feet up (with her permission) but she will start yelling and screaming if she gets that far, and close up with the little leeway that she has to the point that it is uncomfortable and frankly a bit rapey for me to continue. \n\n\n\nSo for about a year or so now we've been just having sex like this; foreplay (kissing, touching, her giving me oral, me kissing her everywhere), penetration (various versions of missionary , cowgirl, doggy etc.) followed by me fingering her while she holds the wand up to her clit if she asks for more. Yesterday after I finished I asked if she's in the mood for some more and she angrily said no and ran to the bathroom. She came back My wife did something that no husband ever wants to hear, feel, or experience and started straight up crying. Saying stuff like she doesn't get from sex what I do and every time we have sex and she doesn't enjoy it she feels like she's being used. Keep in mind that I'm being blindsided by all of this, except her being upset after sex which happens often. She also said she feels something is wrong with her which is why she's the way she is. \n\n\nIt hurt a lot to hear that. Honestly typing that up I had to hold back my emotions. I always figured that she enjoyed sex to a degree since she moans during penetration, and sometimes asks me to fuck her in a certain way but I knew that degree wasnt on par with mine  (which seems common in marriages and relationships in general) but I had no idea that she felt 'used'. In the moment I didn't show my emotions towards what she said but I told her that maybe we're trying to find a building inside her that she doesn't herself know the directions to and for it to be enjoyable she will have to find out how to get there and show me the way so I can help her go there. I also said that it's almost like we're both trying to solve this Rubik's cube and we can turn and turn and turn but we won't magically get there without her knowing the algorithms. (Sorry I do this weird thing with examples) I begged her to explore herself on her own time and even told her to get any new toy her heart so desires, she only has the wand so far. She agreed and said she would do some research. I asked her what the whole 'used' this was about and she said she didn't mean it the way it sounded but she meant the sex is only for me and that's not how it's supposed to be. But those words won't stop ringing it my head, my stomach has been in this weird knot ever since. \n\n\nAbout me: I just basically told you all that's wrong with my wife in bed but believe me I still love her to bits and pieces. However I also have many flaws. When she first started getting upset after sex it kind of made sex less fun. So i started jerking off more frequently and I'll admit I adapted to a 'deathgrip' which I'm working on. My dick isn't as hard as it used to be and there have been times where I couldn't get it up or keep it up. (More often than id like to admit) but I've been working on it by jerking off less frequently, buying toys for myself (to avoid death grip), medicating with drugs like weed/cialis etc. also since we first started dating I've put on some weight and so has she to be fair.  ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qpds", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1446, "report_reasons": null, "author": "iThrown", "saved": false, "mod_reports": [], "name": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/64qpds/never_orgasmed_wife_broke_down_crying_after_sex/", "num_reports": null, "locked": false, "stickied": false, "created": 1491944945.0, "url": "https://www.reddit.com/r/sex/comments/64qpds/never_orgasmed_wife_broke_down_crying_after_sex/", "author_flair_text": null, "quarantine": false, "title": "[Never Orgasmed] Wife broke down crying after sex, saying what no husband wants to ever hear; sex is unfulfilling for her", "created_utc": 1491916145.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 215, "visited": false, "subreddit_type": "public", "ups": 1446}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6b1ns", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Reignbowbrite", "parent_id": "t1_dg53em2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I am not a huge fan of porn but when I do I actually like girl on girl (I am not a lesbian) just because it's more tender and slow &amp; shows more sexual acts that women enjoy &amp; not a huge cock being pounded into a poor girl that's all sweaty and looks like she is only able to lay there like a sex doll. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am not a huge fan of porn but when I do I actually like girl on girl (I am not a lesbian) just because it&amp;#39;s more tender and slow &amp;amp; shows more sexual acts that women enjoy &amp;amp; not a huge cock being pounded into a poor girl that&amp;#39;s all sweaty and looks like she is only able to lay there like a sex doll. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6b1ns", "score_hidden": false, "stickied": false, "created": 1492050417.0, "created_utc": 1492021617.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg61f5t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "emphesym", "parent_id": "t1_dg61bi2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "But how do you *know* that the video wasn't posted by a bitter ex or that one of the people wasn't pressured into posting it? \n\nEh, yeah, still doesn't do anything for me because the people are random people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But how do you &lt;em&gt;know&lt;/em&gt; that the video wasn&amp;#39;t posted by a bitter ex or that one of the people wasn&amp;#39;t pressured into posting it? &lt;/p&gt;\n\n&lt;p&gt;Eh, yeah, still doesn&amp;#39;t do anything for me because the people are random people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg61f5t", "score_hidden": false, "stickied": false, "created": 1492040452.0, "created_utc": 1492011652.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61bi2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zepelino", "parent_id": "t1_dg618be", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "There are a lot of sites that share amateur porn consensually\n\nBut it's up to you", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a lot of sites that share amateur porn consensually&lt;/p&gt;\n\n&lt;p&gt;But it&amp;#39;s up to you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg61bi2", "score_hidden": false, "stickied": false, "created": 1492040341.0, "created_utc": 1492011541.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg618be", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "emphesym", "parent_id": "t1_dg60m0n", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I've tried it multiple times, including amateur, and the videos just aren't for me, and I also can't get over wondering if they both wanted these videos to be up or if there's any revenge porn aspect. So no thanks, different strokes for different folks, literally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve tried it multiple times, including amateur, and the videos just aren&amp;#39;t for me, and I also can&amp;#39;t get over wondering if they both wanted these videos to be up or if there&amp;#39;s any revenge porn aspect. So no thanks, different strokes for different folks, literally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg618be", "score_hidden": false, "stickied": false, "created": 1492040243.0, "created_utc": 1492011443.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60m0n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zepelino", "parent_id": "t1_dg5zvxa", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;  just because it worked for your exes doesn't mean it would work for her\n\nIf i'm not crazy or something, this sub is for suggestions and advices. I gave mines. \n\n&gt; I hate to watch porn of it because they never fully relax\n\nI think it's time for you give another chance to porn, but look for amateur. Already told you: amateur!! it's like real wife with real husband having real sex with real relaxing and real pleasure and real moaning (most of them are no-moaning or very low, because that's how real sex is most times). Give it a try.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;just because it worked for your exes doesn&amp;#39;t mean it would work for her&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If i&amp;#39;m not crazy or something, this sub is for suggestions and advices. I gave mines. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I hate to watch porn of it because they never fully relax&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think it&amp;#39;s time for you give another chance to porn, but look for amateur. Already told you: amateur!! it&amp;#39;s like real wife with real husband having real sex with real relaxing and real pleasure and real moaning (most of them are no-moaning or very low, because that&amp;#39;s how real sex is most times). Give it a try.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg60m0n", "score_hidden": false, "stickied": false, "created": 1492039563.0, "created_utc": 1492010763.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zvxa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "emphesym", "parent_id": "t1_dg5zpfv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Eh, just because it worked for your exes doesn't mean it would work for her. Porn actually makes me feel worse about sexual activity, like I love oral but I'd hate it if I hate to watch porn of it because they never fully relax in it but just do sexy reactions and moans (including in amateur porn). \n\nThe cuddling and sexual masturbation things might work though! Though I think OP should touch touch her sexually also, she might think her touching herself sexually is gross and undesirable at first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, just because it worked for your exes doesn&amp;#39;t mean it would work for her. Porn actually makes me feel worse about sexual activity, like I love oral but I&amp;#39;d hate it if I hate to watch porn of it because they never fully relax in it but just do sexy reactions and moans (including in amateur porn). &lt;/p&gt;\n\n&lt;p&gt;The cuddling and sexual masturbation things might work though! Though I think OP should touch touch her sexually also, she might think her touching herself sexually is gross and undesirable at first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5zvxa", "score_hidden": false, "stickied": false, "created": 1492038767.0, "created_utc": 1492009967.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zpfv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zepelino", "parent_id": "t1_dg5zia7", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "My bet is: her mind is closed to sexuality. Her reactions to oral seems to me that she feel guilty for having pleasure\n\nMasturbation, sexual cuddling and porn can open some lock she have in her mind. Worked for 2 of my exes.. both viewed sex as a source of pain and shame for women, but an mandatory thing to keep her guy up to her\n\nAnd professional sex seems to artificial to me.. actually, everybody involved are being used to feed an industry, and I find it disgusting as hell", "edited": 1492010043.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My bet is: her mind is closed to sexuality. Her reactions to oral seems to me that she feel guilty for having pleasure&lt;/p&gt;\n\n&lt;p&gt;Masturbation, sexual cuddling and porn can open some lock she have in her mind. Worked for 2 of my exes.. both viewed sex as a source of pain and shame for women, but an mandatory thing to keep her guy up to her&lt;/p&gt;\n\n&lt;p&gt;And professional sex seems to artificial to me.. actually, everybody involved are being used to feed an industry, and I find it disgusting as hell&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5zpfv", "score_hidden": false, "stickied": false, "created": 1492038564.0, "created_utc": 1492009764.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zia7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "emphesym", "parent_id": "t1_dg5v560", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "But if she doesn't like having sex and feeling pleasure in her own body what makes you think she'll want to watch random strangers doing it? I love doing sexual stuff in my body, but porn including amateur porn is just boring to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But if she doesn&amp;#39;t like having sex and feeling pleasure in her own body what makes you think she&amp;#39;ll want to watch random strangers doing it? I love doing sexual stuff in my body, but porn including amateur porn is just boring to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5zia7", "score_hidden": false, "stickied": false, "created": 1492038341.0, "created_utc": 1492009541.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v560", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zepelino", "parent_id": "t1_dg53em2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "amateur porn can be a hard turn ON in this case, because this is real sex with both man-woman having real pleasure", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;amateur porn can be a hard turn ON in this case, because this is real sex with both man-woman having real pleasure&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5v560", "score_hidden": false, "stickied": false, "created": 1492033041.0, "created_utc": 1492004241.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg61cp1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "emphesym", "parent_id": "t1_dg60y6z", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah, I get your reasoning for when she's more fine with, just think OP should focus on sex as an \"just the two of us\" intimacy thing for now and then if they want to, include that. I wonder if OP's wife would be fine with that mojouograde site later on also!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I get your reasoning for when she&amp;#39;s more fine with, just think OP should focus on sex as an &amp;quot;just the two of us&amp;quot; intimacy thing for now and then if they want to, include that. I wonder if OP&amp;#39;s wife would be fine with that mojouograde site later on also!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg61cp1", "score_hidden": false, "stickied": false, "created": 1492040376.0, "created_utc": 1492011576.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60y6z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5zftt", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg60y6z", "score_hidden": false, "stickied": false, "created": 1492039932.0, "created_utc": 1492011132.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zftt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "emphesym", "parent_id": "t1_dg5k3m4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah I get it but I assume you didn't have as strong a negative emotional reaction to sex and masturbation like OP's wife? Idk, I don't think it's something that should be brought in until way later and doesn't necessarily need to ever be brought in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I get it but I assume you didn&amp;#39;t have as strong a negative emotional reaction to sex and masturbation like OP&amp;#39;s wife? Idk, I don&amp;#39;t think it&amp;#39;s something that should be brought in until way later and doesn&amp;#39;t necessarily need to ever be brought in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5zftt", "score_hidden": false, "stickied": false, "created": 1492038266.0, "created_utc": 1492009466.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5k3m4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg58tyf", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5k3m4", "score_hidden": false, "stickied": false, "created": 1492006484.0, "created_utc": 1491977684.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58tyf", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "emphesym", "parent_id": "t1_dg58cpq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I get your reasoning but just because it does it for women who already like sex and masturbation like those videos doesn't mean it will work for her. They're still mostly actors who she doesn't know having sex for a show and there's a hot woman there who isn't her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get your reasoning but just because it does it for women who already like sex and masturbation like those videos doesn&amp;#39;t mean it will work for her. They&amp;#39;re still mostly actors who she doesn&amp;#39;t know having sex for a show and there&amp;#39;s a hot woman there who isn&amp;#39;t her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg58tyf", "score_hidden": false, "stickied": false, "created": 1491988473.0, "created_utc": 1491959673.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 49}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58cpq", "gilded": 0, "archived": false, "score": -24, "report_reasons": null, "author": "admiral_snugglebutt", "parent_id": "t1_dg53em2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "/r/chickflixxx", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/chickflixxx\"&gt;/r/chickflixxx&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg58cpq", "score_hidden": false, "stickied": false, "created": 1491987860.0, "created_utc": 1491959060.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -24}}], "after": null, "before": null}}, "user_reports": [], "id": "dg53em2", "gilded": 0, "archived": false, "score": 160, "report_reasons": null, "author": "emphesym", "parent_id": "t1_dg4eabg", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If she feels used during sex then I would really, really recommend against watching porn with her because that'll just strengthen that feeling.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she feels used during sex then I would really, really recommend against watching porn with her because that&amp;#39;ll just strengthen that feeling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg53em2", "score_hidden": false, "stickied": false, "created": 1491981257.0, "created_utc": 1491952457.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 160}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4lk1i", "gilded": 0, "archived": false, "score": 62, "report_reasons": null, "author": "FaerieBelle", "parent_id": "t1_dg4eabg", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I can't second this comment enough - This is fantastic advice, and everything I wanted to say! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t second this comment enough - This is fantastic advice, and everything I wanted to say! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4lk1i", "score_hidden": false, "stickied": false, "created": 1491960713.0, "created_utc": 1491931913.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 62}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5mi78", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bright__eyes", "parent_id": "t1_dg5h6un", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "oh absolutely and i kinda think thats the danger of the legal cannabis industry, that new users dont really know how or where to start. im very pro pot but would only suggest smoking a joint at first. its normal to not feel it the first few times you use but after that you can kinda dose yourself. although even i have a tolerance and really dont like edibles, i hate not knowing when it will kick in and if it will be too strong or what. starting with edibles or whatever wax/shatter/etc is super strong and on the market these days can be dangerous.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh absolutely and i kinda think thats the danger of the legal cannabis industry, that new users dont really know how or where to start. im very pro pot but would only suggest smoking a joint at first. its normal to not feel it the first few times you use but after that you can kinda dose yourself. although even i have a tolerance and really dont like edibles, i hate not knowing when it will kick in and if it will be too strong or what. starting with edibles or whatever wax/shatter/etc is super strong and on the market these days can be dangerous.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5mi78", "score_hidden": false, "stickied": false, "created": 1492012904.0, "created_utc": 1491984104.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5h6un", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "starbombed", "parent_id": "t1_dg4wv4z", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "i looked forward to using legal pot for the longest time then it was horrible when i took it.... so be careful at least! start at 5mg w edibles", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i looked forward to using legal pot for the longest time then it was horrible when i took it.... so be careful at least! start at 5mg w edibles&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5h6un", "score_hidden": false, "stickied": false, "created": 1492000612.0, "created_utc": 1491971812.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4x24v", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sazzer82", "parent_id": "t1_dg4wv4z", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Agreed. I've had the same problem in the past, but I've since only gotten cannabis with CBD in it. If that's not possible, have a Xanax on hand ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed. I&amp;#39;ve had the same problem in the past, but I&amp;#39;ve since only gotten cannabis with CBD in it. If that&amp;#39;s not possible, have a Xanax on hand &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4x24v", "score_hidden": false, "stickied": false, "created": 1491973294.0, "created_utc": 1491944494.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wv4z", "gilded": 0, "archived": false, "score": 80, "report_reasons": null, "author": "bright__eyes", "parent_id": "t1_dg4prjq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If she's not used to marijuana I don't recommend that. Might make her more anxious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she&amp;#39;s not used to marijuana I don&amp;#39;t recommend that. Might make her more anxious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4wv4z", "score_hidden": false, "stickied": false, "created": 1491973069.0, "created_utc": 1491944269.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 80}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4prjq", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "sazzer82", "parent_id": "t1_dg4eabg", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "All of this. She also might feel ashamed, especially if she grew up in a religious household (not sure if that was answered yet).  Letting go and having an orgasm is opening yourself up to vulnerability. \n\nTry some marijuana...it will help :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All of this. She also might feel ashamed, especially if she grew up in a religious household (not sure if that was answered yet).  Letting go and having an orgasm is opening yourself up to vulnerability. &lt;/p&gt;\n\n&lt;p&gt;Try some marijuana...it will help :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4prjq", "score_hidden": false, "stickied": false, "created": 1491965317.0, "created_utc": 1491936517.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5p23j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GGking41", "parent_id": "t1_dg4eabg", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "The question 6 hit home a little for me but in a different at. When I was young and learning to masturbate I would always stop here because the sensations were overwhelming and intense, almost like being tickled too much, it doesn't hurt but starts to get overpowering.I think I knew if I kept going I would cum but in the moment I was too uncomfortable to get past this stage.  It actually happened for me the first time with a long term boyfriend using a vibrator on me and forcing myself to just let go. And I was in my 20s at this point thinking it would never happen ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The question 6 hit home a little for me but in a different at. When I was young and learning to masturbate I would always stop here because the sensations were overwhelming and intense, almost like being tickled too much, it doesn&amp;#39;t hurt but starts to get overpowering.I think I knew if I kept going I would cum but in the moment I was too uncomfortable to get past this stage.  It actually happened for me the first time with a long term boyfriend using a vibrator on me and forcing myself to just let go. And I was in my 20s at this point thinking it would never happen &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5p23j", "score_hidden": false, "stickied": false, "created": 1492020882.0, "created_utc": 1491992082.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5hlq8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "drmini125", "parent_id": "t1_dg4eabg", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Came here to say that it immediately sounded like number 9. Imo, She's not letting go. TBH, some ppl can just be like that...I know some girls that are super sensitive like that, to the point where they can want absolutely no stimulation cuz it's too much. I always say that if u get past that overwhelming feeling you'll orgasm, and they tell me they just can't. This is two of my friends. Btw. Lol. So it's interesting when u said her legs just shake a lot and then she just stops.... That's not a complete orgasm by the sounds. It's like the lead up, and then she bails out. Very interesting. It's frustrating for her, but again I know people that revel in that kind of thing....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Came here to say that it immediately sounded like number 9. Imo, She&amp;#39;s not letting go. TBH, some ppl can just be like that...I know some girls that are super sensitive like that, to the point where they can want absolutely no stimulation cuz it&amp;#39;s too much. I always say that if u get past that overwhelming feeling you&amp;#39;ll orgasm, and they tell me they just can&amp;#39;t. This is two of my friends. Btw. Lol. So it&amp;#39;s interesting when u said her legs just shake a lot and then she just stops.... That&amp;#39;s not a complete orgasm by the sounds. It&amp;#39;s like the lead up, and then she bails out. Very interesting. It&amp;#39;s frustrating for her, but again I know people that revel in that kind of thing....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5hlq8", "score_hidden": false, "stickied": false, "created": 1492001361.0, "created_utc": 1491972561.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4eabg", "gilded": 0, "archived": false, "score": 507, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[deleted]", "edited": 1491937356.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4eabg", "score_hidden": false, "stickied": false, "created": 1491952741.0, "created_utc": 1491923941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 507}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5cu1i", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "treycook", "parent_id": "t1_dg4uo2a", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; Even so far as closing my thighs real tight so my partner couldn't continue.\n\nWow, I've been with a girl who did that before -- didn't understand it at all. She confirmed that it felt good, that she was enjoying herself, but I kept being forcibly physically pushed away, lol. This is all making a lot of sense now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Even so far as closing my thighs real tight so my partner couldn&amp;#39;t continue.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Wow, I&amp;#39;ve been with a girl who did that before -- didn&amp;#39;t understand it at all. She confirmed that it felt good, that she was enjoying herself, but I kept being forcibly physically pushed away, lol. This is all making a lot of sense now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5cu1i", "score_hidden": false, "stickied": false, "created": 1491993819.0, "created_utc": 1491965019.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dgajfh2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "prototipi", "parent_id": "t1_dg4uo2a", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; I think OP's wife complaining about not enjoying sex is more on her than you. If she cannot get herself to orgasm, how can she expect you to?\n\nI fully agree.\n\n@OP: the way you phrased it, it sounded like you feel you're not doing something right.\nTo me it looks very clear that this isn't anything like that.\n\nIt is a challenge you'll need to work through together, but I actually feel this is a great step forward.\nIf she's upset about it, and has not given up, there's an opening for a change.\nAnd a change in this case means better sex so that's a very appealing prospect ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think OP&amp;#39;s wife complaining about not enjoying sex is more on her than you. If she cannot get herself to orgasm, how can she expect you to?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I fully agree.&lt;/p&gt;\n\n&lt;p&gt;@OP: the way you phrased it, it sounded like you feel you&amp;#39;re not doing something right.\nTo me it looks very clear that this isn&amp;#39;t anything like that.&lt;/p&gt;\n\n&lt;p&gt;It is a challenge you&amp;#39;ll need to work through together, but I actually feel this is a great step forward.\nIf she&amp;#39;s upset about it, and has not given up, there&amp;#39;s an opening for a change.\nAnd a change in this case means better sex so that&amp;#39;s a very appealing prospect ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgajfh2", "score_hidden": false, "stickied": false, "created": 1492283067.0, "created_utc": 1492254267.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4uo2a", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "snug_dealer", "parent_id": "t1_dg4m1dv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Also weighing in, I used to be like that, too. Even so far as closing my thighs real tight so my partner couldn't continue. I was scared of orgasming because it felt so powerful. It took a long time, but I did \"homework\" pretty much by masturbating more often while keeping my breathing steady (would often hold my breath to stifle it). After the first ones on my own, it became easier orgasming with others. It became less scary. \n\nI think OP's wife complaining about not enjoying sex is more on her than you. If she cannot get herself to orgasm, how can she expect you to? So I wouldn't take this as a personal failing, rather a new opportunity to get closer. But she needs to put in the work, too. Maybe it's time for some new toys?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also weighing in, I used to be like that, too. Even so far as closing my thighs real tight so my partner couldn&amp;#39;t continue. I was scared of orgasming because it felt so powerful. It took a long time, but I did &amp;quot;homework&amp;quot; pretty much by masturbating more often while keeping my breathing steady (would often hold my breath to stifle it). After the first ones on my own, it became easier orgasming with others. It became less scary. &lt;/p&gt;\n\n&lt;p&gt;I think OP&amp;#39;s wife complaining about not enjoying sex is more on her than you. If she cannot get herself to orgasm, how can she expect you to? So I wouldn&amp;#39;t take this as a personal failing, rather a new opportunity to get closer. But she needs to put in the work, too. Maybe it&amp;#39;s time for some new toys?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4uo2a", "score_hidden": false, "stickied": false, "created": 1491970597.0, "created_utc": 1491941797.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 58}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4m1dv", "gilded": 0, "archived": false, "score": 123, "report_reasons": null, "author": "jumanjiwasunderrated", "parent_id": "t1_dg49sn8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I used to be like this. I would never masturbate, sex was always a bit u comfortable and I never felt like I was even close to an orgasm. I had sex for 6 years without an orgasm before I finally started to relax and to work with the feelings my partner was giving me, not against them, even when they felt too intense. I genuinely feel sorry for my past self and for OPs wife. \n\nTbh, OP, I don't have the answer. People told me I needed to relax and let it happen for years, but I had to overcome a serious mental block to get there, it's not easy. You seem more than willing to communicate and accommodate but if she isn't in the frame of mind to open up then I don't know that there's anything you can do. You can't make her relax and if you try to push her it may backfire even worse. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to be like this. I would never masturbate, sex was always a bit u comfortable and I never felt like I was even close to an orgasm. I had sex for 6 years without an orgasm before I finally started to relax and to work with the feelings my partner was giving me, not against them, even when they felt too intense. I genuinely feel sorry for my past self and for OPs wife. &lt;/p&gt;\n\n&lt;p&gt;Tbh, OP, I don&amp;#39;t have the answer. People told me I needed to relax and let it happen for years, but I had to overcome a serious mental block to get there, it&amp;#39;s not easy. You seem more than willing to communicate and accommodate but if she isn&amp;#39;t in the frame of mind to open up then I don&amp;#39;t know that there&amp;#39;s anything you can do. You can&amp;#39;t make her relax and if you try to push her it may backfire even worse. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4m1dv", "score_hidden": false, "stickied": false, "created": 1491961233.0, "created_utc": 1491932433.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 123}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5i6n2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Xatne", "parent_id": "t1_dg4snvv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thank you so so so much for this comment. I'm the same as OP's wife, and I never knew this!\nThis whole time I thought I just coincidentally needed to pee when my SO was going ham, so I always made him stop because I was afraid I'd actually end up pissing lol.\nIt didn't help that I had a UTI before this happened, so I thought it wasn't an orgasm.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so so so much for this comment. I&amp;#39;m the same as OP&amp;#39;s wife, and I never knew this!\nThis whole time I thought I just coincidentally needed to pee when my SO was going ham, so I always made him stop because I was afraid I&amp;#39;d actually end up pissing lol.\nIt didn&amp;#39;t help that I had a UTI before this happened, so I thought it wasn&amp;#39;t an orgasm.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5i6n2", "score_hidden": false, "stickied": false, "created": 1492002461.0, "created_utc": 1491973661.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4snvv", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "DaenerysTargaryen3", "parent_id": "t1_dg49sn8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;Also, the part about her almost orgasming and then stopping\n\nShe might be afraid or nervous about the sensation of needing to \"pee\" and that's why she stops", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Also, the part about her almost orgasming and then stopping&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She might be afraid or nervous about the sensation of needing to &amp;quot;pee&amp;quot; and that&amp;#39;s why she stops&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4snvv", "score_hidden": false, "stickied": false, "created": 1491968402.0, "created_utc": 1491939602.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 43}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4ms72", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "real-rainicorn", "parent_id": "t1_dg49sn8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I was in a similar position. \nTo get over it, i got pretty drunk and went to town haha\n\nFrom then on, it became easier and easier. And very fun :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was in a similar position. \nTo get over it, i got pretty drunk and went to town haha&lt;/p&gt;\n\n&lt;p&gt;From then on, it became easier and easier. And very fun :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4ms72", "score_hidden": false, "stickied": false, "created": 1491962051.0, "created_utc": 1491933251.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg54ael", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "CS3883", "parent_id": "t1_dg4zzqe", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm the same way and I'm honestly surprised to see this many people saying the same!! I always felt like I wasn't normal and still don't feel like I am. I can make myself orgasm with zero problems...Whether it be manual or with toys, and I can make it happen very quickly or draw it out and make myself last awhile. But when it comes to getting off with another person? Won't happen. I thought maybe it was because I had gotten so used to how I do it, but I've tried masturbating myself with a vibrator while being with a guy (he let me do my own thing to see what would happen and I made him turns the lights off so I wouldn't get nervous about him watching) and I still couldn't get it to happen. I feel like it's a mental thing for me. Like there's some sort of mental block that I can't seem to get past. I think I can't just mentally let myself relax enough to orgasm with someone? Keep in mind all my past partners have been short flings I've never had someone that I've been with long term to have that 'connection' or whatever when you love someone. I'm kinda curious to see if it would help being under the influence but I also don't want to use that as a crutch if that's the only way I can do it. But I'm also kinda hoping me being able to fully let go that one time will help the rest after be easier. Why can't I have a normal sex life :( ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m the same way and I&amp;#39;m honestly surprised to see this many people saying the same!! I always felt like I wasn&amp;#39;t normal and still don&amp;#39;t feel like I am. I can make myself orgasm with zero problems...Whether it be manual or with toys, and I can make it happen very quickly or draw it out and make myself last awhile. But when it comes to getting off with another person? Won&amp;#39;t happen. I thought maybe it was because I had gotten so used to how I do it, but I&amp;#39;ve tried masturbating myself with a vibrator while being with a guy (he let me do my own thing to see what would happen and I made him turns the lights off so I wouldn&amp;#39;t get nervous about him watching) and I still couldn&amp;#39;t get it to happen. I feel like it&amp;#39;s a mental thing for me. Like there&amp;#39;s some sort of mental block that I can&amp;#39;t seem to get past. I think I can&amp;#39;t just mentally let myself relax enough to orgasm with someone? Keep in mind all my past partners have been short flings I&amp;#39;ve never had someone that I&amp;#39;ve been with long term to have that &amp;#39;connection&amp;#39; or whatever when you love someone. I&amp;#39;m kinda curious to see if it would help being under the influence but I also don&amp;#39;t want to use that as a crutch if that&amp;#39;s the only way I can do it. But I&amp;#39;m also kinda hoping me being able to fully let go that one time will help the rest after be easier. Why can&amp;#39;t I have a normal sex life :( &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg54ael", "score_hidden": false, "stickied": false, "created": 1491982452.0, "created_utc": 1491953652.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4zzqe", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "SammySoapsuds", "parent_id": "t1_dg49sn8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I was like this too and it was mostly subconscious.  I honestly didn't know what was preventing me from letting go and I still don't...what I do know is that smoking weed helped 100%.  Not the healthiest or most permanent way to get over life's problems, but in my case, it helped me be in the moment during sex for the first time in my life and eventually when I learned what that felt like, letting go of control became second nature.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was like this too and it was mostly subconscious.  I honestly didn&amp;#39;t know what was preventing me from letting go and I still don&amp;#39;t...what I do know is that smoking weed helped 100%.  Not the healthiest or most permanent way to get over life&amp;#39;s problems, but in my case, it helped me be in the moment during sex for the first time in my life and eventually when I learned what that felt like, letting go of control became second nature.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4zzqe", "score_hidden": false, "stickied": false, "created": 1491976837.0, "created_utc": 1491948037.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4okx7", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "The_Original_Gronkie", "parent_id": "t1_dg49sn8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Been there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Been there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4okx7", "score_hidden": false, "stickied": false, "created": 1491964036.0, "created_utc": 1491935236.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49sn8", "gilded": 0, "archived": false, "score": 367, "report_reasons": null, "author": "_SadWalrus_", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yup to all of this.  Also, the part about her almost orgasming and then stopping, it's about losing control.  I had a girlfriend that was like this once.  She was just holding back and couldn't or wouldn't let go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup to all of this.  Also, the part about her almost orgasming and then stopping, it&amp;#39;s about losing control.  I had a girlfriend that was like this once.  She was just holding back and couldn&amp;#39;t or wouldn&amp;#39;t let go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg49sn8", "score_hidden": false, "stickied": false, "created": 1491947349.0, "created_utc": 1491918549.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 367}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5lwyx", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "glorypea_inthegarden", "parent_id": "t1_dg4n623", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; In any case, go find a good sex therapist!\n\nTHIS!!!!!!!!! Good luck, for both of you. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In any case, go find a good sex therapist!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;THIS!!!!!!!!! Good luck, for both of you. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5lwyx", "score_hidden": false, "stickied": false, "created": 1492011197.0, "created_utc": 1491982397.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4n623", "gilded": 0, "archived": false, "score": 73, "report_reasons": null, "author": "PeteMichaud", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "When people have something up for them, as in a sexual kink, their relationship to the thing can be confusing, and change moment by moment. From the comfort of reddit we can say \"she's preoccupied with control, so she wants to be in control,\" which may be true at least sometimes, but it's also perfectly possible for someone to be similarly hung up on control and want to be completely dominated or tied up. It's similar to someone being traumatized by rape, and wanting to play out rape fantasies later. \n\nIn any case, go find a good sex therapist!  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When people have something up for them, as in a sexual kink, their relationship to the thing can be confusing, and change moment by moment. From the comfort of reddit we can say &amp;quot;she&amp;#39;s preoccupied with control, so she wants to be in control,&amp;quot; which may be true at least sometimes, but it&amp;#39;s also perfectly possible for someone to be similarly hung up on control and want to be completely dominated or tied up. It&amp;#39;s similar to someone being traumatized by rape, and wanting to play out rape fantasies later. &lt;/p&gt;\n\n&lt;p&gt;In any case, go find a good sex therapist!  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4n623", "score_hidden": false, "stickied": false, "created": 1491962474.0, "created_utc": 1491933674.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 73}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4supo", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "helix19", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Keep in mind many of the things she's doing or saying may be for your benefit rather than hers. She may tell you she likes you in control because she thinks you find that hot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep in mind many of the things she&amp;#39;s doing or saying may be for your benefit rather than hers. She may tell you she likes you in control because she thinks you find that hot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4supo", "score_hidden": false, "stickied": false, "created": 1491968609.0, "created_utc": 1491939809.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4oiuh", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "HappyActually", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She sounds to me like she both likes to be in control, but is also not terribly confident about it.\n\nIf that's accurate, I'm afraid I can't tell you why she's like this. I can't even tell you why *I'm* like this. \n\nLet me know if you find anything that works for her lol, maybe I'll try it with my SO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds to me like she both likes to be in control, but is also not terribly confident about it.&lt;/p&gt;\n\n&lt;p&gt;If that&amp;#39;s accurate, I&amp;#39;m afraid I can&amp;#39;t tell you why she&amp;#39;s like this. I can&amp;#39;t even tell you why &lt;em&gt;I&amp;#39;m&lt;/em&gt; like this. &lt;/p&gt;\n\n&lt;p&gt;Let me know if you find anything that works for her lol, maybe I&amp;#39;ll try it with my SO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4oiuh", "score_hidden": false, "stickied": false, "created": 1491963972.0, "created_utc": 1491935172.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4nhzt", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Greek_Fire", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Has she tried using the vibe while riding you? It won't help with the emotional part, but there's a chance it might help her feel more pleasure while being in control.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Has she tried using the vibe while riding you? It won&amp;#39;t help with the emotional part, but there&amp;#39;s a chance it might help her feel more pleasure while being in control.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4nhzt", "score_hidden": false, "stickied": false, "created": 1491962837.0, "created_utc": 1491934037.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4wcww", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Altostratus", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Anecdotally, I am also a flip-flopper. Some days I want it hard, fast, rough, completely dominated. Other times, that makes me feel like shit and I just want to be held and slowly made love to. With time and practice, my SO and I have developed open communication so that I can make clear what mood I'm in and he's much better able to read my body signals. So there's not necessarily 'one straight answer' - people get in different moods, need different things at different times. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anecdotally, I am also a flip-flopper. Some days I want it hard, fast, rough, completely dominated. Other times, that makes me feel like shit and I just want to be held and slowly made love to. With time and practice, my SO and I have developed open communication so that I can make clear what mood I&amp;#39;m in and he&amp;#39;s much better able to read my body signals. So there&amp;#39;s not necessarily &amp;#39;one straight answer&amp;#39; - people get in different moods, need different things at different times. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4wcww", "score_hidden": false, "stickied": false, "created": 1491972487.0, "created_utc": 1491943687.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4soej", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "PM_ME_FLUFFY_CLOUDS", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It's a loss of *self control* that she is anxious about, not sexual domination. By the sounds of it, I struggle with the exact same problem. I struggle to let go of my self control. I've spent the majority of my life hiding my emotions for the benefit of others, and that spilled over into my sex life. \n\nI don't get much from sex either, and that has nothing to do with my husband's performance, and everything to do with my inability to *just relax.* Nobody would find sex enjoyable if they weren't able to ever relax while doing it! \n\nRiding is definitely my preferred position. I've even used restraints on my husband so that I have 98% control of the situation. And again, it's not just about sexual domination. Dominating my husband doesn't bring my pleasure, *being in control does.* ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a loss of &lt;em&gt;self control&lt;/em&gt; that she is anxious about, not sexual domination. By the sounds of it, I struggle with the exact same problem. I struggle to let go of my self control. I&amp;#39;ve spent the majority of my life hiding my emotions for the benefit of others, and that spilled over into my sex life. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t get much from sex either, and that has nothing to do with my husband&amp;#39;s performance, and everything to do with my inability to &lt;em&gt;just relax.&lt;/em&gt; Nobody would find sex enjoyable if they weren&amp;#39;t able to ever relax while doing it! &lt;/p&gt;\n\n&lt;p&gt;Riding is definitely my preferred position. I&amp;#39;ve even used restraints on my husband so that I have 98% control of the situation. And again, it&amp;#39;s not just about sexual domination. Dominating my husband doesn&amp;#39;t bring my pleasure, &lt;em&gt;being in control does.&lt;/em&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4soej", "score_hidden": false, "stickied": false, "created": 1491968419.0, "created_utc": 1491939619.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4t5rl", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Justine772", "parent_id": "t1_dg4pn3y", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I would guess that eye contact suggests openness and intimacy, whereas if she won't look OP in the eye she's not feeling too great about it. Or her mind is somewhere else and she's not fully in the moment ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would guess that eye contact suggests openness and intimacy, whereas if she won&amp;#39;t look OP in the eye she&amp;#39;s not feeling too great about it. Or her mind is somewhere else and she&amp;#39;s not fully in the moment &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4t5rl", "score_hidden": false, "stickied": false, "created": 1491968932.0, "created_utc": 1491940132.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4regg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "silentxem", "parent_id": "t1_dg4pn3y", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I, too, am curious.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I, too, am curious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4regg", "score_hidden": false, "stickied": false, "created": 1491967037.0, "created_utc": 1491938237.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4xn8s", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "betteroffinbed", "parent_id": "t1_dg4w4tq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Ah yeah, I can relate to this too! :-/ Sadly. But I can still have great sex and multiple orgasms, and be super in love with and attracted to my partner, all with my eyes closed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah yeah, I can relate to this too! :-/ Sadly. But I can still have great sex and multiple orgasms, and be super in love with and attracted to my partner, all with my eyes closed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4xn8s", "score_hidden": false, "stickied": false, "created": 1491973992.0, "created_utc": 1491945192.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4xr58", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "monasequeda", "parent_id": "t1_dg4w4tq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm similar. Even if I'm looking right in his eyes or at him I know if I catch a view of some part of me, I'll stop enjoying it and feel insecure the whole time. It's definitely not ideal, and it'd be great if we could change our thinking, but for now, closing my eyes helps me experience all the good stuff without worrying too much. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m similar. Even if I&amp;#39;m looking right in his eyes or at him I know if I catch a view of some part of me, I&amp;#39;ll stop enjoying it and feel insecure the whole time. It&amp;#39;s definitely not ideal, and it&amp;#39;d be great if we could change our thinking, but for now, closing my eyes helps me experience all the good stuff without worrying too much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4xr58", "score_hidden": false, "stickied": false, "created": 1491974123.0, "created_utc": 1491945323.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4w4tq", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "reidbead", "parent_id": "t1_dg4tzvr", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I close my eyes because I'm embarrassed at my body. I know that isn't a good thing for a relationship, but it has nothing to do with my level of attraction for my boyfriend. I find him hot as fuck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I close my eyes because I&amp;#39;m embarrassed at my body. I know that isn&amp;#39;t a good thing for a relationship, but it has nothing to do with my level of attraction for my boyfriend. I find him hot as fuck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4w4tq", "score_hidden": false, "stickied": false, "created": 1491972237.0, "created_utc": 1491943437.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5ciqc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "planet_smasher", "parent_id": "t1_dg4tzvr", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yep, my husband and I have a pretty amazing sex life and I'm super into him. I still close my eyes to focus on how it feels!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, my husband and I have a pretty amazing sex life and I&amp;#39;m super into him. I still close my eyes to focus on how it feels!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5ciqc", "score_hidden": false, "stickied": false, "created": 1491993380.0, "created_utc": 1491964580.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4tzvr", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "betteroffinbed", "parent_id": "t1_dg4t077", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I [28F] close my eyes just about the entire time I'm having sex because it's what I'm most comfortable with and helps me focus on the sensation. Sometimes, if I keep my eyes open, it starts to feel too much like I'm performing for my partner, too much pressure, instead of enjoying the sensations I'm feeling. I have been this way with all my partners, from casual to long term deeply in love. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I [28F] close my eyes just about the entire time I&amp;#39;m having sex because it&amp;#39;s what I&amp;#39;m most comfortable with and helps me focus on the sensation. Sometimes, if I keep my eyes open, it starts to feel too much like I&amp;#39;m performing for my partner, too much pressure, instead of enjoying the sensations I&amp;#39;m feeling. I have been this way with all my partners, from casual to long term deeply in love. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4tzvr", "score_hidden": false, "stickied": false, "created": 1491969845.0, "created_utc": 1491941045.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5lo08", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "prickelypear", "parent_id": "t1_dg4t077", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I close my eyes during sex, but that's because I have issues making eye contact in general. It makes me feel anxious and uncomfortable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I close my eyes during sex, but that&amp;#39;s because I have issues making eye contact in general. It makes me feel anxious and uncomfortable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5lo08", "score_hidden": false, "stickied": false, "created": 1492010498.0, "created_utc": 1491981698.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5iauq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ptrst", "parent_id": "t1_dg4t077", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I close my eyes basically all the time (especially when he's going down on me) because light is too distracting/irritating to deal with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I close my eyes basically all the time (especially when he&amp;#39;s going down on me) because light is too distracting/irritating to deal with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5iauq", "score_hidden": false, "stickied": false, "created": 1492002678.0, "created_utc": 1491973878.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4t077", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Bodongs", "parent_id": "t1_dg4pn3y", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Well, think about sexual encounters you've had. Think about the good ones and the bad ones. Long term partners you're still attracted to and not.  \n\nWhere do YOU remember looking? If you're not exactly attracted to somebody, what do you do? Close your eyes. Fantasize. The ENTIRE time. Because you're here in this moment, you're committed and not leaving, but you know your libido will betray you if you look into the eyes of this person you don't feel for at all.\n\nNow, this isn't a hard stop \"ok she's not attracted to you, she's trying to \"be somewhere else\" lawyer up gym tan laundry\". But it's a start. He mentioned gaining weight. Maybe she's not into him anymore. Maybe it's a physical thing, maybe other aspects of the relationship have affected her ability to see him that way, hell maybe she's into women.\n\nAll I'm saying is when I'm fucking somebody I want to fuck, my eyes are on them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, think about sexual encounters you&amp;#39;ve had. Think about the good ones and the bad ones. Long term partners you&amp;#39;re still attracted to and not.  &lt;/p&gt;\n\n&lt;p&gt;Where do YOU remember looking? If you&amp;#39;re not exactly attracted to somebody, what do you do? Close your eyes. Fantasize. The ENTIRE time. Because you&amp;#39;re here in this moment, you&amp;#39;re committed and not leaving, but you know your libido will betray you if you look into the eyes of this person you don&amp;#39;t feel for at all.&lt;/p&gt;\n\n&lt;p&gt;Now, this isn&amp;#39;t a hard stop &amp;quot;ok she&amp;#39;s not attracted to you, she&amp;#39;s trying to &amp;quot;be somewhere else&amp;quot; lawyer up gym tan laundry&amp;quot;. But it&amp;#39;s a start. He mentioned gaining weight. Maybe she&amp;#39;s not into him anymore. Maybe it&amp;#39;s a physical thing, maybe other aspects of the relationship have affected her ability to see him that way, hell maybe she&amp;#39;s into women.&lt;/p&gt;\n\n&lt;p&gt;All I&amp;#39;m saying is when I&amp;#39;m fucking somebody I want to fuck, my eyes are on them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4t077", "score_hidden": false, "stickied": false, "created": 1491968768.0, "created_utc": 1491939968.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4pn3y", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "whitewedges", "parent_id": "t1_dg4k7ln", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Even if OP doesn't reply can you tell me why you asked that? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if OP doesn&amp;#39;t reply can you tell me why you asked that? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4pn3y", "score_hidden": false, "stickied": false, "created": 1491965186.0, "created_utc": 1491936386.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4koau", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4k7ln", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4koau", "score_hidden": false, "stickied": false, "created": 1491959750.0, "created_utc": 1491930950.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4k7ln", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Bodongs", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "When she's on top of you, where is she looking? Where is she most often looking during sex?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When she&amp;#39;s on top of you, where is she looking? Where is she most often looking during sex?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4k7ln", "score_hidden": false, "stickied": false, "created": 1491959239.0, "created_utc": 1491930439.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4rp0o", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "recyclopath_", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She might be interested in a bit of both being in control and not having control. Switches are a thing in bdsm and maybe some toying with sensation play and light bondage could be fun. You sound like you could use a sex therapist or some real work together in general, I'm not saying bdsm is the answer. In regards to her control or not control thing she likely just has more dominant or more submissive moods and it may be good to explore them together. My dominant and submissive moods depend a lot on what's going on in my life at the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She might be interested in a bit of both being in control and not having control. Switches are a thing in bdsm and maybe some toying with sensation play and light bondage could be fun. You sound like you could use a sex therapist or some real work together in general, I&amp;#39;m not saying bdsm is the answer. In regards to her control or not control thing she likely just has more dominant or more submissive moods and it may be good to explore them together. My dominant and submissive moods depend a lot on what&amp;#39;s going on in my life at the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4rp0o", "score_hidden": false, "stickied": false, "created": 1491967355.0, "created_utc": 1491938555.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4rc0k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "silentxem", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Could also be why she will give you head, but doesn't like to receive it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could also be why she will give you head, but doesn&amp;#39;t like to receive it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4rc0k", "score_hidden": false, "stickied": false, "created": 1491966963.0, "created_utc": 1491938163.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4xbef", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sharpiefairy666", "parent_id": "t1_dg4h4o4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She might like when you tell her what to do because she's trying to get you to finish faster. I've been on the negative end of that situation, and I've definitely done everything I can to just *get it over with.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She might like when you tell her what to do because she&amp;#39;s trying to get you to finish faster. I&amp;#39;ve been on the negative end of that situation, and I&amp;#39;ve definitely done everything I can to just &lt;em&gt;get it over with.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4xbef", "score_hidden": false, "stickied": false, "created": 1491973594.0, "created_utc": 1491944794.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4h4o4", "gilded": 0, "archived": false, "score": 71, "report_reasons": null, "author": "iThrown", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't know about this for sure. I once (about a year ago) got a text from her where she said she likes when I'm in control and when I tell her what to do, but then another time  she told me her mood on how she likes or wants it differs depending on the day. But I have noticed lately when she's riding me and I'm playing with her ass/touching her, she will move my hands up over my head. I asked her if that's because she doesn't want me to touch her like that or if she likes being in control... didn't get a straight answer. So I'm kind of torn. She also likes riding me more than anything so you might be right \n\nEDIT: typos", "edited": 1491949227.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know about this for sure. I once (about a year ago) got a text from her where she said she likes when I&amp;#39;m in control and when I tell her what to do, but then another time  she told me her mood on how she likes or wants it differs depending on the day. But I have noticed lately when she&amp;#39;s riding me and I&amp;#39;m playing with her ass/touching her, she will move my hands up over my head. I asked her if that&amp;#39;s because she doesn&amp;#39;t want me to touch her like that or if she likes being in control... didn&amp;#39;t get a straight answer. So I&amp;#39;m kind of torn. She also likes riding me more than anything so you might be right &lt;/p&gt;\n\n&lt;p&gt;EDIT: typos&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4h4o4", "score_hidden": false, "stickied": false, "created": 1491955884.0, "created_utc": 1491927084.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 71}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4gqfp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ArrowRobber", "parent_id": "t1_dg4gabj", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm sure some light struggling on his part to touch you or get closer to kiss you helps.\n\n(my own sexual adventures have all revolved around my partners expecting me to dominate // that's how it's felt.  So ironically \"intimate\", \"slow\", and \"vanilla\" would be my biggest kinks I've had no chance to explore.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure some light struggling on his part to touch you or get closer to kiss you helps.&lt;/p&gt;\n\n&lt;p&gt;(my own sexual adventures have all revolved around my partners expecting me to dominate // that&amp;#39;s how it&amp;#39;s felt.  So ironically &amp;quot;intimate&amp;quot;, &amp;quot;slow&amp;quot;, and &amp;quot;vanilla&amp;quot; would be my biggest kinks I&amp;#39;ve had no chance to explore.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4gqfp", "score_hidden": false, "stickied": false, "created": 1491955446.0, "created_utc": 1491926646.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gabj", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4g0nu", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4gabj", "score_hidden": false, "stickied": false, "created": 1491954951.0, "created_utc": 1491926151.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4g0nu", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "ArrowRobber", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Another angle is giving her more control?  Tieing someone up doesn't really help them relax unless they're already into giving up control.  If the lead role is given to the wife, the husband accepts he  may get blue balled a while, and he's able to not whine or pressure her, it may let her contextualize sex is more than a marital obligation?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another angle is giving her more control?  Tieing someone up doesn&amp;#39;t really help them relax unless they&amp;#39;re already into giving up control.  If the lead role is given to the wife, the husband accepts he  may get blue balled a while, and he&amp;#39;s able to not whine or pressure her, it may let her contextualize sex is more than a marital obligation?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4g0nu", "score_hidden": false, "stickied": false, "created": 1491954661.0, "created_utc": 1491925861.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg58yvx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MasterBob", "parent_id": "t1_dg54qa1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This isn't the first time I've heard of something along those lines.\n\nI'm glad ya'll talked and really connected. I hope you continue to do so in the future. =)\n\nI wish you all the best!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t the first time I&amp;#39;ve heard of something along those lines.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad ya&amp;#39;ll talked and really connected. I hope you continue to do so in the future. =)&lt;/p&gt;\n\n&lt;p&gt;I wish you all the best!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg58yvx", "score_hidden": false, "stickied": false, "created": 1491988650.0, "created_utc": 1491959850.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg54qa1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "D3rp1na", "parent_id": "t1_dg52a6z", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If it wasn't for Molly, I seriously don't think my husband and I would have even made it to marriage. We laid A LOT of our shit out in the open. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it wasn&amp;#39;t for Molly, I seriously don&amp;#39;t think my husband and I would have even made it to marriage. We laid A LOT of our shit out in the open. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg54qa1", "score_hidden": false, "stickied": false, "created": 1491983054.0, "created_utc": 1491954254.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg592go", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FNG_WolfKnight", "parent_id": "t1_dg58qc8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Well I'm 25 and haven't done much since high school. If you told high school me that I would find my calling because I rolled my ass off at a rave, I would have laughed at you. I was borderline emo metal head in high school, now a rave kid lol. \n\nI'm sure you'll find it eventually 😊😊", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;m 25 and haven&amp;#39;t done much since high school. If you told high school me that I would find my calling because I rolled my ass off at a rave, I would have laughed at you. I was borderline emo metal head in high school, now a rave kid lol. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure you&amp;#39;ll find it eventually 😊😊&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg592go", "score_hidden": false, "stickied": false, "created": 1491988776.0, "created_utc": 1491959976.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58qc8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MasterBob", "parent_id": "t1_dg58hlh", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; Now I know what I want to do with my life.\n\nStill trying to figure that one out. lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Now I know what I want to do with my life.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Still trying to figure that one out. lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg58qc8", "score_hidden": false, "stickied": false, "created": 1491988342.0, "created_utc": 1491959542.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58hlh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FNG_WolfKnight", "parent_id": "t1_dg58exf", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Oh I hope so. My first experience with MDMA opened my eyes to psychology. Now I *know* what I want to do with my life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I hope so. My first experience with MDMA opened my eyes to psychology. Now I &lt;em&gt;know&lt;/em&gt; what I want to do with my life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg58hlh", "score_hidden": false, "stickied": false, "created": 1491988035.0, "created_utc": 1491959235.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58exf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MasterBob", "parent_id": "t1_dg52a6z", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Like all things in life, it's how you do it which really counts.\n\nI think MDMA has serious therapeutic potential. MAPS is trying to make it legal by 2021. Check it out: http://www.maps.org/research/mdma", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like all things in life, it&amp;#39;s how you do it which really counts.&lt;/p&gt;\n\n&lt;p&gt;I think MDMA has serious therapeutic potential. MAPS is trying to make it legal by 2021. Check it out: &lt;a href=\"http://www.maps.org/research/mdma\"&gt;http://www.maps.org/research/mdma&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg58exf", "score_hidden": false, "stickied": false, "created": 1491987938.0, "created_utc": 1491959138.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52a6z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "FNG_WolfKnight", "parent_id": "t1_dg4ra4v", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You aren't wrong. I'd really stress setting up a \"sober reflection\" on what was learned. My first \"roll\" on Molly became very therapeutic. I learned a lot about some very deep foundational depression from my high school years. I love Molly, it's a wonderful drug tbh. There are people that chase the \"magic\" but burn out on it because they use it too often. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You aren&amp;#39;t wrong. I&amp;#39;d really stress setting up a &amp;quot;sober reflection&amp;quot; on what was learned. My first &amp;quot;roll&amp;quot; on Molly became very therapeutic. I learned a lot about some very deep foundational depression from my high school years. I love Molly, it&amp;#39;s a wonderful drug tbh. There are people that chase the &amp;quot;magic&amp;quot; but burn out on it because they use it too often. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg52a6z", "score_hidden": false, "stickied": false, "created": 1491979761.0, "created_utc": 1491950961.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ra4v", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MasterBob", "parent_id": "t1_dg4natl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;Use a substance to change your inner self perspective.\n\nIt's very easy to become dependent on said substance by doing so. It's also very easy to just lean on said substance and not do the work to grow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Use a substance to change your inner self perspective.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s very easy to become dependent on said substance by doing so. It&amp;#39;s also very easy to just lean on said substance and not do the work to grow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4ra4v", "score_hidden": false, "stickied": false, "created": 1491966908.0, "created_utc": 1491938108.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4natl", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "FNG_WolfKnight", "parent_id": "t1_dg4il72", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If she got drunk, she might let go of some of the control she is seeking. Then she might actually realize that if she just lets go of control, and trust OP, then she'll enjoy it. It's basic psychotherapy actually. Use a substance to change your inner self  perspective. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she got drunk, she might let go of some of the control she is seeking. Then she might actually realize that if she just lets go of control, and trust OP, then she&amp;#39;ll enjoy it. It&amp;#39;s basic psychotherapy actually. Use a substance to change your inner self  perspective. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4natl", "score_hidden": false, "stickied": false, "created": 1491962619.0, "created_utc": 1491933819.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4nxdv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "LDan613", "parent_id": "t1_dg4il72", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I agree, that is why I said that the professional help solutions is very valid in this case.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, that is why I said that the professional help solutions is very valid in this case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4nxdv", "score_hidden": false, "stickied": false, "created": 1491963314.0, "created_utc": 1491934514.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4il72", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "MasterBob", "parent_id": "t1_dg4co4h", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "That's is a okay resolution in the short term, but definitely not okay for the medium and long term.\n\nIt's just dealing with the symptom, not actually solving the problem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s is a okay resolution in the short term, but definitely not okay for the medium and long term.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just dealing with the symptom, not actually solving the problem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4il72", "score_hidden": false, "stickied": false, "created": 1491957479.0, "created_utc": 1491928679.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4ev7b", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "liberal_texan", "parent_id": "t1_dg4co4h", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I had one that used cannabis.  It's not a replacement for counseling, but it can help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had one that used cannabis.  It&amp;#39;s not a replacement for counseling, but it can help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4ev7b", "score_hidden": false, "stickied": false, "created": 1491953378.0, "created_utc": 1491924578.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg500nf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Alacritous", "parent_id": "t1_dg4co4h", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yep. Pot is also a good relaxant.  I used to have a girlfriend that wasn't too bad when she was sober, but get her high, and watch out.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep. Pot is also a good relaxant.  I used to have a girlfriend that wasn&amp;#39;t too bad when she was sober, but get her high, and watch out.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg500nf", "score_hidden": false, "stickied": false, "created": 1491976867.0, "created_utc": 1491948067.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4co4h", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "LDan613", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Besides the very valid suggestion of professional help, I  had a girlfriend that used to deal with her control issues by having a couple of stiff drinks prior to sex.   She did enjoyed herself way more when we did that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Besides the very valid suggestion of professional help, I  had a girlfriend that used to deal with her control issues by having a couple of stiff drinks prior to sex.   She did enjoyed herself way more when we did that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4co4h", "score_hidden": false, "stickied": false, "created": 1491950907.0, "created_utc": 1491922107.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 52}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4bnxq", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "MyroIII", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This. But also, don't lead with suggesting this, maybe slowly allow her to discover it 'herself\". Unless she verbalizes that she has control issues often and is mentally okay with it, you suggesting it could cause an explosion of anger. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. But also, don&amp;#39;t lead with suggesting this, maybe slowly allow her to discover it &amp;#39;herself&amp;quot;. Unless she verbalizes that she has control issues often and is mentally okay with it, you suggesting it could cause an explosion of anger. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4bnxq", "score_hidden": false, "stickied": false, "created": 1491949718.0, "created_utc": 1491920918.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4i69g", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "TheIronMoose", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She probably has some control issues in the rest of her life as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She probably has some control issues in the rest of her life as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4i69g", "score_hidden": false, "stickied": false, "created": 1491957016.0, "created_utc": 1491928216.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg513ey", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "8-BitBaker", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I want to second this because for a long time, I couldn't orgasm and I didn't understand why. With my current boyfriend it hasn't been a problem, so I haven't thought about it in forever. \n\nI am horrified by the thought of being out of control of my body. I won't drink or do drugs because the thought of being inebriated terrifies me: since I was a child I've always said I couldn't comprehend why someone wouldn't want to be in control of themselves. Thinking about that, it makes complete sense that I was essentially stopping myself from orgasming for a long  time as well. Even if for only a seconds, it's a loss of control. My body would freeze up completely when I was close and I just wouldn't be able to do it. \n\nI think the difference now is that I have complete trust in my boyfriend. I know that doesn't help you, OP, but of that is what's missing... I definitely think couples therapy is the best option. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to second this because for a long time, I couldn&amp;#39;t orgasm and I didn&amp;#39;t understand why. With my current boyfriend it hasn&amp;#39;t been a problem, so I haven&amp;#39;t thought about it in forever. &lt;/p&gt;\n\n&lt;p&gt;I am horrified by the thought of being out of control of my body. I won&amp;#39;t drink or do drugs because the thought of being inebriated terrifies me: since I was a child I&amp;#39;ve always said I couldn&amp;#39;t comprehend why someone wouldn&amp;#39;t want to be in control of themselves. Thinking about that, it makes complete sense that I was essentially stopping myself from orgasming for a long  time as well. Even if for only a seconds, it&amp;#39;s a loss of control. My body would freeze up completely when I was close and I just wouldn&amp;#39;t be able to do it. &lt;/p&gt;\n\n&lt;p&gt;I think the difference now is that I have complete trust in my boyfriend. I know that doesn&amp;#39;t help you, OP, but of that is what&amp;#39;s missing... I definitely think couples therapy is the best option. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg513ey", "score_hidden": false, "stickied": false, "created": 1491978238.0, "created_utc": 1491949438.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4vfoe", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Acrolith", "parent_id": "t1_dg4kykd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "There's lots of reasons someone might not like being tickled. It's always a mistake to try and understand someone based on a single quirk. I was confident in my armchair diagnosis of OP's wife because everything he wrote about her fit my experiences. I dunno anything about your partners.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s lots of reasons someone might not like being tickled. It&amp;#39;s always a mistake to try and understand someone based on a single quirk. I was confident in my armchair diagnosis of OP&amp;#39;s wife because everything he wrote about her fit my experiences. I dunno anything about your partners.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4vfoe", "score_hidden": false, "stickied": false, "created": 1491971458.0, "created_utc": 1491942658.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4vum2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "betsybraddock", "parent_id": "t1_dg4ulll", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is why I hate it.  It's fun for about 10 seconds and then the \"I can't breathe\" panic sets in and it starts to feel like they're trying to kill me.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why I hate it.  It&amp;#39;s fun for about 10 seconds and then the &amp;quot;I can&amp;#39;t breathe&amp;quot; panic sets in and it starts to feel like they&amp;#39;re trying to kill me.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4vum2", "score_hidden": false, "stickied": false, "created": 1491971925.0, "created_utc": 1491943125.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ulll", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "New1new1", "parent_id": "t1_dg4rg62", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Oh maybe because every ticklish person hates to be tickled because it makes them feel like they're going to suffocate because they cannot breath in because of laughter?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh maybe because every ticklish person hates to be tickled because it makes them feel like they&amp;#39;re going to suffocate because they cannot breath in because of laughter?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4ulll", "score_hidden": false, "stickied": false, "created": 1491970521.0, "created_utc": 1491941721.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rg62", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Edwardteech", "parent_id": "t1_dg4kykd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thats probably more a macho self image thing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thats probably more a macho self image thing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4rg62", "score_hidden": false, "stickied": false, "created": 1491967089.0, "created_utc": 1491938289.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kykd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "New1new1", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Do you mind to elaborate where all this comes from? I had male partners who hated to be playfully tickled, and had no problems coming...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you mind to elaborate where all this comes from? I had male partners who hated to be playfully tickled, and had no problems coming...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4kykd", "score_hidden": false, "stickied": false, "created": 1491960066.0, "created_utc": 1491931266.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4xeg2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "quadrofolio", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sounds about right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds about right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4xeg2", "score_hidden": false, "stickied": false, "created": 1491973696.0, "created_utc": 1491944896.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5bd03", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wave33", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah, I think that's my same problem. I haven't orgasmed before, even with enjoyable sex. But I'm perplexed by her, \"I feel used,\" attitude. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I think that&amp;#39;s my same problem. I haven&amp;#39;t orgasmed before, even with enjoyable sex. But I&amp;#39;m perplexed by her, &amp;quot;I feel used,&amp;quot; attitude. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5bd03", "score_hidden": false, "stickied": false, "created": 1491991783.0, "created_utc": 1491962983.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4f9z2", "gilded": 0, "archived": false, "score": -17, "report_reasons": null, "author": "Call_Me_Kyle", "parent_id": "t1_dg48x5j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She's a Dom, ask her to dominate you. Will be good. Check out Dom stuff for her to try and see if she likes. \n\nI can't get off if my gf is in control, total turn off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s a Dom, ask her to dominate you. Will be good. Check out Dom stuff for her to try and see if she likes. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t get off if my gf is in control, total turn off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4f9z2", "score_hidden": false, "stickied": false, "created": 1491953840.0, "created_utc": 1491925040.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48x5j", "gilded": 0, "archived": false, "score": 1088, "report_reasons": null, "author": "Acrolith", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I've seen this before. Everything about this screams control issues. She cannot find fulfillment in sex because she can't let go, can't allow herself to lose control and have an orgasm.\n\n&gt; she feels like she's being used\n\nShe feels like she's not in control.\n\n&gt; I've tried many times to tie her hands and feet up (with her permission) but she will start yelling and screaming if she gets that far\n\nShe feels like she's not in control.\n\nShe also hates being playfully tickled, right? Yeah, I've seen this. I don't know *why* she has these issues, though, or how to fix them. I think couples therapy is your best bet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen this before. Everything about this screams control issues. She cannot find fulfillment in sex because she can&amp;#39;t let go, can&amp;#39;t allow herself to lose control and have an orgasm.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;she feels like she&amp;#39;s being used&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She feels like she&amp;#39;s not in control.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;ve tried many times to tie her hands and feet up (with her permission) but she will start yelling and screaming if she gets that far&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She feels like she&amp;#39;s not in control.&lt;/p&gt;\n\n&lt;p&gt;She also hates being playfully tickled, right? Yeah, I&amp;#39;ve seen this. I don&amp;#39;t know &lt;em&gt;why&lt;/em&gt; she has these issues, though, or how to fix them. I think couples therapy is your best bet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg48x5j", "score_hidden": false, "stickied": false, "created": 1491946167.0, "created_utc": 1491917367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1088}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg48bm9", "gilded": 0, "archived": false, "score": 144, "report_reasons": null, "author": "Emack76", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "There's a lot going on here.  I'd recommend seeing a sex positive couples counselor or a sex therapist.  I think it's good that you recognize that there are probably issues on both sides.  Talking to a neutral third party will help, for sure.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a lot going on here.  I&amp;#39;d recommend seeing a sex positive couples counselor or a sex therapist.  I think it&amp;#39;s good that you recognize that there are probably issues on both sides.  Talking to a neutral third party will help, for sure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg48bm9", "score_hidden": false, "stickied": false, "created": 1491945321.0, "created_utc": 1491916521.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 144}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg48tv2", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "IngrownHoenail", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I agree with /u/Emack76 - there is a whole lot to solve for here. Both of you should get some help to sort it all out. It could be just a matter of some resentment about one thing or another on her part, and frustration on your part for not being able to fulfill what you want either. First, I'd say work to get healthy. You both have put on weight that can have a lot of impacts beyond the obvious appearance ones, as you probably have discovered. Eat better, exercise, get to your desired state of health. Simultaneously, you can both see a counselor. I'd say to the same one by yourselves first, then come together after a few sessions. May be more constructive that way once you've both had a chance to objectively think and discuss it all with an unbiased person. And lastly, be prepared to accept that she may have changed, may have not been has honest with you in the beginning about how important or fun sex is for her, for you to have changed, or for you to come to the realization that you could/should be doing something differently to help the situation. When both people are hurt, it's really hard to 'give in' to the idea that part of it is on you. But there are probably some things are in your court if you want things to smooth out. Good luck man. I know situations like this can eat at you. Take those baby steps to get back to a solid space with her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with &lt;a href=\"/u/Emack76\"&gt;/u/Emack76&lt;/a&gt; - there is a whole lot to solve for here. Both of you should get some help to sort it all out. It could be just a matter of some resentment about one thing or another on her part, and frustration on your part for not being able to fulfill what you want either. First, I&amp;#39;d say work to get healthy. You both have put on weight that can have a lot of impacts beyond the obvious appearance ones, as you probably have discovered. Eat better, exercise, get to your desired state of health. Simultaneously, you can both see a counselor. I&amp;#39;d say to the same one by yourselves first, then come together after a few sessions. May be more constructive that way once you&amp;#39;ve both had a chance to objectively think and discuss it all with an unbiased person. And lastly, be prepared to accept that she may have changed, may have not been has honest with you in the beginning about how important or fun sex is for her, for you to have changed, or for you to come to the realization that you could/should be doing something differently to help the situation. When both people are hurt, it&amp;#39;s really hard to &amp;#39;give in&amp;#39; to the idea that part of it is on you. But there are probably some things are in your court if you want things to smooth out. Good luck man. I know situations like this can eat at you. Take those baby steps to get back to a solid space with her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg48tv2", "score_hidden": false, "stickied": false, "created": 1491946042.0, "created_utc": 1491917242.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5v8e3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "darkmatterisfun", "parent_id": "t1_dg4wsl5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This man speaks wise words.\n\nIve had similar experience with an ex of mine. Your last paragraph rung true with me. Don't let it destroy your sexual confidence, it's very painful. But again same story for me. Found my current gf and it's been wonderful since. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This man speaks wise words.&lt;/p&gt;\n\n&lt;p&gt;Ive had similar experience with an ex of mine. Your last paragraph rung true with me. Don&amp;#39;t let it destroy your sexual confidence, it&amp;#39;s very painful. But again same story for me. Found my current gf and it&amp;#39;s been wonderful since. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5v8e3", "score_hidden": false, "stickied": false, "created": 1492033162.0, "created_utc": 1492004362.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wsl5", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "NYCForThree", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You are describing EXACTLY the experience I had with my ex-wife.  It was actually kind of creepy reading that because some of the wording (rubick's cube, for one) was precisely what I used to use when describing our sex life.  \n\nI know exactly what you mean as far as how painful it is to hear that from your SO.  I also remember her telling me she felt used because I got so much more out of sex, even though sex for us revolved solely around her pleasure, as that was always the elusive variable.  \n\nObviously for us it didn't work out.  All I can say is that I feel your pain and know that it is ABSOLUTELY NOT your fault.  Do not allow guilt to enter into the equation.  I left that relationship thinking I was somehow inadequate, sexually, and I had zero confidence.  That lasted until I met my current GF, with whom I have the most fulfilling, mutually satisfying sex life I could possibly imagine.  \n\nI'm not saying that your only option is leaving the relationship--merely that you cannot blame yourself.  Losing my confidence and becoming emasculated by what felt like sexual failure is one of the most painful experiences I've ever had.  Keep your chin up.  Other people in this thread seem to have offered some good advice for how you and your wife might be able to solve your issues, but I encourage you to go in with confidence in yourself and what you have to offer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are describing EXACTLY the experience I had with my ex-wife.  It was actually kind of creepy reading that because some of the wording (rubick&amp;#39;s cube, for one) was precisely what I used to use when describing our sex life.  &lt;/p&gt;\n\n&lt;p&gt;I know exactly what you mean as far as how painful it is to hear that from your SO.  I also remember her telling me she felt used because I got so much more out of sex, even though sex for us revolved solely around her pleasure, as that was always the elusive variable.  &lt;/p&gt;\n\n&lt;p&gt;Obviously for us it didn&amp;#39;t work out.  All I can say is that I feel your pain and know that it is ABSOLUTELY NOT your fault.  Do not allow guilt to enter into the equation.  I left that relationship thinking I was somehow inadequate, sexually, and I had zero confidence.  That lasted until I met my current GF, with whom I have the most fulfilling, mutually satisfying sex life I could possibly imagine.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying that your only option is leaving the relationship--merely that you cannot blame yourself.  Losing my confidence and becoming emasculated by what felt like sexual failure is one of the most painful experiences I&amp;#39;ve ever had.  Keep your chin up.  Other people in this thread seem to have offered some good advice for how you and your wife might be able to solve your issues, but I encourage you to go in with confidence in yourself and what you have to offer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4wsl5", "score_hidden": false, "stickied": false, "created": 1491972987.0, "created_utc": 1491944187.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg602mz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NitchZ", "parent_id": "t1_dg4wd21", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'd say it's worth the read even if it doesn't end up helping. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d say it&amp;#39;s worth the read even if it doesn&amp;#39;t end up helping. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg602mz", "score_hidden": false, "stickied": false, "created": 1492038972.0, "created_utc": 1492010172.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wd21", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "punkvandam", "parent_id": "t1_dg4io3o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "May I ask how it would help? I seem to be experiencing the same problem as OP's wife, and I was wondering if this book could help me as well", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;May I ask how it would help? I seem to be experiencing the same problem as OP&amp;#39;s wife, and I was wondering if this book could help me as well&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4wd21", "score_hidden": false, "stickied": false, "created": 1491972492.0, "created_utc": 1491943692.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg525zm", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "muzz000", "parent_id": "t1_dg4io3o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "THIS!!!\n\nBoth you and your wife ought to read it. It's a fantastic combination of good science, real world application, and deep sensitivity. I wanted to comment only to recommend this book.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;THIS!!!&lt;/p&gt;\n\n&lt;p&gt;Both you and your wife ought to read it. It&amp;#39;s a fantastic combination of good science, real world application, and deep sensitivity. I wanted to comment only to recommend this book.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg525zm", "score_hidden": false, "stickied": false, "created": 1491979609.0, "created_utc": 1491950809.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4lnmj", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FaerieBelle", "parent_id": "t1_dg4io3o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is the book I was looking to recommend! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the book I was looking to recommend! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4lnmj", "score_hidden": false, "stickied": false, "created": 1491960820.0, "created_utc": 1491932020.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg55q5a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Persephoneve", "parent_id": "t1_dg4io3o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Honestly, any woman or anyone who has sex with women should read this book.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, any woman or anyone who has sex with women should read this book.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg55q5a", "score_hidden": false, "stickied": false, "created": 1491984398.0, "created_utc": 1491955598.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5btpk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CuriouslyATiger", "parent_id": "t1_dg4io3o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm finishing up this book now, it's some enlightening material.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m finishing up this book now, it&amp;#39;s some enlightening material.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5btpk", "score_hidden": false, "stickied": false, "created": 1491992419.0, "created_utc": 1491963619.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg50qtl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "I_drive_bus", "parent_id": "t1_dg4io3o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Its on Audible as well. Thanks for the advice, it'll give me something to listen to while I drive and maybe help me out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its on Audible as well. Thanks for the advice, it&amp;#39;ll give me something to listen to while I drive and maybe help me out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg50qtl", "score_hidden": false, "stickied": false, "created": 1491977789.0, "created_utc": 1491948989.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4io3o", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "CherriesAndPeaches", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She is definitely having a struggle within herself about sex. \n\nGet her the book Come As You are by Emily Nagoski. I think it would help a lot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She is definitely having a struggle within herself about sex. &lt;/p&gt;\n\n&lt;p&gt;Get her the book Come As You are by Emily Nagoski. I think it would help a lot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4io3o", "score_hidden": false, "stickied": false, "created": 1491957566.0, "created_utc": 1491928766.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg49kld", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "fooatbardotcom", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I read your story and relate, I'm in a similar quandry.  My SO has no interest in any what I would call traditional foreplay (oral, fingers,  making out, etc.)  In a sense she is a down to business gal, that needs A hard PIV.  Toys like a dildo and vibrator are viewed as solo masterbation items, and are not introduced in our time together.  Im recently experiencing softness and performance pressures that has been getting in my head, and we are both walking away with fustration.  My suggestion is to keep the conversation open in a non sexual setting.  Express how you feel, without any pressures on what you expect from her.  Back off from any suggestions, and rephrase with asking what concerns she has, and thoughts to move forward.  You are probrably correct in thinking she needs to start exploring herself more, but that idea needs to come from her not you.   Work on yourself, weight, exercise more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read your story and relate, I&amp;#39;m in a similar quandry.  My SO has no interest in any what I would call traditional foreplay (oral, fingers,  making out, etc.)  In a sense she is a down to business gal, that needs A hard PIV.  Toys like a dildo and vibrator are viewed as solo masterbation items, and are not introduced in our time together.  Im recently experiencing softness and performance pressures that has been getting in my head, and we are both walking away with fustration.  My suggestion is to keep the conversation open in a non sexual setting.  Express how you feel, without any pressures on what you expect from her.  Back off from any suggestions, and rephrase with asking what concerns she has, and thoughts to move forward.  You are probrably correct in thinking she needs to start exploring herself more, but that idea needs to come from her not you.   Work on yourself, weight, exercise more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg49kld", "score_hidden": false, "stickied": false, "created": 1491947050.0, "created_utc": 1491918250.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg57tr0", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "stopitma", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "As far as the feeling of inequality she's experiencing--are there any physical sensations she does enjoy a lot? Maybe backrubs or head scratches? It could maybe solve the feelings of her not getting anything if she has some cravings for physical intimacy met.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As far as the feeling of inequality she&amp;#39;s experiencing--are there any physical sensations she does enjoy a lot? Maybe backrubs or head scratches? It could maybe solve the feelings of her not getting anything if she has some cravings for physical intimacy met.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg57tr0", "score_hidden": false, "stickied": false, "created": 1491987174.0, "created_utc": 1491958374.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4eytm", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "marafin", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Has she never even orgasmed by herself? A lot of experimentation with different types of masturbation and using toys on herself should help with this, it with explicit focus on enjoyment rather than trying to achieve orgasm - you don't get them by hunting for them, and she's probably putting so much effort on trying that she's stressing herself out and missing it because she's tense and anxious. \n\nRegarding the shakes where she stops you, these can be misleading - in porn they might come before orgasm, but can verify from personal experience i get them when my clit is stimulated in a particularly painful way - too much pressure or too much direct stimulation and it causes literally spasms or pain and discomfort - if you see these try backing off a bit, being gentler and/or not touching the clit directly. 9 times out of ten they are pain, not pleasure - she's not just being a weird prude, you have to trust that she knows her body and what feels good for it better than you do! \n\nLastly, could you try talking to her about whether she'd like you to last longer? It could be easier to do this by text if she struggles with such discussion, as her if she'd find this easier because i know a lot of women do, it feels more comfortable because both embarrassment and conflict can be avoided from behind a screen, and she'll also be able to put more consideration into her words and find the right ones before she speaks. There are some people who just don't get off on oral, and PIV is better - suggest putting her on top and letting her completely control the movement, only stopping her if you feel like you're too close to hold it.... Some people just take a long time to build up, if your stamina isn't great then perhaps figuring out how to go for longer combined with positions that give her control is the key. Good luck!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Has she never even orgasmed by herself? A lot of experimentation with different types of masturbation and using toys on herself should help with this, it with explicit focus on enjoyment rather than trying to achieve orgasm - you don&amp;#39;t get them by hunting for them, and she&amp;#39;s probably putting so much effort on trying that she&amp;#39;s stressing herself out and missing it because she&amp;#39;s tense and anxious. &lt;/p&gt;\n\n&lt;p&gt;Regarding the shakes where she stops you, these can be misleading - in porn they might come before orgasm, but can verify from personal experience i get them when my clit is stimulated in a particularly painful way - too much pressure or too much direct stimulation and it causes literally spasms or pain and discomfort - if you see these try backing off a bit, being gentler and/or not touching the clit directly. 9 times out of ten they are pain, not pleasure - she&amp;#39;s not just being a weird prude, you have to trust that she knows her body and what feels good for it better than you do! &lt;/p&gt;\n\n&lt;p&gt;Lastly, could you try talking to her about whether she&amp;#39;d like you to last longer? It could be easier to do this by text if she struggles with such discussion, as her if she&amp;#39;d find this easier because i know a lot of women do, it feels more comfortable because both embarrassment and conflict can be avoided from behind a screen, and she&amp;#39;ll also be able to put more consideration into her words and find the right ones before she speaks. There are some people who just don&amp;#39;t get off on oral, and PIV is better - suggest putting her on top and letting her completely control the movement, only stopping her if you feel like you&amp;#39;re too close to hold it.... Some people just take a long time to build up, if your stamina isn&amp;#39;t great then perhaps figuring out how to go for longer combined with positions that give her control is the key. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4eytm", "score_hidden": false, "stickied": false, "created": 1491953492.0, "created_utc": 1491924692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4q7g1", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "reciprocatingocelot", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "When you say wand, do you mean a Hitachi magic wand?  I know it's known as the Rolls Royce of vibrators, but plenty of women can find it overpowered.  Have you thought of getting a more, pardon the expression, entry level vibe?  A rabbit, something like that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you say wand, do you mean a Hitachi magic wand?  I know it&amp;#39;s known as the Rolls Royce of vibrators, but plenty of women can find it overpowered.  Have you thought of getting a more, pardon the expression, entry level vibe?  A rabbit, something like that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4q7g1", "score_hidden": false, "stickied": false, "created": 1491965777.0, "created_utc": 1491936977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4dzdy", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "sexcrazyy", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You sound really caring OP. I think it's really cute of you to be like this. So no foreplay or masturbation for her...would she let you do dry humping? I know it sounds like highschool stuff, but many women can get off to it very easily. If she still won't do that...then I don't know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound really caring OP. I think it&amp;#39;s really cute of you to be like this. So no foreplay or masturbation for her...would she let you do dry humping? I know it sounds like highschool stuff, but many women can get off to it very easily. If she still won&amp;#39;t do that...then I don&amp;#39;t know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4dzdy", "score_hidden": false, "stickied": false, "created": 1491952403.0, "created_utc": 1491923603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4k3bx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "everclearandmild", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She has to work on letting go/relaxing. I suggest a sex therapist honestly, a female, someone she is really comfortable with, that can work with both of you. It sounds like you have been trying fairly hard but she can't seem to let her walls down and give you full control. If that's something she prefers maybe she can take the lead? Otherwise I think you guys should look into sex and or couples therapy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She has to work on letting go/relaxing. I suggest a sex therapist honestly, a female, someone she is really comfortable with, that can work with both of you. It sounds like you have been trying fairly hard but she can&amp;#39;t seem to let her walls down and give you full control. If that&amp;#39;s something she prefers maybe she can take the lead? Otherwise I think you guys should look into sex and or couples therapy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4k3bx", "score_hidden": false, "stickied": false, "created": 1491959108.0, "created_utc": 1491930308.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5a25o", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Bonbonnibles", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I haven't read the other comments, but the one great big thing that was missing from your breakdown was intimacy. Intimacy, and gentle exploration. Forget for a second about how many fingers you think you need to stick in her, and think about her as a person. What kind of movies does she like? How does she show you her love? What displays of love from you does she respond to that aren't sex related(for example, washing the dishes, taking her out to the movies, holding her hand in public, etc...)?\nIt sounds like the two of you need to find intimacy- or rather, she needs to find it and see it in you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t read the other comments, but the one great big thing that was missing from your breakdown was intimacy. Intimacy, and gentle exploration. Forget for a second about how many fingers you think you need to stick in her, and think about her as a person. What kind of movies does she like? How does she show you her love? What displays of love from you does she respond to that aren&amp;#39;t sex related(for example, washing the dishes, taking her out to the movies, holding her hand in public, etc...)?\nIt sounds like the two of you need to find intimacy- or rather, she needs to find it and see it in you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5a25o", "score_hidden": false, "stickied": false, "created": 1491990047.0, "created_utc": 1491961247.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5cu4o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "shelbecool", "parent_id": "t1_dg4h7yb", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is exactly what I was thinking. I didn't have an orgasm until i was 25 and it was because I had trauma relating to sex in my childhood that I didn't even remember till a few months before then. But working through it with my counselor and extensive work on my sexuality with myself and my body finally allowed it to happen. I can tell you its extremely frustrating to be in those shoes. Regardless of the cause I feel for both of you. I think it's fantastic how caring and willing to work things out you are. You clearly love her very much. I hope everything works out for you two and that you both can connect better and become satisfied and have the relationship you both desire. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is exactly what I was thinking. I didn&amp;#39;t have an orgasm until i was 25 and it was because I had trauma relating to sex in my childhood that I didn&amp;#39;t even remember till a few months before then. But working through it with my counselor and extensive work on my sexuality with myself and my body finally allowed it to happen. I can tell you its extremely frustrating to be in those shoes. Regardless of the cause I feel for both of you. I think it&amp;#39;s fantastic how caring and willing to work things out you are. You clearly love her very much. I hope everything works out for you two and that you both can connect better and become satisfied and have the relationship you both desire. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5cu4o", "score_hidden": false, "stickied": false, "created": 1491993822.0, "created_utc": 1491965022.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4h7yb", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "keepwalkingasshole", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I haven't read the comments but I'm very curious about her childhood, how sex was represented to her early on, and possible trauma/abuse. Just think there's a lot more mental stuff going on here than physical. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t read the comments but I&amp;#39;m very curious about her childhood, how sex was represented to her early on, and possible trauma/abuse. Just think there&amp;#39;s a lot more mental stuff going on here than physical. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4h7yb", "score_hidden": false, "stickied": false, "created": 1491955984.0, "created_utc": 1491927184.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg525qg", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "jazmalinda", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I can't speak for all women, but personally I had to learn how to orgasm. For years I'd try to on my own, but would stop at the 'shaky' stage because it felt weird and uncomfortable, I actually got upset and thought there might be something physically wrong with me.\n\nThere's a fine line between pleasure and pain, and for a lot of women direct contact on the clit can be painful, which makes her nervous, which makes her stop, so she doesn't orgasm, and the cycle continues!\n\nShe needs to learn how to do it, to relax and let it happen. For me I found massaging the area below the clit slowly and for a long time worked. This is something you can try with her, but also something she should practise alone.\n\nI know a lot of women swear by oral but for me I never found it as good as fingers, not to mention it's the worst if you're nervous because having someone between your legs makes you feel very vulnerable and self-conscious. When using fingers you can stay at eye level and kiss etc.\n\nWands are very useful as they can focus on any area and can be set at very low speeds/light vibrations. Personally I find the Hitachi too aggressive. I have a Lelo SmartWand, they are expensive but worth the money. \n\nRemember, 90% of the problem for her is psychological, only 10% is physical. But you can only do so much, if she doesn't want to talk about it, or try anything, then there's not a lot you can do. She may have an unhealthy relationship with sex - perhaps she was raised thinking it was sinful? I'm not sure, but guilt is the biggest mood killer of them all.", "edited": 1491951637.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t speak for all women, but personally I had to learn how to orgasm. For years I&amp;#39;d try to on my own, but would stop at the &amp;#39;shaky&amp;#39; stage because it felt weird and uncomfortable, I actually got upset and thought there might be something physically wrong with me.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a fine line between pleasure and pain, and for a lot of women direct contact on the clit can be painful, which makes her nervous, which makes her stop, so she doesn&amp;#39;t orgasm, and the cycle continues!&lt;/p&gt;\n\n&lt;p&gt;She needs to learn how to do it, to relax and let it happen. For me I found massaging the area below the clit slowly and for a long time worked. This is something you can try with her, but also something she should practise alone.&lt;/p&gt;\n\n&lt;p&gt;I know a lot of women swear by oral but for me I never found it as good as fingers, not to mention it&amp;#39;s the worst if you&amp;#39;re nervous because having someone between your legs makes you feel very vulnerable and self-conscious. When using fingers you can stay at eye level and kiss etc.&lt;/p&gt;\n\n&lt;p&gt;Wands are very useful as they can focus on any area and can be set at very low speeds/light vibrations. Personally I find the Hitachi too aggressive. I have a Lelo SmartWand, they are expensive but worth the money. &lt;/p&gt;\n\n&lt;p&gt;Remember, 90% of the problem for her is psychological, only 10% is physical. But you can only do so much, if she doesn&amp;#39;t want to talk about it, or try anything, then there&amp;#39;s not a lot you can do. She may have an unhealthy relationship with sex - perhaps she was raised thinking it was sinful? I&amp;#39;m not sure, but guilt is the biggest mood killer of them all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg525qg", "score_hidden": false, "stickied": false, "created": 1491979599.0, "created_utc": 1491950799.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4lulx", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "New1new1", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I feel sorry for you, but I can somewhat emphasize with your wife. I too have never came during sex with a partner, and I definitely do get upset sometimes about how it's not fair and how guys always get something and I get \"nothing\". However, this upset feeling is not aimed at my partners, it's just a general \"being hurt with how things are\", and I believe it's the same with your wife, so don't take it that personally.\n\nI think part of the problem is that she didn't get to experience things with more people prior you. If I had ended up with my firts guy, I would have no idea what a guy could POSSIBLY  do to make sex good for me; now, even though I don't come, I kind of know what I enjoy, or at least what other things a guy could do. In her case, she's like a blind person trying to describe colors. I really have no idea what to suggest here though.\n\n\nBtw, why does it take you 5 mins just to get to her clit when performing oral? My bf goes straight to the clit, and he's great at it imo lol. \n\nAlso, the other poster who went on about control issues, I have no idea how in the world that could be related. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel sorry for you, but I can somewhat emphasize with your wife. I too have never came during sex with a partner, and I definitely do get upset sometimes about how it&amp;#39;s not fair and how guys always get something and I get &amp;quot;nothing&amp;quot;. However, this upset feeling is not aimed at my partners, it&amp;#39;s just a general &amp;quot;being hurt with how things are&amp;quot;, and I believe it&amp;#39;s the same with your wife, so don&amp;#39;t take it that personally.&lt;/p&gt;\n\n&lt;p&gt;I think part of the problem is that she didn&amp;#39;t get to experience things with more people prior you. If I had ended up with my firts guy, I would have no idea what a guy could POSSIBLY  do to make sex good for me; now, even though I don&amp;#39;t come, I kind of know what I enjoy, or at least what other things a guy could do. In her case, she&amp;#39;s like a blind person trying to describe colors. I really have no idea what to suggest here though.&lt;/p&gt;\n\n&lt;p&gt;Btw, why does it take you 5 mins just to get to her clit when performing oral? My bf goes straight to the clit, and he&amp;#39;s great at it imo lol. &lt;/p&gt;\n\n&lt;p&gt;Also, the other poster who went on about control issues, I have no idea how in the world that could be related. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4lulx", "score_hidden": false, "stickied": false, "created": 1491961031.0, "created_utc": 1491932231.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4t5nd", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "love2430", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Hi! I'm still in college and not married, but my boyfriend and I had some similar issues when we started having sex about a year and a half ago. I've noticed some people mention that your wife could have a hard time letting go/relaxing/relinquishing control. That definitely may be part of it. \n\nFor me, part of the problem with him enjoying it and me not as much was that it felt confusing to see someone I love get off while I wasn't feeling pleasured. For us, what helped the most was lots of open communication and only having sex when I was really into it or turned on and stopping it if I wasn't. That way, I was only associating sex with positivity, rather than negativity. I hope that helps and that you guys figure this out together!! Good luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I&amp;#39;m still in college and not married, but my boyfriend and I had some similar issues when we started having sex about a year and a half ago. I&amp;#39;ve noticed some people mention that your wife could have a hard time letting go/relaxing/relinquishing control. That definitely may be part of it. &lt;/p&gt;\n\n&lt;p&gt;For me, part of the problem with him enjoying it and me not as much was that it felt confusing to see someone I love get off while I wasn&amp;#39;t feeling pleasured. For us, what helped the most was lots of open communication and only having sex when I was really into it or turned on and stopping it if I wasn&amp;#39;t. That way, I was only associating sex with positivity, rather than negativity. I hope that helps and that you guys figure this out together!! Good luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4t5nd", "score_hidden": false, "stickied": false, "created": 1491968928.0, "created_utc": 1491940128.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5vmk1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dogzillas_Mom", "parent_id": "t1_dg50xt3", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Added to my wish list! Thanks! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Added to my wish list! Thanks! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5vmk1", "score_hidden": false, "stickied": false, "created": 1492033695.0, "created_utc": 1492004895.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50xt3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "belle_bs", "parent_id": "t1_dg4ws8g", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This ^.\n\nDarrel Ray - Sex and God: How Religion Distorts Sexuality\nhttps://www.amazon.com/gp/product/B0073WNSV6/ref=dp-kindle-redirect?ie=UTF8&amp;btkr=1\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This &lt;sup&gt;.&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;Darrel Ray - Sex and God: How Religion Distorts Sexuality\n&lt;a href=\"https://www.amazon.com/gp/product/B0073WNSV6/ref=dp-kindle-redirect?ie=UTF8&amp;amp;btkr=1\"&gt;https://www.amazon.com/gp/product/B0073WNSV6/ref=dp-kindle-redirect?ie=UTF8&amp;amp;btkr=1&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg50xt3", "score_hidden": false, "stickied": false, "created": 1491978036.0, "created_utc": 1491949236.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ws8g", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Dogzillas_Mom", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "What kind of religious programming, I mean, what religion was she raised in? Was she taught at a young age that sex is bad, dirty and dangerous and that if she did it, no good decent, kind man would ever want her? \n\nBecause religious abuse can mess people's sexuality up big time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kind of religious programming, I mean, what religion was she raised in? Was she taught at a young age that sex is bad, dirty and dangerous and that if she did it, no good decent, kind man would ever want her? &lt;/p&gt;\n\n&lt;p&gt;Because religious abuse can mess people&amp;#39;s sexuality up big time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4ws8g", "score_hidden": false, "stickied": false, "created": 1491972975.0, "created_utc": 1491944175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4rdw0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AmeliaAmalia", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I haven't read any comments yet so I'm sure this has been suggested, but I think she desperately needs therapy. You both do, couples and individual therapy. She has some major obstacles to tackle that Reddit cannot begin to address, and you've just had your wife tell you that she's completely unsatisfied/unfulfilled/unhappy with your sex life and feels \"used\".\n\nI'm sorry that you're both going through this, and I hope you can overcome it. She needs help learning to open up and you need to talk to someone about how hurtful this experience has been for you. It hasn't been fair to you at all, but there are obviously much more complicated issues happening with your wife that go further than she doesn't enjoy oral sex.\n\nGood luck, OP. I sincerely hope you two can figure this out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t read any comments yet so I&amp;#39;m sure this has been suggested, but I think she desperately needs therapy. You both do, couples and individual therapy. She has some major obstacles to tackle that Reddit cannot begin to address, and you&amp;#39;ve just had your wife tell you that she&amp;#39;s completely unsatisfied/unfulfilled/unhappy with your sex life and feels &amp;quot;used&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry that you&amp;#39;re both going through this, and I hope you can overcome it. She needs help learning to open up and you need to talk to someone about how hurtful this experience has been for you. It hasn&amp;#39;t been fair to you at all, but there are obviously much more complicated issues happening with your wife that go further than she doesn&amp;#39;t enjoy oral sex.&lt;/p&gt;\n\n&lt;p&gt;Good luck, OP. I sincerely hope you two can figure this out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4rdw0", "score_hidden": false, "stickied": false, "created": 1491967018.0, "created_utc": 1491938218.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5eir8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Doug_Step", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Another thing that I haven't seen mentioned is medication, some medication can screw with sex in many ways, might be worth researching any medication she takes, often you can change brands or types to change these symptoms", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another thing that I haven&amp;#39;t seen mentioned is medication, some medication can screw with sex in many ways, might be worth researching any medication she takes, often you can change brands or types to change these symptoms&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5eir8", "score_hidden": false, "stickied": false, "created": 1491996239.0, "created_utc": 1491967439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4945g", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "OrangeVette", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Let me guess, aside from the screaming and crying, this is all news to you? In my opinion, your wife has some issues accepting her own sexuality. Religion, repression, whatever it is, you seem like a dude who is willing to try whatever makes her happy. She seems like she can't handle her own sexuality. Get both of you to a therapist to talk this shit out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let me guess, aside from the screaming and crying, this is all news to you? In my opinion, your wife has some issues accepting her own sexuality. Religion, repression, whatever it is, you seem like a dude who is willing to try whatever makes her happy. She seems like she can&amp;#39;t handle her own sexuality. Get both of you to a therapist to talk this shit out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4945g", "score_hidden": false, "stickied": false, "created": 1491946434.0, "created_utc": 1491917634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4jxnz", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Tigris474", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Okay so the wand is the only way I can orgasm. And I can only do it when I'm completely alone. And I've recently found an appreciation for Bad-Dragon insertable toys that I use during my wand time. \n\nI used to feel exactly the same way your wife does. It took a lot of self exploration while COMPLETELY ALONE that got me to this point. \n\nNow I have tons of kinky crazy sex with a bunch of partners. But like I said. It took a bit to get to this point. \n\nGood luck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay so the wand is the only way I can orgasm. And I can only do it when I&amp;#39;m completely alone. And I&amp;#39;ve recently found an appreciation for Bad-Dragon insertable toys that I use during my wand time. &lt;/p&gt;\n\n&lt;p&gt;I used to feel exactly the same way your wife does. It took a lot of self exploration while COMPLETELY ALONE that got me to this point. &lt;/p&gt;\n\n&lt;p&gt;Now I have tons of kinky crazy sex with a bunch of partners. But like I said. It took a bit to get to this point. &lt;/p&gt;\n\n&lt;p&gt;Good luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4jxnz", "score_hidden": false, "stickied": false, "created": 1491958933.0, "created_utc": 1491930133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4mc3f", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "tfresca", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Did she grow up religious? Good girls can't do or enjoy dirty things. This fucks up lots of people. Sex friendly couples therapy STAT. Don't bother with sex till this is sorted. Worst case scenario now is a baby.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did she grow up religious? Good girls can&amp;#39;t do or enjoy dirty things. This fucks up lots of people. Sex friendly couples therapy STAT. Don&amp;#39;t bother with sex till this is sorted. Worst case scenario now is a baby.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4mc3f", "score_hidden": false, "stickied": false, "created": 1491961562.0, "created_utc": 1491932762.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4phsq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "sazzer82", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I used to be like this. It's all mental. She needs to learn her own body and masturbate and make herself orgasm before anyone else can. She sounds really young and inexperienced, it will come with time. See a sex therapist too.  \n\nEdit: I used to feel guilty if I didn't orgasm from PIV, like using a vibrator....I felt it was cheating on \"real sex\" \n\nTry masturbating next to each other. Smoke some pot. Find some classy porn made for women (Andrew Blake comes to mind)", "edited": 1491936779.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to be like this. It&amp;#39;s all mental. She needs to learn her own body and masturbate and make herself orgasm before anyone else can. She sounds really young and inexperienced, it will come with time. See a sex therapist too.  &lt;/p&gt;\n\n&lt;p&gt;Edit: I used to feel guilty if I didn&amp;#39;t orgasm from PIV, like using a vibrator....I felt it was cheating on &amp;quot;real sex&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Try masturbating next to each other. Smoke some pot. Find some classy porn made for women (Andrew Blake comes to mind)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4phsq", "score_hidden": false, "stickied": false, "created": 1491965032.0, "created_utc": 1491936232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4lgo9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FaerieBelle", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I know there is a book that Dan Savage often recommends, I am googling to find it but my Google-Fu is failing me. It is basically for women to get to know their bodies, and learn to orgasm. \n\nI am basically going to parrot advice I have from the Savage Lovecast.  Don't have sex for you to get off. Have sex for her to get off. If she pulls the plug, that's it, you're done. Even if you haven't gotten off. This needs to be for HER, not for YOU.  You sound like you are doing everything right in terms of how you are reacting and handling the situation when it comes up. \n\nTry giving her complete control - she might like to be the dominant one, and tie you up. Perhaps start by asking her to tie you up, and indicate that you might like it?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know there is a book that Dan Savage often recommends, I am googling to find it but my Google-Fu is failing me. It is basically for women to get to know their bodies, and learn to orgasm. &lt;/p&gt;\n\n&lt;p&gt;I am basically going to parrot advice I have from the Savage Lovecast.  Don&amp;#39;t have sex for you to get off. Have sex for her to get off. If she pulls the plug, that&amp;#39;s it, you&amp;#39;re done. Even if you haven&amp;#39;t gotten off. This needs to be for HER, not for YOU.  You sound like you are doing everything right in terms of how you are reacting and handling the situation when it comes up. &lt;/p&gt;\n\n&lt;p&gt;Try giving her complete control - she might like to be the dominant one, and tie you up. Perhaps start by asking her to tie you up, and indicate that you might like it?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4lgo9", "score_hidden": false, "stickied": false, "created": 1491960612.0, "created_utc": 1491931812.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dgazmpz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lunarlon", "parent_id": "t1_dgaystb", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "No prob pal. All the best", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No prob pal. All the best&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgazmpz", "score_hidden": false, "stickied": false, "created": 1492310092.0, "created_utc": 1492281292.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaystb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iThrown", "parent_id": "t1_dg4wwje", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I want you to know that this comment made my day when you posted it. Thank you I appreciate it. It's been a rough week or so", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want you to know that this comment made my day when you posted it. Thank you I appreciate it. It&amp;#39;s been a rough week or so&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgaystb", "score_hidden": false, "stickied": false, "created": 1492308932.0, "created_utc": 1492280132.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wwje", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lunarlon", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Hey OP I can't help but you're a great writer and sound like a cool person. Hope you manage to sort this out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey OP I can&amp;#39;t help but you&amp;#39;re a great writer and sound like a cool person. Hope you manage to sort this out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4wwje", "score_hidden": false, "stickied": false, "created": 1491973114.0, "created_utc": 1491944314.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg72qlo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DrinkVictoryGin", "parent_id": "t1_dg6zksb", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I went off my birth control. Unfortunately, I waited way too long to realize that it had been causing the problem. I built up such a resentment against my then-husband for using me like a meat-puppet (how I felt) that I basically had ptsd about sex with him.\n\nDivorced.\n\nBetter now. But at GREAT personal emotional professional and financial cost. But orgasms. So, yay I guess...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went off my birth control. Unfortunately, I waited way too long to realize that it had been causing the problem. I built up such a resentment against my then-husband for using me like a meat-puppet (how I felt) that I basically had ptsd about sex with him.&lt;/p&gt;\n\n&lt;p&gt;Divorced.&lt;/p&gt;\n\n&lt;p&gt;Better now. But at GREAT personal emotional professional and financial cost. But orgasms. So, yay I guess...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg72qlo", "score_hidden": false, "stickied": false, "created": 1492082882.0, "created_utc": 1492054082.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6zksb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ThrowawayUnique1", "parent_id": "t1_dg53ztv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "How did you fix it? I'm like his wife and I don't know why! I just can't get myself to let go. My mind keeps blocking me from enjoying the moment", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How did you fix it? I&amp;#39;m like his wife and I don&amp;#39;t know why! I just can&amp;#39;t get myself to let go. My mind keeps blocking me from enjoying the moment&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6zksb", "score_hidden": false, "stickied": false, "created": 1492078720.0, "created_utc": 1492049920.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg53ztv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DrinkVictoryGin", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I used to be just like your wife. It actually ruined my marriage.\n\nIs she on hormonal birth control?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to be just like your wife. It actually ruined my marriage.&lt;/p&gt;\n\n&lt;p&gt;Is she on hormonal birth control?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg53ztv", "score_hidden": false, "stickied": false, "created": 1491982061.0, "created_utc": 1491953261.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5d7df", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Bovinursus", "parent_id": "t1_dg55l5l", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm asexual and I was thinking this too.\n\n&gt; She also said she feels something is wrong with her which is why she's the way she is.\n\nI thought something was wrong with me for a long time. I saw doctors, gynecologists, sex therapists, you name it. They all told me I was fine.\n\nBy all means try the things other commentors are saying because of course they might work. But maybe keep in mind that theres a chance she will never enjoy or want sex.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m asexual and I was thinking this too.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She also said she feels something is wrong with her which is why she&amp;#39;s the way she is.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I thought something was wrong with me for a long time. I saw doctors, gynecologists, sex therapists, you name it. They all told me I was fine.&lt;/p&gt;\n\n&lt;p&gt;By all means try the things other commentors are saying because of course they might work. But maybe keep in mind that theres a chance she will never enjoy or want sex.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5d7df", "score_hidden": false, "stickied": false, "created": 1491994335.0, "created_utc": 1491965535.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg55l5l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "uttplug", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sounds like she might be asexual ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like she might be asexual &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg55l5l", "score_hidden": false, "stickied": false, "created": 1491984220.0, "created_utc": 1491955420.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5b7dg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Risikabel", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Is she on birth control or any hormones? I only ask because I act like this frequently and I've found it's only when I'm taking hormones. \n\nI can't stand receiving oral or being fingered. Orgasming is really difficult even with a great vibrator. The orgasms I do have are almost painful and I push my partner away from me when I'm cumming (I can't get off from penetration alone, either). It's not that I don't want to \"finish\" it, it just literally gets too intense.\n\nYet, sex is really great and fulfilling when it's natural (in my case). I have only *ever* enjoyed sex when I'm not on the pill.\n\nSo I'd talk to her and rule out anything physical before jumping right into into self-diagnosing her with a purely mental issue. There could be a physical component to it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is she on birth control or any hormones? I only ask because I act like this frequently and I&amp;#39;ve found it&amp;#39;s only when I&amp;#39;m taking hormones. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t stand receiving oral or being fingered. Orgasming is really difficult even with a great vibrator. The orgasms I do have are almost painful and I push my partner away from me when I&amp;#39;m cumming (I can&amp;#39;t get off from penetration alone, either). It&amp;#39;s not that I don&amp;#39;t want to &amp;quot;finish&amp;quot; it, it just literally gets too intense.&lt;/p&gt;\n\n&lt;p&gt;Yet, sex is really great and fulfilling when it&amp;#39;s natural (in my case). I have only &lt;em&gt;ever&lt;/em&gt; enjoyed sex when I&amp;#39;m not on the pill.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;d talk to her and rule out anything physical before jumping right into into self-diagnosing her with a purely mental issue. There could be a physical component to it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5b7dg", "score_hidden": false, "stickied": false, "created": 1491991572.0, "created_utc": 1491962772.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5ddwf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "nicqui", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't like oral or being fingered very much. My husband and I start sex with penetration and I use a small vibrator until I climax (then proceed with PIV sex until he climaxes). I'd recommend you try that with your wife.\n\nIf she hasn't ever had an orgasm on her own, she needs to start there. I'd suggest (her alone) watching porn she finds appealing, while using a vibrator or her fingers.", "edited": 1491966024.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t like oral or being fingered very much. My husband and I start sex with penetration and I use a small vibrator until I climax (then proceed with PIV sex until he climaxes). I&amp;#39;d recommend you try that with your wife.&lt;/p&gt;\n\n&lt;p&gt;If she hasn&amp;#39;t ever had an orgasm on her own, she needs to start there. I&amp;#39;d suggest (her alone) watching porn she finds appealing, while using a vibrator or her fingers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5ddwf", "score_hidden": false, "stickied": false, "created": 1491994587.0, "created_utc": 1491965787.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5ichl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Applesauce136", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "i didnt see anyone else mention this, so give a moment to the thought that your wife may be either a lesbian or asexual who hasn't figured out herself yet; if she's either of those, that would go a long way towards explaining what's up\n\nof course, i dont know your wife and im not saying she is --- just thought it was a possibility worth mentioning ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i didnt see anyone else mention this, so give a moment to the thought that your wife may be either a lesbian or asexual who hasn&amp;#39;t figured out herself yet; if she&amp;#39;s either of those, that would go a long way towards explaining what&amp;#39;s up&lt;/p&gt;\n\n&lt;p&gt;of course, i dont know your wife and im not saying she is --- just thought it was a possibility worth mentioning &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5ichl", "score_hidden": false, "stickied": false, "created": 1492002765.0, "created_utc": 1491973965.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg8i0q8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ABC_AlwaysBeCovert", "parent_id": "t1_dg7imtw", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You should be!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should be!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8i0q8", "score_hidden": false, "stickied": false, "created": 1492159278.0, "created_utc": 1492130478.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7imtw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ZealousVisionary", "parent_id": "t1_dg7ghe1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Lol. I'm so glad my wife who is from a religious background and is religious has absolutely no hangups. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lol. I&amp;#39;m so glad my wife who is from a religious background and is religious has absolutely no hangups. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7imtw", "score_hidden": false, "stickied": false, "created": 1492117904.0, "created_utc": 1492089104.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ghe1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ABC_AlwaysBeCovert", "parent_id": "t1_dg5iqjm", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "yeah, catholic reporting in, saw that one a mile away, have also dated a catholic woman who burst out crying as I was doing her doggystyle and lifted up a leg for leverage because it was \"too animalistic.\" We eat, drink, sleep, and shit like animals, god forbid we fuck like them too, I guess? 😂 ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah, catholic reporting in, saw that one a mile away, have also dated a catholic woman who burst out crying as I was doing her doggystyle and lifted up a leg for leverage because it was &amp;quot;too animalistic.&amp;quot; We eat, drink, sleep, and shit like animals, god forbid we fuck like them too, I guess? 😂 &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7ghe1", "score_hidden": false, "stickied": false, "created": 1492114438.0, "created_utc": 1492085638.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5iqjm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ZealousVisionary", "parent_id": "t1_dg5ik85", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sadly this is true and some psychological barriers need to be overcome. \n\nEdit: true that some religious background women can have serious sexual hang ups. I'm sure there are resources and people who can help with this situation even from a religious perspective. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sadly this is true and some psychological barriers need to be overcome. &lt;/p&gt;\n\n&lt;p&gt;Edit: true that some religious background women can have serious sexual hang ups. I&amp;#39;m sure there are resources and people who can help with this situation even from a religious perspective. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5iqjm", "score_hidden": false, "stickied": false, "created": 1492003519.0, "created_utc": 1491974719.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ik85", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ABC_AlwaysBeCovert", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Religious woman or from a very religious family? Because that'll create problems like this", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Religious woman or from a very religious family? Because that&amp;#39;ll create problems like this&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5ik85", "score_hidden": false, "stickied": false, "created": 1492003178.0, "created_utc": 1491974378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5p43q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pulp_Ficti0n", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is why you don't marry virgins, kids.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why you don&amp;#39;t marry virgins, kids.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5p43q", "score_hidden": false, "stickied": false, "created": 1492021052.0, "created_utc": 1491992252.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5tc4t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mighty72", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;She has never had an orgasm.\n\n&gt;She also does not masturbade at all.\n\nThe bottom one is the reason the top one never happens. She doesn't know how she works, how are you supposed to know?\n\n&gt;Saying stuff like she doesn't get from sex what I do and every time we have sex and she doesn't enjoy it she feels like she's being used.\n\nOf course she feels like this, she never gets to come. She don't even know what an orgasm is and she sees you having a great time everytime. Of course she's frustrated.\n\nBottom line is that she needs some therapy and maybe see a gyno and someone to talk sex with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She has never had an orgasm.&lt;/p&gt;\n\n&lt;p&gt;She also does not masturbade at all.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The bottom one is the reason the top one never happens. She doesn&amp;#39;t know how she works, how are you supposed to know?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Saying stuff like she doesn&amp;#39;t get from sex what I do and every time we have sex and she doesn&amp;#39;t enjoy it she feels like she&amp;#39;s being used.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Of course she feels like this, she never gets to come. She don&amp;#39;t even know what an orgasm is and she sees you having a great time everytime. Of course she&amp;#39;s frustrated.&lt;/p&gt;\n\n&lt;p&gt;Bottom line is that she needs some therapy and maybe see a gyno and someone to talk sex with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5tc4t", "score_hidden": false, "stickied": false, "created": 1492030352.0, "created_utc": 1492001552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5vezl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zepelino", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; She also said she feels something is wrong with her which is why she's the way she is. \n\nYes. She have a huge communication problem, and it's wrong as hell. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She also said she feels something is wrong with her which is why she&amp;#39;s the way she is. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes. She have a huge communication problem, and it&amp;#39;s wrong as hell. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5vezl", "score_hidden": false, "stickied": false, "created": 1492033410.0, "created_utc": 1492004610.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg70hpx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sassy_malassy", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sounds like me when I thought I was straight. I'm not saying your wife is a lesbian or asexual, but it's a possibility, especially since she probably hasn't asked herself those tough questions before.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like me when I thought I was straight. I&amp;#39;m not saying your wife is a lesbian or asexual, but it&amp;#39;s a possibility, especially since she probably hasn&amp;#39;t asked herself those tough questions before.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg70hpx", "score_hidden": false, "stickied": false, "created": 1492079863.0, "created_utc": 1492051063.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5ajup", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fuckitx", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": " Why did you do oral for 5 minutes without even going to the clit? That's probably why she told you to stop", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why did you do oral for 5 minutes without even going to the clit? That&amp;#39;s probably why she told you to stop&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5ajup", "score_hidden": false, "stickied": false, "created": 1491990707.0, "created_utc": 1491961907.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5dh9n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "57dimensions", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "After reading I honestly expected this to be a top comment, but surprisingly it wasn't. Are you/is she sure she isn't just asexual? Like some people just don't like sex, or get anything from it, or desire it. If she is--which can be difficult to determine in a black or white way anyways--then there might not be anything about her to fix, she might just not like sex. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After reading I honestly expected this to be a top comment, but surprisingly it wasn&amp;#39;t. Are you/is she sure she isn&amp;#39;t just asexual? Like some people just don&amp;#39;t like sex, or get anything from it, or desire it. If she is--which can be difficult to determine in a black or white way anyways--then there might not be anything about her to fix, she might just not like sex. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5dh9n", "score_hidden": false, "stickied": false, "created": 1491994718.0, "created_utc": 1491965918.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4cuje", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "more_than_a_feelin", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Can you get a vibrating cock ring and have her in top? My husband recently bought one and aggoddam I love it! I'm afraid if being desensitized though so we rarely use it. We usually will get it out if we wanna hurry up and have more lazy quicker sex...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you get a vibrating cock ring and have her in top? My husband recently bought one and aggoddam I love it! I&amp;#39;m afraid if being desensitized though so we rarely use it. We usually will get it out if we wanna hurry up and have more lazy quicker sex...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4cuje", "score_hidden": false, "stickied": false, "created": 1491951110.0, "created_utc": 1491922310.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg75d5e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "redbabypanda", "parent_id": "t1_dg50rb6", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't get why this is down voted you're totally right. She has to realize it's not all on op to fix this and she has to explore herself! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t get why this is down voted you&amp;#39;re totally right. She has to realize it&amp;#39;s not all on op to fix this and she has to explore herself! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg75d5e", "score_hidden": false, "stickied": false, "created": 1492086860.0, "created_utc": 1492058060.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50rb6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "belle_bs", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "\"She also said she feels something is wrong with her which is why she's the way she is.\" Yes, there is something wrong with her and she has the power to do something about it. She needs to read, and think and listen. She needs to go deep into herself and talk to all of the fear. She may need outside help to do that: sex therapist. She needs to understand that in this culture many women (actually many men too) are uncomfortable and even distraught about sex. Now that she has admitted there is a problem, she can DO something about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;She also said she feels something is wrong with her which is why she&amp;#39;s the way she is.&amp;quot; Yes, there is something wrong with her and she has the power to do something about it. She needs to read, and think and listen. She needs to go deep into herself and talk to all of the fear. She may need outside help to do that: sex therapist. She needs to understand that in this culture many women (actually many men too) are uncomfortable and even distraught about sex. Now that she has admitted there is a problem, she can DO something about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg50rb6", "score_hidden": false, "stickied": false, "created": 1491977806.0, "created_utc": 1491949006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4p1pm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "hunting2fish", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "it must be frustrating to be dedicating yourself to trying to please her and yet she still feels as if you're using her. fuck that noise. would destroy my libido. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it must be frustrating to be dedicating yourself to trying to please her and yet she still feels as if you&amp;#39;re using her. fuck that noise. would destroy my libido. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4p1pm", "score_hidden": false, "stickied": false, "created": 1491964546.0, "created_utc": 1491935746.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4ogdu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Parttimebuster", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "The only thing I can think to add is that, I have had this issue in the past more or less. \n\nI think an important thing to try or remember is that a marrage or relationship isn't based entirely on sex. Think of it like this, would you love your wife even if she was disabled, or in a coma, or debilitated? If the answer is yes then when she is ready for sex, she will know where to find you. \n\nThis doesn't really help everything. But if she is fine with your habits, such as porn and masturbation, then be okay with that. But I would recommend, for your sake and hers to hold off as much as possible til you do any sextual activity. \n\nTo be honest I had to reprogram myself, I was a cronic masturbater myself. I was more apt to take care of then sex at one point. I mean foreplay was fine, but no one was better at pleasing myself then myself. I eventually stopped cols turkey and held off for about a month. It was a big feat for me, and when I did have sex it felt 100x better then the first time. If you wife abstains, and you do with her... when she finally \"needs\" you. You can enjoy that feeling together. If she only has sex for you, with you, and feels like its an obligation - then let her make the terms. \n\nI don't know if any of this is helpful, but I do think that you have to have her buy in to sex. If she doesnt enjoy it you cant make her like it. If you love your wife... love your wife, faults included. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only thing I can think to add is that, I have had this issue in the past more or less. &lt;/p&gt;\n\n&lt;p&gt;I think an important thing to try or remember is that a marrage or relationship isn&amp;#39;t based entirely on sex. Think of it like this, would you love your wife even if she was disabled, or in a coma, or debilitated? If the answer is yes then when she is ready for sex, she will know where to find you. &lt;/p&gt;\n\n&lt;p&gt;This doesn&amp;#39;t really help everything. But if she is fine with your habits, such as porn and masturbation, then be okay with that. But I would recommend, for your sake and hers to hold off as much as possible til you do any sextual activity. &lt;/p&gt;\n\n&lt;p&gt;To be honest I had to reprogram myself, I was a cronic masturbater myself. I was more apt to take care of then sex at one point. I mean foreplay was fine, but no one was better at pleasing myself then myself. I eventually stopped cols turkey and held off for about a month. It was a big feat for me, and when I did have sex it felt 100x better then the first time. If you wife abstains, and you do with her... when she finally &amp;quot;needs&amp;quot; you. You can enjoy that feeling together. If she only has sex for you, with you, and feels like its an obligation - then let her make the terms. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if any of this is helpful, but I do think that you have to have her buy in to sex. If she doesnt enjoy it you cant make her like it. If you love your wife... love your wife, faults included. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4ogdu", "score_hidden": false, "stickied": false, "created": 1491963898.0, "created_utc": 1491935098.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4q7t1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Siraphine", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't know why she's like this, but I just want you to know that none of this is your fault and you - from what you've shown - have done nothing wrong.  You've been very accommodating and it's really nice that you care enough to look into this.  She has a very unhealthy relationship with sex.  Were her parents religious? I usually only see this kind of thing from sexual assault victims and religious folks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know why she&amp;#39;s like this, but I just want you to know that none of this is your fault and you - from what you&amp;#39;ve shown - have done nothing wrong.  You&amp;#39;ve been very accommodating and it&amp;#39;s really nice that you care enough to look into this.  She has a very unhealthy relationship with sex.  Were her parents religious? I usually only see this kind of thing from sexual assault victims and religious folks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4q7t1", "score_hidden": false, "stickied": false, "created": 1491965787.0, "created_utc": 1491936987.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4rgaq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LoneWolfBlood", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I mean, from personal experience, the only way to solve the problem is to know what the problem is, and that's very dependent on her opening up and what you know. You don't know if it's mental or physical, stemmed in the past or present, or what part of the past, upbringing, self-view, and such. It could be that the amount of stimulation is overwhelming, maybe she's ashamed of how many things are required (and still don't work), maybe she's afraid of losing control, maybe it's more complicated and deeper than that. I'd recommend the book \"The Gift of Sex\" to help. It does have some religious belief content included, but if you can get past that, it is an excellent guide to improvement with practical suggestions, scientific backing, and in-depth considerations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, from personal experience, the only way to solve the problem is to know what the problem is, and that&amp;#39;s very dependent on her opening up and what you know. You don&amp;#39;t know if it&amp;#39;s mental or physical, stemmed in the past or present, or what part of the past, upbringing, self-view, and such. It could be that the amount of stimulation is overwhelming, maybe she&amp;#39;s ashamed of how many things are required (and still don&amp;#39;t work), maybe she&amp;#39;s afraid of losing control, maybe it&amp;#39;s more complicated and deeper than that. I&amp;#39;d recommend the book &amp;quot;The Gift of Sex&amp;quot; to help. It does have some religious belief content included, but if you can get past that, it is an excellent guide to improvement with practical suggestions, scientific backing, and in-depth considerations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4rgaq", "score_hidden": false, "stickied": false, "created": 1491967093.0, "created_utc": 1491938293.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4sm5t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DaenerysTargaryen3", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't have much advice other than stating you're a wonderfully supporting husband. I can see your trying really hard to make her happy and comfortable and not all about you.\n\nI think you have done everything you can and your example of the rubix cube was sweet and so right. Hopefully it goes better friend", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have much advice other than stating you&amp;#39;re a wonderfully supporting husband. I can see your trying really hard to make her happy and comfortable and not all about you.&lt;/p&gt;\n\n&lt;p&gt;I think you have done everything you can and your example of the rubix cube was sweet and so right. Hopefully it goes better friend&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4sm5t", "score_hidden": false, "stickied": false, "created": 1491968349.0, "created_utc": 1491939549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4tanb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skittlesprincess", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This sounds exactly how it'd go for me - until I managed to get over it on my own. It's like training anything, the more you do it the easier it gets.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds exactly how it&amp;#39;d go for me - until I managed to get over it on my own. It&amp;#39;s like training anything, the more you do it the easier it gets.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4tanb", "score_hidden": false, "stickied": false, "created": 1491969078.0, "created_utc": 1491940278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4vyix", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bowie747", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "In addition to all the helpful advice here, I'd also like to make sure you're holding up your end of the man deal. So much depends on who you're perceived to be. \n\nIt's sometimes not enough to communicate and have good technique, you have to inspire energy by being fit and dominant in general. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In addition to all the helpful advice here, I&amp;#39;d also like to make sure you&amp;#39;re holding up your end of the man deal. So much depends on who you&amp;#39;re perceived to be. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s sometimes not enough to communicate and have good technique, you have to inspire energy by being fit and dominant in general. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4vyix", "score_hidden": false, "stickied": false, "created": 1491972046.0, "created_utc": 1491943246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4w4p2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "minibabybuu", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "YOU may want to try something new, new motion, new position\nis she on birth control? this can cause this exact problem", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;YOU may want to try something new, new motion, new position\nis she on birth control? this can cause this exact problem&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4w4p2", "score_hidden": false, "stickied": false, "created": 1491972233.0, "created_utc": 1491943433.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4yesn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheManWhoWasNotShort", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;During foreplay she doesn't like receiving oral, nor does she like for me to finger her, she only wants penetration. I have an average penis size which is 5.5 inches and I have somewhat above average girth but I'm no pornstar in terms of stamina etc. The standard advice on this sub seems to be please your woman using fingers or tongue before the actual penetration part, which I can't do since she doesn't like it. \n\nIt kind of sounds like her hangups are creating her own problems here, doesn't it?  She's feeling unsatisfied from sex, but not giving OP the ability to supplement the sex with additional pleasure.  \n\nHonestly, this can work for someone who orgasms easily, but if they don't it's going to inevitably lead to frustration. It also puts ENORMOUS pressure on the partner for their penis to always perform up to standard, because if they accidentally cum too early or go soft, which are very natural male problems, then they can't satisfy their partner.\n\nI think it's worth exploring why she has such hangups about foreplay and what other sexual hangups she has in order to maximize her sexual experiences.  Like others have said therapy only makes sense", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;During foreplay she doesn&amp;#39;t like receiving oral, nor does she like for me to finger her, she only wants penetration. I have an average penis size which is 5.5 inches and I have somewhat above average girth but I&amp;#39;m no pornstar in terms of stamina etc. The standard advice on this sub seems to be please your woman using fingers or tongue before the actual penetration part, which I can&amp;#39;t do since she doesn&amp;#39;t like it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It kind of sounds like her hangups are creating her own problems here, doesn&amp;#39;t it?  She&amp;#39;s feeling unsatisfied from sex, but not giving OP the ability to supplement the sex with additional pleasure.  &lt;/p&gt;\n\n&lt;p&gt;Honestly, this can work for someone who orgasms easily, but if they don&amp;#39;t it&amp;#39;s going to inevitably lead to frustration. It also puts ENORMOUS pressure on the partner for their penis to always perform up to standard, because if they accidentally cum too early or go soft, which are very natural male problems, then they can&amp;#39;t satisfy their partner.&lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s worth exploring why she has such hangups about foreplay and what other sexual hangups she has in order to maximize her sexual experiences.  Like others have said therapy only makes sense&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4yesn", "score_hidden": false, "stickied": false, "created": 1491974912.0, "created_utc": 1491946112.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4yngf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "psidragon0", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It sounds like your wife is suffering from a heavy dose of catholic guilt - the type which teaches Catholics that it's shameful to have sex for any other purpose other than procreation.  \n\nThe other possibility is her birth control is killing her libido. That happens more often than people realize.\n\nIn any case, I think you've made all the right moves in this case, so you don't deserve any blame.  Your wife, however, has some issues. She definitely needs to work on communication, so reading books and speaking to a sex-positive therapist should be high on her list of priorities.  However, she needs to be willing to discuss it, and willing to admit there is a problem. If she won't, then that's probably going to completely end your sex life. If that's a deal breaker for you, then that means your marriage is probably over too.  This isn't anyone's fault, it's just that you two have different ideas about what is important in a marriage.\n\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like your wife is suffering from a heavy dose of catholic guilt - the type which teaches Catholics that it&amp;#39;s shameful to have sex for any other purpose other than procreation.  &lt;/p&gt;\n\n&lt;p&gt;The other possibility is her birth control is killing her libido. That happens more often than people realize.&lt;/p&gt;\n\n&lt;p&gt;In any case, I think you&amp;#39;ve made all the right moves in this case, so you don&amp;#39;t deserve any blame.  Your wife, however, has some issues. She definitely needs to work on communication, so reading books and speaking to a sex-positive therapist should be high on her list of priorities.  However, she needs to be willing to discuss it, and willing to admit there is a problem. If she won&amp;#39;t, then that&amp;#39;s probably going to completely end your sex life. If that&amp;#39;s a deal breaker for you, then that means your marriage is probably over too.  This isn&amp;#39;t anyone&amp;#39;s fault, it&amp;#39;s just that you two have different ideas about what is important in a marriage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4yngf", "score_hidden": false, "stickied": false, "created": 1491975202.0, "created_utc": 1491946402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4zpu8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "chuiy", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Maybe you should recommend she masturbates and tries to have an orgasm first?  \n\nIt sounds like everything goes off of the rails when she has that sensation; maybe she just needs to 'discover' herself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you should recommend she masturbates and tries to have an orgasm first?  &lt;/p&gt;\n\n&lt;p&gt;It sounds like everything goes off of the rails when she has that sensation; maybe she just needs to &amp;#39;discover&amp;#39; herself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4zpu8", "score_hidden": false, "stickied": false, "created": 1491976491.0, "created_utc": 1491947691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg51oo0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wewewawa", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "/r/vaginismus ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/vaginismus\"&gt;/r/vaginismus&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg51oo0", "score_hidden": false, "stickied": false, "created": 1491978983.0, "created_utc": 1491950183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg55c81", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sangetencre", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;She also does not masturbade at all. \n\nThis is a biggie. You can't tell your partner what you like if you don't know what you like. And, for many women, I think they have to *learn* how to orgasm (where to touch, where not to, where to push through, even if it seems like too much, etc.); it's not necessarily something that comes easily. And that's not to say they all do. \n\nThe issue may also go beyond masturbation. Is she much of a sexual person? What turns her on? Turns her off? Does she read erotica? Look at nude art? Watch porn? Etc. Exploration of one's self as a mental sexual being is just as important as the physical exploration. It also means being willing to step outside one's comfort zones. (Like dirty talk - talking during sex is weird for some people. I enjoy hearing it, but it's not something that's easy for me to do. If I'm really turned on, however, that makes it easier. And being really turned on involves a certain mental state.) \n\nIf her upbringing was very conservative or religious, that could have something to do with it. It's also possible she's internalized some negative things about sex and sexual pleasure and that's acting as a block. If exploring on her own and with you doesn't work, she could benefit from talking to a sex therapist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She also does not masturbade at all. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is a biggie. You can&amp;#39;t tell your partner what you like if you don&amp;#39;t know what you like. And, for many women, I think they have to &lt;em&gt;learn&lt;/em&gt; how to orgasm (where to touch, where not to, where to push through, even if it seems like too much, etc.); it&amp;#39;s not necessarily something that comes easily. And that&amp;#39;s not to say they all do. &lt;/p&gt;\n\n&lt;p&gt;The issue may also go beyond masturbation. Is she much of a sexual person? What turns her on? Turns her off? Does she read erotica? Look at nude art? Watch porn? Etc. Exploration of one&amp;#39;s self as a mental sexual being is just as important as the physical exploration. It also means being willing to step outside one&amp;#39;s comfort zones. (Like dirty talk - talking during sex is weird for some people. I enjoy hearing it, but it&amp;#39;s not something that&amp;#39;s easy for me to do. If I&amp;#39;m really turned on, however, that makes it easier. And being really turned on involves a certain mental state.) &lt;/p&gt;\n\n&lt;p&gt;If her upbringing was very conservative or religious, that could have something to do with it. It&amp;#39;s also possible she&amp;#39;s internalized some negative things about sex and sexual pleasure and that&amp;#39;s acting as a block. If exploring on her own and with you doesn&amp;#39;t work, she could benefit from talking to a sex therapist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg55c81", "score_hidden": false, "stickied": false, "created": 1491983887.0, "created_utc": 1491955087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg58it7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mozyx", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Not saying this is the case with your wife, but my general thoughts: \n\nI think a lot of these problems can stem from the cultural depiction of sex. In the movies, the guy always knows exactly what to do. No one has to express what they like or don't like. The woman experiences pleasure easily and from just penetration. Both climax simultaneously and bask in the afterglow.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not saying this is the case with your wife, but my general thoughts: &lt;/p&gt;\n\n&lt;p&gt;I think a lot of these problems can stem from the cultural depiction of sex. In the movies, the guy always knows exactly what to do. No one has to express what they like or don&amp;#39;t like. The woman experiences pleasure easily and from just penetration. Both climax simultaneously and bask in the afterglow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg58it7", "score_hidden": false, "stickied": false, "created": 1491988082.0, "created_utc": 1491959282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5hvvx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BluRoz85", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I can't find anywhere in the comments if someone mentioned vulvodynia. \n\nDoes your wife experience pain of any sort during intercourse? If so, she should see an obgyn and see if she has vulvodynia. It's a condition that makes sex extremely uncomfortable to extremely painful. Many women have but don't know anything about so they tend not to seek medical help.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t find anywhere in the comments if someone mentioned vulvodynia. &lt;/p&gt;\n\n&lt;p&gt;Does your wife experience pain of any sort during intercourse? If so, she should see an obgyn and see if she has vulvodynia. It&amp;#39;s a condition that makes sex extremely uncomfortable to extremely painful. Many women have but don&amp;#39;t know anything about so they tend not to seek medical help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5hvvx", "score_hidden": false, "stickied": false, "created": 1492001888.0, "created_utc": 1491973088.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5l0ya", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wooshoofoo", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "/r/nofap for a month, meanwhile look up sex therapists and convince her to go with you. The key is not to try to figure it out yourself (because clearly you haven't been able to) and let a professional help with a very complex issue.\n\nBut not fapping will also solve the masturbation issue you mentioned at the end.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/nofap\"&gt;/r/nofap&lt;/a&gt; for a month, meanwhile look up sex therapists and convince her to go with you. The key is not to try to figure it out yourself (because clearly you haven&amp;#39;t been able to) and let a professional help with a very complex issue.&lt;/p&gt;\n\n&lt;p&gt;But not fapping will also solve the masturbation issue you mentioned at the end.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5l0ya", "score_hidden": false, "stickied": false, "created": 1492008777.0, "created_utc": 1491979977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg6lg6y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AuroraFitzrovia", "parent_id": "t1_dg5xmcl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You're absolutely right.\nI just had the urge to point out that there's also a different way of experiencing stimulation. :)\nBut still, yes, that's absolutely true.\nI just feel sorry for everyone who's (why ever) not able to feel that type of sensation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re absolutely right.\nI just had the urge to point out that there&amp;#39;s also a different way of experiencing stimulation. :)\nBut still, yes, that&amp;#39;s absolutely true.\nI just feel sorry for everyone who&amp;#39;s (why ever) not able to feel that type of sensation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6lg6y", "score_hidden": false, "stickied": false, "created": 1492061359.0, "created_utc": 1492032559.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5xmcl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lbtaylor1984", "parent_id": "t1_dg5qsyv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Well for everyone you know who feels that way there is someone who feels the opposite and considering the gentlemens wife doesn't masterbate or like oral i don't think she's in your camp. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well for everyone you know who feels that way there is someone who feels the opposite and considering the gentlemens wife doesn&amp;#39;t masterbate or like oral i don&amp;#39;t think she&amp;#39;s in your camp. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5xmcl", "score_hidden": false, "stickied": false, "created": 1492036181.0, "created_utc": 1492007381.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qsyv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AuroraFitzrovia", "parent_id": "t1_dg5lo12", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "From all the female friends I (female) talked to there was no one who experienced either receiving or giving oral as degrading..\nActually most of us agreed on how it empowers you, when you give oral for example, because he is the one who's vulnerable in that very situation.\nAnd when it comes to receiving oral it's (at least to me) the purest form of physical appreciation since it's all about my pleasure.\n\nI can imagine that it might feel degrading when you're not completely sure with your body and maybe feel ashamed for being that exposed.\n\nAnother thing is that a lot of women need quite a long time to enjoy clitoral stimulation simply because it's so intense. That's a sensation you can only enjoy if your partner isn't a total fuckup when it comes cunnilingus. There's nothing worse than a guy misconcepting a clit as a scratch card.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From all the female friends I (female) talked to there was no one who experienced either receiving or giving oral as degrading..\nActually most of us agreed on how it empowers you, when you give oral for example, because he is the one who&amp;#39;s vulnerable in that very situation.\nAnd when it comes to receiving oral it&amp;#39;s (at least to me) the purest form of physical appreciation since it&amp;#39;s all about my pleasure.&lt;/p&gt;\n\n&lt;p&gt;I can imagine that it might feel degrading when you&amp;#39;re not completely sure with your body and maybe feel ashamed for being that exposed.&lt;/p&gt;\n\n&lt;p&gt;Another thing is that a lot of women need quite a long time to enjoy clitoral stimulation simply because it&amp;#39;s so intense. That&amp;#39;s a sensation you can only enjoy if your partner isn&amp;#39;t a total fuckup when it comes cunnilingus. There&amp;#39;s nothing worse than a guy misconcepting a clit as a scratch card.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5qsyv", "score_hidden": false, "stickied": false, "created": 1492025558.0, "created_utc": 1491996758.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5lo12", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lbtaylor1984", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Maybe this is too simple an idea but I'll let you decide.\n\nWomen tend to feel degraded by oral whether it's giving or receiving. There's some link between being submissive and used which I've never quite got but I can say a few people have told me this.\n\nPerhaps continue to kiss and touch and all the normal things but perhaps a realistic dildo of a normal size would be a good idea.  You can use it on her or by herself and get her really into, then when the time is right you can get involved and can make her orgasm. \n\nGenerally speaking I've found piv sex can achieve female orgasm. But you have to respond to her, her hip action, breathing, and muscle tightness which tells you a lot about her current status, if you realise she's really enjoying something just keep doing it and don't change it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe this is too simple an idea but I&amp;#39;ll let you decide.&lt;/p&gt;\n\n&lt;p&gt;Women tend to feel degraded by oral whether it&amp;#39;s giving or receiving. There&amp;#39;s some link between being submissive and used which I&amp;#39;ve never quite got but I can say a few people have told me this.&lt;/p&gt;\n\n&lt;p&gt;Perhaps continue to kiss and touch and all the normal things but perhaps a realistic dildo of a normal size would be a good idea.  You can use it on her or by herself and get her really into, then when the time is right you can get involved and can make her orgasm. &lt;/p&gt;\n\n&lt;p&gt;Generally speaking I&amp;#39;ve found piv sex can achieve female orgasm. But you have to respond to her, her hip action, breathing, and muscle tightness which tells you a lot about her current status, if you realise she&amp;#39;s really enjoying something just keep doing it and don&amp;#39;t change it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5lo12", "score_hidden": false, "stickied": false, "created": 1492010499.0, "created_utc": 1491981699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5lsvh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dlopoel", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Some people are just less sexual than other. You are putting too much focus on her pleasure which put an unwanted pressure on her, which in turn makes the sexual experience frustrating for her. You can try tantra sex, if that makes sense for your couple. The goal of having sex doesn't have to be to have an orgasm but have fun together. If it's frustrating, you need to set your priorities differently. \n\nOr maybe she is indeed less interested in sex, and you have to respect that. In that case you should find other ways to demonstrate your affection. Checkout the 5 languages of love to find some inspiration. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some people are just less sexual than other. You are putting too much focus on her pleasure which put an unwanted pressure on her, which in turn makes the sexual experience frustrating for her. You can try tantra sex, if that makes sense for your couple. The goal of having sex doesn&amp;#39;t have to be to have an orgasm but have fun together. If it&amp;#39;s frustrating, you need to set your priorities differently. &lt;/p&gt;\n\n&lt;p&gt;Or maybe she is indeed less interested in sex, and you have to respect that. In that case you should find other ways to demonstrate your affection. Checkout the 5 languages of love to find some inspiration. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5lsvh", "score_hidden": false, "stickied": false, "created": 1492010873.0, "created_utc": 1491982073.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5pv0a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "smithjm7", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Dude I know it's rough right now but, you're not the only one.  Me and my girlfriend went through something not to the same extent but similar. We've been dating 6 years and early on when we would have sexagesimal admitted to me that she just went through motions to make me happy and that she never really enjoyed it which knotted my stomach up all day. And every once in a while if we're in a weird position she will start to cry and we pretty much stop. A lot of women kind of \"break down \" during sex from my understanding. We're just now start in Greenville to find the groove and have enjoy it most of the time. The only difference is she mainly gets there from oral and that a big part of our sex life. The fact that your wife is wierd about the oral is tough. What has she said when you asked her why she makes you stop ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude I know it&amp;#39;s rough right now but, you&amp;#39;re not the only one.  Me and my girlfriend went through something not to the same extent but similar. We&amp;#39;ve been dating 6 years and early on when we would have sexagesimal admitted to me that she just went through motions to make me happy and that she never really enjoyed it which knotted my stomach up all day. And every once in a while if we&amp;#39;re in a weird position she will start to cry and we pretty much stop. A lot of women kind of &amp;quot;break down &amp;quot; during sex from my understanding. We&amp;#39;re just now start in Greenville to find the groove and have enjoy it most of the time. The only difference is she mainly gets there from oral and that a big part of our sex life. The fact that your wife is wierd about the oral is tough. What has she said when you asked her why she makes you stop ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5pv0a", "score_hidden": false, "stickied": false, "created": 1492023211.0, "created_utc": 1491994411.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5rtgo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DisneyPrincess-chj", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I sometimes struggled to get anything enjoyable from penetration, but my partner and I bought this couple's vibrator that goes in me and presses against the clit whilst he's in there, and it feels good for both of us. I don't know if I've properly came from that, but it's close. Also, I find riding him sometimes feels better for me, especially if I grind against him, and then when I'm close my body goes kind of rigid and he just holds onto my hips and moves me a bit. \n\nI struggle with receiving oral sometimes, it's a confidence issue for me, I don't like looking down at him because of how I look. \n\nI hope things get better for you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sometimes struggled to get anything enjoyable from penetration, but my partner and I bought this couple&amp;#39;s vibrator that goes in me and presses against the clit whilst he&amp;#39;s in there, and it feels good for both of us. I don&amp;#39;t know if I&amp;#39;ve properly came from that, but it&amp;#39;s close. Also, I find riding him sometimes feels better for me, especially if I grind against him, and then when I&amp;#39;m close my body goes kind of rigid and he just holds onto my hips and moves me a bit. &lt;/p&gt;\n\n&lt;p&gt;I struggle with receiving oral sometimes, it&amp;#39;s a confidence issue for me, I don&amp;#39;t like looking down at him because of how I look. &lt;/p&gt;\n\n&lt;p&gt;I hope things get better for you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5rtgo", "score_hidden": false, "stickied": false, "created": 1492027684.0, "created_utc": 1491998884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5un8t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vita4u", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "hey, maybe you have some time for my response, maybe not, but i will post it here however.\n\nWhat about getting her to open up more?\nsex often isn't about what happens physically, but about the mental states involved, besides obviously nature's physical attraction.\n\nIf she cries: is it intense crying, like out of emotions?\nor is it more like painful?\n\nI think you shouldn't look at the past and she shouldn't either, and instead focus on what you are experiencing.\nBuild things up slowly, build anticipation, cuddle first, take it further step by step\n\ntry things like massaging, cuddling, bathes, showers, porn or whatever seems nice\n\njust don't think sex is something from one side, it comes from both sides and you both bring each other to enjoyment with trial and error. how more  you react to how the other acts, how more likely it is that you both will feel more satisfied", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hey, maybe you have some time for my response, maybe not, but i will post it here however.&lt;/p&gt;\n\n&lt;p&gt;What about getting her to open up more?\nsex often isn&amp;#39;t about what happens physically, but about the mental states involved, besides obviously nature&amp;#39;s physical attraction.&lt;/p&gt;\n\n&lt;p&gt;If she cries: is it intense crying, like out of emotions?\nor is it more like painful?&lt;/p&gt;\n\n&lt;p&gt;I think you shouldn&amp;#39;t look at the past and she shouldn&amp;#39;t either, and instead focus on what you are experiencing.\nBuild things up slowly, build anticipation, cuddle first, take it further step by step&lt;/p&gt;\n\n&lt;p&gt;try things like massaging, cuddling, bathes, showers, porn or whatever seems nice&lt;/p&gt;\n\n&lt;p&gt;just don&amp;#39;t think sex is something from one side, it comes from both sides and you both bring each other to enjoyment with trial and error. how more  you react to how the other acts, how more likely it is that you both will feel more satisfied&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5un8t", "score_hidden": false, "stickied": false, "created": 1492032342.0, "created_utc": 1492003542.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg7ivgf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Slicerette", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "What struck me is when you talked about her whole body shaking. It is uncontrollable shivering almost like she's cold? Yeah that's a trauma reaction. Has your wife been sexually abused? Perhaps she hasn't told you or she doesn't even know. The body remembers. \n\nAfter my rape my therapist told me I had masturbate to reclaim my own sexuality and my own pleasure and when I would start to get really wet and turned on--not yet to orgasm, and I've never had difficulties orgasming, not on my own anyway--I would start shivering so violently I had to stop. But I masturbating every night was part of the assignment and after about a month the shivering stopped and I could really enjoy myself. \n\nMy therapist described it as your body remembering what your mind has forgotten (I have memory loss). There was a very painful and trauma incident involving sex so when I start stimulating those same bodily receptors I start shaking and panicking basically because my body is prepping for fight or flight. \n\nSo. Therapy is what your wife should look at. And also you might have to stay out of her sex life for awhile if she had been sexually abused. She will need to figure this out in her own with your support. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What struck me is when you talked about her whole body shaking. It is uncontrollable shivering almost like she&amp;#39;s cold? Yeah that&amp;#39;s a trauma reaction. Has your wife been sexually abused? Perhaps she hasn&amp;#39;t told you or she doesn&amp;#39;t even know. The body remembers. &lt;/p&gt;\n\n&lt;p&gt;After my rape my therapist told me I had masturbate to reclaim my own sexuality and my own pleasure and when I would start to get really wet and turned on--not yet to orgasm, and I&amp;#39;ve never had difficulties orgasming, not on my own anyway--I would start shivering so violently I had to stop. But I masturbating every night was part of the assignment and after about a month the shivering stopped and I could really enjoy myself. &lt;/p&gt;\n\n&lt;p&gt;My therapist described it as your body remembering what your mind has forgotten (I have memory loss). There was a very painful and trauma incident involving sex so when I start stimulating those same bodily receptors I start shaking and panicking basically because my body is prepping for fight or flight. &lt;/p&gt;\n\n&lt;p&gt;So. Therapy is what your wife should look at. And also you might have to stay out of her sex life for awhile if she had been sexually abused. She will need to figure this out in her own with your support. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7ivgf", "score_hidden": false, "stickied": false, "created": 1492118253.0, "created_utc": 1492089453.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg7utq4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Inflatable_Lazarus", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Just saw your post.  I have little to say about the feeling-used part, except that there are some emotional issues that clearly need to be worked out.\n\nOn to my more mechanics-of-sex answer:  Ask her directly if, during that foreplay, oral, or Magic Wand build-up, she's experiencing a sensation that feels like she *really* needs to pee.  Like in that thigh-shaking moment, does she experience something that feels like she really needs to go, and is she afraid she'll pee on you.\n\nThis is something I've seen quite a bit in women.  That build-up right before a good orgasm feels very much like an intense need to pee (if you think about it, male orgasm feels the same way- it makes sense, as your urinary organs pass directly through your sex organs).\n\nIf she says that it does, ask if she's embarrassed and worried that she might pee, then explain that the sensation is a correct one and not some signal that she's broken or dysfunctional.  It's normal.  It doesn't mean she will pee, it means that if she allows herself to go through it, she'll probably orgasm.  And that said, *some* (not all) women do pee a bit, or squirt, when they come.  That's perfectly normal as well, and not something to be worried about.  But you'll never know  either way until she lets herself get through that wall.", "edited": 1492103567.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just saw your post.  I have little to say about the feeling-used part, except that there are some emotional issues that clearly need to be worked out.&lt;/p&gt;\n\n&lt;p&gt;On to my more mechanics-of-sex answer:  Ask her directly if, during that foreplay, oral, or Magic Wand build-up, she&amp;#39;s experiencing a sensation that feels like she &lt;em&gt;really&lt;/em&gt; needs to pee.  Like in that thigh-shaking moment, does she experience something that feels like she really needs to go, and is she afraid she&amp;#39;ll pee on you.&lt;/p&gt;\n\n&lt;p&gt;This is something I&amp;#39;ve seen quite a bit in women.  That build-up right before a good orgasm feels very much like an intense need to pee (if you think about it, male orgasm feels the same way- it makes sense, as your urinary organs pass directly through your sex organs).&lt;/p&gt;\n\n&lt;p&gt;If she says that it does, ask if she&amp;#39;s embarrassed and worried that she might pee, then explain that the sensation is a correct one and not some signal that she&amp;#39;s broken or dysfunctional.  It&amp;#39;s normal.  It doesn&amp;#39;t mean she will pee, it means that if she allows herself to go through it, she&amp;#39;ll probably orgasm.  And that said, &lt;em&gt;some&lt;/em&gt; (not all) women do pee a bit, or squirt, when they come.  That&amp;#39;s perfectly normal as well, and not something to be worried about.  But you&amp;#39;ll never know  either way until she lets herself get through that wall.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7utq4", "score_hidden": false, "stickied": false, "created": 1492131867.0, "created_utc": 1492103067.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dgbjmrj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TomahawkCruise", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Something is going on with her and she is not communicating it with you.\n\nAs much as I hate to write this, I feel it's appropriate and just might help you. But she may be experiencing a bit of buyer's remorse.\n\nWhat I mean by that is this:\n\nThis possibility entered my head the second you said that you're the only person she's ever had sex with. Some women are notorious for taking this path in relationships, regardless of whether there's a marriage certificate or not. The simple way to put it is, she may have reached a point where she is sorry she has never had any other experiences with any other men than you, and that might be turning her off from you.\n\nSo many people who marry young under this scenario ultimately get to the same juncture, men and women. You only go around this ferris wheel once and some people don't like the idea of having sexual experiences with just one person, for life. That sometimes leads them to seek other experiences -- through cheating or dissolving the relationship and seeking others elsewhere.\n\nIt would appear that neither you nor I know what her true motivations are, but I suspect one of these elements are at play.\n\nIt's clear you love this woman dearly, and if she is going through a buyer's remorse scenario it doesn't necessarily mean the end of the relationship. You have made numerous attempts to accommodate her situation while simultaneously expressing your unconditional love for her. That's all great and shows the type of guy you are. But I will say this -- don't go too far with it. If she continues to express a reluctance for you as a partner, don't surrender your dignity and self-respect just to make her happy -- because that's a heavy price to pay and you probably won't even make her happy in the end.\n\nI've been where you are -- so in love with your woman that you would literally do everything in the world before you would ever opt to leave her. But you must remember, love is a two-way street. It must go both ways. No one person can love enough for the two of you. It takes two to start a relationship but it takes just one to end it.\n\nI once loved a girl more than I've ever loved any person or thing in my entire life. We dated for almost exactly two years and I wanted nothing more than to stay with this girl forever. I seriously lost all interest in other women due to her. However, in the end she decided she would regret it if she didn't date a little bit and gain other experiences, apart from me. We began dating straight out of her divorce after she'd been married 9 years. Thus, her dating resume was precariously lean. It didn't matter how much love I showed to her, it just came to a point where she decided she couldn't be happy without experiencing the waters out there. It crushed me and still does a little bit to this day, and we broke up 3 years ago. I felt like it would be impossible to replace her and that I wouldn't be capable of loving someone again. Clearly, I was wrong and I now can see we are better off apart. But the one thing I'm glad I did was I preserved my dignity and self respect through the ordeal.\n\nDon't tolerate bad or hurtful behavior. It's okay to weather occasional storms, but if her actions and words are repeating, your best option is to leave the relationship. Divorces aren't the end of the world. Believe me, I'm divorced. And it was one of the best decisions I've ever made.\n\nTry to work with her to resolve whatever the problem is. But if you get to a point where you feel you've exhausted your arsenal -- and she is still dismissive of you -- I strongly advise you to walk away, peacefully and respectfully. She is NOT the only woman in the world for you. There are plenty of women out here who would love to have what you offer. Love your wife, try and help her, but don't lose yourself for her. It will only cause lasting pain, resentment and will not lead to happiness.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something is going on with her and she is not communicating it with you.&lt;/p&gt;\n\n&lt;p&gt;As much as I hate to write this, I feel it&amp;#39;s appropriate and just might help you. But she may be experiencing a bit of buyer&amp;#39;s remorse.&lt;/p&gt;\n\n&lt;p&gt;What I mean by that is this:&lt;/p&gt;\n\n&lt;p&gt;This possibility entered my head the second you said that you&amp;#39;re the only person she&amp;#39;s ever had sex with. Some women are notorious for taking this path in relationships, regardless of whether there&amp;#39;s a marriage certificate or not. The simple way to put it is, she may have reached a point where she is sorry she has never had any other experiences with any other men than you, and that might be turning her off from you.&lt;/p&gt;\n\n&lt;p&gt;So many people who marry young under this scenario ultimately get to the same juncture, men and women. You only go around this ferris wheel once and some people don&amp;#39;t like the idea of having sexual experiences with just one person, for life. That sometimes leads them to seek other experiences -- through cheating or dissolving the relationship and seeking others elsewhere.&lt;/p&gt;\n\n&lt;p&gt;It would appear that neither you nor I know what her true motivations are, but I suspect one of these elements are at play.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s clear you love this woman dearly, and if she is going through a buyer&amp;#39;s remorse scenario it doesn&amp;#39;t necessarily mean the end of the relationship. You have made numerous attempts to accommodate her situation while simultaneously expressing your unconditional love for her. That&amp;#39;s all great and shows the type of guy you are. But I will say this -- don&amp;#39;t go too far with it. If she continues to express a reluctance for you as a partner, don&amp;#39;t surrender your dignity and self-respect just to make her happy -- because that&amp;#39;s a heavy price to pay and you probably won&amp;#39;t even make her happy in the end.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been where you are -- so in love with your woman that you would literally do everything in the world before you would ever opt to leave her. But you must remember, love is a two-way street. It must go both ways. No one person can love enough for the two of you. It takes two to start a relationship but it takes just one to end it.&lt;/p&gt;\n\n&lt;p&gt;I once loved a girl more than I&amp;#39;ve ever loved any person or thing in my entire life. We dated for almost exactly two years and I wanted nothing more than to stay with this girl forever. I seriously lost all interest in other women due to her. However, in the end she decided she would regret it if she didn&amp;#39;t date a little bit and gain other experiences, apart from me. We began dating straight out of her divorce after she&amp;#39;d been married 9 years. Thus, her dating resume was precariously lean. It didn&amp;#39;t matter how much love I showed to her, it just came to a point where she decided she couldn&amp;#39;t be happy without experiencing the waters out there. It crushed me and still does a little bit to this day, and we broke up 3 years ago. I felt like it would be impossible to replace her and that I wouldn&amp;#39;t be capable of loving someone again. Clearly, I was wrong and I now can see we are better off apart. But the one thing I&amp;#39;m glad I did was I preserved my dignity and self respect through the ordeal.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t tolerate bad or hurtful behavior. It&amp;#39;s okay to weather occasional storms, but if her actions and words are repeating, your best option is to leave the relationship. Divorces aren&amp;#39;t the end of the world. Believe me, I&amp;#39;m divorced. And it was one of the best decisions I&amp;#39;ve ever made.&lt;/p&gt;\n\n&lt;p&gt;Try to work with her to resolve whatever the problem is. But if you get to a point where you feel you&amp;#39;ve exhausted your arsenal -- and she is still dismissive of you -- I strongly advise you to walk away, peacefully and respectfully. She is NOT the only woman in the world for you. There are plenty of women out here who would love to have what you offer. Love your wife, try and help her, but don&amp;#39;t lose yourself for her. It will only cause lasting pain, resentment and will not lead to happiness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbjmrj", "score_hidden": false, "stickied": false, "created": 1492338164.0, "created_utc": 1492309364.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dge1k9x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "honorbound43", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I agree to what u/Acrolith was saying about control and not losing herself in the moment. I personally suffered from that issue with my last significant other and a few before that. \n\nI was in college, I was stressed out of my mind, and the only thing that was a distraction was picking up girls, and the chase, and sex. I never finished (this was a problem for a year). And that was because I wasn't connecting w/ them and wasn't feeling open just trying to distract my mind, which in turn never did. \n\nWhen you get caught in a routine and you ask for sex it takes away from the moment. Try taking your wife out having a great time, a and in the moment going for it or even getting her engine revved up with flirty and promiscous conversation. And if you are feeling it do engage in the car, in the restaurant wherever. Make it exciting, make it the moment like you couldn't keep your hands off each other. Grab her like never before like when you two first started dating and the mystery was still there. \n\nGood luck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree to what &lt;a href=\"/u/Acrolith\"&gt;u/Acrolith&lt;/a&gt; was saying about control and not losing herself in the moment. I personally suffered from that issue with my last significant other and a few before that. &lt;/p&gt;\n\n&lt;p&gt;I was in college, I was stressed out of my mind, and the only thing that was a distraction was picking up girls, and the chase, and sex. I never finished (this was a problem for a year). And that was because I wasn&amp;#39;t connecting w/ them and wasn&amp;#39;t feeling open just trying to distract my mind, which in turn never did. &lt;/p&gt;\n\n&lt;p&gt;When you get caught in a routine and you ask for sex it takes away from the moment. Try taking your wife out having a great time, a and in the moment going for it or even getting her engine revved up with flirty and promiscous conversation. And if you are feeling it do engage in the car, in the restaurant wherever. Make it exciting, make it the moment like you couldn&amp;#39;t keep your hands off each other. Grab her like never before like when you two first started dating and the mystery was still there. &lt;/p&gt;\n\n&lt;p&gt;Good luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge1k9x", "score_hidden": true, "stickied": false, "created": 1492488741.0, "created_utc": 1492459941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4ivh0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ozeths", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "Weed.\nMy wife had something similar where she got a bit scared to get too much pleasure and such.\n\nAnd one day we made love while high, and all her barrier went down, and she orgasmed many times.\n\nShe still has those now, when we don't smoke, she says she can only orgasm once \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Weed.\nMy wife had something similar where she got a bit scared to get too much pleasure and such.&lt;/p&gt;\n\n&lt;p&gt;And one day we made love while high, and all her barrier went down, and she orgasmed many times.&lt;/p&gt;\n\n&lt;p&gt;She still has those now, when we don&amp;#39;t smoke, she says she can only orgasm once &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4ivh0", "score_hidden": false, "stickied": false, "created": 1491957792.0, "created_utc": 1491928992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4ooz0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cyclodextrin", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "In regards to her finding out what works for her, she could try reading stuff on omgyes.com. And I feel bad for you, you're really trying and it's like she's not really. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In regards to her finding out what works for her, she could try reading stuff on omgyes.com. And I feel bad for you, you&amp;#39;re really trying and it&amp;#39;s like she&amp;#39;s not really. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4ooz0", "score_hidden": false, "stickied": false, "created": 1491964160.0, "created_utc": 1491935360.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg5ezy1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CouragePope", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "TL DR: If she didn't like it, she should have never agreed to marry you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TL DR: If she didn&amp;#39;t like it, she should have never agreed to marry you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5ezy1", "score_hidden": false, "stickied": false, "created": 1491996967.0, "created_utc": 1491968167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4h4g4", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "blingsingh", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "How's the sex when you guys are drunk ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How&amp;#39;s the sex when you guys are drunk ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4h4g4", "score_hidden": false, "stickied": false, "created": 1491955878.0, "created_utc": 1491927078.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4x918", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "chaveznieves", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "This is why I could never get married.  Too many stories of people getting blindsided after YEARS.  No way to prove 100% day one honesty so not ever worth the risk. I just hope she learns to open up a bit but it doesn't feel like a happy ending type of story", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is why I could never get married.  Too many stories of people getting blindsided after YEARS.  No way to prove 100% day one honesty so not ever worth the risk. I just hope she learns to open up a bit but it doesn&amp;#39;t feel like a happy ending type of story&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4x918", "score_hidden": false, "stickied": false, "created": 1491973516.0, "created_utc": 1491944716.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg4kxeg", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "redbabypanda", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "Do you guys have a detachable shower head? If she hasn't gotten herself off it's really crazy to expect anyone else can! She's gotta loosen her grip and explore herself before you can do anything for her. \n\nEdit: Down voted for saying it shouldn't be all on this guy to please someone who can't please herself.. ok. ", "edited": 1492057799.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you guys have a detachable shower head? If she hasn&amp;#39;t gotten herself off it&amp;#39;s really crazy to expect anyone else can! She&amp;#39;s gotta loosen her grip and explore herself before you can do anything for her. &lt;/p&gt;\n\n&lt;p&gt;Edit: Down voted for saying it shouldn&amp;#39;t be all on this guy to please someone who can&amp;#39;t please herself.. ok. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg4kxeg", "score_hidden": false, "stickied": false, "created": 1491960029.0, "created_utc": 1491931229.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg51ca6", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Ham-Demon", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Buy her a sybian.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Buy her a sybian.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg51ca6", "score_hidden": false, "stickied": false, "created": 1491978546.0, "created_utc": 1491949746.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64qpds", "likes": null, "replies": "", "user_reports": [], "id": "dg6huku", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "midnite-tequila", "parent_id": "t3_64qpds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Men don't want to hear these kind of things? Really? Call me a fish, then, because I absolutely DO want to know what's going on in my lover's head.\n\nAnd to be honest, I'm not sure how you could be \"blind-sided\" by any of this - it's pretty damn obvious that she hasn't been having a good time during sex. You don't need to be any kind of Casanova to pick up on that, so how did you miss it? How long has this been going on for?\n\nThat kind of tells me that the problem isn't just her - it's you, too. And the fact that you just dumped the problem on her to solve by herself is probably just making this much, much worse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Men don&amp;#39;t want to hear these kind of things? Really? Call me a fish, then, because I absolutely DO want to know what&amp;#39;s going on in my lover&amp;#39;s head.&lt;/p&gt;\n\n&lt;p&gt;And to be honest, I&amp;#39;m not sure how you could be &amp;quot;blind-sided&amp;quot; by any of this - it&amp;#39;s pretty damn obvious that she hasn&amp;#39;t been having a good time during sex. You don&amp;#39;t need to be any kind of Casanova to pick up on that, so how did you miss it? How long has this been going on for?&lt;/p&gt;\n\n&lt;p&gt;That kind of tells me that the problem isn&amp;#39;t just her - it&amp;#39;s you, too. And the fact that you just dumped the problem on her to solve by herself is probably just making this much, much worse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6huku", "score_hidden": false, "stickied": false, "created": 1492057404.0, "created_utc": 1492028604.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "more"}], "after": null, "before": null}}]