[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve faked every orgasm witnessed by another person.\nI lost my virginity at 16 and my experience of sex before that was what I&amp;#39;d seen on tv and nothing else. So I was under the impression it was 40 seconds of PiV (no foreplay and GOD FORBID the clit gets a look in) followed by the woman moaning and writhing in ecstasy. So at 16 I had no idea why I wasn&amp;#39;t having the same reaction. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve learned a lot since then. I can orgasm easily alone and without fail yet somehow reaching that with another person has remained impossible. &lt;/p&gt;\n\n&lt;p&gt;So I find myself here, a decade and several partners later. For years I figured with the right guidance and demonstrations I could make it happen for real and continue on from there but the big &amp;#39;o&amp;#39; has remained elusive when connecting with another person. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been with my current partner for 5 climaxless years that he had no idea about. I love him a lot and it became apparent this relationship was going to last and I didn&amp;#39;t feel it fair on myself to continue this way. So it was time to tell.&lt;/p&gt;\n\n&lt;p&gt;I had spent so long feeling horribly defective. The longer it went on, the bigger the lie was so it became harder to come clean. One year turned into 5. I became paralysed by it. How could someone forgive me this? I thought he&amp;#39;d be angry, devastated. To think all those times fraudulent. Question his abilities/manhood. I know this is all my problem, my fault, my issue. I told him everything and he took it well. He wasn&amp;#39;t angry but instead sad. &lt;/p&gt;\n\n&lt;p&gt;I can tell this is purely psychological as shortly after the big reveal I tried masturbating next to him as way of show and tell. Nothing. Not even close. This has happened a few times along with him valiantly going down on me for what felt like hours. Now I know he&amp;#39;s expectant the whole thing is worse and the pressure is suffocating. &lt;/p&gt;\n\n&lt;p&gt;&amp;#39;Relax&amp;#39; says every article/book I&amp;#39;ve read on the issue (and I&amp;#39;ve read hundreds) but I&amp;#39;m not sure if I ever will be able to. When I&amp;#39;m on my own I don&amp;#39;t think about how I look/taste/smell/feel. Yet when there&amp;#39;s someone with me I&amp;#39;m crippled by it so much so I became to resent and avoid sex. I never felt closer or more intimate with anyone during or after sex. Faking orgasms made sex feel &amp;#39;finished&amp;#39; and now I have to just sign and give up.&lt;/p&gt;\n\n&lt;p&gt;Please ladies of &lt;a href=\"/r/sex\"&gt;r/sex&lt;/a&gt; have you got ANY information that might help me? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've faked every orgasm witnessed by another person.\nI lost my virginity at 16 and my experience of sex before that was what I'd seen on tv and nothing else. So I was under the impression it was 40 seconds of PiV (no foreplay and GOD FORBID the clit gets a look in) followed by the woman moaning and writhing in ecstasy. So at 16 I had no idea why I wasn't having the same reaction. \n\nI've learned a lot since then. I can orgasm easily alone and without fail yet somehow reaching that with another person has remained impossible. \n\nSo I find myself here, a decade and several partners later. For years I figured with the right guidance and demonstrations I could make it happen for real and continue on from there but the big 'o' has remained elusive when connecting with another person. \n\nI've been with my current partner for 5 climaxless years that he had no idea about. I love him a lot and it became apparent this relationship was going to last and I didn't feel it fair on myself to continue this way. So it was time to tell.\n\nI had spent so long feeling horribly defective. The longer it went on, the bigger the lie was so it became harder to come clean. One year turned into 5. I became paralysed by it. How could someone forgive me this? I thought he'd be angry, devastated. To think all those times fraudulent. Question his abilities/manhood. I know this is all my problem, my fault, my issue. I told him everything and he took it well. He wasn't angry but instead sad. \n\nI can tell this is purely psychological as shortly after the big reveal I tried masturbating next to him as way of show and tell. Nothing. Not even close. This has happened a few times along with him valiantly going down on me for what felt like hours. Now I know he's expectant the whole thing is worse and the pressure is suffocating. \n\n'Relax' says every article/book I've read on the issue (and I've read hundreds) but I'm not sure if I ever will be able to. When I'm on my own I don't think about how I look/taste/smell/feel. Yet when there's someone with me I'm crippled by it so much so I became to resent and avoid sex. I never felt closer or more intimate with anyone during or after sex. Faking orgasms made sex feel 'finished' and now I have to just sign and give up.\n\nPlease ladies of r/sex have you got ANY information that might help me? ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64ymr5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 86, "report_reasons": null, "author": "auniqueusername29", "saved": false, "mod_reports": [], "name": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/64ymr5/orgasm_trouble_ive_27f_faked_orgasms_for_ten/", "num_reports": null, "locked": false, "stickied": false, "created": 1492037609.0, "url": "https://www.reddit.com/r/sex/comments/64ymr5/orgasm_trouble_ive_27f_faked_orgasms_for_ten/", "author_flair_text": null, "quarantine": false, "title": "[orgasm trouble] I've (27f) faked orgasms for TEN YEARS. Just came clean.", "created_utc": 1492008809.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 83, "visited": false, "subreddit_type": "public", "ups": 86}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg67pku", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg66j0j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "That is by far the most helpful advice I've ever received regarding this. It doesn't sound bizarre at all (I might not be the best judge lol) I've tried some unusual tactics myself! Believe me when I say I have TRIED.\n\nYou're right, I've for a while thought I've conditioned myself into faking it after sex had been going on for a while to end it... So it's been a challenge to just say 'actually yeah, no, let's just call it a day' ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is by far the most helpful advice I&amp;#39;ve ever received regarding this. It doesn&amp;#39;t sound bizarre at all (I might not be the best judge lol) I&amp;#39;ve tried some unusual tactics myself! Believe me when I say I have TRIED.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right, I&amp;#39;ve for a while thought I&amp;#39;ve conditioned myself into faking it after sex had been going on for a while to end it... So it&amp;#39;s been a challenge to just say &amp;#39;actually yeah, no, let&amp;#39;s just call it a day&amp;#39; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg67pku", "score_hidden": false, "stickied": false, "created": 1492047026.0, "created_utc": 1492018226.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6z48y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PM_ME_UR_CUMSHOTZ", "parent_id": "t1_dg66j0j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Can you elaborate on the tensing thing? I'm honestly super curious. I'm in the same position as OP with regards to partnered orgasm and I'm in a perfect position with a FWB to give something like this a try. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you elaborate on the tensing thing? I&amp;#39;m honestly super curious. I&amp;#39;m in the same position as OP with regards to partnered orgasm and I&amp;#39;m in a perfect position with a FWB to give something like this a try. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6z48y", "score_hidden": false, "stickied": false, "created": 1492078152.0, "created_utc": 1492049352.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66j0j", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Oneforthegold", "parent_id": "t1_dg643al", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think the tensing thing helps 1)because it can make orgasming easier and 2) forces you to think about your body and get out of the \"how do I look, move etc\" thought pattern. \n\nI know from years of faking it too that the focusing outside yourself is part of sex for you now.  It's a habit you have to unlearn. \n\nThis is going to sound awful but I think in the beginning if you can close your eyes and kinda pretend they aren't there as a person it can help. Obviously not what you want long term - but short term to get over the \"hump\".   The first time I successful came with a partner we were spooning - manual stimulation which I could easily direct without talking - closed my eyes and just pretended I was alone.  Kinda bizarre I know. But once it happened once it got easier because it felt like I got past that mental block.  Then it expanded to oral and eventual to PIV. (Where I didn't have to pretend to be alone lol) \n\nGood luck. Treat this like a new skill. Like you're going from walking to running a marathon. You're unlearning an old habit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the tensing thing helps 1)because it can make orgasming easier and 2) forces you to think about your body and get out of the &amp;quot;how do I look, move etc&amp;quot; thought pattern. &lt;/p&gt;\n\n&lt;p&gt;I know from years of faking it too that the focusing outside yourself is part of sex for you now.  It&amp;#39;s a habit you have to unlearn. &lt;/p&gt;\n\n&lt;p&gt;This is going to sound awful but I think in the beginning if you can close your eyes and kinda pretend they aren&amp;#39;t there as a person it can help. Obviously not what you want long term - but short term to get over the &amp;quot;hump&amp;quot;.   The first time I successful came with a partner we were spooning - manual stimulation which I could easily direct without talking - closed my eyes and just pretended I was alone.  Kinda bizarre I know. But once it happened once it got easier because it felt like I got past that mental block.  Then it expanded to oral and eventual to PIV. (Where I didn&amp;#39;t have to pretend to be alone lol) &lt;/p&gt;\n\n&lt;p&gt;Good luck. Treat this like a new skill. Like you&amp;#39;re going from walking to running a marathon. You&amp;#39;re unlearning an old habit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg66j0j", "score_hidden": false, "stickied": false, "created": 1492045841.0, "created_utc": 1492017041.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg7j9yq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6zpqv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thank you! Very very helpful. I have tried to remember in what way I tense when I masturbate and try to transfer it but haven't been successful yet! It's still early days as for a long time I didn't even bother trying anymore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! Very very helpful. I have tried to remember in what way I tense when I masturbate and try to transfer it but haven&amp;#39;t been successful yet! It&amp;#39;s still early days as for a long time I didn&amp;#39;t even bother trying anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7j9yq", "score_hidden": false, "stickied": false, "created": 1492118813.0, "created_utc": 1492090013.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6zpqv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lavalamploser", "parent_id": "t1_dg643al", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'll add, in my experience it works best to \"pulse\" your kegels when you are being eaten out or teased and tense or grind your hips otherwise. Especially during foreplay, etc. Mentally this puts me more in the mood, and physically it increases blood flow to the area making everything more sensitive. \n\nAlso on a side note, start  explicitly recapping to your partner what your favorite part was after sex. This will help him learn what you truly like, and say you don't manage to orgasm, at least he gets a boost from knowing that one part was great and he should do that more. \n\nAlso, try spontaneous sex when you wouldn't normally go at it, maybe you won't feel as nervous to \"get on stage\" if you aren't anticipating it. Perhaps you like when he teases you sexually while you're reading something, and try to keep focusing on reading for as long as possible(talk to him first to tell him you'll do this). \n\nGood luck :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll add, in my experience it works best to &amp;quot;pulse&amp;quot; your kegels when you are being eaten out or teased and tense or grind your hips otherwise. Especially during foreplay, etc. Mentally this puts me more in the mood, and physically it increases blood flow to the area making everything more sensitive. &lt;/p&gt;\n\n&lt;p&gt;Also on a side note, start  explicitly recapping to your partner what your favorite part was after sex. This will help him learn what you truly like, and say you don&amp;#39;t manage to orgasm, at least he gets a boost from knowing that one part was great and he should do that more. &lt;/p&gt;\n\n&lt;p&gt;Also, try spontaneous sex when you wouldn&amp;#39;t normally go at it, maybe you won&amp;#39;t feel as nervous to &amp;quot;get on stage&amp;quot; if you aren&amp;#39;t anticipating it. Perhaps you like when he teases you sexually while you&amp;#39;re reading something, and try to keep focusing on reading for as long as possible(talk to him first to tell him you&amp;#39;ll do this). &lt;/p&gt;\n\n&lt;p&gt;Good luck :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6zpqv", "score_hidden": false, "stickied": false, "created": 1492078889.0, "created_utc": 1492050089.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg643al", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg5zbcv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Tensing! Thank you so much I will try it. \nI'd like to clarify that I don't expect to ever orgasm from PiV alone.\nYou're right, I feel like I've gone too far in my own head to get back out again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tensing! Thank you so much I will try it. \nI&amp;#39;d like to clarify that I don&amp;#39;t expect to ever orgasm from PiV alone.\nYou&amp;#39;re right, I feel like I&amp;#39;ve gone too far in my own head to get back out again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg643al", "score_hidden": false, "stickied": false, "created": 1492043323.0, "created_utc": 1492014523.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zbcv", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "Oneforthegold", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm not sure relax is the best advice. I had the same issue climaxing with a partner. I read an article about \"tension\" being the key. (Tensing muscles in your pelvis/butt/legs/stomach/ etc.  and eventually that worked for me. (And as a side note made solo organisms take &lt;2 minutes from start to finish if I want a quickie)  Try the tension thing when solo and then try to incorporate it into oral with your SO and then PIV.  Took a while to get the \"feel\" for it but now it's not difficult. \n\n(As a side note I also added a small vibrator for stimulation with PIV in the beginning which helped too). You're probably overthinking it too much now.  Too much pressure is a orgasm killer. \n\nETA: PIV without extra stimulation had never made me orgasm. It might not for you either. You're not defective. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure relax is the best advice. I had the same issue climaxing with a partner. I read an article about &amp;quot;tension&amp;quot; being the key. (Tensing muscles in your pelvis/butt/legs/stomach/ etc.  and eventually that worked for me. (And as a side note made solo organisms take &amp;lt;2 minutes from start to finish if I want a quickie)  Try the tension thing when solo and then try to incorporate it into oral with your SO and then PIV.  Took a while to get the &amp;quot;feel&amp;quot; for it but now it&amp;#39;s not difficult. &lt;/p&gt;\n\n&lt;p&gt;(As a side note I also added a small vibrator for stimulation with PIV in the beginning which helped too). You&amp;#39;re probably overthinking it too much now.  Too much pressure is a orgasm killer. &lt;/p&gt;\n\n&lt;p&gt;ETA: PIV without extra stimulation had never made me orgasm. It might not for you either. You&amp;#39;re not defective. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5zbcv", "score_hidden": false, "stickied": false, "created": 1492038127.0, "created_utc": 1492009327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 43}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg7krx3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7c4i2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is going to sound ridiculous but one thing I do know is to orgasm on my own my brain needs to be radio silence, static. So any outside stimulation be it visual or otherwise just puts me off! So I've never fantasised as such but will give it a go thanks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is going to sound ridiculous but one thing I do know is to orgasm on my own my brain needs to be radio silence, static. So any outside stimulation be it visual or otherwise just puts me off! So I&amp;#39;ve never fantasised as such but will give it a go thanks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7krx3", "score_hidden": false, "stickied": false, "created": 1492120777.0, "created_utc": 1492091977.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7c4i2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg64c0n", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7c4i2", "score_hidden": false, "stickied": false, "created": 1492103088.0, "created_utc": 1492074288.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6zu5s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lavalamploser", "parent_id": "t1_dg68iiw", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Maybe try having him dirty talk, or dirty talk to him. Switch positions a bunch, anything to keep your mind engaged in the here and now.\n\nI've also read on other threads similar to yours mindfulness and meditation are your friend, google them!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe try having him dirty talk, or dirty talk to him. Switch positions a bunch, anything to keep your mind engaged in the here and now.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also read on other threads similar to yours mindfulness and meditation are your friend, google them!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6zu5s", "score_hidden": false, "stickied": false, "created": 1492079041.0, "created_utc": 1492050241.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg68iiw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg67kyt", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sorry, I only mention weed because as I've endlessly googled my situation it comes up often as a method to chill the fuck out about it!\n\nHe doesn't try and rush me at all, he's patient as a saint, which makes me feel all the more pressured somehow. Like, he could do himself a serious strain injury or something if I let it go on indefinitely!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, I only mention weed because as I&amp;#39;ve endlessly googled my situation it comes up often as a method to chill the fuck out about it!&lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t try and rush me at all, he&amp;#39;s patient as a saint, which makes me feel all the more pressured somehow. Like, he could do himself a serious strain injury or something if I let it go on indefinitely!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg68iiw", "score_hidden": false, "stickied": false, "created": 1492047832.0, "created_utc": 1492019032.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67kyt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jayjayUKx", "parent_id": "t1_dg66q4j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Wasn't going to say weed - no expert there to be honest. \n\nI've known a few women that say exactly the same thing about getting oral, like they feel pressure to cum quickly which stops it happening.  Obviously you need to just know he's not trying to rush you. Have you tried him lying on his back and sittin on his face? Maybe you have a bit more control where his tongue hits. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wasn&amp;#39;t going to say weed - no expert there to be honest. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve known a few women that say exactly the same thing about getting oral, like they feel pressure to cum quickly which stops it happening.  Obviously you need to just know he&amp;#39;s not trying to rush you. Have you tried him lying on his back and sittin on his face? Maybe you have a bit more control where his tongue hits. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg67kyt", "score_hidden": false, "stickied": false, "created": 1492046897.0, "created_utc": 1492018097.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg7lol1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7k07q", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I suppose maybe I didn't try hard enough. I'm not sure if I've been truly and categorically relaxed for years, being an adult with a job and mortgage is stressful even when your pants are down! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suppose maybe I didn&amp;#39;t try hard enough. I&amp;#39;m not sure if I&amp;#39;ve been truly and categorically relaxed for years, being an adult with a job and mortgage is stressful even when your pants are down! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7lol1", "score_hidden": false, "stickied": false, "created": 1492121907.0, "created_utc": 1492093107.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k07q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hunnybunny6", "parent_id": "t1_dg7jf53", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Ok, well have you try doing more relaxing thing like all over body massages and stuff like that before to make you relax. I find the trick to orgasms is to be in the moment and relax, yes easier said than done but maybe of you did more relaxing stuff before, you might find it easier to relax during. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok, well have you try doing more relaxing thing like all over body massages and stuff like that before to make you relax. I find the trick to orgasms is to be in the moment and relax, yes easier said than done but maybe of you did more relaxing stuff before, you might find it easier to relax during. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7k07q", "score_hidden": false, "stickied": false, "created": 1492119788.0, "created_utc": 1492090988.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jf53", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7g1vt", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Ha! I have tasted via kissing after oral and didn't care for it! \n\nI try to focus but my mind just won't ever shut up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ha! I have tasted via kissing after oral and didn&amp;#39;t care for it! &lt;/p&gt;\n\n&lt;p&gt;I try to focus but my mind just won&amp;#39;t ever shut up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7jf53", "score_hidden": false, "stickied": false, "created": 1492119008.0, "created_utc": 1492090208.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7g1vt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Hunnybunny6", "parent_id": "t1_dg66q4j", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Have you tasted yourself? I know weird, but if you worry about that, maybe see what it is like. \nGirls generally take longer, tho some guys can take a long time too, so I won't worry about that. What I do is do it in a dim room, no high intense lights, close my eyes and force on what his doing to you, don't think about anything else but what he doing to you, how he's tongue moves, where his hands are etc.... Works for me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tasted yourself? I know weird, but if you worry about that, maybe see what it is like. \nGirls generally take longer, tho some guys can take a long time too, so I won&amp;#39;t worry about that. What I do is do it in a dim room, no high intense lights, close my eyes and force on what his doing to you, don&amp;#39;t think about anything else but what he doing to you, how he&amp;#39;s tongue moves, where his hands are etc.... Works for me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7g1vt", "score_hidden": false, "stickied": false, "created": 1492113612.0, "created_utc": 1492084812.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66q4j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg66a2l", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It's not that it doesn't feel good I can just tell it wouldn't get me over the finish line. \nCould potentially be because my inner monologue goes something along the lines of 'I wonder how long it's been, his neck much hurt from there, it can't taste great, I'm taking ages, can he breathe?...' \nBless him, I know he's fine and would go forever if I let him it's just you know, shut up brain.\n\nAlso before anyone says try smoking weed, that's a past time lol ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not that it doesn&amp;#39;t feel good I can just tell it wouldn&amp;#39;t get me over the finish line. \nCould potentially be because my inner monologue goes something along the lines of &amp;#39;I wonder how long it&amp;#39;s been, his neck much hurt from there, it can&amp;#39;t taste great, I&amp;#39;m taking ages, can he breathe?...&amp;#39; \nBless him, I know he&amp;#39;s fine and would go forever if I let him it&amp;#39;s just you know, shut up brain.&lt;/p&gt;\n\n&lt;p&gt;Also before anyone says try smoking weed, that&amp;#39;s a past time lol &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg66q4j", "score_hidden": false, "stickied": false, "created": 1492046039.0, "created_utc": 1492017239.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66a2l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jayjayUKx", "parent_id": "t1_dg65zb2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Haha, well that covers the obvious :) So even when he tries oral it's not even starting to feel good so doing it longer wouldn't get anywhere?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, well that covers the obvious :) So even when he tries oral it&amp;#39;s not even starting to feel good so doing it longer wouldn&amp;#39;t get anywhere?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg66a2l", "score_hidden": false, "stickied": false, "created": 1492045586.0, "created_utc": 1492016786.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65zb2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg65q7g", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Not even slightly, I don't think I do a weird face or anything (not that anyone would be able to verify that) At least if that was my problem I could just say don't look! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not even slightly, I don&amp;#39;t think I do a weird face or anything (not that anyone would be able to verify that) At least if that was my problem I could just say don&amp;#39;t look! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg65zb2", "score_hidden": false, "stickied": false, "created": 1492045284.0, "created_utc": 1492016484.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg65q7g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jayjayUKx", "parent_id": "t1_dg64c0n", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Are you kind of self-concious of how you'll look when you orgasm with him for the first time? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you kind of self-concious of how you&amp;#39;ll look when you orgasm with him for the first time? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg65q7g", "score_hidden": false, "stickied": false, "created": 1492045025.0, "created_utc": 1492016225.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64c0n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg60g1y", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm looking for someone to tell me how to get out my head! \nI have all the vibes in the world I'm afraid, he uses them on me, I use them during other acts in exactly the same way I would while alone but I just have this block.", "edited": 1492015123.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m looking for someone to tell me how to get out my head! \nI have all the vibes in the world I&amp;#39;m afraid, he uses them on me, I use them during other acts in exactly the same way I would while alone but I just have this block.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg64c0n", "score_hidden": false, "stickied": false, "created": 1492043577.0, "created_utc": 1492014777.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60g1y", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Kit4000", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It sounds like you aren in your own head with a partner and creating barriers for yourself. Try introducing a small vibe during sex to start. But try not to focus on the orgasm. Just try to enjoy sex and stay in the moment as much as possible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you aren in your own head with a partner and creating barriers for yourself. Try introducing a small vibe during sex to start. But try not to focus on the orgasm. Just try to enjoy sex and stay in the moment as much as possible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg60g1y", "score_hidden": false, "stickied": false, "created": 1492039383.0, "created_utc": 1492010583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6i435", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6g09g", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thank you! Every 'it's getting better' story gives me hope! I spent a long time thinking that this was what sex and my life would be like. You make me believe!\n\nI'm lucky I have a BF that will be as supportive as yours, God bless the women with uncooperative men! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! Every &amp;#39;it&amp;#39;s getting better&amp;#39; story gives me hope! I spent a long time thinking that this was what sex and my life would be like. You make me believe!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m lucky I have a BF that will be as supportive as yours, God bless the women with uncooperative men! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6i435", "score_hidden": false, "stickied": false, "created": 1492057673.0, "created_utc": 1492028873.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6g09g", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "sexytimecrazyeyes", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I had this trouble too! I'm still working on being comfortable enough with my partner to come by his hand (or mouth), and it still takes longer than masturbating. But! I found a trick that seems to work. \n\nBasically, I started to masturbate in front of him, with him playing with my breasts and an understanding ahead of time that I probably won't come, that I'm just doing this to feel good. Doing that enough allowed me to feel comfortable enough to climax on my own. I made note of what fantasies worked, and what tensing I needed to do to escape enough into my own head to make it happen. \n\nThen, we graduated to him rubbing my clit while lying next to me. Again, just doing it to feel good, no expectations. But! When I started to feel like we were getting somewhere, I'd start the process as if I were getting myself off, effectively tricking my brain into it. This included actually rubbing my finger either on my leg or on my bed, the way I would if I were rubbing my clit. That let me somewhat trick my brain into thinking I was controlling the experience, and though it still takes longer, I can come about 50% of the time this way. Yeah, it's not every time, but that's still waaay better than zero. \n\nWe've graduated to me coming from oral, but only because he emphasised repeatedly that it was okay to sit back and enjoy it. Six months and we just now got there! But, I'm 30, and I'm glad I finally have a partner so willing to reassure me and make me feel comfortable. \n\nAnd for me, that's the biggest key: he can't look at this like something he has to do to prove himself. Lots of patience and reassurance and acceptance of where I was at that point were far bigger factors than his technique. Reassurance that he thought my pussy looked, felt, and tasted good helped me to not be so afraid, and that let me relax enough to come. If you feel self conscious of what he thinks, then of course it's going to be difficult!\n\nSo I think it's less about relaxing your body, as it is relaxing your mind and building that trust. \n\nYou can do it! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had this trouble too! I&amp;#39;m still working on being comfortable enough with my partner to come by his hand (or mouth), and it still takes longer than masturbating. But! I found a trick that seems to work. &lt;/p&gt;\n\n&lt;p&gt;Basically, I started to masturbate in front of him, with him playing with my breasts and an understanding ahead of time that I probably won&amp;#39;t come, that I&amp;#39;m just doing this to feel good. Doing that enough allowed me to feel comfortable enough to climax on my own. I made note of what fantasies worked, and what tensing I needed to do to escape enough into my own head to make it happen. &lt;/p&gt;\n\n&lt;p&gt;Then, we graduated to him rubbing my clit while lying next to me. Again, just doing it to feel good, no expectations. But! When I started to feel like we were getting somewhere, I&amp;#39;d start the process as if I were getting myself off, effectively tricking my brain into it. This included actually rubbing my finger either on my leg or on my bed, the way I would if I were rubbing my clit. That let me somewhat trick my brain into thinking I was controlling the experience, and though it still takes longer, I can come about 50% of the time this way. Yeah, it&amp;#39;s not every time, but that&amp;#39;s still waaay better than zero. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve graduated to me coming from oral, but only because he emphasised repeatedly that it was okay to sit back and enjoy it. Six months and we just now got there! But, I&amp;#39;m 30, and I&amp;#39;m glad I finally have a partner so willing to reassure me and make me feel comfortable. &lt;/p&gt;\n\n&lt;p&gt;And for me, that&amp;#39;s the biggest key: he can&amp;#39;t look at this like something he has to do to prove himself. Lots of patience and reassurance and acceptance of where I was at that point were far bigger factors than his technique. Reassurance that he thought my pussy looked, felt, and tasted good helped me to not be so afraid, and that let me relax enough to come. If you feel self conscious of what he thinks, then of course it&amp;#39;s going to be difficult!&lt;/p&gt;\n\n&lt;p&gt;So I think it&amp;#39;s less about relaxing your body, as it is relaxing your mind and building that trust. &lt;/p&gt;\n\n&lt;p&gt;You can do it! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6g09g", "score_hidden": false, "stickied": false, "created": 1492055519.0, "created_utc": 1492026719.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg64om4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ProfessorX_X_X", "parent_id": "t1_dg64940", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Tell him the same thing. Stop worrying about orgasm, start having fun. Orgasms aren't even needed. There's more to sex than a few seconds of pleasure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell him the same thing. Stop worrying about orgasm, start having fun. Orgasms aren&amp;#39;t even needed. There&amp;#39;s more to sex than a few seconds of pleasure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg64om4", "score_hidden": false, "stickied": false, "created": 1492043944.0, "created_utc": 1492015144.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64940", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg5zwml", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "The problem is, I spent a long long time not thinking or worrying about it, directing my partner appropriately. \nNow I get the added fun of being asked every second 'like this?' while being watched! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The problem is, I spent a long long time not thinking or worrying about it, directing my partner appropriately. \nNow I get the added fun of being asked every second &amp;#39;like this?&amp;#39; while being watched! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg64940", "score_hidden": false, "stickied": false, "created": 1492043493.0, "created_utc": 1492014693.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg7jnln", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6lbf3", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I've been trying to become comfortable in my skin. I've always wanted to hide away my nakedness which is probably ingrained misogyny. Actually that's probably the crux of the whole issue. Never felt like sex was for ME. \nThank you for your advice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been trying to become comfortable in my skin. I&amp;#39;ve always wanted to hide away my nakedness which is probably ingrained misogyny. Actually that&amp;#39;s probably the crux of the whole issue. Never felt like sex was for ME. \nThank you for your advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7jnln", "score_hidden": false, "stickied": false, "created": 1492119320.0, "created_utc": 1492090520.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6lbf3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "morrah", "parent_id": "t1_dg6izwa", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I get you, I do the same thing (with the boners and the head stuff).. I honestly did find that being able to relax and focus on feeling your body outside of a sex situation helped me do that during oral as well. I just have to consciously put myself there when I realize I'm wandering. Give it a shot, worst case scenario it doesn't work and you have this weird head thing you tried :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get you, I do the same thing (with the boners and the head stuff).. I honestly did find that being able to relax and focus on feeling your body outside of a sex situation helped me do that during oral as well. I just have to consciously put myself there when I realize I&amp;#39;m wandering. Give it a shot, worst case scenario it doesn&amp;#39;t work and you have this weird head thing you tried :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6lbf3", "score_hidden": false, "stickied": false, "created": 1492061202.0, "created_utc": 1492032402.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6izwa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6ccnn", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "What you say about the -ahem- added extras for him is totally right but I get a bit preoccupied knowing there's a massive boner in the room!! Like, okay pass it here lol.\n\nI'm not however sure the visual stuff will work for me as what's overwhelmingly distracting me is what's inside my own head. I need earplugs for my mind!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What you say about the -ahem- added extras for him is totally right but I get a bit preoccupied knowing there&amp;#39;s a massive boner in the room!! Like, okay pass it here lol.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not however sure the visual stuff will work for me as what&amp;#39;s overwhelmingly distracting me is what&amp;#39;s inside my own head. I need earplugs for my mind!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6izwa", "score_hidden": false, "stickied": false, "created": 1492058599.0, "created_utc": 1492029799.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dganfb9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "morrah", "parent_id": "t1_dgalowa", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is super interesting (and exciting)! I have a fairly strong family history of adhd, and while I realized a few years ago I was letting my mind wander during sex, I never even considered it could be something like adhd! I know I wouldn't meet a clinical diagnosis, but I'm curious if some other coping strategies for adhd would help me out.  I'm glad my random ideas might help you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is super interesting (and exciting)! I have a fairly strong family history of adhd, and while I realized a few years ago I was letting my mind wander during sex, I never even considered it could be something like adhd! I know I wouldn&amp;#39;t meet a clinical diagnosis, but I&amp;#39;m curious if some other coping strategies for adhd would help me out.  I&amp;#39;m glad my random ideas might help you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dganfb9", "score_hidden": false, "stickied": false, "created": 1492292383.0, "created_utc": 1492263583.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgalowa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lns120", "parent_id": "t1_dg6ccnn", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Oh holy shit, you just lead me to the realization that my ADHD, and not making appropriate accommodations for it, is probably a big factor in orgasming when I'm not by myself. I knew my anxiety was a factor but I'd never made that connection before. I'm saving this stat! Thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh holy shit, you just lead me to the realization that my ADHD, and not making appropriate accommodations for it, is probably a big factor in orgasming when I&amp;#39;m not by myself. I knew my anxiety was a factor but I&amp;#39;d never made that connection before. I&amp;#39;m saving this stat! Thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgalowa", "score_hidden": false, "stickied": false, "created": 1492288888.0, "created_utc": 1492260088.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ccnn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "morrah", "parent_id": "t1_dg5zwml", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm gonna suggest a weird thing in line with this. Bear (bare?) with me. \n\n\nDo some body awareness/mindfulness guided meditation stuff. Figure out how to focus on one piece of your body while also being relaxed. Then, get your boyfriend to go down on you, or use a vibrator, or whatever, while you're blindfolded or otherwise have no visual input - not just the lights out though. Focus on the feeling of what's actually happening to you, and ignore all the sounds and peripheral stuff. Let your body respond to the things that feel good - without adding anything extra to make your guy feel better - and let him follow your body language until he figures out what works for you. That'll cut out the \"how about that\" and the distraction of trying to communicate. Basically you want to make the oral sex stimulus (or whatever you're doing) the *only* thing you feel, with no verbal or visual stuff to compete. Try that a couple of separate times until you can firmly establish if you're getting anywhere or not. I'm guessing, but once you get past the mental block of another person in one way, it should open up other options. \n\n\nSource: I get really distracted by all the visual stimuli around me during sex, particularly oral, and just being out of the right focus makes it impossible to get anywhere with it. Closing my eyes or a blanket over my head made the experience infinitely better. I didn't figure out why oral was so mediocre  for me until I was mid twenties.. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m gonna suggest a weird thing in line with this. Bear (bare?) with me. &lt;/p&gt;\n\n&lt;p&gt;Do some body awareness/mindfulness guided meditation stuff. Figure out how to focus on one piece of your body while also being relaxed. Then, get your boyfriend to go down on you, or use a vibrator, or whatever, while you&amp;#39;re blindfolded or otherwise have no visual input - not just the lights out though. Focus on the feeling of what&amp;#39;s actually happening to you, and ignore all the sounds and peripheral stuff. Let your body respond to the things that feel good - without adding anything extra to make your guy feel better - and let him follow your body language until he figures out what works for you. That&amp;#39;ll cut out the &amp;quot;how about that&amp;quot; and the distraction of trying to communicate. Basically you want to make the oral sex stimulus (or whatever you&amp;#39;re doing) the &lt;em&gt;only&lt;/em&gt; thing you feel, with no verbal or visual stuff to compete. Try that a couple of separate times until you can firmly establish if you&amp;#39;re getting anywhere or not. I&amp;#39;m guessing, but once you get past the mental block of another person in one way, it should open up other options. &lt;/p&gt;\n\n&lt;p&gt;Source: I get really distracted by all the visual stimuli around me during sex, particularly oral, and just being out of the right focus makes it impossible to get anywhere with it. Closing my eyes or a blanket over my head made the experience infinitely better. I didn&amp;#39;t figure out why oral was so mediocre  for me until I was mid twenties.. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6ccnn", "score_hidden": false, "stickied": false, "created": 1492051747.0, "created_utc": 1492022947.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5zwml", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ProfessorX_X_X", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Why not just stop worrying about orgasm in the first place. You're so worried about if a goal will happen that you're missing the fun of right now. \n\nI saw a quote once that said:\n\n\"Anxiety = thinking too hard about the future\"\n\nI think that's you. Stop worrying about if you will or won't orgasm and instead learn to seek pleasure. Ironically if you do that you'll likely orgasm. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why not just stop worrying about orgasm in the first place. You&amp;#39;re so worried about if a goal will happen that you&amp;#39;re missing the fun of right now. &lt;/p&gt;\n\n&lt;p&gt;I saw a quote once that said:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Anxiety = thinking too hard about the future&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I think that&amp;#39;s you. Stop worrying about if you will or won&amp;#39;t orgasm and instead learn to seek pleasure. Ironically if you do that you&amp;#39;ll likely orgasm. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg5zwml", "score_hidden": false, "stickied": false, "created": 1492038788.0, "created_utc": 1492009988.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6j1n0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg69go2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I regularly smoke and no difference :(", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I regularly smoke and no difference :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6j1n0", "score_hidden": false, "stickied": false, "created": 1492058650.0, "created_utc": 1492029850.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69go2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Leaheastwick", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I had this same problem. I could orgasm alone, with or without toys, no problem, but not with a partner. For years! I was eventually able to relax enough to orgasm with a partner from time to time, but I didn't start regularly orgasming with a partner until I found something that helped me relax from within: weed. I live in a place where weed is legal, so it's NBD. Weed helped me learn how to ignore the critical/self-conscious/eager to perform part of my brain and focus on sensation during sex, which allowed me to relax (finally). Now I'm able to get to that brain space without medicinal help too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had this same problem. I could orgasm alone, with or without toys, no problem, but not with a partner. For years! I was eventually able to relax enough to orgasm with a partner from time to time, but I didn&amp;#39;t start regularly orgasming with a partner until I found something that helped me relax from within: weed. I live in a place where weed is legal, so it&amp;#39;s NBD. Weed helped me learn how to ignore the critical/self-conscious/eager to perform part of my brain and focus on sensation during sex, which allowed me to relax (finally). Now I&amp;#39;m able to get to that brain space without medicinal help too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg69go2", "score_hidden": false, "stickied": false, "created": 1492048787.0, "created_utc": 1492019987.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg67cc9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "uncle_doob", "parent_id": "t1_dg676yg", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yea I could totally see that...sorry I don't have anything constructive to say to help haha...I was just commenting on impulse,but I hope you figure it out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea I could totally see that...sorry I don&amp;#39;t have anything constructive to say to help haha...I was just commenting on impulse,but I hope you figure it out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg67cc9", "score_hidden": false, "stickied": false, "created": 1492046659.0, "created_utc": 1492017859.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg676yg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg668wp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "That is, in a nut shell, how my whole situation started and then snowballed!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is, in a nut shell, how my whole situation started and then snowballed!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg676yg", "score_hidden": false, "stickied": false, "created": 1492046511.0, "created_utc": 1492017711.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg668wp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "uncle_doob", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm a man, and I've faked a few o's so my partner in crime wouldn't feel bad( anytime I couldn't finish, whether it be alcohol related or not, she would get super self-conscious about herself) so I figured that was the best solution...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a man, and I&amp;#39;ve faked a few o&amp;#39;s so my partner in crime wouldn&amp;#39;t feel bad( anytime I couldn&amp;#39;t finish, whether it be alcohol related or not, she would get super self-conscious about herself) so I figured that was the best solution...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg668wp", "score_hidden": false, "stickied": false, "created": 1492045554.0, "created_utc": 1492016754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6hovs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6cx8o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Legalities aside, I do smoke pot. We smoke together most days off work so we've had sex during all degrees of highness with no avail. \n\nI love the sensory deprivation suggestion, I think the first step will have to be with him blindfolded ect! \n\nI tried to make it as clear as possible to him that no other guy could and that he is the closest anyone ever got, which is true. At this stage I'm not sure Russell Brand would know enough to 'help me' so performance issue on his part isn't questioned at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Legalities aside, I do smoke pot. We smoke together most days off work so we&amp;#39;ve had sex during all degrees of highness with no avail. &lt;/p&gt;\n\n&lt;p&gt;I love the sensory deprivation suggestion, I think the first step will have to be with him blindfolded ect! &lt;/p&gt;\n\n&lt;p&gt;I tried to make it as clear as possible to him that no other guy could and that he is the closest anyone ever got, which is true. At this stage I&amp;#39;m not sure Russell Brand would know enough to &amp;#39;help me&amp;#39; so performance issue on his part isn&amp;#39;t questioned at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6hovs", "score_hidden": false, "stickied": false, "created": 1492057250.0, "created_utc": 1492028450.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cx8o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MrZeeBud", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": " As others have noted, the fact that you can get yourself off means that this must be a psychological block (so, YAY! You are capable of orgasm and getting past this!).  Most likely, once you finally find your way over the hump once or twice, it'll become much easier.  Two suggestions:\n\n1) Is pot legal where you are?  Have you tried smoking before sex?  People react differently to pot, so YMMV, but many people experience heightened sexual sensation and relaxation when smoking.  I'm not saying to get yourself totally baked, but a little bit of a high may work wonders.\n\n2) this is a suggestion I just posted to a different sex question, so I'll just copy and paste...\nsensory deprivation: get a blindfold, headphones, and an ambient sound app.  Sit in a comfy chair, blindfold on, and headphones on listening to whatever ambient sounds you likes (I like thunderstorms, rainstorms, the ocean, or a crackling fire).  Sit back and relax while he does oral/manual/toys on you.  Again, this setting may help you relax and just enjoy the sensations.\n\nEdit:  it sounds like you two are already on this path, but just in case... Does your BF knows that *nobody* (except you) has ever gotten you off?  If I was in your BF's situation, it would really help my ego to know that it isn't that my performance is lacking, but that this is an issue that you have always had... and for you both to turn this into a fun problem solving challenge, rather than a \"problem\".", "edited": 1492024112.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As others have noted, the fact that you can get yourself off means that this must be a psychological block (so, YAY! You are capable of orgasm and getting past this!).  Most likely, once you finally find your way over the hump once or twice, it&amp;#39;ll become much easier.  Two suggestions:&lt;/p&gt;\n\n&lt;p&gt;1) Is pot legal where you are?  Have you tried smoking before sex?  People react differently to pot, so YMMV, but many people experience heightened sexual sensation and relaxation when smoking.  I&amp;#39;m not saying to get yourself totally baked, but a little bit of a high may work wonders.&lt;/p&gt;\n\n&lt;p&gt;2) this is a suggestion I just posted to a different sex question, so I&amp;#39;ll just copy and paste...\nsensory deprivation: get a blindfold, headphones, and an ambient sound app.  Sit in a comfy chair, blindfold on, and headphones on listening to whatever ambient sounds you likes (I like thunderstorms, rainstorms, the ocean, or a crackling fire).  Sit back and relax while he does oral/manual/toys on you.  Again, this setting may help you relax and just enjoy the sensations.&lt;/p&gt;\n\n&lt;p&gt;Edit:  it sounds like you two are already on this path, but just in case... Does your BF knows that &lt;em&gt;nobody&lt;/em&gt; (except you) has ever gotten you off?  If I was in your BF&amp;#39;s situation, it would really help my ego to know that it isn&amp;#39;t that my performance is lacking, but that this is an issue that you have always had... and for you both to turn this into a fun problem solving challenge, rather than a &amp;quot;problem&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6cx8o", "score_hidden": false, "stickied": false, "created": 1492052342.0, "created_utc": 1492023542.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6j8ef", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6iuhg", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It's not something that will expire so who knows, you've got decades left in life! \nYou're preaching to the choir about body issues here... Is anyone ever happy with how they look? I just tell myself that and try to suck it up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not something that will expire so who knows, you&amp;#39;ve got decades left in life! \nYou&amp;#39;re preaching to the choir about body issues here... Is anyone ever happy with how they look? I just tell myself that and try to suck it up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6j8ef", "score_hidden": false, "stickied": false, "created": 1492058850.0, "created_utc": 1492030050.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6iuhg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg6hr72", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6iuhg", "score_hidden": false, "stickied": false, "created": 1492058444.0, "created_utc": 1492029644.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hr72", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6dfv7", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thank you so much. I sincerely hope if you keep trying you'll get there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. I sincerely hope if you keep trying you&amp;#39;ll get there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6hr72", "score_hidden": false, "stickied": false, "created": 1492057313.0, "created_utc": 1492028513.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dfv7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6dfv7", "score_hidden": false, "stickied": false, "created": 1492052887.0, "created_utc": 1492024087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6hski", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6dy4p", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "'Twas a little on the sore side for me the times we tried!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#39;Twas a little on the sore side for me the times we tried!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6hski", "score_hidden": false, "stickied": false, "created": 1492057351.0, "created_utc": 1492028551.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dy4p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "twitterfly23", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You aren't defective!! This could be a little much, but try anal. I was so happy and amazed that anal felt so similar to vaginal to me, but with even more pleasure.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You aren&amp;#39;t defective!! This could be a little much, but try anal. I was so happy and amazed that anal felt so similar to vaginal to me, but with even more pleasure.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6dy4p", "score_hidden": false, "stickied": false, "created": 1492053405.0, "created_utc": 1492024605.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6iijq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6bd88", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I've put the book in my Amazon basket, thank you for the recommendation.\n\nI've actually thought about the 'gradually get nearer plan' but putting it into action has been difficult so far. I'm English and it's a bank(public? If you're American) holiday over the weekend so we'll have a few days off work together! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve put the book in my Amazon basket, thank you for the recommendation.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve actually thought about the &amp;#39;gradually get nearer plan&amp;#39; but putting it into action has been difficult so far. I&amp;#39;m English and it&amp;#39;s a bank(public? If you&amp;#39;re American) holiday over the weekend so we&amp;#39;ll have a few days off work together! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6iijq", "score_hidden": false, "stickied": false, "created": 1492058097.0, "created_utc": 1492029297.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6bd88", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jjcatt", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Other people have given great advice too but you might want to try the step by step guide I read once in a book (think it was the Nagoski book):\n\nFirst masturbate to climax with your partner outside the room. When you can do that, he can be in the room next time but far away And not facing you. Once that works, he can come closer, still not looking. Then you progress to him looking. Then him lying beside you. Then him touching your arm or leg while you climax. Then he touches you more intimately, etc.\n\nThe key is don't move to the next step until you can climax at your current step. You are totally retraining yourself and you have to be patient about it. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other people have given great advice too but you might want to try the step by step guide I read once in a book (think it was the Nagoski book):&lt;/p&gt;\n\n&lt;p&gt;First masturbate to climax with your partner outside the room. When you can do that, he can be in the room next time but far away And not facing you. Once that works, he can come closer, still not looking. Then you progress to him looking. Then him lying beside you. Then him touching your arm or leg while you climax. Then he touches you more intimately, etc.&lt;/p&gt;\n\n&lt;p&gt;The key is don&amp;#39;t move to the next step until you can climax at your current step. You are totally retraining yourself and you have to be patient about it. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6bd88", "score_hidden": false, "stickied": false, "created": 1492050740.0, "created_utc": 1492021940.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg7wcwg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7w414", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "No no, I got ya :) I should have used these \"\"\nI'd be thrilled if that situation worked! \n\nYeah, one might refer to my boyfriend and I as stoners... So it's certainly been tested once or 100 times. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No no, I got ya :) I should have used these &amp;quot;&amp;quot;\nI&amp;#39;d be thrilled if that situation worked! &lt;/p&gt;\n\n&lt;p&gt;Yeah, one might refer to my boyfriend and I as stoners... So it&amp;#39;s certainly been tested once or 100 times. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7wcwg", "score_hidden": false, "stickied": false, "created": 1492133499.0, "created_utc": 1492104699.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7w414", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stink3rbelle", "parent_id": "t1_dg7vjho", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I didn't mean cheating on a person, I just mean some people would consider it not \"really\" about the partner if you're touching yourself.\n\nHave you ever tried marijuana? Often helps people loosen up sexually.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t mean cheating on a person, I just mean some people would consider it not &amp;quot;really&amp;quot; about the partner if you&amp;#39;re touching yourself.&lt;/p&gt;\n\n&lt;p&gt;Have you ever tried marijuana? Often helps people loosen up sexually.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7w414", "score_hidden": false, "stickied": false, "created": 1492133235.0, "created_utc": 1492104435.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7vjho", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7ojew", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah that bad news is pretty apparent lol. \nI think as we know it isn't a physical issues, even having it happen once means my psychological barrier has been breeched and I'll feel less, well, hopeless. \n\nIt's outrageous someone could consider touching yourself during sex cheating. I've never met a woman who can get off from inside action alone! We're well aware of the mechanics it's just for some reason the right actions aren't having the desired outcome yet. Friggin mental block. I wish alcohol didn't totally deaden my nerve endings because I'd be chill AF. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah that bad news is pretty apparent lol. \nI think as we know it isn&amp;#39;t a physical issues, even having it happen once means my psychological barrier has been breeched and I&amp;#39;ll feel less, well, hopeless. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s outrageous someone could consider touching yourself during sex cheating. I&amp;#39;ve never met a woman who can get off from inside action alone! We&amp;#39;re well aware of the mechanics it&amp;#39;s just for some reason the right actions aren&amp;#39;t having the desired outcome yet. Friggin mental block. I wish alcohol didn&amp;#39;t totally deaden my nerve endings because I&amp;#39;d be chill AF. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7vjho", "score_hidden": false, "stickied": false, "created": 1492132630.0, "created_utc": 1492103830.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ojew", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stink3rbelle", "parent_id": "t1_dg7k2m4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; I want to just once be able to enjoy it as much as he does.\n\nThere's good news and bad news about this. The bad news is that given your age and your subtle working for an orgasm with/from him before now, it's unlikely you'll stumble into an orgasm with/from him very easily. The good news is that once you figure out how to get there with him, you should be able to repeat it. That is, it's not going to be a one off once it happens. You mentioned that you've tried to masturbate in front of your partner, and I think that's a good thing to keep trying. You could also try to blindfold yourself or him to help you feel less on-view. You should also try to touch yourself during penetration. It may seem like \"cheating\" to some, but it's quite a different sensation from just masturbating, and it's also one of the most reliable ways women come from penetration. It's what I do most of the time with my partner, and after six months he recently tried taking over for me to great success.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I want to just once be able to enjoy it as much as he does.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There&amp;#39;s good news and bad news about this. The bad news is that given your age and your subtle working for an orgasm with/from him before now, it&amp;#39;s unlikely you&amp;#39;ll stumble into an orgasm with/from him very easily. The good news is that once you figure out how to get there with him, you should be able to repeat it. That is, it&amp;#39;s not going to be a one off once it happens. You mentioned that you&amp;#39;ve tried to masturbate in front of your partner, and I think that&amp;#39;s a good thing to keep trying. You could also try to blindfold yourself or him to help you feel less on-view. You should also try to touch yourself during penetration. It may seem like &amp;quot;cheating&amp;quot; to some, but it&amp;#39;s quite a different sensation from just masturbating, and it&amp;#39;s also one of the most reliable ways women come from penetration. It&amp;#39;s what I do most of the time with my partner, and after six months he recently tried taking over for me to great success.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7ojew", "score_hidden": false, "stickied": false, "created": 1492125160.0, "created_utc": 1492096360.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k2m4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6l5pr", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I wouldn't say I was unhappy with the sex no. I want to just once be able to enjoy it as much as he does. It's feel like a divide because frankly I'm jealous. I can only imagine how amazing it must be to be able to orgasm from someone else's actions.\n\nHaha yes you're right, hygiene is obviously something that needs mentioning but when it's something your partner can't change it would just be cruel. \n\nHe doesn't complain but I think if I heard the odd compliment here or there it would help. I have mentioned this and he'll tell me I'm beautiful but there's something about that word that means nothing to me. People say it about puppies. I wanna hear I have a nice arse or something less vague! \n\nI really appreciate your input thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t say I was unhappy with the sex no. I want to just once be able to enjoy it as much as he does. It&amp;#39;s feel like a divide because frankly I&amp;#39;m jealous. I can only imagine how amazing it must be to be able to orgasm from someone else&amp;#39;s actions.&lt;/p&gt;\n\n&lt;p&gt;Haha yes you&amp;#39;re right, hygiene is obviously something that needs mentioning but when it&amp;#39;s something your partner can&amp;#39;t change it would just be cruel. &lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t complain but I think if I heard the odd compliment here or there it would help. I have mentioned this and he&amp;#39;ll tell me I&amp;#39;m beautiful but there&amp;#39;s something about that word that means nothing to me. People say it about puppies. I wanna hear I have a nice arse or something less vague! &lt;/p&gt;\n\n&lt;p&gt;I really appreciate your input thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7k2m4", "score_hidden": false, "stickied": false, "created": 1492119873.0, "created_utc": 1492091073.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6l5pr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stink3rbelle", "parent_id": "t1_dg6jonw", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; I don't think he was expectant before hand because it was a given, he didn't have to worry about it because it just happened.\n\nExcept it didn't happen. You can ask him to make \"search for partnered O\" sessions a weekly, or bi-weekly thing, with \"let's just fuck like we used to\" sessions more frequent. You're not unhappy with the sex you've been having, right? You just want to try for an orgasm with him at some point? Take the pressure off yourself here. You don't have to orgasm right away, you don't have to cum for him *ever* in fact. You can enjoy sex, and he can enjoy sex, without your O.\n&gt; Yes he could have complained about any number of things but if he didn't look how I wanted him to, there's no way I would consider saying it and hurt his feelings and I expect the same in return. 'Ew your balls look ugly' equivalent?\n\nI was just trying to say that nothing's *changed* since before you told him. If you have constantly been worried about your body during sex for five years, then . . . you need to work on that outside of sex. Spend energy building yourself up. Learn to love your body. This guy has sex with you he clearly enjoys, he's not bothered by anything about your body. More than that, he's turned on and *into* your body or he wouldn't stick with you. And, for what it's worth, there are complaints that are worth bringing up in a polite way, mainly hygeinic issues (e.g. \"hey babe, you've got a bit of smegma, mind rinsing off quickly before we keep going here?\"). His lack of complaint should signal to you that there's nothing legit to worry about. And his being a nice guy you've known for five years should let you know that he's not an asshole secretly harboring complaints about your body, right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t think he was expectant before hand because it was a given, he didn&amp;#39;t have to worry about it because it just happened.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Except it didn&amp;#39;t happen. You can ask him to make &amp;quot;search for partnered O&amp;quot; sessions a weekly, or bi-weekly thing, with &amp;quot;let&amp;#39;s just fuck like we used to&amp;quot; sessions more frequent. You&amp;#39;re not unhappy with the sex you&amp;#39;ve been having, right? You just want to try for an orgasm with him at some point? Take the pressure off yourself here. You don&amp;#39;t have to orgasm right away, you don&amp;#39;t have to cum for him &lt;em&gt;ever&lt;/em&gt; in fact. You can enjoy sex, and he can enjoy sex, without your O.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Yes he could have complained about any number of things but if he didn&amp;#39;t look how I wanted him to, there&amp;#39;s no way I would consider saying it and hurt his feelings and I expect the same in return. &amp;#39;Ew your balls look ugly&amp;#39; equivalent?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I was just trying to say that nothing&amp;#39;s &lt;em&gt;changed&lt;/em&gt; since before you told him. If you have constantly been worried about your body during sex for five years, then . . . you need to work on that outside of sex. Spend energy building yourself up. Learn to love your body. This guy has sex with you he clearly enjoys, he&amp;#39;s not bothered by anything about your body. More than that, he&amp;#39;s turned on and &lt;em&gt;into&lt;/em&gt; your body or he wouldn&amp;#39;t stick with you. And, for what it&amp;#39;s worth, there are complaints that are worth bringing up in a polite way, mainly hygeinic issues (e.g. &amp;quot;hey babe, you&amp;#39;ve got a bit of smegma, mind rinsing off quickly before we keep going here?&amp;quot;). His lack of complaint should signal to you that there&amp;#39;s nothing legit to worry about. And his being a nice guy you&amp;#39;ve known for five years should let you know that he&amp;#39;s not an asshole secretly harboring complaints about your body, right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6l5pr", "score_hidden": false, "stickied": false, "created": 1492061017.0, "created_utc": 1492032217.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jonw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6j8os", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I in no way put any 'blame' on him for this situation. Physically he does all the A B C's for me. It's psychological.\n\nI don't think he was expectant before hand because it was a given, he didn't have to worry about it because it just happened. \n\nYes he could have complained about any number of things but if he didn't look how I wanted him to, there's no way I would consider saying it and hurt his feelings and I expect the same in return. 'Ew your balls look ugly' equivalent? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I in no way put any &amp;#39;blame&amp;#39; on him for this situation. Physically he does all the A B C&amp;#39;s for me. It&amp;#39;s psychological.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think he was expectant before hand because it was a given, he didn&amp;#39;t have to worry about it because it just happened. &lt;/p&gt;\n\n&lt;p&gt;Yes he could have complained about any number of things but if he didn&amp;#39;t look how I wanted him to, there&amp;#39;s no way I would consider saying it and hurt his feelings and I expect the same in return. &amp;#39;Ew your balls look ugly&amp;#39; equivalent? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6jonw", "score_hidden": false, "stickied": false, "created": 1492059335.0, "created_utc": 1492030535.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6j8os", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stink3rbelle", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;For years I figured with the right guidance and demonstrations I could make it happen for real and continue on from there but the big 'o' has remained elusive when connecting with another person.\nI've been with my current partner for 5 climaxless years that he had no idea about.\n\nWell . . . you're definitely not going to get anybody to help you find a partnered orgasm when they think they're already giving you one. But now that you've stopped faking, your partner is no more expectant than he was before. In fact, he's *less* expectant. Give yourself some time here. Work with your partner, and stop worrying about yourself. You've had five fucking years of sex with this guy for him to complain about your look/taste/smell/feel. What makes you think he wouldn't bring that up?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;For years I figured with the right guidance and demonstrations I could make it happen for real and continue on from there but the big &amp;#39;o&amp;#39; has remained elusive when connecting with another person.\nI&amp;#39;ve been with my current partner for 5 climaxless years that he had no idea about.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well . . . you&amp;#39;re definitely not going to get anybody to help you find a partnered orgasm when they think they&amp;#39;re already giving you one. But now that you&amp;#39;ve stopped faking, your partner is no more expectant than he was before. In fact, he&amp;#39;s &lt;em&gt;less&lt;/em&gt; expectant. Give yourself some time here. Work with your partner, and stop worrying about yourself. You&amp;#39;ve had five fucking years of sex with this guy for him to complain about your look/taste/smell/feel. What makes you think he wouldn&amp;#39;t bring that up?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6j8os", "score_hidden": false, "stickied": false, "created": 1492058859.0, "created_utc": 1492030059.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg7rbcg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BigSmartSmart", "parent_id": "t1_dg7k8wz", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "That's so sweet. Good luck with everything!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s so sweet. Good luck with everything!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7rbcg", "score_hidden": false, "stickied": false, "created": 1492128131.0, "created_utc": 1492099331.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k8wz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6o3jo", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "As it stands what you say is basically the action plan in our house! I am worried about him being bored though. I think first step might have to be him playing computer games with headphones in so I know he's not just secretly waiting for it to be done! \nI  don't need any reassurances regarding love though, it's ample! \nThank you for your help :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As it stands what you say is basically the action plan in our house! I am worried about him being bored though. I think first step might have to be him playing computer games with headphones in so I know he&amp;#39;s not just secretly waiting for it to be done! \nI  don&amp;#39;t need any reassurances regarding love though, it&amp;#39;s ample! \nThank you for your help :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7k8wz", "score_hidden": false, "stickied": false, "created": 1492120102.0, "created_utc": 1492091302.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6o3jo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BigSmartSmart", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Dan Savage wrote about this once. I tried to find a link and couldn't. \n\nTry making the BF out on a blindfold and ear plugs, and just sit there while you masturbate. He doesn't get to see or hear you, nothing to be self conscious about, but you get used to him being there. (He can masturbate, too, if you're worried about him being bored.) Then try without the ear plugs. Eventually remove the blindfold. Once you've gotten used to cumming around him, he can get actively involved again. \n\nYou can even start with him reading a book in the next room, if you want to build up even slower. \n\nBut don't do any of this yet. Spend a month just reassuring yourself he loves you, even with your secret out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dan Savage wrote about this once. I tried to find a link and couldn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;Try making the BF out on a blindfold and ear plugs, and just sit there while you masturbate. He doesn&amp;#39;t get to see or hear you, nothing to be self conscious about, but you get used to him being there. (He can masturbate, too, if you&amp;#39;re worried about him being bored.) Then try without the ear plugs. Eventually remove the blindfold. Once you&amp;#39;ve gotten used to cumming around him, he can get actively involved again. &lt;/p&gt;\n\n&lt;p&gt;You can even start with him reading a book in the next room, if you want to build up even slower. &lt;/p&gt;\n\n&lt;p&gt;But don&amp;#39;t do any of this yet. Spend a month just reassuring yourself he loves you, even with your secret out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6o3jo", "score_hidden": false, "stickied": false, "created": 1492064590.0, "created_utc": 1492035790.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg7kefx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg6spn6", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I in no way put any blame on him and he knows that because it genuinely isn't anything to do with him, this issue has followed me from relationship to relationship and it's only now that I'm with someone I love SO much it only felt fair (to myself mostly) to finally tell someone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I in no way put any blame on him and he knows that because it genuinely isn&amp;#39;t anything to do with him, this issue has followed me from relationship to relationship and it&amp;#39;s only now that I&amp;#39;m with someone I love SO much it only felt fair (to myself mostly) to finally tell someone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7kefx", "score_hidden": false, "stickied": false, "created": 1492120299.0, "created_utc": 1492091499.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6spn6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bigbrown4432", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "My sister told me 2 years ago she NEVER had an orgasm with her boyfriend. She's been with him since 2006. I don't have really any useful advice since I'm a guy don't understand exactly how the female orgasm works, but I just want you to know that other women struggle with reaching orgasm with their boyfriends. You're not horribly defective. Focusing on not being able to reach orgasm won't make you cum faster.\n\nIt's great you have a supportive partner. Naturally, he's gonna feel sad about this. Making your partner cum is a wonderful feeling. I think he might become a little insecure after this, but you'll just have to talk him through it. Make sure that this is something you struggle with, instead of putting the blame on him not pleasuring you enough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My sister told me 2 years ago she NEVER had an orgasm with her boyfriend. She&amp;#39;s been with him since 2006. I don&amp;#39;t have really any useful advice since I&amp;#39;m a guy don&amp;#39;t understand exactly how the female orgasm works, but I just want you to know that other women struggle with reaching orgasm with their boyfriends. You&amp;#39;re not horribly defective. Focusing on not being able to reach orgasm won&amp;#39;t make you cum faster.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s great you have a supportive partner. Naturally, he&amp;#39;s gonna feel sad about this. Making your partner cum is a wonderful feeling. I think he might become a little insecure after this, but you&amp;#39;ll just have to talk him through it. Make sure that this is something you struggle with, instead of putting the blame on him not pleasuring you enough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6spn6", "score_hidden": false, "stickied": false, "created": 1492070298.0, "created_utc": 1492041498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6ujoe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Heartsinmotion", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Touch your clit while you're having sex! Take control of your own orgasm and you'll enjoy sex 10X more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Touch your clit while you&amp;#39;re having sex! Take control of your own orgasm and you&amp;#39;ll enjoy sex 10X more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6ujoe", "score_hidden": false, "stickied": false, "created": 1492072544.0, "created_utc": 1492043744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg6yx0f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CannabisCandace", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Smoke a joint. Indica if possible. It'll help you take in everything real slow. You'll feel every sensation in a new way, and it'll let you sink into the moment. Its so physical that thinking becomes impossible ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Smoke a joint. Indica if possible. It&amp;#39;ll help you take in everything real slow. You&amp;#39;ll feel every sensation in a new way, and it&amp;#39;ll let you sink into the moment. Its so physical that thinking becomes impossible ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg6yx0f", "score_hidden": false, "stickied": false, "created": 1492077902.0, "created_utc": 1492049102.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dgavzu3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg9avud", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You've literally been more helpful than any counsellor I've ever seen. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve literally been more helpful than any counsellor I&amp;#39;ve ever seen. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgavzu3", "score_hidden": false, "stickied": false, "created": 1492305140.0, "created_utc": 1492276340.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9avud", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "proudneanderthal", "parent_id": "t1_dg8tqyd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It's not even close to being late, I'm 53 and sex with my wife is better now than it's ever been.    \n\nYou are right, that young girl didn't know what she was going, she wanted to be grown up and she just didn't know.  Don't define yourself by what a young girl who thought she was in love did so very long ago.  It's not who you are, it never was.  You don't need to carry mistakes around as punishment, the 27 year old version of you is allowed to be happy regardless of what happened in the past or how you feel about it.  You let those actions hold you back up to this point, don't let them hold you back for the rest of your life.   This goes much deeper than just orgasms, it's about how you view yourself, and what you think you do or don't deserve.  If you were your own daughter what would tell yourself?  What would you tell your best friend?  Would you believe what you were telling them?  Of course you would, take your own advice.\n\nWhen you look the symbolic ways to forgive yourself there are ways to cast out the guilt and anger, some people cast it out and they leave everything behind.  Some people cast it out but they get something, like a locket, or pendent nothing fancy and they use it as a reminder.  The reminder is to never put others first over your own self, never accept abuse, never accept mistreatment, etc.   The pain an anger is left behind, but they carry around a reminder to look out for yourself, and love yourself, all the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not even close to being late, I&amp;#39;m 53 and sex with my wife is better now than it&amp;#39;s ever been.    &lt;/p&gt;\n\n&lt;p&gt;You are right, that young girl didn&amp;#39;t know what she was going, she wanted to be grown up and she just didn&amp;#39;t know.  Don&amp;#39;t define yourself by what a young girl who thought she was in love did so very long ago.  It&amp;#39;s not who you are, it never was.  You don&amp;#39;t need to carry mistakes around as punishment, the 27 year old version of you is allowed to be happy regardless of what happened in the past or how you feel about it.  You let those actions hold you back up to this point, don&amp;#39;t let them hold you back for the rest of your life.   This goes much deeper than just orgasms, it&amp;#39;s about how you view yourself, and what you think you do or don&amp;#39;t deserve.  If you were your own daughter what would tell yourself?  What would you tell your best friend?  Would you believe what you were telling them?  Of course you would, take your own advice.&lt;/p&gt;\n\n&lt;p&gt;When you look the symbolic ways to forgive yourself there are ways to cast out the guilt and anger, some people cast it out and they leave everything behind.  Some people cast it out but they get something, like a locket, or pendent nothing fancy and they use it as a reminder.  The reminder is to never put others first over your own self, never accept abuse, never accept mistreatment, etc.   The pain an anger is left behind, but they carry around a reminder to look out for yourself, and love yourself, all the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg9avud", "score_hidden": false, "stickied": false, "created": 1492213680.0, "created_utc": 1492184880.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8tqyd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg885ds", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thank you I will google that. He's not even mad but I'm still so very sorry. \n\nI'm not sure if it's because I've just woken up but your comment made me cry. I guess I really needed to hear that. I honestly didn't do anything for my benefit, I was young and dumb and didn't know any better. Thought it would make him happy. As I've gotten older and educated myself it already felt too late. Just, I really mean it when I say thank you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you I will google that. He&amp;#39;s not even mad but I&amp;#39;m still so very sorry. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if it&amp;#39;s because I&amp;#39;ve just woken up but your comment made me cry. I guess I really needed to hear that. I honestly didn&amp;#39;t do anything for my benefit, I was young and dumb and didn&amp;#39;t know any better. Thought it would make him happy. As I&amp;#39;ve gotten older and educated myself it already felt too late. Just, I really mean it when I say thank you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8tqyd", "score_hidden": false, "stickied": false, "created": 1492177583.0, "created_utc": 1492148783.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg885ds", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "proudneanderthal", "parent_id": "t1_dg7t0ob", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You need to forgive yourself. \n\nDiscuss it with your SO, let yourself let it go, there are symbolic ways to to forgive yourself and let go of the pain and anger (google it).\n\nThat pain and anger, at yourself, is part of the wall, it's part of what's holding you back.  Regardless of what ever mistakes you made they weren't done out of hate, or hostility, or malicious intent you absolutely deserve everything that life has to offer, stop punishing yourself and let you love yourself completely again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to forgive yourself. &lt;/p&gt;\n\n&lt;p&gt;Discuss it with your SO, let yourself let it go, there are symbolic ways to to forgive yourself and let go of the pain and anger (google it).&lt;/p&gt;\n\n&lt;p&gt;That pain and anger, at yourself, is part of the wall, it&amp;#39;s part of what&amp;#39;s holding you back.  Regardless of what ever mistakes you made they weren&amp;#39;t done out of hate, or hostility, or malicious intent you absolutely deserve everything that life has to offer, stop punishing yourself and let you love yourself completely again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg885ds", "score_hidden": false, "stickied": false, "created": 1492146341.0, "created_utc": 1492117541.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7t0ob", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7n6w8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "True! Nonetheless I think I did myself quite the disservice. Teenagers are dumb and I was no exception.\n\nI really appreciate your kind and encouraging words, almost half a life of deception has taken its emotional toll.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True! Nonetheless I think I did myself quite the disservice. Teenagers are dumb and I was no exception.&lt;/p&gt;\n\n&lt;p&gt;I really appreciate your kind and encouraging words, almost half a life of deception has taken its emotional toll.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7t0ob", "score_hidden": false, "stickied": false, "created": 1492129942.0, "created_utc": 1492101142.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7n6w8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "proudneanderthal", "parent_id": "t1_dg7kmlq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Don't relive the past.  You're right it could be different, it could be a whole lot worse.  It doesn't sound like you would trade your SO for anyone, you wouldn't be with him if it wasn't for how your past played out. \n\nYou will get through this because you know your SO loves you and is on your side.  The same relaxed loved feeling that you have when you aren't having sex will show up when you are having sex and when it does it will all work out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t relive the past.  You&amp;#39;re right it could be different, it could be a whole lot worse.  It doesn&amp;#39;t sound like you would trade your SO for anyone, you wouldn&amp;#39;t be with him if it wasn&amp;#39;t for how your past played out. &lt;/p&gt;\n\n&lt;p&gt;You will get through this because you know your SO loves you and is on your side.  The same relaxed loved feeling that you have when you aren&amp;#39;t having sex will show up when you are having sex and when it does it will all work out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7n6w8", "score_hidden": false, "stickied": false, "created": 1492123663.0, "created_utc": 1492094863.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7kmlq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg70nlw", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You're right about the wall, It's so frustrating to know if I hadn't have been so young and embarrassed when I started having sex it all could have been different. \n\nI sincerely hope I'll eventually 'forget' to be so paranoid and over thinky during sex! I just can't switch off the old brain box.\n\nI love the flu analogy haha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right about the wall, It&amp;#39;s so frustrating to know if I hadn&amp;#39;t have been so young and embarrassed when I started having sex it all could have been different. &lt;/p&gt;\n\n&lt;p&gt;I sincerely hope I&amp;#39;ll eventually &amp;#39;forget&amp;#39; to be so paranoid and over thinky during sex! I just can&amp;#39;t switch off the old brain box.&lt;/p&gt;\n\n&lt;p&gt;I love the flu analogy haha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7kmlq", "score_hidden": false, "stickied": false, "created": 1492120587.0, "created_utc": 1492091787.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg70nlw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "proudneanderthal", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You don't need to give up.   \n\nYou built up this massive wall in your head it's going to take some time to unwind.   \n\nThink about it like gaining weight.  Lets say you gained 20 pounds over 10 years.  You finally decided to fix the problem the weight doesn't go away overnight because you decided you wanted to lose the weight, it takes time.\n\nThe advice to \"relax\" should really be, \"don't force it\", which is what you are doing.  Keep having sex, keep masturbating, stop focusing on the orgasm.   \n\nIt's pretty obvious this man loves you a great deal and he loves the way you smell/taste/feel.  One day you'll get caught off guard and you won't be thinking about how you feel/taste/smell, and he'll be going down on you or you'll be having intercourses and you won't be thinking about anything other than how it feels and then, you cum, it could be big or little, but will definately an orgasm and then you'll wonder when you started orgasming during sex.\n\nIt's like when you are sick, and it's one of those cold/flu things were you feel run down all the time and you have a cough for like 3 weeks and it seems like you are never going to get better, and then one day you realize, \"Hey I don't feel sick and I'm not coughing, hmm I wonder when that happened?\"  \n\nYou'll be fine!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t need to give up.   &lt;/p&gt;\n\n&lt;p&gt;You built up this massive wall in your head it&amp;#39;s going to take some time to unwind.   &lt;/p&gt;\n\n&lt;p&gt;Think about it like gaining weight.  Lets say you gained 20 pounds over 10 years.  You finally decided to fix the problem the weight doesn&amp;#39;t go away overnight because you decided you wanted to lose the weight, it takes time.&lt;/p&gt;\n\n&lt;p&gt;The advice to &amp;quot;relax&amp;quot; should really be, &amp;quot;don&amp;#39;t force it&amp;quot;, which is what you are doing.  Keep having sex, keep masturbating, stop focusing on the orgasm.   &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s pretty obvious this man loves you a great deal and he loves the way you smell/taste/feel.  One day you&amp;#39;ll get caught off guard and you won&amp;#39;t be thinking about how you feel/taste/smell, and he&amp;#39;ll be going down on you or you&amp;#39;ll be having intercourses and you won&amp;#39;t be thinking about anything other than how it feels and then, you cum, it could be big or little, but will definately an orgasm and then you&amp;#39;ll wonder when you started orgasming during sex.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like when you are sick, and it&amp;#39;s one of those cold/flu things were you feel run down all the time and you have a cough for like 3 weeks and it seems like you are never going to get better, and then one day you realize, &amp;quot;Hey I don&amp;#39;t feel sick and I&amp;#39;m not coughing, hmm I wonder when that happened?&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll be fine!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg70nlw", "score_hidden": false, "stickied": false, "created": 1492080072.0, "created_utc": 1492051272.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg7gd7q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_PurplePie_", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I just had the idea like you could used to him being there and to be comfortable with it. Like, masturbate when he's just on the phone. Masturbate with him in the next room reading a book. Then do the blindfold thing someone suggested. \nI'm sorry, I don't have any data if that works ;) \nThis just came to my mind. \nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just had the idea like you could used to him being there and to be comfortable with it. Like, masturbate when he&amp;#39;s just on the phone. Masturbate with him in the next room reading a book. Then do the blindfold thing someone suggested. \nI&amp;#39;m sorry, I don&amp;#39;t have any data if that works ;) \nThis just came to my mind. \nGood luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7gd7q", "score_hidden": false, "stickied": false, "created": 1492114221.0, "created_utc": 1492085421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg8t1j5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7woc2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Okay so this discussion has gone down a road I didn't want to take! You've not said anything to make me uncomfortable though, you seem extremely nice and understanding. Thank you for your advice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay so this discussion has gone down a road I didn&amp;#39;t want to take! You&amp;#39;ve not said anything to make me uncomfortable though, you seem extremely nice and understanding. Thank you for your advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8t1j5", "score_hidden": false, "stickied": false, "created": 1492176162.0, "created_utc": 1492147362.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7woc2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Holy_Smoke", "parent_id": "t1_dg7u7mq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I am so sorry to hear that you've been assaulted, and I absolutely understand that that can have a severe impact on one's views of sex.  I hope you've found someone you trust like a counselor who you can discuss this with because it is a terrible burden to carry, even moreso when you bear it alone.  It takes a tremendous amount of courage to share that even in an online, anonymous setting.  Also, I hope none of my comments have made you feel uncomfortable or uneasy.\n\nAllow me to clarify that Dom/sub play doesn't have to necessarily be rough, involve restraints, pain or things of that nature.  While it can be fun to role play a little or use a little light bondage I'm not really big into BDSM type play myself, nor is my wife.  We're probably a lot more vanilla than I may have come across, but I just find my wife so incredibly beautiful and sensual that it's fun to \"give in\" to baser instincts and let ourselves get carried away with the pursuer/pursued dynamic.  She says it makes her feel sexy, and I have come to view it as a form of power in and of itself.  She has the power to incite feelings of lust within me and while she may be temporarily submissive to me, no matter how long or hard I go it's never too much, she can always handle more than I can give (within the confines of a loving bond of trust).  It's not as overt, but it is a very real, subtle type of power, resilience and control, even though I'm more physically dominant.\n\nAnyway I never planned to share this much about my sex life, but there you go lol.  Your thoughts and feelings on the matter are completely valid and the only time they should change is if &amp; when you decide they should.  Trauma like you've experienced can have an adverse affect on one's ability to enjoy sex and it makes me so angry that someone could put their own temporary satisfaction over your long-term health, whether they realized the extent of the consequences at the time or not.  Continue to be brave, and maybe more importantly be patient with yourself.  I have no doubt that you'll have that \"aha!\" moment and a new world of excitement and pleasure will open to you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry to hear that you&amp;#39;ve been assaulted, and I absolutely understand that that can have a severe impact on one&amp;#39;s views of sex.  I hope you&amp;#39;ve found someone you trust like a counselor who you can discuss this with because it is a terrible burden to carry, even moreso when you bear it alone.  It takes a tremendous amount of courage to share that even in an online, anonymous setting.  Also, I hope none of my comments have made you feel uncomfortable or uneasy.&lt;/p&gt;\n\n&lt;p&gt;Allow me to clarify that Dom/sub play doesn&amp;#39;t have to necessarily be rough, involve restraints, pain or things of that nature.  While it can be fun to role play a little or use a little light bondage I&amp;#39;m not really big into BDSM type play myself, nor is my wife.  We&amp;#39;re probably a lot more vanilla than I may have come across, but I just find my wife so incredibly beautiful and sensual that it&amp;#39;s fun to &amp;quot;give in&amp;quot; to baser instincts and let ourselves get carried away with the pursuer/pursued dynamic.  She says it makes her feel sexy, and I have come to view it as a form of power in and of itself.  She has the power to incite feelings of lust within me and while she may be temporarily submissive to me, no matter how long or hard I go it&amp;#39;s never too much, she can always handle more than I can give (within the confines of a loving bond of trust).  It&amp;#39;s not as overt, but it is a very real, subtle type of power, resilience and control, even though I&amp;#39;m more physically dominant.&lt;/p&gt;\n\n&lt;p&gt;Anyway I never planned to share this much about my sex life, but there you go lol.  Your thoughts and feelings on the matter are completely valid and the only time they should change is if &amp;amp; when you decide they should.  Trauma like you&amp;#39;ve experienced can have an adverse affect on one&amp;#39;s ability to enjoy sex and it makes me so angry that someone could put their own temporary satisfaction over your long-term health, whether they realized the extent of the consequences at the time or not.  Continue to be brave, and maybe more importantly be patient with yourself.  I have no doubt that you&amp;#39;ll have that &amp;quot;aha!&amp;quot; moment and a new world of excitement and pleasure will open to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7woc2", "score_hidden": false, "stickied": false, "created": 1492133836.0, "created_utc": 1492105036.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7u7mq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7ovvj", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I wouldn't say I was from a conservative family but with terrible sex education and as you'll appreciate the Internet wasn't exactly 'a thing ' yet all I saw was sitcoms where the wife was always saying no and the husband begging so I figured it was the status quo. \nObviously I know differently now but still, some lessons gnaw at your soul, even if you know better. Sex more definitely is about power. Or is it? It always has been for me. My whole view is so fucked up now I've no idea what I want or what I enjoy.\n\nI've got a bit of an issue (personally, no judgment to anyone else!) with the whole Dom/sub thing. I've been the victim of an admittedly non violent sexual assault which has meant most rough types of play now make me feel uncomfortable. That could also be due to male/female stereotypes and feeling 'less than' and having it proved. I hear what you're saying about the taboo of it being the turn on but I'm still too fragile in that respect. This is a whole other story.\nI don't vibe with being the Dom either, I'm a gentle soul.\n\nI can hear how what I'm saying sounds. I don't want to be 'one of those' but really, fuck the patriarchy lol. Being told to sit still, shut up and look pretty throughout childhood can't have been good for me.", "edited": 1492104328.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t say I was from a conservative family but with terrible sex education and as you&amp;#39;ll appreciate the Internet wasn&amp;#39;t exactly &amp;#39;a thing &amp;#39; yet all I saw was sitcoms where the wife was always saying no and the husband begging so I figured it was the status quo. \nObviously I know differently now but still, some lessons gnaw at your soul, even if you know better. Sex more definitely is about power. Or is it? It always has been for me. My whole view is so fucked up now I&amp;#39;ve no idea what I want or what I enjoy.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got a bit of an issue (personally, no judgment to anyone else!) with the whole Dom/sub thing. I&amp;#39;ve been the victim of an admittedly non violent sexual assault which has meant most rough types of play now make me feel uncomfortable. That could also be due to male/female stereotypes and feeling &amp;#39;less than&amp;#39; and having it proved. I hear what you&amp;#39;re saying about the taboo of it being the turn on but I&amp;#39;m still too fragile in that respect. This is a whole other story.\nI don&amp;#39;t vibe with being the Dom either, I&amp;#39;m a gentle soul.&lt;/p&gt;\n\n&lt;p&gt;I can hear how what I&amp;#39;m saying sounds. I don&amp;#39;t want to be &amp;#39;one of those&amp;#39; but really, fuck the patriarchy lol. Being told to sit still, shut up and look pretty throughout childhood can&amp;#39;t have been good for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7u7mq", "score_hidden": false, "stickied": false, "created": 1492131222.0, "created_utc": 1492102422.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ovvj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Holy_Smoke", "parent_id": "t1_dg7l8ox", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She was in her very early thirties, so not much older than you.  She used to say the exact same thing, that she didn't really have any sexual fantasies.  I think that was partly because she didn't really prioritize her own desire so she never gave it a whole lot of concentrated thought, and maybe partly shame and fear due to her conservative upbringing and general attitudes towards women's sexuality (which seem to be changing fortunately!).\n\nMost of us have some basic sexual desires, but maybe it's more a specific position, or certain kinds of dirty talk, or toys or something.  Think about why those things turn you on.  What about them makes you think naughty thoughts?  For example, a lot of gals like a tall guy with a muscular physique.  Why might that be?  A common hypothesis is that they like a guy who can physically overpower them/ravish them and the thought of being manhandled sends tingles to the right places. Those desires &amp; preferences are usually linked to something much more primal in ourselves, but we aren't taught how to look for them.\n\nWhat we discovered is that my wife is VERY submissive, to the point where she likes the idea of being manhandled and for the sexual situation to be \"out of her control\".  It's complicated because in real life that could be horrifying, and its also something society generally frowns upon making it taboo.  But that is sort of the basis of the fantasy, and it has evolved from there into a number of different submissive scenarios once she was able to shed some of the preconceived notions and felt comfortable sharing that with me without fear of being judged.  Maybe it would help you to figure out if you are inclined more towards dominant or submissive behaviors, and look into some kinks with that as your starting point?\n\nA thought-provoking quote from Oscar Wilde: \"Everything in the world is about sex, except sex.  Sex is about power.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She was in her very early thirties, so not much older than you.  She used to say the exact same thing, that she didn&amp;#39;t really have any sexual fantasies.  I think that was partly because she didn&amp;#39;t really prioritize her own desire so she never gave it a whole lot of concentrated thought, and maybe partly shame and fear due to her conservative upbringing and general attitudes towards women&amp;#39;s sexuality (which seem to be changing fortunately!).&lt;/p&gt;\n\n&lt;p&gt;Most of us have some basic sexual desires, but maybe it&amp;#39;s more a specific position, or certain kinds of dirty talk, or toys or something.  Think about why those things turn you on.  What about them makes you think naughty thoughts?  For example, a lot of gals like a tall guy with a muscular physique.  Why might that be?  A common hypothesis is that they like a guy who can physically overpower them/ravish them and the thought of being manhandled sends tingles to the right places. Those desires &amp;amp; preferences are usually linked to something much more primal in ourselves, but we aren&amp;#39;t taught how to look for them.&lt;/p&gt;\n\n&lt;p&gt;What we discovered is that my wife is VERY submissive, to the point where she likes the idea of being manhandled and for the sexual situation to be &amp;quot;out of her control&amp;quot;.  It&amp;#39;s complicated because in real life that could be horrifying, and its also something society generally frowns upon making it taboo.  But that is sort of the basis of the fantasy, and it has evolved from there into a number of different submissive scenarios once she was able to shed some of the preconceived notions and felt comfortable sharing that with me without fear of being judged.  Maybe it would help you to figure out if you are inclined more towards dominant or submissive behaviors, and look into some kinks with that as your starting point?&lt;/p&gt;\n\n&lt;p&gt;A thought-provoking quote from Oscar Wilde: &amp;quot;Everything in the world is about sex, except sex.  Sex is about power.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7ovvj", "score_hidden": false, "stickied": false, "created": 1492125544.0, "created_utc": 1492096744.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7l8ox", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg7jf3p", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "VERY interesting dudes perspective and I like it. The thing is, I don't have any sexual fantasies to divulge. Nothing. Zip. Over the years together he has asked me regularly. He must think I'm hiding it. I'm equally worried and hopeful one day I'll see or hear about something unusual and the penny will drop and I'll say YES that's for me. Until then there's nothing I can categorically say is something I do or don't want to think about. \n\nMay I ask how old your wife was at the stage of breakthrough?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;VERY interesting dudes perspective and I like it. The thing is, I don&amp;#39;t have any sexual fantasies to divulge. Nothing. Zip. Over the years together he has asked me regularly. He must think I&amp;#39;m hiding it. I&amp;#39;m equally worried and hopeful one day I&amp;#39;ll see or hear about something unusual and the penny will drop and I&amp;#39;ll say YES that&amp;#39;s for me. Until then there&amp;#39;s nothing I can categorically say is something I do or don&amp;#39;t want to think about. &lt;/p&gt;\n\n&lt;p&gt;May I ask how old your wife was at the stage of breakthrough?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7l8ox", "score_hidden": false, "stickied": false, "created": 1492121365.0, "created_utc": 1492092565.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jf3p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Holy_Smoke", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Disclaimer: dude's perspective.\n\nA lot of the advice seems to be focused on the specific types of physical stimulation and sensation needed to help your boyfriend bring you to orgasm, or telling you to relax.  This may be all you need, but I thought I'd offer another perspective.\n\nAs a married man who was unable to help his wife orgasm for years (though she was able to get herself off manually, which she rarely did...) I've found that mental stimulation in conjunction with manual/oral seems to be the key and I've had this confirmed through a number of women's accounts that I've read online and heard.  Not only does this help you focus on something else besides how you look/smell/taste, it directs your mind toward more erotic thoughts which help amplify the physical sensations.\n\nIt's easy to become self-conscious when you're focusing really hard on specific maneuvers or whether a sensation feels good enough or not.  This goes for guys and girls btw.  Instead, during foreplay try to envision a scenario you find hot or kinky.  Share that with your boyfriend and use your imaginations together.  My wife is submissive, and loves to be dominated so when we start to ramp up foreplay I start to describe in **graphic** detail what I'm going to do to her, or even a total fantasy scenario that I know she's into during and between fingering/rubbing/licking/sucking.  It took her awhile to share some of the kinks and scenarios that she found erotic, but when she became comfortable enough to do so I ran with it, teasing her and engaging her mind while stimulating her in the ways she seemed to enjoy.  It's easier to \"let go\" when you have something else to occupy your mind!\n\nIt takes a lot of courage to share kinks with an SO!  My wife is the sweetest, most gentle woman I've ever met who almost never curses, loses her temper and everyone sees as very polite and reserved.  I was shocked when she told me she was turned on by certain types of pretty kinky (for her, not like 4chan weird :P) porn, but in a very good way.  I was so excited to explore that fantasy with her, and it led to a lot of success in the bedroom, with her achieving 1 or more orgasms almost any time she wants to, often within 5 minutes of foreplay!  That's a huge improvement from the past where it was maybe once or twice a month!  If you trust your BF to not judge you for your kinks or preferences, I highly encourage you to share and start incorporating those into your foreplay to take some pressure off of you to \"try\" to enjoy things.  If he's worth keeping around, he should be excited to explore this facet of your sexuality with you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Disclaimer: dude&amp;#39;s perspective.&lt;/p&gt;\n\n&lt;p&gt;A lot of the advice seems to be focused on the specific types of physical stimulation and sensation needed to help your boyfriend bring you to orgasm, or telling you to relax.  This may be all you need, but I thought I&amp;#39;d offer another perspective.&lt;/p&gt;\n\n&lt;p&gt;As a married man who was unable to help his wife orgasm for years (though she was able to get herself off manually, which she rarely did...) I&amp;#39;ve found that mental stimulation in conjunction with manual/oral seems to be the key and I&amp;#39;ve had this confirmed through a number of women&amp;#39;s accounts that I&amp;#39;ve read online and heard.  Not only does this help you focus on something else besides how you look/smell/taste, it directs your mind toward more erotic thoughts which help amplify the physical sensations.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s easy to become self-conscious when you&amp;#39;re focusing really hard on specific maneuvers or whether a sensation feels good enough or not.  This goes for guys and girls btw.  Instead, during foreplay try to envision a scenario you find hot or kinky.  Share that with your boyfriend and use your imaginations together.  My wife is submissive, and loves to be dominated so when we start to ramp up foreplay I start to describe in &lt;strong&gt;graphic&lt;/strong&gt; detail what I&amp;#39;m going to do to her, or even a total fantasy scenario that I know she&amp;#39;s into during and between fingering/rubbing/licking/sucking.  It took her awhile to share some of the kinks and scenarios that she found erotic, but when she became comfortable enough to do so I ran with it, teasing her and engaging her mind while stimulating her in the ways she seemed to enjoy.  It&amp;#39;s easier to &amp;quot;let go&amp;quot; when you have something else to occupy your mind!&lt;/p&gt;\n\n&lt;p&gt;It takes a lot of courage to share kinks with an SO!  My wife is the sweetest, most gentle woman I&amp;#39;ve ever met who almost never curses, loses her temper and everyone sees as very polite and reserved.  I was shocked when she told me she was turned on by certain types of pretty kinky (for her, not like 4chan weird :P) porn, but in a very good way.  I was so excited to explore that fantasy with her, and it led to a lot of success in the bedroom, with her achieving 1 or more orgasms almost any time she wants to, often within 5 minutes of foreplay!  That&amp;#39;s a huge improvement from the past where it was maybe once or twice a month!  If you trust your BF to not judge you for your kinks or preferences, I highly encourage you to share and start incorporating those into your foreplay to take some pressure off of you to &amp;quot;try&amp;quot; to enjoy things.  If he&amp;#39;s worth keeping around, he should be excited to explore this facet of your sexuality with you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7jf3p", "score_hidden": false, "stickied": false, "created": 1492119006.0, "created_utc": 1492090206.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dg8th6x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg8afts", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "That's what I'd been thinking the whole time. That he'd never deal with this well so maybe it's best to just keep quiet. I actually thought he might break up with me as now I look like the biggest liar imaginable. \nHe doesn't say or act like he's devastated, more of a 'well let's move forward together' type reaction.\n\nThank you for your 20/20 hindsight about starting off 'properly' I know I should have! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I&amp;#39;d been thinking the whole time. That he&amp;#39;d never deal with this well so maybe it&amp;#39;s best to just keep quiet. I actually thought he might break up with me as now I look like the biggest liar imaginable. \nHe doesn&amp;#39;t say or act like he&amp;#39;s devastated, more of a &amp;#39;well let&amp;#39;s move forward together&amp;#39; type reaction.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your 20/20 hindsight about starting off &amp;#39;properly&amp;#39; I know I should have! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8th6x", "score_hidden": false, "stickied": false, "created": 1492177015.0, "created_utc": 1492148215.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8afts", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "renardiidx", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "As much I hate to say it, you basically devastated him. Destroyed.\nIt's already something really bad to hear when it's just for a few months, I'd be ashamed of myself for hearing by my gf that she hasn't had a single orgasm in all these years. It's the sad truth, he'll just need some time to digest this, but to be honest you should've worked it out a long time ago from the beginning, not faking but trying to reach it by teaching him.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As much I hate to say it, you basically devastated him. Destroyed.\nIt&amp;#39;s already something really bad to hear when it&amp;#39;s just for a few months, I&amp;#39;d be ashamed of myself for hearing by my gf that she hasn&amp;#39;t had a single orgasm in all these years. It&amp;#39;s the sad truth, he&amp;#39;ll just need some time to digest this, but to be honest you should&amp;#39;ve worked it out a long time ago from the beginning, not faking but trying to reach it by teaching him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8afts", "score_hidden": false, "stickied": false, "created": 1492149151.0, "created_utc": 1492120351.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dgavo73", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg9ieo9", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't know your ex's so I can't speak for them but doesn't my story show it wasn't an external factor e.g whoever I was shagging. I'd have probably caved if caught out 'did you just fake that?' ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know your ex&amp;#39;s so I can&amp;#39;t speak for them but doesn&amp;#39;t my story show it wasn&amp;#39;t an external factor e.g whoever I was shagging. I&amp;#39;d have probably caved if caught out &amp;#39;did you just fake that?&amp;#39; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgavo73", "score_hidden": false, "stickied": false, "created": 1492304698.0, "created_utc": 1492275898.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ieo9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ponyPharmacist", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "2 of my exes of 2 years did this to me. Was fucking devastating and planted a fear in me forever. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;2 of my exes of 2 years did this to me. Was fucking devastating and planted a fear in me forever. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg9ieo9", "score_hidden": false, "stickied": false, "created": 1492222253.0, "created_utc": 1492193453.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_64ymr5", "likes": null, "replies": "", "user_reports": [], "id": "dgavw08", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "auniqueusername29", "parent_id": "t1_dg9jgyd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't even know you and I can tell you're being too hard on yourself. I highly doubt you don't do anything right! \n\nYou'll find the right person eventually, you say you're 'bad' in relationships but maybe they weren't the right people for you.\n\nI have a feeling wanting it badly is what will scare the orgasm away! Which is why I'm in a mess too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t even know you and I can tell you&amp;#39;re being too hard on yourself. I highly doubt you don&amp;#39;t do anything right! &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll find the right person eventually, you say you&amp;#39;re &amp;#39;bad&amp;#39; in relationships but maybe they weren&amp;#39;t the right people for you.&lt;/p&gt;\n\n&lt;p&gt;I have a feeling wanting it badly is what will scare the orgasm away! Which is why I&amp;#39;m in a mess too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgavw08", "score_hidden": false, "stickied": false, "created": 1492304997.0, "created_utc": 1492276197.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jgyd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MissNobody90210", "parent_id": "t3_64ymr5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I [26F] have same problem. I can cum while masrturbating but I never had an orgasm with guy. I lost my virginity late. I was 22 and I think I did it just to get it over with. I never had a boyfrind. I was in two FWB relationships and had couple of times one night stands. My FWB men knew that I never had orgasms with them because I never fake it. I was thinking it's because of my medicaments but at the time I didn't masturbate. I changed medicaments several times but nothing has changed. I don't know maybe it's because of my thinking about myself. I have social anxiety disorder. And also I think I can't do anything wright. I finished school two years later. Go to studies twice and finished them after one semester. I can't do anything wright. In work I also had problems. I'm not good in relationships. So I choose to hang out just for sex because it's easy way. Now I have broken heart and changed my thinking. Now I want to be in relationship even I'm scared. Never again start FWB relationships. Maybe I will learn how to be with someone and then maybe in sex life will be some progress. Maybe I can't cum because I want it badly and I envy men with I have sex that they can cum. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I [26F] have same problem. I can cum while masrturbating but I never had an orgasm with guy. I lost my virginity late. I was 22 and I think I did it just to get it over with. I never had a boyfrind. I was in two FWB relationships and had couple of times one night stands. My FWB men knew that I never had orgasms with them because I never fake it. I was thinking it&amp;#39;s because of my medicaments but at the time I didn&amp;#39;t masturbate. I changed medicaments several times but nothing has changed. I don&amp;#39;t know maybe it&amp;#39;s because of my thinking about myself. I have social anxiety disorder. And also I think I can&amp;#39;t do anything wright. I finished school two years later. Go to studies twice and finished them after one semester. I can&amp;#39;t do anything wright. In work I also had problems. I&amp;#39;m not good in relationships. So I choose to hang out just for sex because it&amp;#39;s easy way. Now I have broken heart and changed my thinking. Now I want to be in relationship even I&amp;#39;m scared. Never again start FWB relationships. Maybe I will learn how to be with someone and then maybe in sex life will be some progress. Maybe I can&amp;#39;t cum because I want it badly and I envy men with I have sex that they can cum. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg9jgyd", "score_hidden": false, "stickied": false, "created": 1492223522.0, "created_utc": 1492194722.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]