[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Preface (necessary):&lt;/strong&gt; We&amp;#39;ve been dating for 2.5 years. The beginning was a bit rocky because she had mild mental health and sexual identity/self esteem issues. She&amp;#39;s beautiful and has an amazing body but refused to believe so. She started therapy 2 years ago and is doing much better now.&lt;/p&gt;\n\n&lt;p&gt;Back then we used to have sex about once a week - or every two weeks and I was always initiating, we talked about it and she admitted that she found it difficult to enjoy because she felt shame centred around sex. This was all about a year and half ago, she found a more sex positive therapist and we currently have sex almost everyday, I still initiate most of the time but I don&amp;#39;t mind as much because she&amp;#39;s more responsive and enthusiatic.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Here&amp;#39;s the thing:&lt;/strong&gt; When she does initiate, it&amp;#39;s right before we go out. We&amp;#39;re both pretty extroverted, so during a good week we go out - not dates, things such as dinner with friends and events - about 3 or 4 times. She does it about half the time (so if we go out 4 times in a week, she&amp;#39;ll do it twice) but never before something important.&lt;/p&gt;\n\n&lt;p&gt;She won&amp;#39;t just kiss me and ask if I want to fuck. She&amp;#39;ll tease me until I&amp;#39;m basically begging and then asks (which is a pretty big mind fuck because she has all the power and then asks like it&amp;#39;s been my decision) but she always does this about half an hour before we&amp;#39;re supposed to leave, so by the time I&amp;#39;m ready to fuck and she&amp;#39;s actually willing to let me fuck her we can&amp;#39;t even have a quickie without being late.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;ll do things like:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;If i&amp;#39;m sitting on the couch waiting for her, she&amp;#39;ll come out when she&amp;#39;s done and sit on my lap, grind on me and ask me how I think she looks, tell me that she&amp;#39;s been thinking about me all day.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If i&amp;#39;m the one getting ready, she&amp;#39;ll stand in front of me telling me how good I look while stroking me -never a hand job, just stroking.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Sometimes she&amp;#39;ll act completely normal but when we arrive she&amp;#39;ll initiate a really hot make out session in the car.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;m 100% sure she knows what she&amp;#39;s doing. She&amp;#39;s normally meticulous about time, she always knows what time it is and how much time has past. Whenever I straight out ask her to fuck, she&amp;#39;ll bite her lip and say &amp;quot;we&amp;#39;re gonna be late&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I know I sound like the kid who complains about having too much candy. All of this is extremely hot and I love it, she&amp;#39;s knows exactly what buttons to press. I feel like she spent the first 8 months of our relationship not cumming and studying me, but it&amp;#39;s not sustainable. We start becoming unreliable and no-one invites us anywhere if we keep cancelling to fuck and if we don&amp;#39;t fuck, I&amp;#39;m a horny and hazy mess during the whole event/dinner. (I haven&amp;#39;t told her this)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve asked her why she only initiates right as we&amp;#39;re supposed to leave and she acted like she didn&amp;#39;t realise the pattern and apologised. She stopped initiating all together after this -but was still receptive when I did - and I admitted that I loved it and missed it.&lt;/p&gt;\n\n&lt;p&gt;After that, the pattern became more or less the same but she&amp;#39;s started whispering things like &amp;quot;I&amp;#39;m not supposed to be doing this, am I?&amp;quot; and asking me if she should stop because we&amp;#39;re gonna be late.&lt;/p&gt;\n\n&lt;p&gt;I think she does this because she likes seeing how much I want her, she likes seeing me fight between needing to leave and wanting her. I&amp;#39;m also pretty clingy and attentive at the events we go to after she&amp;#39;s teased me and she&amp;#39;s expressed how much she enjoys the attention. I feel like instead of asking me for the attention she craves, she uses this to get it. Which I don&amp;#39;t think is healthy.&lt;/p&gt;\n\n&lt;p&gt;I do think this stems from her past of not feeling attractive -and now realising that she does have sex appeal. I feel like she has built some of her self esteem around how responsive I am to her (Although I have a pretty high libido, I worry she&amp;#39;ll take it personally when I reject her one day) and maybe that&amp;#39;s not entirely healthy for her.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;My question for you all:&lt;/strong&gt; Maybe this is a selfish way to put it. How do I suggest that she brings up this dynamic with her therapist and work through it without losing out on the amazing sex that we&amp;#39;ve been having?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT:&lt;/strong&gt; Almost everyone said that there wasn&amp;#39;t an issue with her but with me. I asked her why she only initiated before we go out again and she asked me if it bothered me. We spoke and she said that she had been working on initiating and she had decided to try it out in a low risk situation (before going out because if I turned her down, she could focus on the night and forget about it). She liked the way I reacted and decided to carry on that way. She also said that she liked the feeling of being aroused and having that last, which is why she made sure to do it right before we left.&lt;/p&gt;\n\n&lt;p&gt;I mentioned my worries and I took her enjoying the attention the wrong way. She liked the sexual attention I was giving her because it was more aggressive and daring. If I can hide it, I&amp;#39;ll normally place my hand on her thigh and squeeze it. We normally have sex on these days when we get back and it&amp;#39;s more aggressive/rough because i&amp;#39;m so pent up from her teasing me.&lt;/p&gt;\n\n&lt;p&gt;She simply likes teasing me and what she gets from it. My girlfriend is perfect.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**Preface (necessary):** We've been dating for 2.5 years. The beginning was a bit rocky because she had mild mental health and sexual identity/self esteem issues. She's beautiful and has an amazing body but refused to believe so. She started therapy 2 years ago and is doing much better now.\n\nBack then we used to have sex about once a week - or every two weeks and I was always initiating, we talked about it and she admitted that she found it difficult to enjoy because she felt shame centred around sex. This was all about a year and half ago, she found a more sex positive therapist and we currently have sex almost everyday, I still initiate most of the time but I don't mind as much because she's more responsive and enthusiatic.\n\n**Here's the thing:** When she does initiate, it's right before we go out. We're both pretty extroverted, so during a good week we go out - not dates, things such as dinner with friends and events - about 3 or 4 times. She does it about half the time (so if we go out 4 times in a week, she'll do it twice) but never before something important.\n\nShe won't just kiss me and ask if I want to fuck. She'll tease me until I'm basically begging and then asks (which is a pretty big mind fuck because she has all the power and then asks like it's been my decision) but she always does this about half an hour before we're supposed to leave, so by the time I'm ready to fuck and she's actually willing to let me fuck her we can't even have a quickie without being late.\n\nShe'll do things like:\n\n* If i'm sitting on the couch waiting for her, she'll come out when she's done and sit on my lap, grind on me and ask me how I think she looks, tell me that she's been thinking about me all day.\n\n* If i'm the one getting ready, she'll stand in front of me telling me how good I look while stroking me -never a hand job, just stroking.\n\n* Sometimes she'll act completely normal but when we arrive she'll initiate a really hot make out session in the car.\n\nI'm 100% sure she knows what she's doing. She's normally meticulous about time, she always knows what time it is and how much time has past. Whenever I straight out ask her to fuck, she'll bite her lip and say \"we're gonna be late\".\n\nI know I sound like the kid who complains about having too much candy. All of this is extremely hot and I love it, she's knows exactly what buttons to press. I feel like she spent the first 8 months of our relationship not cumming and studying me, but it's not sustainable. We start becoming unreliable and no-one invites us anywhere if we keep cancelling to fuck and if we don't fuck, I'm a horny and hazy mess during the whole event/dinner. (I haven't told her this)\n\nI've asked her why she only initiates right as we're supposed to leave and she acted like she didn't realise the pattern and apologised. She stopped initiating all together after this -but was still receptive when I did - and I admitted that I loved it and missed it.\n\nAfter that, the pattern became more or less the same but she's started whispering things like \"I'm not supposed to be doing this, am I?\" and asking me if she should stop because we're gonna be late.\n\nI think she does this because she likes seeing how much I want her, she likes seeing me fight between needing to leave and wanting her. I'm also pretty clingy and attentive at the events we go to after she's teased me and she's expressed how much she enjoys the attention. I feel like instead of asking me for the attention she craves, she uses this to get it. Which I don't think is healthy.\n\nI do think this stems from her past of not feeling attractive -and now realising that she does have sex appeal. I feel like she has built some of her self esteem around how responsive I am to her (Although I have a pretty high libido, I worry she'll take it personally when I reject her one day) and maybe that's not entirely healthy for her.\n\n**My question for you all:** Maybe this is a selfish way to put it. How do I suggest that she brings up this dynamic with her therapist and work through it without losing out on the amazing sex that we've been having?\n\n**EDIT:** Almost everyone said that there wasn't an issue with her but with me. I asked her why she only initiated before we go out again and she asked me if it bothered me. We spoke and she said that she had been working on initiating and she had decided to try it out in a low risk situation (before going out because if I turned her down, she could focus on the night and forget about it). She liked the way I reacted and decided to carry on that way. She also said that she liked the feeling of being aroused and having that last, which is why she made sure to do it right before we left.\n\nI mentioned my worries and I took her enjoying the attention the wrong way. She liked the sexual attention I was giving her because it was more aggressive and daring. If I can hide it, I'll normally place my hand on her thigh and squeeze it. We normally have sex on these days when we get back and it's more aggressive/rough because i'm so pent up from her teasing me.\n\nShe simply likes teasing me and what she gets from it. My girlfriend is perfect.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653wtv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 57, "report_reasons": null, "author": "throw54299", "saved": false, "mod_reports": [], "name": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": 1492083549.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/653wtv/teasing_girlfriend_only_initiates_before_we_go_out/", "num_reports": null, "locked": false, "stickied": false, "created": 1492094865.0, "url": "https://www.reddit.com/r/sex/comments/653wtv/teasing_girlfriend_only_initiates_before_we_go_out/", "author_flair_text": null, "quarantine": false, "title": "[Teasing] Girlfriend only initiates before we go out.", "created_utc": 1492066065.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 39, "visited": false, "subreddit_type": "public", "ups": 57}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7gfn6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "gamer_zzzz", "parent_id": "t1_dg7fp0u", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Good to hear buddy, enjoy the teasing 😉", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good to hear buddy, enjoy the teasing 😉&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7gfn6", "score_hidden": false, "stickied": false, "created": 1492114348.0, "created_utc": 1492085548.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fp0u", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg79lmr", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I was wrong. She just likes teasing me, the power gives her and the way I react. \n\nI was being completely stupid. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was wrong. She just likes teasing me, the power gives her and the way I react. &lt;/p&gt;\n\n&lt;p&gt;I was being completely stupid. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7fp0u", "score_hidden": false, "stickied": false, "created": 1492112885.0, "created_utc": 1492084085.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg8emo2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ironmonkey_", "parent_id": "t1_dg7bem6", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Lovely reply, OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lovely reply, OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8emo2", "score_hidden": false, "stickied": false, "created": 1492154662.0, "created_utc": 1492125862.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7bqyf", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "gamer_zzzz", "parent_id": "t1_dg7bem6", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I was just commenting on the information you had given, it's alright to be defensive sometimes. \n\nJust trying to get a bigger picture and possibly give a different perspective, just because your both extroverts doesn't mean your the same kind of extroverts. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was just commenting on the information you had given, it&amp;#39;s alright to be defensive sometimes. &lt;/p&gt;\n\n&lt;p&gt;Just trying to get a bigger picture and possibly give a different perspective, just because your both extroverts doesn&amp;#39;t mean your the same kind of extroverts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7bqyf", "score_hidden": false, "stickied": false, "created": 1492101931.0, "created_utc": 1492073131.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bem6", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7apo2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "My girlfriend and I live together. So we'll spend 3 nights together if one of us doesn't have our own thing going on.\n\nWe are best friends. We message each other constantly throughout the day, we schedule date nights, we run our errands together. We spend plenty of time together, in my opinion.\n\nLike I said before, we're both extroverts. We love spending time with other people, this isn't our issue. We don't go out with the same people every time, sometimes they're her friends and sometimes they're my friends. Also, I never commit to something for the both of us without asking her privately first.\n\nSorry if this reply comes off as defensive, it's just difficult to have someone tell me to be a better boyfriend when I know that I love my girlfriend and put a lot of effort into showing and telling her that. I put a lot of effort into my relationship.\n\nI will try asking her if needs me to do more for her, though. \nThanks for taking the time to respond.", "edited": 1492073356.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My girlfriend and I live together. So we&amp;#39;ll spend 3 nights together if one of us doesn&amp;#39;t have our own thing going on.&lt;/p&gt;\n\n&lt;p&gt;We are best friends. We message each other constantly throughout the day, we schedule date nights, we run our errands together. We spend plenty of time together, in my opinion.&lt;/p&gt;\n\n&lt;p&gt;Like I said before, we&amp;#39;re both extroverts. We love spending time with other people, this isn&amp;#39;t our issue. We don&amp;#39;t go out with the same people every time, sometimes they&amp;#39;re her friends and sometimes they&amp;#39;re my friends. Also, I never commit to something for the both of us without asking her privately first.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this reply comes off as defensive, it&amp;#39;s just difficult to have someone tell me to be a better boyfriend when I know that I love my girlfriend and put a lot of effort into showing and telling her that. I put a lot of effort into my relationship.&lt;/p&gt;\n\n&lt;p&gt;I will try asking her if needs me to do more for her, though. \nThanks for taking the time to respond.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7bem6", "score_hidden": false, "stickied": false, "created": 1492100882.0, "created_utc": 1492072082.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7lfb0", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "gamer_zzzz", "parent_id": "t1_dg7k9t5", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "Yeah it was probably a little harsh in hindsight, but the sentence I quoted seemed out of place with the rest of the post and suggested that even though he does alot it might not be the right kind of things if she is looking for attention from him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it was probably a little harsh in hindsight, but the sentence I quoted seemed out of place with the rest of the post and suggested that even though he does alot it might not be the right kind of things if she is looking for attention from him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7lfb0", "score_hidden": false, "stickied": false, "created": 1492121595.0, "created_utc": 1492092795.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7k9t5", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Alex-Murphy", "parent_id": "t1_dg7apo2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;maybe you should be a better boyfriend\n\nNothing I read in his post suggests he's *anything but* an attentive and loving boyfriend. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;maybe you should be a better boyfriend&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nothing I read in his post suggests he&amp;#39;s &lt;em&gt;anything but&lt;/em&gt; an attentive and loving boyfriend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7k9t5", "score_hidden": false, "stickied": false, "created": 1492120135.0, "created_utc": 1492091335.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7apo2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "gamer_zzzz", "parent_id": "t1_dg7a2cw", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "You might not be late but your missing out on the sex so time is an issue. \n\n&gt; I feel like instead of asking me for the attention she craves, she uses this to get it. \n\nSo maybe you should be a better boyfriend and give her more attention on a daily basis without her having to ask. \n\nIt might be a mix of what meltallica82 said and you not giving her enough attention. If you go out 4 night a week that means more than 50% of the nights in the week your spending time with your friends instead of just with each other alone, which might not be enough 1 on 1 attention. But she will still go out and have fun once at the event. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might not be late but your missing out on the sex so time is an issue. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I feel like instead of asking me for the attention she craves, she uses this to get it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So maybe you should be a better boyfriend and give her more attention on a daily basis without her having to ask. &lt;/p&gt;\n\n&lt;p&gt;It might be a mix of what meltallica82 said and you not giving her enough attention. If you go out 4 night a week that means more than 50% of the nights in the week your spending time with your friends instead of just with each other alone, which might not be enough 1 on 1 attention. But she will still go out and have fun once at the event. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7apo2", "score_hidden": false, "stickied": false, "created": 1492098839.0, "created_utc": 1492070039.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7a2cw", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg79lmr", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is a great advice but time isn't our issue. We are normally on time or within the margin of error late (I mentioned that she's meticulous about time). \n\nThe time thing is worrisome but my main issue is that I feel like she's using it as a mechanism instead of addressing her issues and insecurities.\n\nIf i'm being honest with you, I don't necessarily want the sex or teasing to stop, I just want her to address her issues.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a great advice but time isn&amp;#39;t our issue. We are normally on time or within the margin of error late (I mentioned that she&amp;#39;s meticulous about time). &lt;/p&gt;\n\n&lt;p&gt;The time thing is worrisome but my main issue is that I feel like she&amp;#39;s using it as a mechanism instead of addressing her issues and insecurities.&lt;/p&gt;\n\n&lt;p&gt;If i&amp;#39;m being honest with you, I don&amp;#39;t necessarily want the sex or teasing to stop, I just want her to address her issues.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7a2cw", "score_hidden": false, "stickied": false, "created": 1492097013.0, "created_utc": 1492068213.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg79q67", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RedEyedAquarist", "parent_id": "t1_dg79lmr", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Genius. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Genius. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg79q67", "score_hidden": false, "stickied": false, "created": 1492096095.0, "created_utc": 1492067295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79lmr", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "gamer_zzzz", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Why not just start getting ready to leave an hour earlier, when people set a time and date for an event set it in your calendar an hour early, worst case you turn up to dinner an hour early on days you don't have getting ready sex, but you get to turn up on time on the days you do. ", "edited": 1492067344.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why not just start getting ready to leave an hour earlier, when people set a time and date for an event set it in your calendar an hour early, worst case you turn up to dinner an hour early on days you don&amp;#39;t have getting ready sex, but you get to turn up on time on the days you do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg79lmr", "score_hidden": false, "stickied": false, "created": 1492095757.0, "created_utc": 1492066957.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7fjkj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7dzkl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I was wrong. I spoke to her. She just likes the way I react to it (especially in public).\n\nThanks for the advice, I appreciate it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was wrong. I spoke to her. She just likes the way I react to it (especially in public).&lt;/p&gt;\n\n&lt;p&gt;Thanks for the advice, I appreciate it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7fjkj", "score_hidden": false, "stickied": false, "created": 1492112562.0, "created_utc": 1492083762.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg8i415", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheseWereThePlaces", "parent_id": "t1_dg7dzkl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; Not to sound blunt, but just be late sometimes. \n\nThis.  I've never ever gone somewhere so important that I couldn't be a few minutes late because I was fucking.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Not to sound blunt, but just be late sometimes. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This.  I&amp;#39;ve never ever gone somewhere so important that I couldn&amp;#39;t be a few minutes late because I was fucking.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8i415", "score_hidden": false, "stickied": false, "created": 1492159403.0, "created_utc": 1492130603.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7dzkl", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Xray_Mind", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Not to sound blunt, but just be late sometimes. It is worth it for your relationship long term to do so. Ultimately do you really give a shit that you are 20 mins late to some meaningless event with friends or ignoring an intimate moment wth your best friend and partner?\n\nSounds like she is a little apprehensive about going out and wants to use it as a chance to have sex and have all eyes on her and all your attention and know she is the most important thing. \n\nTLDR: Sack up and fuck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not to sound blunt, but just be late sometimes. It is worth it for your relationship long term to do so. Ultimately do you really give a shit that you are 20 mins late to some meaningless event with friends or ignoring an intimate moment wth your best friend and partner?&lt;/p&gt;\n\n&lt;p&gt;Sounds like she is a little apprehensive about going out and wants to use it as a chance to have sex and have all eyes on her and all your attention and know she is the most important thing. &lt;/p&gt;\n\n&lt;p&gt;TLDR: Sack up and fuck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7dzkl", "score_hidden": false, "stickied": false, "created": 1492108705.0, "created_utc": 1492079905.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7fnx7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meltallica82", "parent_id": "t1_dg7fes4", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "That's great to hear!! Communication is key after all. I had a feeling her behaviour wasn't coming from a bad place, just simply her loving the attention you gave her. I'm glad you got to the bottom of it 😊", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s great to hear!! Communication is key after all. I had a feeling her behaviour wasn&amp;#39;t coming from a bad place, just simply her loving the attention you gave her. I&amp;#39;m glad you got to the bottom of it 😊&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7fnx7", "score_hidden": false, "stickied": false, "created": 1492112824.0, "created_utc": 1492084024.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fes4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7bdzd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You were right in a sense, I spoke to her. I posted an edit about it, if you're interested.\n\nI think I was speaking from a place of my own insecurity, while putting so much effort into making sure she felt wanted. I kind of let go of the notion that she might just desire me (I always felt like I had to turn her on to make her want me). \n\nThanks for encouraging me to talk to her!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You were right in a sense, I spoke to her. I posted an edit about it, if you&amp;#39;re interested.&lt;/p&gt;\n\n&lt;p&gt;I think I was speaking from a place of my own insecurity, while putting so much effort into making sure she felt wanted. I kind of let go of the notion that she might just desire me (I always felt like I had to turn her on to make her want me). &lt;/p&gt;\n\n&lt;p&gt;Thanks for encouraging me to talk to her!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7fes4", "score_hidden": false, "stickied": false, "created": 1492112273.0, "created_utc": 1492083473.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7bpor", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7bdzd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I feel like I do. I find her extremely attractive and i've always let her know that. We have sex almost everyday and I make sure she has a good time.\n\nI just don't understand why she would crave more attention from me? I am always willing to have sex and we spend most of our free time together (not just chilling and watching tv either, actually talking)\n\nThat was also my issue with the therapy thing, I don't ever want her to feel like her initiating is a bad thing.\n\nLike I mentioned in the post, I asked her why she only does it right before we go out and she acted like she didn't notice the pattern, so I assumed she didn't want to talk about it and let it go.\n\nMy girlfriend now is confident and cheery and happy but she wasn't always this person and she doesn't always let me know when things are going bad for her again, so maybe I over analyse.\n\nI won't bring it up unless I notice that it affects her or our relationship negatively in some way. \n\nThank you for the advice", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like I do. I find her extremely attractive and i&amp;#39;ve always let her know that. We have sex almost everyday and I make sure she has a good time.&lt;/p&gt;\n\n&lt;p&gt;I just don&amp;#39;t understand why she would crave more attention from me? I am always willing to have sex and we spend most of our free time together (not just chilling and watching tv either, actually talking)&lt;/p&gt;\n\n&lt;p&gt;That was also my issue with the therapy thing, I don&amp;#39;t ever want her to feel like her initiating is a bad thing.&lt;/p&gt;\n\n&lt;p&gt;Like I mentioned in the post, I asked her why she only does it right before we go out and she acted like she didn&amp;#39;t notice the pattern, so I assumed she didn&amp;#39;t want to talk about it and let it go.&lt;/p&gt;\n\n&lt;p&gt;My girlfriend now is confident and cheery and happy but she wasn&amp;#39;t always this person and she doesn&amp;#39;t always let me know when things are going bad for her again, so maybe I over analyse.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t bring it up unless I notice that it affects her or our relationship negatively in some way. &lt;/p&gt;\n\n&lt;p&gt;Thank you for the advice&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7bpor", "score_hidden": false, "stickied": false, "created": 1492101825.0, "created_utc": 1492073025.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bdzd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "meltallica82", "parent_id": "t1_dg7aafg", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Do you give her attention, besides when she's trying to initiate sex? From a girls point of view I think she could be craving your attention and the sexual teasing is a sure fire way to get it. Why do you think girls are so good at it. \n\nI feel asking her to talk to her therapist about this is a mistake. By doing that you could be sending the message that there's something wrong with her having a flirty, teasing, spontaneous nature sometimes. It really doesn't seem like an issue that needs to be taken to therapy. Have you really discussed this properly with her? \n\n\n\n", "edited": 1492072804.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you give her attention, besides when she&amp;#39;s trying to initiate sex? From a girls point of view I think she could be craving your attention and the sexual teasing is a sure fire way to get it. Why do you think girls are so good at it. &lt;/p&gt;\n\n&lt;p&gt;I feel asking her to talk to her therapist about this is a mistake. By doing that you could be sending the message that there&amp;#39;s something wrong with her having a flirty, teasing, spontaneous nature sometimes. It really doesn&amp;#39;t seem like an issue that needs to be taken to therapy. Have you really discussed this properly with her? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7bdzd", "score_hidden": false, "stickied": false, "created": 1492100831.0, "created_utc": 1492072031.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7aafg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7a2lf", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sorry if I wasn't clear. We never do cancel, we always go out and we both have a great time (I think she would tell me, if not). \nIt's just my fear that if we do cancel, no-one invites anywhere anymore.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if I wasn&amp;#39;t clear. We never do cancel, we always go out and we both have a great time (I think she would tell me, if not). \nIt&amp;#39;s just my fear that if we do cancel, no-one invites anywhere anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7aafg", "score_hidden": false, "stickied": false, "created": 1492097645.0, "created_utc": 1492068845.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7a2lf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "meltallica82", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Maybe she just doesn't like going out as much as you. Or she doesn't like the group of friends on those nights and so uses sex to keep you at home rather than sounding like a bitch by saying she doesn't want to go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe she just doesn&amp;#39;t like going out as much as you. Or she doesn&amp;#39;t like the group of friends on those nights and so uses sex to keep you at home rather than sounding like a bitch by saying she doesn&amp;#39;t want to go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7a2lf", "score_hidden": false, "stickied": false, "created": 1492097031.0, "created_utc": 1492068231.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7a63x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Not a therapist per say but mention that you only want to fuck her if you have plenty of time to get to the event. And if she can't, let her know you will cum but she won't because of this. Personally I like getting fucked and not cumming sometimes, the element of just pleasing and feeling my partner rushing inside my pussy, and having his cum slowly wet my pants during the evening turns me on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not a therapist per say but mention that you only want to fuck her if you have plenty of time to get to the event. And if she can&amp;#39;t, let her know you will cum but she won&amp;#39;t because of this. Personally I like getting fucked and not cumming sometimes, the element of just pleasing and feeling my partner rushing inside my pussy, and having his cum slowly wet my pants during the evening turns me on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7a63x", "score_hidden": false, "stickied": false, "created": 1492097308.0, "created_utc": 1492068508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7z9rb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "buffystakeded", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I guess my question would be this: When you get home after being out do you guys fuck like crazy cuz that's all you've been thinking about all night? If so, I don't see a problem. Teasing is a huge part of being turned on for long periods of time...at least for me it is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess my question would be this: When you get home after being out do you guys fuck like crazy cuz that&amp;#39;s all you&amp;#39;ve been thinking about all night? If so, I don&amp;#39;t see a problem. Teasing is a huge part of being turned on for long periods of time...at least for me it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7z9rb", "score_hidden": false, "stickied": false, "created": 1492136591.0, "created_utc": 1492107791.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7h5w2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "haplo34", "parent_id": "t1_dg7fhy0", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah but don't beat yourself up end enjoy it :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah but don&amp;#39;t beat yourself up end enjoy it :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7h5w2", "score_hidden": false, "stickied": false, "created": 1492115623.0, "created_utc": 1492086823.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fhy0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7ene0", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I did speak to her. You're right, there's no problem and I was being stupid.\n\nIt sounds stupid but I just kind of forgot to think that she might just be turned on, want to tease and fuck me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did speak to her. You&amp;#39;re right, there&amp;#39;s no problem and I was being stupid.&lt;/p&gt;\n\n&lt;p&gt;It sounds stupid but I just kind of forgot to think that she might just be turned on, want to tease and fuck me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7fhy0", "score_hidden": false, "stickied": false, "created": 1492112464.0, "created_utc": 1492083664.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ene0", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "haplo34", "parent_id": "t1_dg7a727", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm sorry but the more I think of it the more I don't see anything wrong with your girlfriend. You're overthinking it in my opinion. It just simply turns her on to \"torture you\" in that way and as long as it doesn't affect your sex life or your social life I mean what the fuck is the problem man?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry but the more I think of it the more I don&amp;#39;t see anything wrong with your girlfriend. You&amp;#39;re overthinking it in my opinion. It just simply turns her on to &amp;quot;torture you&amp;quot; in that way and as long as it doesn&amp;#39;t affect your sex life or your social life I mean what the fuck is the problem man?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7ene0", "score_hidden": false, "stickied": false, "created": 1492110495.0, "created_utc": 1492081695.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7a727", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg79s7b", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I've been dating and sleeping with her for a few years now. I think I know her a bit better than that. My girlfriend is not someone that I don't understand.\n\nI've been through some things with her, I'm just trying to make sure I'm not enabling an unhealthy coping mechanism. (She specifically sought out a therapist she could discuss her sex life with, there's no harm in bringing it up)\n\nThanks for taking the time to respond.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been dating and sleeping with her for a few years now. I think I know her a bit better than that. My girlfriend is not someone that I don&amp;#39;t understand.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been through some things with her, I&amp;#39;m just trying to make sure I&amp;#39;m not enabling an unhealthy coping mechanism. (She specifically sought out a therapist she could discuss her sex life with, there&amp;#39;s no harm in bringing it up)&lt;/p&gt;\n\n&lt;p&gt;Thanks for taking the time to respond.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7a727", "score_hidden": false, "stickied": false, "created": 1492097380.0, "created_utc": 1492068580.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79s7b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FHelena", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "\"kiss me and ask me if I want to fuck\"\n\nBecause she's not a simpleton, has some imagination, is playful and likes to tease? It's not a matter for a therapist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;kiss me and ask me if I want to fuck&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Because she&amp;#39;s not a simpleton, has some imagination, is playful and likes to tease? It&amp;#39;s not a matter for a therapist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg79s7b", "score_hidden": false, "stickied": false, "created": 1492096246.0, "created_utc": 1492067446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7hq95", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ImJustSo", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't think she has any issues that this behavior needs addressing. I think she just gets aroused by you both getting ready to go out. I have a similar experience with my girl, but it's even more than what you've described.  \n\nShe also gets aroused by me getting ready to leave. I'm getting clean, grooming myself, smelling nice, putting on decent clothing, and becoming more and more manly in her eyes, then I'm going to leave. She gets increasingly more and more turned on, to the point where she's ready to initiate sex. She knows I'm always going to say no, because I hate even the idea of being late. She still does it and I still let her, because I just accept this is one of her things. We've been together 13 years, our sexual relationship and general relationship are healthy. Why not keep doing the things that work as far as turning each other on goes? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think she has any issues that this behavior needs addressing. I think she just gets aroused by you both getting ready to go out. I have a similar experience with my girl, but it&amp;#39;s even more than what you&amp;#39;ve described.  &lt;/p&gt;\n\n&lt;p&gt;She also gets aroused by me getting ready to leave. I&amp;#39;m getting clean, grooming myself, smelling nice, putting on decent clothing, and becoming more and more manly in her eyes, then I&amp;#39;m going to leave. She gets increasingly more and more turned on, to the point where she&amp;#39;s ready to initiate sex. She knows I&amp;#39;m always going to say no, because I hate even the idea of being late. She still does it and I still let her, because I just accept this is one of her things. We&amp;#39;ve been together 13 years, our sexual relationship and general relationship are healthy. Why not keep doing the things that work as far as turning each other on goes? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7hq95", "score_hidden": false, "stickied": false, "created": 1492116538.0, "created_utc": 1492087738.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7wgay", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7n9an", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I was more concerned about the reasons behind her doing it. \nHonestly, I enjoy the teasing and her telling me what I can and can't do.\n\nYeah, it's pretty open and shut. I was just reading the signals wrong.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was more concerned about the reasons behind her doing it. \nHonestly, I enjoy the teasing and her telling me what I can and can&amp;#39;t do.&lt;/p&gt;\n\n&lt;p&gt;Yeah, it&amp;#39;s pretty open and shut. I was just reading the signals wrong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7wgay", "score_hidden": false, "stickied": false, "created": 1492133600.0, "created_utc": 1492104800.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7n9an", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "StatusJoe", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If she's grinding on you while you're sitting down and asking if you like it, why not just take her then and there? If she protests, stop, for the love god stop, but otherwise, it sounds like an open and shut case of acting like a man. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she&amp;#39;s grinding on you while you&amp;#39;re sitting down and asking if you like it, why not just take her then and there? If she protests, stop, for the love god stop, but otherwise, it sounds like an open and shut case of acting like a man. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7n9an", "score_hidden": false, "stickied": false, "created": 1492123739.0, "created_utc": 1492094939.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7wih1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7qfw3", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Definitely going to start trying these!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely going to start trying these!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7wih1", "score_hidden": false, "stickied": false, "created": 1492133664.0, "created_utc": 1492104864.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7qfw3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ArrowRobber", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "1) Start getting ready earlier\n\n2) Ensure occasionally your friends don't mind if you're late (the girlfriend will enjoy having \"broken\" your composure) Emphasize you can't help yourself because of her teasing and her forwardness.  You want to empower her.  later talk about the timing issue a week or two later if it's still more of the same.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) Start getting ready earlier&lt;/p&gt;\n\n&lt;p&gt;2) Ensure occasionally your friends don&amp;#39;t mind if you&amp;#39;re late (the girlfriend will enjoy having &amp;quot;broken&amp;quot; your composure) Emphasize you can&amp;#39;t help yourself because of her teasing and her forwardness.  You want to empower her.  later talk about the timing issue a week or two later if it&amp;#39;s still more of the same.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7qfw3", "score_hidden": false, "stickied": false, "created": 1492127202.0, "created_utc": 1492098402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg7wk75", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7te1i", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Communication really is key, haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Communication really is key, haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7wk75", "score_hidden": false, "stickied": false, "created": 1492133716.0, "created_utc": 1492104916.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7te1i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GreyJae", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This sounds like something I would do. If you reject her advances she can comfort herself with the fact that it's because you needed to leave, rather than risking rejection based on her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds like something I would do. If you reject her advances she can comfort herself with the fact that it&amp;#39;s because you needed to leave, rather than risking rejection based on her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7te1i", "score_hidden": false, "stickied": false, "created": 1492130347.0, "created_utc": 1492101547.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg829ar", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Then_He_Said", "parent_id": "t1_dg7ynq6", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Well if it's all on good fun then there's nothing to worry about. I think I misread your initial post and thought that you had a problem with her doing that.\n\nI'm glad you guys talked about it. And I hope everything works out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well if it&amp;#39;s all on good fun then there&amp;#39;s nothing to worry about. I think I misread your initial post and thought that you had a problem with her doing that.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad you guys talked about it. And I hope everything works out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg829ar", "score_hidden": false, "stickied": false, "created": 1492139809.0, "created_utc": 1492111009.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ynq6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throw54299", "parent_id": "t1_dg7uysj", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It mainly bothered me because I didn't really understand why she was doing it.\n\nI think it is kind of a \"You've been begging me to fuck for the past 20 minutes, i'm giving you the chance now but you have to pick what you want\". I thought it was about her wanting more attention and affirmation (but not feeling comfortable enough to ask for it).\n\nWe spoke about it and the miscommunication was that she *did* want me, I just didn't think so (Like you said, I thought she was using it to prove she's desirable).\n\nI wasn't really upset, just more concerned and confused. I have no problem with her using me sexually. I think the teasing was her way of seeing if I would give up going out just to sleep with her and keeping that control throughout the night even if we didn't sleep together.\n\nIt's all in good fun, I was just concerned because of her past with insecurity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It mainly bothered me because I didn&amp;#39;t really understand why she was doing it.&lt;/p&gt;\n\n&lt;p&gt;I think it is kind of a &amp;quot;You&amp;#39;ve been begging me to fuck for the past 20 minutes, i&amp;#39;m giving you the chance now but you have to pick what you want&amp;quot;. I thought it was about her wanting more attention and affirmation (but not feeling comfortable enough to ask for it).&lt;/p&gt;\n\n&lt;p&gt;We spoke about it and the miscommunication was that she &lt;em&gt;did&lt;/em&gt; want me, I just didn&amp;#39;t think so (Like you said, I thought she was using it to prove she&amp;#39;s desirable).&lt;/p&gt;\n\n&lt;p&gt;I wasn&amp;#39;t really upset, just more concerned and confused. I have no problem with her using me sexually. I think the teasing was her way of seeing if I would give up going out just to sleep with her and keeping that control throughout the night even if we didn&amp;#39;t sleep together.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s all in good fun, I was just concerned because of her past with insecurity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7ynq6", "score_hidden": false, "stickied": false, "created": 1492135944.0, "created_utc": 1492107144.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg81szm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Then_He_Said", "parent_id": "t1_dg7yvsd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "But you also initiate sex at other times too? Or do you only put on that kind of show at times when he has to sacrifice something to accept your advances.\n\nI'm all for the tease; I love when a person knows how to tease and entice. But I disagree with it when it's always a power play. That would make me resent it. \n\n\"Why only now? Why not any other time when I can be open to that without conflict? Clearly you're not aroused by me, you're aroused by the notion that you're so alluring that you can make me give up other things I like to have sex with you.\"\n\nThese are the things I would think if you *only* initiated sex by teasing me with it right before we go out somewhere.\n\nNow if that was just part of an otherwise mutually reciprocal sex life, I would have no problem with it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But you also initiate sex at other times too? Or do you only put on that kind of show at times when he has to sacrifice something to accept your advances.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m all for the tease; I love when a person knows how to tease and entice. But I disagree with it when it&amp;#39;s always a power play. That would make me resent it. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Why only now? Why not any other time when I can be open to that without conflict? Clearly you&amp;#39;re not aroused by me, you&amp;#39;re aroused by the notion that you&amp;#39;re so alluring that you can make me give up other things I like to have sex with you.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;These are the things I would think if you &lt;em&gt;only&lt;/em&gt; initiated sex by teasing me with it right before we go out somewhere.&lt;/p&gt;\n\n&lt;p&gt;Now if that was just part of an otherwise mutually reciprocal sex life, I would have no problem with it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg81szm", "score_hidden": false, "stickied": false, "created": 1492139323.0, "created_utc": 1492110523.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yvsd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg7uysj", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7yvsd", "score_hidden": false, "stickied": false, "created": 1492136182.0, "created_utc": 1492107382.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7uysj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Then_He_Said", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "No one else has mentioned this so I'll ask:\n\nAre you primarily bothered by the fact that she only initiates in this kind of situation where you'll have to give something up (the event) in order to sleep with her?\n\nWhat I'm hearing is that she doesn't otherwise initiate.  When you initiate, she's receptive, but only now that she's worked on being receptive you your advances. And she only really initiates as a way to affirm her value (\"he'd rather fuck me than go out with our friends - and he really likes going out with our friends\") and not otherwise.\n\nI'm not saying that this is her intention. But it's how it comes across to me, and I see why that would be upsetting. You want her to want *you*, not to use you to prove to herself that she's desirable and that you'll give things up to get her to fuck you.\n\nI could be wrong, but does that sum up the reason why this behavior bothers you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one else has mentioned this so I&amp;#39;ll ask:&lt;/p&gt;\n\n&lt;p&gt;Are you primarily bothered by the fact that she only initiates in this kind of situation where you&amp;#39;ll have to give something up (the event) in order to sleep with her?&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m hearing is that she doesn&amp;#39;t otherwise initiate.  When you initiate, she&amp;#39;s receptive, but only now that she&amp;#39;s worked on being receptive you your advances. And she only really initiates as a way to affirm her value (&amp;quot;he&amp;#39;d rather fuck me than go out with our friends - and he really likes going out with our friends&amp;quot;) and not otherwise.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying that this is her intention. But it&amp;#39;s how it comes across to me, and I see why that would be upsetting. You want her to want &lt;em&gt;you&lt;/em&gt;, not to use you to prove to herself that she&amp;#39;s desirable and that you&amp;#39;ll give things up to get her to fuck you.&lt;/p&gt;\n\n&lt;p&gt;I could be wrong, but does that sum up the reason why this behavior bothers you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg7uysj", "score_hidden": false, "stickied": false, "created": 1492132017.0, "created_utc": 1492103217.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_653wtv", "likes": null, "replies": "", "user_reports": [], "id": "dg8d4xi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "illeatyouupxo", "parent_id": "t3_653wtv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think it's because she knows you shouldn't be having sex when you're about to leave or are going to be late and that makes her want to. You both know it's a bad idea because you'll be late but are both so desperate to have sex with each other and it's a huge turn on. I know I get like that sometimes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s because she knows you shouldn&amp;#39;t be having sex when you&amp;#39;re about to leave or are going to be late and that makes her want to. You both know it&amp;#39;s a bad idea because you&amp;#39;ll be late but are both so desperate to have sex with each other and it&amp;#39;s a huge turn on. I know I get like that sometimes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8d4xi", "score_hidden": false, "stickied": false, "created": 1492152671.0, "created_utc": 1492123871.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]