[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If so, how has it changed? Do you get turned on and in the mood still, without your SO coming to you first? If you ever have lost your libido, did it ever come back? Does sex feel the same after kids, emotionally and physically?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "If so, how has it changed? Do you get turned on and in the mood still, without your SO coming to you first? If you ever have lost your libido, did it ever come back? Does sex feel the same after kids, emotionally and physically?", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "659zuv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "jujubeee23", "saved": false, "mod_reports": [], "name": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/659zuv/mothers_of_reddit_has_your_sex_life_changed_since/", "num_reports": null, "locked": false, "stickied": false, "created": 1492165511.0, "url": "https://www.reddit.com/r/sex/comments/659zuv/mothers_of_reddit_has_your_sex_life_changed_since/", "author_flair_text": null, "quarantine": false, "title": "[Mothers] of Reddit, has your [sex life] changed since having kids?", "created_utc": 1492136711.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg91wya", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "tenebris_alietum", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "FYI, /r/deadbedrooms is full of stories of the negative side of this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FYI, &lt;a href=\"/r/deadbedrooms\"&gt;/r/deadbedrooms&lt;/a&gt; is full of stories of the negative side of this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg91wya", "score_hidden": false, "stickied": false, "created": 1492200586.0, "created_utc": 1492171786.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg8nm1x", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Kit4000", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yes sex changed for me for awhile but not permanently\n With my first pregnancy I was not interested in sex and my drive fluctuated for a long time after but it came back just fine. No such issues with the second pregnancy.  We continued having regular sex up until I delivered. My drive was fine but as you would imagine a small child and a newborn made for tired and cranky parents and sex moved down the list of priorities. Sex felt the same after kids in every way. If there was ever emotional disconnects it was the relationship not the kids.\n\nIm 41, kids are 16 and 13. My libido is as high if not higher than it was  in my 20s and sex i pretty great. I initiate as much as he does to the point where sex is *almost* a given.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes sex changed for me for awhile but not permanently\n With my first pregnancy I was not interested in sex and my drive fluctuated for a long time after but it came back just fine. No such issues with the second pregnancy.  We continued having regular sex up until I delivered. My drive was fine but as you would imagine a small child and a newborn made for tired and cranky parents and sex moved down the list of priorities. Sex felt the same after kids in every way. If there was ever emotional disconnects it was the relationship not the kids.&lt;/p&gt;\n\n&lt;p&gt;Im 41, kids are 16 and 13. My libido is as high if not higher than it was  in my 20s and sex i pretty great. I initiate as much as he does to the point where sex is &lt;em&gt;almost&lt;/em&gt; a given.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8nm1x", "score_hidden": false, "stickied": false, "created": 1492167078.0, "created_utc": 1492138278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg8pdf9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "plabo77", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "The very first time after childbirth, it was painful. In retrospect, I think we got started too soon. After that, it physically felt the same for me as before and I didn't notice any difference in my partner's responsiveness either. \n\nHowever, demands of parenting and lack of adult privacy influenced my libido but not my partner's, resulting in a mismatch that caused frustration for both of us. After a while, the new dynamic led to greater frustration rather than positive changes. We did get it together some time later and bridged the gap in desired frequency, but it required trial and error, effort, open communication and taking each other seriously to reset that crappy dynamic that had set in. We eventually broke up for other reasons and now my libido is as it was before motherhood. Because we coparent, I have some adult free time now and that makes a big difference in my sexual identity and desire level. It's a dilemma because I love parenting and I love sex but my desire for frequent sex was definitely lower when my child was young and that did cause friction with my partner.\n\nFrom what I've heard from friends, this is not at all uncommon when kids are very young but often improves when kids get a little older. And some people do not experience this issue at all. ", "edited": 1492142855.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The very first time after childbirth, it was painful. In retrospect, I think we got started too soon. After that, it physically felt the same for me as before and I didn&amp;#39;t notice any difference in my partner&amp;#39;s responsiveness either. &lt;/p&gt;\n\n&lt;p&gt;However, demands of parenting and lack of adult privacy influenced my libido but not my partner&amp;#39;s, resulting in a mismatch that caused frustration for both of us. After a while, the new dynamic led to greater frustration rather than positive changes. We did get it together some time later and bridged the gap in desired frequency, but it required trial and error, effort, open communication and taking each other seriously to reset that crappy dynamic that had set in. We eventually broke up for other reasons and now my libido is as it was before motherhood. Because we coparent, I have some adult free time now and that makes a big difference in my sexual identity and desire level. It&amp;#39;s a dilemma because I love parenting and I love sex but my desire for frequent sex was definitely lower when my child was young and that did cause friction with my partner.&lt;/p&gt;\n\n&lt;p&gt;From what I&amp;#39;ve heard from friends, this is not at all uncommon when kids are very young but often improves when kids get a little older. And some people do not experience this issue at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8pdf9", "score_hidden": false, "stickied": false, "created": 1492169767.0, "created_utc": 1492140967.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg8t9m6", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cleverusername1978", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I have a 3year old and a 1 year old..I have a super high libido and so does my husband, the main difference for us is that pre kids we could do it wherever and whenever we wanted and now we have to work around their schedules and working alternating shifts, pre kids we had sex daily now it's 3 times a week..currently less because we're moving and it's just crazy busy. But we constantly tease each other and by the time we get to each other it's unbelievable.  Physically I noticed I couldn't feel as much for about 6 months postpartum for each birth, but I do kegels daily and worked hard to lose the weight  (50lbs, twice) which helped a lot. I do struggle with some insecurities about my post baby body but it's a small price to pay for my kids I definitely wouldn't change it and I know now that as time goes by as long as you're active and eating healthy your body is pretty forgiving. Now at one year post birth of my youngest I have all sensation back, I'm reasonably satisfied with my body and my libido could rival a 16year olds. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a 3year old and a 1 year old..I have a super high libido and so does my husband, the main difference for us is that pre kids we could do it wherever and whenever we wanted and now we have to work around their schedules and working alternating shifts, pre kids we had sex daily now it&amp;#39;s 3 times a week..currently less because we&amp;#39;re moving and it&amp;#39;s just crazy busy. But we constantly tease each other and by the time we get to each other it&amp;#39;s unbelievable.  Physically I noticed I couldn&amp;#39;t feel as much for about 6 months postpartum for each birth, but I do kegels daily and worked hard to lose the weight  (50lbs, twice) which helped a lot. I do struggle with some insecurities about my post baby body but it&amp;#39;s a small price to pay for my kids I definitely wouldn&amp;#39;t change it and I know now that as time goes by as long as you&amp;#39;re active and eating healthy your body is pretty forgiving. Now at one year post birth of my youngest I have all sensation back, I&amp;#39;m reasonably satisfied with my body and my libido could rival a 16year olds. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg8t9m6", "score_hidden": false, "stickied": false, "created": 1492176605.0, "created_utc": 1492147805.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg9b9j8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_Pig-Pen_", "parent_id": "t1_dg9auxk", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I chose to have kids, my sister chose not to. I don't think either decision is 'better'. Ignore people who try to talk you into it. If the broody hormones hit you'll know all about it. If they don't you're not missing out on anything, you are living life on your own terms. All the best in whatever you decide. X", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I chose to have kids, my sister chose not to. I don&amp;#39;t think either decision is &amp;#39;better&amp;#39;. Ignore people who try to talk you into it. If the broody hormones hit you&amp;#39;ll know all about it. If they don&amp;#39;t you&amp;#39;re not missing out on anything, you are living life on your own terms. All the best in whatever you decide. X&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg9b9j8", "score_hidden": false, "stickied": false, "created": 1492214118.0, "created_utc": 1492185318.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9auxk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jujubeee23", "parent_id": "t1_dg97yq7", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thanks so much for your advice and supportive/non judgmental attitude. I get backlash all the time from people when I say I don't think I want kids. Maybe it just isn't in the cards for me. Maybe I'll change my mind years down the road once we are married and have traveled and done thing we want to. But I think knowing myself, at 28 yrs old, still having no motherly desire, it might be a bad idea to test it out and risk it. I am thankful he and I are on the same page. Luckily, he and I bother have siblings, some with kids already, so our parents can't be too upset!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks so much for your advice and supportive/non judgmental attitude. I get backlash all the time from people when I say I don&amp;#39;t think I want kids. Maybe it just isn&amp;#39;t in the cards for me. Maybe I&amp;#39;ll change my mind years down the road once we are married and have traveled and done thing we want to. But I think knowing myself, at 28 yrs old, still having no motherly desire, it might be a bad idea to test it out and risk it. I am thankful he and I are on the same page. Luckily, he and I bother have siblings, some with kids already, so our parents can&amp;#39;t be too upset!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg9auxk", "score_hidden": false, "stickied": false, "created": 1492213651.0, "created_utc": 1492184851.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97yq7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "_Pig-Pen_", "parent_id": "t1_dg96qpf", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I really wanted kids and was broody/desperate for several years as it took my husband a bit longer to get on the same page as me and I can tell you that there are still days when I think that my life would have been *better* without them. By better I guess I mean easier. When my husband and I are away without them our relationship is 100% improved. At home we are tired, stressed and getting by.\nI am still glad I have them because I love them dearly and could never have imagined my life without them. It would have broken me not to be a parent but I had no idea what that really meant. I am a woman who likes peace and solitude - that just isn't in my life anymore!\n\nMake the right decision for you. I am sure there are lots of women who have bloomed since having kids and a lot of women who have lost themselves. I'm not sure it will be relevant to your situation.\n\nAll the same if you are enjoying a good life with your partner and have a loving and stable relationship with no real desire to be parents having kids for fear of missing out is likely to turn your world upside down and you might find you lose more than you gain.\n\nHaving kids is an amazing thing but it's lifelong hard work. There is a lot of love sprinkled into the work but also a lot of pain, worry and stress!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really wanted kids and was broody/desperate for several years as it took my husband a bit longer to get on the same page as me and I can tell you that there are still days when I think that my life would have been &lt;em&gt;better&lt;/em&gt; without them. By better I guess I mean easier. When my husband and I are away without them our relationship is 100% improved. At home we are tired, stressed and getting by.\nI am still glad I have them because I love them dearly and could never have imagined my life without them. It would have broken me not to be a parent but I had no idea what that really meant. I am a woman who likes peace and solitude - that just isn&amp;#39;t in my life anymore!&lt;/p&gt;\n\n&lt;p&gt;Make the right decision for you. I am sure there are lots of women who have bloomed since having kids and a lot of women who have lost themselves. I&amp;#39;m not sure it will be relevant to your situation.&lt;/p&gt;\n\n&lt;p&gt;All the same if you are enjoying a good life with your partner and have a loving and stable relationship with no real desire to be parents having kids for fear of missing out is likely to turn your world upside down and you might find you lose more than you gain.&lt;/p&gt;\n\n&lt;p&gt;Having kids is an amazing thing but it&amp;#39;s lifelong hard work. There is a lot of love sprinkled into the work but also a lot of pain, worry and stress!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg97yq7", "score_hidden": false, "stickied": false, "created": 1492210153.0, "created_utc": 1492181353.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg9kttn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwaway10849", "parent_id": "t1_dg96qpf", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "if you don't want kids or you aren't sure, don't have them. Like, I love my kids, I really wanted them and I'm glad I have them. But its a big commitment and a life altering choice. Mine are girls and I'm gonna teach them that they do not have to have kids to be fulfilled as a woman or whatever, fuck societal pressure etc. You don't have to have kids to have a great relationship or have an awesome life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if you don&amp;#39;t want kids or you aren&amp;#39;t sure, don&amp;#39;t have them. Like, I love my kids, I really wanted them and I&amp;#39;m glad I have them. But its a big commitment and a life altering choice. Mine are girls and I&amp;#39;m gonna teach them that they do not have to have kids to be fulfilled as a woman or whatever, fuck societal pressure etc. You don&amp;#39;t have to have kids to have a great relationship or have an awesome life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg9kttn", "score_hidden": false, "stickied": false, "created": 1492225156.0, "created_utc": 1492196356.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dga2y39", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "plabo77", "parent_id": "t1_dg96qpf", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think what's most important here is that you and your boyfriend are compatible in your desires and expectations, whether it's wanting kids or not wanting kids. And this extends to expectations around your sex life if you do have kids. Not that you can predict a change in libido, but maybe you can predict how much it would concern each of you if it were to happen for a while. For me and my ex, some of the issue was our difference in expectations. When our child was young and we were both working and stressed, my spontaneous desire shifted from every other day to weekends. I considered that fairly normal under the circumstances but he felt unwanted and considered it a sign our marriage was broken. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think what&amp;#39;s most important here is that you and your boyfriend are compatible in your desires and expectations, whether it&amp;#39;s wanting kids or not wanting kids. And this extends to expectations around your sex life if you do have kids. Not that you can predict a change in libido, but maybe you can predict how much it would concern each of you if it were to happen for a while. For me and my ex, some of the issue was our difference in expectations. When our child was young and we were both working and stressed, my spontaneous desire shifted from every other day to weekends. I considered that fairly normal under the circumstances but he felt unwanted and considered it a sign our marriage was broken. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dga2y39", "score_hidden": false, "stickied": false, "created": 1492248438.0, "created_utc": 1492219638.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg96qpf", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "jujubeee23", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thank you all for your responses! It is helpful. No I am not pregnant, just curious. My boyfriend and I are talking engagement and the future and we're both on the same page of not really wanting children, although it isn't completely off the table. I feel as though I never had the desire or that \"motherly\" gene. I don't really like kids in general. I get easily annoyed, and to be honest I am selfish. He and I are both big drinkers, like to stay up late, sleep in, go out and do stuff. I would rather spend my time and attention on him, and us, and nurture our relationship. I do think we are strong enough to get through the tough times, but I guess I am battling the, do I want to put us in the position to just \"get by\" even if it's only a few years or so? And put our incredible sex life on the line or back burner? I'm not sure I want to risk losing my desire for sex and thorough enjoyment of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you all for your responses! It is helpful. No I am not pregnant, just curious. My boyfriend and I are talking engagement and the future and we&amp;#39;re both on the same page of not really wanting children, although it isn&amp;#39;t completely off the table. I feel as though I never had the desire or that &amp;quot;motherly&amp;quot; gene. I don&amp;#39;t really like kids in general. I get easily annoyed, and to be honest I am selfish. He and I are both big drinkers, like to stay up late, sleep in, go out and do stuff. I would rather spend my time and attention on him, and us, and nurture our relationship. I do think we are strong enough to get through the tough times, but I guess I am battling the, do I want to put us in the position to just &amp;quot;get by&amp;quot; even if it&amp;#39;s only a few years or so? And put our incredible sex life on the line or back burner? I&amp;#39;m not sure I want to risk losing my desire for sex and thorough enjoyment of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg96qpf", "score_hidden": false, "stickied": false, "created": 1492208556.0, "created_utc": 1492179756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg93ssn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bangbangkittygang", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yes it changed. First it wasnt that bad, you had to get a feeling for timing and relaxing because the kid could wake up etc. Now, after almost 8 years i kinda dont feel like sex anymore. Sure i still have it and its still good but somehiw i am never in the mood or rarely. Mostly when i am tired it is easier to get turned on or somehow after a few drinks. It is not easy on my husband. \n\nI know and i talked with my doc but there is no solution. It got nothig to do with my pill or my thyroid disfunction. It could be my weight or other things. Who knows. I will work on my weight, i wont take the pill with the new year anymore and we will see if it gets better. And i will do my best to still give my husband what he needs,not as often but every now and then..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes it changed. First it wasnt that bad, you had to get a feeling for timing and relaxing because the kid could wake up etc. Now, after almost 8 years i kinda dont feel like sex anymore. Sure i still have it and its still good but somehiw i am never in the mood or rarely. Mostly when i am tired it is easier to get turned on or somehow after a few drinks. It is not easy on my husband. &lt;/p&gt;\n\n&lt;p&gt;I know and i talked with my doc but there is no solution. It got nothig to do with my pill or my thyroid disfunction. It could be my weight or other things. Who knows. I will work on my weight, i wont take the pill with the new year anymore and we will see if it gets better. And i will do my best to still give my husband what he needs,not as often but every now and then..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg93ssn", "score_hidden": false, "stickied": false, "created": 1492204196.0, "created_utc": 1492175396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg94odq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "_Pig-Pen_", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Are you pregnant? Everybody is different so don't panic when reading these replies. I think it depends on loads of factors including how much support you have from your partner/family/friends. I've got a 10 year old and a 7 year old.\n\nThings have been picking up again over the last couple of years but we have gone through at least 5+ years of problems.\n\nPhysically things have been different. I had a c-section and then a forceps delivery. They were both hellish. After the c-section I had a lot of unexpected nerve damage and I also have been left with a mother's apron. Not good for my self-esteem. After the forceps I had internal grazes and tears as well as a large cut between vagina and anus. I had some pain during PIV for a few years. It was difficult because if we had gentle sex I didn't feel much and if he went rough it hurt!\n\nEmotionally I had zero desire. My libido flatlined. I found it hard to get in the mood at all, even if he initiated. I had a lot of resentment towards my husband to do with parenting issues which I was carrying over in the bedroom I think. I saw us as parents first and sexual partners last. He was angry that I was putting him at the bottom of the pile, I was angry that he could be jealous of his own children. \n\nReally time has been the only thing that has resolved most of these issues. I also recently got diagnosed with an underactive thyroid which I think I must have had for years. Treatment for that has helped with the fatigue which helps with my libido. We also bought a lock for the bedroom door! I think he had a point - I was too much in mother mode and wasn't taking care of myself either. I also didn't really know what I wanted from sex - it seemed to be all about his orgasm. I'm making a point of making it about me again. My libido comes and goes but I've realised that it is worth nurturing. I need to avoid getting too tired and stressed and I need to make time for masturbation and fantasy!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you pregnant? Everybody is different so don&amp;#39;t panic when reading these replies. I think it depends on loads of factors including how much support you have from your partner/family/friends. I&amp;#39;ve got a 10 year old and a 7 year old.&lt;/p&gt;\n\n&lt;p&gt;Things have been picking up again over the last couple of years but we have gone through at least 5+ years of problems.&lt;/p&gt;\n\n&lt;p&gt;Physically things have been different. I had a c-section and then a forceps delivery. They were both hellish. After the c-section I had a lot of unexpected nerve damage and I also have been left with a mother&amp;#39;s apron. Not good for my self-esteem. After the forceps I had internal grazes and tears as well as a large cut between vagina and anus. I had some pain during PIV for a few years. It was difficult because if we had gentle sex I didn&amp;#39;t feel much and if he went rough it hurt!&lt;/p&gt;\n\n&lt;p&gt;Emotionally I had zero desire. My libido flatlined. I found it hard to get in the mood at all, even if he initiated. I had a lot of resentment towards my husband to do with parenting issues which I was carrying over in the bedroom I think. I saw us as parents first and sexual partners last. He was angry that I was putting him at the bottom of the pile, I was angry that he could be jealous of his own children. &lt;/p&gt;\n\n&lt;p&gt;Really time has been the only thing that has resolved most of these issues. I also recently got diagnosed with an underactive thyroid which I think I must have had for years. Treatment for that has helped with the fatigue which helps with my libido. We also bought a lock for the bedroom door! I think he had a point - I was too much in mother mode and wasn&amp;#39;t taking care of myself either. I also didn&amp;#39;t really know what I wanted from sex - it seemed to be all about his orgasm. I&amp;#39;m making a point of making it about me again. My libido comes and goes but I&amp;#39;ve realised that it is worth nurturing. I need to avoid getting too tired and stressed and I need to make time for masturbation and fantasy!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg94odq", "score_hidden": false, "stickied": false, "created": 1492205610.0, "created_utc": 1492176810.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dg9kps1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwaway10849", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "yes. I did lose my libido. Some of my favorite positions are painful now from scar tissue down there and there was a lo to adjustment especially initially. Sex felt different, and it was very tough for me to manage sexuality and being sexual with my husband like around my kids (things like passionate kissing or checking him out, thinking about sex etc.) I also had a lot of body image issues after my kids that took time to work through. \n\nBut as the kids have gotten a little older I've felt more comfortable prioritizing my own sexuality and building our relationship. But people need to to understand, having kids is the long haul. You can't expect everything to be exactly the same as it was before, and if sex drops off or whatever, you both should work on it, but its going to take TIME. like a year or two. you're spending your life together and thats a sacrifice and a risk you have to be willing to take to have a kid together. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yes. I did lose my libido. Some of my favorite positions are painful now from scar tissue down there and there was a lo to adjustment especially initially. Sex felt different, and it was very tough for me to manage sexuality and being sexual with my husband like around my kids (things like passionate kissing or checking him out, thinking about sex etc.) I also had a lot of body image issues after my kids that took time to work through. &lt;/p&gt;\n\n&lt;p&gt;But as the kids have gotten a little older I&amp;#39;ve felt more comfortable prioritizing my own sexuality and building our relationship. But people need to to understand, having kids is the long haul. You can&amp;#39;t expect everything to be exactly the same as it was before, and if sex drops off or whatever, you both should work on it, but its going to take TIME. like a year or two. you&amp;#39;re spending your life together and thats a sacrifice and a risk you have to be willing to take to have a kid together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dg9kps1", "score_hidden": false, "stickied": false, "created": 1492225019.0, "created_utc": 1492196219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dga9jvc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mycorrhize", "parent_id": "t1_dga9hlc", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I consider giving him a daily orgasm a worthy cause since I read about the link between regular sex and a lower rate of prostate cancer. His dad had prostate cancer and I want my husband to be alive for a long time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I consider giving him a daily orgasm a worthy cause since I read about the link between regular sex and a lower rate of prostate cancer. His dad had prostate cancer and I want my husband to be alive for a long time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dga9jvc", "score_hidden": false, "stickied": false, "created": 1492258292.0, "created_utc": 1492229492.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga9hlc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mycorrhize", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sex now needs to be snuck in wherever it fits. A few minutes in the morning, a quickie in the bathroom before his shower, an afternoon \"nap\"\n\nWe did it too soon after one birth and I got an infection, that wasn't cool. I had some health issues and gained weight, he got busy/lazy and gained weight, this wasn't good for our sex life. We're working on it. \n\nMy husband does not complain about any \"loosening\" or anything like that. I do my kegels. After many years of marriage and a bunch of kids we still have sex often, sometimes once a day, sometimes more. Usually not less, lately", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sex now needs to be snuck in wherever it fits. A few minutes in the morning, a quickie in the bathroom before his shower, an afternoon &amp;quot;nap&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;We did it too soon after one birth and I got an infection, that wasn&amp;#39;t cool. I had some health issues and gained weight, he got busy/lazy and gained weight, this wasn&amp;#39;t good for our sex life. We&amp;#39;re working on it. &lt;/p&gt;\n\n&lt;p&gt;My husband does not complain about any &amp;quot;loosening&amp;quot; or anything like that. I do my kegels. After many years of marriage and a bunch of kids we still have sex often, sometimes once a day, sometimes more. Usually not less, lately&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dga9hlc", "score_hidden": false, "stickied": false, "created": 1492258183.0, "created_utc": 1492229383.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_659zuv", "likes": null, "replies": "", "user_reports": [], "id": "dgagcdh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "uoilison", "parent_id": "t3_659zuv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Forgive me for responding, because I'm male, and I'm guessing at how my wife feels and I don't really know. However, my sense in being with her is that she was/is *more* aroused and arousable after having a child than before. She seems to have \"bigger\" orgasms and to get much more aroused, and to get aroused by more things. She seems more satisfied with her orgasms. \n\nI think it's harder to find alone time, but I don't get the sense that her desire or libido has changed. \n\nSo overall, having a child actually kind of improved our sex life. I was definitely not expecting that, but it's how it went. Her libido seems the same, but sex itself seems more, and more consistently, over-the-top enjoyable than it was before. Not that she didn't seem to enjoy it before, but now it's even more so. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Forgive me for responding, because I&amp;#39;m male, and I&amp;#39;m guessing at how my wife feels and I don&amp;#39;t really know. However, my sense in being with her is that she was/is &lt;em&gt;more&lt;/em&gt; aroused and arousable after having a child than before. She seems to have &amp;quot;bigger&amp;quot; orgasms and to get much more aroused, and to get aroused by more things. She seems more satisfied with her orgasms. &lt;/p&gt;\n\n&lt;p&gt;I think it&amp;#39;s harder to find alone time, but I don&amp;#39;t get the sense that her desire or libido has changed. &lt;/p&gt;\n\n&lt;p&gt;So overall, having a child actually kind of improved our sex life. I was definitely not expecting that, but it&amp;#39;s how it went. Her libido seems the same, but sex itself seems more, and more consistently, over-the-top enjoyable than it was before. Not that she didn&amp;#39;t seem to enjoy it before, but now it&amp;#39;s even more so. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgagcdh", "score_hidden": false, "stickied": false, "created": 1492273288.0, "created_utc": 1492244488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]