[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had my first time (No condom) and came in under a minute, tried the next day twice and barely reached a minute, she was very understanding but this really scares me.&lt;/p&gt;\n\n&lt;p&gt;I never had problems while masturbating, I try to always last more than 10 minutes and usually go to 20 minutes. I did not think at all I&amp;#39;d have problems with this.&lt;/p&gt;\n\n&lt;p&gt;I was really surprised everytime it happened because it just comes out of nowhere and I just have to cum, it didn&amp;#39;t gradually build like while masturbating.\nI am so ashamed and even though I know she understands, I need, I ABSOLUTELY NEED to get better. I read a bit about the pelvic muscles and even though I can do kegels I noticed that I was contracting my pelvic muscle during sex which may have fastened everything. Do I need to be completely relaxed downthere while thrusting? I felt a lot like I couldn&amp;#39;t control my pelvic muscles and this lack of control also stressed me a lot because I knew I wouldn&amp;#39;t be able to control when I came.&lt;/p&gt;\n\n&lt;p&gt;But still I&amp;#39;m so scared, can this be purely phisiological? and I will have to ressort to sprays and whatever to delay it? Or can I just train it? I&amp;#39;d be so ashamed if I couldn&amp;#39;t, I really need some reassurance&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I had my first time (No condom) and came in under a minute, tried the next day twice and barely reached a minute, she was very understanding but this really scares me.\n\nI never had problems while masturbating, I try to always last more than 10 minutes and usually go to 20 minutes. I did not think at all I'd have problems with this.\n\nI was really surprised everytime it happened because it just comes out of nowhere and I just have to cum, it didn't gradually build like while masturbating.\nI am so ashamed and even though I know she understands, I need, I ABSOLUTELY NEED to get better. I read a bit about the pelvic muscles and even though I can do kegels I noticed that I was contracting my pelvic muscle during sex which may have fastened everything. Do I need to be completely relaxed downthere while thrusting? I felt a lot like I couldn't control my pelvic muscles and this lack of control also stressed me a lot because I knew I wouldn't be able to control when I came.\n\nBut still I'm so scared, can this be purely phisiological? and I will have to ressort to sprays and whatever to delay it? Or can I just train it? I'd be so ashamed if I couldn't, I really need some reassurance", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ihr1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 28, "report_reasons": null, "author": "anonyxy", "saved": false, "mod_reports": [], "name": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/65ihr1/premature_ejaculation_first_times_at_22_m_only/", "num_reports": null, "locked": false, "stickied": false, "created": 1492281675.0, "url": "https://www.reddit.com/r/sex/comments/65ihr1/premature_ejaculation_first_times_at_22_m_only/", "author_flair_text": null, "quarantine": false, "title": "[Premature ejaculation] First times at 22 [M] only lasted a minute, I am so ashamed", "created_utc": 1492252875.0, "distinguished": null, "media": null, "upvote_ratio": 0.79, "num_comments": 28, "visited": false, "subreddit_type": "public", "ups": 28}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgalym6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonyxy", "parent_id": "t1_dgalmm8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "We spent the day together and in the night we went at it, she's had other sexual partners in the past while I have not, which puts a bit of pressure on me but we we're both really looking forward to it and she is very understanding and nice about it as to not put any pressure on me. \n\nWe had it planned which contributed to some of my anxiety but I didn't really feel it that much during the week. During foreplay I can't really tell if I'm relaxed, I'm thinking about my performance during the act but I can't really say that I was stressed out, I don't know, it's hard to define. During the act I did feel the anxiety as there are always little fears creeping into my thoughts which I suppose is normal for the first times.\n\nOne of my little fears was the anxiety of not being hard for penetration, thinking about it really kills my erection, in the end it wasn't the case but I was contracting my muscles in order to be hard enough which I think didn't help\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We spent the day together and in the night we went at it, she&amp;#39;s had other sexual partners in the past while I have not, which puts a bit of pressure on me but we we&amp;#39;re both really looking forward to it and she is very understanding and nice about it as to not put any pressure on me. &lt;/p&gt;\n\n&lt;p&gt;We had it planned which contributed to some of my anxiety but I didn&amp;#39;t really feel it that much during the week. During foreplay I can&amp;#39;t really tell if I&amp;#39;m relaxed, I&amp;#39;m thinking about my performance during the act but I can&amp;#39;t really say that I was stressed out, I don&amp;#39;t know, it&amp;#39;s hard to define. During the act I did feel the anxiety as there are always little fears creeping into my thoughts which I suppose is normal for the first times.&lt;/p&gt;\n\n&lt;p&gt;One of my little fears was the anxiety of not being hard for penetration, thinking about it really kills my erection, in the end it wasn&amp;#39;t the case but I was contracting my muscles in order to be hard enough which I think didn&amp;#39;t help&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgalym6", "score_hidden": false, "stickied": false, "created": 1492289484.0, "created_utc": 1492260684.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgalmm8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "protonophore", "parent_id": "t1_dgal40s", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think that this is something that may vary between people. Frankly I don't really think about it much, but I guess that when I get nearer to orgasm I contract them to hold off for a bit.\n\nIt's going to be difficult, but a physical state of relaxation is often accompanied by a mental one. If you can try and release your anxieties when you have sex I think it'll help you out. How are you guys approaching sex at the moment? Do you spend much time just hanging out beforehand? Cuddling? Foreplay? Might help you ease into it better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that this is something that may vary between people. Frankly I don&amp;#39;t really think about it much, but I guess that when I get nearer to orgasm I contract them to hold off for a bit.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s going to be difficult, but a physical state of relaxation is often accompanied by a mental one. If you can try and release your anxieties when you have sex I think it&amp;#39;ll help you out. How are you guys approaching sex at the moment? Do you spend much time just hanging out beforehand? Cuddling? Foreplay? Might help you ease into it better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgalmm8", "score_hidden": false, "stickied": false, "created": 1492288748.0, "created_utc": 1492259948.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgal40s", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "anonyxy", "parent_id": "t1_dgajfkt", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah we were thinking of at least starting with a condom to reduce the sensivity. I do have a question though in regards to the pelvic muscles, I should keep them always relaxed except when needing to control the ejaculation right? Because I think that's something I've got to \"train\" I'm always tense down there, the muscles are always contracted", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah we were thinking of at least starting with a condom to reduce the sensivity. I do have a question though in regards to the pelvic muscles, I should keep them always relaxed except when needing to control the ejaculation right? Because I think that&amp;#39;s something I&amp;#39;ve got to &amp;quot;train&amp;quot; I&amp;#39;m always tense down there, the muscles are always contracted&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgal40s", "score_hidden": false, "stickied": false, "created": 1492287574.0, "created_utc": 1492258774.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgajfkt", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "protonophore", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You've only had sex three times dude, and condomless at that. I don't think that there's anything to worry about for now.\n\nIt's a completely new experience that you've never felt on your dick before; no wonder it's responding well to it!\n\nPart of lasting longer will be learning to pick up those cues that you are near the edge, and controlling yourself through slowing down or thinking about something else. That will take practice though.\n\nHave you tried many positions? I can last pretty much indefinitely with the girl on top, for example.\n\nIf you're worried about not pleasuring the girl, you can always use a condom which might help slow things down. However, I think overall it's just another skill that you'll need to spend some time on to get better at. Don't worry!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve only had sex three times dude, and condomless at that. I don&amp;#39;t think that there&amp;#39;s anything to worry about for now.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a completely new experience that you&amp;#39;ve never felt on your dick before; no wonder it&amp;#39;s responding well to it!&lt;/p&gt;\n\n&lt;p&gt;Part of lasting longer will be learning to pick up those cues that you are near the edge, and controlling yourself through slowing down or thinking about something else. That will take practice though.&lt;/p&gt;\n\n&lt;p&gt;Have you tried many positions? I can last pretty much indefinitely with the girl on top, for example.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re worried about not pleasuring the girl, you can always use a condom which might help slow things down. However, I think overall it&amp;#39;s just another skill that you&amp;#39;ll need to spend some time on to get better at. Don&amp;#39;t worry!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgajfkt", "score_hidden": false, "stickied": false, "created": 1492283076.0, "created_utc": 1492254276.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgatgp4", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "bethmando", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "My 2 cents: I'm 49F and remember well my first few times. I don't think you are having a particular issue - it's VERY common with young men their first few times. I'm sure there's things to do about it - people here have ideas. But practice is probably the best intervention. But DO NOT feel badly about what this young woman thinks of you and your fast trigger. Listen - you're so fast because she feels SO VERY VERY GOOD. You're so into her/how it feels - you simply can't hold back. I had this happen...more then a few times.  Every young woman has been there. The guys made me feel magical - that it felt SO GOOD that they couldn't control themselves. \n\nI've been on the other side of this, too. Wondering why he wouldn't come already. Feeling unsexy when it's just kept going and he was having to do some mind tricks to get himself there. It didn't feel great. \n\nAlso - I know 1 minute is short. But this idea that we women want men to go on for an hour or longer? NO WAY.  Forget it. The intimate bliss of sex - playing and pleasuring one another - not just PIV - is the shit. Not how long you're pounding away. Take breaks...don't rush to get at it. Most women can't come just from penetration. So mixing it up and taking breaks is better than thrusting for a long time. \n\nFeeling \"ashamed\" that your partner blisses you out and makes you lose control of your orgasm? Nah. You need to think differently about it. You're young. It's new. The biological imperative is strong in you - you're getting the deed done. Your body is WIRED to do exactly what it did...these are your seed-spreading years. Your partner must be amazing and you're very connected to her...and her vagina feels GREAT and your body is responding strongly. That's the way to think and talk about it...be nicer to yourself. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My 2 cents: I&amp;#39;m 49F and remember well my first few times. I don&amp;#39;t think you are having a particular issue - it&amp;#39;s VERY common with young men their first few times. I&amp;#39;m sure there&amp;#39;s things to do about it - people here have ideas. But practice is probably the best intervention. But DO NOT feel badly about what this young woman thinks of you and your fast trigger. Listen - you&amp;#39;re so fast because she feels SO VERY VERY GOOD. You&amp;#39;re so into her/how it feels - you simply can&amp;#39;t hold back. I had this happen...more then a few times.  Every young woman has been there. The guys made me feel magical - that it felt SO GOOD that they couldn&amp;#39;t control themselves. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been on the other side of this, too. Wondering why he wouldn&amp;#39;t come already. Feeling unsexy when it&amp;#39;s just kept going and he was having to do some mind tricks to get himself there. It didn&amp;#39;t feel great. &lt;/p&gt;\n\n&lt;p&gt;Also - I know 1 minute is short. But this idea that we women want men to go on for an hour or longer? NO WAY.  Forget it. The intimate bliss of sex - playing and pleasuring one another - not just PIV - is the shit. Not how long you&amp;#39;re pounding away. Take breaks...don&amp;#39;t rush to get at it. Most women can&amp;#39;t come just from penetration. So mixing it up and taking breaks is better than thrusting for a long time. &lt;/p&gt;\n\n&lt;p&gt;Feeling &amp;quot;ashamed&amp;quot; that your partner blisses you out and makes you lose control of your orgasm? Nah. You need to think differently about it. You&amp;#39;re young. It&amp;#39;s new. The biological imperative is strong in you - you&amp;#39;re getting the deed done. Your body is WIRED to do exactly what it did...these are your seed-spreading years. Your partner must be amazing and you&amp;#39;re very connected to her...and her vagina feels GREAT and your body is responding strongly. That&amp;#39;s the way to think and talk about it...be nicer to yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgatgp4", "score_hidden": false, "stickied": false, "created": 1492301597.0, "created_utc": 1492272797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgak1br", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "secremorco", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think you're probably just in your own head as much as anything. I've been there. Try to cum twice next time... The first one will be fast, just get it out of the way, then spend time focusing on her: foreplay, oral, kissing, etc. until you are both relaxed then go for round two whenever you can again and I think you will find that you'll last alot longer the second time. This will probably go a long way towards clearing you're mental obstacles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re probably just in your own head as much as anything. I&amp;#39;ve been there. Try to cum twice next time... The first one will be fast, just get it out of the way, then spend time focusing on her: foreplay, oral, kissing, etc. until you are both relaxed then go for round two whenever you can again and I think you will find that you&amp;#39;ll last alot longer the second time. This will probably go a long way towards clearing you&amp;#39;re mental obstacles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgak1br", "score_hidden": false, "stickied": false, "created": 1492284827.0, "created_utc": 1492256027.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgb5oh4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MoreLurkerThanPoster", "parent_id": "t1_dganl8b", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This. You're young. If you're not using condoms just stay in her, make out and I bet you're good to go within minutes(if you don't dwell on it)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. You&amp;#39;re young. If you&amp;#39;re not using condoms just stay in her, make out and I bet you&amp;#39;re good to go within minutes(if you don&amp;#39;t dwell on it)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgb5oh4", "score_hidden": false, "stickied": false, "created": 1492318260.0, "created_utc": 1492289460.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dganl8b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Jbidz", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Just clean up and go round 2. Or, just keep going, screw the cleanup. I almost never last more than a minute my first time, and I REFUSE to sit there and try and think about \"non sexy things\" to try and last longer. That is not what sex is about, that is definitely not something I have ever enjoyed even when it did work. Just lose yourself in the bliss, but keep going!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just clean up and go round 2. Or, just keep going, screw the cleanup. I almost never last more than a minute my first time, and I REFUSE to sit there and try and think about &amp;quot;non sexy things&amp;quot; to try and last longer. That is not what sex is about, that is definitely not something I have ever enjoyed even when it did work. Just lose yourself in the bliss, but keep going!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dganl8b", "score_hidden": false, "stickied": false, "created": 1492292687.0, "created_utc": 1492263887.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgawc3g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "20InMyHead", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Just tell her she's so hot she made you cum already, then go down on her until you're ready for round two.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just tell her she&amp;#39;s so hot she made you cum already, then go down on her until you&amp;#39;re ready for round two.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgawc3g", "score_hidden": false, "stickied": false, "created": 1492305597.0, "created_utc": 1492276797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgalbkv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Esarus", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You're worrying too much. Relax. Take your time. It's not a big deal and you will improve. Try going on a long date first, drink some wine or something else. Try to be physically and emotionally as relaxed as you can. She wants to be with you and she wants to have sex with you, isn't that wonderful? Enjoy it and don't be afraid to learn. You've just started with having sex and this is very common and very normal. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re worrying too much. Relax. Take your time. It&amp;#39;s not a big deal and you will improve. Try going on a long date first, drink some wine or something else. Try to be physically and emotionally as relaxed as you can. She wants to be with you and she wants to have sex with you, isn&amp;#39;t that wonderful? Enjoy it and don&amp;#39;t be afraid to learn. You&amp;#39;ve just started with having sex and this is very common and very normal. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgalbkv", "score_hidden": false, "stickied": false, "created": 1492288080.0, "created_utc": 1492259280.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgaowjn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sqectre", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Masturbate at some point the day you expect to have sex, before you have sex. Or just go ASAP after getting off the first time. You'll last much longer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Masturbate at some point the day you expect to have sex, before you have sex. Or just go ASAP after getting off the first time. You&amp;#39;ll last much longer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgaowjn", "score_hidden": false, "stickied": false, "created": 1492294949.0, "created_utc": 1492266149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgap7o5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sxysteve", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If you jerk off you will make it harder to cum.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you jerk off you will make it harder to cum.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgap7o5", "score_hidden": false, "stickied": false, "created": 1492295456.0, "created_utc": 1492266656.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgaporb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BananaHand5", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I was you at 22.  Being a minute man just killed my confidence.  I was convince that I loved sex, but was such a disappointment to myself, and my girlfriend.  Back then I was obsessed with my performance, her enjoyment, lasting a long time...I never once thought am I enjoying this?  If I asked myself that once, and answered honestly I would've said I hate this, why am I doing this, there are better ways to spend my time, jacking off is way better.  I spent the next several years having bad sex with several different girlfriends.  It would be good at first, then devolve into becoming a minute man over time...and all the delayed pleasure condoms in the world didn't matter since the truth was I didn't like sex in the first place.  Here's some advice that helped me:\n\n\n*Have sex without the goal being to cum.  Often, we get hung up on cumming, we feel distracted that sex isn't good unless she has an orgasm, disregard this, if she does that's cool, if she doesn't that's cool too.  \n\n*Touch each other all over, spend time exploring her body, touching lightly, licking, kissing, tickling, whatever.  \n\n*If you put it in all at once, and start thrusting it won't last long.  Sorry to break it to you, lots of guys can do this, but you're not one of them.  That's okay because a lot of women don't want to be jack hammered for 2 hours straight.  Instead, tease them.  Put it in a little bit, rub her lips, get her wetter, put it in a little more, ease it in over time, THEN START ALL OVER, this will drive them fucking nuts, plus it will help desensitize you.  \n\n*When she's on top, touch her, focus on how her skin feels underneath your fingertips.  This helps me a lot, it's a turn on and a distraction.\n\n*Also, focus on your breath, deep relaxing breaths.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was you at 22.  Being a minute man just killed my confidence.  I was convince that I loved sex, but was such a disappointment to myself, and my girlfriend.  Back then I was obsessed with my performance, her enjoyment, lasting a long time...I never once thought am I enjoying this?  If I asked myself that once, and answered honestly I would&amp;#39;ve said I hate this, why am I doing this, there are better ways to spend my time, jacking off is way better.  I spent the next several years having bad sex with several different girlfriends.  It would be good at first, then devolve into becoming a minute man over time...and all the delayed pleasure condoms in the world didn&amp;#39;t matter since the truth was I didn&amp;#39;t like sex in the first place.  Here&amp;#39;s some advice that helped me:&lt;/p&gt;\n\n&lt;p&gt;*Have sex without the goal being to cum.  Often, we get hung up on cumming, we feel distracted that sex isn&amp;#39;t good unless she has an orgasm, disregard this, if she does that&amp;#39;s cool, if she doesn&amp;#39;t that&amp;#39;s cool too.  &lt;/p&gt;\n\n&lt;p&gt;*Touch each other all over, spend time exploring her body, touching lightly, licking, kissing, tickling, whatever.  &lt;/p&gt;\n\n&lt;p&gt;*If you put it in all at once, and start thrusting it won&amp;#39;t last long.  Sorry to break it to you, lots of guys can do this, but you&amp;#39;re not one of them.  That&amp;#39;s okay because a lot of women don&amp;#39;t want to be jack hammered for 2 hours straight.  Instead, tease them.  Put it in a little bit, rub her lips, get her wetter, put it in a little more, ease it in over time, THEN START ALL OVER, this will drive them fucking nuts, plus it will help desensitize you.  &lt;/p&gt;\n\n&lt;p&gt;*When she&amp;#39;s on top, touch her, focus on how her skin feels underneath your fingertips.  This helps me a lot, it&amp;#39;s a turn on and a distraction.&lt;/p&gt;\n\n&lt;p&gt;*Also, focus on your breath, deep relaxing breaths.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgaporb", "score_hidden": false, "stickied": false, "created": 1492296196.0, "created_utc": 1492267396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgau8u2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "eatmyopinions", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Highly fixable. It's the opposite problem that is much more difficult to remedy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Highly fixable. It&amp;#39;s the opposite problem that is much more difficult to remedy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgau8u2", "score_hidden": false, "stickied": false, "created": 1492302696.0, "created_utc": 1492273896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgaukeb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Charge36", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Are you circumcised or intact?\n\nIf you have sex again 10 to 15 minutes after the first time youd probably last much longer the in the second round.\n\nMy first few times I had the opposite problem. I couldn't get off at all. If I had to choose I think I'd rather come to quick than not come at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you circumcised or intact?&lt;/p&gt;\n\n&lt;p&gt;If you have sex again 10 to 15 minutes after the first time youd probably last much longer the in the second round.&lt;/p&gt;\n\n&lt;p&gt;My first few times I had the opposite problem. I couldn&amp;#39;t get off at all. If I had to choose I think I&amp;#39;d rather come to quick than not come at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgaukeb", "score_hidden": false, "stickied": false, "created": 1492303160.0, "created_utc": 1492274360.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgapfjc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "paulHarkonen", "parent_id": "t1_dgal08w", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If you're fine while going solo and with oral it's almost certainly just because you're new to sex and the sensations are just too good.\n\nYou can start by adding a condom, but the number one element will be repeated exposure.  In short, go fuck her some more and if you cum quickly, clean it up some, keep playing with her and when you get hard again, go for round 2.  It likely won't even take that long and you'll last much longer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re fine while going solo and with oral it&amp;#39;s almost certainly just because you&amp;#39;re new to sex and the sensations are just too good.&lt;/p&gt;\n\n&lt;p&gt;You can start by adding a condom, but the number one element will be repeated exposure.  In short, go fuck her some more and if you cum quickly, clean it up some, keep playing with her and when you get hard again, go for round 2.  It likely won&amp;#39;t even take that long and you&amp;#39;ll last much longer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgapfjc", "score_hidden": false, "stickied": false, "created": 1492295802.0, "created_utc": 1492267002.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgastye", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dreamsiclecellanemia", "parent_id": "t1_dgal08w", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think he meant oral on her. That being said, how long do you last round two or later in the night/day?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think he meant oral on her. That being said, how long do you last round two or later in the night/day?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgastye", "score_hidden": false, "stickied": false, "created": 1492300740.0, "created_utc": 1492271940.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgal08w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonyxy", "parent_id": "t1_dgakbqy", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah we've been doing oral for awhile and I've never had problems lasting with her, sometimes it even took way too long. We're just worried in case I prematurely ejaculate every single time we have sex, like if I can't do anything about it. I hope not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah we&amp;#39;ve been doing oral for awhile and I&amp;#39;ve never had problems lasting with her, sometimes it even took way too long. We&amp;#39;re just worried in case I prematurely ejaculate every single time we have sex, like if I can&amp;#39;t do anything about it. I hope not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgal08w", "score_hidden": false, "stickied": false, "created": 1492287323.0, "created_utc": 1492258523.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgakbqy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AmyAbner", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Practice more oral. Use toys even. Satisfy her that way to relieve some of your performance anxiety/pressure then try different positions and paces and see which ones are the least stimulating till you can can get a good grip on prolonging ejaculation.    ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Practice more oral. Use toys even. Satisfy her that way to relieve some of your performance anxiety/pressure then try different positions and paces and see which ones are the least stimulating till you can can get a good grip on prolonging ejaculation.    &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgakbqy", "score_hidden": false, "stickied": false, "created": 1492285616.0, "created_utc": 1492256816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgbajbu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arie_R", "parent_id": "t1_dgaqa8o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Try not to worry about it. I think a lot of people put all this pressure on the first time, the first few times etc. I guess especially for men this might be the case since there's no faking a boner ;). It's totally normal not to last really long and I think that with sex, the more you worry about things, the more likely it is you will 'fail' (whatever that is to you). Just have fun. If you last a minute, maybe you can go again for round two after 20 minutes? Maybe after an hour? Maybe get good with your tongue/hands? Maybe her orgasm first? Just accept that your body will react the way it does and just learn from it. Understand what sensations are really good and will make you cum instantly, and maybe also identify sensations that are good but aren't as intense so you might be able to last longer doing some things when other things will finish you sooner. It's all a learning process; have fun with that :).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try not to worry about it. I think a lot of people put all this pressure on the first time, the first few times etc. I guess especially for men this might be the case since there&amp;#39;s no faking a boner ;). It&amp;#39;s totally normal not to last really long and I think that with sex, the more you worry about things, the more likely it is you will &amp;#39;fail&amp;#39; (whatever that is to you). Just have fun. If you last a minute, maybe you can go again for round two after 20 minutes? Maybe after an hour? Maybe get good with your tongue/hands? Maybe her orgasm first? Just accept that your body will react the way it does and just learn from it. Understand what sensations are really good and will make you cum instantly, and maybe also identify sensations that are good but aren&amp;#39;t as intense so you might be able to last longer doing some things when other things will finish you sooner. It&amp;#39;s all a learning process; have fun with that :).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbajbu", "score_hidden": false, "stickied": false, "created": 1492325081.0, "created_utc": 1492296281.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaqa8o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "anonyxy", "parent_id": "t1_dgapo7e", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah she got tested for me and she is on birth control. I hope it does get better as the novelty wears off, I will do everything I can. Yeah i thought about buying a male masturbator to train, also because i feel like masturbation hasnt been doing it gor me recently. Thanks\n for the advice\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah she got tested for me and she is on birth control. I hope it does get better as the novelty wears off, I will do everything I can. Yeah i thought about buying a male masturbator to train, also because i feel like masturbation hasnt been doing it gor me recently. Thanks\n for the advice&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgaqa8o", "score_hidden": false, "stickied": false, "created": 1492297103.0, "created_utc": 1492268303.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgapo7e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arie_R", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Have you both been tested before sex or were you both virgins? Is she on birth control?\n\nIt's totally normal to not last very long. Lots of men, even when they've been sexually active for a long time, do not (always) last long. Nothing to be embarrassed about.\n\nI think you should stop making such a big deal out of it at this stage. An understanding partner will find ways to enjoy their time with you even if you shoot your load after a minute. I am willing to bet money you will last longer as you get more experienced and the novelty of sex will wear off (that doesn't mean it'll get boring, just that you will be more experienced and penis in vagina will be less new).\n\nYou could try condoms to see if that helps making you last longer, maybe you can get a male masturbator (pocket pussy) to 'train' lasting longer with a different sensation than your hand. Most of all, chill the fuck out ;)!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you both been tested before sex or were you both virgins? Is she on birth control?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s totally normal to not last very long. Lots of men, even when they&amp;#39;ve been sexually active for a long time, do not (always) last long. Nothing to be embarrassed about.&lt;/p&gt;\n\n&lt;p&gt;I think you should stop making such a big deal out of it at this stage. An understanding partner will find ways to enjoy their time with you even if you shoot your load after a minute. I am willing to bet money you will last longer as you get more experienced and the novelty of sex will wear off (that doesn&amp;#39;t mean it&amp;#39;ll get boring, just that you will be more experienced and penis in vagina will be less new).&lt;/p&gt;\n\n&lt;p&gt;You could try condoms to see if that helps making you last longer, maybe you can get a male masturbator (pocket pussy) to &amp;#39;train&amp;#39; lasting longer with a different sensation than your hand. Most of all, chill the fuck out ;)!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgapo7e", "score_hidden": false, "stickied": false, "created": 1492296173.0, "created_utc": 1492267373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgaq93y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RedHudson", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Practice makes perfect.  Ease up on yourself and come to realize this is not uncommon.  The very worst thing you can do is to berate yourself.  Relax.  You'll get the swing of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Practice makes perfect.  Ease up on yourself and come to realize this is not uncommon.  The very worst thing you can do is to berate yourself.  Relax.  You&amp;#39;ll get the swing of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgaq93y", "score_hidden": false, "stickied": false, "created": 1492297054.0, "created_utc": 1492268254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgary3w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jakefrederick1118", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Dude if I don't cum in under 10 minutes I'll just go numb and wait till I finish myself or she does some spectacular finish.  When I first started seeing it would get me close. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude if I don&amp;#39;t cum in under 10 minutes I&amp;#39;ll just go numb and wait till I finish myself or she does some spectacular finish.  When I first started seeing it would get me close. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgary3w", "score_hidden": false, "stickied": false, "created": 1492299489.0, "created_utc": 1492270689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgav257", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Soiche", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Flexing your pelvic muscles definitely fastens the process of cumming.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Flexing your pelvic muscles definitely fastens the process of cumming.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgav257", "score_hidden": false, "stickied": false, "created": 1492303856.0, "created_utc": 1492275056.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgayvur", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "more_than_a_feelin", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Dude calm down. That is how everyone is at first I think. My husband used to be this way at first... After not that long of having sex, he started 1) getting more used to the sensation etc 2)learning how to control it better. \n\nTry edging. Where right before you hit that point, you stop and kiss for a min. You can do this tons of times. Sometimes we do it just because we don't want to be done, not because he can't last. It works great for either.\n\nAlso we found that he lasts freaking forever when he smokes weed first...\n\nOr just get her off first with oral or whatever means then you're free to not let long because she already got hers....\n\nDon't let it get to your head because from what I understand, that is when it can really become a a issue to fix. Instead, recognize that this is how it is at first and you're fine... But that there is so much you can do to work on it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude calm down. That is how everyone is at first I think. My husband used to be this way at first... After not that long of having sex, he started 1) getting more used to the sensation etc 2)learning how to control it better. &lt;/p&gt;\n\n&lt;p&gt;Try edging. Where right before you hit that point, you stop and kiss for a min. You can do this tons of times. Sometimes we do it just because we don&amp;#39;t want to be done, not because he can&amp;#39;t last. It works great for either.&lt;/p&gt;\n\n&lt;p&gt;Also we found that he lasts freaking forever when he smokes weed first...&lt;/p&gt;\n\n&lt;p&gt;Or just get her off first with oral or whatever means then you&amp;#39;re free to not let long because she already got hers....&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t let it get to your head because from what I understand, that is when it can really become a a issue to fix. Instead, recognize that this is how it is at first and you&amp;#39;re fine... But that there is so much you can do to work on it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgayvur", "score_hidden": false, "stickied": false, "created": 1492309046.0, "created_utc": 1492280246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65ihr1", "likes": null, "replies": "", "user_reports": [], "id": "dgb0zj8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bigmre", "parent_id": "t3_65ihr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Like everyone before me said, relax and don't let this get into your head\n\nEven after all these years i (M44) find it varies a lot each time.  Sometimes pretty fast other times need to focus and try to get there.  One thing is that helps me if I can tell I'm getting there too fast is to get about 80% of the way to orgasm, pull out and play with her for a few minutes to get her hotter and give me a chance to cool off.  Usually when I get back to intercourse I will last much better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like everyone before me said, relax and don&amp;#39;t let this get into your head&lt;/p&gt;\n\n&lt;p&gt;Even after all these years i (M44) find it varies a lot each time.  Sometimes pretty fast other times need to focus and try to get there.  One thing is that helps me if I can tell I&amp;#39;m getting there too fast is to get about 80% of the way to orgasm, pull out and play with her for a few minutes to get her hotter and give me a chance to cool off.  Usually when I get back to intercourse I will last much better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgb0zj8", "score_hidden": false, "stickied": false, "created": 1492311923.0, "created_utc": 1492283123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]