[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If a girl makes a move or basically lets me know that&amp;#39;s she&amp;#39;s into me and down for sex I suddenly stop being attracted to her and just get scared and nervous. Like I really fancy this girl and want to fuck her and I am pretty horny all the time but she messaged me the other night telling me to come over and started sending nudes and I just got really nervous and made an excuse not to go. \nI&amp;#39;m an 18yo male I&amp;#39;ve had sex once before and I want to have sex a lot but I&amp;#39;ve had problems getting hard in the past so maybe I&amp;#39;m scared that will happen, anyone have a solution?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "If a girl makes a move or basically lets me know that's she's into me and down for sex I suddenly stop being attracted to her and just get scared and nervous. Like I really fancy this girl and want to fuck her and I am pretty horny all the time but she messaged me the other night telling me to come over and started sending nudes and I just got really nervous and made an excuse not to go. \nI'm an 18yo male I've had sex once before and I want to have sex a lot but I've had problems getting hard in the past so maybe I'm scared that will happen, anyone have a solution?", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65l6pl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 19, "report_reasons": null, "author": "Silt_Strider", "saved": false, "mod_reports": [], "name": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/65l6pl/sexual_anxiety_i_get_really_nervous_if_a_girl/", "num_reports": null, "locked": false, "stickied": false, "created": 1492316279.0, "url": "https://www.reddit.com/r/sex/comments/65l6pl/sexual_anxiety_i_get_really_nervous_if_a_girl/", "author_flair_text": null, "quarantine": false, "title": "[sexual anxiety] I get really nervous if a girl wants to have sex with me and I'm not sure why", "created_utc": 1492287479.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 21, "visited": false, "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbctb3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Silt_Strider", "parent_id": "t1_dgb5qca", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah the whole negative spiral thing does sound like it could be the problem. I'm just gonna start being honest and say to the girl that I'm nervous", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah the whole negative spiral thing does sound like it could be the problem. I&amp;#39;m just gonna start being honest and say to the girl that I&amp;#39;m nervous&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbctb3", "score_hidden": false, "stickied": false, "created": 1492328387.0, "created_utc": 1492299587.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgc2822", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MichuV5", "parent_id": "t1_dgb5qca", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Heh, had this probpem. Because of my hearth problems I have erectal dysfunction which was kinda depressing untill I told her about it. Now its just \"Well, at leadt my fingers and tongue are in good condition\" ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heh, had this probpem. Because of my hearth problems I have erectal dysfunction which was kinda depressing untill I told her about it. Now its just &amp;quot;Well, at leadt my fingers and tongue are in good condition&amp;quot; ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc2822", "score_hidden": false, "stickied": false, "created": 1492380530.0, "created_utc": 1492351730.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5qca", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "enjoyoutdoors", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "So, you are afraid that you won't be able to get it up? Yeah. that can mess you up.\n\nThe first thing you need to do is to admit that this is the underlying reason. Because there is no other way forward than to work with what you have.\n\nLet's start with the not-necessarily-obvious basic questions that you will be asked if you choose to see professional medical advice:\n\n* are you on any kind of medication? If you are, read up on if they can affect your ability to get it up.\n\n* have you previously had any kind of issues with hormonal production, in any way affecting your childhood to be out of the norm. (Either a late bloomer or a very early one? or perhaps that you grew very tall early, or that you are still very short? or anything that is even remotely related that could suggest that something has been a bit off for years already?)\n\n* is there any kind of traumatic experience in your past that you could involuntarily remember again when you end up in a sexual situation?\n\n* are you by any chance obese or almost malnourished? Both those things can mess you up, but the correlation is not always straightforward.\n\n* How is your sleeping pattern? Similar to most other people you know or standing out in comparison?\n\nThen, remember this, because it is important:\n\n* The first time it happened, it could have been just nerves. But the second time you were also nervous. Nervously afraid that it could happen again. And by then you had created a negative spiral that is pretty damn hard to get out of again. If this is what has happened to you, what you really need is a partner who is willing to give you enough time to regain your confidence again. And also how is willing to be with you so many times that you will prove to yourself statistically that you are back on track again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, you are afraid that you won&amp;#39;t be able to get it up? Yeah. that can mess you up.&lt;/p&gt;\n\n&lt;p&gt;The first thing you need to do is to admit that this is the underlying reason. Because there is no other way forward than to work with what you have.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s start with the not-necessarily-obvious basic questions that you will be asked if you choose to see professional medical advice:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;are you on any kind of medication? If you are, read up on if they can affect your ability to get it up.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;have you previously had any kind of issues with hormonal production, in any way affecting your childhood to be out of the norm. (Either a late bloomer or a very early one? or perhaps that you grew very tall early, or that you are still very short? or anything that is even remotely related that could suggest that something has been a bit off for years already?)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;is there any kind of traumatic experience in your past that you could involuntarily remember again when you end up in a sexual situation?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;are you by any chance obese or almost malnourished? Both those things can mess you up, but the correlation is not always straightforward.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;How is your sleeping pattern? Similar to most other people you know or standing out in comparison?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Then, remember this, because it is important:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The first time it happened, it could have been just nerves. But the second time you were also nervous. Nervously afraid that it could happen again. And by then you had created a negative spiral that is pretty damn hard to get out of again. If this is what has happened to you, what you really need is a partner who is willing to give you enough time to regain your confidence again. And also how is willing to be with you so many times that you will prove to yourself statistically that you are back on track again.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgb5qca", "score_hidden": false, "stickied": false, "created": 1492318329.0, "created_utc": 1492289529.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbwucv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Silt_Strider", "parent_id": "t1_dgbf5a2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I guess I have only been thinking about the actual penetration. Next time I'll be more into foreplay and making sure she feels good. P.S I live in the UK so I can have a few drinks but I find it kind of numbs me so not very useful haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I have only been thinking about the actual penetration. Next time I&amp;#39;ll be more into foreplay and making sure she feels good. P.S I live in the UK so I can have a few drinks but I find it kind of numbs me so not very useful haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbwucv", "score_hidden": false, "stickied": false, "created": 1492367589.0, "created_utc": 1492338789.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbf5a2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tenebris_alietum", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Let's say you went over to see that girl - there's no need to rush.  Take your time, talk for a while, slowly undress her, touch her everwhere, give her a backrub, go down on her, and basically just do non-PIV things to her until your nervousness goes away.  If it doesn't go away, at least you pleased her, so that gives you a good possibility there may be a next time, and just tell her you are nervous.  \n\nIf she gets mad at you for being nervous, or otherwise mean, leave, and don't see her again.  That's the worst that can happen.  There's plenty of women out there, so don't even worry if you run into that.\n\nWhen you are 21, you should have a drink or two when you meet a woman, before getting down and dirty.\n\nBut always go if you get these opportunities.  Throw yourself in the situation and confront your fear.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s say you went over to see that girl - there&amp;#39;s no need to rush.  Take your time, talk for a while, slowly undress her, touch her everwhere, give her a backrub, go down on her, and basically just do non-PIV things to her until your nervousness goes away.  If it doesn&amp;#39;t go away, at least you pleased her, so that gives you a good possibility there may be a next time, and just tell her you are nervous.  &lt;/p&gt;\n\n&lt;p&gt;If she gets mad at you for being nervous, or otherwise mean, leave, and don&amp;#39;t see her again.  That&amp;#39;s the worst that can happen.  There&amp;#39;s plenty of women out there, so don&amp;#39;t even worry if you run into that.&lt;/p&gt;\n\n&lt;p&gt;When you are 21, you should have a drink or two when you meet a woman, before getting down and dirty.&lt;/p&gt;\n\n&lt;p&gt;But always go if you get these opportunities.  Throw yourself in the situation and confront your fear.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbf5a2", "score_hidden": false, "stickied": false, "created": 1492331691.0, "created_utc": 1492302891.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbh4hm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EMinor7", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It is possible it may be the adrenaline that's causing that nervousness. I can remember every time I thought I was being propositioned and reacting pretty badly in that way, especially worrying about not being hard enough or attractive enough otherwise.\n\nYou're a young guy so I'd imagine that this will level out once you relax a bit more and become a bit more comfortable with the excitement. I'd say the key is in learning to be in the moment.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is possible it may be the adrenaline that&amp;#39;s causing that nervousness. I can remember every time I thought I was being propositioned and reacting pretty badly in that way, especially worrying about not being hard enough or attractive enough otherwise.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re a young guy so I&amp;#39;d imagine that this will level out once you relax a bit more and become a bit more comfortable with the excitement. I&amp;#39;d say the key is in learning to be in the moment.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbh4hm", "score_hidden": false, "stickied": false, "created": 1492334488.0, "created_utc": 1492305688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbwszo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Silt_Strider", "parent_id": "t1_dgbl0st", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Hey thanks this is very helpful, the one thing is that I'm not only worried what the girl thinks cause in the past they've been pretty understanding but when my friends or her friends find that's when I feel like a failure. I guess I just need to stop caring and aim to just have a good time with or without penetration ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey thanks this is very helpful, the one thing is that I&amp;#39;m not only worried what the girl thinks cause in the past they&amp;#39;ve been pretty understanding but when my friends or her friends find that&amp;#39;s when I feel like a failure. I guess I just need to stop caring and aim to just have a good time with or without penetration &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbwszo", "score_hidden": false, "stickied": false, "created": 1492367462.0, "created_utc": 1492338662.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbl0st", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TomahawkCruise", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is an insanely common problem. Especially at your age.\n\nSimply put, your mind is short-circuiting your dick and it doesn't work. Period.\n\nIt's ALL about getting comfortable. When you overanalyze the situation it only makes it worse. Fact is, your semi-fight or flight adrenaline is making it very hard for your dick to work properly. The key is either A) overcoming the nerves or B) using it to your advantage.\n\nSome tips that should help keep your brain from cock-blocking your dick:\n\n1. Always remember YOU are in control. Knowing that you can shut down sex anytime you feel like it helps substantially with the problem. Often times, the nerves come from feeling like you're going to be sucked into having sex with her when you don't really want to -- a recipe for disaster. Remember that is NOT the case. If you feel pressured into sex largely against your preference, shut it down. She has to respect your wishes every bit as much as us guys have to respect women's wishes when they aren't ready for it. I think you'll find that when you realize you have this power, a lot of those nerves will disappear.\n\n2. Downplay the consequences. What's the worst that could happen? That she will turn on you because you won't give her sex? Fine. If she does, she is doing you a favor. Don't waste your time with a woman like that.\n\n3. Communicate. It may sound like a conversation you don't want to have, but it will probably do you a world of good. 9 out of 10 women will understand and want to help you with the problem. Once you get over that obstacle, you will see your problem disappear within weeks.\n\n4. Re-purpose your nerves into excitement. Nerve-racked butterflies in the stomach and the adrenaline rush you feel skydiving from an airplane are the same feeling. We often don't recognize that. Thus, reconfigure your mind to view it that way. Try to develop those butterflies into intense, sexual energy. It takes a bit of practice, but it works. I used to struggle with the short-circuiting problem, too. Now, I can take those nerves and mold them into raging adrenaline that makes sex even better. Rechanneling your nerves into lustful desires will make sex an incredible rush for you. Work on it.\n\nDon't get discouraged. There is nothing wrong with you. Millions upon million of men have struggled with this problem at one time or another. We sometimes get intimidated by women because we are fearful of disappointing them in bed. You just gotta learn to say, fuck that noise. Be confident in yourself and don't be afraid to communicate the problem if you feel you have to. That's the first step to solving the problem and you will probably be surprised at the response you get from her. Because it really is a compliment to the woman.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is an insanely common problem. Especially at your age.&lt;/p&gt;\n\n&lt;p&gt;Simply put, your mind is short-circuiting your dick and it doesn&amp;#39;t work. Period.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s ALL about getting comfortable. When you overanalyze the situation it only makes it worse. Fact is, your semi-fight or flight adrenaline is making it very hard for your dick to work properly. The key is either A) overcoming the nerves or B) using it to your advantage.&lt;/p&gt;\n\n&lt;p&gt;Some tips that should help keep your brain from cock-blocking your dick:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Always remember YOU are in control. Knowing that you can shut down sex anytime you feel like it helps substantially with the problem. Often times, the nerves come from feeling like you&amp;#39;re going to be sucked into having sex with her when you don&amp;#39;t really want to -- a recipe for disaster. Remember that is NOT the case. If you feel pressured into sex largely against your preference, shut it down. She has to respect your wishes every bit as much as us guys have to respect women&amp;#39;s wishes when they aren&amp;#39;t ready for it. I think you&amp;#39;ll find that when you realize you have this power, a lot of those nerves will disappear.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Downplay the consequences. What&amp;#39;s the worst that could happen? That she will turn on you because you won&amp;#39;t give her sex? Fine. If she does, she is doing you a favor. Don&amp;#39;t waste your time with a woman like that.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Communicate. It may sound like a conversation you don&amp;#39;t want to have, but it will probably do you a world of good. 9 out of 10 women will understand and want to help you with the problem. Once you get over that obstacle, you will see your problem disappear within weeks.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Re-purpose your nerves into excitement. Nerve-racked butterflies in the stomach and the adrenaline rush you feel skydiving from an airplane are the same feeling. We often don&amp;#39;t recognize that. Thus, reconfigure your mind to view it that way. Try to develop those butterflies into intense, sexual energy. It takes a bit of practice, but it works. I used to struggle with the short-circuiting problem, too. Now, I can take those nerves and mold them into raging adrenaline that makes sex even better. Rechanneling your nerves into lustful desires will make sex an incredible rush for you. Work on it.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Don&amp;#39;t get discouraged. There is nothing wrong with you. Millions upon million of men have struggled with this problem at one time or another. We sometimes get intimidated by women because we are fearful of disappointing them in bed. You just gotta learn to say, fuck that noise. Be confident in yourself and don&amp;#39;t be afraid to communicate the problem if you feel you have to. That&amp;#39;s the first step to solving the problem and you will probably be surprised at the response you get from her. Because it really is a compliment to the woman.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbl0st", "score_hidden": false, "stickied": false, "created": 1492340203.0, "created_utc": 1492311403.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbqfez", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Stormtrooper445", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I had a similar issue. Was always super nervous when girls showed interest and made excuses whenever she sent clear signals. Finally once made plans again and was nervous and wanted to bail but couldn't and we ended up having sex (my first time)That helped me a lot, but I still has the urge to bail in the  future. So first piece of advice, just go through with it. I suffer from premature ejaculate on so that made me really self conscious. But. She didn't make a big deal of it. There are other ways to have sex what with your penis. \n\nSecond thing, I also have bad general anxiety so I eventually got some medications for that which help somewhat. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a similar issue. Was always super nervous when girls showed interest and made excuses whenever she sent clear signals. Finally once made plans again and was nervous and wanted to bail but couldn&amp;#39;t and we ended up having sex (my first time)That helped me a lot, but I still has the urge to bail in the  future. So first piece of advice, just go through with it. I suffer from premature ejaculate on so that made me really self conscious. But. She didn&amp;#39;t make a big deal of it. There are other ways to have sex what with your penis. &lt;/p&gt;\n\n&lt;p&gt;Second thing, I also have bad general anxiety so I eventually got some medications for that which help somewhat. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbqfez", "score_hidden": false, "stickied": false, "created": 1492349237.0, "created_utc": 1492320437.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbwoag", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Silt_Strider", "parent_id": "t1_dgblfdw", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I realize the porn itself may not be directly to blame but I am very used to relying on myself for orgasm and it feels so different when someone else is trying to do it. When I stop watching porn for a while I obviously want to orgasm really bad and become much more driven to have sex and yeah I know guys who watch more porn than me and have no problem having sex but everyone is different so that's not really relevant", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I realize the porn itself may not be directly to blame but I am very used to relying on myself for orgasm and it feels so different when someone else is trying to do it. When I stop watching porn for a while I obviously want to orgasm really bad and become much more driven to have sex and yeah I know guys who watch more porn than me and have no problem having sex but everyone is different so that&amp;#39;s not really relevant&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbwoag", "score_hidden": false, "stickied": false, "created": 1492367011.0, "created_utc": 1492338211.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgblfdw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TomahawkCruise", "parent_id": "t1_dgbcwbp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think you're barking up the wrong tree here. Porn isn't the problem.\n\nPorn always gets blamed for a lot of shit, but it's not responsible. Watching porn for masturbatory excitement is normal and does no harm.\n\nYou aren't getting nervous before sex because you watched that midget gangbang scene three days ago. You're nervous because you want your get-together to produce a satisfying result. That is where you need to target your efforts, at the root of the problem.\n\nFor every guy they can produce linking nerve-induced erectile dysfunction and web porn, I can show you 50 guys who watch just as much porn as you do (or more) and have no problem having sex with women.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re barking up the wrong tree here. Porn isn&amp;#39;t the problem.&lt;/p&gt;\n\n&lt;p&gt;Porn always gets blamed for a lot of shit, but it&amp;#39;s not responsible. Watching porn for masturbatory excitement is normal and does no harm.&lt;/p&gt;\n\n&lt;p&gt;You aren&amp;#39;t getting nervous before sex because you watched that midget gangbang scene three days ago. You&amp;#39;re nervous because you want your get-together to produce a satisfying result. That is where you need to target your efforts, at the root of the problem.&lt;/p&gt;\n\n&lt;p&gt;For every guy they can produce linking nerve-induced erectile dysfunction and web porn, I can show you 50 guys who watch just as much porn as you do (or more) and have no problem having sex with women.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgblfdw", "score_hidden": false, "stickied": false, "created": 1492340807.0, "created_utc": 1492312007.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbd01v", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ljjpaulsen", "parent_id": "t1_dgbcwbp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It's hard to break dude, but that being said, you don't actually have to stop watching it, you just have to build an alternate means of arousal that doesn't require you opening up tabs and browsing through clips.\n\nAnother route, a much more dangerous route in my opinion, is to find someone who is also into porn and just watch it with them, which leads to sex. I've done this, but it can be playing with fire for real because Porn is *powerful* and it will turn into a fuckshow fast if that follows.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard to break dude, but that being said, you don&amp;#39;t actually have to stop watching it, you just have to build an alternate means of arousal that doesn&amp;#39;t require you opening up tabs and browsing through clips.&lt;/p&gt;\n\n&lt;p&gt;Another route, a much more dangerous route in my opinion, is to find someone who is also into porn and just watch it with them, which leads to sex. I&amp;#39;ve done this, but it can be playing with fire for real because Porn is &lt;em&gt;powerful&lt;/em&gt; and it will turn into a fuckshow fast if that follows.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbd01v", "score_hidden": false, "stickied": false, "created": 1492328650.0, "created_utc": 1492299850.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcwbp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Silt_Strider", "parent_id": "t1_dgbb9th", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah I went a while without watching porn and did feel a lot better and confident. But pretty sure I'm addicted to the stuff cause always end up going back to bad habits", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I went a while without watching porn and did feel a lot better and confident. But pretty sure I&amp;#39;m addicted to the stuff cause always end up going back to bad habits&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbcwbp", "score_hidden": false, "stickied": false, "created": 1492328503.0, "created_utc": 1492299703.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbb9th", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ljjpaulsen", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Do you watch a lot of porn? A lot of things about porn can cause I guy to not be able to fuck, for a lot of reasons, one of which is psychological triggers and another is physicality. If you are watching porn a lot (at 18 I'm going to go to assume you at least watch it), you kind of train your body to go into erection mode when you're sitting and on top of that, make you accustom to a Massive amount of visual and auditory stimulus as opposed to Touch and smell, as well as social. Your best bet is to start masturbating w/out porn and then learn to masturbate, while standing up, etc. \n\nI ran with this by the way, because porn is incredibly common now and pretty much every 18 year old dude is watching a ton of it. (I watch porn all the time btw, I just also do the other shit to make sure I can get hard too)\n\ncheers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you watch a lot of porn? A lot of things about porn can cause I guy to not be able to fuck, for a lot of reasons, one of which is psychological triggers and another is physicality. If you are watching porn a lot (at 18 I&amp;#39;m going to go to assume you at least watch it), you kind of train your body to go into erection mode when you&amp;#39;re sitting and on top of that, make you accustom to a Massive amount of visual and auditory stimulus as opposed to Touch and smell, as well as social. Your best bet is to start masturbating w/out porn and then learn to masturbate, while standing up, etc. &lt;/p&gt;\n\n&lt;p&gt;I ran with this by the way, because porn is incredibly common now and pretty much every 18 year old dude is watching a ton of it. (I watch porn all the time btw, I just also do the other shit to make sure I can get hard too)&lt;/p&gt;\n\n&lt;p&gt;cheers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbb9th", "score_hidden": false, "stickied": false, "created": 1492326170.0, "created_utc": 1492297370.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgb8bmc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zmc88", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Relax x", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Relax x&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgb8bmc", "score_hidden": false, "stickied": false, "created": 1492321921.0, "created_utc": 1492293121.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgb9rv3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arie_R", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Why do you want to have sex? \n\nMaybe you just don't want to have sex with someone you don't know well and that's why you are anxious? Being horny is not always the same as wanting sex with someone else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you want to have sex? &lt;/p&gt;\n\n&lt;p&gt;Maybe you just don&amp;#39;t want to have sex with someone you don&amp;#39;t know well and that&amp;#39;s why you are anxious? Being horny is not always the same as wanting sex with someone else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgb9rv3", "score_hidden": false, "stickied": false, "created": 1492323966.0, "created_utc": 1492295166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbijb0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AskMeHowILostMyLeg", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Have you noticed similar things in other areas of your life? Could it be that you are averse to the imminent success? \n\nIf she's sending you nudes and giving you hints, you're probably going to have a good time with her, even if your performance is not so good at first. \n\nBut people may be scared of success, I remember there was even a name for it - something similar to cherophobia but not that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you noticed similar things in other areas of your life? Could it be that you are averse to the imminent success? &lt;/p&gt;\n\n&lt;p&gt;If she&amp;#39;s sending you nudes and giving you hints, you&amp;#39;re probably going to have a good time with her, even if your performance is not so good at first. &lt;/p&gt;\n\n&lt;p&gt;But people may be scared of success, I remember there was even a name for it - something similar to cherophobia but not that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbijb0", "score_hidden": false, "stickied": false, "created": 1492336547.0, "created_utc": 1492307747.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgcobno", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Silt_Strider", "parent_id": "t1_dgbzmgy", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "In all honesty I think I know what my problem is and I'm just going to try and be honest with women in future. I have not got anxiety at this level. I wish you luck sorting things out yourself", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In all honesty I think I know what my problem is and I&amp;#39;m just going to try and be honest with women in future. I have not got anxiety at this level. I wish you luck sorting things out yourself&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcobno", "score_hidden": false, "stickied": false, "created": 1492410290.0, "created_utc": 1492381490.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbzmgy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nice_flutin_ralphie", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I have the same issues. I was having breakfast at a cafe and the waitress who was flirting relentlessly with me the whole time gave  me her name and number on a bit of paper as I was leaving. \n\nWhat do I do? I panic, get a shit tonne of anxiety and throw it away. Its been about 5 months and I'm still too scared to go back to that cafe. I've organised dates in the past and had to bail on them because I got so caught up in my own head about a woman actively wanting me it made me throw up with nerves. \n\nMate, Im 21 and I know exactly what you're going through and you should really try and talk to someone preferably a therapist your anxiety probably permeates other areas of your life as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have the same issues. I was having breakfast at a cafe and the waitress who was flirting relentlessly with me the whole time gave  me her name and number on a bit of paper as I was leaving. &lt;/p&gt;\n\n&lt;p&gt;What do I do? I panic, get a shit tonne of anxiety and throw it away. Its been about 5 months and I&amp;#39;m still too scared to go back to that cafe. I&amp;#39;ve organised dates in the past and had to bail on them because I got so caught up in my own head about a woman actively wanting me it made me throw up with nerves. &lt;/p&gt;\n\n&lt;p&gt;Mate, Im 21 and I know exactly what you&amp;#39;re going through and you should really try and talk to someone preferably a therapist your anxiety probably permeates other areas of your life as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbzmgy", "score_hidden": false, "stickied": false, "created": 1492375532.0, "created_utc": 1492346732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65l6pl", "likes": null, "replies": "", "user_reports": [], "id": "dgbkgga", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AsAlwaysItDepends", "parent_id": "t1_dgbaya2", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Disrespectful comments aren't allowed here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Disrespectful comments aren&amp;#39;t allowed here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbkgga", "score_hidden": false, "stickied": false, "created": 1492339394.0, "created_utc": 1492310594.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbaya2", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65l6pl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgbaya2", "score_hidden": false, "stickied": false, "created": 1492325703.0, "created_utc": 1492296903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]