[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I 23m have been dating my 22f girlfriend for nearly 7 months now , in the beginning of our relationship she did say she&amp;#39;s fooled around with girls, but nothing too serious as it was limited to when she was drunk.\nBut as time went on I saw suspicious behavior from her, then through various means I saw that she had another Facebook account from which she was communicating with a specific girl from her past, when I found out, I was devastated, I couldn&amp;#39;t eat for days after that. after I confronted her about it, she broke down in tears and told me that she had in fact had a year long relationship with this girl, which was quite different from what she told me in the beginning, I then asked her if she still had romantic feelings, to which she said no, I said that if she did, I&amp;#39;d encourage her, I&amp;#39;d support her. I forgave her and I accepted her for who she was, but... Since we were in a serious monogamous relationship, or so I thought, I asked her if she could show me what they communicated, just general chit chat, and I thought that was that, I forgave her. She said she won&amp;#39;t do that again.\nThat unfortunately was a lie, she did once more, then again, and now a 4th time. The specifics are, that she feels that she has androgynous features, and that she pretended for that whole year in front of that girl, that she was a boy, and operated under a different name and made her voice to sound more male-ish. From what she told me, the other girl was not aware of her biological gender.&lt;/p&gt;\n\n&lt;p&gt;This 4th new Facebook account is not that different from the previous which I discovered and she removed and promised not to do it again, and then proceeded to do it again, in this new account she is again using her male persona, with photoshopped images of short hair, which she actually obsesses a lot over, and it&amp;#39;s putting a lot of pressure on me, because she doesn&amp;#39;t know what she wants to be, and lies to me, and it all centers around her previous girlfriend, who has a boyfriend of her own. I keep turning a blind eye, to avoid the truth, I keep forgiving her, but at some point I have to have some rest, closure, piece of mind.\nTell me reddit, should I confront her once again, risking for the final time our relationship, I know that I won&amp;#39;t ever meet another person like her, where we share common interests and even common life experiences. That&amp;#39;s why it&amp;#39;s difficult.\nIf she wants to be a boy, or be with girls, that is her choice and I will support her, but she says she loves me, that she can&amp;#39;t live without me, that her &amp;quot;past&amp;quot; was too hard on her, that it was mentally heavy, yet she keeps living this dual identity life, keeping it a secret from me, while telling me it&amp;#39;s all behind her. 😓&lt;/p&gt;\n\n&lt;p&gt;Obviously there are more stuff that I have not written about, but I simply can&amp;#39;t, that&amp;#39;s 7 months of memories and stuff. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I 23m have been dating my 22f girlfriend for nearly 7 months now , in the beginning of our relationship she did say she's fooled around with girls, but nothing too serious as it was limited to when she was drunk.\nBut as time went on I saw suspicious behavior from her, then through various means I saw that she had another Facebook account from which she was communicating with a specific girl from her past, when I found out, I was devastated, I couldn't eat for days after that. after I confronted her about it, she broke down in tears and told me that she had in fact had a year long relationship with this girl, which was quite different from what she told me in the beginning, I then asked her if she still had romantic feelings, to which she said no, I said that if she did, I'd encourage her, I'd support her. I forgave her and I accepted her for who she was, but... Since we were in a serious monogamous relationship, or so I thought, I asked her if she could show me what they communicated, just general chit chat, and I thought that was that, I forgave her. She said she won't do that again.\nThat unfortunately was a lie, she did once more, then again, and now a 4th time. The specifics are, that she feels that she has androgynous features, and that she pretended for that whole year in front of that girl, that she was a boy, and operated under a different name and made her voice to sound more male-ish. From what she told me, the other girl was not aware of her biological gender.\n\nThis 4th new Facebook account is not that different from the previous which I discovered and she removed and promised not to do it again, and then proceeded to do it again, in this new account she is again using her male persona, with photoshopped images of short hair, which she actually obsesses a lot over, and it's putting a lot of pressure on me, because she doesn't know what she wants to be, and lies to me, and it all centers around her previous girlfriend, who has a boyfriend of her own. I keep turning a blind eye, to avoid the truth, I keep forgiving her, but at some point I have to have some rest, closure, piece of mind.\nTell me reddit, should I confront her once again, risking for the final time our relationship, I know that I won't ever meet another person like her, where we share common interests and even common life experiences. That's why it's difficult.\nIf she wants to be a boy, or be with girls, that is her choice and I will support her, but she says she loves me, that she can't live without me, that her \"past\" was too hard on her, that it was mentally heavy, yet she keeps living this dual identity life, keeping it a secret from me, while telling me it's all behind her. 😓\n\nObviously there are more stuff that I have not written about, but I simply can't, that's 7 months of memories and stuff. ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65p8tp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 82, "report_reasons": null, "author": "3453confused", "saved": false, "mod_reports": [], "name": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/65p8tp/sexuality_my_girlfriend_is_struggling_with_her/", "num_reports": null, "locked": false, "stickied": false, "created": 1492380243.0, "url": "https://www.reddit.com/r/sex/comments/65p8tp/sexuality_my_girlfriend_is_struggling_with_her/", "author_flair_text": null, "quarantine": false, "title": "[Sexuality] My girlfriend is struggling with her sexuality and gender identity.", "created_utc": 1492351443.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 22, "visited": false, "subreddit_type": "public", "ups": 82}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgc4fkw", "gilded": 0, "archived": false, "score": 96, "report_reasons": null, "author": "_SadWalrus_", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "In my experience, you can love and support someone 100%, but if they won't be honest with you, it's rather difficult to stay in a relationship of any kind.  It sounds to me that you will have to have another discussion.  Counseling with a sex-positive therapist can also help her integrate this sense of duality and discover the true issue, whether that's gender identity, sexuality, or both.  Whatever you decide, I think more communication is in order: sweeping it under the rug benefits neither of you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience, you can love and support someone 100%, but if they won&amp;#39;t be honest with you, it&amp;#39;s rather difficult to stay in a relationship of any kind.  It sounds to me that you will have to have another discussion.  Counseling with a sex-positive therapist can also help her integrate this sense of duality and discover the true issue, whether that&amp;#39;s gender identity, sexuality, or both.  Whatever you decide, I think more communication is in order: sweeping it under the rug benefits neither of you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc4fkw", "score_hidden": false, "stickied": false, "created": 1492383954.0, "created_utc": 1492355154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 96}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgc4pcg", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "babycrow", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'm sorry but emotionally dishonesty is a relationship killer. You should probably cut out. Cold but it's not fair for someone to be your partner and treat you in such a way. You're clearly open and loving. This person is not treating you like they really are on the team, ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry but emotionally dishonesty is a relationship killer. You should probably cut out. Cold but it&amp;#39;s not fair for someone to be your partner and treat you in such a way. You&amp;#39;re clearly open and loving. This person is not treating you like they really are on the team, &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc4pcg", "score_hidden": false, "stickied": false, "created": 1492384346.0, "created_utc": 1492355546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgc52hl", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "Kit4000", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "The sexuality is one thing but lying and sneaking around is another. It was difficult and mentally heavy but she keeps attwmpting to love that life even if online. Stop turning a blind eye you are just aiding her dishonesty to herself and her violation of your trust and relationship.\n\nConfronting her is not risking the relationship, she is risking the relationship every time she lies to you.\n\nShe needs to get help to comes to terms with herself. If you want to be there dor her as a friend, awesome but to continue a romantic relationship with this person isn't healthy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The sexuality is one thing but lying and sneaking around is another. It was difficult and mentally heavy but she keeps attwmpting to love that life even if online. Stop turning a blind eye you are just aiding her dishonesty to herself and her violation of your trust and relationship.&lt;/p&gt;\n\n&lt;p&gt;Confronting her is not risking the relationship, she is risking the relationship every time she lies to you.&lt;/p&gt;\n\n&lt;p&gt;She needs to get help to comes to terms with herself. If you want to be there dor her as a friend, awesome but to continue a romantic relationship with this person isn&amp;#39;t healthy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc52hl", "score_hidden": false, "stickied": false, "created": 1492384857.0, "created_utc": 1492356057.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgcfihf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "GeekCat", "parent_id": "t1_dgc56rm", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": " It definitely sounds like there's something mentally wrong with her, and I don't mean gender identity/sexuality. Several Facebook accounts, lying, and a possible relationship that was over a year long, but she pretended to be a man for a year. There's definitely something hinky....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It definitely sounds like there&amp;#39;s something mentally wrong with her, and I don&amp;#39;t mean gender identity/sexuality. Several Facebook accounts, lying, and a possible relationship that was over a year long, but she pretended to be a man for a year. There&amp;#39;s definitely something hinky....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcfihf", "score_hidden": false, "stickied": false, "created": 1492398774.0, "created_utc": 1492369974.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc56rm", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Acrolith", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; The specifics are, that she feels that she has androgynous features, and that she pretended for that whole year in front of that girl, that she was a boy, and operated under a different name and made her voice to sound more male-ish. From what she told me, the other girl was not aware of her biological gender.\n\nWell, the main problem appears to be that you are living in an operetta. I suggest wacky hijinks and misunderstandings until the big climactic song in Act 3 makes everything better.\n\nOkay now that's off my chest\n\n&gt; she had in fact had a year long relationship with this girl\n\n&gt; From what she told me, the other girl was not aware of her biological gender.\n\nWell, I'm properly confused. What kind of a \"relationship\" was this? Because clearly, not a sexual one.\n\nSomething about this whole story is *weird*, and I was only half joking with my operetta comment. I'm not sure if your girlfriend is actually into this other girl, or if she's more into her own persona, or she just loves the drama of the whole situation.\n\nThis is simply *not* normal behavior, I don't care what her gender/sexual identity is. In fact, I think the whole \"gender/sexual identity\" aspect of this is a smokescreen, and not what you should be focusing on.\n\n&gt; Obviously there are more stuff that I have not written about, but I simply can't, that's 7 months of memories and stuff. \n\nI think it would help if you did. I don't think we have enough information to give you useful advice. This puzzle is missing some pieces.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The specifics are, that she feels that she has androgynous features, and that she pretended for that whole year in front of that girl, that she was a boy, and operated under a different name and made her voice to sound more male-ish. From what she told me, the other girl was not aware of her biological gender.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, the main problem appears to be that you are living in an operetta. I suggest wacky hijinks and misunderstandings until the big climactic song in Act 3 makes everything better.&lt;/p&gt;\n\n&lt;p&gt;Okay now that&amp;#39;s off my chest&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;she had in fact had a year long relationship with this girl&lt;/p&gt;\n\n&lt;p&gt;From what she told me, the other girl was not aware of her biological gender.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, I&amp;#39;m properly confused. What kind of a &amp;quot;relationship&amp;quot; was this? Because clearly, not a sexual one.&lt;/p&gt;\n\n&lt;p&gt;Something about this whole story is &lt;em&gt;weird&lt;/em&gt;, and I was only half joking with my operetta comment. I&amp;#39;m not sure if your girlfriend is actually into this other girl, or if she&amp;#39;s more into her own persona, or she just loves the drama of the whole situation.&lt;/p&gt;\n\n&lt;p&gt;This is simply &lt;em&gt;not&lt;/em&gt; normal behavior, I don&amp;#39;t care what her gender/sexual identity is. In fact, I think the whole &amp;quot;gender/sexual identity&amp;quot; aspect of this is a smokescreen, and not what you should be focusing on.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Obviously there are more stuff that I have not written about, but I simply can&amp;#39;t, that&amp;#39;s 7 months of memories and stuff. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think it would help if you did. I don&amp;#39;t think we have enough information to give you useful advice. This puzzle is missing some pieces.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc56rm", "score_hidden": false, "stickied": false, "created": 1492385024.0, "created_utc": 1492356224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgc7imk", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ghost-texts", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "The whole \"can't live without you\" phrase is very emotionally abusive by the way. My past abuser would say this all the time when I threatened to leave him finally because of his behavior and cheating. \n\nMy advice is to cut the cord. This girl obviously doesn't give a damn wether you are hurt in the process of her bullshit. If she needs to \"find out who she is\", she can do that without dragging you along. There is no reason for her to continue doing the thing she said she's so sorry for unless she doesn't mean it. Cheaters will keep cheating generally until you leave.  You deserve better than this bullshit and it's not fair. \n\n\nFool me once shame on you, fool me four times...? Leave their ass. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The whole &amp;quot;can&amp;#39;t live without you&amp;quot; phrase is very emotionally abusive by the way. My past abuser would say this all the time when I threatened to leave him finally because of his behavior and cheating. &lt;/p&gt;\n\n&lt;p&gt;My advice is to cut the cord. This girl obviously doesn&amp;#39;t give a damn wether you are hurt in the process of her bullshit. If she needs to &amp;quot;find out who she is&amp;quot;, she can do that without dragging you along. There is no reason for her to continue doing the thing she said she&amp;#39;s so sorry for unless she doesn&amp;#39;t mean it. Cheaters will keep cheating generally until you leave.  You deserve better than this bullshit and it&amp;#39;s not fair. &lt;/p&gt;\n\n&lt;p&gt;Fool me once shame on you, fool me four times...? Leave their ass. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc7imk", "score_hidden": false, "stickied": false, "created": 1492388197.0, "created_utc": 1492359397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgca0f2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "CaptainBlackPeacock", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Break it off, man. She clearly doesn't respect you. It's not worth all that drama and stress she's bringing you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Break it off, man. She clearly doesn&amp;#39;t respect you. It&amp;#39;s not worth all that drama and stress she&amp;#39;s bringing you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgca0f2", "score_hidden": false, "stickied": false, "created": 1492391457.0, "created_utc": 1492362657.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgc5uwi", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "my002", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It's hard to tell from your post if your partner is hung up on a specific person from her past or if she's just really interested in creating a male persona for herself (or some combination of the two). In any case, this is something she needs to sort out (preferably with the help of a sex-positive therapist) before she can have a serious monogamous relationship (which I presume is what you want). She clearly doesn't feel that she has sufficient space to sort out these issues within the bounds of your relationship (which she has now violated several times), so it sounds like it would benefit both of you to break it off until she has figured out these issues. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard to tell from your post if your partner is hung up on a specific person from her past or if she&amp;#39;s just really interested in creating a male persona for herself (or some combination of the two). In any case, this is something she needs to sort out (preferably with the help of a sex-positive therapist) before she can have a serious monogamous relationship (which I presume is what you want). She clearly doesn&amp;#39;t feel that she has sufficient space to sort out these issues within the bounds of your relationship (which she has now violated several times), so it sounds like it would benefit both of you to break it off until she has figured out these issues. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc5uwi", "score_hidden": false, "stickied": false, "created": 1492385945.0, "created_utc": 1492357145.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgc9nsi", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "dtmfadvice", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She needs therapy and a supportive friend, not a boyfriend right now.\n\nAnd you need to be dating someone who is sure she's into you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She needs therapy and a supportive friend, not a boyfriend right now.&lt;/p&gt;\n\n&lt;p&gt;And you need to be dating someone who is sure she&amp;#39;s into you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc9nsi", "score_hidden": false, "stickied": false, "created": 1492390991.0, "created_utc": 1492362191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgcdv6w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "swellblitz", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "As trans guy I've been in that confusing period of life, too. Because of my situation I also turned to getting romantically attached or involved with people online. Of course this was purely on the emotional level as sex wasn't possible (aside from phone sex which I definitely did), and this was perfect because I didn't want anyone to see my body. Why would I? It wasn't the body I felt was mine, I didn't want anybody to see me in my female body. \n\nMy relationships with people online were incredibly intense and though there was distance I still don't hesitate to say I was in a relationship with whoever. Emotionally, we were completely invested in the other and it was fantastic. \n\nDuring all of this though, I was never dishonest. Before meeting people I would definitely present as male, though never in photos just in the chats I'd find friends and such. This still wasn't a lie because ultimately that's who I am, the physical body just hadn't met me there haha. Though I did this, if there was somebody I was interested in I told them as soon as I felt something could be there. Their acceptance is a huge factor in whether things will work out. If I'm with someone I should be able to tell them everything, and before I started medically transitioning a lot of my everyday was consumed by being trans so to have to be silent about it all the time? I couldn't do that. \n\nIn that regard I have some degree of sympathy for your partner. I'm sure they're having a hard time mentally. That's all I have sympathy for though as they are the ones who are putting themselves in this position. They are lying to you and lying to this poor girl online. This girl is being taken on a years long ride for nothing. You're not so far in so you're lucky that way. I think you need to end things not only for yourself but for your partner. They can not keep living like this as it's incredibly toxic for everyone, especially their self. \n\nYou will not be able to figure out their identity for them. This is a completely individual journey and you will just be in the way. You already are actually because they're doing all this behind your back. This isn't your fault though, and I'm sorry you've ended up here. It's not the best situation at all. They need the freedom to try cutting their hair without a boyfriend potentially judging them. They need to be able to ask those around them to call them by that name. They need the freedom to not do that stuff, too. It needs to be them that has decided what to do with no influences from people who are close. \n\nTL;DR: I'm a trans guy and know what they're going through. It's not okay however to be dishonest to others and their own self. You need to end things so they can figure out things on their own. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As trans guy I&amp;#39;ve been in that confusing period of life, too. Because of my situation I also turned to getting romantically attached or involved with people online. Of course this was purely on the emotional level as sex wasn&amp;#39;t possible (aside from phone sex which I definitely did), and this was perfect because I didn&amp;#39;t want anyone to see my body. Why would I? It wasn&amp;#39;t the body I felt was mine, I didn&amp;#39;t want anybody to see me in my female body. &lt;/p&gt;\n\n&lt;p&gt;My relationships with people online were incredibly intense and though there was distance I still don&amp;#39;t hesitate to say I was in a relationship with whoever. Emotionally, we were completely invested in the other and it was fantastic. &lt;/p&gt;\n\n&lt;p&gt;During all of this though, I was never dishonest. Before meeting people I would definitely present as male, though never in photos just in the chats I&amp;#39;d find friends and such. This still wasn&amp;#39;t a lie because ultimately that&amp;#39;s who I am, the physical body just hadn&amp;#39;t met me there haha. Though I did this, if there was somebody I was interested in I told them as soon as I felt something could be there. Their acceptance is a huge factor in whether things will work out. If I&amp;#39;m with someone I should be able to tell them everything, and before I started medically transitioning a lot of my everyday was consumed by being trans so to have to be silent about it all the time? I couldn&amp;#39;t do that. &lt;/p&gt;\n\n&lt;p&gt;In that regard I have some degree of sympathy for your partner. I&amp;#39;m sure they&amp;#39;re having a hard time mentally. That&amp;#39;s all I have sympathy for though as they are the ones who are putting themselves in this position. They are lying to you and lying to this poor girl online. This girl is being taken on a years long ride for nothing. You&amp;#39;re not so far in so you&amp;#39;re lucky that way. I think you need to end things not only for yourself but for your partner. They can not keep living like this as it&amp;#39;s incredibly toxic for everyone, especially their self. &lt;/p&gt;\n\n&lt;p&gt;You will not be able to figure out their identity for them. This is a completely individual journey and you will just be in the way. You already are actually because they&amp;#39;re doing all this behind your back. This isn&amp;#39;t your fault though, and I&amp;#39;m sorry you&amp;#39;ve ended up here. It&amp;#39;s not the best situation at all. They need the freedom to try cutting their hair without a boyfriend potentially judging them. They need to be able to ask those around them to call them by that name. They need the freedom to not do that stuff, too. It needs to be them that has decided what to do with no influences from people who are close. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: I&amp;#39;m a trans guy and know what they&amp;#39;re going through. It&amp;#39;s not okay however to be dishonest to others and their own self. You need to end things so they can figure out things on their own. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcdv6w", "score_hidden": false, "stickied": false, "created": 1492396573.0, "created_utc": 1492367773.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgchqmd", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "nsaucie", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "4 times in 7 months man...no matter what her gender confusion is about, she's a cheater dude. You haven't been together that long...cut your ties and let her figure it out on her own, u don't need problems like that for years and years to come.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;4 times in 7 months man...no matter what her gender confusion is about, she&amp;#39;s a cheater dude. You haven&amp;#39;t been together that long...cut your ties and let her figure it out on her own, u don&amp;#39;t need problems like that for years and years to come.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgchqmd", "score_hidden": false, "stickied": false, "created": 1492401687.0, "created_utc": 1492372887.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgc9ykm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "badhairguy", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She is constantly lying to you and deceiving you without a single care about your feelings. Run. As fast as you can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She is constantly lying to you and deceiving you without a single care about your feelings. Run. As fast as you can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgc9ykm", "score_hidden": false, "stickied": false, "created": 1492391388.0, "created_utc": 1492362588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgca6lk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "javanator999", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Her exploring her persona and sexuality is an ok thing. But, she owes it to you to be honest about it and not lie or cheat on you. She is not acting ethically in all this. And not only is she lying to you, but she lied to the girl that was told she is a guy. None of this is ok.\n\nI'd vote for giving her space and time (like a whole life time) to work this out while you go find someone that will be honest with you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Her exploring her persona and sexuality is an ok thing. But, she owes it to you to be honest about it and not lie or cheat on you. She is not acting ethically in all this. And not only is she lying to you, but she lied to the girl that was told she is a guy. None of this is ok.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d vote for giving her space and time (like a whole life time) to work this out while you go find someone that will be honest with you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgca6lk", "score_hidden": false, "stickied": false, "created": 1492391684.0, "created_utc": 1492362884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgccprx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Karupi", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Cut her off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cut her off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgccprx", "score_hidden": false, "stickied": false, "created": 1492395024.0, "created_utc": 1492366224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgcmcn6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "nicktheone", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She really sounds dishonest and not worthy of trust. All this blabber about her identity/sexuality is a cover to feel free to keep doing what she wants. I'd be ok if she wanted to explore other sides of her while maintaining a trustworthy attitude but at this point you're just getting exploited emotionally by her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She really sounds dishonest and not worthy of trust. All this blabber about her identity/sexuality is a cover to feel free to keep doing what she wants. I&amp;#39;d be ok if she wanted to explore other sides of her while maintaining a trustworthy attitude but at this point you&amp;#39;re just getting exploited emotionally by her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcmcn6", "score_hidden": false, "stickied": false, "created": 1492407676.0, "created_utc": 1492378876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgcgmwb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dawgz525", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You should breakup with her immediately bc she has continually lied to you. Let her figure out her gender identity and sexuality on her own. You don't need to stand by someone that won't standby you. Sorry man, that sucks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should breakup with her immediately bc she has continually lied to you. Let her figure out her gender identity and sexuality on her own. You don&amp;#39;t need to stand by someone that won&amp;#39;t standby you. Sorry man, that sucks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcgmwb", "score_hidden": false, "stickied": false, "created": 1492400246.0, "created_utc": 1492371446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgcsrdi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CreepinDeep", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If she was messaging a dude behind ur back, that was an ex. It would be a different story. Treat it as such.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she was messaging a dude behind ur back, that was an ex. It would be a different story. Treat it as such.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcsrdi", "score_hidden": false, "stickied": false, "created": 1492416367.0, "created_utc": 1492387567.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgcczqf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PoopFromMyButt", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sounds less like she's struggling with identity, and more like she's learning to con people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds less like she&amp;#39;s struggling with identity, and more like she&amp;#39;s learning to con people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcczqf", "score_hidden": false, "stickied": false, "created": 1492395394.0, "created_utc": 1492366594.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgcea2p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pixiegod", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I know EXACTLY how you feel right now. \r\n\r\nThe first great love of my life did this to me. It took me 8 times of going back to realize that it just wasn't our time. Coincidentally, that event also taught me that women under 25 have a ton of exploring to do.\r\n\r\nLook man, the only bad here is that she hasn't found her voice yet and can't tell you the truth. Her discovering herself is not the issue here... the lying is. You have one of two choices. Stay or leave. \r\n\r\nLeaving is probably safest considering the precedence of lying that has already been established. It has been proven she can lie and get away with it... which sadly leads to more lying.\r\n\r\nThis being said I totally understand trying to make it work... you have 4 more \"I forgive you\" moments to catch up to my high score. Just know if you stay that there is a good chance she will lie to you again... she is still figuring things out, which is ok. This being said, don't let her destroy you on her path to self discovery. It took me years of bitterness to get over my 8...years I wouldn't want to wish on anyone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know EXACTLY how you feel right now. &lt;/p&gt;\n\n&lt;p&gt;The first great love of my life did this to me. It took me 8 times of going back to realize that it just wasn&amp;#39;t our time. Coincidentally, that event also taught me that women under 25 have a ton of exploring to do.&lt;/p&gt;\n\n&lt;p&gt;Look man, the only bad here is that she hasn&amp;#39;t found her voice yet and can&amp;#39;t tell you the truth. Her discovering herself is not the issue here... the lying is. You have one of two choices. Stay or leave. &lt;/p&gt;\n\n&lt;p&gt;Leaving is probably safest considering the precedence of lying that has already been established. It has been proven she can lie and get away with it... which sadly leads to more lying.&lt;/p&gt;\n\n&lt;p&gt;This being said I totally understand trying to make it work... you have 4 more &amp;quot;I forgive you&amp;quot; moments to catch up to my high score. Just know if you stay that there is a good chance she will lie to you again... she is still figuring things out, which is ok. This being said, don&amp;#39;t let her destroy you on her path to self discovery. It took me years of bitterness to get over my 8...years I wouldn&amp;#39;t want to wish on anyone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcea2p", "score_hidden": false, "stickied": false, "created": 1492397126.0, "created_utc": 1492368326.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgcfrev", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lilrabbitfoofoo", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sometimes, we care for someone long enough for them to heal and then leave the nest we built for them.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes, we care for someone long enough for them to heal and then leave the nest we built for them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcfrev", "score_hidden": false, "stickied": false, "created": 1492399101.0, "created_utc": 1492370301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgd74rw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Route66Hippy", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This parable attributed to Aesop, native American tradition, and various antiquated sources might fit here. \n\nAn old woman was walking down the road when she saw a gang of thugs\nbeating a poisonous snake. She screamed at the thugs and rescued the\nsnake, taking it back to her home where she nursed it back to health.\n\nOne day on their way into town, the woman picked up the snake and he\nbit her repeatedly. “Oh God,” she screamed, “I am dying. I am dying!”\nShe turned to the snake and looked it in the eyes. “I saved your life.\nI was your friend. I trusted you. Why did you bite me?”\n\nThe snake turned to face her as she drew he final breath and hissed,\n\n“What did you expect? You knew I was a snake when you took me home.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This parable attributed to Aesop, native American tradition, and various antiquated sources might fit here. &lt;/p&gt;\n\n&lt;p&gt;An old woman was walking down the road when she saw a gang of thugs\nbeating a poisonous snake. She screamed at the thugs and rescued the\nsnake, taking it back to her home where she nursed it back to health.&lt;/p&gt;\n\n&lt;p&gt;One day on their way into town, the woman picked up the snake and he\nbit her repeatedly. “Oh God,” she screamed, “I am dying. I am dying!”\nShe turned to the snake and looked it in the eyes. “I saved your life.\nI was your friend. I trusted you. Why did you bite me?”&lt;/p&gt;\n\n&lt;p&gt;The snake turned to face her as she drew he final breath and hissed,&lt;/p&gt;\n\n&lt;p&gt;“What did you expect? You knew I was a snake when you took me home.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd74rw", "score_hidden": false, "stickied": false, "created": 1492438542.0, "created_utc": 1492409742.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65p8tp", "likes": null, "replies": "", "user_reports": [], "id": "dgda4aq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JunahCg", "parent_id": "t3_65p8tp", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You can support her all you want, but if you can't trust her it's already over.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can support her all you want, but if you can&amp;#39;t trust her it&amp;#39;s already over.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgda4aq", "score_hidden": false, "stickied": false, "created": 1492446515.0, "created_utc": 1492417715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]