[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recently, I&amp;#39;ve started going out with an amazing girl. I know every girl a guy goes out with is &amp;quot;amazing&amp;quot; on reddit, but she genuinely is. I could gush about how awesome she is for hours without even having to mention that she&amp;#39;s gorgeous, which could prolong it into a day or two.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve known each other about two years, met through friends and really bonded quickly. We have alot of common intrests, share a sense of humour, and became good friends after a while. For about the last year we&amp;#39;ve been spending alot of time together and somewhere along the line I&amp;#39;ve realised I was crushing hard on her (I know, I spent alot of time with a great person of the opposite sex and delevoped a crush, I&amp;#39;m a basic bitch flavoured like pumpkin spice).&lt;/p&gt;\n\n&lt;p&gt;I had feelings she had similar feelings to me, but I was too nervous to test it for the obvious reasons - great friendship, out of my league, etc... and one thing that I&amp;#39;m now ashamed to admit put doubt in my head. She&amp;#39;s paralysed from the waist down and wheelchairbound.&lt;/p&gt;\n\n&lt;p&gt;Now this didn&amp;#39;t bother me in the way you might be thinking - that I&amp;#39;m some shallow guy who &amp;quot;could never date a girl in a wheelchair, ewwww.&amp;quot; Fuck that. It was really about not knowing how to care for her, deal with some of her issues, connect with some of the problems she had, etc... A few times I became a shoulder to cry on for her, but I honestly couldn&amp;#39;t say &amp;quot;I know how you feel&amp;quot; because I obviously have no clue what it&amp;#39;s like to be disabled and that made me feel like I could never be with her.&lt;/p&gt;\n\n&lt;p&gt;But the more I&amp;#39;ve hung out with her the more I&amp;#39;ve learned what it&amp;#39;s all about, what she needs, what&amp;#39;s no problem actually, etc... So for the last month or two it was really a case of fearing I still wouldn&amp;#39;t ever be able to &amp;quot;get&amp;quot; her.&lt;/p&gt;\n\n&lt;p&gt;But a few nights ago, we went out with some friends and got drunk and I was her &amp;quot;designated driver&amp;quot; to get her home. (Me being her driver is kind of a running joke we&amp;#39;ve got). On the way home, we were laughing and joking the way we usually do when she just broke the fuck down. She&amp;#39;s such a strong person, so I&amp;#39;d never seen her like this. She starts saying about how she really likes me, how she knows it&amp;#39;s unrealistic for me to want to be with her, etc... I felt horrid because here was this angel having a breakdown and fireworks are basically going off in my mind while Godzilla dances to Kool and the Gang&amp;#39;s Celebrate.&lt;/p&gt;\n\n&lt;p&gt;In that moment I grew some balls, leant down, and kissed her. Holy fuck what a kiss. She even swung herself around me to hold onto me. It was incredible. When we broke apart I basically pleaded with her to be my girlfriend, she actually had the balls to argue after giving me the best kiss I&amp;#39;ve ever had, and I finally talked her into going out with me. She broke down harder, but it was a happy breakdown (stupid as that sounds). So I take her home, as we both air out how much we&amp;#39;ve liked each other for so long. Got to her apartment block, she said it had been such an amazing night but she hoped I wouldn&amp;#39;t mind if she didn&amp;#39;t invite me up &amp;quot;for coffee.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Honestly, I was still a little tipsy from the kiss. So the idea of sex hadn&amp;#39;t even crossed my mind. And oc I wasn&amp;#39;t going to pressure her into sex. So I just asked for one more kiss (which I got, FUCK YEAH!) and agreed we&amp;#39;d see each other the next day.&lt;/p&gt;\n\n&lt;p&gt;Since, we&amp;#39;ve hung out alot. It&amp;#39;s basically been alot of acknowledging how much of a couple we were anyway, with kissing and more shameless staring than usual. And there&amp;#39;s been alot of &amp;quot;well, it&amp;#39;s about f***ing time&amp;quot;s from friends and family. I&amp;#39;ve also been bragging wherever anyone will listen, oc. Which you&amp;#39;ve probably guessed after reading a few paragraphs of me doing so.&lt;/p&gt;\n\n&lt;p&gt;Now onto why I&amp;#39;m posting this on &lt;a href=\"/r/sex\"&gt;r/sex&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;We have spoken about sex. She hasn&amp;#39;t had it before (paralysed after an accident at 12). But she wants me to be her first (my bragging might spill out a little bit through the rest of this post, please forgive me). She&amp;#39;s perfectly functional down there, so that won&amp;#39;t be an issue.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m unsure of two things - 1 - is taking a girl&amp;#39;s virginity any different from regular sex? Yes, despite being a sexual stallion with a wealth of experience (some facts may be exaggerated) I have never actually been a girl&amp;#39;s first. That&amp;#39;s my smaller worry. If there&amp;#39;s anything I need to make sure of, please do tell.&lt;/p&gt;\n\n&lt;p&gt;Secondly, what exactly are the ins and outs (pun not intended but it&amp;#39;s getting kept in here) of sex with a paralysed partner? Should I avoid certain things? Are there any convenientional things that are just pointless when someone can&amp;#39;t feel their legs? What should I be prepared for? And, if anyone has tips/suggestions, do share (not those tips, you pervs).&lt;/p&gt;\n\n&lt;p&gt;I appreciate that so much of sex is knowing the person and taking time to learn what they like. But she&amp;#39;s said when she&amp;#39;d like to do it for the first time (it&amp;#39;s soon), and I&amp;#39;m really excited, nervous, scared and, obviously, overjoyed. I just want this to be as great for her as possible, and it&amp;#39;d be just like my dumbass to ruin it by doing something stupid.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been scouring wherever I could find to learn more, and I&amp;#39;ve come across one or two things, but if anyone on reddit has anything to offer, I&amp;#39;m yours.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re both 23, btw, if that&amp;#39;s at all relevant.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Recently, I've started going out with an amazing girl. I know every girl a guy goes out with is \"amazing\" on reddit, but she genuinely is. I could gush about how awesome she is for hours without even having to mention that she's gorgeous, which could prolong it into a day or two.\n\n\nWe've known each other about two years, met through friends and really bonded quickly. We have alot of common intrests, share a sense of humour, and became good friends after a while. For about the last year we've been spending alot of time together and somewhere along the line I've realised I was crushing hard on her (I know, I spent alot of time with a great person of the opposite sex and delevoped a crush, I'm a basic bitch flavoured like pumpkin spice).\n\n\nI had feelings she had similar feelings to me, but I was too nervous to test it for the obvious reasons - great friendship, out of my league, etc... and one thing that I'm now ashamed to admit put doubt in my head. She's paralysed from the waist down and wheelchairbound.\n\n\nNow this didn't bother me in the way you might be thinking - that I'm some shallow guy who \"could never date a girl in a wheelchair, ewwww.\" Fuck that. It was really about not knowing how to care for her, deal with some of her issues, connect with some of the problems she had, etc... A few times I became a shoulder to cry on for her, but I honestly couldn't say \"I know how you feel\" because I obviously have no clue what it's like to be disabled and that made me feel like I could never be with her.\n\n\nBut the more I've hung out with her the more I've learned what it's all about, what she needs, what's no problem actually, etc... So for the last month or two it was really a case of fearing I still wouldn't ever be able to \"get\" her.\n\n\nBut a few nights ago, we went out with some friends and got drunk and I was her \"designated driver\" to get her home. (Me being her driver is kind of a running joke we've got). On the way home, we were laughing and joking the way we usually do when she just broke the fuck down. She's such a strong person, so I'd never seen her like this. She starts saying about how she really likes me, how she knows it's unrealistic for me to want to be with her, etc... I felt horrid because here was this angel having a breakdown and fireworks are basically going off in my mind while Godzilla dances to Kool and the Gang's Celebrate.\n\n\nIn that moment I grew some balls, leant down, and kissed her. Holy fuck what a kiss. She even swung herself around me to hold onto me. It was incredible. When we broke apart I basically pleaded with her to be my girlfriend, she actually had the balls to argue after giving me the best kiss I've ever had, and I finally talked her into going out with me. She broke down harder, but it was a happy breakdown (stupid as that sounds). So I take her home, as we both air out how much we've liked each other for so long. Got to her apartment block, she said it had been such an amazing night but she hoped I wouldn't mind if she didn't invite me up \"for coffee.\"\n\n\nHonestly, I was still a little tipsy from the kiss. So the idea of sex hadn't even crossed my mind. And oc I wasn't going to pressure her into sex. So I just asked for one more kiss (which I got, FUCK YEAH!) and agreed we'd see each other the next day.\n\n\nSince, we've hung out alot. It's basically been alot of acknowledging how much of a couple we were anyway, with kissing and more shameless staring than usual. And there's been alot of \"well, it's about f***ing time\"s from friends and family. I've also been bragging wherever anyone will listen, oc. Which you've probably guessed after reading a few paragraphs of me doing so.\n\n\nNow onto why I'm posting this on r/sex.\n\n\nWe have spoken about sex. She hasn't had it before (paralysed after an accident at 12). But she wants me to be her first (my bragging might spill out a little bit through the rest of this post, please forgive me). She's perfectly functional down there, so that won't be an issue.\n\n\nBut I'm unsure of two things - 1 - is taking a girl's virginity any different from regular sex? Yes, despite being a sexual stallion with a wealth of experience (some facts may be exaggerated) I have never actually been a girl's first. That's my smaller worry. If there's anything I need to make sure of, please do tell.\n\n\nSecondly, what exactly are the ins and outs (pun not intended but it's getting kept in here) of sex with a paralysed partner? Should I avoid certain things? Are there any convenientional things that are just pointless when someone can't feel their legs? What should I be prepared for? And, if anyone has tips/suggestions, do share (not those tips, you pervs).\n\n\nI appreciate that so much of sex is knowing the person and taking time to learn what they like. But she's said when she'd like to do it for the first time (it's soon), and I'm really excited, nervous, scared and, obviously, overjoyed. I just want this to be as great for her as possible, and it'd be just like my dumbass to ruin it by doing something stupid.\n\n\nI've been scouring wherever I could find to learn more, and I've come across one or two things, but if anyone on reddit has anything to offer, I'm yours.\n\n\nWe're both 23, btw, if that's at all relevant.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65rvty", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1061, "report_reasons": null, "author": "luckyPOSthrowaway", "saved": false, "mod_reports": [], "name": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/65rvty/paralysis_sex_advice_on_being_my_paralysed_gfs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492411095.0, "url": "https://www.reddit.com/r/sex/comments/65rvty/paralysis_sex_advice_on_being_my_paralysed_gfs/", "author_flair_text": null, "quarantine": false, "title": "[Paralysis sex] Advice on being my paralysed gf's first?", "created_utc": 1492382295.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 104, "visited": false, "subreddit_type": "public", "ups": 1061}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdp9mh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "925Copper", "parent_id": "t1_dgdox4d", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You're welcome! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re welcome! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdp9mh", "score_hidden": false, "stickied": false, "created": 1492474980.0, "created_utc": 1492446180.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdox4d", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "F0xQueen", "parent_id": "t1_dgd8zep", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thanks for this info, it just helped me figure out what the problem has been!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for this info, it just helped me figure out what the problem has been!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdox4d", "score_hidden": false, "stickied": false, "created": 1492474589.0, "created_utc": 1492445789.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8zep", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "925Copper", "parent_id": "t1_dgcy7wl", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Backing up the higher quality lubes comment here. Many grocery store/pharmacy lubes (k-y) and cheaper lubes can have ingredients that screw up ph balance and cause infections. That's unpleasant for any woman but even more so if she has health or disability issues. \n\nBuy the good quality lubes and have them on hand for the first time and always after that. There might be times you don't need lube, but even with women who get very wet naturally lube is still always a good thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Backing up the higher quality lubes comment here. Many grocery store/pharmacy lubes (k-y) and cheaper lubes can have ingredients that screw up ph balance and cause infections. That&amp;#39;s unpleasant for any woman but even more so if she has health or disability issues. &lt;/p&gt;\n\n&lt;p&gt;Buy the good quality lubes and have them on hand for the first time and always after that. There might be times you don&amp;#39;t need lube, but even with women who get very wet naturally lube is still always a good thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd8zep", "score_hidden": false, "stickied": false, "created": 1492442939.0, "created_utc": 1492414139.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdk84f", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "dinahlou", "parent_id": "t1_dgdj02g", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Coconut oil is my go-to, but as a rule you can't use oil-based lube with condoms because it breaks down the latex", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Coconut oil is my go-to, but as a rule you can&amp;#39;t use oil-based lube with condoms because it breaks down the latex&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdk84f", "score_hidden": false, "stickied": false, "created": 1492469027.0, "created_utc": 1492440227.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdj02g", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "poppletonn", "parent_id": "t1_dgcy7wl", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "I think coconut oil acts just as well or better than most of the those higher ticket lubes. Just Google coconut oil lube and you'll see tons of people swearing by it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think coconut oil acts just as well or better than most of the those higher ticket lubes. Just Google coconut oil lube and you&amp;#39;ll see tons of people swearing by it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdj02g", "score_hidden": false, "stickied": false, "created": 1492467381.0, "created_utc": 1492438581.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdtwhs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "skittlesprincess", "parent_id": "t1_dgdnffd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sliquid is bloody fantastic can confirm", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sliquid is bloody fantastic can confirm&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdtwhs", "score_hidden": false, "stickied": false, "created": 1492480120.0, "created_utc": 1492451320.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdrg53", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scrotumsweat", "parent_id": "t1_dgdnffd", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Interesting. Perhaps ill reconsider purchasing in the future. Thanks for sharing! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting. Perhaps ill reconsider purchasing in the future. Thanks for sharing! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdrg53", "score_hidden": false, "stickied": false, "created": 1492477397.0, "created_utc": 1492448597.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnffd", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "caethiel", "parent_id": "t1_dgdlzji", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Can't speak for all but the problem with Gun Oil for me is it made my vulva burn. Personally I don't think it's a great recommendation because of that and I'd point everyone towards Sliquid if they want a good lube.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can&amp;#39;t speak for all but the problem with Gun Oil for me is it made my vulva burn. Personally I don&amp;#39;t think it&amp;#39;s a great recommendation because of that and I&amp;#39;d point everyone towards Sliquid if they want a good lube.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdnffd", "score_hidden": false, "stickied": false, "created": 1492472890.0, "created_utc": 1492444090.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlzji", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "scrotumsweat", "parent_id": "t1_dgd6wss", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Dont know why people are downvoting this.... gun oil is a brand name for a great lube. Lasts forever.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dont know why people are downvoting this.... gun oil is a brand name for a great lube. Lasts forever.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdlzji", "score_hidden": false, "stickied": false, "created": 1492471220.0, "created_utc": 1492442420.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6wss", "gilded": 0, "archived": false, "score": -10, "report_reasons": null, "author": "Malhavoc89", "parent_id": "t1_dgcy7wl", "subreddit_name_prefixed": "r/sex", "controversiality": 1, "body": "Buy some Gun Oil bro.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Buy some Gun Oil bro.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd6wss", "score_hidden": false, "stickied": false, "created": 1492438053.0, "created_utc": 1492409253.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcy7wl", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgcxwm8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Going to save this comment! Nice to have an expert at hand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Going to save this comment! Nice to have an expert at hand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcy7wl", "score_hidden": false, "stickied": false, "created": 1492423676.0, "created_utc": 1492394876.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdkm4o", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "denali42", "parent_id": "t1_dgdfqih", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Full of sea men.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Full of sea men.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkm4o", "score_hidden": false, "stickied": false, "created": 1492469524.0, "created_utc": 1492440724.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdfqih", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Ih8MyBrosWife", "parent_id": "t1_dgcxwm8", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Swiss Navy made me laugh. Dirty sailor lube.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Swiss Navy made me laugh. Dirty sailor lube.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdfqih", "score_hidden": false, "stickied": false, "created": 1492462230.0, "created_utc": 1492433430.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxwm8", "gilded": 0, "archived": false, "score": 99, "report_reasons": null, "author": "2facemonster", "parent_id": "t1_dgcr7zw", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I work at a sex store ... there are a variety of lubes in the market, and the better quality lubes really are worth it, ie Liquid Silk, Pjur, Maximus, SwissNavy, etc. ( make sure you feel the difference between the water and silicone based lubricants).If she is sensitive, get a more natural/organic lubricant with low glycerin (sugar) levels.\n\nEven if paralyzed from the waist down (leaving fetish restraints and lingerie out of it), you can spice up the foreplay using edible body paints, massage oils (edible ones too). Sex toys are for later on; but do have a look at We-Vibe lol. \n\nHope that helped.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work at a sex store ... there are a variety of lubes in the market, and the better quality lubes really are worth it, ie Liquid Silk, Pjur, Maximus, SwissNavy, etc. ( make sure you feel the difference between the water and silicone based lubricants).If she is sensitive, get a more natural/organic lubricant with low glycerin (sugar) levels.&lt;/p&gt;\n\n&lt;p&gt;Even if paralyzed from the waist down (leaving fetish restraints and lingerie out of it), you can spice up the foreplay using edible body paints, massage oils (edible ones too). Sex toys are for later on; but do have a look at We-Vibe lol. &lt;/p&gt;\n\n&lt;p&gt;Hope that helped.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcxwm8", "score_hidden": false, "stickied": false, "created": 1492423240.0, "created_utc": 1492394440.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 99}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdff9h", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "HollyWood45", "parent_id": "t1_dgcr7zw", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Go slow and dont be afraid to ask for some confirmation! \"Does that feel good, is it hurting, etc.\" It being her first time is one thing, but you have to make sure she is comfortable and the best way to do that is to make sure she communicates with you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go slow and dont be afraid to ask for some confirmation! &amp;quot;Does that feel good, is it hurting, etc.&amp;quot; It being her first time is one thing, but you have to make sure she is comfortable and the best way to do that is to make sure she communicates with you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdff9h", "score_hidden": false, "stickied": false, "created": 1492461637.0, "created_utc": 1492432837.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr7zw", "gilded": 0, "archived": false, "score": 134, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgcqmyz", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thanks for the advice. And she doesn't have a catheter, so that's not an issue, but thanks anyway, and the points on virginity are especially appreciated. And thanks for the compliments too!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the advice. And she doesn&amp;#39;t have a catheter, so that&amp;#39;s not an issue, but thanks anyway, and the points on virginity are especially appreciated. And thanks for the compliments too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcr7zw", "score_hidden": false, "stickied": false, "created": 1492414295.0, "created_utc": 1492385495.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 134}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqmyz", "gilded": 0, "archived": false, "score": 423, "report_reasons": null, "author": "ccnfler", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Good for you two, you have an awesome story.  \n\nAs for the technical aspects of sex, it all depends on her injury.  \nConsider how you would work around a catheter if that is a factor.  \n\nShe may have hyper-sensitivity above her injury, so consider that during kissing and wither her upper body erogenous zones and nipples.\n\nPositions will be a small limitation, unless you have a wedge pillow.  Missionary is a good start.\n\nUse protection.\n\nThe virginity aspect isn't any different, use lube (plenty), go slow, watch for her response, and enjoy yourself, show her you care about her pleasure, feelings and experience.  Remember to let her know how great SHE was, because everyone is worried about how they were the first time.  \n\nEnjoy your relationship.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good for you two, you have an awesome story.  &lt;/p&gt;\n\n&lt;p&gt;As for the technical aspects of sex, it all depends on her injury.&lt;br/&gt;\nConsider how you would work around a catheter if that is a factor.  &lt;/p&gt;\n\n&lt;p&gt;She may have hyper-sensitivity above her injury, so consider that during kissing and wither her upper body erogenous zones and nipples.&lt;/p&gt;\n\n&lt;p&gt;Positions will be a small limitation, unless you have a wedge pillow.  Missionary is a good start.&lt;/p&gt;\n\n&lt;p&gt;Use protection.&lt;/p&gt;\n\n&lt;p&gt;The virginity aspect isn&amp;#39;t any different, use lube (plenty), go slow, watch for her response, and enjoy yourself, show her you care about her pleasure, feelings and experience.  Remember to let her know how great SHE was, because everyone is worried about how they were the first time.  &lt;/p&gt;\n\n&lt;p&gt;Enjoy your relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcqmyz", "score_hidden": false, "stickied": false, "created": 1492413494.0, "created_utc": 1492384694.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 423}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgcq47g", "gilded": 0, "archived": false, "score": 86, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgcpzeb", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I reveal my true dumbass power levels in moment's of greatest unneed, tbh. Thanks though.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I reveal my true dumbass power levels in moment&amp;#39;s of greatest unneed, tbh. Thanks though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcq47g", "score_hidden": false, "stickied": false, "created": 1492412768.0, "created_utc": 1492383968.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 86}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpzeb", "gilded": 0, "archived": false, "score": 95, "report_reasons": null, "author": "meltallica82", "parent_id": "t1_dgcpmy6", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Haha your dumbass level seems quite low! Communication is always the best place to start. If she thinks it won't play a big part then shes probably right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha your dumbass level seems quite low! Communication is always the best place to start. If she thinks it won&amp;#39;t play a big part then shes probably right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcpzeb", "score_hidden": false, "stickied": false, "created": 1492412580.0, "created_utc": 1492383780.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 95}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdj043", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "hawkeye315", "parent_id": "t1_dgcpmy6", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Since it is just her legs that are paralyzed, the only real challenge will not be doing any positions where she uses her legs or where she has to hold her legs in any weird positions, obviously. With most virgins anyway, starting with missionary is a good idea. It is very easy to control pressure, depth, and other factors. \n\nThe best idea however is tons of foreplay. Diving right is can be hard for many girls, especially an unexperienced one. My biggest rule for any girl is if she clenches up (inside or externally), pause whatever you are doing and communicate. See if she wants more lube, just to sit at that spot for a bit, more foreplay, etc... \n\nOne last thing, condoms. Just do a simple, non-ribbed one for her first time. Lots of lube!\n\nIt sounds like you two have the potential for a great relationship! Good luck and be safe!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since it is just her legs that are paralyzed, the only real challenge will not be doing any positions where she uses her legs or where she has to hold her legs in any weird positions, obviously. With most virgins anyway, starting with missionary is a good idea. It is very easy to control pressure, depth, and other factors. &lt;/p&gt;\n\n&lt;p&gt;The best idea however is tons of foreplay. Diving right is can be hard for many girls, especially an unexperienced one. My biggest rule for any girl is if she clenches up (inside or externally), pause whatever you are doing and communicate. See if she wants more lube, just to sit at that spot for a bit, more foreplay, etc... &lt;/p&gt;\n\n&lt;p&gt;One last thing, condoms. Just do a simple, non-ribbed one for her first time. Lots of lube!&lt;/p&gt;\n\n&lt;p&gt;It sounds like you two have the potential for a great relationship! Good luck and be safe!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdj043", "score_hidden": false, "stickied": false, "created": 1492467383.0, "created_utc": 1492438583.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpmy6", "gilded": 0, "archived": false, "score": 157, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgcphjq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "We have actually! We're both looking up what we can about it and talking about it regularly. She doesn't think it'll matter much once we're actually in bed. Tbh, I'm kinda thinking the same thing.\n\n\nBut like I said, I'm a dumbass with dumbass tendencies. So I'm trying to tone down the dumbass here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We have actually! We&amp;#39;re both looking up what we can about it and talking about it regularly. She doesn&amp;#39;t think it&amp;#39;ll matter much once we&amp;#39;re actually in bed. Tbh, I&amp;#39;m kinda thinking the same thing.&lt;/p&gt;\n\n&lt;p&gt;But like I said, I&amp;#39;m a dumbass with dumbass tendencies. So I&amp;#39;m trying to tone down the dumbass here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcpmy6", "score_hidden": false, "stickied": false, "created": 1492412103.0, "created_utc": 1492383303.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 157}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcphjq", "gilded": 0, "archived": false, "score": 284, "report_reasons": null, "author": "meltallica82", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sex when it's someone's first time most likely won't be earth shattering, mind blowing sex. It will probably be filled with the general awkwardness you'd imagine with losing your virginity, but it'll still be great because it's with someone you really care about. \n\nAs for the paralysis, it might be best to discuss this with her. I'm sure it's probably different for everyone, and she may not even be sure how it will go herself, but talking openly about it with her beforehand might help things go a little more smoothly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sex when it&amp;#39;s someone&amp;#39;s first time most likely won&amp;#39;t be earth shattering, mind blowing sex. It will probably be filled with the general awkwardness you&amp;#39;d imagine with losing your virginity, but it&amp;#39;ll still be great because it&amp;#39;s with someone you really care about. &lt;/p&gt;\n\n&lt;p&gt;As for the paralysis, it might be best to discuss this with her. I&amp;#39;m sure it&amp;#39;s probably different for everyone, and she may not even be sure how it will go herself, but talking openly about it with her beforehand might help things go a little more smoothly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcphjq", "score_hidden": false, "stickied": false, "created": 1492411897.0, "created_utc": 1492383097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 284}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgctlzy", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "turbo-plague", "parent_id": "t1_dgctkfq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "NP. Sounds like you guys are gonna have a great time. :) Sometimes all someone needs is the opportunity to pipe up by you going \"how's that feel?\" and she can go \"actually something's kind of pinching...\" (especially since I guess she can't adjust her hips to compensate)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;NP. Sounds like you guys are gonna have a great time. :) Sometimes all someone needs is the opportunity to pipe up by you going &amp;quot;how&amp;#39;s that feel?&amp;quot; and she can go &amp;quot;actually something&amp;#39;s kind of pinching...&amp;quot; (especially since I guess she can&amp;#39;t adjust her hips to compensate)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgctlzy", "score_hidden": false, "stickied": false, "created": 1492417515.0, "created_utc": 1492388715.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd59hr", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "mulderrrNO", "parent_id": "t1_dgctkfq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "The thing is (having had sex for the first time fairly recently and quite a lot since) I don't think most virgins realise how hilariously silly it can be. Films and porn condition us to expect perfect, smooth, dazzlingly cinematographed magic but the fact is that queefs and leaks and all kinds of things do happen, and if the guy I've been doing it with hadn't just smiled and laughed and kept right on kissing me and making it clear he couldn't give two shits I would have wanted to die. Everything the original commenter said is spot-on, but I think this specific point needs emphasis.\n\nAlso, I personally was so glad that the guy I was with knew what he was doing - can't imagine trying to muddle through things with another virgin!\n\nGood luck and enjoy :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is (having had sex for the first time fairly recently and quite a lot since) I don&amp;#39;t think most virgins realise how hilariously silly it can be. Films and porn condition us to expect perfect, smooth, dazzlingly cinematographed magic but the fact is that queefs and leaks and all kinds of things do happen, and if the guy I&amp;#39;ve been doing it with hadn&amp;#39;t just smiled and laughed and kept right on kissing me and making it clear he couldn&amp;#39;t give two shits I would have wanted to die. Everything the original commenter said is spot-on, but I think this specific point needs emphasis.&lt;/p&gt;\n\n&lt;p&gt;Also, I personally was so glad that the guy I was with knew what he was doing - can&amp;#39;t imagine trying to muddle through things with another virgin!&lt;/p&gt;\n\n&lt;p&gt;Good luck and enjoy :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd59hr", "score_hidden": false, "stickied": false, "created": 1492434642.0, "created_utc": 1492405842.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd46l5", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "JumboJellybean", "parent_id": "t1_dgctkfq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "That's the #1 most important thing, so you're good there!\n\nMy personal advice would be to just straight up say \"We're just going to fool around and have some fun experimenting, it'll probably be awkward but intimate.\" Remove the expectation on either side to have amazing sex right off the bat. Just think of it as intimate playful experimenting. And then no matter what happens, you're both likely to have fun. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the #1 most important thing, so you&amp;#39;re good there!&lt;/p&gt;\n\n&lt;p&gt;My personal advice would be to just straight up say &amp;quot;We&amp;#39;re just going to fool around and have some fun experimenting, it&amp;#39;ll probably be awkward but intimate.&amp;quot; Remove the expectation on either side to have amazing sex right off the bat. Just think of it as intimate playful experimenting. And then no matter what happens, you&amp;#39;re both likely to have fun. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd46l5", "score_hidden": false, "stickied": false, "created": 1492432592.0, "created_utc": 1492403792.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdmhr0", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "follow_your_bliss", "parent_id": "t1_dgctkfq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "To add to what this poster said, for many people who lose their virginity in their teens, there are often a lot of \"fooling around\" sessions and sexual exploration that lead about to the big event.  So just because you've done it already and she's 23 doesn't mean you have to go from kissing straight to sex.  Honestly that's a lot at once.  You took all this time getting to know each other- easing into full on sex might be more enjoyable.  You can get some of the initial nervousness dissipated like seeing eachother naked for the first time, just exploring each others bodies.  I think it would be really nice to just say that you want to get to know her body and you don't need to speed along to the big thing the first night.  I think you will both be more relaxed when it comes to that.  All of my friends that eased into sex with fun makeout sessions and touching were more confident and relaxed, and also verbalizing their needs to their partner came more easily than those who ended up going all the way with a new partner out of the blue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add to what this poster said, for many people who lose their virginity in their teens, there are often a lot of &amp;quot;fooling around&amp;quot; sessions and sexual exploration that lead about to the big event.  So just because you&amp;#39;ve done it already and she&amp;#39;s 23 doesn&amp;#39;t mean you have to go from kissing straight to sex.  Honestly that&amp;#39;s a lot at once.  You took all this time getting to know each other- easing into full on sex might be more enjoyable.  You can get some of the initial nervousness dissipated like seeing eachother naked for the first time, just exploring each others bodies.  I think it would be really nice to just say that you want to get to know her body and you don&amp;#39;t need to speed along to the big thing the first night.  I think you will both be more relaxed when it comes to that.  All of my friends that eased into sex with fun makeout sessions and touching were more confident and relaxed, and also verbalizing their needs to their partner came more easily than those who ended up going all the way with a new partner out of the blue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdmhr0", "score_hidden": false, "stickied": false, "created": 1492471810.0, "created_utc": 1492443010.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgctkfq", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgct6nu", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She's a great communicator, so I pray to God she'll say whatever she's thinking during. Thanks for the advice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s a great communicator, so I pray to God she&amp;#39;ll say whatever she&amp;#39;s thinking during. Thanks for the advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgctkfq", "score_hidden": false, "stickied": false, "created": 1492417457.0, "created_utc": 1492388657.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdel98", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Hope246", "parent_id": "t1_dgct6nu", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Solid advice. I'm sending this to my exes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Solid advice. I&amp;#39;m sending this to my exes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdel98", "score_hidden": false, "stickied": false, "created": 1492459967.0, "created_utc": 1492431167.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgct6nu", "gilded": 0, "archived": false, "score": 141, "report_reasons": null, "author": "turbo-plague", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I can't answer the paralysis part. This story is fucking adorable BTW.\n\nI had a terrible first-time experience because it was really painful and the guy kind of rushed things in an inconsiderate way and I didn't feel comfortable telling him to slow down. I think the first time you have \"sex\" you should just play with her with your hands and mouth (if she's comfortable with it) if she's never been penetrated at all (I dunno if she's masturbated with dildos or similar). Get her used to the feelings, make her feel loved and turned on and worshipped. Well, then if things seem really ready you can try PIV with her if she's ready for it but VERBALLY check-in with her and make it really obvious she can communicate to you about any hesitance, worries, discomfort. Back off and try again next time if there are issues, don't let her feel like a disappointment if she gets a bit nervous or it's uncomfortable. I kind of assume/imagine someone with a disability like this might have some hang-ups around sex &amp; also the first time is just pretty vulnerable.\n\nTL;DR\n\n- Start slow\n- Get her really turned on before you involve your penis at all\n- Verbally check-in with her every time you escalate or start something new\n- Don't let her get down on herself if things don't go perfectly\n- Slow down, back off, or try again next time if she gets nervous, uncomfortable, etc\n- Ask her what she liked &amp; didn't like after; give her compliments", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t answer the paralysis part. This story is fucking adorable BTW.&lt;/p&gt;\n\n&lt;p&gt;I had a terrible first-time experience because it was really painful and the guy kind of rushed things in an inconsiderate way and I didn&amp;#39;t feel comfortable telling him to slow down. I think the first time you have &amp;quot;sex&amp;quot; you should just play with her with your hands and mouth (if she&amp;#39;s comfortable with it) if she&amp;#39;s never been penetrated at all (I dunno if she&amp;#39;s masturbated with dildos or similar). Get her used to the feelings, make her feel loved and turned on and worshipped. Well, then if things seem really ready you can try PIV with her if she&amp;#39;s ready for it but VERBALLY check-in with her and make it really obvious she can communicate to you about any hesitance, worries, discomfort. Back off and try again next time if there are issues, don&amp;#39;t let her feel like a disappointment if she gets a bit nervous or it&amp;#39;s uncomfortable. I kind of assume/imagine someone with a disability like this might have some hang-ups around sex &amp;amp; also the first time is just pretty vulnerable.&lt;/p&gt;\n\n&lt;p&gt;TL;DR&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Start slow&lt;/li&gt;\n&lt;li&gt;Get her really turned on before you involve your penis at all&lt;/li&gt;\n&lt;li&gt;Verbally check-in with her every time you escalate or start something new&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t let her get down on herself if things don&amp;#39;t go perfectly&lt;/li&gt;\n&lt;li&gt;Slow down, back off, or try again next time if she gets nervous, uncomfortable, etc&lt;/li&gt;\n&lt;li&gt;Ask her what she liked &amp;amp; didn&amp;#39;t like after; give her compliments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgct6nu", "score_hidden": false, "stickied": false, "created": 1492416956.0, "created_utc": 1492388156.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 141}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dge2khw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "paperairplanerace", "parent_id": "t1_dgdrrr1", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "!remindme 2 weeks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!remindme 2 weeks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge2khw", "score_hidden": true, "stickied": false, "created": 1492489855.0, "created_utc": 1492461055.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrrr1", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "theprissypixel", "parent_id": "t1_dgdgzc7", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I have nothing more to add here except I hope you guys are forever because I cannot think of two people who are more perfect for each other. You obviously care for her on a level that is rarely seen or shared, and if I believed in fate or kismet or whatever, I would say it's at work here. You, OP, are a good man. Good luck to both of you!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have nothing more to add here except I hope you guys are forever because I cannot think of two people who are more perfect for each other. You obviously care for her on a level that is rarely seen or shared, and if I believed in fate or kismet or whatever, I would say it&amp;#39;s at work here. You, OP, are a good man. Good luck to both of you!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdrrr1", "score_hidden": false, "stickied": false, "created": 1492477759.0, "created_utc": 1492448959.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdumtf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pinkcrystalrubi", "parent_id": "t1_dgdqkqo", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "!remindme 2 weeks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!remindme 2 weeks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdumtf", "score_hidden": false, "stickied": false, "created": 1492480917.0, "created_utc": 1492452117.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdqkqo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jpacheco914", "parent_id": "t1_dgdq5da", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "!remindme 2 weeks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!remindme 2 weeks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdqkqo", "score_hidden": false, "stickied": false, "created": 1492476428.0, "created_utc": 1492447628.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdq5da", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BluntDagger", "parent_id": "t1_dgdkavh", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "!RemindMe 2 weeks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!RemindMe 2 weeks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdq5da", "score_hidden": false, "stickied": false, "created": 1492475959.0, "created_utc": 1492447159.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkavh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KisuPL", "parent_id": "t1_dgdgzc7", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "!remindme 2 weeks ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!remindme 2 weeks &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkavh", "score_hidden": false, "stickied": false, "created": 1492469127.0, "created_utc": 1492440327.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdtl4p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rawryrawr12", "parent_id": "t1_dgdgzc7", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "!remindme 2 weeks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!remindme 2 weeks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdtl4p", "score_hidden": false, "stickied": false, "created": 1492479770.0, "created_utc": 1492450970.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdudiu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sighren", "parent_id": "t1_dgdgzc7", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "!remindme 2 weeks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!remindme 2 weeks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdudiu", "score_hidden": false, "stickied": false, "created": 1492480634.0, "created_utc": 1492451834.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdgzc7", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgda29q", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Everyone here's been very helpful actually, so I wouldn't mind sharing a more general update on it afterwards. Plus, you guys seem quite enamoured with us!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone here&amp;#39;s been very helpful actually, so I wouldn&amp;#39;t mind sharing a more general update on it afterwards. Plus, you guys seem quite enamoured with us!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdgzc7", "score_hidden": false, "stickied": false, "created": 1492464353.0, "created_utc": 1492435553.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 45}}], "after": null, "before": null}}, "user_reports": [], "id": "dgda29q", "gilded": 0, "archived": false, "score": 80, "report_reasons": null, "author": "lostlittletexan", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Can we catch a non detailed update on this later? This is seriously such a sweet story &amp; I hope nothing but the best for y'all! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can we catch a non detailed update on this later? This is seriously such a sweet story &amp;amp; I hope nothing but the best for y&amp;#39;all! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgda29q", "score_hidden": false, "stickied": false, "created": 1492446324.0, "created_utc": 1492417524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 80}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd9vhx", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "JunahCg", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "One thing I haven't seen yet in the comments: she might be a bit self conscious about her injury. Given her break down about how a relationship was \"unrealistic\" to hope for, she could harbor some weird feeling towards her own body. I think spending some time getting used to each other in the nude and messing around with lighter things than sex would be a good place to start. It's perfectly fine to have sex the first time you get her shirt off if that's what you both want, by all means. But I would go in with the assumption things go at a snails pace while you get used to her specific needs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing I haven&amp;#39;t seen yet in the comments: she might be a bit self conscious about her injury. Given her break down about how a relationship was &amp;quot;unrealistic&amp;quot; to hope for, she could harbor some weird feeling towards her own body. I think spending some time getting used to each other in the nude and messing around with lighter things than sex would be a good place to start. It&amp;#39;s perfectly fine to have sex the first time you get her shirt off if that&amp;#39;s what you both want, by all means. But I would go in with the assumption things go at a snails pace while you get used to her specific needs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd9vhx", "score_hidden": false, "stickied": false, "created": 1492445691.0, "created_utc": 1492416891.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd1bdb", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Anatolysdream", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Glad she has someone like you who cares so much for her, and that you know each other. The fun you are having with kissing is very promising.\n\nSo, she is perfectly functional down there? Other than having a working vagina and clitoris -- what does she feel there? Does she have sexual sensations, does she become aroused? Has she been sexual with herself or with anyone else (girl or boy)? Has she ever orgasmed? Do touches to other parts of her body arouse her (I'm talking the ones not flagrantly erogenous). Can she bathroom herself or does she need other options?\n\nThese are things to think about and discuss with her. And \"testing\" those other parts of her body with cuddling/massage could be fun. \n\nLogistics: A good lube, condoms (even if she's on BC). Supportive pillow, to help her get the best angles if she can't move her hips. It's unlikely she'll be thrusting back (unless she tells you differently). So high density foam sex pillows are great.\n\n [Liberator](https://www.liberator.com/liberator-sex-furniture.html) makes some interesting ones that aren't all high priced. The Jaz Motion may allow her movement momentum from your movements. The Heart wedge looks good. Some of them have toy mounts too. And if your using your mouth and fingers, it's probably easier on your neck. The good thing about these too, are the leg positions. With some of the higher pillows, she may even be able to achieve cowgirl, with help from you as her legs are raised from the bed. And doggy style is not out of the question. They're offering 20 or 25% off online. If you live near Atlanta, there's a store. And no, I don't have an interest in the company, just heard feedback from others in r/sexover30 about them.\n\nA member of r/diy actually made a wedge. The post is pretty recent if you want to check it out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad she has someone like you who cares so much for her, and that you know each other. The fun you are having with kissing is very promising.&lt;/p&gt;\n\n&lt;p&gt;So, she is perfectly functional down there? Other than having a working vagina and clitoris -- what does she feel there? Does she have sexual sensations, does she become aroused? Has she been sexual with herself or with anyone else (girl or boy)? Has she ever orgasmed? Do touches to other parts of her body arouse her (I&amp;#39;m talking the ones not flagrantly erogenous). Can she bathroom herself or does she need other options?&lt;/p&gt;\n\n&lt;p&gt;These are things to think about and discuss with her. And &amp;quot;testing&amp;quot; those other parts of her body with cuddling/massage could be fun. &lt;/p&gt;\n\n&lt;p&gt;Logistics: A good lube, condoms (even if she&amp;#39;s on BC). Supportive pillow, to help her get the best angles if she can&amp;#39;t move her hips. It&amp;#39;s unlikely she&amp;#39;ll be thrusting back (unless she tells you differently). So high density foam sex pillows are great.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.liberator.com/liberator-sex-furniture.html\"&gt;Liberator&lt;/a&gt; makes some interesting ones that aren&amp;#39;t all high priced. The Jaz Motion may allow her movement momentum from your movements. The Heart wedge looks good. Some of them have toy mounts too. And if your using your mouth and fingers, it&amp;#39;s probably easier on your neck. The good thing about these too, are the leg positions. With some of the higher pillows, she may even be able to achieve cowgirl, with help from you as her legs are raised from the bed. And doggy style is not out of the question. They&amp;#39;re offering 20 or 25% off online. If you live near Atlanta, there&amp;#39;s a store. And no, I don&amp;#39;t have an interest in the company, just heard feedback from others in &lt;a href=\"/r/sexover30\"&gt;r/sexover30&lt;/a&gt; about them.&lt;/p&gt;\n\n&lt;p&gt;A member of &lt;a href=\"/r/diy\"&gt;r/diy&lt;/a&gt; actually made a wedge. The post is pretty recent if you want to check it out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd1bdb", "score_hidden": false, "stickied": false, "created": 1492428035.0, "created_utc": 1492399235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdf483", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "bastaxxo", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "As a PT student, my best advice is to take it slow. Play with each other first and explore what she can and can't feel. As others have said, above injusy level could be hypersensitive. Make it fun  and establish a level of comfortable communication ahead of time. Only she knows can tell you how  she feels! \n\nI'm not sure others have mentioned it but if she has an injury ABOVE T6 (thoracic spine) she may have autonomic disreflexia which is a condition in people with SCI that comes on with painful /noxious stimuli. Which could include sex. The signs of that are severe Inc in blood pressure,  sweating excessively, above injury level, and or a bad  headache. If this happens, sit her up to Dec blood pressure - do not lay her down if this happens!! The best way to help this is take away whatever is causing it. If needed, call 911. Not trying to scare you with this by any means but it is a serious situation that could happen.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a PT student, my best advice is to take it slow. Play with each other first and explore what she can and can&amp;#39;t feel. As others have said, above injusy level could be hypersensitive. Make it fun  and establish a level of comfortable communication ahead of time. Only she knows can tell you how  she feels! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure others have mentioned it but if she has an injury ABOVE T6 (thoracic spine) she may have autonomic disreflexia which is a condition in people with SCI that comes on with painful /noxious stimuli. Which could include sex. The signs of that are severe Inc in blood pressure,  sweating excessively, above injury level, and or a bad  headache. If this happens, sit her up to Dec blood pressure - do not lay her down if this happens!! The best way to help this is take away whatever is causing it. If needed, call 911. Not trying to scare you with this by any means but it is a serious situation that could happen.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdf483", "score_hidden": false, "stickied": false, "created": 1492461040.0, "created_utc": 1492432240.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdaa13", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Lewd_Macabre", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I actually personally just got out of a relationship with a girl whos considered a quadriplegic (no use of arms or legs) because her level of injury is right around her C5/C6 vertebrae (about the base of the neck for anyone that didnt know) but she has control of her body from her bra line on up, more like a paraplegic. Like i've seen others comments saying she may or may not be hyper or hyposensitive. Any part of the body below her level of injury can have this issue, in the case of the girl I was in a relationship with her feet were her hypersensitive part and her breasts were more or less hyposensitive. Also i dont know if this girl of yours has feeling below her injury or not, this could entail sex being a more mental/emotional thing for her and need a lot more mental stimulation than physical since the vagina doesnt react the same to physical stimulation. More missionary style positions are great since you can usually get her legs to stay open without you holding them at all. Hopefully you find some of that information useful and good luck to you both. Does she intermittent self cath with single use catheters? I know you said she didnt have a leave in cath. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually personally just got out of a relationship with a girl whos considered a quadriplegic (no use of arms or legs) because her level of injury is right around her C5/C6 vertebrae (about the base of the neck for anyone that didnt know) but she has control of her body from her bra line on up, more like a paraplegic. Like i&amp;#39;ve seen others comments saying she may or may not be hyper or hyposensitive. Any part of the body below her level of injury can have this issue, in the case of the girl I was in a relationship with her feet were her hypersensitive part and her breasts were more or less hyposensitive. Also i dont know if this girl of yours has feeling below her injury or not, this could entail sex being a more mental/emotional thing for her and need a lot more mental stimulation than physical since the vagina doesnt react the same to physical stimulation. More missionary style positions are great since you can usually get her legs to stay open without you holding them at all. Hopefully you find some of that information useful and good luck to you both. Does she intermittent self cath with single use catheters? I know you said she didnt have a leave in cath. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdaa13", "score_hidden": false, "stickied": false, "created": 1492447053.0, "created_utc": 1492418253.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdeslf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Rainnefox", "parent_id": "t1_dgcrm8o", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I've always found that if there is awkwardness during sex (strange noise happens, position is really not working, etc...) then take a moment and laugh together about how silly sex is. Really cuts down on the awkward feeling and makes you both a little more comfortable!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always found that if there is awkwardness during sex (strange noise happens, position is really not working, etc...) then take a moment and laugh together about how silly sex is. Really cuts down on the awkward feeling and makes you both a little more comfortable!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdeslf", "score_hidden": false, "stickied": false, "created": 1492460391.0, "created_utc": 1492431591.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrm8o", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgcrf7l", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Oh I know first times can be disasters, trust me! And I'm ready for the little bits of awkwardness. Just wanna make this as good for her as possible, you know? Thanks for the kind words.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I know first times can be disasters, trust me! And I&amp;#39;m ready for the little bits of awkwardness. Just wanna make this as good for her as possible, you know? Thanks for the kind words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcrm8o", "score_hidden": false, "stickied": false, "created": 1492414815.0, "created_utc": 1492386015.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrf7l", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Lolasolow", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't have any advice but your​ story is so heart warming. And I'm sure through communication, sounds like you guys are already doing great at that, you guys will have a wonderful maybe a tad awkward first time. But that's kinda how all first times are. You'll learn what works and what doesn't and go on to have a great sex life. I wish you guys the best!! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any advice but your​ story is so heart warming. And I&amp;#39;m sure through communication, sounds like you guys are already doing great at that, you guys will have a wonderful maybe a tad awkward first time. But that&amp;#39;s kinda how all first times are. You&amp;#39;ll learn what works and what doesn&amp;#39;t and go on to have a great sex life. I wish you guys the best!! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcrf7l", "score_hidden": false, "stickied": false, "created": 1492414563.0, "created_utc": 1492385763.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdif3a", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Bogthehorible", "parent_id": "t1_dgd3ara", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I know,right?!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know,right?!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdif3a", "score_hidden": false, "stickied": false, "created": 1492466565.0, "created_utc": 1492437765.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3ara", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "toestyoest", "parent_id": "t1_dgcscmi", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You two are so painfully cute my god I can barely keep the tears back", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You two are so painfully cute my god I can barely keep the tears back&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd3ara", "score_hidden": false, "stickied": false, "created": 1492431092.0, "created_utc": 1492402292.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 52}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcscmi", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgcrynv", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Will definitely check that book out! Thank you!\n\nAnd we've made small steps that way - She showed me herself naked for the first time after a few days, which as weird as it sounds was actually a more touching, emotional moment than anything else. And she says she won't tell me some of her fantasies until she's had \"conventional\" sex! The tease!\n\n\nAbout the date - It's completely of her choosing. Honestly, I was expecting a lot longer of a wait, and would be totally cool if she changed her mind and said she wanted to wait. Fuck, I'd wait years for this girl, honestly.\n\n\nAnd thanks for the compliments.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Will definitely check that book out! Thank you!&lt;/p&gt;\n\n&lt;p&gt;And we&amp;#39;ve made small steps that way - She showed me herself naked for the first time after a few days, which as weird as it sounds was actually a more touching, emotional moment than anything else. And she says she won&amp;#39;t tell me some of her fantasies until she&amp;#39;s had &amp;quot;conventional&amp;quot; sex! The tease!&lt;/p&gt;\n\n&lt;p&gt;About the date - It&amp;#39;s completely of her choosing. Honestly, I was expecting a lot longer of a wait, and would be totally cool if she changed her mind and said she wanted to wait. Fuck, I&amp;#39;d wait years for this girl, honestly.&lt;/p&gt;\n\n&lt;p&gt;And thanks for the compliments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcscmi", "score_hidden": false, "stickied": false, "created": 1492415801.0, "created_utc": 1492387001.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 46}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrynv", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "Abracadabrawoohoo", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I can tell how caring you are, and she's lucky to have you and you sound really cute together! It's great that you guys are talking openly about it and as someone else said that's probably the best bet because each person will be unique as you pointed out and she may have some ideas of what might work or wouldn't work well or what she'd like (or if she's masturbated or has fantasized or anything then what she likes too). There's a great book on sex and disability that's so sex-positive and has great practical tips for all sorts of disabilities including paralysis. An easy read too. Highly recommend it. It's called The Ultimate Guide to Sex and Disability. It includes a bunch of chapters including positioning, sex toys, talking about this stuff, lots more.\n\nAlso, you said she chose a date that's soon to have sex. You guys might want to discuss if there would be benefits to taking it slower and being intimate in bed in other ways before sex to get to know each others' bodies and responses better. Not only will that maybe make it feel more comfortable for both of you and take some awkwardness away, but as you said it's about getting to know each other this way, and you might figure out some things that are good (like heightened erogenous zones in a good way in other areas), things she enjoys, or things that are uncomfortable for her, or ways that work better for both of you to maneuver in bed. It's great that you're thinking about all this and talking about it openly, and have a touch of creativity and the openness and connection that you seem to have - enjoy!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can tell how caring you are, and she&amp;#39;s lucky to have you and you sound really cute together! It&amp;#39;s great that you guys are talking openly about it and as someone else said that&amp;#39;s probably the best bet because each person will be unique as you pointed out and she may have some ideas of what might work or wouldn&amp;#39;t work well or what she&amp;#39;d like (or if she&amp;#39;s masturbated or has fantasized or anything then what she likes too). There&amp;#39;s a great book on sex and disability that&amp;#39;s so sex-positive and has great practical tips for all sorts of disabilities including paralysis. An easy read too. Highly recommend it. It&amp;#39;s called The Ultimate Guide to Sex and Disability. It includes a bunch of chapters including positioning, sex toys, talking about this stuff, lots more.&lt;/p&gt;\n\n&lt;p&gt;Also, you said she chose a date that&amp;#39;s soon to have sex. You guys might want to discuss if there would be benefits to taking it slower and being intimate in bed in other ways before sex to get to know each others&amp;#39; bodies and responses better. Not only will that maybe make it feel more comfortable for both of you and take some awkwardness away, but as you said it&amp;#39;s about getting to know each other this way, and you might figure out some things that are good (like heightened erogenous zones in a good way in other areas), things she enjoys, or things that are uncomfortable for her, or ways that work better for both of you to maneuver in bed. It&amp;#39;s great that you&amp;#39;re thinking about all this and talking about it openly, and have a touch of creativity and the openness and connection that you seem to have - enjoy!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcrynv", "score_hidden": false, "stickied": false, "created": 1492415276.0, "created_utc": 1492386476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgddq4g", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "NakD_Bootstraps", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Not sure if it's been mentioned. But be mindful of pulling and bending. Just because she can't feel doesn't mean things won't strain or pull all the same. And the fact she can't feel could cause someone small to turn into a large untreated problem. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure if it&amp;#39;s been mentioned. But be mindful of pulling and bending. Just because she can&amp;#39;t feel doesn&amp;#39;t mean things won&amp;#39;t strain or pull all the same. And the fact she can&amp;#39;t feel could cause someone small to turn into a large untreated problem. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgddq4g", "score_hidden": false, "stickied": false, "created": 1492457959.0, "created_utc": 1492429159.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgcubke", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgcu3w9", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Wow... Yeah, I won't ever be like that D: What a fool.\n\nAnd trust me, she's like 95% percent of the cuteness in our relationship... and my dog's the other 5.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow... Yeah, I won&amp;#39;t ever be like that D: What a fool.&lt;/p&gt;\n\n&lt;p&gt;And trust me, she&amp;#39;s like 95% percent of the cuteness in our relationship... and my dog&amp;#39;s the other 5.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcubke", "score_hidden": false, "stickied": false, "created": 1492418483.0, "created_utc": 1492389683.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcu3w9", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Balconybirds25", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "What an amazing story! You guys are so cute :) I don't have much advice but I did want to say something. While making her first time special and fun it's also important to keep in mind that having sex one time isn't going to suddenly give her years of experience. My first boyfriend was insanely excited to find out I was a virgin and the first time we had sex was really nice. He was sweet and gentle and supportive, but for some reason he thought that having sex with me one time would turn me into a kama sutra master. I have a feeling you won't be as pushy as he was (he was mad I couldn't do anal, no lube btw, by the third time we slept together), but I did just want to say that being patient with her isn't something that you'll have to do only once. My boyfriend broke up with me after 3 months because I \"didn't know how to please him\" but he never told me how! This is a learning experience for her as much as it is for you. While it's really important for you to encourage her to tell you how she feels and what she liked afterwards it's also just as important for you to tell her how you feel and what you like. Good luck! Your story made my heart melt!!", "edited": 1492391120.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What an amazing story! You guys are so cute :) I don&amp;#39;t have much advice but I did want to say something. While making her first time special and fun it&amp;#39;s also important to keep in mind that having sex one time isn&amp;#39;t going to suddenly give her years of experience. My first boyfriend was insanely excited to find out I was a virgin and the first time we had sex was really nice. He was sweet and gentle and supportive, but for some reason he thought that having sex with me one time would turn me into a kama sutra master. I have a feeling you won&amp;#39;t be as pushy as he was (he was mad I couldn&amp;#39;t do anal, no lube btw, by the third time we slept together), but I did just want to say that being patient with her isn&amp;#39;t something that you&amp;#39;ll have to do only once. My boyfriend broke up with me after 3 months because I &amp;quot;didn&amp;#39;t know how to please him&amp;quot; but he never told me how! This is a learning experience for her as much as it is for you. While it&amp;#39;s really important for you to encourage her to tell you how she feels and what she liked afterwards it&amp;#39;s also just as important for you to tell her how you feel and what you like. Good luck! Your story made my heart melt!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcu3w9", "score_hidden": false, "stickied": false, "created": 1492418192.0, "created_utc": 1492389392.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd18ap", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "glimmeringgirl", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;In that moment I grew some balls, leant down, and kissed her. Holy fuck what a kiss. She even swung herself around me to hold onto me. It was incredible. When we broke apart I basically pleaded with her to be my girlfriend, she actually had the balls to argue after giving me the best kiss I've ever had  \n\nI'm still reading this, but I love how you both grew/had balls at the same moment!", "edited": 1492453706.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In that moment I grew some balls, leant down, and kissed her. Holy fuck what a kiss. She even swung herself around me to hold onto me. It was incredible. When we broke apart I basically pleaded with her to be my girlfriend, she actually had the balls to argue after giving me the best kiss I&amp;#39;ve ever had  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m still reading this, but I love how you both grew/had balls at the same moment!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd18ap", "score_hidden": false, "stickied": false, "created": 1492427914.0, "created_utc": 1492399114.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdgh44", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Burner2169", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Now that's the kind of falling in love story that is straight out of a romance novel. I have no advice for you except for, be gentle and have fun!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now that&amp;#39;s the kind of falling in love story that is straight out of a romance novel. I have no advice for you except for, be gentle and have fun!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdgh44", "score_hidden": false, "stickied": false, "created": 1492463525.0, "created_utc": 1492434725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdhuil", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "shaggorama", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "There's an excellent book called [The Guide To Getting It On](https://www.guide2getting.com/) which has a chapter devoted to sex with physical disabilities. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s an excellent book called &lt;a href=\"https://www.guide2getting.com/\"&gt;The Guide To Getting It On&lt;/a&gt; which has a chapter devoted to sex with physical disabilities. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdhuil", "score_hidden": false, "stickied": false, "created": 1492465712.0, "created_utc": 1492436912.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd6i4i", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "fleurish", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Regarding the paralysis, you two should read these 2 websites (or others similar ones, or I'm sure there are some good books on the topic) together. \n\nhttps://www.christopherreeve.org/living-with-paralysis/health/sexual-health/sexual-health-for-women\n\nhttps://craighospital.org/resources/sexual-function-for-women-after-spinal-cord-injury", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Regarding the paralysis, you two should read these 2 websites (or others similar ones, or I&amp;#39;m sure there are some good books on the topic) together. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.christopherreeve.org/living-with-paralysis/health/sexual-health/sexual-health-for-women\"&gt;https://www.christopherreeve.org/living-with-paralysis/health/sexual-health/sexual-health-for-women&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://craighospital.org/resources/sexual-function-for-women-after-spinal-cord-injury\"&gt;https://craighospital.org/resources/sexual-function-for-women-after-spinal-cord-injury&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd6i4i", "score_hidden": false, "stickied": false, "created": 1492437163.0, "created_utc": 1492408363.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdcvpn", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tanq_n_chronic", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "RemindMe! 7 days \"without betraying her confidence, you should share your experience here after the fact as a part 2 so folks just like you can reference it.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;RemindMe! 7 days &amp;quot;without betraying her confidence, you should share your experience here after the fact as a part 2 so folks just like you can reference it.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdcvpn", "score_hidden": false, "stickied": false, "created": 1492455720.0, "created_utc": 1492426920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdgxv4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "giggityguy1", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "After this all goes down, I think you should make another post telling us all how you feel. You don't even have to tell us how the sex went, I think everyone just wants to hear you gush about her some more :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After this all goes down, I think you should make another post telling us all how you feel. You don&amp;#39;t even have to tell us how the sex went, I think everyone just wants to hear you gush about her some more :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdgxv4", "score_hidden": false, "stickied": false, "created": 1492464288.0, "created_utc": 1492435488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdvsdl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "QLF", "parent_id": "t1_dgdoqyr", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; She knows her body better than anyone else\n\nMost important words in the thread.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She knows her body better than anyone else&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Most important words in the thread.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdvsdl", "score_hidden": false, "stickied": false, "created": 1492482207.0, "created_utc": 1492453407.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdoqyr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BlondeNinja182", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "First of all, I would like to say congratulations! Such a happy story.\n\nI may have something to offer pertaining to the paralysis situation. I work in a group home for disabled adults who have severe CP. While they aren't paralyzed, they do not have much/any control of their body movements and staff need to physically move the resident's arms, legs, head, etc.. during tasks like getting dressed, brief changes, or bed re positioning. I've noticed in working with my residents, it is much easier to perform routine hygiene in the genital area if they are laying on their side opposed to on their back. \n\nHow I think this could pertain to you is look at sex positions where she is laying on her side. Maybe try having her lay on her side with her bottom leg straight/relaxed and her top leg bent almost like she is curled up or try having both of her legs bent and curled up. Use pillows to help her stay in the position or hold her legs. Another position that may work would be to have her lay on her stomach with a few pillows underneath her pelvic area so her backside is propped up with you straddling her legs. Missionary also may be an option if her hips are able to open enough to allow you in between her legs - I would try missionary first because it is more intimate and you would be able to quickly see how she is doing. \n\nIt's clear through the post and your comment replies you know how important communication is! Make sure the great communication continues when you two become intimate. She knows her body better than anyone else so if you haven't already, ask her what positions she thinks would work best or would be willing to try. Pay attention to her body language with each new thing you guys try out. There is already some great advice in the comments about going slow, using lube, checking in with her, etc... that I strongly recommend following. Best of luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, I would like to say congratulations! Such a happy story.&lt;/p&gt;\n\n&lt;p&gt;I may have something to offer pertaining to the paralysis situation. I work in a group home for disabled adults who have severe CP. While they aren&amp;#39;t paralyzed, they do not have much/any control of their body movements and staff need to physically move the resident&amp;#39;s arms, legs, head, etc.. during tasks like getting dressed, brief changes, or bed re positioning. I&amp;#39;ve noticed in working with my residents, it is much easier to perform routine hygiene in the genital area if they are laying on their side opposed to on their back. &lt;/p&gt;\n\n&lt;p&gt;How I think this could pertain to you is look at sex positions where she is laying on her side. Maybe try having her lay on her side with her bottom leg straight/relaxed and her top leg bent almost like she is curled up or try having both of her legs bent and curled up. Use pillows to help her stay in the position or hold her legs. Another position that may work would be to have her lay on her stomach with a few pillows underneath her pelvic area so her backside is propped up with you straddling her legs. Missionary also may be an option if her hips are able to open enough to allow you in between her legs - I would try missionary first because it is more intimate and you would be able to quickly see how she is doing. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s clear through the post and your comment replies you know how important communication is! Make sure the great communication continues when you two become intimate. She knows her body better than anyone else so if you haven&amp;#39;t already, ask her what positions she thinks would work best or would be willing to try. Pay attention to her body language with each new thing you guys try out. There is already some great advice in the comments about going slow, using lube, checking in with her, etc... that I strongly recommend following. Best of luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdoqyr", "score_hidden": false, "stickied": false, "created": 1492474397.0, "created_utc": 1492445597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdh1st", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wellhungartgallery", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't know what I was expecting when I started reading,  but I'm glad I came down this path, such a sweet story.  \n\nYou have a way with words, it was like watching a movie in my brain.\n\nNow I'm slightly horny and want you guys to just fuck already, so I can hear all about it.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what I was expecting when I started reading,  but I&amp;#39;m glad I came down this path, such a sweet story.  &lt;/p&gt;\n\n&lt;p&gt;You have a way with words, it was like watching a movie in my brain.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m slightly horny and want you guys to just fuck already, so I can hear all about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdh1st", "score_hidden": false, "stickied": false, "created": 1492464463.0, "created_utc": 1492435663.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdkd6b", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DrongoTheShitGibbon", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think your adventure with this girl without Reddit advice has been AMAZING. I vote you skip any and all advice on this comments section and wing it like you have so far. It will be much more amazing if you two figure it out on your own. Keep it fun. It sounds like you guys are in mad love. Enjoy it!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your adventure with this girl without Reddit advice has been AMAZING. I vote you skip any and all advice on this comments section and wing it like you have so far. It will be much more amazing if you two figure it out on your own. Keep it fun. It sounds like you guys are in mad love. Enjoy it!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkd6b", "score_hidden": false, "stickied": false, "created": 1492469210.0, "created_utc": 1492440410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdt7xg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "betteroffinbed", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I'd recommend checking out this episode of [Girls Guide To 21st Century Sex](https://www.youtube.com/watch?v=L4G856Wv0d0) (YouTube, originally BBC, 34 mins, NSFW) in which disability and sex are discussed. The whole series is pretty good but your post made me think of this episode in particular! :) Good luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d recommend checking out this episode of &lt;a href=\"https://www.youtube.com/watch?v=L4G856Wv0d0\"&gt;Girls Guide To 21st Century Sex&lt;/a&gt; (YouTube, originally BBC, 34 mins, NSFW) in which disability and sex are discussed. The whole series is pretty good but your post made me think of this episode in particular! :) Good luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdt7xg", "score_hidden": false, "stickied": false, "created": 1492479372.0, "created_utc": 1492450572.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd6nxr", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "stormbringer89", "parent_id": "t1_dgd139u", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Never ever fun? Hmmm I don't think that's true bud. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Never ever fun? Hmmm I don&amp;#39;t think that&amp;#39;s true bud. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd6nxr", "score_hidden": false, "stickied": false, "created": 1492437519.0, "created_utc": 1492408719.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd139u", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "rehabsfinest", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Depending on her level and type of injury she maybe hyper or hyposensitive in certain areas. This will affect the places and ways in which you should stimulate her. Or if she has an incomplete injury, she may have perfectly normal feeling down there. Discuss this with her. Positioning is another issue but if she's been injured for a while she should be able to get herself on top of you and use a wall or headboard or something to grab for leverage when bouncing on top. There are lots of options depending on her abilities, but you're right to assume it would be different than \"regular\" sex. Also, prepare for the possibility of her losing bowel or bladder control during sex. Not saying it's going to happen or that you should be scared, but in the event that it does happen you should be mentally prepared and she will probably be humiliated so you'll want to comfort her. \n\nAs for it being her first time, losing your virginity is never ever fun and it's usually awkward. Just put yourself in her shoes because you were once a virgin. Discussing limits is a good idea. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depending on her level and type of injury she maybe hyper or hyposensitive in certain areas. This will affect the places and ways in which you should stimulate her. Or if she has an incomplete injury, she may have perfectly normal feeling down there. Discuss this with her. Positioning is another issue but if she&amp;#39;s been injured for a while she should be able to get herself on top of you and use a wall or headboard or something to grab for leverage when bouncing on top. There are lots of options depending on her abilities, but you&amp;#39;re right to assume it would be different than &amp;quot;regular&amp;quot; sex. Also, prepare for the possibility of her losing bowel or bladder control during sex. Not saying it&amp;#39;s going to happen or that you should be scared, but in the event that it does happen you should be mentally prepared and she will probably be humiliated so you&amp;#39;ll want to comfort her. &lt;/p&gt;\n\n&lt;p&gt;As for it being her first time, losing your virginity is never ever fun and it&amp;#39;s usually awkward. Just put yourself in her shoes because you were once a virgin. Discussing limits is a good idea. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd139u", "score_hidden": false, "stickied": false, "created": 1492427707.0, "created_utc": 1492398907.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd4avc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "HornyTeenBoy1515", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Your story is killing me. It's like searching Google images for \"puppies with kittens\" while eating Nutella by the spoonful. Unfortunately, I'm a virgin M myself and I can't offer any advice other than lube and a condom (make sure the condom won't be compromised by the lube formula) will make it much easier for the first time. Best of luck, you are one lucky and caring man to be with someone with so much character and passion. I would like to hear back with the next chapter of this story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your story is killing me. It&amp;#39;s like searching Google images for &amp;quot;puppies with kittens&amp;quot; while eating Nutella by the spoonful. Unfortunately, I&amp;#39;m a virgin M myself and I can&amp;#39;t offer any advice other than lube and a condom (make sure the condom won&amp;#39;t be compromised by the lube formula) will make it much easier for the first time. Best of luck, you are one lucky and caring man to be with someone with so much character and passion. I would like to hear back with the next chapter of this story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd4avc", "score_hidden": false, "stickied": false, "created": 1492432810.0, "created_utc": 1492404010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgcqq3l", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Gnoll_Librarian", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Have a sex with a virgin is basically the same as having sex with someone experienced. Just be careful not to rush it and be patient with her, I guess. \n\nAs for sex with a paralyzed person: it's make a fair number of positions basically impossible. Doggy style, probably not gonna work. Anything with her on top, nope, unless you are strong enough to lift her for it. You are also going to have to figure out how to basically get her legs out of the way. For example if you do missionary normal the girl would hold her legs apart,  but with you two you'll have to it manually, probably you or her holding then (with your hands). Probably not at first but eventually you could use bondage type stuff to hold her legs in the position you want. \n\nEdit: more than any specific strategies or anything, the key for you with be you both being willing to experiment and probably mess up and laugh it off. Because of your good existing emotional relationship I don't foresee you having problems with it. Just remember you don't need to be perfect and have fun. \n", "edited": 1492385850.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have a sex with a virgin is basically the same as having sex with someone experienced. Just be careful not to rush it and be patient with her, I guess. &lt;/p&gt;\n\n&lt;p&gt;As for sex with a paralyzed person: it&amp;#39;s make a fair number of positions basically impossible. Doggy style, probably not gonna work. Anything with her on top, nope, unless you are strong enough to lift her for it. You are also going to have to figure out how to basically get her legs out of the way. For example if you do missionary normal the girl would hold her legs apart,  but with you two you&amp;#39;ll have to it manually, probably you or her holding then (with your hands). Probably not at first but eventually you could use bondage type stuff to hold her legs in the position you want. &lt;/p&gt;\n\n&lt;p&gt;Edit: more than any specific strategies or anything, the key for you with be you both being willing to experiment and probably mess up and laugh it off. Because of your good existing emotional relationship I don&amp;#39;t foresee you having problems with it. Just remember you don&amp;#39;t need to be perfect and have fun. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcqq3l", "score_hidden": false, "stickied": false, "created": 1492413611.0, "created_utc": 1492384811.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdcudk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Bean315", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Hey man- go through my posts- one of my earlier ones was pretty much the exact same question/experience. Lots of great advice for you from people with or who have dated people with paralysis. Hope this helps dude!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man- go through my posts- one of my earlier ones was pretty much the exact same question/experience. Lots of great advice for you from people with or who have dated people with paralysis. Hope this helps dude!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdcudk", "score_hidden": false, "stickied": false, "created": 1492455610.0, "created_utc": 1492426810.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgde3fh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "anarcap", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "The thing with virgins is simple: \n\n- If she ever says stop, give her a break, and get away from her.\n- Even if if she doesn't, once in a little while ask if she is ok, and if she isn't, give her a break.\n- It'll be fine as soon as you earn her trust.\n- Don't ever break her trust.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing with virgins is simple: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;If she ever says stop, give her a break, and get away from her.&lt;/li&gt;\n&lt;li&gt;Even if if she doesn&amp;#39;t, once in a little while ask if she is ok, and if she isn&amp;#39;t, give her a break.&lt;/li&gt;\n&lt;li&gt;It&amp;#39;ll be fine as soon as you earn her trust.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t ever break her trust.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgde3fh", "score_hidden": false, "stickied": false, "created": 1492458844.0, "created_utc": 1492430044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdet3w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LostIronCrown", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I can't speak on the subject of paralysis, but be so gentle with her the first time. She might be small and you might be big, so make sure to do lots of foreplay and check in with her to see if she's ready. My first time was with my fiancé and he talked to me the whole time. That may take the romance out of it for you, but I was grateful for it. Be sure to discuss what she wants out of it beforehand.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t speak on the subject of paralysis, but be so gentle with her the first time. She might be small and you might be big, so make sure to do lots of foreplay and check in with her to see if she&amp;#39;s ready. My first time was with my fiancé and he talked to me the whole time. That may take the romance out of it for you, but I was grateful for it. Be sure to discuss what she wants out of it beforehand.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdet3w", "score_hidden": false, "stickied": false, "created": 1492460419.0, "created_utc": 1492431619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdg6n4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "psmvchaser", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Great post. Happy for you guys. Good luck with your relationship!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post. Happy for you guys. Good luck with your relationship!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdg6n4", "score_hidden": false, "stickied": false, "created": 1492463020.0, "created_utc": 1492434220.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdjsst", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "obi4am_putka", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This is such a beautiful story. It puts me in mind of Arthur Hailey's book Overload. The main character falls in love with a quadriplegic woman, and describes his experience of sex with her and his misgivings about how to treat her sensitively. If I recall correctly, she was a virgin too. \n\nThe best of luck to both of you. I would think that good communication is the key. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is such a beautiful story. It puts me in mind of Arthur Hailey&amp;#39;s book Overload. The main character falls in love with a quadriplegic woman, and describes his experience of sex with her and his misgivings about how to treat her sensitively. If I recall correctly, she was a virgin too. &lt;/p&gt;\n\n&lt;p&gt;The best of luck to both of you. I would think that good communication is the key. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdjsst", "score_hidden": false, "stickied": false, "created": 1492468471.0, "created_utc": 1492439671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdkxit", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KnockoutKingNSFW", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Well aren't you just the sweetest little cutie pie of all time?  I'm a straight dude but even I want you to go back in time and be my first you adorable little fucker.\n\nYou'll do fine dude.  Just looking through the comments and things it seems like you've got all your bases covered.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well aren&amp;#39;t you just the sweetest little cutie pie of all time?  I&amp;#39;m a straight dude but even I want you to go back in time and be my first you adorable little fucker.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll do fine dude.  Just looking through the comments and things it seems like you&amp;#39;ve got all your bases covered.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkxit", "score_hidden": false, "stickied": false, "created": 1492469922.0, "created_utc": 1492441122.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgcwb4t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Da12khawk", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "No advice but your story so cute! I hope the best for you two!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No advice but your story so cute! I hope the best for you two!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcwb4t", "score_hidden": false, "stickied": false, "created": 1492421066.0, "created_utc": 1492392266.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd3k2w", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "huligoogoo", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You two have a special bond ! It's so sweet to hear how much you are into each other. Its so heart warming ...enjoy every moment! Take care and have a beautiful time together. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You two have a special bond ! It&amp;#39;s so sweet to hear how much you are into each other. Its so heart warming ...enjoy every moment! Take care and have a beautiful time together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd3k2w", "score_hidden": false, "stickied": false, "created": 1492431529.0, "created_utc": 1492402729.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd68an", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TaciturnDurm", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Heartwarming story you sound like a great pair of people. Sorry I have no advice", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Heartwarming story you sound like a great pair of people. Sorry I have no advice&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd68an", "score_hidden": false, "stickied": false, "created": 1492436612.0, "created_utc": 1492407812.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd737y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "InleagueWithSatan", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I don't have any advice to offer; but I just had to say what a sweet story that was about y'all getting together. Hope everything goes great for you guys!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any advice to offer; but I just had to say what a sweet story that was about y&amp;#39;all getting together. Hope everything goes great for you guys!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd737y", "score_hidden": false, "stickied": false, "created": 1492438453.0, "created_utc": 1492409653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgctfy7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "slappy_mc_fappington", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "i really hope things work out for you. Communication is key here, which you seem to be on the ball with. There are some good replies here, take them on board, and hopefully your instincts will take over for the better when the time comes. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i really hope things work out for you. Communication is key here, which you seem to be on the ball with. There are some good replies here, take them on board, and hopefully your instincts will take over for the better when the time comes. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgctfy7", "score_hidden": false, "stickied": false, "created": 1492417292.0, "created_utc": 1492388492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgcy6i3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ronddecuir", "parent_id": "t1_dgcy27w", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Then have it her way! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then have it her way! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcy6i3", "score_hidden": false, "stickied": false, "created": 1492423621.0, "created_utc": 1492394821.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd2ei2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "long_live_mcqueen", "parent_id": "t1_dgcy27w", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think she could do cowgirl if you have a headboard she can grab onto, you may have to help bounce her. Same for reverse cowgirl. You could also do the '[legs on shoulders](http://imgur.com/a/wNHo1)' position, depending on how flexible her legs are. \n\nI think she will quickly realize pillows are going to be your friends here. You really don't need sex pillows at first, though... for missionary I would suggest just regular pillow to boost her pelvis to a position that works for both of you. I'm assuming you'll be doing most of the motion so it would be easier for you to penetrate her and keep a rhythm an accessible angle. You may even be able to use the pillow to boost her pelvis up if you're doing her from behind.  A cylindrical pillow like [this](https://www.amazon.com/Exercise-Pillow-Inflatable-Relaxing-Unisex/dp/B00YMJLZ54/ref=sr_1_16_s_it?s=hpc&amp;ie=UTF8&amp;qid=1492400092&amp;sr=1-16) one might be the ticket! Basically making her vagina as accessible to you as possible is the goal here. \n\nEven if she's not okay with using a pillow at first, I'm sure you guys will get crafty in the heat of the moment. Where there's a will, there's a way. :) I think it's stellar you've got open communication, that's a really good sign. \n\nYou seem like a great, caring guy, and I'm so glad you guys ended up together. If you don't mind too much, I think we'd all like an update on this once you guys try it out!\n\n\nEdit - Just thought of another that doesn't use pillows. Depending on how high your/her bed sits, you could have her back on the bed with legs up and over your shoulders. You could also flip her over and do her from behind if you can keep her from slipping off. \n", "edited": 1492401055.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think she could do cowgirl if you have a headboard she can grab onto, you may have to help bounce her. Same for reverse cowgirl. You could also do the &amp;#39;&lt;a href=\"http://imgur.com/a/wNHo1\"&gt;legs on shoulders&lt;/a&gt;&amp;#39; position, depending on how flexible her legs are. &lt;/p&gt;\n\n&lt;p&gt;I think she will quickly realize pillows are going to be your friends here. You really don&amp;#39;t need sex pillows at first, though... for missionary I would suggest just regular pillow to boost her pelvis to a position that works for both of you. I&amp;#39;m assuming you&amp;#39;ll be doing most of the motion so it would be easier for you to penetrate her and keep a rhythm an accessible angle. You may even be able to use the pillow to boost her pelvis up if you&amp;#39;re doing her from behind.  A cylindrical pillow like &lt;a href=\"https://www.amazon.com/Exercise-Pillow-Inflatable-Relaxing-Unisex/dp/B00YMJLZ54/ref=sr_1_16_s_it?s=hpc&amp;amp;ie=UTF8&amp;amp;qid=1492400092&amp;amp;sr=1-16\"&gt;this&lt;/a&gt; one might be the ticket! Basically making her vagina as accessible to you as possible is the goal here. &lt;/p&gt;\n\n&lt;p&gt;Even if she&amp;#39;s not okay with using a pillow at first, I&amp;#39;m sure you guys will get crafty in the heat of the moment. Where there&amp;#39;s a will, there&amp;#39;s a way. :) I think it&amp;#39;s stellar you&amp;#39;ve got open communication, that&amp;#39;s a really good sign. &lt;/p&gt;\n\n&lt;p&gt;You seem like a great, caring guy, and I&amp;#39;m so glad you guys ended up together. If you don&amp;#39;t mind too much, I think we&amp;#39;d all like an update on this once you guys try it out!&lt;/p&gt;\n\n&lt;p&gt;Edit - Just thought of another that doesn&amp;#39;t use pillows. Depending on how high your/her bed sits, you could have her back on the bed with legs up and over your shoulders. You could also flip her over and do her from behind if you can keep her from slipping off. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd2ei2", "score_hidden": false, "stickied": false, "created": 1492429644.0, "created_utc": 1492400844.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcy27w", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "luckyPOSthrowaway", "parent_id": "t1_dgcxw0z", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "We intend to try some things like that. As I said in another comment though, she wants conventional, unassisted/altered sex first before she tries anything though.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We intend to try some things like that. As I said in another comment though, she wants conventional, unassisted/altered sex first before she tries anything though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcy27w", "score_hidden": false, "stickied": false, "created": 1492423455.0, "created_utc": 1492394655.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxw0z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ronddecuir", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Do you think stuff like sex pillow or swing might help with options ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you think stuff like sex pillow or swing might help with options ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgcxw0z", "score_hidden": false, "stickied": false, "created": 1492423217.0, "created_utc": 1492394417.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdavje", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tudueno1973", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Some of the best sex I ever had \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some of the best sex I ever had &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdavje", "score_hidden": false, "stickied": false, "created": 1492449148.0, "created_utc": 1492420348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdcnox", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MrMez", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "So happy for you, something like this might help the logistics?\n\nhttp://www.makemeheal.com/images/products/estore/10197/liberator-jaz-pillow-charcoal.jpg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So happy for you, something like this might help the logistics?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.makemeheal.com/images/products/estore/10197/liberator-jaz-pillow-charcoal.jpg\"&gt;http://www.makemeheal.com/images/products/estore/10197/liberator-jaz-pillow-charcoal.jpg&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdcnox", "score_hidden": false, "stickied": false, "created": 1492455058.0, "created_utc": 1492426258.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdeqht", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tfresca", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Can't speak specifically to the paralysis but I imagine her on her side with straddling one of her legs will be the best position since I imagine you have to do all the thrusting.\n\nGood luck and take it slow..Maybe give her a small vibe to practice with ahead of time if she's never done anything at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can&amp;#39;t speak specifically to the paralysis but I imagine her on her side with straddling one of her legs will be the best position since I imagine you have to do all the thrusting.&lt;/p&gt;\n\n&lt;p&gt;Good luck and take it slow..Maybe give her a small vibe to practice with ahead of time if she&amp;#39;s never done anything at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdeqht", "score_hidden": false, "stickied": false, "created": 1492460273.0, "created_utc": 1492431473.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdhus9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jaxjeager", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Several years ago I had a FWB with pretty serious MS. She was not totally paralyzed but had very little control of her legs, and diminished sensation in her legs but not her torso or pussy. She also had a general weakness in her upper body. She could stand with assistance, and could lean over a table or couch back, so standing doggy was possible, and in fact one of her favorites. It was pretty much the only position she could fuck me back because it mostly used her upper body.\n\nSex with her was certainly different. A lot of positions were difficult or impossible. I had to do most of the work of positioning her, in particular her legs.\n\nThe main thing is to listen to her, communicate a lot, and learn together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Several years ago I had a FWB with pretty serious MS. She was not totally paralyzed but had very little control of her legs, and diminished sensation in her legs but not her torso or pussy. She also had a general weakness in her upper body. She could stand with assistance, and could lean over a table or couch back, so standing doggy was possible, and in fact one of her favorites. It was pretty much the only position she could fuck me back because it mostly used her upper body.&lt;/p&gt;\n\n&lt;p&gt;Sex with her was certainly different. A lot of positions were difficult or impossible. I had to do most of the work of positioning her, in particular her legs.&lt;/p&gt;\n\n&lt;p&gt;The main thing is to listen to her, communicate a lot, and learn together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdhus9", "score_hidden": false, "stickied": false, "created": 1492465724.0, "created_utc": 1492436924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdhwu4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "onekate", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Encourage her to guide you with words and specific feedback as you explore and experience each other's bodies. Using expressive language in bed is a powerful skill, and getting comfortable with your communication around sex will lead to more success. Giving positive feedback when something feels good (I love your breath on my ear), asking for what you want (please hold me tight), talking about steps before you take them (I'm going to touch your pussy now), helps you learn and encourages exploring. As an experienced non-virgin at this point, I encourage you to consider the sexiness of everything you do together and not just the PIV and put the same thought and care into the rest of the moments you share as you are that singular act. kissing, stoking her hand at dinner, holding each other in bed, sharing massages, exploring your bodies together, PIV, oral, etc... All are awesome and all can bring immense pleasure. And savoring each one does the double duty of taking the pressure off any one thing as the only thing, and letting the heights you reach get higher. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Encourage her to guide you with words and specific feedback as you explore and experience each other&amp;#39;s bodies. Using expressive language in bed is a powerful skill, and getting comfortable with your communication around sex will lead to more success. Giving positive feedback when something feels good (I love your breath on my ear), asking for what you want (please hold me tight), talking about steps before you take them (I&amp;#39;m going to touch your pussy now), helps you learn and encourages exploring. As an experienced non-virgin at this point, I encourage you to consider the sexiness of everything you do together and not just the PIV and put the same thought and care into the rest of the moments you share as you are that singular act. kissing, stoking her hand at dinner, holding each other in bed, sharing massages, exploring your bodies together, PIV, oral, etc... All are awesome and all can bring immense pleasure. And savoring each one does the double duty of taking the pressure off any one thing as the only thing, and letting the heights you reach get higher. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdhwu4", "score_hidden": false, "stickied": false, "created": 1492465814.0, "created_utc": 1492437014.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdils2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Indy93", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Does she masturbate? (can she?) If so, ask her how she does it and what she likes. \nAlso, make sure she's okay with you moving her legs when getting into other positions etc. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does she masturbate? (can she?) If so, ask her how she does it and what she likes. \nAlso, make sure she&amp;#39;s okay with you moving her legs when getting into other positions etc. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdils2", "score_hidden": false, "stickied": false, "created": 1492466835.0, "created_utc": 1492438035.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdn0of", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ultrafud", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Hey man i don't really have any advice for you, but reading your story genuinely warmed my heart - and I'm an old cynical bastard. Thank you for giving me a little bit of happiness reading that, and goodluck on your relationship going forward. You seem like a good guy, keep it up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man i don&amp;#39;t really have any advice for you, but reading your story genuinely warmed my heart - and I&amp;#39;m an old cynical bastard. Thank you for giving me a little bit of happiness reading that, and goodluck on your relationship going forward. You seem like a good guy, keep it up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdn0of", "score_hidden": false, "stickied": false, "created": 1492472421.0, "created_utc": 1492443621.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdqhro", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "UCRXThrow", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Good luck Dr. Laughter, you're a good kid!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck Dr. Laughter, you&amp;#39;re a good kid!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdqhro", "score_hidden": false, "stickied": false, "created": 1492476341.0, "created_utc": 1492447541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdro1n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jtgyk", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "!RemindMe 2 weeks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;!RemindMe 2 weeks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdro1n", "score_hidden": false, "stickied": false, "created": 1492477643.0, "created_utc": 1492448843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgds9k9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zombie_Party_Boy", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "CTRL + F \"Hymen\" = 0 of 0. *Sigh*. OK, so don't freak out, but \"cherry popping\" isn't just a metaphor. If she has an intact hymen, there is the possibility that she will bleed from your member poking through it. It may keep bleeding for several days after. You may want to keep a towel handy, and you may want to have a super awkward discussion about it beforehand. Even if she has no hymen to speak of, crossing the line from never having a penis inside to having had a penis inside can be emotional for some women. So, don't be surprised if it isn't \"fun\". Be supportive, cuddle, reinforce trust, dab her bleeding axe wound with a warm, wet washcloth if she desires. If all goes well, after the second or third time she'll be running you down and pinning you against the table until you give her that sweet D again.  \n   \nTL;DR: There may be crying involved.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;CTRL + F &amp;quot;Hymen&amp;quot; = 0 of 0. &lt;em&gt;Sigh&lt;/em&gt;. OK, so don&amp;#39;t freak out, but &amp;quot;cherry popping&amp;quot; isn&amp;#39;t just a metaphor. If she has an intact hymen, there is the possibility that she will bleed from your member poking through it. It may keep bleeding for several days after. You may want to keep a towel handy, and you may want to have a super awkward discussion about it beforehand. Even if she has no hymen to speak of, crossing the line from never having a penis inside to having had a penis inside can be emotional for some women. So, don&amp;#39;t be surprised if it isn&amp;#39;t &amp;quot;fun&amp;quot;. Be supportive, cuddle, reinforce trust, dab her bleeding axe wound with a warm, wet washcloth if she desires. If all goes well, after the second or third time she&amp;#39;ll be running you down and pinning you against the table until you give her that sweet D again.  &lt;/p&gt;\n\n&lt;p&gt;TL;DR: There may be crying involved.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgds9k9", "score_hidden": false, "stickied": false, "created": 1492478308.0, "created_utc": 1492449508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdsy30", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RagnarRipper", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Sorry, no advice or experience, I just loved the story and wanted to wish you all the best! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, no advice or experience, I just loved the story and wanted to wish you all the best! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdsy30", "score_hidden": false, "stickied": false, "created": 1492479070.0, "created_utc": 1492450270.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdv1pu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skittlesprincess", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Firstly, congrats! This is one of the loveliest posts I've ever seen :3\n\nSecond, as others say go slow. Like, really crazy slow. I'm sure she'll let you know if she wants you to go faster but it's much sexier to push forward than pull back. Spend a lot of time kissing her, her mouth, her neck, her breasts. Spend some time there, run your hands down her body, remind her how sexy she is. Ease her into penetration, start with one finger and work your way up. Things will go a lot smoother if everything's had a chance to warm up, so to speak.\n\nLastly, have fun! It sounds like you two have everything going for you and I'm sure it'll go great :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Firstly, congrats! This is one of the loveliest posts I&amp;#39;ve ever seen :3&lt;/p&gt;\n\n&lt;p&gt;Second, as others say go slow. Like, really crazy slow. I&amp;#39;m sure she&amp;#39;ll let you know if she wants you to go faster but it&amp;#39;s much sexier to push forward than pull back. Spend a lot of time kissing her, her mouth, her neck, her breasts. Spend some time there, run your hands down her body, remind her how sexy she is. Ease her into penetration, start with one finger and work your way up. Things will go a lot smoother if everything&amp;#39;s had a chance to warm up, so to speak.&lt;/p&gt;\n\n&lt;p&gt;Lastly, have fun! It sounds like you two have everything going for you and I&amp;#39;m sure it&amp;#39;ll go great :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdv1pu", "score_hidden": false, "stickied": false, "created": 1492481379.0, "created_utc": 1492452579.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdwj7k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Philomath1313", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Just want to give a little info, not one that u asked for tho.  Even though she is paralyzed due to a spinal chord transection (I assume), she can still have and feel orgasms.  Orgasms are subserved by the vagus nerve and not the spinal cord. So, assuming that her vagus nerve is in tact, go to town!! While she may not be able to feel vaginal stimulation, get her worked up mentally as much as you can.\n\nBoth of you guys sound awesome!! All the best to you both!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just want to give a little info, not one that u asked for tho.  Even though she is paralyzed due to a spinal chord transection (I assume), she can still have and feel orgasms.  Orgasms are subserved by the vagus nerve and not the spinal cord. So, assuming that her vagus nerve is in tact, go to town!! While she may not be able to feel vaginal stimulation, get her worked up mentally as much as you can.&lt;/p&gt;\n\n&lt;p&gt;Both of you guys sound awesome!! All the best to you both!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdwj7k", "score_hidden": false, "stickied": false, "created": 1492483050.0, "created_utc": 1492454250.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdwsgs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ASILKYBUSH", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I dunno. Just make her feel loved and Sexy. Everything else falls into place or becomes irrelevant", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dunno. Just make her feel loved and Sexy. Everything else falls into place or becomes irrelevant&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdwsgs", "score_hidden": true, "stickied": false, "created": 1492483339.0, "created_utc": 1492454539.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdxq2f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Alejandrazx", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Take your time and warm her up well. Also,  what PPs have said about being responsive to her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take your time and warm her up well. Also,  what PPs have said about being responsive to her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdxq2f", "score_hidden": true, "stickied": false, "created": 1492484398.0, "created_utc": 1492455598.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdyp7e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Koalainpyjamas", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Prone bone could work quite well and is really intimate! Good luck to you both :)\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Prone bone could work quite well and is really intimate! Good luck to you both :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdyp7e", "score_hidden": true, "stickied": false, "created": 1492485507.0, "created_utc": 1492456707.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dge09vp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kozata13", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "A shoulder to cry on becomes a dick to ride on", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A shoulder to cry on becomes a dick to ride on&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge09vp", "score_hidden": true, "stickied": false, "created": 1492487290.0, "created_utc": 1492458490.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgd5mca", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "throwaway10849", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I think sensations above the level of injury can be really arousing for individuals who are paralyzed, so make sure you concentrate on foreplay she can feel. Like, if she can feel her breasts, spend a lot of time there. her neck. the inside of her arms etc. Listen to her cues and understand that her erogenous zones are going to be different. I've heard with practice a lot of paraplegics can come just from that type of stimulation. Make sure to take your time. \n\nEnjoy!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think sensations above the level of injury can be really arousing for individuals who are paralyzed, so make sure you concentrate on foreplay she can feel. Like, if she can feel her breasts, spend a lot of time there. her neck. the inside of her arms etc. Listen to her cues and understand that her erogenous zones are going to be different. I&amp;#39;ve heard with practice a lot of paraplegics can come just from that type of stimulation. Make sure to take your time. &lt;/p&gt;\n\n&lt;p&gt;Enjoy!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgd5mca", "score_hidden": false, "stickied": false, "created": 1492435356.0, "created_utc": 1492406556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdd59z", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Jemimapuddlemuck", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Good luck OP! Girls can often bleed during there first time so just be prepared for that too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good luck OP! Girls can often bleed during there first time so just be prepared for that too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdd59z", "score_hidden": false, "stickied": false, "created": 1492456471.0, "created_utc": 1492427671.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65rvty", "likes": null, "replies": "", "user_reports": [], "id": "dgdsg52", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "FaKeShAdOw", "parent_id": "t3_65rvty", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I still think this is a bad idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I still think this is a bad idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdsg52", "score_hidden": false, "stickied": false, "created": 1492478513.0, "created_utc": 1492449713.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}]