[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m about (18F) 5&amp;quot;10, 140lbs, and my boyfriend is (18M) 5&amp;quot;11, but about 130lbs soaking wet. How do I get more comfortable during sex? There have been so many times where I&amp;#39;ve wanted to be on top or try a different position but I&amp;#39;m extremely scared and insecure because I&amp;#39;m significantly bigger than him. We are both still pretty young and I know that our bodies will be subject to change in the next couple of years, but I can&amp;#39;t help but feel insecure when his hip bones protrude and I just have these endless rolls of fat. He loves my body and thinks I&amp;#39;m beautiful, but I just wish here wasn&amp;#39;t such a drastic difference between our body types that created insecurity when we&amp;#39;re intimate. Help? &lt;/p&gt;\n\n&lt;p&gt;Also please keep in mind I am in recovery from a severe restrictive eating disorder. I was about 124 pounds at 5&amp;quot;10 about a year ago, and I have been weight restored ever since. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm about (18F) 5\"10, 140lbs, and my boyfriend is (18M) 5\"11, but about 130lbs soaking wet. How do I get more comfortable during sex? There have been so many times where I've wanted to be on top or try a different position but I'm extremely scared and insecure because I'm significantly bigger than him. We are both still pretty young and I know that our bodies will be subject to change in the next couple of years, but I can't help but feel insecure when his hip bones protrude and I just have these endless rolls of fat. He loves my body and thinks I'm beautiful, but I just wish here wasn't such a drastic difference between our body types that created insecurity when we're intimate. Help? \n\n\n\nAlso please keep in mind I am in recovery from a severe restrictive eating disorder. I was about 124 pounds at 5\"10 about a year ago, and I have been weight restored ever since. ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65veus", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 40, "report_reasons": null, "author": "esteems", "saved": false, "mod_reports": [], "name": "t3_65veus", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": 1492443047.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/65veus/body_image_how_do_i_get_more_comfortable_during/", "num_reports": null, "locked": false, "stickied": false, "created": 1492463021.0, "url": "https://www.reddit.com/r/sex/comments/65veus/body_image_how_do_i_get_more_comfortable_during/", "author_flair_text": null, "quarantine": false, "title": "[Body Image] How do I get more comfortable during sex?", "created_utc": 1492434221.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdqqn2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "johandr22", "parent_id": "t1_dgdh527", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "This pretty much the best advice you can get. I'll just add and say to talk it out with your bf, and see if he likes other positions that you feel comfortable with", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This pretty much the best advice you can get. I&amp;#39;ll just add and say to talk it out with your bf, and see if he likes other positions that you feel comfortable with&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdqqn2", "score_hidden": false, "stickied": false, "created": 1492476608.0, "created_utc": 1492447808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdh527", "gilded": 0, "archived": false, "score": 51, "report_reasons": null, "author": "novaskyd", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Honestly at 5'10\" 140 is a perfectly reasonable weight for a female. In fact you are right smack in the middle of ideal BMI, maybe even on the low end. I highly doubt you have endless rolls of fat. Sometimes it can be hard to get over that insecurity but lots of guys love tall women, being tall is generally associated with being beautiful--like model-type beautiful! So I would consider that an advantage, actually. If your bf finds you attractive then work on accepting that. I know it can be hard. But you have to trust him.\n\nAlso, sometimes getting regular exercise can improve body image and make you feel more comfortable even if your body doesn't actually change much. It tends to make people more confident.\n\n10lbs is not that big of a weight difference either, so you're highly unlikely to break him lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly at 5&amp;#39;10&amp;quot; 140 is a perfectly reasonable weight for a female. In fact you are right smack in the middle of ideal BMI, maybe even on the low end. I highly doubt you have endless rolls of fat. Sometimes it can be hard to get over that insecurity but lots of guys love tall women, being tall is generally associated with being beautiful--like model-type beautiful! So I would consider that an advantage, actually. If your bf finds you attractive then work on accepting that. I know it can be hard. But you have to trust him.&lt;/p&gt;\n\n&lt;p&gt;Also, sometimes getting regular exercise can improve body image and make you feel more comfortable even if your body doesn&amp;#39;t actually change much. It tends to make people more confident.&lt;/p&gt;\n\n&lt;p&gt;10lbs is not that big of a weight difference either, so you&amp;#39;re highly unlikely to break him lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdh527", "score_hidden": false, "stickied": false, "created": 1492464606.0, "created_utc": 1492435806.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 51}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdm9uw", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Prelude95", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It seems like your concern isn't specifically about *your* size as much as it's about your size *relative to him*. You are not at all 'significantly' bigger than him. Most people can't judge an extra 10lb anyway. \n\nYou're right about bodies changing over the next few years though.\n\nI got vastly more confident with my body as I had more sex. Practice - you'll learn what works, what doesn't, and what you both like, and that a 10lb difference is absolutely nothing.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems like your concern isn&amp;#39;t specifically about &lt;em&gt;your&lt;/em&gt; size as much as it&amp;#39;s about your size &lt;em&gt;relative to him&lt;/em&gt;. You are not at all &amp;#39;significantly&amp;#39; bigger than him. Most people can&amp;#39;t judge an extra 10lb anyway. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right about bodies changing over the next few years though.&lt;/p&gt;\n\n&lt;p&gt;I got vastly more confident with my body as I had more sex. Practice - you&amp;#39;ll learn what works, what doesn&amp;#39;t, and what you both like, and that a 10lb difference is absolutely nothing.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdm9uw", "score_hidden": false, "stickied": false, "created": 1492471554.0, "created_utc": 1492442754.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdowxb", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "moon504", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It's possible that because your recovering from an eating disorder, you may have a little bit of body dysmorphia. 140 and 5-10 is usually considered pretty slim. Also try to keep in mind he thinks you're beautiful, so the only person judging your body during sex is YOU. Good luck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s possible that because your recovering from an eating disorder, you may have a little bit of body dysmorphia. 140 and 5-10 is usually considered pretty slim. Also try to keep in mind he thinks you&amp;#39;re beautiful, so the only person judging your body during sex is YOU. Good luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdowxb", "score_hidden": false, "stickied": false, "created": 1492474583.0, "created_utc": 1492445783.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdk46q", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "_Pig-Pen_", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Well, I'm 5'7\" and when I was 140lbs I thought I was slim. Now it's a dream for me to slim down to that and I'm still happy to get on top of my husband. He doesn't care - he knows what I look like and wants me to be enthusiastic, not try to hide myself under the covers.\n\nYou're tall, you're a healthy weight, you're young. There is no way you have 'rolls of fat'. He finds you attractive or he wouldn't be with you. If there is 10lbs of difference between you, that's nothing. I doubt there is a 'drastic difference' between your body types other than he is a man and you're a woman, but if there is it's because he  is probably very slim at that weight.\n\nAll I can say is that at 18 I was very insecure too and that confidence has come with age. Try to listen to your BF when he tells you he likes the way you look. Why would he lie to you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I&amp;#39;m 5&amp;#39;7&amp;quot; and when I was 140lbs I thought I was slim. Now it&amp;#39;s a dream for me to slim down to that and I&amp;#39;m still happy to get on top of my husband. He doesn&amp;#39;t care - he knows what I look like and wants me to be enthusiastic, not try to hide myself under the covers.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re tall, you&amp;#39;re a healthy weight, you&amp;#39;re young. There is no way you have &amp;#39;rolls of fat&amp;#39;. He finds you attractive or he wouldn&amp;#39;t be with you. If there is 10lbs of difference between you, that&amp;#39;s nothing. I doubt there is a &amp;#39;drastic difference&amp;#39; between your body types other than he is a man and you&amp;#39;re a woman, but if there is it&amp;#39;s because he  is probably very slim at that weight.&lt;/p&gt;\n\n&lt;p&gt;All I can say is that at 18 I was very insecure too and that confidence has come with age. Try to listen to your BF when he tells you he likes the way you look. Why would he lie to you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdk46q", "score_hidden": false, "stickied": false, "created": 1492468886.0, "created_utc": 1492440086.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdp3w3", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "_Pig-Pen_", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Your edit mentioning about your eating disorder sheds more light on things. I think it's probably still early days for you getting used to your new shape which must feel bigger to you than it seems from my perspective. Just give yourself time and be kind to yourself. Talk to your BF honestly about how you feel and if he is a good guy he will reassure you. Try not to compare yourself to him too much. I've always had a thing for slim built men but felt bad about not being able to wear their clothes like you see in the movies, or have them pick me up or feel like the 'little' woman beside them. What size he is doesn't mean that the size you are is wrong, it's just what it is. You could break up with him and find a big guy instead - would that seem like the right answer to you? I'm hoping not because your poor BF would have done nothing to deserve being dropped. It's just about adjusting to the new situation but in all honesty 10lbs isn't a big difference. He probably loves that 10lbs of flesh in all it's womanly glory!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your edit mentioning about your eating disorder sheds more light on things. I think it&amp;#39;s probably still early days for you getting used to your new shape which must feel bigger to you than it seems from my perspective. Just give yourself time and be kind to yourself. Talk to your BF honestly about how you feel and if he is a good guy he will reassure you. Try not to compare yourself to him too much. I&amp;#39;ve always had a thing for slim built men but felt bad about not being able to wear their clothes like you see in the movies, or have them pick me up or feel like the &amp;#39;little&amp;#39; woman beside them. What size he is doesn&amp;#39;t mean that the size you are is wrong, it&amp;#39;s just what it is. You could break up with him and find a big guy instead - would that seem like the right answer to you? I&amp;#39;m hoping not because your poor BF would have done nothing to deserve being dropped. It&amp;#39;s just about adjusting to the new situation but in all honesty 10lbs isn&amp;#39;t a big difference. He probably loves that 10lbs of flesh in all it&amp;#39;s womanly glory!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdp3w3", "score_hidden": false, "stickied": false, "created": 1492474804.0, "created_utc": 1492446004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdkp4k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "RocketMcRocketface", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It reads like you are roughly the same weight and height. As a man I can tell you that 10lb is not going to break him. Just get up there and ride him. Just do it. We'll all be old soon, with soft cocks and dried up pussies. Get amongst it while you are beautiful and young.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It reads like you are roughly the same weight and height. As a man I can tell you that 10lb is not going to break him. Just get up there and ride him. Just do it. We&amp;#39;ll all be old soon, with soft cocks and dried up pussies. Get amongst it while you are beautiful and young.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkp4k", "score_hidden": false, "stickied": false, "created": 1492469631.0, "created_utc": 1492440831.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdrgs8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bikesboozeandbacon", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "There's no way you have \"rolls\" at 5'10 and 140lbs. I'm the same weight but 6 inches shorter and I don't even have rolls just a little jiggle in the tum tum. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no way you have &amp;quot;rolls&amp;quot; at 5&amp;#39;10 and 140lbs. I&amp;#39;m the same weight but 6 inches shorter and I don&amp;#39;t even have rolls just a little jiggle in the tum tum. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdrgs8", "score_hidden": false, "stickied": false, "created": 1492477416.0, "created_utc": 1492448616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdqadk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kiwi_butt", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Your weight is completely fine, please don't take your insecurities as a reason to lose weight. I have been there myself, it sucks, I can really relate.\n\nMaybe it would help to try and forget society's expectation that women *have* to be smaller than men/their male partners. Yeah, men are generally taller and heavier than women, but why should that matter to your relationship? You are both attracted to each other and if you were smaller than him, why would that be better? It wouldn't. \n\nMy boyfriend is almost a foot taller than me and thus heavier so that's kind of different, but he is proportionally skinnier and it makes me insecure, too. But when I think about it, it really doesn't matter. Unless you would weigh multiple times more you won't crush your boyfriend.     \nIt is probably very hard on you because of your past with an eating disorder. Are you currently seeing a therapist? Because if you do, I think it would be a good idea to bring up this topic as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your weight is completely fine, please don&amp;#39;t take your insecurities as a reason to lose weight. I have been there myself, it sucks, I can really relate.&lt;/p&gt;\n\n&lt;p&gt;Maybe it would help to try and forget society&amp;#39;s expectation that women &lt;em&gt;have&lt;/em&gt; to be smaller than men/their male partners. Yeah, men are generally taller and heavier than women, but why should that matter to your relationship? You are both attracted to each other and if you were smaller than him, why would that be better? It wouldn&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;My boyfriend is almost a foot taller than me and thus heavier so that&amp;#39;s kind of different, but he is proportionally skinnier and it makes me insecure, too. But when I think about it, it really doesn&amp;#39;t matter. Unless you would weigh multiple times more you won&amp;#39;t crush your boyfriend.&lt;br/&gt;\nIt is probably very hard on you because of your past with an eating disorder. Are you currently seeing a therapist? Because if you do, I think it would be a good idea to bring up this topic as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdqadk", "score_hidden": false, "stickied": false, "created": 1492476115.0, "created_utc": 1492447315.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdorcf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "goldanred", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "It seems you're more worried about being bigger than he is than being \"big\", correct? \n\nThis summer the guy I was dating (6'7\") got really sick and lost a bunch of weight. He was healthily shaped at 200 lbs, but dropped to 180 lbs right away and it showed.  \n\nI worried for his health, but also because at 5'9\", I am 180 lbs, definitely overweight. I already had hangups about being fat with a gorgeous guy, and now here we were at the same weight, with drastically different heights. It didn't stop him from wanting to have sex with me. Even though he couldn't control his weight, he still thought I was lovely. He made me physically feel sexy and beautiful.  \n\nIt can be hard to get over that mental barrier. You have to remember that, like you said, he loves your body. He wants to have sex *with you*. If he doesn't know you have this hangup, you might mention it to him, asking that he really emphasizes his desire for your body. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems you&amp;#39;re more worried about being bigger than he is than being &amp;quot;big&amp;quot;, correct? &lt;/p&gt;\n\n&lt;p&gt;This summer the guy I was dating (6&amp;#39;7&amp;quot;) got really sick and lost a bunch of weight. He was healthily shaped at 200 lbs, but dropped to 180 lbs right away and it showed.  &lt;/p&gt;\n\n&lt;p&gt;I worried for his health, but also because at 5&amp;#39;9&amp;quot;, I am 180 lbs, definitely overweight. I already had hangups about being fat with a gorgeous guy, and now here we were at the same weight, with drastically different heights. It didn&amp;#39;t stop him from wanting to have sex with me. Even though he couldn&amp;#39;t control his weight, he still thought I was lovely. He made me physically feel sexy and beautiful.  &lt;/p&gt;\n\n&lt;p&gt;It can be hard to get over that mental barrier. You have to remember that, like you said, he loves your body. He wants to have sex &lt;em&gt;with you&lt;/em&gt;. If he doesn&amp;#39;t know you have this hangup, you might mention it to him, asking that he really emphasizes his desire for your body. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdorcf", "score_hidden": false, "stickied": false, "created": 1492474410.0, "created_utc": 1492445610.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdvi10", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "stink3rbelle", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Honestly, this seems more like a general self-esteem/body image issue than specific to sex. Your feelings of inadequacy or negativity may be coming out during sex, but it sounds like they're there at most times.\n\nYou're recovering from an eating disorder which is AWESOME and amazingly strong, especially considering your age. You recognized a problem, and you accepted help, which is one of the hardest things for someone to do. But you may still feel attached to the way your ED body was emotionally or psychologically, even if you know on other levels you're healthier now. Do you still have a therapist or counselor? Have you spoken to them about body image and self-esteem? (you can talk about it in a general way without going into sex with them).\n\nSome tips I have for general self-esteem: (1) be kind to yourself. When you get an urge to insult or denigrate your body, stop yourself. Consider complimenting it instead, either the same trait or something else about your body. (2) use your body in positive ways. I find working out makes me feel most powerful and positive about my body, but just walking around helps, as does sex. (3) wear clothes that fit and flatter you. Wear things that make you feel good, and that you feel look good. \n\nWhen it comes to sex with your boyfriend, remind yourself that your body *as it is* turns him on or he wouldn't want to have sex with you.  Sometimes, it helps to just fake it til you make it. Try being on top, and pretend that you feel confident about your body, including the \"trouble\" spots that worry you sometimes. Once you try it out, once you get used to being on top, you may discover that your worries become less invasive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, this seems more like a general self-esteem/body image issue than specific to sex. Your feelings of inadequacy or negativity may be coming out during sex, but it sounds like they&amp;#39;re there at most times.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re recovering from an eating disorder which is AWESOME and amazingly strong, especially considering your age. You recognized a problem, and you accepted help, which is one of the hardest things for someone to do. But you may still feel attached to the way your ED body was emotionally or psychologically, even if you know on other levels you&amp;#39;re healthier now. Do you still have a therapist or counselor? Have you spoken to them about body image and self-esteem? (you can talk about it in a general way without going into sex with them).&lt;/p&gt;\n\n&lt;p&gt;Some tips I have for general self-esteem: (1) be kind to yourself. When you get an urge to insult or denigrate your body, stop yourself. Consider complimenting it instead, either the same trait or something else about your body. (2) use your body in positive ways. I find working out makes me feel most powerful and positive about my body, but just walking around helps, as does sex. (3) wear clothes that fit and flatter you. Wear things that make you feel good, and that you feel look good. &lt;/p&gt;\n\n&lt;p&gt;When it comes to sex with your boyfriend, remind yourself that your body &lt;em&gt;as it is&lt;/em&gt; turns him on or he wouldn&amp;#39;t want to have sex with you.  Sometimes, it helps to just fake it til you make it. Try being on top, and pretend that you feel confident about your body, including the &amp;quot;trouble&amp;quot; spots that worry you sometimes. Once you try it out, once you get used to being on top, you may discover that your worries become less invasive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdvi10", "score_hidden": false, "stickied": false, "created": 1492481887.0, "created_utc": 1492453087.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dge2tsj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rizzie_", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Girl, I getchu. This shit is ROUGH. 10 pounds can totally feel like a big deal. \n\nWhat I will say to you--it's not a big deal, *at your height*. Girl, listen, we all know 10 pounds makes a difference on some bodies.  But at your height, there's no way! If you can't have confidence in yourself because of where your life's at right now, that's understandable. But have confidence in something objective, measurable: your height!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Girl, I getchu. This shit is ROUGH. 10 pounds can totally feel like a big deal. &lt;/p&gt;\n\n&lt;p&gt;What I will say to you--it&amp;#39;s not a big deal, &lt;em&gt;at your height&lt;/em&gt;. Girl, listen, we all know 10 pounds makes a difference on some bodies.  But at your height, there&amp;#39;s no way! If you can&amp;#39;t have confidence in yourself because of where your life&amp;#39;s at right now, that&amp;#39;s understandable. But have confidence in something objective, measurable: your height!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge2tsj", "score_hidden": true, "stickied": false, "created": 1492490147.0, "created_utc": 1492461347.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65veus", "likes": null, "replies": "", "user_reports": [], "id": "dgdq7tt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "G_o_o_d_n_a_s_t_y", "parent_id": "t3_65veus", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You two could work out together, he could bulk up a bit. That might cut down the contrast that's tripping you up!\n\nGood job on recovering from the eating disorder! You're at a very healthy weight!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You two could work out together, he could bulk up a bit. That might cut down the contrast that&amp;#39;s tripping you up!&lt;/p&gt;\n\n&lt;p&gt;Good job on recovering from the eating disorder! You&amp;#39;re at a very healthy weight!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdq7tt", "score_hidden": false, "stickied": false, "created": 1492476036.0, "created_utc": 1492447236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]