[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "sex", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if this is a bit long, I&amp;#39;m just trying to provide a bit of background.&lt;/p&gt;\n\n&lt;p&gt;My fiancée and I have a pretty healthy sex life. I work away but while I&amp;#39;m home for my week off we typically have sex 4-7 times. Normally we have pretty &amp;quot;passionate&amp;quot; sex with lots of kissing and holding each other closely, occasionally we would use the we-vibe we bought together, but fairly vanilla in general. Recently I just decided to try the mojo upgrade quiz which was actually really good for both of us, I didn&amp;#39;t know she was so open to different things, mostly I think because we found a rhythm with our sex and just stuck with it I suppose. We&amp;#39;ve been to the sex store a lot more recently and picked up a few toys to spice things up between us, which has been fun, but admittedly it&amp;#39;s done more for her than it has for me.&lt;/p&gt;\n\n&lt;p&gt;Everything we matched on in the quiz was fairly straightforward but when I was going through it I got stuck on the rough sex part... I don&amp;#39;t know how to be rough with her. I asked her about it but she didn&amp;#39;t really say much other than she &lt;em&gt;sometimes&lt;/em&gt; wants to be fucked instead of making love/having sex. We talked about it on and off during the day one day and she was getting really turned on at the idea of me being rough with her that night. When the time came that night it just ended up being our regular vanilla sex only with one of the vibrating c-rings we bought (which she&amp;#39;s completely in love with). I think she was a bit disappointed that I didn&amp;#39;t follow through with being rough. I know she still enjoyed it, but it just didn&amp;#39;t seem like she enjoyed it as much as she wanted to from her body language afterwards.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really know how to go forward here guys, back in my partying days I would have had no problem doing it but I have a hard time just seeing her as someone to fuck. We have a blended family together and she has been the best thing to ever happen to me only next to my children; I love her with all of my heart and I honestly feel like kind of a pussy saying it, but I don&amp;#39;t know if I have it in me to treat her like a sex object. I don&amp;#39;t want to take that away from her though, I want to be able to satisfy her every desire. Can anyone give me any ideas how to get past this?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; fiancée wants rough sex and my boring self can&amp;#39;t figure out how to give it to her&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sorry if this is a bit long, I'm just trying to provide a bit of background.\n\nMy fiancée and I have a pretty healthy sex life. I work away but while I'm home for my week off we typically have sex 4-7 times. Normally we have pretty \"passionate\" sex with lots of kissing and holding each other closely, occasionally we would use the we-vibe we bought together, but fairly vanilla in general. Recently I just decided to try the mojo upgrade quiz which was actually really good for both of us, I didn't know she was so open to different things, mostly I think because we found a rhythm with our sex and just stuck with it I suppose. We've been to the sex store a lot more recently and picked up a few toys to spice things up between us, which has been fun, but admittedly it's done more for her than it has for me.\n\nEverything we matched on in the quiz was fairly straightforward but when I was going through it I got stuck on the rough sex part... I don't know how to be rough with her. I asked her about it but she didn't really say much other than she *sometimes* wants to be fucked instead of making love/having sex. We talked about it on and off during the day one day and she was getting really turned on at the idea of me being rough with her that night. When the time came that night it just ended up being our regular vanilla sex only with one of the vibrating c-rings we bought (which she's completely in love with). I think she was a bit disappointed that I didn't follow through with being rough. I know she still enjoyed it, but it just didn't seem like she enjoyed it as much as she wanted to from her body language afterwards.\n\nI don't really know how to go forward here guys, back in my partying days I would have had no problem doing it but I have a hard time just seeing her as someone to fuck. We have a blended family together and she has been the best thing to ever happen to me only next to my children; I love her with all of my heart and I honestly feel like kind of a pussy saying it, but I don't know if I have it in me to treat her like a sex object. I don't want to take that away from her though, I want to be able to satisfy her every desire. Can anyone give me any ideas how to get past this?\n\n**TL;DR:** fiancée wants rough sex and my boring self can't figure out how to give it to her", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65vsub", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 49, "report_reasons": null, "author": "throwitallaway021884", "saved": false, "mod_reports": [], "name": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "approved_by": null, "over_18": false, "domain": "self.sex", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qh3p", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/sex/comments/65vsub/my_fiancée_wants_rough_sex/", "num_reports": null, "locked": false, "stickied": false, "created": 1492467451.0, "url": "https://www.reddit.com/r/sex/comments/65vsub/my_fiancée_wants_rough_sex/", "author_flair_text": null, "quarantine": false, "title": "My fiancée wants [rough sex]", "created_utc": 1492438651.0, "distinguished": null, "media": null, "upvote_ratio": 0.83, "num_comments": 28, "visited": false, "subreddit_type": "public", "ups": 49}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dgdxuxh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "liberal_texan", "parent_id": "t1_dgdkbee", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; she said something to the effect of \"oh, how original\" clearly being sarcastic\n\nHer criticizing your attempts to understand her will not help.  \n\nYou are going to need her to lead you on this, to tell you what she wants and to express her enjoyment of it when you follow through.  Seeing her enjoyment of it is how you will train yourself to like doing things to her that do not come naturally.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;she said something to the effect of &amp;quot;oh, how original&amp;quot; clearly being sarcastic&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Her criticizing your attempts to understand her will not help.  &lt;/p&gt;\n\n&lt;p&gt;You are going to need her to lead you on this, to tell you what she wants and to express her enjoyment of it when you follow through.  Seeing her enjoyment of it is how you will train yourself to like doing things to her that do not come naturally.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdxuxh", "score_hidden": true, "stickied": false, "created": 1492484549.0, "created_utc": 1492455749.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkbee", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "throwitallaway021884", "parent_id": "t1_dgdjslb", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You're absolutely right, the new experimenting has been really fun and liberating for both of us actually. That quiz threw the doors wide open and we've been having lots of fun, it's just the whole being rough thing that has me at a roadblock. I do spank her randomly too, and her new thing is stopping when walking in front of me and saying \"grab it\". She loves me grabbing her ass lately. \n\nThe thing is when we talked about being rough a while back before the quiz I said something about pulling hair and spanking and she said something to the effect of \"oh, how original\" clearly being sarcastic, so that kind of threw me off a bit I guess. I don't know the thought of spanking her just feels awkward for some reason. I guess it's more of a mental block for me...\n\nShe did mention that she wanted to watch porn with me, so maybe you're right on that one, I could try starting there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re absolutely right, the new experimenting has been really fun and liberating for both of us actually. That quiz threw the doors wide open and we&amp;#39;ve been having lots of fun, it&amp;#39;s just the whole being rough thing that has me at a roadblock. I do spank her randomly too, and her new thing is stopping when walking in front of me and saying &amp;quot;grab it&amp;quot;. She loves me grabbing her ass lately. &lt;/p&gt;\n\n&lt;p&gt;The thing is when we talked about being rough a while back before the quiz I said something about pulling hair and spanking and she said something to the effect of &amp;quot;oh, how original&amp;quot; clearly being sarcastic, so that kind of threw me off a bit I guess. I don&amp;#39;t know the thought of spanking her just feels awkward for some reason. I guess it&amp;#39;s more of a mental block for me...&lt;/p&gt;\n\n&lt;p&gt;She did mention that she wanted to watch porn with me, so maybe you&amp;#39;re right on that one, I could try starting there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkbee", "score_hidden": false, "stickied": false, "created": 1492469146.0, "created_utc": 1492440346.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjslb", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "LimePersonality", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Try spanking her while you guys are home and she is doing a random task, or you are making your way to the bedroom together. If you get a look like \"oohh..\" And a smirk, then spanking is now on the table. Work your way up from there. Watch porn together and have her lay out what is totally hot and what is going to kill the mood. Experiment softly and build your way up. Rough can mean anything from a harder thrust to rape play and choking.   \nEither way, she will always be your wife. She loves you and you guys will still be cool after rough sex. In fact, exploring new sex stuff with partners is more liberating than anything. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try spanking her while you guys are home and she is doing a random task, or you are making your way to the bedroom together. If you get a look like &amp;quot;oohh..&amp;quot; And a smirk, then spanking is now on the table. Work your way up from there. Watch porn together and have her lay out what is totally hot and what is going to kill the mood. Experiment softly and build your way up. Rough can mean anything from a harder thrust to rape play and choking.&lt;br/&gt;\nEither way, she will always be your wife. She loves you and you guys will still be cool after rough sex. In fact, exploring new sex stuff with partners is more liberating than anything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdjslb", "score_hidden": false, "stickied": false, "created": 1492468463.0, "created_utc": 1492439663.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dgdmdpu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Firegod1385", "parent_id": "t1_dgdm85q", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "She might be embarassed about it - just keep an open mind and tell her you're not going to judge her or feel negatively about it. That you want to help facilitate her desires, and if she can narrow it down it would help you guys grow together, and satisify some of her urges.  Never know, could end up being really hot and exciting for both of you and not just her!\n\nYou might not be open to the idea's she has, but try to keep an open mind and be as non-judgmental as possible, especially in your responses.\n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She might be embarassed about it - just keep an open mind and tell her you&amp;#39;re not going to judge her or feel negatively about it. That you want to help facilitate her desires, and if she can narrow it down it would help you guys grow together, and satisify some of her urges.  Never know, could end up being really hot and exciting for both of you and not just her!&lt;/p&gt;\n\n&lt;p&gt;You might not be open to the idea&amp;#39;s she has, but try to keep an open mind and be as non-judgmental as possible, especially in your responses.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdmdpu", "score_hidden": false, "stickied": false, "created": 1492471680.0, "created_utc": 1492442880.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dge091q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TestingTheWetness", "parent_id": "t1_dgdm85q", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If you do it's important to put pressure on the sides of her neck, never directly on her throat. You want pressure on the blood vessels in her neck. You will want a safeword/gesture. My wife loves to be chocked right as she starts to orgasm. Be sure to let go after a few moments or she'll pass out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you do it&amp;#39;s important to put pressure on the sides of her neck, never directly on her throat. You want pressure on the blood vessels in her neck. You will want a safeword/gesture. My wife loves to be chocked right as she starts to orgasm. Be sure to let go after a few moments or she&amp;#39;ll pass out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge091q", "score_hidden": true, "stickied": false, "created": 1492487264.0, "created_utc": 1492458464.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdm85q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwitallaway021884", "parent_id": "t1_dgdljex", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "My girl is the same way with her neck. She can't even wear a necklace because of it, but I suppose you never know what the future holds.\n\nYou're right it would be really nice to have her narrow it down a bit but when I asked her she seemed kind of awkward talking about it, so maybe it goes a little deeper and she's embarrassed about it...? I'll have to try again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My girl is the same way with her neck. She can&amp;#39;t even wear a necklace because of it, but I suppose you never know what the future holds.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right it would be really nice to have her narrow it down a bit but when I asked her she seemed kind of awkward talking about it, so maybe it goes a little deeper and she&amp;#39;s embarrassed about it...? I&amp;#39;ll have to try again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdm85q", "score_hidden": false, "stickied": false, "created": 1492471499.0, "created_utc": 1492442699.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdljex", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Firegod1385", "parent_id": "t1_dgdkudq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I would absolutely, 100%, recommend you discuss with her what sorts of things she means when she says \"rough\" too.  Maybe she just wants it harder, maybe she wants to be spanked during.  Maybe she just wants you to be aggressive and throw her around a little bit. (Like flipping her over, or kissing her aggressively and throwing her onto the bed and jumping on her).  The range of \"rough\" for different women is really vast. So I would really narrow it down to what exactly she thinks are sexy/hot/arousing.  And then you can evaluate what you are comfortable with doing, and come to a conclusion of things to incorporate in the bedroom.\n\nAnd to be completely honest, I -never- thought I'd put my hand on my wife's throat. (She actually couldn't stand anything touching her neck when we first got together) but here we are, 8 years later and we do it once a month or so, part of our D/s style sex that we do occasionally. So who knows! Some idea's you first thought weren't great, will grow on you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would absolutely, 100%, recommend you discuss with her what sorts of things she means when she says &amp;quot;rough&amp;quot; too.  Maybe she just wants it harder, maybe she wants to be spanked during.  Maybe she just wants you to be aggressive and throw her around a little bit. (Like flipping her over, or kissing her aggressively and throwing her onto the bed and jumping on her).  The range of &amp;quot;rough&amp;quot; for different women is really vast. So I would really narrow it down to what exactly she thinks are sexy/hot/arousing.  And then you can evaluate what you are comfortable with doing, and come to a conclusion of things to incorporate in the bedroom.&lt;/p&gt;\n\n&lt;p&gt;And to be completely honest, I -never- thought I&amp;#39;d put my hand on my wife&amp;#39;s throat. (She actually couldn&amp;#39;t stand anything touching her neck when we first got together) but here we are, 8 years later and we do it once a month or so, part of our D/s style sex that we do occasionally. So who knows! Some idea&amp;#39;s you first thought weren&amp;#39;t great, will grow on you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdljex", "score_hidden": false, "stickied": false, "created": 1492470679.0, "created_utc": 1492441879.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkudq", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "throwitallaway021884", "parent_id": "t1_dgdk9lq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;I'm not going to start smacking her tits when we are making dinner.\n\nOh god I'm dying 😂\n\nI hear you on it not changing my value of her, I know that logically, it just seems like a barricade emotionally that I have a hard time crossing, as well as just a feeling of awkwardness when I think about doing those things to her. I think I might start with just giving it to her harder and seeing how that works... as for the hand around the throat, that one is not happening for me at all I don't think. That might be pushing what I'm personally comfortable with.\n\nThank you for your input, much appreciated!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m not going to start smacking her tits when we are making dinner.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Oh god I&amp;#39;m dying 😂&lt;/p&gt;\n\n&lt;p&gt;I hear you on it not changing my value of her, I know that logically, it just seems like a barricade emotionally that I have a hard time crossing, as well as just a feeling of awkwardness when I think about doing those things to her. I think I might start with just giving it to her harder and seeing how that works... as for the hand around the throat, that one is not happening for me at all I don&amp;#39;t think. That might be pushing what I&amp;#39;m personally comfortable with.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your input, much appreciated!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkudq", "score_hidden": false, "stickied": false, "created": 1492469815.0, "created_utc": 1492441015.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk9lq", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Firegod1385", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;I don't really know how to go forward here guys, back in my partying days I would have had no problem doing it but I have a hard time just seeing her as someone to fuck. We have a blended family together and she has been the best thing to ever happen to me only next to my children; I love her with all of my heart and I honestly feel like kind of a pussy saying it, but I don't know if I have it in me to treat her like a sex object. I don't want to take that away from her though, I want to be able to satisfy her every desire. Can anyone give me any ideas how to get past this?\n\nI can sort of see where you are coming from, as sometimes my wife likes the sub-style of being used, some slight degradation and light humiliation.  And while I found that in porn quite arousing, it was a transition for me to actually do/say any of those things to her.\n\nWhat helped me is to understand that because we are involving ourselves in a kink, or a sexual fantasy, or a roleplay scenario, or anything sexual in nature that we both enjoy together - DOES NOT alter my value for her, and our family, outside of the bedroom.\n\nI might smack her ass, call her my dirty slut, pinch and tug her nipples really hard.  But its *ONLY* in the moments of those dirty, rough sex situations.  I'm not going to start smacking her tits when we are making dinner.  I'm not going to treat her differently that I have been while we are out watching a movie.\n\nI'm still going to hold her hand. I'm still going to cuddle with her when we watch a movie.  We are going to act like big dorks while grocery shopping with kisses and being playful.\n\nBut sometimes, she needs that *rawr*, that fire, in the bedroom.  Grab her hips and really pound into her, make her feel like you need her more than anything and that she is there to help you get off. Smack her ass, put your hand around her throat (Please look up how to do this safely!) and look into her eyes like you own her. \n\nFor my wife, this works immensely, and we don't have to do it everytime.  And when we are done? I kiss her, tell her she's fucking amazing and incredible.  Make sure she knows she's loved and I'm gentle with her again.  Once sex is over, that \"play\" of being in control is done, and its back to normal.\n\n\nSorry if this too long-winded, or too specific to my situation, but just wanted to give you insight into how I did it / how it can work, and maybe you can relate to it that way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t really know how to go forward here guys, back in my partying days I would have had no problem doing it but I have a hard time just seeing her as someone to fuck. We have a blended family together and she has been the best thing to ever happen to me only next to my children; I love her with all of my heart and I honestly feel like kind of a pussy saying it, but I don&amp;#39;t know if I have it in me to treat her like a sex object. I don&amp;#39;t want to take that away from her though, I want to be able to satisfy her every desire. Can anyone give me any ideas how to get past this?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can sort of see where you are coming from, as sometimes my wife likes the sub-style of being used, some slight degradation and light humiliation.  And while I found that in porn quite arousing, it was a transition for me to actually do/say any of those things to her.&lt;/p&gt;\n\n&lt;p&gt;What helped me is to understand that because we are involving ourselves in a kink, or a sexual fantasy, or a roleplay scenario, or anything sexual in nature that we both enjoy together - DOES NOT alter my value for her, and our family, outside of the bedroom.&lt;/p&gt;\n\n&lt;p&gt;I might smack her ass, call her my dirty slut, pinch and tug her nipples really hard.  But its &lt;em&gt;ONLY&lt;/em&gt; in the moments of those dirty, rough sex situations.  I&amp;#39;m not going to start smacking her tits when we are making dinner.  I&amp;#39;m not going to treat her differently that I have been while we are out watching a movie.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m still going to hold her hand. I&amp;#39;m still going to cuddle with her when we watch a movie.  We are going to act like big dorks while grocery shopping with kisses and being playful.&lt;/p&gt;\n\n&lt;p&gt;But sometimes, she needs that &lt;em&gt;rawr&lt;/em&gt;, that fire, in the bedroom.  Grab her hips and really pound into her, make her feel like you need her more than anything and that she is there to help you get off. Smack her ass, put your hand around her throat (Please look up how to do this safely!) and look into her eyes like you own her. &lt;/p&gt;\n\n&lt;p&gt;For my wife, this works immensely, and we don&amp;#39;t have to do it everytime.  And when we are done? I kiss her, tell her she&amp;#39;s fucking amazing and incredible.  Make sure she knows she&amp;#39;s loved and I&amp;#39;m gentle with her again.  Once sex is over, that &amp;quot;play&amp;quot; of being in control is done, and its back to normal.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this too long-winded, or too specific to my situation, but just wanted to give you insight into how I did it / how it can work, and maybe you can relate to it that way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdk9lq", "score_hidden": false, "stickied": false, "created": 1492469081.0, "created_utc": 1492440281.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dgdyyld", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tidho", "parent_id": "t1_dgdl042", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Can't hurt to keep in mind, this is something she wants too.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can&amp;#39;t hurt to keep in mind, this is something she wants too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdyyld", "score_hidden": true, "stickied": false, "created": 1492485804.0, "created_utc": 1492457004.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dge1kyb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tmfythandle", "parent_id": "t1_dgdl042", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Being vocal during sex is important too. Pulling hair may be vanilla one way but if you pull her hair and demand that she does what you want (which may be to sit there and do nothing while you think, get water, look at her, etc. anything). Starting to develop your own vision of how you might want to explore her can feel invasive but its essential to know what you want in order to take it from her (she'll enjoy giving it to you bc of who you are). \n\nSex can happen on your terms. Pay attention to your own body and what feels best. Take your time, stop mid act and think-the space between the (sexual) notes is as important as the notes themselves", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Being vocal during sex is important too. Pulling hair may be vanilla one way but if you pull her hair and demand that she does what you want (which may be to sit there and do nothing while you think, get water, look at her, etc. anything). Starting to develop your own vision of how you might want to explore her can feel invasive but its essential to know what you want in order to take it from her (she&amp;#39;ll enjoy giving it to you bc of who you are). &lt;/p&gt;\n\n&lt;p&gt;Sex can happen on your terms. Pay attention to your own body and what feels best. Take your time, stop mid act and think-the space between the (sexual) notes is as important as the notes themselves&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge1kyb", "score_hidden": true, "stickied": false, "created": 1492488761.0, "created_utc": 1492459961.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dge2v43", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "whatsthefussallabout", "parent_id": "t1_dgdl042", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I concur, thats exactly why i like my partner to be occasionally rough with me. Its the only time i get that raw \"i have to have you right now\"energy from him which makes me feel like i am really desirable to him and thats the turn on for me as opposed to the act itself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I concur, thats exactly why i like my partner to be occasionally rough with me. Its the only time i get that raw &amp;quot;i have to have you right now&amp;quot;energy from him which makes me feel like i am really desirable to him and thats the turn on for me as opposed to the act itself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge2v43", "score_hidden": true, "stickied": false, "created": 1492490188.0, "created_utc": 1492461388.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdl042", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "throwitallaway021884", "parent_id": "t1_dgdkqtq", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Thank you very much for this, that's a really good way of looking at it! I'll keep this in mind, I think it will help a lot", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much for this, that&amp;#39;s a really good way of looking at it! I&amp;#39;ll keep this in mind, I think it will help a lot&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdl042", "score_hidden": false, "stickied": false, "created": 1492470011.0, "created_utc": 1492441211.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkqtq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "novaskyd", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Don't think of it as using her, disrespecting her or treating her like a sex object. (Even if that's the way she imagines it.) Instead think of it as how badly you want her. Like you're so turned on and so attracted to her that you can't control yourself, you just have to have her, and it turns you a bit forceful. It's a simple perspective shift. But I find that that's actually the underlying turn-on about this kind of sex for a lot of women, sometimes. That they are making you feel good. Which is a somewhat more vanilla way of looking at it I guess but with the same outcome.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t think of it as using her, disrespecting her or treating her like a sex object. (Even if that&amp;#39;s the way she imagines it.) Instead think of it as how badly you want her. Like you&amp;#39;re so turned on and so attracted to her that you can&amp;#39;t control yourself, you just have to have her, and it turns you a bit forceful. It&amp;#39;s a simple perspective shift. But I find that that&amp;#39;s actually the underlying turn-on about this kind of sex for a lot of women, sometimes. That they are making you feel good. Which is a somewhat more vanilla way of looking at it I guess but with the same outcome.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkqtq", "score_hidden": false, "stickied": false, "created": 1492469690.0, "created_utc": 1492440890.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dge0i6b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TestingTheWetness", "parent_id": "t1_dgdmhi5", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You want safe words that she is comfortable using and can trust you to respect. This is the best advice I think you'll get. Consider cross posting to /r/BDSMcommunity ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You want safe words that she is comfortable using and can trust you to respect. This is the best advice I think you&amp;#39;ll get. Consider cross posting to &lt;a href=\"/r/BDSMcommunity\"&gt;/r/BDSMcommunity&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge0i6b", "score_hidden": true, "stickied": false, "created": 1492487547.0, "created_utc": 1492458747.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmhi5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwitallaway021884", "parent_id": "t1_dgdlcf3", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You bring up a good point actually... I just need to know what would be crossing the line with her, though knowing how I am I'm pretty confident I won't cross any lines... I'm having a hard enough time crossing my own line here lol\n\nI just have a hard time getting into that headspace you're talking about. I know from being on this sub for years that a lot of women love that, but you're right it's hard for me to become \"manly\" again after being conditioned to be nothing but respectful. I'll definitely check out this book, thank you for the suggestion", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You bring up a good point actually... I just need to know what would be crossing the line with her, though knowing how I am I&amp;#39;m pretty confident I won&amp;#39;t cross any lines... I&amp;#39;m having a hard enough time crossing my own line here lol&lt;/p&gt;\n\n&lt;p&gt;I just have a hard time getting into that headspace you&amp;#39;re talking about. I know from being on this sub for years that a lot of women love that, but you&amp;#39;re right it&amp;#39;s hard for me to become &amp;quot;manly&amp;quot; again after being conditioned to be nothing but respectful. I&amp;#39;ll definitely check out this book, thank you for the suggestion&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdmhi5", "score_hidden": false, "stickied": false, "created": 1492471802.0, "created_utc": 1492443002.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dge2gfq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "novaskyd", "parent_id": "t1_dgdlcf3", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Well said, listen to this OP. Also damn\n\n&gt; probably doesn't know what she wants or is too socially programmed to not be able to verbalize it (women have their own social sexual things too)\n\nI wish I knew a way past that too, personally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well said, listen to this OP. Also damn&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;probably doesn&amp;#39;t know what she wants or is too socially programmed to not be able to verbalize it (women have their own social sexual things too)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I wish I knew a way past that too, personally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dge2gfq", "score_hidden": true, "stickied": false, "created": 1492489727.0, "created_utc": 1492460927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlcf3", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "OrangeVette", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "I used to struggle with this a bit too. It's hard being a man because we're programmed to be respectful with women  constantly, and always ask for consent, and focus on giving her an orgasm first, etc. none of that is wrong, but as men we have a lot of social programming to 'correct' or mask our deep animalistic nature. The thing is, it's easy to fall into being 'unmanly' with all of that, and women are innately attracted to masculinity. So, point of the story, you need to connect with your inner alpha male and show your wife that you can monkey fuck her hard, but also be all of those other kind, gentle, loving things too at the same time. Here's a general outline of how I get in that mood: use your body, workout some how that day; remind yourself that you're a man however works for you. Maybe a beer or two to loosen up some inhibition. take charge from the start of the sexual encounter. Make it clear that you're in control. For me, at least, that triggers some deep caveman shit in my brain. I look at her like she's my prey and I'm conquering her. And finally, don't give a fuck about her orgasm or pleasure even. Take what's yours and focus on how good you feel and your sexual experience. The great irony is that, in my experience, this will result in her having a fantastic experience as well. Power moves, hard pounding, grabbing, just a touch of biting from time to time. Grunt, growl, groan. Smack her ass. Pull her hair. Do what comes naturally when you're in that headspace of I'm a god damn cave man and I'm going to take what's mine. Now, the hard part is moderating everything above with not being a piece of shit and crossing any lines. It's a balance, but once in a while you need to fuck your wife hard. Also, after a pretty rough session, make sure to get out of that headspace and reconnect with her on a more caring, comforting level. Cuddle, tell her you love her, ask her if anything that you did was a turn-off or crossed any lines. Make it clear that while you appear to be a reckless silverback she's still in control of what you two do too. I learned a lot of this from the married man sex life book, and he has a lot of thoughts on this very subject. I suggest you check it out.\n\nAlso: some other comments here say to ask her what she wants. I'm no expert, but I would caution against that. She wants to be fucked hard, which means you're in control. If she tells you everything to do, then she's in control and she will know it. Take it slow, introduce new things one at s time, and ask her how she felt about it. Also, an unaroused women probably doesn't know what she wants or is too socially programmed to not be able to verbalize it (women have their own social sexual things too). So, talk about it a a bit maybe, but you need to take the reigns here. Lead her to it, and she will follow.", "edited": 1492441905.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to struggle with this a bit too. It&amp;#39;s hard being a man because we&amp;#39;re programmed to be respectful with women  constantly, and always ask for consent, and focus on giving her an orgasm first, etc. none of that is wrong, but as men we have a lot of social programming to &amp;#39;correct&amp;#39; or mask our deep animalistic nature. The thing is, it&amp;#39;s easy to fall into being &amp;#39;unmanly&amp;#39; with all of that, and women are innately attracted to masculinity. So, point of the story, you need to connect with your inner alpha male and show your wife that you can monkey fuck her hard, but also be all of those other kind, gentle, loving things too at the same time. Here&amp;#39;s a general outline of how I get in that mood: use your body, workout some how that day; remind yourself that you&amp;#39;re a man however works for you. Maybe a beer or two to loosen up some inhibition. take charge from the start of the sexual encounter. Make it clear that you&amp;#39;re in control. For me, at least, that triggers some deep caveman shit in my brain. I look at her like she&amp;#39;s my prey and I&amp;#39;m conquering her. And finally, don&amp;#39;t give a fuck about her orgasm or pleasure even. Take what&amp;#39;s yours and focus on how good you feel and your sexual experience. The great irony is that, in my experience, this will result in her having a fantastic experience as well. Power moves, hard pounding, grabbing, just a touch of biting from time to time. Grunt, growl, groan. Smack her ass. Pull her hair. Do what comes naturally when you&amp;#39;re in that headspace of I&amp;#39;m a god damn cave man and I&amp;#39;m going to take what&amp;#39;s mine. Now, the hard part is moderating everything above with not being a piece of shit and crossing any lines. It&amp;#39;s a balance, but once in a while you need to fuck your wife hard. Also, after a pretty rough session, make sure to get out of that headspace and reconnect with her on a more caring, comforting level. Cuddle, tell her you love her, ask her if anything that you did was a turn-off or crossed any lines. Make it clear that while you appear to be a reckless silverback she&amp;#39;s still in control of what you two do too. I learned a lot of this from the married man sex life book, and he has a lot of thoughts on this very subject. I suggest you check it out.&lt;/p&gt;\n\n&lt;p&gt;Also: some other comments here say to ask her what she wants. I&amp;#39;m no expert, but I would caution against that. She wants to be fucked hard, which means you&amp;#39;re in control. If she tells you everything to do, then she&amp;#39;s in control and she will know it. Take it slow, introduce new things one at s time, and ask her how she felt about it. Also, an unaroused women probably doesn&amp;#39;t know what she wants or is too socially programmed to not be able to verbalize it (women have their own social sexual things too). So, talk about it a a bit maybe, but you need to take the reigns here. Lead her to it, and she will follow.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdlcf3", "score_hidden": false, "stickied": false, "created": 1492470438.0, "created_utc": 1492441638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dgdllr1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "KnightofIllRepute", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Doggystyle with hair pulling (form it into a ponytail and hold it closer to her scalp so you have more of a feeling of controlling her) -- ass slapping, slip a finger in her mouth to let her suck on it...\n\nBut, I think you should basically go with a \"NO BED\" rule when you or she just wants to fuck....the bed sort of promotes cuddling/snuggling, and you and she need to be free of that vibe..\n\nStart by sending her a naughty text when she's at work or when you're at work with something like \"When I get home, you're going to give me the sloppiest fucking blowjob of your life...my dick is going to look like a cum volcano when you're done with it...\"\n\nSet the mood for a hot fuck session, basically....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Doggystyle with hair pulling (form it into a ponytail and hold it closer to her scalp so you have more of a feeling of controlling her) -- ass slapping, slip a finger in her mouth to let her suck on it...&lt;/p&gt;\n\n&lt;p&gt;But, I think you should basically go with a &amp;quot;NO BED&amp;quot; rule when you or she just wants to fuck....the bed sort of promotes cuddling/snuggling, and you and she need to be free of that vibe..&lt;/p&gt;\n\n&lt;p&gt;Start by sending her a naughty text when she&amp;#39;s at work or when you&amp;#39;re at work with something like &amp;quot;When I get home, you&amp;#39;re going to give me the sloppiest fucking blowjob of your life...my dick is going to look like a cum volcano when you&amp;#39;re done with it...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Set the mood for a hot fuck session, basically....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdllr1", "score_hidden": false, "stickied": false, "created": 1492470759.0, "created_utc": 1492441959.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dgdn1ye", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwitallaway021884", "parent_id": "t1_dgdmupb", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "Yeah I did read that and it got me thinking about it again which lead to me thinking about my insecurities in the bedroom and lead to this post. It's strange because I'm not embarrassed by anything out in public, her and I laugh our asses off being loud and ridiculous in public. I feel super comfortable with her too, it's just something inside myself I don't really know how to get past", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I did read that and it got me thinking about it again which lead to me thinking about my insecurities in the bedroom and lead to this post. It&amp;#39;s strange because I&amp;#39;m not embarrassed by anything out in public, her and I laugh our asses off being loud and ridiculous in public. I feel super comfortable with her too, it&amp;#39;s just something inside myself I don&amp;#39;t really know how to get past&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdn1ye", "score_hidden": false, "stickied": false, "created": 1492472460.0, "created_utc": 1492443660.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmupb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Burner2169", "parent_id": "t1_dgdkf3d", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt; I feel awkward making noise in general.\n\nDon't be. We just had a 200+ post thread on how men should moan more.\n\nhttps://www.reddit.com/r/sex/comments/65ku1d/sexual_advice_guys_we_gotta_moan_more/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I feel awkward making noise in general.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Don&amp;#39;t be. We just had a 200+ post thread on how men should moan more.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/sex/comments/65ku1d/sexual_advice_guys_we_gotta_moan_more/\"&gt;https://www.reddit.com/r/sex/comments/65ku1d/sexual_advice_guys_we_gotta_moan_more/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdmupb", "score_hidden": false, "stickied": false, "created": 1492472229.0, "created_utc": 1492443429.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdkf3d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwitallaway021884", "parent_id": "t1_dgdk21t", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "&gt;you should also talk dirty to her\n\nHaha that's an even harder one for me, I feel awkward making noise in general. Thanks for the advice though, I'll maybe try to think of some things to say", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;you should also talk dirty to her&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Haha that&amp;#39;s an even harder one for me, I feel awkward making noise in general. Thanks for the advice though, I&amp;#39;ll maybe try to think of some things to say&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdkf3d", "score_hidden": false, "stickied": false, "created": 1492469276.0, "created_utc": 1492440476.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdk21t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "emilygilliland", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "You should definitely talk to her and see what type of things she would like. But somethings you could start doing is like pulling her hair, choking, biting her but when ever you do stuff like this always have a safe word if it becomes to much for her. But yeah it's super hot when my boyfriend pulls my hair and chokes me. Also if you are being rough you should also talk dirty to her,that would probably turn her on even more! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should definitely talk to her and see what type of things she would like. But somethings you could start doing is like pulling her hair, choking, biting her but when ever you do stuff like this always have a safe word if it becomes to much for her. But yeah it&amp;#39;s super hot when my boyfriend pulls my hair and chokes me. Also if you are being rough you should also talk dirty to her,that would probably turn her on even more! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdk21t", "score_hidden": false, "stickied": false, "created": 1492468810.0, "created_utc": 1492440010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dgdpfv1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "opnbf", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "There is nothing wrong or 'humilating' in rough sex, in fact most women I've been with like it. To do it you need to change how you look at her from time to time...\n\nConsider role playing for example, she can be a stranger you pick up in a bar, or a prostitute, she needs to dress and acts accordingly and you follow through...\n\nAlso another idea try watching some porn together before sex, some dirty fought sex porn, will turn her on and put you in the right mood.\n\nAnd always remember, there's nothing wrong with that, it's just sex and she'll always be your sweetheart outside those time you really fuck her good", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is nothing wrong or &amp;#39;humilating&amp;#39; in rough sex, in fact most women I&amp;#39;ve been with like it. To do it you need to change how you look at her from time to time...&lt;/p&gt;\n\n&lt;p&gt;Consider role playing for example, she can be a stranger you pick up in a bar, or a prostitute, she needs to dress and acts accordingly and you follow through...&lt;/p&gt;\n\n&lt;p&gt;Also another idea try watching some porn together before sex, some dirty fought sex porn, will turn her on and put you in the right mood.&lt;/p&gt;\n\n&lt;p&gt;And always remember, there&amp;#39;s nothing wrong with that, it&amp;#39;s just sex and she&amp;#39;ll always be your sweetheart outside those time you really fuck her good&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdpfv1", "score_hidden": false, "stickied": false, "created": 1492475172.0, "created_utc": 1492446372.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dgdrt83", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lurch1066", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "If you ever do doggy or her on top smack her ass. \n\nJust put 1 hand on her ass, run your hand around it, squeeze it so you can feel where to smack then hit her. Not so hard you leave a hand print work up to that. \n\nJust a little smack and see how she responds \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you ever do doggy or her on top smack her ass. &lt;/p&gt;\n\n&lt;p&gt;Just put 1 hand on her ass, run your hand around it, squeeze it so you can feel where to smack then hit her. Not so hard you leave a hand print work up to that. &lt;/p&gt;\n\n&lt;p&gt;Just a little smack and see how she responds &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdrt83", "score_hidden": false, "stickied": false, "created": 1492477806.0, "created_utc": 1492449006.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh3p", "removal_reason": null, "link_id": "t3_65vsub", "likes": null, "replies": "", "user_reports": [], "id": "dgdsbpl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "klacombe7", "parent_id": "t3_65vsub", "subreddit_name_prefixed": "r/sex", "controversiality": 0, "body": "My fiancé felt the same as you when we first started dating seriously. I (a woman) wanted rough sex and he felt very nervous about it, both about if he would be too rough and hurt me or if I would think he treated me like an object afterwards. Now he loves it just as much as I do! \n\nJust ask your lady what she would like you to do. We talked about it a few times over the course of a week and he would ask questions regarding how hard I wanted to be spanked, etc, to make sure he wouldn't hurt me. \n\nIt also helps while we're/you're doing the nasty that the lady communicates with the guy. She could tell you to spank her harder, move your hands to where she wants them (I move mine to my throat when I want to be choked). Then afterwards (when you're done cuddling and the moment has passed) it's good to talk about what she liked and didn't like again and what else she would like more of in the future. Just know, this is what she wants! Don't be too scared/nervous to try it! :)\n\n\nShe shouldn't be giving your sarcastic answers though, that doesn't help you learn to satisfy her, it just makes it more confusing. \n\nSorry for the long post! Hopes it helps a bit!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My fiancé felt the same as you when we first started dating seriously. I (a woman) wanted rough sex and he felt very nervous about it, both about if he would be too rough and hurt me or if I would think he treated me like an object afterwards. Now he loves it just as much as I do! &lt;/p&gt;\n\n&lt;p&gt;Just ask your lady what she would like you to do. We talked about it a few times over the course of a week and he would ask questions regarding how hard I wanted to be spanked, etc, to make sure he wouldn&amp;#39;t hurt me. &lt;/p&gt;\n\n&lt;p&gt;It also helps while we&amp;#39;re/you&amp;#39;re doing the nasty that the lady communicates with the guy. She could tell you to spank her harder, move your hands to where she wants them (I move mine to my throat when I want to be choked). Then afterwards (when you&amp;#39;re done cuddling and the moment has passed) it&amp;#39;s good to talk about what she liked and didn&amp;#39;t like again and what else she would like more of in the future. Just know, this is what she wants! Don&amp;#39;t be too scared/nervous to try it! :)&lt;/p&gt;\n\n&lt;p&gt;She shouldn&amp;#39;t be giving your sarcastic answers though, that doesn&amp;#39;t help you learn to satisfy her, it just makes it more confusing. &lt;/p&gt;\n\n&lt;p&gt;Sorry for the long post! Hopes it helps a bit!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "sex", "name": "t1_dgdsbpl", "score_hidden": false, "stickied": false, "created": 1492478377.0, "created_utc": 1492449577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]