[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "creepyPMs", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I posted this on another subreddit so I&amp;#39;ll just copy n paste, I&amp;#39;m quite desperate for some help right now sorry if I seem over the top: &lt;/p&gt;\n\n&lt;p&gt;I deleted my old Reddit that I first contacted him on but a week ago I was on an askreddit post about confessions and this dude had a confession about some personal stuff that I won&amp;#39;t mention and I commented on the post saying something like wow same here and from there he pmed me and I thought it was cool for a while because it&amp;#39;s always cool to talk to people on here. &lt;/p&gt;\n\n&lt;p&gt;We ended up taking the conversation to Discord because it&amp;#39;s too much of a hassle to go back n forth messaging on here. We only have been talking for a week but he acts like he knows me inside out and it was creeping me out. I ended up blocking him on Discord and on Reddit and I put my Twitter on private. &lt;/p&gt;\n\n&lt;p&gt;Well I woke up this morning to find &lt;a href=\"http://imgur.com/a/XRv9G\"&gt;this&lt;/a&gt; in my inbox and needless to say it scared me, I made it clear while we were talking that I don&amp;#39;t see him as a romantic interest I honestly just wanted to talk to someone but I guess I&amp;#39;m stupid and I didn&amp;#39;t think maybe not everyone on the internet has a simple mindset like that. &lt;/p&gt;\n\n&lt;p&gt;I blocked him and deleted my reddit after I read those messages. I really tried to help him because he seemed to have some things wrong with him be he insisted that I&amp;#39;m somehow his savior and that I was gonna help him get out of his depression but no matter how hard I tried to just talk him into getting help he refused to. I&amp;#39;m not in the right head space to deal with someone like this so you can imagine at this point I wasn&amp;#39;t happy and he was scaring me. &lt;/p&gt;\n\n&lt;p&gt;He told me like a day or 2 after we first talked that he looked at my reddit comments for 2 hours and it made me uncomfortable, he acted like from those comments he knows me 100% and it scared me. &lt;/p&gt;\n\n&lt;p&gt;He also messaged my Tumblr in which I also deleted today after I saw his messages. I was fed up so I said &lt;a href=\"http://imgur.com/a/VVVYm\"&gt;this before I blocked him and deleted the account&lt;/a&gt; , I don&amp;#39;t know if he&amp;#39;ll get the message if my account is deleted now but I&amp;#39;m hoping he does. &lt;/p&gt;\n\n&lt;p&gt;I am scared because he told me he tracked the address of a guy he didn&amp;#39;t like once and I&amp;#39;m scared he&amp;#39;ll do that to me, I didn&amp;#39;t screen shot those messages though because idk when he told me that a few days ago he didn&amp;#39;t show many signs of liking me so I didn&amp;#39;t think of him as a threat and from the story he told me he seemed like he had a reason to do it but still it made me unsure of him. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s apparently a mod on a subreddit if you go to his account from the username he sent that long love letter from. I&amp;#39;m hoping maybe you guys could help me because I&amp;#39;m scared and maybe he is just a troll but I don&amp;#39;t know that and I&amp;#39;m scared honestly. This opened up my eyes I&amp;#39;m never gonna get this close to someone online again scary people exist in the world and I wish I never started a conversation with him now. &lt;/p&gt;\n\n&lt;p&gt;EDIT: oh actually since i posted this on multiple subreddits i forgot that for this one i blurred out his name in the screenshots , i kinda wish i was allowed to show them so you guys could help me get rid of him but it&amp;#39;s all good i respect the rules. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I posted this on another subreddit so I'll just copy n paste, I'm quite desperate for some help right now sorry if I seem over the top: \n\nI deleted my old Reddit that I first contacted him on but a week ago I was on an askreddit post about confessions and this dude had a confession about some personal stuff that I won't mention and I commented on the post saying something like wow same here and from there he pmed me and I thought it was cool for a while because it's always cool to talk to people on here. \n\nWe ended up taking the conversation to Discord because it's too much of a hassle to go back n forth messaging on here. We only have been talking for a week but he acts like he knows me inside out and it was creeping me out. I ended up blocking him on Discord and on Reddit and I put my Twitter on private. \n\nWell I woke up this morning to find [this](http://imgur.com/a/XRv9G) in my inbox and needless to say it scared me, I made it clear while we were talking that I don't see him as a romantic interest I honestly just wanted to talk to someone but I guess I'm stupid and I didn't think maybe not everyone on the internet has a simple mindset like that. \n\nI blocked him and deleted my reddit after I read those messages. I really tried to help him because he seemed to have some things wrong with him be he insisted that I'm somehow his savior and that I was gonna help him get out of his depression but no matter how hard I tried to just talk him into getting help he refused to. I'm not in the right head space to deal with someone like this so you can imagine at this point I wasn't happy and he was scaring me. \n\nHe told me like a day or 2 after we first talked that he looked at my reddit comments for 2 hours and it made me uncomfortable, he acted like from those comments he knows me 100% and it scared me. \n\nHe also messaged my Tumblr in which I also deleted today after I saw his messages. I was fed up so I said [this before I blocked him and deleted the account](http://imgur.com/a/VVVYm) , I don't know if he'll get the message if my account is deleted now but I'm hoping he does. \n\nI am scared because he told me he tracked the address of a guy he didn't like once and I'm scared he'll do that to me, I didn't screen shot those messages though because idk when he told me that a few days ago he didn't show many signs of liking me so I didn't think of him as a threat and from the story he told me he seemed like he had a reason to do it but still it made me unsure of him. \n\nHe's apparently a mod on a subreddit if you go to his account from the username he sent that long love letter from. I'm hoping maybe you guys could help me because I'm scared and maybe he is just a troll but I don't know that and I'm scared honestly. This opened up my eyes I'm never gonna get this close to someone online again scary people exist in the world and I wish I never started a conversation with him now. \n\nEDIT: oh actually since i posted this on multiple subreddits i forgot that for this one i blurred out his name in the screenshots , i kinda wish i was allowed to show them so you guys could help me get rid of him but it's all good i respect the rules. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "CAW", "id": "65l3wq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 169, "report_reasons": null, "author": "memebigboiii", "saved": false, "mod_reports": [], "name": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "approved_by": null, "over_18": false, "domain": "self.creepyPMs", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2ug83", "edited": 1492295150.0, "link_flair_css_class": "CAW", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/creepyPMs/comments/65l3wq/please_help_im_scared_an_internet_stalker_might/", "num_reports": null, "locked": false, "stickied": false, "created": 1492315370.0, "url": "https://www.reddit.com/r/creepyPMs/comments/65l3wq/please_help_im_scared_an_internet_stalker_might/", "author_flair_text": null, "quarantine": false, "title": "please help i'm scared an internet stalker might become a real life stalker if he finds my address.", "created_utc": 1492286570.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 68, "visited": false, "subreddit_type": "public", "ups": 169}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgb6nv5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgb67pl", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "I don't think he'll find me, I told him what state I'm from once but that's still not enough to narrow down imo. I have a mental plan of what to do if he stalks me but I have no idea how he'd stalk me I've never been stalked. But I'll keep the screenshots for proof and stuff. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think he&amp;#39;ll find me, I told him what state I&amp;#39;m from once but that&amp;#39;s still not enough to narrow down imo. I have a mental plan of what to do if he stalks me but I have no idea how he&amp;#39;d stalk me I&amp;#39;ve never been stalked. But I&amp;#39;ll keep the screenshots for proof and stuff. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb6nv5", "score_hidden": false, "stickied": false, "created": 1492319634.0, "created_utc": 1492290834.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb67pl", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ReasonablySane1476", "parent_id": "t1_dgb5utd", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "He won't, I'm pretty sure he won't. It is a scary experience even if they are a country away you will feel anxious and cautious you may even look at people differently, check your doors and windows. Just go on with your life as normal, he is just riding a wave of false happy brain chemicals once he comes down he will go back to his normal routine, he has enough sense of mind to know he won't reach you.\n\nUnless you live in an area that has freedom of movement or he knows your address for sure, then reasonable alertness won't hurt, think of a mental plan if he does do anything IRL, it might help you feel better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He won&amp;#39;t, I&amp;#39;m pretty sure he won&amp;#39;t. It is a scary experience even if they are a country away you will feel anxious and cautious you may even look at people differently, check your doors and windows. Just go on with your life as normal, he is just riding a wave of false happy brain chemicals once he comes down he will go back to his normal routine, he has enough sense of mind to know he won&amp;#39;t reach you.&lt;/p&gt;\n\n&lt;p&gt;Unless you live in an area that has freedom of movement or he knows your address for sure, then reasonable alertness won&amp;#39;t hurt, think of a mental plan if he does do anything IRL, it might help you feel better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb67pl", "score_hidden": false, "stickied": false, "created": 1492319002.0, "created_utc": 1492290202.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5utd", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgb5rgy", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "yea he told me he has talked to a girl in the past for 5 months and it didn't end well. i feel bad for him. i hope he doesn't stalk me irl ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea he told me he has talked to a girl in the past for 5 months and it didn&amp;#39;t end well. i feel bad for him. i hope he doesn&amp;#39;t stalk me irl &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb5utd", "score_hidden": false, "stickied": false, "created": 1492318500.0, "created_utc": 1492289700.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5rgy", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "ReasonablySane1476", "parent_id": "t1_dgb5g5v", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "He makes you into something you are not because he has warped his reality of you because he felt like somehow you have done something amazing for him, as if you have a connection. You haven't done anything though, please don't feel you have made this happen, he probably has a history of doing this to anyone who is remotely nice or pleasant to him, it is all in his head because he doesn't have the framework to understand what you really mean when you were simply being civil or nice. \n\nHe might be a nice guy (unless you meant he is a \"nice guy\", then yeah afraid so) but for now he simply isn't mature enough to even understand what any kind of interpersonal relationship is. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He makes you into something you are not because he has warped his reality of you because he felt like somehow you have done something amazing for him, as if you have a connection. You haven&amp;#39;t done anything though, please don&amp;#39;t feel you have made this happen, he probably has a history of doing this to anyone who is remotely nice or pleasant to him, it is all in his head because he doesn&amp;#39;t have the framework to understand what you really mean when you were simply being civil or nice. &lt;/p&gt;\n\n&lt;p&gt;He might be a nice guy (unless you meant he is a &amp;quot;nice guy&amp;quot;, then yeah afraid so) but for now he simply isn&amp;#39;t mature enough to even understand what any kind of interpersonal relationship is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb5rgy", "score_hidden": false, "stickied": false, "created": 1492318374.0, "created_utc": 1492289574.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5g5v", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgb588a", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "he also tries to make me into something i'm not. if you read the reddit pm he sent when he said he loves my lol's and ooo's it's because he would say some fucked up things and I wouldn't know how to respond so I'd either say oooo or lololol and he didn't like that he thought I should express myself more but in reality I just was getting more and more uncomfortable speaking to him. \n\nHe might be a nice guy deep down but that doesn't give him the excuse to be like that I hope he gets better one day but all I can do is hope. I hope he just forgets about it and moves on. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;he also tries to make me into something i&amp;#39;m not. if you read the reddit pm he sent when he said he loves my lol&amp;#39;s and ooo&amp;#39;s it&amp;#39;s because he would say some fucked up things and I wouldn&amp;#39;t know how to respond so I&amp;#39;d either say oooo or lololol and he didn&amp;#39;t like that he thought I should express myself more but in reality I just was getting more and more uncomfortable speaking to him. &lt;/p&gt;\n\n&lt;p&gt;He might be a nice guy deep down but that doesn&amp;#39;t give him the excuse to be like that I hope he gets better one day but all I can do is hope. I hope he just forgets about it and moves on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb5g5v", "score_hidden": false, "stickied": false, "created": 1492317947.0, "created_utc": 1492289147.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgb62sj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "ReasonablySane1476", "parent_id": "t1_dgb5vcl", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Yeah definitely, I was explaining how simply being polite would give this guy the wrong signals, not to be polite then block.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah definitely, I was explaining how simply being polite would give this guy the wrong signals, not to be polite then block.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb62sj", "score_hidden": false, "stickied": false, "created": 1492318813.0, "created_utc": 1492290013.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgc0939", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "atloomis", "parent_id": "t1_dgbd159", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "There should be a subreddit for former and recovering people with a history of questionable behavior towards women. Somewhere people who have noticed it in there own actions can ask for advice on how to change what they do, people who are worried they might be acting inappropriately to get an outside opinion, and so on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There should be a subreddit for former and recovering people with a history of questionable behavior towards women. Somewhere people who have noticed it in there own actions can ask for advice on how to change what they do, people who are worried they might be acting inappropriately to get an outside opinion, and so on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgc0939", "score_hidden": false, "stickied": false, "created": 1492376892.0, "created_utc": 1492348092.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbd159", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "whyaretherebeesohgod", "parent_id": "t1_dgb5vcl", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "I did this too, I was 18 and I still cringe at the memory. Never realized how creepy that would seem, but I was so caught up in my own little world I lost sight of the bigger picture and unravelled.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did this too, I was 18 and I still cringe at the memory. Never realized how creepy that would seem, but I was so caught up in my own little world I lost sight of the bigger picture and unravelled.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbd159", "score_hidden": false, "stickied": false, "created": 1492328690.0, "created_utc": 1492299890.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb5vcl", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Alpineodin", "parent_id": "t1_dgb588a", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i'm with you on that.\n\nin the past i was blocked by a girl i had only met 2 times in person, and after she tried to split and blocked me, i wasnt in a good place so i gave her the walls of texts like this dude.\n\ni can also understand why people want to be polite and respond even to let them know you dont want to chat, but a clean block with no interaction is the best strat. the thing i always worry about is after you block someone, if it never tells them you blocked them and they can just keep typing to the wind thinking you are seeing the msgs but not responding, they could just keep typing and typing, taking your silence as acceptance.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;m with you on that.&lt;/p&gt;\n\n&lt;p&gt;in the past i was blocked by a girl i had only met 2 times in person, and after she tried to split and blocked me, i wasnt in a good place so i gave her the walls of texts like this dude.&lt;/p&gt;\n\n&lt;p&gt;i can also understand why people want to be polite and respond even to let them know you dont want to chat, but a clean block with no interaction is the best strat. the thing i always worry about is after you block someone, if it never tells them you blocked them and they can just keep typing to the wind thinking you are seeing the msgs but not responding, they could just keep typing and typing, taking your silence as acceptance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb5vcl", "score_hidden": false, "stickied": false, "created": 1492318521.0, "created_utc": 1492289721.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb588a", "gilded": 0, "archived": false, "score": 63, "report_reasons": null, "author": "ReasonablySane1476", "parent_id": "t1_dgb4pr9", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "As an ex-mentally unstable guy, the best thing you can do for both of you is never, never, never talk to him again. Whatever is going on with him, when you figured I'll be nice to him he has something going on, he has no idea what this means and so suddenly misreads what you say as signals for him to feel these things. I imagine he feels desperately lonely and does probably have an attachment problem/disorder. So stalking behaviour is a possibility, however without contact he should focus elsewhere, especially as you are in a different country.\n\nYou did the right thing by blocking him, you should be fine.\nEDIT: I should add he is immature because of an underlying psychopathology which is the product of or prevents normal socialization and development. He actually has little to no self-awareness of what he thinks he feels.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As an ex-mentally unstable guy, the best thing you can do for both of you is never, never, never talk to him again. Whatever is going on with him, when you figured I&amp;#39;ll be nice to him he has something going on, he has no idea what this means and so suddenly misreads what you say as signals for him to feel these things. I imagine he feels desperately lonely and does probably have an attachment problem/disorder. So stalking behaviour is a possibility, however without contact he should focus elsewhere, especially as you are in a different country.&lt;/p&gt;\n\n&lt;p&gt;You did the right thing by blocking him, you should be fine.\nEDIT: I should add he is immature because of an underlying psychopathology which is the product of or prevents normal socialization and development. He actually has little to no self-awareness of what he thinks he feels.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb588a", "score_hidden": false, "stickied": false, "created": 1492317647.0, "created_utc": 1492288847.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 63}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgbs3u5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbrv15", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i don't follow any of my irl friends on it but i just tried looking at my account when logged out and yea u can't even see who i'm following or who follows me cause i'm protected so yea i might just keep it on protected for a while, i may even learn to get used to it and just keep it on protected forever who knows. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i don&amp;#39;t follow any of my irl friends on it but i just tried looking at my account when logged out and yea u can&amp;#39;t even see who i&amp;#39;m following or who follows me cause i&amp;#39;m protected so yea i might just keep it on protected for a while, i may even learn to get used to it and just keep it on protected forever who knows. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbs3u5", "score_hidden": false, "stickied": false, "created": 1492352977.0, "created_utc": 1492324177.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrv15", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "redxmagnum", "parent_id": "t1_dgbotuf", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Can he see who you follow? And if so, do you follow a lot of your physically close IRL friends?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can he see who you follow? And if so, do you follow a lot of your physically close IRL friends?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbrv15", "score_hidden": false, "stickied": false, "created": 1492352388.0, "created_utc": 1492323588.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbotuf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbol20", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "yea he knows about the twitter, he actually confessed one day that he creeps it waiting for me to come online -cringes- but yea he doesn't have a twitter tho not that i'm sure of but he just kept tabs on it but i have it locked right now only people that follow me can see my tweets and i'm really picky about who i follow so he won't be able to trick me and get me to follow a fake acc made by him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea he knows about the twitter, he actually confessed one day that he creeps it waiting for me to come online -cringes- but yea he doesn&amp;#39;t have a twitter tho not that i&amp;#39;m sure of but he just kept tabs on it but i have it locked right now only people that follow me can see my tweets and i&amp;#39;m really picky about who i follow so he won&amp;#39;t be able to trick me and get me to follow a fake acc made by him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbotuf", "score_hidden": false, "stickied": false, "created": 1492346296.0, "created_utc": 1492317496.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbol20", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "xplosm", "parent_id": "t1_dgbnksy", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "I have half a dozen network certifications and still find it pretty hard and annoying to want to track someone in particular. This moron creeper I bet can't come close at all.\n\nAs for the twitter... That's tricky. Does he know about it? If he does just keep it locked and ideally unused for a month or two just to be safe.\n\nAs others have pointed out if he continues communication just ignore him. He doesn't exist. Not even the read notification if possible. Let him have time, energy and resources to harass someone else. Let him be bored by your lack of acknowledgment of every kind.\n\nStay safe and cheers! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have half a dozen network certifications and still find it pretty hard and annoying to want to track someone in particular. This moron creeper I bet can&amp;#39;t come close at all.&lt;/p&gt;\n\n&lt;p&gt;As for the twitter... That&amp;#39;s tricky. Does he know about it? If he does just keep it locked and ideally unused for a month or two just to be safe.&lt;/p&gt;\n\n&lt;p&gt;As others have pointed out if he continues communication just ignore him. He doesn&amp;#39;t exist. Not even the read notification if possible. Let him have time, energy and resources to harass someone else. Let him be bored by your lack of acknowledgment of every kind.&lt;/p&gt;\n\n&lt;p&gt;Stay safe and cheers! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbol20", "score_hidden": false, "stickied": false, "created": 1492345875.0, "created_utc": 1492317075.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnksy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbnehk", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i don't really wanna delete my twitter tho because it has 11.5k followers but how long do u think i should keep it protected, like how long do u think he'll ponder this. idk i hate going on protected mode on twitter lol. but yea i basically have everything else locked that he might know of. \n\nu made me feel better about the tracking thing, i thought it was really easy to track someone if u try but maybe not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i don&amp;#39;t really wanna delete my twitter tho because it has 11.5k followers but how long do u think i should keep it protected, like how long do u think he&amp;#39;ll ponder this. idk i hate going on protected mode on twitter lol. but yea i basically have everything else locked that he might know of. &lt;/p&gt;\n\n&lt;p&gt;u made me feel better about the tracking thing, i thought it was really easy to track someone if u try but maybe not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbnksy", "score_hidden": false, "stickied": false, "created": 1492344148.0, "created_utc": 1492315348.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnehk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "xplosm", "parent_id": "t1_dgb4pr9", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "He can't get the address of anyone, specially from Reddit or other social media sites and even in the remote case he does, that serves zero purpose in finding someone and even going to the lengths of actually finding you he can't do shit from another country. He is an unstable moron with zero friends and less than zero social awareness to have friends or associates. \n\nThis guy is delusional, he wrote those essays with pretty intense but generic wordings and concepts he must copy and paste to other people online. Nothing in there talks about you as an individual. He has zero real info about you. For him you are a concept to be conquered and acquired. \n\nRest assured you are safe and as long as you block and delete your compromised accounts you can fade from the face of reality for this creeper.\n\nA rule of thumb: if someone is trying to convince you they have your internet/IP address asume they are morons and don't fear to laugh and block.\n\nBest of luck and don't worrt about people spewing Internet jargon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He can&amp;#39;t get the address of anyone, specially from Reddit or other social media sites and even in the remote case he does, that serves zero purpose in finding someone and even going to the lengths of actually finding you he can&amp;#39;t do shit from another country. He is an unstable moron with zero friends and less than zero social awareness to have friends or associates. &lt;/p&gt;\n\n&lt;p&gt;This guy is delusional, he wrote those essays with pretty intense but generic wordings and concepts he must copy and paste to other people online. Nothing in there talks about you as an individual. He has zero real info about you. For him you are a concept to be conquered and acquired. &lt;/p&gt;\n\n&lt;p&gt;Rest assured you are safe and as long as you block and delete your compromised accounts you can fade from the face of reality for this creeper.&lt;/p&gt;\n\n&lt;p&gt;A rule of thumb: if someone is trying to convince you they have your internet/IP address asume they are morons and don&amp;#39;t fear to laugh and block.&lt;/p&gt;\n\n&lt;p&gt;Best of luck and don&amp;#39;t worrt about people spewing Internet jargon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbnehk", "score_hidden": false, "stickied": false, "created": 1492343867.0, "created_utc": 1492315067.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4pr9", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgb4l3v", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "he's from another country but i'm still scared he seems like just a kid but it doesn't matter your age you can still have the ability to track someone down if you really tried which scares me. i added a vpn on my google chrome but idk if that will help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;he&amp;#39;s from another country but i&amp;#39;m still scared he seems like just a kid but it doesn&amp;#39;t matter your age you can still have the ability to track someone down if you really tried which scares me. i added a vpn on my google chrome but idk if that will help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb4pr9", "score_hidden": false, "stickied": false, "created": 1492316958.0, "created_utc": 1492288158.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 52}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb4l3v", "gilded": 0, "archived": false, "score": 111, "report_reasons": null, "author": "TheAutumnLeafeon", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "He is 100% unstable. Don't be afraid to get the police involved. Lock your door and your windows. It's better to be too careful than not enough with guys like these.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is 100% unstable. Don&amp;#39;t be afraid to get the police involved. Lock your door and your windows. It&amp;#39;s better to be too careful than not enough with guys like these.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb4l3v", "score_hidden": false, "stickied": false, "created": 1492316783.0, "created_utc": 1492287983.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 111}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgbbg25", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbbbct", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "oh ahaha yea that's exactly what he would tell me in our discord messages too. i really didn't know how to deal with it because it made me uncomfortable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh ahaha yea that&amp;#39;s exactly what he would tell me in our discord messages too. i really didn&amp;#39;t know how to deal with it because it made me uncomfortable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbbg25", "score_hidden": false, "stickied": false, "created": 1492326428.0, "created_utc": 1492297628.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbbct", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "D_Beats", "parent_id": "t1_dgb97mx", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Ever seen a movie where the guy falls in love with a quirky, carefree,a adventurous girl that pulls him out of whatever rut he's in? That's a simplified definition of a manic pixie dream girl. They don't exist. He thinks you'll be able to solve all of his problems because he puts you on a pedestal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ever seen a movie where the guy falls in love with a quirky, carefree,a adventurous girl that pulls him out of whatever rut he&amp;#39;s in? That&amp;#39;s a simplified definition of a manic pixie dream girl. They don&amp;#39;t exist. He thinks you&amp;#39;ll be able to solve all of his problems because he puts you on a pedestal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbbbct", "score_hidden": false, "stickied": false, "created": 1492326233.0, "created_utc": 1492297433.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb97mx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgb8zk6", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "lol what does that mean ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol what does that mean &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb97mx", "score_hidden": false, "stickied": false, "created": 1492323160.0, "created_utc": 1492294360.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgbmpl5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t1_dgbmpkx", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Your comment has been removed as we don't wish to promote that subreddit in any way and they've been known to brigade posts when they're linked. Please edit your comment accordingly and message the mods [here](http://www.reddit.com/message/compose?to=%2Fr%2FcreepyPMs) to have them reapprove.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/creepyPMs) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your comment has been removed as we don&amp;#39;t wish to promote that subreddit in any way and they&amp;#39;ve been known to brigade posts when they&amp;#39;re linked. Please edit your comment accordingly and message the mods &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2FcreepyPMs\"&gt;here&lt;/a&gt; to have them reapprove.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/creepyPMs\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbmpl5", "score_hidden": false, "stickied": false, "created": 1492342768.0, "created_utc": 1492313968.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbmpkx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dgb8zk6", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "[removed]", "edited": 1492350763.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbmpkx", "score_hidden": false, "stickied": false, "created": 1492342768.0, "created_utc": 1492313968.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb8zk6", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "thefemalegeralt", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Oh my god, he's turned you into his Manic Pixie Dream Girl. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my god, he&amp;#39;s turned you into his Manic Pixie Dream Girl. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb8zk6", "score_hidden": false, "stickied": false, "created": 1492322850.0, "created_utc": 1492294050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgbd5bd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbczd7", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "yea i guess ur right, i guess i shouldn't have messaged a mod he shares a subreddit with about it then. idk how he'll react he might be friends with him too i'm so dumb ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea i guess ur right, i guess i shouldn&amp;#39;t have messaged a mod he shares a subreddit with about it then. idk how he&amp;#39;ll react he might be friends with him too i&amp;#39;m so dumb &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbd5bd", "score_hidden": false, "stickied": false, "created": 1492328849.0, "created_utc": 1492300049.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbczd7", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "DanDanRevolution1347", "parent_id": "t1_dgbb4im", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Its not often a good idea to push these kinds of people. Keep him blocked, and as others have said, he will likely simmer down and move on. Confronting unstable people can make matters worse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its not often a good idea to push these kinds of people. Keep him blocked, and as others have said, he will likely simmer down and move on. Confronting unstable people can make matters worse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbczd7", "score_hidden": false, "stickied": false, "created": 1492328624.0, "created_utc": 1492299824.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbb4im", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbax2f", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i wish i was allowed to show his reddit account on here, i feel like he's just a kid and if enough people told him to stop he'd get scared and stop. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i wish i was allowed to show his reddit account on here, i feel like he&amp;#39;s just a kid and if enough people told him to stop he&amp;#39;d get scared and stop. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbb4im", "score_hidden": false, "stickied": false, "created": 1492325960.0, "created_utc": 1492297160.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbax2f", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "goawaynocomeback", "parent_id": "t1_dgbahl9", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "You aren't dumb. Yes you could have avoided this by never talking to anyone new, but that's no way to live. Just try not to blame yourself! (: ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You aren&amp;#39;t dumb. Yes you could have avoided this by never talking to anyone new, but that&amp;#39;s no way to live. Just try not to blame yourself! (: &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbax2f", "score_hidden": false, "stickied": false, "created": 1492325649.0, "created_utc": 1492296849.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbahl9", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbaamn", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "I feel dumb tho like I could have avoided it if I never talked to him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel dumb tho like I could have avoided it if I never talked to him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbahl9", "score_hidden": false, "stickied": false, "created": 1492325011.0, "created_utc": 1492296211.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbaamn", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "goawaynocomeback", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Do not feel bad about talking to him! This is in no way your fault. People make great friends online all the time and it's this guy who is the problem here. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not feel bad about talking to him! This is in no way your fault. People make great friends online all the time and it&amp;#39;s this guy who is the problem here. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbaamn", "score_hidden": false, "stickied": false, "created": 1492324733.0, "created_utc": 1492295933.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgbqkxf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbqac0", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i know right that's why i was so shook when it happened like i thought this shit only happened in horror films. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i know right that&amp;#39;s why i was so shook when it happened like i thought this shit only happened in horror films. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbqkxf", "score_hidden": false, "stickied": false, "created": 1492349531.0, "created_utc": 1492320731.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbqac0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "curvesofyourlips", "parent_id": "t1_dgbq5qv", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "It was super creepy! I'm sure he will move on soon, especially with no contact. Sometimes I have a hard time comprehending that people like that exist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was super creepy! I&amp;#39;m sure he will move on soon, especially with no contact. Sometimes I have a hard time comprehending that people like that exist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbqac0", "score_hidden": false, "stickied": false, "created": 1492348966.0, "created_utc": 1492320166.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbq5qv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbq05y", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "hopefully i mean we've only been talking for a week after all probably less than a week. then again that long ass love letter was creepy as hell. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hopefully i mean we&amp;#39;ve only been talking for a week after all probably less than a week. then again that long ass love letter was creepy as hell. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbq5qv", "score_hidden": false, "stickied": false, "created": 1492348724.0, "created_utc": 1492319924.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbq05y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "curvesofyourlips", "parent_id": "t1_dgbp51g", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "That's good! Hopefully he has already moved on! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s good! Hopefully he has already moved on! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbq05y", "score_hidden": false, "stickied": false, "created": 1492348427.0, "created_utc": 1492319627.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbp51g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbovi4", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "yea he hasn't found a way to contact me all day and i doubt he will but i'll keep this in mind. i feel the same way about the cops too like i'm not gonna go that far at least not right now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea he hasn&amp;#39;t found a way to contact me all day and i doubt he will but i&amp;#39;ll keep this in mind. i feel the same way about the cops too like i&amp;#39;m not gonna go that far at least not right now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbp51g", "score_hidden": false, "stickied": false, "created": 1492346859.0, "created_utc": 1492318059.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbovi4", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "curvesofyourlips", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "I just read a few books about how to handle stalking. The number one thing you can do is stop any contact with him. A good example in one of the books I read talked about how if someone contacts you 40 times and then you tell them \"don't talk to me.\" They do not see that as negative. What they get from an interaction like that is that it takes 40 messages for you to respond. So, stop all contact. \n\nMake sure all your social medias are private, especially your facebook. Make your facebook unsearchable so he can't even find you on there. He could go through your friends list and contact people to try to get more information about you. It's amazing and frightening how willing people are to help \"long-lost friends\" of their friends and family.\n\nI know you have already deleted your accounts, but if he finds you somewhere else, I would consider leaving that account open and just creating a new one to actually use. This allows him to basically vent his feelings to you and have that outlet, but he will also see that you are strong enough to ignore him. This is what was recommended in the books I read. They said this about phone lines, but I think it transfers well to social media too.\n\nEventually, he will move on to someone else. Ignoring him deprives him of the interaction he craves (whether it is good or bad doesn't matter to people like this). As for calling the police, they can't really do anything unless you are in immediate danger. Many times they can't help with domestic stalking cases, so I think their hands would be tied, especially trying to deal with someone in another country. Remember that this isn't your fault. All stalkers have some form of mental illness. I know it really sucks having your kindness taken advantage of, but you are not wrong to be kind to someone.\n\nIf you are interested, the books that I recently read about this are: The Gift of Fear by Gavin de Becker and Surviving a Stalker by Linden Gross. I think I saw someone mention The Gift of Fear on here and that is why I picked it up to read. It is a great book for anyone to read and talks about trusting your own intuition. I highly recommend it. Surviving a Stalker was good, but didn't provide much more information in the whole book than The Gift of Fear does in a chapter. Plus, Surviving a Stalker was written during the early days of the internet, so some of the information is very dated in it. \n\nI really hope that this helps you!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just read a few books about how to handle stalking. The number one thing you can do is stop any contact with him. A good example in one of the books I read talked about how if someone contacts you 40 times and then you tell them &amp;quot;don&amp;#39;t talk to me.&amp;quot; They do not see that as negative. What they get from an interaction like that is that it takes 40 messages for you to respond. So, stop all contact. &lt;/p&gt;\n\n&lt;p&gt;Make sure all your social medias are private, especially your facebook. Make your facebook unsearchable so he can&amp;#39;t even find you on there. He could go through your friends list and contact people to try to get more information about you. It&amp;#39;s amazing and frightening how willing people are to help &amp;quot;long-lost friends&amp;quot; of their friends and family.&lt;/p&gt;\n\n&lt;p&gt;I know you have already deleted your accounts, but if he finds you somewhere else, I would consider leaving that account open and just creating a new one to actually use. This allows him to basically vent his feelings to you and have that outlet, but he will also see that you are strong enough to ignore him. This is what was recommended in the books I read. They said this about phone lines, but I think it transfers well to social media too.&lt;/p&gt;\n\n&lt;p&gt;Eventually, he will move on to someone else. Ignoring him deprives him of the interaction he craves (whether it is good or bad doesn&amp;#39;t matter to people like this). As for calling the police, they can&amp;#39;t really do anything unless you are in immediate danger. Many times they can&amp;#39;t help with domestic stalking cases, so I think their hands would be tied, especially trying to deal with someone in another country. Remember that this isn&amp;#39;t your fault. All stalkers have some form of mental illness. I know it really sucks having your kindness taken advantage of, but you are not wrong to be kind to someone.&lt;/p&gt;\n\n&lt;p&gt;If you are interested, the books that I recently read about this are: The Gift of Fear by Gavin de Becker and Surviving a Stalker by Linden Gross. I think I saw someone mention The Gift of Fear on here and that is why I picked it up to read. It is a great book for anyone to read and talks about trusting your own intuition. I highly recommend it. Surviving a Stalker was good, but didn&amp;#39;t provide much more information in the whole book than The Gift of Fear does in a chapter. Plus, Surviving a Stalker was written during the early days of the internet, so some of the information is very dated in it. &lt;/p&gt;\n\n&lt;p&gt;I really hope that this helps you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbovi4", "score_hidden": false, "stickied": false, "created": 1492346377.0, "created_utc": 1492317577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgbchl5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbcd9s", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "yea i have him block on everything so he probably won't be able to contact me. the only way i can see him getting a hold of me is if he finds out about this throwaway account. i'm scared he might because i messaged a mod that he shares a subreddit with and idk how he's gonna react, idk if he'll take his side or try to help me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea i have him block on everything so he probably won&amp;#39;t be able to contact me. the only way i can see him getting a hold of me is if he finds out about this throwaway account. i&amp;#39;m scared he might because i messaged a mod that he shares a subreddit with and idk how he&amp;#39;s gonna react, idk if he&amp;#39;ll take his side or try to help me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbchl5", "score_hidden": false, "stickied": false, "created": 1492327934.0, "created_utc": 1492299134.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcd9s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lilyhd", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "The best thing you can do is just completely 100% ignore him. He seems really unstable tbh. if it comes to the point where you are starting to feel unsafe you should involve the police", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The best thing you can do is just completely 100% ignore him. He seems really unstable tbh. if it comes to the point where you are starting to feel unsafe you should involve the police&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbcd9s", "score_hidden": false, "stickied": false, "created": 1492327764.0, "created_utc": 1492298964.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgb5aqb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgb56hf", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i blocked him on discord, my past reddit that i deleted today, on tumblr that i also deleted today and i'm on private on twitter so i don't think he'll be able to contact me but i wish i could tell someone on here what his username is so they could help me scare this guy away but ik the rules forbid it so nvm. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i blocked him on discord, my past reddit that i deleted today, on tumblr that i also deleted today and i&amp;#39;m on private on twitter so i don&amp;#39;t think he&amp;#39;ll be able to contact me but i wish i could tell someone on here what his username is so they could help me scare this guy away but ik the rules forbid it so nvm. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb5aqb", "score_hidden": false, "stickied": false, "created": 1492317738.0, "created_utc": 1492288938.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb56hf", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SlomoVimes", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Hmmm. He seems to love everything about you, including the good and the bad. \nStrange thing being he doesn't know you, and has very creepily read your post history to \"get to know\" you.\nBurn him right now!\n\nAlso file an official complaint with the FBI. Once the feds are involved it ups his chances of getting on to a \"no fly\" list.\nHope that helps OP, and stay strong!", "edited": 1492289021.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmmm. He seems to love everything about you, including the good and the bad. \nStrange thing being he doesn&amp;#39;t know you, and has very creepily read your post history to &amp;quot;get to know&amp;quot; you.\nBurn him right now!&lt;/p&gt;\n\n&lt;p&gt;Also file an official complaint with the FBI. Once the feds are involved it ups his chances of getting on to a &amp;quot;no fly&amp;quot; list.\nHope that helps OP, and stay strong!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb56hf", "score_hidden": false, "stickied": false, "created": 1492317588.0, "created_utc": 1492288788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgb5hf0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cpltim", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Anytime he pops up on one of your social accounts just block/ignore him. Don't reply to anything he says. Don't get someone else to talk to him. If your feeling legit threatened it isn't a crime to contact the police and see if anything can be done or what steps you should take.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anytime he pops up on one of your social accounts just block/ignore him. Don&amp;#39;t reply to anything he says. Don&amp;#39;t get someone else to talk to him. If your feeling legit threatened it isn&amp;#39;t a crime to contact the police and see if anything can be done or what steps you should take.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgb5hf0", "score_hidden": false, "stickied": false, "created": 1492317996.0, "created_utc": 1492289196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgc8daq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgc852y", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "lol i'm actually seeing a movie today so hopefully that cheers me up", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol i&amp;#39;m actually seeing a movie today so hopefully that cheers me up&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgc8daq", "score_hidden": false, "stickied": false, "created": 1492389334.0, "created_utc": 1492360534.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc852y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lana_del_Raygun", "parent_id": "t1_dgc7yvh", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "You're very welcome. Take care of yourself, maybe treat yourself to something nice? You deserve it after all this bullshit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re very welcome. Take care of yourself, maybe treat yourself to something nice? You deserve it after all this bullshit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgc852y", "score_hidden": false, "stickied": false, "created": 1492389029.0, "created_utc": 1492360229.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7yvh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgc7nl4", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "thank you so much", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thank you so much&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgc7yvh", "score_hidden": false, "stickied": false, "created": 1492388803.0, "created_utc": 1492360003.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7nl4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lana_del_Raygun", "parent_id": "t1_dgc74d8", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "You're right. It's fucked up, and not fair. Almost like being punished for trying to do right. But just know sometimes after getting through the roughest stuff is when the best things happen, at least in my experience. I don't know what you're going through so I won't put my foot in my mouth by blanketly stating \"it gets better\", but I truly hope that it does.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. It&amp;#39;s fucked up, and not fair. Almost like being punished for trying to do right. But just know sometimes after getting through the roughest stuff is when the best things happen, at least in my experience. I don&amp;#39;t know what you&amp;#39;re going through so I won&amp;#39;t put my foot in my mouth by blanketly stating &amp;quot;it gets better&amp;quot;, but I truly hope that it does.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgc7nl4", "score_hidden": false, "stickied": false, "created": 1492388381.0, "created_utc": 1492359581.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc74d8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgc6wep", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i'm just so sad that something like this happened to me, my life isn't exactly that good and him pulling this shit on me is just another thing weighing me down. fuck him and fuck any neckbeard like him that thinks it's ok to treat someone like this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;m just so sad that something like this happened to me, my life isn&amp;#39;t exactly that good and him pulling this shit on me is just another thing weighing me down. fuck him and fuck any neckbeard like him that thinks it&amp;#39;s ok to treat someone like this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgc74d8", "score_hidden": false, "stickied": false, "created": 1492387671.0, "created_utc": 1492358871.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6wep", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lana_del_Raygun", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Most people have already said what needs to be said but I wanna chime in with that you shouldn't feel bad for having empathy/compassion, and it's not your fault that this guy is clearly very mentally unwell. I'm truly sorry you're going through this. It's not right, at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most people have already said what needs to be said but I wanna chime in with that you shouldn&amp;#39;t feel bad for having empathy/compassion, and it&amp;#39;s not your fault that this guy is clearly very mentally unwell. I&amp;#39;m truly sorry you&amp;#39;re going through this. It&amp;#39;s not right, at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgc6wep", "score_hidden": false, "stickied": false, "created": 1492387362.0, "created_utc": 1492358562.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgczv5a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgcfomd", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i'm just so scared he'll find this throwaway and continue sending creepy messages. ik i can just block him but it bothers me that he'll probably never change and creepy guys like him will continue to put people like me in these scary situations .", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;m just so scared he&amp;#39;ll find this throwaway and continue sending creepy messages. ik i can just block him but it bothers me that he&amp;#39;ll probably never change and creepy guys like him will continue to put people like me in these scary situations .&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgczv5a", "score_hidden": false, "stickied": false, "created": 1492425970.0, "created_utc": 1492397170.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfomd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "undynelove", "parent_id": "t1_dgcf488", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "I know it's fucked. But in my opinion, it helps me see who's not worth my time. As soon as someone sees me as just an object or as a savior to them I instantly tell them no. If they escalate into a situation where I don't feel safe or just generally creeped out, I tell someone and/or just block the person out of my life. I know it's hard to trust people after situations like this but just know there are and will be kind, genuine people out there who will treat you like a person regardless of your gender.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it&amp;#39;s fucked. But in my opinion, it helps me see who&amp;#39;s not worth my time. As soon as someone sees me as just an object or as a savior to them I instantly tell them no. If they escalate into a situation where I don&amp;#39;t feel safe or just generally creeped out, I tell someone and/or just block the person out of my life. I know it&amp;#39;s hard to trust people after situations like this but just know there are and will be kind, genuine people out there who will treat you like a person regardless of your gender.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgcfomd", "score_hidden": false, "stickied": false, "created": 1492398998.0, "created_utc": 1492370198.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcf488", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgcb1g2", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "the most fucked up part is i learned from this and i'm gonna be as cautious as humanly possible now but it's fucked up because girls go through this stuff all the time whether it be online or irl it's not that hard to respect girls why are people like this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the most fucked up part is i learned from this and i&amp;#39;m gonna be as cautious as humanly possible now but it&amp;#39;s fucked up because girls go through this stuff all the time whether it be online or irl it&amp;#39;s not that hard to respect girls why are people like this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgcf488", "score_hidden": false, "stickied": false, "created": 1492398253.0, "created_utc": 1492369453.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcb1g2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "undynelove", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "I dealt with a stalker for 8 months. My advice? If he messages you on alternate accounts, don't even humor him with a message. Instantly block. I remember sending a text on Facebook to the alternate account my stalker ex was messaging me on. Just a simple \"leave me alone\"\n\n\nI started shaking when they tried to video call me on there. The call takes up the whole screen on your phone and laptop so I was so scared seeing that. I blocked them. They knew my address but didn't try anything with it. My paranoia shot through the roof when I thought I saw someone similar to them even though my stalker lived in another country.\n\n\nSo my other advice is to talk to someone you trust. You need support from someone in real life. And if he does send a message of your address or something go to the cops and your parents.\n\nAnd there can be good people on the internet. I met my current boyfriend online. But this type of experience definitely made me more cautious. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dealt with a stalker for 8 months. My advice? If he messages you on alternate accounts, don&amp;#39;t even humor him with a message. Instantly block. I remember sending a text on Facebook to the alternate account my stalker ex was messaging me on. Just a simple &amp;quot;leave me alone&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I started shaking when they tried to video call me on there. The call takes up the whole screen on your phone and laptop so I was so scared seeing that. I blocked them. They knew my address but didn&amp;#39;t try anything with it. My paranoia shot through the roof when I thought I saw someone similar to them even though my stalker lived in another country.&lt;/p&gt;\n\n&lt;p&gt;So my other advice is to talk to someone you trust. You need support from someone in real life. And if he does send a message of your address or something go to the cops and your parents.&lt;/p&gt;\n\n&lt;p&gt;And there can be good people on the internet. I met my current boyfriend online. But this type of experience definitely made me more cautious. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgcb1g2", "score_hidden": false, "stickied": false, "created": 1492392817.0, "created_utc": 1492364017.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": "", "user_reports": [], "id": "dgcwidq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgcmepu", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "not it's not it's creepy and pathetic. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;not it&amp;#39;s not it&amp;#39;s creepy and pathetic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgcwidq", "score_hidden": false, "stickied": false, "created": 1492421326.0, "created_utc": 1492392526.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmepu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgcmepu", "score_hidden": false, "stickied": false, "created": 1492407750.0, "created_utc": 1492378950.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2ug83", "removal_reason": null, "link_id": "t3_65l3wq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbdvk7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbdovu", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i think if he bothers me enough i'm gonna go to twitter and tell my followers about it, ik that sounds lame but i have a lot followers that would probably defend me. i just hope it wouldn't backfire and make him want to find me more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i think if he bothers me enough i&amp;#39;m gonna go to twitter and tell my followers about it, ik that sounds lame but i have a lot followers that would probably defend me. i just hope it wouldn&amp;#39;t backfire and make him want to find me more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbdvk7", "score_hidden": false, "stickied": false, "created": 1492329832.0, "created_utc": 1492301032.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbdovu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ayevee21", "parent_id": "t1_dgbcu4n", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "If you think he can be harmful to you in any way and he's acting in a way that makes you feel uncomfortable (makes you think that there is a real possibility of escalation) then the police should take it seriously. If not, I'd take the story and the evidence to the media cause they would lap all this up (think lazy police force refuse to aid woman during early signs of cyberstalking, she ends up ...) of course, I'm sure it won't get to that point, the guy will probably just be sad and move on, but hey if it does escalate then those options are open to you. Also you can represent yourself if you're confident ( it's not as hard as you'd think it is if you do your homework) or get a legal aid lawyer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you think he can be harmful to you in any way and he&amp;#39;s acting in a way that makes you feel uncomfortable (makes you think that there is a real possibility of escalation) then the police should take it seriously. If not, I&amp;#39;d take the story and the evidence to the media cause they would lap all this up (think lazy police force refuse to aid woman during early signs of cyberstalking, she ends up ...) of course, I&amp;#39;m sure it won&amp;#39;t get to that point, the guy will probably just be sad and move on, but hey if it does escalate then those options are open to you. Also you can represent yourself if you&amp;#39;re confident ( it&amp;#39;s not as hard as you&amp;#39;d think it is if you do your homework) or get a legal aid lawyer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbdovu", "score_hidden": false, "stickied": false, "created": 1492329589.0, "created_utc": 1492300789.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcu4n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbcqcw", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "i don't have any money to take legal action. i'm not sure even the police would take this seriously. he lives in another country too so idk what the cops would do about that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i don&amp;#39;t have any money to take legal action. i&amp;#39;m not sure even the police would take this seriously. he lives in another country too so idk what the cops would do about that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbcu4n", "score_hidden": false, "stickied": false, "created": 1492328420.0, "created_utc": 1492299620.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbcqcw", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "ayevee21", "parent_id": "t1_dgbc6t8", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Well it's a bit unfair that one guy forces you to delete your accounts and put them on private. You can threaten legal action (and most likely win) but it's better to just let it go, ghost the guy and move on. Just forget about him, he's harmless. If the harassment is continued then you take legal action.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well it&amp;#39;s a bit unfair that one guy forces you to delete your accounts and put them on private. You can threaten legal action (and most likely win) but it&amp;#39;s better to just let it go, ghost the guy and move on. Just forget about him, he&amp;#39;s harmless. If the harassment is continued then you take legal action.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbcqcw", "score_hidden": false, "stickied": false, "created": 1492328271.0, "created_utc": 1492299471.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbc6t8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbc40a", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "yea i have him blocked on everything and i have my twitter on private.  i hope he just drops it if he has at least of shred of sympathy he'd leave me alone but idk. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea i have him blocked on everything and i have my twitter on private.  i hope he just drops it if he has at least of shred of sympathy he&amp;#39;d leave me alone but idk. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbc6t8", "score_hidden": false, "stickied": false, "created": 1492327504.0, "created_utc": 1492298704.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbc40a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ayevee21", "parent_id": "t1_dgbbkyz", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "Hopefully he will forget about you if you cut him off completely, but you don't know with some people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hopefully he will forget about you if you cut him off completely, but you don&amp;#39;t know with some people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbc40a", "score_hidden": false, "stickied": false, "created": 1492327389.0, "created_utc": 1492298589.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbkyz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbbjgq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "oh that's a good idea thank you so much ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh that&amp;#39;s a good idea thank you so much &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbbkyz", "score_hidden": false, "stickied": false, "created": 1492326622.0, "created_utc": 1492297822.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbbjgq", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "ayevee21", "parent_id": "t1_dgbb5x5", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "lol.\nHe's just some mall ninja manchild, you probably don't need to worry.\nBut you know, on the off chance he's actually a freaky stalker that's gonna find his way into your apartment and stand over you while you sleep, watching your eyelids flutter as you dream of memes, I suggest you look up the relevant cyberstalking legislation in your state and get him before he gets you!\nYou know what they say, the law can't be preventative if the crimes already been committed!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol.\nHe&amp;#39;s just some mall ninja manchild, you probably don&amp;#39;t need to worry.\nBut you know, on the off chance he&amp;#39;s actually a freaky stalker that&amp;#39;s gonna find his way into your apartment and stand over you while you sleep, watching your eyelids flutter as you dream of memes, I suggest you look up the relevant cyberstalking legislation in your state and get him before he gets you!\nYou know what they say, the law can&amp;#39;t be preventative if the crimes already been committed!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbbjgq", "score_hidden": false, "stickied": false, "created": 1492326561.0, "created_utc": 1492297761.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbb5x5", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "memebigboiii", "parent_id": "t1_dgbb4ge", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "can you please not joke about something like that ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;can you please not joke about something like that &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbb5x5", "score_hidden": false, "stickied": false, "created": 1492326015.0, "created_utc": 1492297215.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbb4ge", "gilded": 0, "archived": false, "score": -10, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65l3wq", "subreddit_name_prefixed": "r/creepyPMs", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "creepyPMs", "name": "t1_dgbb4ge", "score_hidden": false, "stickied": false, "created": 1492325957.0, "created_utc": 1492297157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -10}}], "after": null, "before": null}}]