[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "OverwatchUniversity", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: Thank you for all of the responses! You guys are an awesome community. :)&lt;/p&gt;\n\n&lt;p&gt;Hello, &lt;a href=\"/r/OverwatchUniversity\"&gt;/r/OverwatchUniversity&lt;/a&gt;. I am currently in the research phase of writing a paper for one of my courses revolving around discourse communities and I have chosen Overwatch as my focus. &lt;/p&gt;\n\n&lt;p&gt;With the permission of the mods, I&amp;#39;d like to ask for some volunteers to answer some questions. No personal information is needed and you do not need to answer all of the questions if you do not wish, but the more the better. &lt;/p&gt;\n\n&lt;p&gt;If you can PM me with your answers to any, or all of these questions, I&amp;#39;d be thankful and would be sure to credit you in the paper itself if you wish. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;What role does communication play in Overwatch?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;What impact does poor communication have on gameplay?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;What are some key things you need to communicate with others, in order to be successful in the game?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Does vocabulary effect gameplay?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;What makes a perfect “Meta” for you? &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Why are some heroes looked down upon, compared to others?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Are there things about Overwatch that you’ve had to explain to an outsider viewing the game? \nCan you give an example if you have one? No worries if not. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Thank you in advance for your help with this, I appreciate it!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Edit: Thank you for all of the responses! You guys are an awesome community. :)\n\nHello, /r/OverwatchUniversity. I am currently in the research phase of writing a paper for one of my courses revolving around discourse communities and I have chosen Overwatch as my focus. \n\n  With the permission of the mods, I'd like to ask for some volunteers to answer some questions. No personal information is needed and you do not need to answer all of the questions if you do not wish, but the more the better. \n\n  If you can PM me with your answers to any, or all of these questions, I'd be thankful and would be sure to credit you in the paper itself if you wish. \n\n1. What role does communication play in Overwatch?\n\t\n2. What impact does poor communication have on gameplay?\n\n3. What are some key things you need to communicate with others, in order to be successful in the game?\n\n4. Does vocabulary effect gameplay?\n\n5. What makes a perfect “Meta” for you? \n\n6. Why are some heroes looked down upon, compared to others?\n\n7. Are there things about Overwatch that you’ve had to explain to an outsider viewing the game? \nCan you give an example if you have one? No worries if not. \n\n\nThank you in advance for your help with this, I appreciate it!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65n7z6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 30, "report_reasons": null, "author": "Overwatch_Discourse", "saved": false, "mod_reports": [], "name": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "approved_by": null, "over_18": false, "domain": "self.OverwatchUniversity", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_3ejpe", "edited": 1492350210.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/OverwatchUniversity/comments/65n7z6/i_am_writing_a_paper_about_overwatch_and_am/", "num_reports": null, "locked": false, "stickied": false, "created": 1492342482.0, "url": "https://www.reddit.com/r/OverwatchUniversity/comments/65n7z6/i_am_writing_a_paper_about_overwatch_and_am/", "author_flair_text": null, "quarantine": false, "title": "I am writing a paper about Overwatch and am looking for volunteers to answer some questions about communication and team comp.", "created_utc": 1492313682.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": "", "user_reports": [], "id": "dgdcrsi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dontplayplay", "parent_id": "t1_dgbonlb", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "No.4 is a good point. Other overwatch jargon is \"purple\" or \"naded\" for ana, \"one-shot\"(which is used in many games anyway tho) \"DM\" (d.va defense matrix), just to name a few.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No.4 is a good point. Other overwatch jargon is &amp;quot;purple&amp;quot; or &amp;quot;naded&amp;quot; for ana, &amp;quot;one-shot&amp;quot;(which is used in many games anyway tho) &amp;quot;DM&amp;quot; (d.va defense matrix), just to name a few.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgdcrsi", "score_hidden": false, "stickied": false, "created": 1492455399.0, "created_utc": 1492426599.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbonlb", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "IPlayForCoins", "parent_id": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "1: Crucial. Overwatch is a team based shooter, characters synergize with others. \n2: Callouts, if an enemy is flanking, it would need to be called out. (You could reflect this to the real world)\n3: Use understanding language, don't be vague\n4: New lingo would breed i.e \"lit\" for enemies that are damaged.\n5: Meta is just how op some characters are. There is no perfect \"meta\" as all games would have some characters better than others\n6: Because some are cheesy or some have a bad player base\\\n7: Team comp, hard to say that somecharacters like hanjo or junkrat arent good", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1: Crucial. Overwatch is a team based shooter, characters synergize with others. \n2: Callouts, if an enemy is flanking, it would need to be called out. (You could reflect this to the real world)\n3: Use understanding language, don&amp;#39;t be vague\n4: New lingo would breed i.e &amp;quot;lit&amp;quot; for enemies that are damaged.\n5: Meta is just how op some characters are. There is no perfect &amp;quot;meta&amp;quot; as all games would have some characters better than others\n6: Because some are cheesy or some have a bad player base\\\n7: Team comp, hard to say that somecharacters like hanjo or junkrat arent good&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbonlb", "score_hidden": false, "stickied": false, "created": 1492345996.0, "created_utc": 1492317196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": "", "user_reports": [], "id": "dgc4475", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Overwatch_Discourse", "parent_id": "t1_dgbvdsb", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Thank you for taking the time to respond. This will help greatly!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for taking the time to respond. This will help greatly!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgc4475", "score_hidden": false, "stickied": false, "created": 1492383477.0, "created_utc": 1492354677.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbvdsb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Voidsentry", "parent_id": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "**What role does communication play in Overwatch?**\n\nIt *can* play a very important role, because it *can* allow a team to focus on one thing.\nUsually, when you play with a bunch of randoms (and especially for the first time) ideas and thoughts are all over the place. One player might be attacking the enemy supports, because he / she feels it's the right thing to do at that particular moment... but he / she fails to realize, that there is a 50 HP Reinhardt behind them, who should die first. If another player calls Reinhardt out as the focus target, he can be targeted and downed much easier... than a 200 HP enemy Lucio, who is wall-riding around.\n\nAt the same time, someone might get picked off by an enemy Pharah. He / she at that point knows the position and the ultimate charge of the enemy Pharah and can provide vital information to the team: \"Pharah on top - she has ult\"... Any good player will immediately know that they might be facing an upcoming barrage from above. \n\n**What impact does poor communication have on gameplay?**\n\nCommunication provides an additional layer of awareness, which can win team fights or save a lot of time (by not dying and having to wait for the respawn and run back to the fight).\n\nAs I said above: If no one calls out a low HP target or the position or the ultimate charge of an enemy hero... the chance to lose team fights or time increases rapidly. \n\n**What are some key things you need to communicate with others, in order to be successful in the game?**\n\nAre we strictly talking Overwatch here? Or multiplayer games in general?\n\nIt's important to note, that people are different. Some might fall victim to tunnel visioning faster than others.\nI've been through a couple of different ranks in Overwatch and what I've noticed in lower ranks is that many players start shooting at tanks, while completely ignoring the supports. And I can even understand them: Tanks are big targets, which you will hit for sure and you will feel like you're doing work... But at the same time you're doing it, because in the heat of the battle there is a lot of information, which needs to be processed... It can be overwhelming.\nAnd these players need to be told who to focus... And the focus targets can vary. Supports are not always the priority. An out of position tank, who already took a lot of damage can eventually be nuked down, if he is focused by few players at once. The enemy supports aren't going to heal through that. \n\nOther players fail to realize how important positioning is... They overextend. They run alone into 5-6 opponents and die.\n\nA scary amount of players fails to realize, that once you kill someone from the enemy team, you've turned the fight into a 6v5. You have the numbers advantage at that point... That's less damage you take, less crowd control you need to deal with or less healing for the enemy team. You need to take advantage of that as soon as possible.\n\nIf you are a skilled player and you know, what's right at any scenario... Then you need to communicate that with others. You need to be a leader and hope that others will follow. \n\n**Does vocabulary effect gameplay?**\n\nDepends on which vocabulary we're talking about. Are we talking about flaming / insulting others? If so, then yeah for sure. \n\nThere is this thing called the \"backfire effect\", which makes it so that when someone is confronted with an idea or thought that goes against their own perception... Their opinion doesn't change, but it actually becomes stronger.\nSo if you have a Hanjo on your team, who is throwing the game... Insulting him and forcefully asking him to swap, will (in many cases) make that player stick with Hanjo until all is lost.\nYou either need to be quiet about that and let the Hanjo realize on his / own, that he / she is doing bad... Or you need to manipulate them into doing the right thing: \"Hanzo, I'm sure you're doing a lot of work, but we could really, really need a hitscan to deal with the enemy Pharah...\" \n\n**What makes a perfect “Meta” for you?**\n\nI'm probably alone with this opinion, but in my opinion something like a \"meta\" doesn't exist. \nMeta is this idea of a figuratively living and breathing, ever shifting change when it comes to the flavour of the month.\n\nFor example the \"tripple tank meta\", which went away a couple of weeks ago. Did it go away, because people figured out a counter to it? Or did it go away, because it got nerfed into the ground and it wasn't as effective as before? It's the latter.\n\nWhat we go through are not metas, but actually just post-nerf-times.\nWas there ever a McCree meta, where people figured out a comp, where McCree worked really well, until that playstyle got countered? Nope, McCree got nerfed and then people stopped playing him.\n\nAs an example: In an actual \"meta environment\" you would have people playing Dive Comp, because it's easy to play and effective and then others would start playing another comp, which totally counters Dive Comp... and that would force Dive Comp players to adapt again... and so on, and so on. But that's not what's happening or will probably ever be happening. What we will see instead is Blizzard nerfing key Dive Comp heroes, ruin that playstyle and in process other playstyles would emerge. But as I said: that has nothing to do with the concept of a meta. \n\n**Why are some heroes looked down upon, compared to others?**\n\nBecause not all heroes are equally good. There is without the shadow of a doubt better all around picks. Not just from the kit of the heroes, but also from their consistency.\nI for example hate Hanjo. It makes me sick to have that hero on my team, no matter how good the player is. Why? Because Hanjo is an incredibly inconsistent hero. If you miss your shots as Hanjo, you aren't doing anything for your team. Now if you played Soldier instead, you would be hitting more shots. You would most likely get more value out of your ultimate. You would depend less on heals and hence your support teammates, would be free to heal other teammates more or be able to focus more on their positioning and survivability.\n\nOn top of the fact, that a hero like Hanjo is straight up less consistent than many others... He takes away one slot on the team. So if I'm a DPS main for example... and I instalock my best hero... which is Soldier or Tracer or whoever... We then get another DPS main with a good pick and then a Hanjo, who won't switch? That player forces me to switch off DPS and pick tank or support, because it's more likely that I will have more impact as a tank / support than as the third DPS or for hells sake even the fourth DPS. \nAnd if that Hanjo continues missing his shots and thriving in his 30% win rate... That adds additional negativity, because he is effectively throwing the game. The chance to win that game lies at 30%, because a chain is only as strong as its weakest link.\n\n**Are there things about Overwatch that you’ve had to explain to an outsider viewing the game? Can you give an example if you have one? No worries if not.**\n\nI love Overwatch. The reason why I love Overwatch is, because it reminds me of the two best eras I had in gaming... It was when I first started playing Counter-Strike and when I first started playing World of Warcraft.\n\nI loved Counter-Strike, because I could clearly see my improvements in aiming, reaction times and map knowledge. And I loved World of Warcraft, because I was blown away by all the new imput. For example when I saw the first flying mount, I was blown away. Or when I saw a Rogue stealth and disappear in front of me my jaw dropped.\nDuring the Overwatch reveal trailer you could see the audience go nuts, when Tracer used recall or Hanzo climbed up a wall.\n\nWhen you view a game like Overwatch and you see Junkrat shooting his grenades or Torbjörn building a turret... It's an entirely different experience than when you play the game yourself and get confronted with the need to get better at the game, learn the maps... and see all the new stuff in the game. And especially when you see how different skill levels affect the same heroes. A hero like Genji has two projectiles and three abilities, but there are dimensions worth of skill difference between a high skilled Genji and a mediocre one.\n\nAnd all of that is just so appealing. \n", "edited": 1492365598.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;What role does communication play in Overwatch?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It &lt;em&gt;can&lt;/em&gt; play a very important role, because it &lt;em&gt;can&lt;/em&gt; allow a team to focus on one thing.\nUsually, when you play with a bunch of randoms (and especially for the first time) ideas and thoughts are all over the place. One player might be attacking the enemy supports, because he / she feels it&amp;#39;s the right thing to do at that particular moment... but he / she fails to realize, that there is a 50 HP Reinhardt behind them, who should die first. If another player calls Reinhardt out as the focus target, he can be targeted and downed much easier... than a 200 HP enemy Lucio, who is wall-riding around.&lt;/p&gt;\n\n&lt;p&gt;At the same time, someone might get picked off by an enemy Pharah. He / she at that point knows the position and the ultimate charge of the enemy Pharah and can provide vital information to the team: &amp;quot;Pharah on top - she has ult&amp;quot;... Any good player will immediately know that they might be facing an upcoming barrage from above. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What impact does poor communication have on gameplay?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Communication provides an additional layer of awareness, which can win team fights or save a lot of time (by not dying and having to wait for the respawn and run back to the fight).&lt;/p&gt;\n\n&lt;p&gt;As I said above: If no one calls out a low HP target or the position or the ultimate charge of an enemy hero... the chance to lose team fights or time increases rapidly. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What are some key things you need to communicate with others, in order to be successful in the game?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Are we strictly talking Overwatch here? Or multiplayer games in general?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important to note, that people are different. Some might fall victim to tunnel visioning faster than others.\nI&amp;#39;ve been through a couple of different ranks in Overwatch and what I&amp;#39;ve noticed in lower ranks is that many players start shooting at tanks, while completely ignoring the supports. And I can even understand them: Tanks are big targets, which you will hit for sure and you will feel like you&amp;#39;re doing work... But at the same time you&amp;#39;re doing it, because in the heat of the battle there is a lot of information, which needs to be processed... It can be overwhelming.\nAnd these players need to be told who to focus... And the focus targets can vary. Supports are not always the priority. An out of position tank, who already took a lot of damage can eventually be nuked down, if he is focused by few players at once. The enemy supports aren&amp;#39;t going to heal through that. &lt;/p&gt;\n\n&lt;p&gt;Other players fail to realize how important positioning is... They overextend. They run alone into 5-6 opponents and die.&lt;/p&gt;\n\n&lt;p&gt;A scary amount of players fails to realize, that once you kill someone from the enemy team, you&amp;#39;ve turned the fight into a 6v5. You have the numbers advantage at that point... That&amp;#39;s less damage you take, less crowd control you need to deal with or less healing for the enemy team. You need to take advantage of that as soon as possible.&lt;/p&gt;\n\n&lt;p&gt;If you are a skilled player and you know, what&amp;#39;s right at any scenario... Then you need to communicate that with others. You need to be a leader and hope that others will follow. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Does vocabulary effect gameplay?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Depends on which vocabulary we&amp;#39;re talking about. Are we talking about flaming / insulting others? If so, then yeah for sure. &lt;/p&gt;\n\n&lt;p&gt;There is this thing called the &amp;quot;backfire effect&amp;quot;, which makes it so that when someone is confronted with an idea or thought that goes against their own perception... Their opinion doesn&amp;#39;t change, but it actually becomes stronger.\nSo if you have a Hanjo on your team, who is throwing the game... Insulting him and forcefully asking him to swap, will (in many cases) make that player stick with Hanjo until all is lost.\nYou either need to be quiet about that and let the Hanjo realize on his / own, that he / she is doing bad... Or you need to manipulate them into doing the right thing: &amp;quot;Hanzo, I&amp;#39;m sure you&amp;#39;re doing a lot of work, but we could really, really need a hitscan to deal with the enemy Pharah...&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What makes a perfect “Meta” for you?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m probably alone with this opinion, but in my opinion something like a &amp;quot;meta&amp;quot; doesn&amp;#39;t exist. \nMeta is this idea of a figuratively living and breathing, ever shifting change when it comes to the flavour of the month.&lt;/p&gt;\n\n&lt;p&gt;For example the &amp;quot;tripple tank meta&amp;quot;, which went away a couple of weeks ago. Did it go away, because people figured out a counter to it? Or did it go away, because it got nerfed into the ground and it wasn&amp;#39;t as effective as before? It&amp;#39;s the latter.&lt;/p&gt;\n\n&lt;p&gt;What we go through are not metas, but actually just post-nerf-times.\nWas there ever a McCree meta, where people figured out a comp, where McCree worked really well, until that playstyle got countered? Nope, McCree got nerfed and then people stopped playing him.&lt;/p&gt;\n\n&lt;p&gt;As an example: In an actual &amp;quot;meta environment&amp;quot; you would have people playing Dive Comp, because it&amp;#39;s easy to play and effective and then others would start playing another comp, which totally counters Dive Comp... and that would force Dive Comp players to adapt again... and so on, and so on. But that&amp;#39;s not what&amp;#39;s happening or will probably ever be happening. What we will see instead is Blizzard nerfing key Dive Comp heroes, ruin that playstyle and in process other playstyles would emerge. But as I said: that has nothing to do with the concept of a meta. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why are some heroes looked down upon, compared to others?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Because not all heroes are equally good. There is without the shadow of a doubt better all around picks. Not just from the kit of the heroes, but also from their consistency.\nI for example hate Hanjo. It makes me sick to have that hero on my team, no matter how good the player is. Why? Because Hanjo is an incredibly inconsistent hero. If you miss your shots as Hanjo, you aren&amp;#39;t doing anything for your team. Now if you played Soldier instead, you would be hitting more shots. You would most likely get more value out of your ultimate. You would depend less on heals and hence your support teammates, would be free to heal other teammates more or be able to focus more on their positioning and survivability.&lt;/p&gt;\n\n&lt;p&gt;On top of the fact, that a hero like Hanjo is straight up less consistent than many others... He takes away one slot on the team. So if I&amp;#39;m a DPS main for example... and I instalock my best hero... which is Soldier or Tracer or whoever... We then get another DPS main with a good pick and then a Hanjo, who won&amp;#39;t switch? That player forces me to switch off DPS and pick tank or support, because it&amp;#39;s more likely that I will have more impact as a tank / support than as the third DPS or for hells sake even the fourth DPS. \nAnd if that Hanjo continues missing his shots and thriving in his 30% win rate... That adds additional negativity, because he is effectively throwing the game. The chance to win that game lies at 30%, because a chain is only as strong as its weakest link.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Are there things about Overwatch that you’ve had to explain to an outsider viewing the game? Can you give an example if you have one? No worries if not.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I love Overwatch. The reason why I love Overwatch is, because it reminds me of the two best eras I had in gaming... It was when I first started playing Counter-Strike and when I first started playing World of Warcraft.&lt;/p&gt;\n\n&lt;p&gt;I loved Counter-Strike, because I could clearly see my improvements in aiming, reaction times and map knowledge. And I loved World of Warcraft, because I was blown away by all the new imput. For example when I saw the first flying mount, I was blown away. Or when I saw a Rogue stealth and disappear in front of me my jaw dropped.\nDuring the Overwatch reveal trailer you could see the audience go nuts, when Tracer used recall or Hanzo climbed up a wall.&lt;/p&gt;\n\n&lt;p&gt;When you view a game like Overwatch and you see Junkrat shooting his grenades or Torbjörn building a turret... It&amp;#39;s an entirely different experience than when you play the game yourself and get confronted with the need to get better at the game, learn the maps... and see all the new stuff in the game. And especially when you see how different skill levels affect the same heroes. A hero like Genji has two projectiles and three abilities, but there are dimensions worth of skill difference between a high skilled Genji and a mediocre one.&lt;/p&gt;\n\n&lt;p&gt;And all of that is just so appealing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbvdsb", "score_hidden": false, "stickied": false, "created": 1492362521.0, "created_utc": 1492333721.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": "", "user_reports": [], "id": "dgbp87t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SixpacShacore", "parent_id": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "right now I'm a flex playerwith about 60 hours of scrim experience with my new team, so I might have something to add.\n\n1. I think that communication should be limited to three things (Engagements, Ultimates, and position) in a team setting there is a target caller and shotcaller but in comp it's difficult to designate roles so communication is often rendered useless.\n\n2. A poor call and a poor engagement kill your fight. Pathing is a big one that ruins teams.\n\n3. Ult combos! Especially in solo Q considering Ultimates are an economy in themselves.\n\n4. Not in solo q. In team play not so much as well because names are for convenience.\n\n5. I don't think there can be one because of the fact that there can only be six characters, however I really like three dps metas because it values the ability of a team to overcome the positioning of the enemy because of he lack of tanks.\n\n6. Because people don't know how to play overwatch at a fundamental level yet. Every character adds value in solo Q but in pro matches and scrims you obviously don't run junkrat because he is so easily countered by a good strategy.\n\n7. Yeah, the importance of ults and how the goal of the dps is to build it as fast as possible to win the fight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;right now I&amp;#39;m a flex playerwith about 60 hours of scrim experience with my new team, so I might have something to add.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I think that communication should be limited to three things (Engagements, Ultimates, and position) in a team setting there is a target caller and shotcaller but in comp it&amp;#39;s difficult to designate roles so communication is often rendered useless.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A poor call and a poor engagement kill your fight. Pathing is a big one that ruins teams.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Ult combos! Especially in solo Q considering Ultimates are an economy in themselves.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Not in solo q. In team play not so much as well because names are for convenience.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I don&amp;#39;t think there can be one because of the fact that there can only be six characters, however I really like three dps metas because it values the ability of a team to overcome the positioning of the enemy because of he lack of tanks.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Because people don&amp;#39;t know how to play overwatch at a fundamental level yet. Every character adds value in solo Q but in pro matches and scrims you obviously don&amp;#39;t run junkrat because he is so easily countered by a good strategy.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Yeah, the importance of ults and how the goal of the dps is to build it as fast as possible to win the fight.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbp87t", "score_hidden": false, "stickied": false, "created": 1492347019.0, "created_utc": 1492318219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": "", "user_reports": [], "id": "dgcd89l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "blacksheep420", "parent_id": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "PS4 player since Season 1, playing primarily support though flexing when necessary. Overwatch is huge and so there will be fringe and contradictory cases from sub-bronze players up to top 500/ professionals, but I think I've gained a pretty good understanding of the game at its core.\n\n1. Communication is one of the bigger factors separating tiers. The lower skilled players tend to use comms less than higher skilled players, and that communication allows for more complex and effective combinations (Zarya's Graviton Surge for example  is practically useless without first choosing someone else with whom to combo, but is easily one of the strongest ults in the game).\n\n2. Poor communication or a lack of communication can pretty often be attributed to lower win rates, and often leaves teams helpless and disorganized. All too often a Genji will pop his Dragonblade to be countered by both Zenyatta's Transcendence and Lúcio's Sound Barrier, leaving the team vulnerable to any other ults for the next couple of team fights.\n\n3. Locations of teammates and enemies, ultimate charge for teammates and enemies, positioning changes, fight initiation or retreat, damaged or disabled enemies and teammates​. Six different fields of view yields an enormous amount of information to be shared with your team.\n\n4. Vocabulary isn't necessarily a huge factor in gameplay, assuming one's teammates speak a common language. \"X hero behind\" \"X low\" are pretty simple but some callouts are not obvious for a newer player \"Zero suit DVa purple on Juice\" though they have the potential to change the course of a match. \n\n5. I don't believe there is or should be any particular team composition that is stronger than any other. Counter picking heroes and ensuring a minimum amount of balance and synergy between teammates. Crazy cheese compositions work all the time at all levels so every hero is viable.\n\n6. Hero prejudice comes from stereotyping, focus on \"meta\" picks and skill floor for the most part. Hanzo and Widowmaker take insane amounts of work to become marginally usefull, let alone mastering those heroes. Junkrat and Symettra have comparatively low skill floors so \"no aim, hold left click to win\" attitudes come around. Everyone wants to run 2-2-2 or triple tank or another standard composition, so when a teammate selects a nonstandard hero, tempers flare up since \"GG we already lost because of attack Torb.\"\n\n7. I don't usually talk about Overwatch outside of my friends and Reddit but my mom told me the first time she tried Overwatch the enemy Hanzo shot a Dragonstrike her way so she ran behind a wall to get cover, promptly dying. \"What the hell I was behind a wall!?\" \"Yeah it passes though walls.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PS4 player since Season 1, playing primarily support though flexing when necessary. Overwatch is huge and so there will be fringe and contradictory cases from sub-bronze players up to top 500/ professionals, but I think I&amp;#39;ve gained a pretty good understanding of the game at its core.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Communication is one of the bigger factors separating tiers. The lower skilled players tend to use comms less than higher skilled players, and that communication allows for more complex and effective combinations (Zarya&amp;#39;s Graviton Surge for example  is practically useless without first choosing someone else with whom to combo, but is easily one of the strongest ults in the game).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Poor communication or a lack of communication can pretty often be attributed to lower win rates, and often leaves teams helpless and disorganized. All too often a Genji will pop his Dragonblade to be countered by both Zenyatta&amp;#39;s Transcendence and Lúcio&amp;#39;s Sound Barrier, leaving the team vulnerable to any other ults for the next couple of team fights.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Locations of teammates and enemies, ultimate charge for teammates and enemies, positioning changes, fight initiation or retreat, damaged or disabled enemies and teammates​. Six different fields of view yields an enormous amount of information to be shared with your team.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Vocabulary isn&amp;#39;t necessarily a huge factor in gameplay, assuming one&amp;#39;s teammates speak a common language. &amp;quot;X hero behind&amp;quot; &amp;quot;X low&amp;quot; are pretty simple but some callouts are not obvious for a newer player &amp;quot;Zero suit DVa purple on Juice&amp;quot; though they have the potential to change the course of a match. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I don&amp;#39;t believe there is or should be any particular team composition that is stronger than any other. Counter picking heroes and ensuring a minimum amount of balance and synergy between teammates. Crazy cheese compositions work all the time at all levels so every hero is viable.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Hero prejudice comes from stereotyping, focus on &amp;quot;meta&amp;quot; picks and skill floor for the most part. Hanzo and Widowmaker take insane amounts of work to become marginally usefull, let alone mastering those heroes. Junkrat and Symettra have comparatively low skill floors so &amp;quot;no aim, hold left click to win&amp;quot; attitudes come around. Everyone wants to run 2-2-2 or triple tank or another standard composition, so when a teammate selects a nonstandard hero, tempers flare up since &amp;quot;GG we already lost because of attack Torb.&amp;quot;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I don&amp;#39;t usually talk about Overwatch outside of my friends and Reddit but my mom told me the first time she tried Overwatch the enemy Hanzo shot a Dragonstrike her way so she ran behind a wall to get cover, promptly dying. &amp;quot;What the hell I was behind a wall!?&amp;quot; &amp;quot;Yeah it passes though walls.&amp;quot;&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgcd89l", "score_hidden": false, "stickied": false, "created": 1492395711.0, "created_utc": 1492366911.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": "", "user_reports": [], "id": "dgbr2s0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Trajiic", "parent_id": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Season 2 500 player that's gotten around to playing Overwatch comp again.\n\n1. Pretty much the number 1 thing. I've never used a mic in game ever, but the games that are the most enjoyable and successful are the ones where people are communicating. (Besides me) If I ever got back into top 500 I'd probably start using mic. (If I got my mic to work)\n\n2. If you are paying attention it isn't the end of the world, but this game requires you to focus on multiple things at a time. This means that some people will have a harder time than others. But with communication, the higher the level, the more important knowing something earlier is and reacting to it.\n\n3. Knowing your surroundings, not getting into tunnel vision, and having a general idea of what resources they have available. You don't even needs these for communication, but it helps a lot if your team isn't doing it instinctively.\n\n4. Not really unless it's really far out there. I will probably have a general idea, even if you spoke in another language, as long as I understood what hero they were talking about and paying attention to where they are. Again, higher level is different.\n\n5. I think a game that doesn't have a definite, single needed hero is a perfect game because a changing meta game makes the game fun to play, and competitive play doesn't feel boring after a season. Adding new heroes also makes things interesting and fun.\n\n6. Because they have such boring abilities and can just solo kill people with no retaliation. I wouldn't mind getting killed by Ana if I felt like the sleep dart was on point along with her shots and nade. But getting killed by a lucky Hanzo arrow is just stupid, and annoying at all skill levels.\n\n7. I don't like explaining things to others since I never have my thought straight except when writing them down, but a lot of people misunderstand the meta game a lot just because they played Overwatch casually a few times.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Season 2 500 player that&amp;#39;s gotten around to playing Overwatch comp again.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Pretty much the number 1 thing. I&amp;#39;ve never used a mic in game ever, but the games that are the most enjoyable and successful are the ones where people are communicating. (Besides me) If I ever got back into top 500 I&amp;#39;d probably start using mic. (If I got my mic to work)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If you are paying attention it isn&amp;#39;t the end of the world, but this game requires you to focus on multiple things at a time. This means that some people will have a harder time than others. But with communication, the higher the level, the more important knowing something earlier is and reacting to it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Knowing your surroundings, not getting into tunnel vision, and having a general idea of what resources they have available. You don&amp;#39;t even needs these for communication, but it helps a lot if your team isn&amp;#39;t doing it instinctively.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Not really unless it&amp;#39;s really far out there. I will probably have a general idea, even if you spoke in another language, as long as I understood what hero they were talking about and paying attention to where they are. Again, higher level is different.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I think a game that doesn&amp;#39;t have a definite, single needed hero is a perfect game because a changing meta game makes the game fun to play, and competitive play doesn&amp;#39;t feel boring after a season. Adding new heroes also makes things interesting and fun.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Because they have such boring abilities and can just solo kill people with no retaliation. I wouldn&amp;#39;t mind getting killed by Ana if I felt like the sleep dart was on point along with her shots and nade. But getting killed by a lucky Hanzo arrow is just stupid, and annoying at all skill levels.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I don&amp;#39;t like explaining things to others since I never have my thought straight except when writing them down, but a lot of people misunderstand the meta game a lot just because they played Overwatch casually a few times.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbr2s0", "score_hidden": false, "stickied": false, "created": 1492350592.0, "created_utc": 1492321792.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": "", "user_reports": [], "id": "dgbulsn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Atomic-Duck", "parent_id": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "**1:** Its pivatol, alot of the time you can't get a full picture of the battlefield; this is where team callouts come into play. Also, shotcalling and moving as a team, more often than not beats individualistic play. It is often far better to conduct a 'poor play' together, than doing several 'correct plays' on their own.\n\n**2:** To a certain extent i'd argue poor communication, is less detrimental than one would assume; given enough experience a player can 'read' the game sufficiently to understand what is going to happen, prior to it passing.\n\nI don't consider toxic behavior, or verbal abuse a form of communication, as it serves no purpose in relation to gameplay - it is merely there to just offend people.\n\n**3:** Ultimate status, weak enemies, and the general state of the game - this includes enemy positions and your own. Also your own intentions, i.e 'I'm going to flank' or 'I'm going to use my ultimate, who will combo?'.\n\n**4:** Yes it does. Since OW is a rather young game, it does not benefit from preestablished callouts like in Counter-Strike. What you consider ''Balcony'' or ''Catwalk'' might not resonate with your teammates.\n\nFor a hero like Ana, calling someone as ''Purple'' usually means they have been bionaded, and are therefore ripe for attack - of course, if you never heard this callout, then you would gain no value of it. Other examples exist of this, and names and location vary from group to group.\n\n**5:** A perfect meta for me, is when there is an established core lineup, which can be branched out from. The ability to swap heroes within the core lineup to play to the individual strengths of the team/players involved, is to me the 'perfect' meta.\n\n**6:** Because of reliability issues, and the overall mentality of competitive games (all kinds). People like to win, and people certainly don't like to be held back by others. Certain heroes are hard to get value out of, and require immense time investments to pull off successfully. \n\nHeroes like Hanzo, Bastion, Widowmaker, Symmetra or Genji, are at best, mechanically challenging, and at worst, situational to the point of irrelevance. Couple this with the regular use of these heroes to 'throw matches', peoples perception of these particular heroes are quite negative. When people see a Hanzo lock-in, they dont think ''Nice, this guy is a good Hanzo; we can work with this'' but instead think something along the lines of ''Oh boy, here we go, another wannabe weaboo''. \n\nOf course, it doesn't help that from a pure gameplay/meta viewpoint, certain heroes are just better, because they fill identical roles, and are easier to get value out off (read Soldier:76). Also a large part of these 'looked down upon' heroes, are so easily countered it's hilarious.\n\n**7:** I'm sure there has been, but i'm afraid i can't recollect any - sorry bud.\n\nGimme all dat research paper credit boi, i love me some science contribution.\n", "edited": 1492331542.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;1:&lt;/strong&gt; Its pivatol, alot of the time you can&amp;#39;t get a full picture of the battlefield; this is where team callouts come into play. Also, shotcalling and moving as a team, more often than not beats individualistic play. It is often far better to conduct a &amp;#39;poor play&amp;#39; together, than doing several &amp;#39;correct plays&amp;#39; on their own.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2:&lt;/strong&gt; To a certain extent i&amp;#39;d argue poor communication, is less detrimental than one would assume; given enough experience a player can &amp;#39;read&amp;#39; the game sufficiently to understand what is going to happen, prior to it passing.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t consider toxic behavior, or verbal abuse a form of communication, as it serves no purpose in relation to gameplay - it is merely there to just offend people.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3:&lt;/strong&gt; Ultimate status, weak enemies, and the general state of the game - this includes enemy positions and your own. Also your own intentions, i.e &amp;#39;I&amp;#39;m going to flank&amp;#39; or &amp;#39;I&amp;#39;m going to use my ultimate, who will combo?&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4:&lt;/strong&gt; Yes it does. Since OW is a rather young game, it does not benefit from preestablished callouts like in Counter-Strike. What you consider &amp;#39;&amp;#39;Balcony&amp;#39;&amp;#39; or &amp;#39;&amp;#39;Catwalk&amp;#39;&amp;#39; might not resonate with your teammates.&lt;/p&gt;\n\n&lt;p&gt;For a hero like Ana, calling someone as &amp;#39;&amp;#39;Purple&amp;#39;&amp;#39; usually means they have been bionaded, and are therefore ripe for attack - of course, if you never heard this callout, then you would gain no value of it. Other examples exist of this, and names and location vary from group to group.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;5:&lt;/strong&gt; A perfect meta for me, is when there is an established core lineup, which can be branched out from. The ability to swap heroes within the core lineup to play to the individual strengths of the team/players involved, is to me the &amp;#39;perfect&amp;#39; meta.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;6:&lt;/strong&gt; Because of reliability issues, and the overall mentality of competitive games (all kinds). People like to win, and people certainly don&amp;#39;t like to be held back by others. Certain heroes are hard to get value out of, and require immense time investments to pull off successfully. &lt;/p&gt;\n\n&lt;p&gt;Heroes like Hanzo, Bastion, Widowmaker, Symmetra or Genji, are at best, mechanically challenging, and at worst, situational to the point of irrelevance. Couple this with the regular use of these heroes to &amp;#39;throw matches&amp;#39;, peoples perception of these particular heroes are quite negative. When people see a Hanzo lock-in, they dont think &amp;#39;&amp;#39;Nice, this guy is a good Hanzo; we can work with this&amp;#39;&amp;#39; but instead think something along the lines of &amp;#39;&amp;#39;Oh boy, here we go, another wannabe weaboo&amp;#39;&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;Of course, it doesn&amp;#39;t help that from a pure gameplay/meta viewpoint, certain heroes are just better, because they fill identical roles, and are easier to get value out off (read Soldier:76). Also a large part of these &amp;#39;looked down upon&amp;#39; heroes, are so easily countered it&amp;#39;s hilarious.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;7:&lt;/strong&gt; I&amp;#39;m sure there has been, but i&amp;#39;m afraid i can&amp;#39;t recollect any - sorry bud.&lt;/p&gt;\n\n&lt;p&gt;Gimme all dat research paper credit boi, i love me some science contribution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbulsn", "score_hidden": false, "stickied": false, "created": 1492359942.0, "created_utc": 1492331142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": "", "user_reports": [], "id": "dgc3tjm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Overwatch_Discourse", "parent_id": "t1_dgbyzyb", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Thank you for taking the time to respond!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for taking the time to respond!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgc3tjm", "score_hidden": false, "stickied": false, "created": 1492383032.0, "created_utc": 1492354232.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbyzyb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "amonak", "parent_id": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "I'm a diamond console player, so my answers may differ a bit from others, probably not too much though.\n\n**What role does communication play in Overwatch?**\n\nIt's undeniable that communication makes the game feel better overall. Often in Competitive on PS4 there's not much communication, but even one person saying something and everyone using the Quick Chat options can help.\n\n**What impact does poor communication have on gameplay?**\n\nA lack of/poor communication basically leaves a match up to how well your team's characters sync with one another and the players' skill. From my experience it isn't really a make or break thing; think of it as someone not getting the pickles they wanted on their burger. However I imagine at higher ranks it becomes a lot more detrimental.\n\n**What are some key things you need to communicate with others, in order to be successful in the game?**\n\nKnowing when certain characters have ult can really help to build combos. When playing a Tank I like to know when my Healers are in danger or caught out of position so I can help. If I'm playing with Zarya as Reinhardt I like to know when she has her bubble off cooldown so I can try to get something started.\n\n**Does vocabulary effect gameplay?**\n\nKind of hard to say for me personally, but I think most people understand my callouts. I think using terms that are at least close or heavily relate to the actual name of things should be fine.\n\n**What makes a perfect “Meta” for you?**\n\nPersonally I like 2/2/2. I really can't give a solid reason as to why; it just feels like everyone has a chance to shine and prove their mettle.\n\n**Why are some heroes looked down upon, compared to others?**\n\nHigh skill floors and ceilings, skills that feel \"cheap\" (take away from the fun of the game), adherence to the \"meta\" or what the pros are using.\n\nYou'll come back into play one day, Torbjorn. :(\n\n**Are there things about Overwatch that you’ve had to explain to an outsider viewing the game? Can you give an example if you have one? No worries if not.**\n\nBesides for why I suck at the game? How heavily the game depends on teamwork. A good amount of my friends that picked up the game came from CoD which is more individual focus at the average level. One in particular would fume whenever he died but continued to rush in recklessly figuring Tracer didn't need anyone's assistance to get kills. I tried to explain that having the rest of the team draw most of the attention before you do Tracer stuff helps, but he just kinda gave up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a diamond console player, so my answers may differ a bit from others, probably not too much though.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What role does communication play in Overwatch?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s undeniable that communication makes the game feel better overall. Often in Competitive on PS4 there&amp;#39;s not much communication, but even one person saying something and everyone using the Quick Chat options can help.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What impact does poor communication have on gameplay?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A lack of/poor communication basically leaves a match up to how well your team&amp;#39;s characters sync with one another and the players&amp;#39; skill. From my experience it isn&amp;#39;t really a make or break thing; think of it as someone not getting the pickles they wanted on their burger. However I imagine at higher ranks it becomes a lot more detrimental.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What are some key things you need to communicate with others, in order to be successful in the game?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Knowing when certain characters have ult can really help to build combos. When playing a Tank I like to know when my Healers are in danger or caught out of position so I can help. If I&amp;#39;m playing with Zarya as Reinhardt I like to know when she has her bubble off cooldown so I can try to get something started.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Does vocabulary effect gameplay?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Kind of hard to say for me personally, but I think most people understand my callouts. I think using terms that are at least close or heavily relate to the actual name of things should be fine.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What makes a perfect “Meta” for you?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Personally I like 2/2/2. I really can&amp;#39;t give a solid reason as to why; it just feels like everyone has a chance to shine and prove their mettle.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why are some heroes looked down upon, compared to others?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;High skill floors and ceilings, skills that feel &amp;quot;cheap&amp;quot; (take away from the fun of the game), adherence to the &amp;quot;meta&amp;quot; or what the pros are using.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll come back into play one day, Torbjorn. :(&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Are there things about Overwatch that you’ve had to explain to an outsider viewing the game? Can you give an example if you have one? No worries if not.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Besides for why I suck at the game? How heavily the game depends on teamwork. A good amount of my friends that picked up the game came from CoD which is more individual focus at the average level. One in particular would fume whenever he died but continued to rush in recklessly figuring Tracer didn&amp;#39;t need anyone&amp;#39;s assistance to get kills. I tried to explain that having the rest of the team draw most of the attention before you do Tracer stuff helps, but he just kinda gave up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbyzyb", "score_hidden": false, "stickied": false, "created": 1492374028.0, "created_utc": 1492345228.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65n7z6", "likes": null, "replies": "", "user_reports": [], "id": "dgc4wx2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flats3", "parent_id": "t3_65n7z6", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "1. It's important if it's constructive. I usually listen and only pipe up if something needs to be addressed. The game doesn't require talking to be fun or victory, but polite constructive chatter ideal!\n\n2. If someone is trying to be a shot caller or lead, and is either wrong or being toxic, it can be annoying. Infighting on the voice chat is the worst and makes me not want to play with those people. \n\n3. Try to finagle a good team composition, enemy positions, ultimate statuses, potential combinations of abilities, and engage and disengage. \n\n4. Non violent, non threatening, minimal swearing sentences will get the best results. If someone is on sombra, and they are flamed, it won't end well. Politeness is rewarded. \n\n5. Right now, almost every hero is viable, and I think the game is in an extremely healthy place. \n\n6. I believe that with more game sense, more hours played, and better understanding of the game shapes an individuals perception of what works. Eventually players run into everything, and will see first hand what works and what doesn't.  \n\n7. Why pro players committed suicide and why players swapped heroes, despite doing well. Those are always head scratching to an outsider and understandably so. Allowing a regroup without giving the enemy team any ultimate charge is a great play. And sometimes heroes aren't what you need, it's like rock, paper, scissors, rockets, swords, hammers, guns, and lasers. \n\nOW is difficult to follow with no prior experience in the game, but explaining that all heroes are available at all times to all players helps.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;It&amp;#39;s important if it&amp;#39;s constructive. I usually listen and only pipe up if something needs to be addressed. The game doesn&amp;#39;t require talking to be fun or victory, but polite constructive chatter ideal!&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If someone is trying to be a shot caller or lead, and is either wrong or being toxic, it can be annoying. Infighting on the voice chat is the worst and makes me not want to play with those people. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Try to finagle a good team composition, enemy positions, ultimate statuses, potential combinations of abilities, and engage and disengage. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Non violent, non threatening, minimal swearing sentences will get the best results. If someone is on sombra, and they are flamed, it won&amp;#39;t end well. Politeness is rewarded. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Right now, almost every hero is viable, and I think the game is in an extremely healthy place. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I believe that with more game sense, more hours played, and better understanding of the game shapes an individuals perception of what works. Eventually players run into everything, and will see first hand what works and what doesn&amp;#39;t.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Why pro players committed suicide and why players swapped heroes, despite doing well. Those are always head scratching to an outsider and understandably so. Allowing a regroup without giving the enemy team any ultimate charge is a great play. And sometimes heroes aren&amp;#39;t what you need, it&amp;#39;s like rock, paper, scissors, rockets, swords, hammers, guns, and lasers. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;OW is difficult to follow with no prior experience in the game, but explaining that all heroes are available at all times to all players helps.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgc4wx2", "score_hidden": false, "stickied": false, "created": 1492384642.0, "created_utc": 1492355842.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]