[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "OverwatchUniversity", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This post belongs to a series of articles on figuring out the design philosophies of Overwatch. The previous ones were:&lt;br/&gt;\n&lt;a href=\"https://www.reddit.com/r/OverwatchUniversity/comments/62ppy3/a_theory_of_hero_classes_and_the_role_of_doomfist/\"&gt;A Theory of Hero Classes, and the Role of Doomfist&lt;/a&gt; &amp;lt;- read this first to get familiar with my class terminology&lt;br/&gt;\n&lt;a href=\"https://www.reddit.com/r/OverwatchUniversity/comments/63bq18/understanding_true_dps_one_clip_one_kill/\"&gt;Understanding True DPS: One Clip - One Kill&lt;/a&gt;&lt;br/&gt;\n&lt;a href=\"https://www.reddit.com/r/OverwatchUniversity/comments/63wkkn/interlude_understanding_weapons_in_overwatch/\"&gt;Interlude: Understanding Weapons in Overwatch&lt;/a&gt; &amp;lt;- you might not have seen this one yet!&lt;br/&gt;\n&lt;a href=\"https://www.reddit.com/r/OverwatchUniversity/comments/645br3/understanding_true_tanks_and_healers_the_balance/\"&gt;Understanding True Tanks and Healers: the Balance of Damage&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;In the articles dedicated to the classes that represent the vertices of the &amp;quot;tank-DD-healer&amp;quot; triangle we&amp;#39;ve seen that these classes obey mutually dependent rules of how much damage they can deal, restore and take: a healer neutralizes exactly one DPS, a tank&amp;#39;s health and timings are measured with timings and damage of the DPS in mind etc. Now we&amp;#39;re going to see heroes that break that perfect balance and give you an edge in one regard while leaving you vulnerable in another.&lt;/p&gt;\n\n&lt;p&gt;Since these heroes often have quite unique features, it is sometimes hard to find the right place for them in a team composition. I believe figuring it out is the best way to understand such characters. Note that this is different from the approach I&amp;#39;ve taken in &lt;a href=\"https://www.reddit.com/r/OverwatchUniversity/comments/62ppy3/a_theory_of_hero_classes_and_the_role_of_doomfist/\"&gt;my first article&lt;/a&gt;: this one is much more practical and emphasizes the balance of basic abilities over design patterns (not to say that such balance isn&amp;#39;t a design intent though).&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;h1&gt;A Theory of Team Compositions: Understanding Specialized Classes&lt;/h1&gt;\n\n&lt;p&gt;The &amp;quot;golden standard&amp;quot; for team compositions is 2-2-2, which basically requires to have double the representatives of each fundamental role in the &amp;quot;tank-DD-healer&amp;quot; triangle. These roles have a certain hierarchy though, that resembles of the poem &amp;quot;This Is the House That Jack Built&amp;quot;:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;These are the damage dealers that kill the enemy team and win you the game.&lt;/p&gt;\n\n&lt;p&gt;These are the tanks that distract the opponents from the damage dealers&lt;br/&gt;\nThat kill the enemy team and win you the game.&lt;/p&gt;\n\n&lt;p&gt;These are the healers that keep alive the tanks&lt;br/&gt;\nThat distract the opponents from the damage dealers&lt;br/&gt;\nThat kill the enemy team and win you the game.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Now when filling the slots in the 2-2-2 framework one should ask himself: are these two &amp;quot;DPS&amp;quot; heroes capable of efficiently killing the enemy team? Are these two &amp;quot;tanks&amp;quot; capable of creating enough room for the &amp;quot;DPS&amp;quot; to do so? And are those &amp;quot;supports&amp;quot; capable of keeping the team alive? When dealing with a specialized, unique hero, we should always consider these questions and see, which one the hero answers the best.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s take &lt;strong&gt;Sombra&lt;/strong&gt; as an example, a hero people still struggle to find a place in the game for. Is she somebody who kills the enemy team? No, her skills don&amp;#39;t allow the positioning her gun requires to be a reliable source of damage. This means it&amp;#39;s suboptimal to pick her into one of the DPS slots. Does she create space for the DPS? Well, she does facilitate their job by disabling enemies&amp;#39; skills and barriers, but she can&amp;#39;t draw any fire towards herself. Picking her into a tank slot will let the other team kill your DPS faster than they kill the enemies. Can she sustain her team? Actually - yes. This does require a change in your team&amp;#39;s behavior since people will have to dwell around health packs more often, but once hacked, they are perfectly capable of restoring health to even tanks in a meaningful way.&lt;/p&gt;\n\n&lt;p&gt;During the recent OGN APEX Challengers Season 3 Super Week we&amp;#39;ve &lt;a href=\"https://youtu.be/_UjZZwzmYD4?t=8m54s\"&gt;seen&lt;/a&gt; probably the first convincing use of Sombra in the pro scene by Conbox Spirit, and &lt;a href=\"https://youtu.be/DWDPAjGoN-s?t=34m11s\"&gt;she was run&lt;/a&gt; as the &lt;a href=\"https://youtu.be/_UjZZwzmYD4?t=42m25s\"&gt;second support&lt;/a&gt; along with Lucio on certain maps, &lt;a href=\"https://youtu.be/DWDPAjGoN-s?t=55m43s\"&gt;mostly on CP defense&lt;/a&gt;. People healing from her packs between fights charged her ultimate for basically every teamfight, so that the attacking team had to contest the point without skills and barriers.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s consider another difficult to categorize hero - &lt;strong&gt;Mei&lt;/strong&gt;. Many call her a tank, but pro teams run her (to my knowledge) exclusively in the DPS slot. Well, maybe they are wrong? Let&amp;#39;s see. She doesn&amp;#39;t restore health or sustain teammates in any way, so she doesn&amp;#39;t fit the support slot. Even though she has good contesting potential, it&amp;#39;s thanks to her ability to stay on the point, but out of the fight. This doesn&amp;#39;t create space for the DPS, so no, Mei is not a tank. Now, can she kill the enemy team? In a weird way - yes. Despite having sub-par damage output, Mei is one of the heroes one can rely on to do the eliminations, but she accomplishes that job well only under the circumstances that her wall successfully splits the enemies or they are out of position themselves.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Now to our last case - &lt;strong&gt;Roadhog&lt;/strong&gt;. This one&amp;#39;s a bit tricky. He certainly isn&amp;#39;t a support, but is he a tank or a DPS? He does draw attention to himself, and while shooting at his fat body is everybody&amp;#39;s favorite way to charge ults, this actually gives breathing room to his DPS. On top of that his hook can quickly eliminate somebody who is a threat to them (a flanker for example). But that same hook mechanic can be thought of as a way to kill the enemy team. Roadhog is certainly not a True DPS, in the sense that he can&amp;#39;t reliably kill all the necessary enemies, but he is a specialized DPS indeed.&lt;/p&gt;\n\n&lt;p&gt;This dual nature of Roadhog was one of the reasons 3-tank meta was (and still is) possible. As soon as the game got a strong enough healer who could counter the damage done to multiple tanks, there was little reason not to pick a tank who could do the DPS job into one of the DPS slots.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;h4&gt;True vs Specialists&lt;/h4&gt;\n\n&lt;p&gt;Now how much should you rely on those specialized heroes? I believe a good rule of thumb is to have &lt;em&gt;at least&lt;/em&gt; one hero of each True class, while the remaining three slots can be filled with both True and specialized heroes. There might be exceptions to this rule (as in the example with Sombra &amp;amp; Lucio support choice), but these are likely to be viable mostly due to the individual balance of the heroes (Lucio is still considered a mustpick in organized play thanks to his speed, regardless of how much healing you need).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This post belongs to a series of articles on figuring out the design philosophies of Overwatch. The previous ones were:  \n[A Theory of Hero Classes, and the Role of Doomfist](https://www.reddit.com/r/OverwatchUniversity/comments/62ppy3/a_theory_of_hero_classes_and_the_role_of_doomfist/) &lt;- read this first to get familiar with my class terminology  \n[Understanding True DPS: One Clip - One Kill](https://www.reddit.com/r/OverwatchUniversity/comments/63bq18/understanding_true_dps_one_clip_one_kill/)  \n[Interlude: Understanding Weapons in Overwatch](https://www.reddit.com/r/OverwatchUniversity/comments/63wkkn/interlude_understanding_weapons_in_overwatch/) &lt;- you might not have seen this one yet!  \n[Understanding True Tanks and Healers: the Balance of Damage](https://www.reddit.com/r/OverwatchUniversity/comments/645br3/understanding_true_tanks_and_healers_the_balance/)\n\n&amp;nbsp;\n\nIn the articles dedicated to the classes that represent the vertices of the \"tank-DD-healer\" triangle we've seen that these classes obey mutually dependent rules of how much damage they can deal, restore and take: a healer neutralizes exactly one DPS, a tank's health and timings are measured with timings and damage of the DPS in mind etc. Now we're going to see heroes that break that perfect balance and give you an edge in one regard while leaving you vulnerable in another.\n\nSince these heroes often have quite unique features, it is sometimes hard to find the right place for them in a team composition. I believe figuring it out is the best way to understand such characters. Note that this is different from the approach I've taken in [my first article](https://www.reddit.com/r/OverwatchUniversity/comments/62ppy3/a_theory_of_hero_classes_and_the_role_of_doomfist/): this one is much more practical and emphasizes the balance of basic abilities over design patterns (not to say that such balance isn't a design intent though).\n\n&amp;nbsp;\n\n# A Theory of Team Compositions: Understanding Specialized Classes\n\nThe \"golden standard\" for team compositions is 2-2-2, which basically requires to have double the representatives of each fundamental role in the \"tank-DD-healer\" triangle. These roles have a certain hierarchy though, that resembles of the poem \"This Is the House That Jack Built\":\n\n&gt; These are the damage dealers that kill the enemy team and win you the game.\n&gt;\t\n&gt; These are the tanks that distract the opponents from the damage dealers  \n&gt; That kill the enemy team and win you the game.\n&gt;\n&gt; These are the healers that keep alive the tanks  \n&gt; That distract the opponents from the damage dealers  \n&gt; That kill the enemy team and win you the game.\n\nNow when filling the slots in the 2-2-2 framework one should ask himself: are these two \"DPS\" heroes capable of efficiently killing the enemy team? Are these two \"tanks\" capable of creating enough room for the \"DPS\" to do so? And are those \"supports\" capable of keeping the team alive? When dealing with a specialized, unique hero, we should always consider these questions and see, which one the hero answers the best.\n\n&amp;nbsp;\n\nLet's take **Sombra** as an example, a hero people still struggle to find a place in the game for. Is she somebody who kills the enemy team? No, her skills don't allow the positioning her gun requires to be a reliable source of damage. This means it's suboptimal to pick her into one of the DPS slots. Does she create space for the DPS? Well, she does facilitate their job by disabling enemies' skills and barriers, but she can't draw any fire towards herself. Picking her into a tank slot will let the other team kill your DPS faster than they kill the enemies. Can she sustain her team? Actually - yes. This does require a change in your team's behavior since people will have to dwell around health packs more often, but once hacked, they are perfectly capable of restoring health to even tanks in a meaningful way.\n\nDuring the recent OGN APEX Challengers Season 3 Super Week we've [seen](https://youtu.be/_UjZZwzmYD4?t=8m54s) probably the first convincing use of Sombra in the pro scene by Conbox Spirit, and [she was run](https://youtu.be/DWDPAjGoN-s?t=34m11s) as the [second support](https://youtu.be/_UjZZwzmYD4?t=42m25s) along with Lucio on certain maps, [mostly on CP defense](https://youtu.be/DWDPAjGoN-s?t=55m43s). People healing from her packs between fights charged her ultimate for basically every teamfight, so that the attacking team had to contest the point without skills and barriers.\n\n&amp;nbsp;\n\nLet's consider another difficult to categorize hero - **Mei**. Many call her a tank, but pro teams run her (to my knowledge) exclusively in the DPS slot. Well, maybe they are wrong? Let's see. She doesn't restore health or sustain teammates in any way, so she doesn't fit the support slot. Even though she has good contesting potential, it's thanks to her ability to stay on the point, but out of the fight. This doesn't create space for the DPS, so no, Mei is not a tank. Now, can she kill the enemy team? In a weird way - yes. Despite having sub-par damage output, Mei is one of the heroes one can rely on to do the eliminations, but she accomplishes that job well only under the circumstances that her wall successfully splits the enemies or they are out of position themselves.\n\n&amp;nbsp;\n\nNow to our last case - **Roadhog**. This one's a bit tricky. He certainly isn't a support, but is he a tank or a DPS? He does draw attention to himself, and while shooting at his fat body is everybody's favorite way to charge ults, this actually gives breathing room to his DPS. On top of that his hook can quickly eliminate somebody who is a threat to them (a flanker for example). But that same hook mechanic can be thought of as a way to kill the enemy team. Roadhog is certainly not a True DPS, in the sense that he can't reliably kill all the necessary enemies, but he is a specialized DPS indeed.\n\nThis dual nature of Roadhog was one of the reasons 3-tank meta was (and still is) possible. As soon as the game got a strong enough healer who could counter the damage done to multiple tanks, there was little reason not to pick a tank who could do the DPS job into one of the DPS slots.\n\n&amp;nbsp;\n\n#### True vs Specialists\n\n\nNow how much should you rely on those specialized heroes? I believe a good rule of thumb is to have *at least* one hero of each True class, while the remaining three slots can be filled with both True and specialized heroes. There might be exceptions to this rule (as in the example with Sombra &amp; Lucio support choice), but these are likely to be viable mostly due to the individual balance of the heroes (Lucio is still considered a mustpick in organized play thanks to his speed, regardless of how much healing you need).", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65nj5q", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 28, "report_reasons": null, "author": "Metmor", "saved": false, "mod_reports": [], "name": "t3_65nj5q", "subreddit_name_prefixed": "r/OverwatchUniversity", "approved_by": null, "over_18": false, "domain": "self.OverwatchUniversity", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/1XnakkjLlcwmSrsdGrEAMA0TrFzq4v9Qi9nqxRvYIwo.jpg?s=1693d001e86f03d5cfdc66066ce67a09", "width": 480, "height": 360}, "resolutions": [{"url": "https://i.redditmedia.com/1XnakkjLlcwmSrsdGrEAMA0TrFzq4v9Qi9nqxRvYIwo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=cd577a101dc7c47ebcd415540f79d6ef", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/1XnakkjLlcwmSrsdGrEAMA0TrFzq4v9Qi9nqxRvYIwo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=59243070f374b346188415ea10e9d29a", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/1XnakkjLlcwmSrsdGrEAMA0TrFzq4v9Qi9nqxRvYIwo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=910e41d351be66c280dacb1fa0758066", "width": 320, "height": 240}], "variants": {}, "id": "XKC7deroGOJ3RXv8_QGRnKT6VHYS_GjlKCQJfVqI86I"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_3ejpe", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/OverwatchUniversity/comments/65nj5q/a_theory_of_team_compositions_understanding/", "num_reports": null, "locked": false, "stickied": false, "created": 1492347254.0, "url": "https://www.reddit.com/r/OverwatchUniversity/comments/65nj5q/a_theory_of_team_compositions_understanding/", "author_flair_text": null, "quarantine": false, "title": "A Theory of Team Compositions: Understanding Specialized Classes", "created_utc": 1492318454.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 28}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65nj5q", "likes": null, "replies": "", "user_reports": [], "id": "dgbqyel", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "dnevill", "parent_id": "t3_65nj5q", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Does area denial disrupt the enemy team?  We've functioned for nearly a year treating the characters as being Damage/Heal/Tank. It makes sense, Overwatch was marketed (or at least in reviews) as a hero shooter, a FPS MOBA, and its from Blizzard who has years of supporting this categorization.  But we seem to value characters on how well they fit into this dichotomy well, trichotomy).  Symmetra? Well, she doesn't heal, but her shield gen ult does reduce damage. She can teleport ult which is a wait-as-long-as-you-can-to-Rez for the next few players to die.  Mei can deny area with her blizzard and her wall, CC with her primary fire and her wall (depends when/where its used).  Soldier, Roadhog, Bastion, Mei, Tracer (recall) can heal, but only Soldier can heal others.\n\nI get that the trifecta has been a general philosphy for team construction for a long time, and because its been around it influences our choices even for those not looking at this post.  But as we both agree that there are many heroes that don't fall into it, is it wise to characterize them as Damage/Tank/Heal/Specialist? That pops up in a MOBA context, but we can swap heroes whenever we like with no level penalty, there's no equipment, objectives are usually asymmetric, and the only 'feed' you can do is enemy ultimates.\n\ntl;dr I've been drinking, tons of heroes are 'specialist' by this MOBA-style standard, but maps are asymmetric, we know the game was designed around a different philosophy, they don't exactly fit their labels in character select but hybrids of those 4 makes more sense than putting so many in specialist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does area denial disrupt the enemy team?  We&amp;#39;ve functioned for nearly a year treating the characters as being Damage/Heal/Tank. It makes sense, Overwatch was marketed (or at least in reviews) as a hero shooter, a FPS MOBA, and its from Blizzard who has years of supporting this categorization.  But we seem to value characters on how well they fit into this dichotomy well, trichotomy).  Symmetra? Well, she doesn&amp;#39;t heal, but her shield gen ult does reduce damage. She can teleport ult which is a wait-as-long-as-you-can-to-Rez for the next few players to die.  Mei can deny area with her blizzard and her wall, CC with her primary fire and her wall (depends when/where its used).  Soldier, Roadhog, Bastion, Mei, Tracer (recall) can heal, but only Soldier can heal others.&lt;/p&gt;\n\n&lt;p&gt;I get that the trifecta has been a general philosphy for team construction for a long time, and because its been around it influences our choices even for those not looking at this post.  But as we both agree that there are many heroes that don&amp;#39;t fall into it, is it wise to characterize them as Damage/Tank/Heal/Specialist? That pops up in a MOBA context, but we can swap heroes whenever we like with no level penalty, there&amp;#39;s no equipment, objectives are usually asymmetric, and the only &amp;#39;feed&amp;#39; you can do is enemy ultimates.&lt;/p&gt;\n\n&lt;p&gt;tl;dr I&amp;#39;ve been drinking, tons of heroes are &amp;#39;specialist&amp;#39; by this MOBA-style standard, but maps are asymmetric, we know the game was designed around a different philosophy, they don&amp;#39;t exactly fit their labels in character select but hybrids of those 4 makes more sense than putting so many in specialist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbqyel", "score_hidden": false, "stickied": false, "created": 1492350324.0, "created_utc": 1492321524.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65nj5q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65nj5q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65nj5q", "likes": null, "replies": "", "user_reports": [], "id": "dgcl9es", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DynamicStatic", "parent_id": "t1_dgcgldh", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "\"Sombra's most reliable and impactful way to be part of the balance of damage is to heal allies with hacked packs.\"\n\nThat is incorrect. Her most impactful way to be played is to drop ults that charge crazy fast. You can without the help of your team charge up your ult for every team fight pretty much, no need to redirect the rest of the team to help you out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Sombra&amp;#39;s most reliable and impactful way to be part of the balance of damage is to heal allies with hacked packs.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That is incorrect. Her most impactful way to be played is to drop ults that charge crazy fast. You can without the help of your team charge up your ult for every team fight pretty much, no need to redirect the rest of the team to help you out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgcl9es", "score_hidden": false, "stickied": false, "created": 1492406253.0, "created_utc": 1492377453.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcgldh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Metmor", "parent_id": "t1_dgc7qqs", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Fundamentally this game is about dealing, absorbing and countering damage. Hero-specific benefits don't just override that. Damage is like the currency of Overwatch (and not only Overwatch). Like with actual money: you can use it in different ways and earn it in different ways, but ultimately everything can be represented in terms of its balance.\n\n\"True\" classes deal directly with the balance of damage. Specialized classes do the same, but in a more complicated or situational way. If you don't recognize those ways in which a hero is integral to the balance of damage, such hero simply becomes redundant and is better be replaced with somebody else.\n\nSombra's most reliable and impactful way to be part of the balance of damage is to heal allies with hacked packs. Not only it's important by itself, her ultimate (which is that unique benefit of hers) is - just like any ultimate in the game - fueled by her contributing to that balance properly. Sombra doesn't just pull EMPs out of nowhere. If you already have two healers in the team and all the allies are taken care of by them, not only Sombra becomes a sub-par \"DPS\", she also receives her EMPs slower *because* she is played as a sub-par \"DPS\" rather than a support.", "edited": 1492371825.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fundamentally this game is about dealing, absorbing and countering damage. Hero-specific benefits don&amp;#39;t just override that. Damage is like the currency of Overwatch (and not only Overwatch). Like with actual money: you can use it in different ways and earn it in different ways, but ultimately everything can be represented in terms of its balance.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;True&amp;quot; classes deal directly with the balance of damage. Specialized classes do the same, but in a more complicated or situational way. If you don&amp;#39;t recognize those ways in which a hero is integral to the balance of damage, such hero simply becomes redundant and is better be replaced with somebody else.&lt;/p&gt;\n\n&lt;p&gt;Sombra&amp;#39;s most reliable and impactful way to be part of the balance of damage is to heal allies with hacked packs. Not only it&amp;#39;s important by itself, her ultimate (which is that unique benefit of hers) is - just like any ultimate in the game - fueled by her contributing to that balance properly. Sombra doesn&amp;#39;t just pull EMPs out of nowhere. If you already have two healers in the team and all the allies are taken care of by them, not only Sombra becomes a sub-par &amp;quot;DPS&amp;quot;, she also receives her EMPs slower &lt;em&gt;because&lt;/em&gt; she is played as a sub-par &amp;quot;DPS&amp;quot; rather than a support.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgcgldh", "score_hidden": false, "stickied": false, "created": 1492400190.0, "created_utc": 1492371390.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7qqs", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MaverickBG", "parent_id": "t3_65nj5q", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Interesting read but seems like you may be trying to fit a square block in a round hole.\n\nI play a lot of sombra and I understand that she boosts heals, but to try to fit her into the archetype of \"support\" is inaccurate. (and further isolates her play)\n\nI think we need to look at the specific benefits each hero offers and build teams around that and make sure the team executes on that plan. Your example of sombra was perfect for THAT. If they didn't exploit that plan that was enabled due to her character, the plan wouldn't of worked. \n\nShe wasn't effective because she mitigated damage and restored health (though her packs helped) she was effective because the other team likely was using barriers and needed abilities to push in. Sombras mechanics disabled those and it was successful and the other team couldn't deal. Cool. What if we subbed in Torb? He has a turret and some armor. Maybe that would have helped hold better? What if they had an aggressive dive comp that an EMP wouldn't of helped against and instead the turret would of helped hold against that. I wouldn't say torb is a support now, I would say that torb fit their \"plan\" and it worked. If the plan though was to disable abilities and fight them with the upper hand, sombra makes sense for that game plan... If the game plan was keep them scattered and pick them early, a tracer or genji may have been better.\n\nOn phone making Easter food so hopefully that all makes sense!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interesting read but seems like you may be trying to fit a square block in a round hole.&lt;/p&gt;\n\n&lt;p&gt;I play a lot of sombra and I understand that she boosts heals, but to try to fit her into the archetype of &amp;quot;support&amp;quot; is inaccurate. (and further isolates her play)&lt;/p&gt;\n\n&lt;p&gt;I think we need to look at the specific benefits each hero offers and build teams around that and make sure the team executes on that plan. Your example of sombra was perfect for THAT. If they didn&amp;#39;t exploit that plan that was enabled due to her character, the plan wouldn&amp;#39;t of worked. &lt;/p&gt;\n\n&lt;p&gt;She wasn&amp;#39;t effective because she mitigated damage and restored health (though her packs helped) she was effective because the other team likely was using barriers and needed abilities to push in. Sombras mechanics disabled those and it was successful and the other team couldn&amp;#39;t deal. Cool. What if we subbed in Torb? He has a turret and some armor. Maybe that would have helped hold better? What if they had an aggressive dive comp that an EMP wouldn&amp;#39;t of helped against and instead the turret would of helped hold against that. I wouldn&amp;#39;t say torb is a support now, I would say that torb fit their &amp;quot;plan&amp;quot; and it worked. If the plan though was to disable abilities and fight them with the upper hand, sombra makes sense for that game plan... If the game plan was keep them scattered and pick them early, a tracer or genji may have been better.&lt;/p&gt;\n\n&lt;p&gt;On phone making Easter food so hopefully that all makes sense!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgc7qqs", "score_hidden": false, "stickied": false, "created": 1492388500.0, "created_utc": 1492359700.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65nj5q", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65nj5q", "likes": null, "replies": "", "user_reports": [], "id": "dgcpbjg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DynamicStatic", "parent_id": "t1_dgcmhri", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Considering you always get the drop on people the damage is good enough. EMP and smash zenyatta or destroy lucios ult, deny mercy res and so on, there are sooooooo many uses for her skills it is ridiculous.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Considering you always get the drop on people the damage is good enough. EMP and smash zenyatta or destroy lucios ult, deny mercy res and so on, there are sooooooo many uses for her skills it is ridiculous.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgcpbjg", "score_hidden": false, "stickied": false, "created": 1492411677.0, "created_utc": 1492382877.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmhri", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MaverickBG", "parent_id": "t3_65nj5q", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "I don't understand the \"sombra doesn't do damage\" camp. I can hack targets and kill zens, mercies or tracers with ease. AND tp after. I think she supports damage output and i would more accurately define it as helping to grow your teams dps. The issues I have when playing her is that a team that doesn't output damage doesn't help showcase her ability. (Diamond sombra exclusively )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand the &amp;quot;sombra doesn&amp;#39;t do damage&amp;quot; camp. I can hack targets and kill zens, mercies or tracers with ease. AND tp after. I think she supports damage output and i would more accurately define it as helping to grow your teams dps. The issues I have when playing her is that a team that doesn&amp;#39;t output damage doesn&amp;#39;t help showcase her ability. (Diamond sombra exclusively )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgcmhri", "score_hidden": false, "stickied": false, "created": 1492407858.0, "created_utc": 1492379058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]