[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "OverwatchUniversity", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve watched about 3 guides a stream of the best Sombra player I could find. I&amp;#39;ve also read like 4 guides. I&amp;#39;ve had the game for about five days now. But I&amp;#39;m losing a lot when I play with my brother and his friends that are prestige 3. Just wanted tips on when to use my ult and stuff.&lt;/p&gt;\n\n&lt;p&gt;Edit1: when I play alone I&amp;#39;ve won every game and I&amp;#39;ve carried them with the most objective kills and most objective time. That&amp;#39;s why I&amp;#39;m wanting to to play against people a lot higher level.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: the only real reason I want to play Sombra is because I&amp;#39;m kind of a hipster and I hear she is the hardest and one of the least played character in the game.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've watched about 3 guides a stream of the best Sombra player I could find. I've also read like 4 guides. I've had the game for about five days now. But I'm losing a lot when I play with my brother and his friends that are prestige 3. Just wanted tips on when to use my ult and stuff.\n\nEdit1: when I play alone I've won every game and I've carried them with the most objective kills and most objective time. That's why I'm wanting to to play against people a lot higher level.\n\nEdit 2: the only real reason I want to play Sombra is because I'm kind of a hipster and I hear she is the hardest and one of the least played character in the game.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65noxn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 17, "report_reasons": null, "author": "Luckyhipster", "saved": false, "mod_reports": [], "name": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "approved_by": null, "over_18": false, "domain": "self.OverwatchUniversity", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_3ejpe", "edited": 1492378765.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/OverwatchUniversity/comments/65noxn/new_player_i_want_to_main_sombra/", "num_reports": null, "locked": false, "stickied": false, "created": 1492350005.0, "url": "https://www.reddit.com/r/OverwatchUniversity/comments/65noxn/new_player_i_want_to_main_sombra/", "author_flair_text": null, "quarantine": false, "title": "New player. I want to main Sombra.", "created_utc": 1492321205.0, "distinguished": null, "media": null, "upvote_ratio": 0.73, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgbregv", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "felix204", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "If you've only had the game for 5 days I really suggest that you just enjoy the game right now, and play around with other heroes more. I highly doubt you've played each hero to the point where you are even remotely close to understanding their playstyles. \n\nWhen you play with your brother you're getting matched against more experienced players who have developed better game sense, so don't feel too bad if you lose. You could also try watching pro streamers and pick up a few tips\n\nGood luck :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;ve only had the game for 5 days I really suggest that you just enjoy the game right now, and play around with other heroes more. I highly doubt you&amp;#39;ve played each hero to the point where you are even remotely close to understanding their playstyles. &lt;/p&gt;\n\n&lt;p&gt;When you play with your brother you&amp;#39;re getting matched against more experienced players who have developed better game sense, so don&amp;#39;t feel too bad if you lose. You could also try watching pro streamers and pick up a few tips&lt;/p&gt;\n\n&lt;p&gt;Good luck :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbregv", "score_hidden": false, "stickied": false, "created": 1492351305.0, "created_utc": 1492322505.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgbvp4c", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Daenyx", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "You're not going to be able to use Sombra effectively without a LOT of map knowledge and decent game sense, period.  Like the others here, I recommend you get some time under your belt on other heroes before you try to really work on Sombra.  (Mercy is a particularly good pick for learning game sense and positioning, although she won't help your aim improve.)\n\nThat said, when you do work on her, the two really big points of impact to focus on for a new-ish player are hacking and ult usage:\n\n* Position yourself at a height when you can to give yourself easy hacking access against enemy tanks, and coordinate with your team so that they'll be ready to apply pressure when, for instance, the enemy Reinhardt can't shield.  \n\n* Timing Sombra's ult can be tricky, but in general you want to use it to give your team advantage in the early part of a team fight (i.e. when 3+ members of each team engage each other) - you can use it RIGHT before your team pops an offensive ultimate in order to prevent a counter, or if your team doesn't have ultimates to use in that engagement, you can EMP right at the start to deny enemy ability uses for a few seconds, which will hopefully let your team pick a few off easily.  \n\n* Keep in mind that Sombra's hack/EMP (and thus, Sombra's main contribution to the team, because while yes, she can and should kill things, all other assault characters have better kits for that) is stronger against more ability-reliant characters.  She's excellent against teams that have shields going on everywhere, and can make Roadhog vulnerable as well (because without self-heal or hook he's just a slow target with a large hitbox and a dangerous-but-slow shotgun).  She's less effective against DPS-heavy comps.  Her EMP, timed correctly, denies a defensive ult by Lucio or Zenyatta, but it's less effective against a Mercy rez since the window of opportunity for using that to save the team is (usually) larger.  If your team has a Zarya, the Sombra should pretty much always be trying to stack EMP with graviton surge to deny shields and defensive ults.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not going to be able to use Sombra effectively without a LOT of map knowledge and decent game sense, period.  Like the others here, I recommend you get some time under your belt on other heroes before you try to really work on Sombra.  (Mercy is a particularly good pick for learning game sense and positioning, although she won&amp;#39;t help your aim improve.)&lt;/p&gt;\n\n&lt;p&gt;That said, when you do work on her, the two really big points of impact to focus on for a new-ish player are hacking and ult usage:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Position yourself at a height when you can to give yourself easy hacking access against enemy tanks, and coordinate with your team so that they&amp;#39;ll be ready to apply pressure when, for instance, the enemy Reinhardt can&amp;#39;t shield.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Timing Sombra&amp;#39;s ult can be tricky, but in general you want to use it to give your team advantage in the early part of a team fight (i.e. when 3+ members of each team engage each other) - you can use it RIGHT before your team pops an offensive ultimate in order to prevent a counter, or if your team doesn&amp;#39;t have ultimates to use in that engagement, you can EMP right at the start to deny enemy ability uses for a few seconds, which will hopefully let your team pick a few off easily.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Keep in mind that Sombra&amp;#39;s hack/EMP (and thus, Sombra&amp;#39;s main contribution to the team, because while yes, she can and should kill things, all other assault characters have better kits for that) is stronger against more ability-reliant characters.  She&amp;#39;s excellent against teams that have shields going on everywhere, and can make Roadhog vulnerable as well (because without self-heal or hook he&amp;#39;s just a slow target with a large hitbox and a dangerous-but-slow shotgun).  She&amp;#39;s less effective against DPS-heavy comps.  Her EMP, timed correctly, denies a defensive ult by Lucio or Zenyatta, but it&amp;#39;s less effective against a Mercy rez since the window of opportunity for using that to save the team is (usually) larger.  If your team has a Zarya, the Sombra should pretty much always be trying to stack EMP with graviton surge to deny shields and defensive ults.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbvp4c", "score_hidden": false, "stickied": false, "created": 1492363595.0, "created_utc": 1492334795.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgbrtui", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "confusedpenistwitch", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Sombra's all about coordination and communicating with your teammates to use your healthpacks. \n\nSombra also requires map knowledge since you need to know where healthpacks are located. Hacked healthpacks allow you to get ultimate charge very quickly. You should be ideally having EMP for almost every single teamfight.\n\nAs another poster has said, just try out other heroes and learn the game gradually. Sombra is just not very good for beginners to use, and you'll have a rough time trying to win games with her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sombra&amp;#39;s all about coordination and communicating with your teammates to use your healthpacks. &lt;/p&gt;\n\n&lt;p&gt;Sombra also requires map knowledge since you need to know where healthpacks are located. Hacked healthpacks allow you to get ultimate charge very quickly. You should be ideally having EMP for almost every single teamfight.&lt;/p&gt;\n\n&lt;p&gt;As another poster has said, just try out other heroes and learn the game gradually. Sombra is just not very good for beginners to use, and you&amp;#39;ll have a rough time trying to win games with her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbrtui", "score_hidden": false, "stickied": false, "created": 1492352309.0, "created_utc": 1492323509.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgdp7jp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pierroutt", "parent_id": "t1_dgc0drm", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "\"Hack the world\"? I believe the correct phrase is \"Hack the planet\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Hack the world&amp;quot;? I believe the correct phrase is &amp;quot;Hack the planet&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgdp7jp", "score_hidden": false, "stickied": false, "created": 1492474914.0, "created_utc": 1492446114.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0drm", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "colonelxsuezo", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Just some quick background on me: I'm a low diamond player who has put around 20 hours into hardcore Sombra practice. She has my highest Quick Rank (as useless as it is) on Overbuff, sitting between 96% and 97%. Sombra's kit can be incredibly fun to play with when you get going, so here are some tips I came up with for myself and a friend who I am also teaching how to Sombra. Hopefully these tips will be useful to you.\n\n* Sombra's kit flows very well when you are using her right. Her cooldowns overlap almost perfectly. If you find yourself in a situation where you need an ability and it's on cooldown, you messed up somewhere a few seconds earlier.\n\n* Move with purpose. As Sombra, you should always have an idea of what your next moves are. It could be hacking a health pack, chasing down someone who is low health and oblivious to your presence, stealth pushing the payload, etc. All of this should be done while running between health packs.\n\n* Speaking of low health players anyone with less than half HEALTH can be seen through the wall thanks to her passive Opportunist. I stress the health portion because if a character has shields as part of their health then her passive doesn't kick in until the health portion is at half. So for example take Zarya, I don't tend to see her through the wall until she's at 100 HP. Chase these people down and eliminate them! As Sombra, you get to choose your battles.\n\n* Find a good health pack, preferably a mega but a mini will work, hack it, throw translocator on/near it, go invisible. This is \"The Combo\" and you absolutely need to practice and perfect this. Use \"The Combo\" and then (assuming the match just started) immediately run into the back lines and pick on a healer. In terms of who I like picking on it's Mercy, then Zen, then Lucio, then Ana, but YMMV. Go for kills but don't get greedy and translocate out when it's the first sign of things getting hairy. Your job is more to support your team and drive the enemy team crazy. You cannot do that if dead. She has an unfortunate bug where her hit box lingers in two places for a split second so you need to account for this. Better safe than sorry, and you move so fast anyway you'll be back on their ass before they can take a breather.\n\n* Back to hacking for a second, the biggest mistake I see so many Sombra players make is that they don't hack enough. Hack the world. Aim to have three health packs hacked at any one give time. You and your team can see them through the walls now, which makes her job so much easier. They all last hacked for one minute. One should be near where your team is likely to be so they can help you charge your ult, one should be your base where you do \"The Combo\", and the last health pack is optional you can hack on an as-needed basis or for enemy healing denial. Hack range is 15 meters.\n\n* Hack enemies too, and know which ones are worth hacking and which ones are not as good options! Hack can turn a lot of matches on its head, even ones you wouldn't think would go in Sombra's favor. Hacking from above and behind is usually the most successful approach. For example, you completely neuter Genji if you bait Deflect before you hack. Tracer is in a bind if you can hack her too, since she can't blink or rewind. Hack stops Roadhog's ult in its tracks (but for some reason not 76's...). Even D.Va hates getting hacked since she can't defense matrix or fly away from you anymore and her crit box is the size of Madagascar. On that same note, just never fight Sym or McCree. Just...don't do it to yourself unless you know you can win.\n\n* EMP is a godsend of an ult and it charges really fast. EMP functions as a party-wide hack which disables certain enemy abilities and ultimates, and prevents the usage of enemy ultimates but does no damage. It also reveals which enemies have ult. Use it as often as possible, **but let your team know that you are going to use it first**. EMP can end an entire fight before it begins but only if your team is in position to follow up.\n\n* Back to \"The Combo\" for a bit. With all the knowledge I've just randomly dumped, you should be able to get going for a bit. But some enemies will figure out where you are coming from because when you translocate it basically tells the enemies what direction to go in. If you use the same health pack as a base for too long they're going to figure it out so you have to rotate periodically. Also, there may be cases where you forget and it runs out or you decide not to go back and you have translocator on hand. It's actually a really good tool for chasing down people that are running away, juking the enemy, or even taking gigantic short cuts like when attacking the second point of Hanamura. Find other clever ways to use it :)\n\n* Turn off reticle bloom if you still have it on. It makes it so much easier to aim.\n\n* Sombra can work anywhere but there are definitely maps where it's easier than others, and team compositions where she will struggle. Be open to switching to something more consistent if it's not working.\n\nThere's a lot more to my favorite character in the game but hopefully with this and the responses of others in this thread you can understand how best to use her! I do believe you should also learn another character or three alongside her if you are new since her kit can be rather unforgiving if you make a mistake.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just some quick background on me: I&amp;#39;m a low diamond player who has put around 20 hours into hardcore Sombra practice. She has my highest Quick Rank (as useless as it is) on Overbuff, sitting between 96% and 97%. Sombra&amp;#39;s kit can be incredibly fun to play with when you get going, so here are some tips I came up with for myself and a friend who I am also teaching how to Sombra. Hopefully these tips will be useful to you.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Sombra&amp;#39;s kit flows very well when you are using her right. Her cooldowns overlap almost perfectly. If you find yourself in a situation where you need an ability and it&amp;#39;s on cooldown, you messed up somewhere a few seconds earlier.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Move with purpose. As Sombra, you should always have an idea of what your next moves are. It could be hacking a health pack, chasing down someone who is low health and oblivious to your presence, stealth pushing the payload, etc. All of this should be done while running between health packs.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Speaking of low health players anyone with less than half HEALTH can be seen through the wall thanks to her passive Opportunist. I stress the health portion because if a character has shields as part of their health then her passive doesn&amp;#39;t kick in until the health portion is at half. So for example take Zarya, I don&amp;#39;t tend to see her through the wall until she&amp;#39;s at 100 HP. Chase these people down and eliminate them! As Sombra, you get to choose your battles.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Find a good health pack, preferably a mega but a mini will work, hack it, throw translocator on/near it, go invisible. This is &amp;quot;The Combo&amp;quot; and you absolutely need to practice and perfect this. Use &amp;quot;The Combo&amp;quot; and then (assuming the match just started) immediately run into the back lines and pick on a healer. In terms of who I like picking on it&amp;#39;s Mercy, then Zen, then Lucio, then Ana, but YMMV. Go for kills but don&amp;#39;t get greedy and translocate out when it&amp;#39;s the first sign of things getting hairy. Your job is more to support your team and drive the enemy team crazy. You cannot do that if dead. She has an unfortunate bug where her hit box lingers in two places for a split second so you need to account for this. Better safe than sorry, and you move so fast anyway you&amp;#39;ll be back on their ass before they can take a breather.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Back to hacking for a second, the biggest mistake I see so many Sombra players make is that they don&amp;#39;t hack enough. Hack the world. Aim to have three health packs hacked at any one give time. You and your team can see them through the walls now, which makes her job so much easier. They all last hacked for one minute. One should be near where your team is likely to be so they can help you charge your ult, one should be your base where you do &amp;quot;The Combo&amp;quot;, and the last health pack is optional you can hack on an as-needed basis or for enemy healing denial. Hack range is 15 meters.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Hack enemies too, and know which ones are worth hacking and which ones are not as good options! Hack can turn a lot of matches on its head, even ones you wouldn&amp;#39;t think would go in Sombra&amp;#39;s favor. Hacking from above and behind is usually the most successful approach. For example, you completely neuter Genji if you bait Deflect before you hack. Tracer is in a bind if you can hack her too, since she can&amp;#39;t blink or rewind. Hack stops Roadhog&amp;#39;s ult in its tracks (but for some reason not 76&amp;#39;s...). Even D.Va hates getting hacked since she can&amp;#39;t defense matrix or fly away from you anymore and her crit box is the size of Madagascar. On that same note, just never fight Sym or McCree. Just...don&amp;#39;t do it to yourself unless you know you can win.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;EMP is a godsend of an ult and it charges really fast. EMP functions as a party-wide hack which disables certain enemy abilities and ultimates, and prevents the usage of enemy ultimates but does no damage. It also reveals which enemies have ult. Use it as often as possible, &lt;strong&gt;but let your team know that you are going to use it first&lt;/strong&gt;. EMP can end an entire fight before it begins but only if your team is in position to follow up.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Back to &amp;quot;The Combo&amp;quot; for a bit. With all the knowledge I&amp;#39;ve just randomly dumped, you should be able to get going for a bit. But some enemies will figure out where you are coming from because when you translocate it basically tells the enemies what direction to go in. If you use the same health pack as a base for too long they&amp;#39;re going to figure it out so you have to rotate periodically. Also, there may be cases where you forget and it runs out or you decide not to go back and you have translocator on hand. It&amp;#39;s actually a really good tool for chasing down people that are running away, juking the enemy, or even taking gigantic short cuts like when attacking the second point of Hanamura. Find other clever ways to use it :)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Turn off reticle bloom if you still have it on. It makes it so much easier to aim.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Sombra can work anywhere but there are definitely maps where it&amp;#39;s easier than others, and team compositions where she will struggle. Be open to switching to something more consistent if it&amp;#39;s not working.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;There&amp;#39;s a lot more to my favorite character in the game but hopefully with this and the responses of others in this thread you can understand how best to use her! I do believe you should also learn another character or three alongside her if you are new since her kit can be rather unforgiving if you make a mistake.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgc0drm", "score_hidden": false, "stickied": false, "created": 1492377155.0, "created_utc": 1492348355.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgc9npp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LightnMagic", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "The biggest mistake I've seen Sombras make is: \n\n1. Throw teleporter in to get close to enemy team\n\n2. stealth and run behind enemy\n\n3. \"HE VUELTO\"\n\n4. Attempt to hack hero on the enemy team\n\n5. Entire team collapses on Sombra and she dies. \n\n6. Repeat for 8 minutes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The biggest mistake I&amp;#39;ve seen Sombras make is: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Throw teleporter in to get close to enemy team&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;stealth and run behind enemy&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&amp;quot;HE VUELTO&amp;quot;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Attempt to hack hero on the enemy team&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Entire team collapses on Sombra and she dies. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Repeat for 8 minutes.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgc9npp", "score_hidden": false, "stickied": false, "created": 1492390988.0, "created_utc": 1492362188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgccj7m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wankershankerflanker", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Sombra is not a good choice for a new player. I would argue she is probably the hardest character to get value from in the game atm. A lot of people I think are giving you advice that is almost a bit too advance.\n\nTip 1: Make sure your team is going to face as a team before trying to sneak into the back line. Like any flanker, if the enemy team isn't focusing on your team; they will focus you.\n\nTip 2: Keep 2 health packs going as much as you can. A lot of people do big packs on attack and defense. Personally on attack I do a big one on our side and a small one on the opposite side. That will come down to play style. \n\nTip 3: Go into practice range, go to the right of spawn. There is a long hallway with a bot at the end and distance markers. Walk to the bot and find your max hack range. This is 15 meters, learn it, know it, love it. The sound coming out or stealth, your hack, and your ult are this range. While you're there, practice tracking vs the moving bots.\n\nPersonally, I would tell you to learn a little tracer first. Same tracking, same positioning, different way to do it all. A lot of tracer is getting to a bad place for the enemy, blinking close and insta-killing them. Sombra is the same, but rather than kill them; you hack them first then if you can duel them you do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sombra is not a good choice for a new player. I would argue she is probably the hardest character to get value from in the game atm. A lot of people I think are giving you advice that is almost a bit too advance.&lt;/p&gt;\n\n&lt;p&gt;Tip 1: Make sure your team is going to face as a team before trying to sneak into the back line. Like any flanker, if the enemy team isn&amp;#39;t focusing on your team; they will focus you.&lt;/p&gt;\n\n&lt;p&gt;Tip 2: Keep 2 health packs going as much as you can. A lot of people do big packs on attack and defense. Personally on attack I do a big one on our side and a small one on the opposite side. That will come down to play style. &lt;/p&gt;\n\n&lt;p&gt;Tip 3: Go into practice range, go to the right of spawn. There is a long hallway with a bot at the end and distance markers. Walk to the bot and find your max hack range. This is 15 meters, learn it, know it, love it. The sound coming out or stealth, your hack, and your ult are this range. While you&amp;#39;re there, practice tracking vs the moving bots.&lt;/p&gt;\n\n&lt;p&gt;Personally, I would tell you to learn a little tracer first. Same tracking, same positioning, different way to do it all. A lot of tracer is getting to a bad place for the enemy, blinking close and insta-killing them. Sombra is the same, but rather than kill them; you hack them first then if you can duel them you do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgccj7m", "score_hidden": false, "stickied": false, "created": 1492394779.0, "created_utc": 1492365979.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgcfm1k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "golden_boy", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "I think it's too early to choose a main. You should experiment and see who feels best.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s too early to choose a main. You should experiment and see who feels best.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgcfm1k", "score_hidden": false, "stickied": false, "created": 1492398905.0, "created_utc": 1492370105.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgcgxzm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Herubin", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "I think maining particular hero is really bad in case of Overwatch. You should Main particular Class, instead of Hero. For example, if you like Sombra, you should be able to use every hero in Assault roster at least decent/good. I'm Support main, and I never tell something like \"I'm Mercy main\". I'm Support main, and I can rekt with everyone of them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think maining particular hero is really bad in case of Overwatch. You should Main particular Class, instead of Hero. For example, if you like Sombra, you should be able to use every hero in Assault roster at least decent/good. I&amp;#39;m Support main, and I never tell something like &amp;quot;I&amp;#39;m Mercy main&amp;quot;. I&amp;#39;m Support main, and I can rekt with everyone of them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgcgxzm", "score_hidden": false, "stickied": false, "created": 1492400655.0, "created_utc": 1492371855.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgdi9a4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Atreyisx", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "As a new player play as many heroes as possible. Sombra relies on knowing who the biggest threat to your team is and hack accordingly. When playing Sombra moreso than just about any character you should have every other characters abilities memorized", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a new player play as many heroes as possible. Sombra relies on knowing who the biggest threat to your team is and hack accordingly. When playing Sombra moreso than just about any character you should have every other characters abilities memorized&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgdi9a4", "score_hidden": false, "stickied": false, "created": 1492466330.0, "created_utc": 1492437530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgdp5uk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Pierroutt", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "One thing to keep in mind since you're a bit new: you need to learn all of the hero's abilities, and what your hack does to their abilities, otherwise you might find yourself getting low value hacks. For example, hacking a Soldier or McCree is pretty low value, as most of their value comes from their primary fire, not their abilities. However, hacking a Genji or Tracer is pretty high value, especially Tracer, as both of those characters are very reliant on their abilities.\nHacking Reinhardt is extremely easy and one of the highest value hacks you can get, because it removes his 2000 HP shield.\n\nAlways communicate to your team who you've hacked, otherwise they won't be able to follow up on your hacks.\n\nOne quick tip from a pro player who used sombra pretty damn well (Rascal from Kongdoo Panthera): The best targets to hack are tanks, because they're heavily reliant on their abilities. Especially tanks like Reinhardt, D.Va, and Zarya, they're literally nothing without their abilities.\n\nBut yeah, I think you really need to play the game more and understand all of the heroes before you can use Sombra effectively.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One thing to keep in mind since you&amp;#39;re a bit new: you need to learn all of the hero&amp;#39;s abilities, and what your hack does to their abilities, otherwise you might find yourself getting low value hacks. For example, hacking a Soldier or McCree is pretty low value, as most of their value comes from their primary fire, not their abilities. However, hacking a Genji or Tracer is pretty high value, especially Tracer, as both of those characters are very reliant on their abilities.\nHacking Reinhardt is extremely easy and one of the highest value hacks you can get, because it removes his 2000 HP shield.&lt;/p&gt;\n\n&lt;p&gt;Always communicate to your team who you&amp;#39;ve hacked, otherwise they won&amp;#39;t be able to follow up on your hacks.&lt;/p&gt;\n\n&lt;p&gt;One quick tip from a pro player who used sombra pretty damn well (Rascal from Kongdoo Panthera): The best targets to hack are tanks, because they&amp;#39;re heavily reliant on their abilities. Especially tanks like Reinhardt, D.Va, and Zarya, they&amp;#39;re literally nothing without their abilities.&lt;/p&gt;\n\n&lt;p&gt;But yeah, I think you really need to play the game more and understand all of the heroes before you can use Sombra effectively.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgdp5uk", "score_hidden": false, "stickied": false, "created": 1492474863.0, "created_utc": 1492446063.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgefeut", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LifesASurprise", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "I don't know why, but your paragraph makes me lol. Just the phrasing of it is cracking me up. Idk man. But yeah watch codey on twitch? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know why, but your paragraph makes me lol. Just the phrasing of it is cracking me up. Idk man. But yeah watch codey on twitch? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgefeut", "score_hidden": false, "stickied": false, "created": 1492505853.0, "created_utc": 1492477053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgbt7ii", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "Metmor", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "Read less, train your aim more. Really.\n\nJust killing people is the primary impact you can have in this game. Everything else is to facilitate or to comblicate this task for you or the enemies respectively.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Read less, train your aim more. Really.&lt;/p&gt;\n\n&lt;p&gt;Just killing people is the primary impact you can have in this game. Everything else is to facilitate or to comblicate this task for you or the enemies respectively.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbt7ii", "score_hidden": false, "stickied": false, "created": 1492355834.0, "created_utc": 1492327034.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_3ejpe", "removal_reason": null, "link_id": "t3_65noxn", "likes": null, "replies": "", "user_reports": [], "id": "dgbz4lm", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Galty", "parent_id": "t3_65noxn", "subreddit_name_prefixed": "r/OverwatchUniversity", "controversiality": 0, "body": "[No, don't do it] (https://youtu.be/68Aas1zQwHI)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://youtu.be/68Aas1zQwHI\"&gt;No, don&amp;#39;t do it&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "OverwatchUniversity", "name": "t1_dgbz4lm", "score_hidden": false, "stickied": false, "created": 1492374350.0, "created_utc": 1492345550.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]