[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "ClashRoyale", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I play a lot of challenges, and the skill level of people on there varies greatly. This is to be expected, because you can face people who are in the 5k trophies, just like you can face people who only just got their deck to tournament level (or sometimes aren&amp;#39;t yet at tournament level). Now that I am a fairly experienced player, I see mistakes that the less experience players make, which I probably didn&amp;#39;t notice back when I was in their shoes (and likely made myself). Here are some of these mistakes I see regularly, and what you can do to fix them. This guide is aimed mostly at the less experienced players, though I do see some of those mistakes on ladder above 4k, so even if you are more experienced, you can do a mental checklist to see whether or not these apply to you.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;[Edit/TL;DR]&lt;/strong&gt; I understand this is a lot of text, but I tried to make the section titles fairly clear, so if you want a TL;DR, just read the section titles. If you feel one might be a mistake you make, or a concept you aren&amp;#39;t familiar with, then read the whole paragraph. If it&amp;#39;s something you already know, then feel free to skip.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Don&amp;#39;t repeat the same move, hoping for different results&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Situation: Opponent pushes with a Giant and minions. You place an inferno tower for the giant and a musketeer for the minions. Opponent reveals they had lightning and hits your tower, inferno tower and musketeer. That sucks, but it happens. Unless you were playing against a well known meta deck, you probably couldn&amp;#39;t guess that they had lightning. However, if the opponent builds the same push and you try to counter it with inferno tower + musketeer positioned in the exact same way, that&amp;#39;s totally on you. It seems obvious, but I see those mistakes happening constantly.  It&amp;#39;s understandable when you think about it. You practice a given deck a lot, you start finding patterns that work, and since you often have to react quickly, they become automatic. Still, being able to adapt is one of the most important skills you need to develop to get better. In the situation above, learn the anti-lightning positions for inferno tower, or place your musketeer far enough that the opponent can&amp;#39;t hit both it and the i-tower. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Vary your defense&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Opponent puts ebarbs at the bridge. You surround them with skarmy. Awesome, you countered ebarbs for positive elixir trade! A cycle later, opponent puts ebarbs at the bridge. Are you going to surround them with skarmy again? You probably shouldn&amp;#39;t. Maybe you&amp;#39;re playing against an opponent that didn&amp;#39;t read my first mistake, but you should probably assume that your opponent is playing properly (even &lt;em&gt;if&lt;/em&gt; they&amp;#39;re playing ebarbs). You should therefore assume that the opponent is expecting skarmy and will have a log/zap ready for it. Maybe they&amp;#39;re going to send a prediction log! You really need to vary your defense when possible. Something as simple as placing skarmy in the middle will mess with a prediction log. Or use a knight this time, since it&amp;#39;s pretty much immune to zap/log. People will usually prepare their next push in a way that counters the defense they know you use, so varying your defense really throws a wrench in their plan. &lt;/p&gt;\n\n&lt;p&gt;The same is true for offense in fact. Just because a barrel placement worked well once, doesn&amp;#39;t mean you shouldn&amp;#39;t use a different placement next. Just because a certain push composition worked well doesn&amp;#39;t mean they won&amp;#39;t be prepared for it next time.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Giving up early&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is more of a mindset issue than a skill issue, but seriously, just because you&amp;#39;re down one tower in the first minute of the game doesn&amp;#39;t mean you&amp;#39;re done for. I played a game earlier today. Opponent plays golem in the back. I take this opportunity to push the other lane and it pays off, because I take his tower with little investment (ram + goblin gang). Meanwhile, his golem push deals about 800 on my tower, with me spending all my elixir to defend against it. Opponent rage quits. This is a horrible decision. Opponent saw basically all my deck at this point, because I had to use almost all of it to defend against the push. So they know what they&amp;#39;re up against and can plan a defense to protect their other towers. They still managed to get damage on my tower on their first push of the game (this is actually fairly rare in my experience against golem decks, usually the first push is fairly easy to defend against and is more intended to probe the defense) Sure, I wasn&amp;#39;t at full elixir, since I used some to take down his tower, but there&amp;#39;s a lot of time left, and if I couldn&amp;#39;t fully stop their push at normal elixir, imagine how it will be when they get to double elixir and can completely overwhelm my defense. &lt;/p&gt;\n\n&lt;p&gt;The game as a whole is designed to make it harder to take the second tower (well... generally, though some cards such as 3 musketeer and RG are exceptions to this), to allow come backs. Losing a tower early sucks, but it&amp;#39;s not the end of the world. You have plenty of time left. Not only is it possible to come back, but those games where you lose the tower early, yet still manage to win are the most rewarding and most fun games. Play your games through! If nothing else, it&amp;#39;s extra practice.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Use your towers&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When you see a naked minion hordes coming towards your tower, what are the counters? Most people will immediately think of fireball, arrows, fire spirit, princess, etc. Less experienced players might not think of skeletons, knight or other such cards as a counter. They can&amp;#39;t attack air, right? But your towers can. All you have to do is give your towers enough time and bring the attacking troops to the kill zone where both towers can attack them. Similarly, knight is really good at countering lava pups, just place him right in front of your tower just before the hound explodes. Most, if not all the pups will target the knight while the tower kills them one by one. You don&amp;#39;t always need anti-air troops to deal with flying troops. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Ultimately, the game is about trading elixir for tower damage, and vice versa&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There isn&amp;#39;t a hard rule about how much damage 1 elixir is worth. It really depends on your deck and on the situation. However, too often I see people spend elixir to defend something that&amp;#39;s not worth defending, or refuse to take tower damage when it would be favorable. For instance, both you and your opponent are fighting in the left lane. Somehow, due to how they positioned their minions while defending, the minions end up flying toward your right tower. Do you zap them? Sure, that&amp;#39;s a +1 elixir advantage and saves your tower damage, but in reality, it&amp;#39;s not the tower they are attacking, so the damage on that tower is likely to be irrelevant. Often, you&amp;#39;re much better off ignoring them and taking the +3 elixir advantage. There &lt;em&gt;are&lt;/em&gt; some situations where you want to avoid that (for instance, you know you&amp;#39;ll end up trading the towers on the left and it&amp;#39;ll come down to a fight for the right towers... or your opponent has a deck that can easily switch lanes), but at least take the time to consider whether or not you need to counter them. In a similar vein, a princess is moving towards the bridge. You are fairly low on elixir. You &lt;em&gt;could&lt;/em&gt; place a knight, so that he soaks up the damage and kills the princess, but since you&amp;#39;re low on elixir, you probably can&amp;#39;t properly turn that into a counter push, so it&amp;#39;ll just end in a neutral trade. Alternatively, you could let the princess lock on your tower and place skeletons. In this case, you&amp;#39;re trading a bit of tower damage in exchange for a +2 elixir advantage &lt;em&gt;and&lt;/em&gt; you get to keep your knight for something more important.&lt;/p&gt;\n\n&lt;p&gt;On the flip side, some people are obsessed about elixir advantage. I often see comments like &amp;quot;well, if you&amp;#39;re at an elixir disadvantage, you got outplayed&amp;quot;. That&amp;#39;s simply not true. If I send a goblin barrel at my opponent&amp;#39;s tower and they ignore it, I&amp;#39;m at a -3 elixir advantage, but I did significant tower damage. In the end, what&amp;#39;s important is to be aware of how big the gap is and how much elixir you need in order to defend your opponent&amp;#39;s push. If, for instance, I know I can defend my opponent&amp;#39;s 8 elixir push with 6 elixir, then I don&amp;#39;t mind falling a bit behind, as long as I make sure that when they have 8 elixir, I have at least 6.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sometimes, the best defense is an offense&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A question that comes up a lot is &amp;quot;how do I defend against [insert huge 15 elixir push]&amp;quot;. The answer generally is &amp;quot;don&amp;#39;t let the 15 elixir push happen in the first place!&amp;quot; If you constantly put pressure on your opponent, then they have to spend elixir to defend. Elixir they spend defending is elixir they can&amp;#39;t spend on their push. If you see your opponent place a lavahound at the back, and you know your deck has a hard time defending against a lavahound + balloon push, the solution isn&amp;#39;t to wait for the push to come and cross your fingers that you&amp;#39;ll manage a miraculous defense. The solution is to immediately push the other lane. By doing so, you force them into a dilemma. Either they spend elixir defending your push, in which case they won&amp;#39;t have any left to play the balloon, or they go all in and try to race your push. Now, balloon does a lot of damage quickly, but since they started the lavahound in the back and it takes a while for it to reach bridge, let alone your tower, so you have a head start. &lt;/p&gt;\n\n&lt;p&gt;This is not a guaranteed win for you, but it &lt;em&gt;is&lt;/em&gt; going to win you games more often than hoping you can pull off the miraculous defense against a push designed to be hard to defend against. Note that this only applies if your deck is weak to lavaloon to begin with. If your deck has a super easy time defending against lavaloon (e.g., executioner + tornado), then use that, but maybe in turn your deck is weak against golem. &lt;/p&gt;\n\n&lt;p&gt;This strategy works against any strategy that intends to build a huge push behind a tank. The more you can divert their elixir away from the push, the easier it will be to manage. You might think that you&amp;#39;re wasting elixir that could be used to defend, but generally, what happens is that a small push can be countered with little elixir. A lone golem can be stopped with a single inferno tower. However, big pushes are typically composed of units that protect each other&amp;#39;s weakness, to a point where you can no longer defend at a positive or even neutral elixir trade, or worse, can&amp;#39;t defend at all. A golem with an electro-wiz that resets your inferno tower, and a knight that defends the electro wiz against melee troops, and archers that protect everyone from flying troops... you might not have enough elixir to defend against that! Don&amp;#39;t let that death ball build up!&lt;/p&gt;\n\n&lt;p&gt;-=edit=- Just a little note on having the right mindset. I know it&amp;#39;s frustrating to face over leveled people. If you face someone with a level 13 RG at 3000 trophies, you&amp;#39;re allowed to be annoyed. However, if you join a challenge or tournament without having tournament level cards, that&amp;#39;s entirely on you. I&amp;#39;m not saying that you shouldn&amp;#39;t join challenges with sub tournament level cards (well, you probably &lt;em&gt;shouldn&amp;#39;t&lt;/em&gt; join grand challenges!), but if you&amp;#39;re level 8 with level 7 commons, don&amp;#39;t start BMing people who have tournament level cards and wreck you. You knew coming in that the majority of people would have tournament level cards.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I play a lot of challenges, and the skill level of people on there varies greatly. This is to be expected, because you can face people who are in the 5k trophies, just like you can face people who only just got their deck to tournament level (or sometimes aren't yet at tournament level). Now that I am a fairly experienced player, I see mistakes that the less experience players make, which I probably didn't notice back when I was in their shoes (and likely made myself). Here are some of these mistakes I see regularly, and what you can do to fix them. This guide is aimed mostly at the less experienced players, though I do see some of those mistakes on ladder above 4k, so even if you are more experienced, you can do a mental checklist to see whether or not these apply to you.\n\n**[Edit/TL;DR]** I understand this is a lot of text, but I tried to make the section titles fairly clear, so if you want a TL;DR, just read the section titles. If you feel one might be a mistake you make, or a concept you aren't familiar with, then read the whole paragraph. If it's something you already know, then feel free to skip.\n\n**Don't repeat the same move, hoping for different results**\n\nSituation: Opponent pushes with a Giant and minions. You place an inferno tower for the giant and a musketeer for the minions. Opponent reveals they had lightning and hits your tower, inferno tower and musketeer. That sucks, but it happens. Unless you were playing against a well known meta deck, you probably couldn't guess that they had lightning. However, if the opponent builds the same push and you try to counter it with inferno tower + musketeer positioned in the exact same way, that's totally on you. It seems obvious, but I see those mistakes happening constantly.  It's understandable when you think about it. You practice a given deck a lot, you start finding patterns that work, and since you often have to react quickly, they become automatic. Still, being able to adapt is one of the most important skills you need to develop to get better. In the situation above, learn the anti-lightning positions for inferno tower, or place your musketeer far enough that the opponent can't hit both it and the i-tower. \n\n**Vary your defense**\n\nOpponent puts ebarbs at the bridge. You surround them with skarmy. Awesome, you countered ebarbs for positive elixir trade! A cycle later, opponent puts ebarbs at the bridge. Are you going to surround them with skarmy again? You probably shouldn't. Maybe you're playing against an opponent that didn't read my first mistake, but you should probably assume that your opponent is playing properly (even *if* they're playing ebarbs). You should therefore assume that the opponent is expecting skarmy and will have a log/zap ready for it. Maybe they're going to send a prediction log! You really need to vary your defense when possible. Something as simple as placing skarmy in the middle will mess with a prediction log. Or use a knight this time, since it's pretty much immune to zap/log. People will usually prepare their next push in a way that counters the defense they know you use, so varying your defense really throws a wrench in their plan. \n\nThe same is true for offense in fact. Just because a barrel placement worked well once, doesn't mean you shouldn't use a different placement next. Just because a certain push composition worked well doesn't mean they won't be prepared for it next time.\n\n**Giving up early**\n\nThis is more of a mindset issue than a skill issue, but seriously, just because you're down one tower in the first minute of the game doesn't mean you're done for. I played a game earlier today. Opponent plays golem in the back. I take this opportunity to push the other lane and it pays off, because I take his tower with little investment (ram + goblin gang). Meanwhile, his golem push deals about 800 on my tower, with me spending all my elixir to defend against it. Opponent rage quits. This is a horrible decision. Opponent saw basically all my deck at this point, because I had to use almost all of it to defend against the push. So they know what they're up against and can plan a defense to protect their other towers. They still managed to get damage on my tower on their first push of the game (this is actually fairly rare in my experience against golem decks, usually the first push is fairly easy to defend against and is more intended to probe the defense) Sure, I wasn't at full elixir, since I used some to take down his tower, but there's a lot of time left, and if I couldn't fully stop their push at normal elixir, imagine how it will be when they get to double elixir and can completely overwhelm my defense. \n\nThe game as a whole is designed to make it harder to take the second tower (well... generally, though some cards such as 3 musketeer and RG are exceptions to this), to allow come backs. Losing a tower early sucks, but it's not the end of the world. You have plenty of time left. Not only is it possible to come back, but those games where you lose the tower early, yet still manage to win are the most rewarding and most fun games. Play your games through! If nothing else, it's extra practice.\n\n**Use your towers**\n\nWhen you see a naked minion hordes coming towards your tower, what are the counters? Most people will immediately think of fireball, arrows, fire spirit, princess, etc. Less experienced players might not think of skeletons, knight or other such cards as a counter. They can't attack air, right? But your towers can. All you have to do is give your towers enough time and bring the attacking troops to the kill zone where both towers can attack them. Similarly, knight is really good at countering lava pups, just place him right in front of your tower just before the hound explodes. Most, if not all the pups will target the knight while the tower kills them one by one. You don't always need anti-air troops to deal with flying troops. \n\n**Ultimately, the game is about trading elixir for tower damage, and vice versa**\n\nThere isn't a hard rule about how much damage 1 elixir is worth. It really depends on your deck and on the situation. However, too often I see people spend elixir to defend something that's not worth defending, or refuse to take tower damage when it would be favorable. For instance, both you and your opponent are fighting in the left lane. Somehow, due to how they positioned their minions while defending, the minions end up flying toward your right tower. Do you zap them? Sure, that's a +1 elixir advantage and saves your tower damage, but in reality, it's not the tower they are attacking, so the damage on that tower is likely to be irrelevant. Often, you're much better off ignoring them and taking the +3 elixir advantage. There *are* some situations where you want to avoid that (for instance, you know you'll end up trading the towers on the left and it'll come down to a fight for the right towers... or your opponent has a deck that can easily switch lanes), but at least take the time to consider whether or not you need to counter them. In a similar vein, a princess is moving towards the bridge. You are fairly low on elixir. You *could* place a knight, so that he soaks up the damage and kills the princess, but since you're low on elixir, you probably can't properly turn that into a counter push, so it'll just end in a neutral trade. Alternatively, you could let the princess lock on your tower and place skeletons. In this case, you're trading a bit of tower damage in exchange for a +2 elixir advantage *and* you get to keep your knight for something more important.\n\nOn the flip side, some people are obsessed about elixir advantage. I often see comments like \"well, if you're at an elixir disadvantage, you got outplayed\". That's simply not true. If I send a goblin barrel at my opponent's tower and they ignore it, I'm at a -3 elixir advantage, but I did significant tower damage. In the end, what's important is to be aware of how big the gap is and how much elixir you need in order to defend your opponent's push. If, for instance, I know I can defend my opponent's 8 elixir push with 6 elixir, then I don't mind falling a bit behind, as long as I make sure that when they have 8 elixir, I have at least 6.\n\n**Sometimes, the best defense is an offense**\n\nA question that comes up a lot is \"how do I defend against [insert huge 15 elixir push]\". The answer generally is \"don't let the 15 elixir push happen in the first place!\" If you constantly put pressure on your opponent, then they have to spend elixir to defend. Elixir they spend defending is elixir they can't spend on their push. If you see your opponent place a lavahound at the back, and you know your deck has a hard time defending against a lavahound + balloon push, the solution isn't to wait for the push to come and cross your fingers that you'll manage a miraculous defense. The solution is to immediately push the other lane. By doing so, you force them into a dilemma. Either they spend elixir defending your push, in which case they won't have any left to play the balloon, or they go all in and try to race your push. Now, balloon does a lot of damage quickly, but since they started the lavahound in the back and it takes a while for it to reach bridge, let alone your tower, so you have a head start. \n\nThis is not a guaranteed win for you, but it *is* going to win you games more often than hoping you can pull off the miraculous defense against a push designed to be hard to defend against. Note that this only applies if your deck is weak to lavaloon to begin with. If your deck has a super easy time defending against lavaloon (e.g., executioner + tornado), then use that, but maybe in turn your deck is weak against golem. \n\nThis strategy works against any strategy that intends to build a huge push behind a tank. The more you can divert their elixir away from the push, the easier it will be to manage. You might think that you're wasting elixir that could be used to defend, but generally, what happens is that a small push can be countered with little elixir. A lone golem can be stopped with a single inferno tower. However, big pushes are typically composed of units that protect each other's weakness, to a point where you can no longer defend at a positive or even neutral elixir trade, or worse, can't defend at all. A golem with an electro-wiz that resets your inferno tower, and a knight that defends the electro wiz against melee troops, and archers that protect everyone from flying troops... you might not have enough elixir to defend against that! Don't let that death ball build up!\n\n-=edit=- Just a little note on having the right mindset. I know it's frustrating to face over leveled people. If you face someone with a level 13 RG at 3000 trophies, you're allowed to be annoyed. However, if you join a challenge or tournament without having tournament level cards, that's entirely on you. I'm not saying that you shouldn't join challenges with sub tournament level cards (well, you probably *shouldn't* join grand challenges!), but if you're level 8 with level 7 commons, don't start BMing people who have tournament level cards and wreck you. You knew coming in that the majority of people would have tournament level cards.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Strategy", "id": "64z3wd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 366, "report_reasons": null, "author": "Filobel", "saved": false, "mod_reports": [], "name": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "approved_by": null, "over_18": false, "domain": "self.ClashRoyale", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_3bog8", "edited": 1492014958.0, "link_flair_css_class": "", "author_flair_css_class": "Bowler", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/ClashRoyale/comments/64z3wd/strategy_common_mistakes_that_you_need_to_fix_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492042141.0, "url": "https://www.reddit.com/r/ClashRoyale/comments/64z3wd/strategy_common_mistakes_that_you_need_to_fix_in/", "author_flair_text": "", "quarantine": false, "title": "[Strategy] Common mistakes that you need to fix in order to get better", "created_utc": 1492013341.0, "distinguished": null, "media": null, "upvote_ratio": 0.98, "num_comments": 63, "visited": false, "subreddit_type": "public", "ups": 366}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6cb7m", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "The_Clash_Dude", "parent_id": "t1_dg67xh5", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "On Classic Challenges I try decks of my friends, surprising how a level 4 Valkyrie can still get 12 wins", "edited": 1492026405.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On Classic Challenges I try decks of my friends, surprising how a level 4 Valkyrie can still get 12 wins&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6cb7m", "score_hidden": false, "stickied": false, "created": 1492051705.0, "created_utc": 1492022905.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6i22d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BL4D3W4LK3R", "parent_id": "t1_dg67xh5", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Same.  Still building to tournament level cards.  Greatly prefer the classics to the ladder for consistent opponents even with underleveled cards the games are just better.  Great write up OP, I'm only 5 weeks in the game so all of those points hit home... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same.  Still building to tournament level cards.  Greatly prefer the classics to the ladder for consistent opponents even with underleveled cards the games are just better.  Great write up OP, I&amp;#39;m only 5 weeks in the game so all of those points hit home... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6i22d", "score_hidden": false, "stickied": false, "created": 1492057616.0, "created_utc": 1492028816.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg67xh5", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "Neyabenz", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Great write up. \n\nI enter classic challenges without tourney level cards and do fairly well. I expect to get wrecked sometimes. However it feels much more fair than ladder, and my skills are getting way better because of it. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great write up. &lt;/p&gt;\n\n&lt;p&gt;I enter classic challenges without tourney level cards and do fairly well. I expect to get wrecked sometimes. However it feels much more fair than ladder, and my skills are getting way better because of it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg67xh5", "score_hidden": false, "stickied": false, "created": 1492047244.0, "created_utc": 1492018444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6n5fq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lavahoundbesthound", "parent_id": "t1_dg6mj78", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "CWA is pretty good (not my type) but he always gets interviews with top players. And Np. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;CWA is pretty good (not my type) but he always gets interviews with top players. And Np. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6n5fq", "score_hidden": false, "stickied": false, "created": 1492063400.0, "created_utc": 1492034600.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg75ar4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HuecoTanks", "parent_id": "t1_dg6mj78", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "You might like my [channel](https://www.youtube.com/channel/UCN0-Zlf2HNg7B4gIvObAcfQ) . I make a video every week or so. Videos are typically 2-3 replays illustrating a deck or technique, with commentary and some notes. I'm shooting for intermediate players. If you do check it out, I'd love some feedback about what you like/don't like:-)\n\nAlso, I should totally mention EsoPa. That dude is an amazing player/teacher.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might like my &lt;a href=\"https://www.youtube.com/channel/UCN0-Zlf2HNg7B4gIvObAcfQ\"&gt;channel&lt;/a&gt; . I make a video every week or so. Videos are typically 2-3 replays illustrating a deck or technique, with commentary and some notes. I&amp;#39;m shooting for intermediate players. If you do check it out, I&amp;#39;d love some feedback about what you like/don&amp;#39;t like:-)&lt;/p&gt;\n\n&lt;p&gt;Also, I should totally mention EsoPa. That dude is an amazing player/teacher.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg75ar4", "score_hidden": false, "stickied": false, "created": 1492086749.0, "created_utc": 1492057949.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mj78", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jjcoola", "parent_id": "t1_dg6gdfy", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Will check these out, thanks for following up with the videos, I'm always looking for people who post CR videos where they actually talk about their strategy and WHY they do things, so if you have any other suggestions of ppl to sub to, please reply again! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Will check these out, thanks for following up with the videos, I&amp;#39;m always looking for people who post CR videos where they actually talk about their strategy and WHY they do things, so if you have any other suggestions of ppl to sub to, please reply again! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6mj78", "score_hidden": false, "stickied": false, "created": 1492062653.0, "created_utc": 1492033853.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gdfy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lavahoundbesthound", "parent_id": "t1_dg6fv5h", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Both these videos have amazing play and defense with the hog cycle deck.\n\nhttps://www.youtube.com/watch?v=UraIjjSRPDU \n\nhttps://www.youtube.com/watch?v=P-8RTiWBqMk", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Both these videos have amazing play and defense with the hog cycle deck.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=UraIjjSRPDU\"&gt;https://www.youtube.com/watch?v=UraIjjSRPDU&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=P-8RTiWBqMk\"&gt;https://www.youtube.com/watch?v=P-8RTiWBqMk&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6gdfy", "score_hidden": false, "stickied": false, "created": 1492055889.0, "created_utc": 1492027089.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg7ilfe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SamKouteili", "parent_id": "t1_dg73xo2", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "oh wow good shit! Definitely deserved lol congratz", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh wow good shit! Definitely deserved lol congratz&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7ilfe", "score_hidden": false, "stickied": false, "created": 1492117847.0, "created_utc": 1492089047.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73xo2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "edihau", "parent_id": "t1_dg737ea", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I received a special version of a legendary flair for strategy contributions to this sub beyond those of most legendary flair-earning people. I'm glad it's noticeable :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I received a special version of a legendary flair for strategy contributions to this sub beyond those of most legendary flair-earning people. I&amp;#39;m glad it&amp;#39;s noticeable :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg73xo2", "score_hidden": false, "stickied": false, "created": 1492084645.0, "created_utc": 1492055845.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg737ea", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SamKouteili", "parent_id": "t1_dg6fv5h", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "duud ur flair is shining lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;duud ur flair is shining lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg737ea", "score_hidden": false, "stickied": false, "created": 1492083558.0, "created_utc": 1492054758.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fv5h", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "edihau", "parent_id": "t1_dg6fg8l", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Very good! The issue, of course, comes with not being able to take the first tower because of a hard counter to the hog rider, but it's possible to pull off in some matches depending on rotations and the cards you have. Otherwise, as I said before, you might want to reconsider your deck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very good! The issue, of course, comes with not being able to take the first tower because of a hard counter to the hog rider, but it&amp;#39;s possible to pull off in some matches depending on rotations and the cards you have. Otherwise, as I said before, you might want to reconsider your deck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6fv5h", "score_hidden": false, "stickied": false, "created": 1492055378.0, "created_utc": 1492026578.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6n5zd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lavahoundbesthound", "parent_id": "t1_dg6lxc6", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "thanks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thanks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6n5zd", "score_hidden": false, "stickied": false, "created": 1492063419.0, "created_utc": 1492034619.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6lxc6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Filobel", "parent_id": "t1_dg6fg8l", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "This is pretty awesome stuff! My guide was intended to be general, and it's true that some tips and strategies may not apply to every deck. I am not very experienced playing hog cycle, so I couldn't really comment on that. Thank you for bringing some more in depth strategies to the post!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is pretty awesome stuff! My guide was intended to be general, and it&amp;#39;s true that some tips and strategies may not apply to every deck. I am not very experienced playing hog cycle, so I couldn&amp;#39;t really comment on that. Thank you for bringing some more in depth strategies to the post!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6lxc6", "score_hidden": false, "stickied": false, "created": 1492061924.0, "created_utc": 1492033124.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fg8l", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Lavahoundbesthound", "parent_id": "t1_dg6a03z", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Racing for 3 against lavaloon with hog cycle is a pretty bad idea (in the circumstances that both players are experienced). Marcel_p had an awesome video on how to defend death ball pushed with hog cycle. Essentially you have to have the mindset that the lavaloon/golem/heavy giant deck will take a tower in Double elixir. Using your own arena tower as a sacrifice defense to your king tower is the way to go. The hog player should've taken (or almost taken) 1 tower and gotten decent damage on the other. Once his push is dissembled at the king tower you have enough time to spell down and chip his towers to win in OT before his 2nd death ball push. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Racing for 3 against lavaloon with hog cycle is a pretty bad idea (in the circumstances that both players are experienced). Marcel_p had an awesome video on how to defend death ball pushed with hog cycle. Essentially you have to have the mindset that the lavaloon/golem/heavy giant deck will take a tower in Double elixir. Using your own arena tower as a sacrifice defense to your king tower is the way to go. The hog player should&amp;#39;ve taken (or almost taken) 1 tower and gotten decent damage on the other. Once his push is dissembled at the king tower you have enough time to spell down and chip his towers to win in OT before his 2nd death ball push. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6fg8l", "score_hidden": false, "stickied": false, "created": 1492054955.0, "created_utc": 1492026155.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg75e20", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HuecoTanks", "parent_id": "t1_dg6r6mz", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I just want to poke my head in here and say how much I'm enjoying this intelligent, respectful, helpful discussion:-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want to poke my head in here and say how much I&amp;#39;m enjoying this intelligent, respectful, helpful discussion:-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg75e20", "score_hidden": false, "stickied": false, "created": 1492086903.0, "created_utc": 1492058103.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6r6mz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "edihau", "parent_id": "t1_dg6nj69", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Well said. I get that this is a general guide--I just don't want to see people try something that's not going to work in a specific case, but will work in general. In my guides, I am sure to look for exceptions to all of the rules I set, because I know that not everybody has the mindset to look for exceptions to the rule first. By introducing the general theory and then listing an exception, I can make the general rule more specific--you should race for 3 only if your push can actually get 3 crowns. A simple theory, sure, but the pattern of communication works for much more complex theories, and when I see the first step without the second and third, I feel obliged to clarify things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well said. I get that this is a general guide--I just don&amp;#39;t want to see people try something that&amp;#39;s not going to work in a specific case, but will work in general. In my guides, I am sure to look for exceptions to all of the rules I set, because I know that not everybody has the mindset to look for exceptions to the rule first. By introducing the general theory and then listing an exception, I can make the general rule more specific--you should race for 3 only if your push can actually get 3 crowns. A simple theory, sure, but the pattern of communication works for much more complex theories, and when I see the first step without the second and third, I feel obliged to clarify things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6r6mz", "score_hidden": false, "stickied": false, "created": 1492068417.0, "created_utc": 1492039617.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nj69", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Filobel", "parent_id": "t1_dg6a03z", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "So, I'm definitely not an expert in hog cycle. As with most general strategies, there are situations where they don't apply, and that's where we need more focused guides. The other person who replied to you provided what appears to be a very good analysis of this specific matchup. \n\nThat said, what I'm suggesting isn't necessarily to try and race them, but to put pressure such that they feel the need to spend elixir in the other lane. For instance, as you see the lavahound played in the back, you immediately launch a hog in the other lane. If they defend against it, they did exactly what you wanted them to do. If they don't, well you get significant damage on their tower, but you didn't go all in, you can still try to defend (by the time the lavahound reaches the bridge, you're probably back to 10 elixir, and you weren't going to use hog in your defense anyway, right?)\n\nAgain, not an expert on hog cycle, maybe that's not the optimal strategy either, but it's something that works in a lot of situations. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;m definitely not an expert in hog cycle. As with most general strategies, there are situations where they don&amp;#39;t apply, and that&amp;#39;s where we need more focused guides. The other person who replied to you provided what appears to be a very good analysis of this specific matchup. &lt;/p&gt;\n\n&lt;p&gt;That said, what I&amp;#39;m suggesting isn&amp;#39;t necessarily to try and race them, but to put pressure such that they feel the need to spend elixir in the other lane. For instance, as you see the lavahound played in the back, you immediately launch a hog in the other lane. If they defend against it, they did exactly what you wanted them to do. If they don&amp;#39;t, well you get significant damage on their tower, but you didn&amp;#39;t go all in, you can still try to defend (by the time the lavahound reaches the bridge, you&amp;#39;re probably back to 10 elixir, and you weren&amp;#39;t going to use hog in your defense anyway, right?)&lt;/p&gt;\n\n&lt;p&gt;Again, not an expert on hog cycle, maybe that&amp;#39;s not the optimal strategy either, but it&amp;#39;s something that works in a lot of situations. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6nj69", "score_hidden": false, "stickied": false, "created": 1492063881.0, "created_utc": 1492035081.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a03z", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "edihau", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Great post covering some of the more basic mistakes that people still make. Forgetting these tips is all too easy when you have to put most of your focus into perfect placements and timings in micro gameplay. One counterpoint:\n\nPressuring the other lane to counter a big push is valuable, but not if you're running a hog-cycle deck against lavaloon and then they go all-in. You can't get three crowns with every win condition, and a lone hog rider at tournament standard won't even take out the first tower, and with support it still won't get 3 (meanwhile, a giant with pretty much any support will take 3 crowns quickly enough). You need to consider whether you can actually race for 3 given the cards/elixir you have right now and the cards/elixir your opponent has to counter you, because if you have cards that can't do enough damage quickly enough or will die before taking out the king's tower, playing defense the old-fashioned way is smarter. Most of the time you have an advantage on defense assuming you're at even elixir, and if you can't generate an advantage a lot of the time, you need to reconsider your deck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post covering some of the more basic mistakes that people still make. Forgetting these tips is all too easy when you have to put most of your focus into perfect placements and timings in micro gameplay. One counterpoint:&lt;/p&gt;\n\n&lt;p&gt;Pressuring the other lane to counter a big push is valuable, but not if you&amp;#39;re running a hog-cycle deck against lavaloon and then they go all-in. You can&amp;#39;t get three crowns with every win condition, and a lone hog rider at tournament standard won&amp;#39;t even take out the first tower, and with support it still won&amp;#39;t get 3 (meanwhile, a giant with pretty much any support will take 3 crowns quickly enough). You need to consider whether you can actually race for 3 given the cards/elixir you have right now and the cards/elixir your opponent has to counter you, because if you have cards that can&amp;#39;t do enough damage quickly enough or will die before taking out the king&amp;#39;s tower, playing defense the old-fashioned way is smarter. Most of the time you have an advantage on defense assuming you&amp;#39;re at even elixir, and if you can&amp;#39;t generate an advantage a lot of the time, you need to reconsider your deck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6a03z", "score_hidden": false, "stickied": false, "created": 1492049347.0, "created_utc": 1492020547.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6mmhx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jjcoola", "parent_id": "t1_dg6jflv", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Thanks so much for actually replying, I'll check your stats out when I get back from work as they block stats royale :( \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks so much for actually replying, I&amp;#39;ll check your stats out when I get back from work as they block stats royale :( &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6mmhx", "score_hidden": false, "stickied": false, "created": 1492062764.0, "created_utc": 1492033964.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg725mf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "El_Derogator", "parent_id": "t1_dg6jflv", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Nice deck and solid advice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice deck and solid advice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg725mf", "score_hidden": false, "stickied": false, "created": 1492082067.0, "created_utc": 1492053267.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jflv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Storm1220", "parent_id": "t1_dg6gcib", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Thanks, yeah I use balloon freeze deck. You can see the deck in my profile here: https://statsroyale.com/profile/RPLJLJUL\n\nUses a bunch of Commons due to levels needed to compete. My original version had musketeer instead of archers but even though musketeer was my first rare at lvl 9 (now have a couple more) I started hitting the level 10 fireball range and made the switch to archers for better consistency. \n\nDeck is good versus meta decks like RG, eBarbs, and Hog. Extremely weak to 3 musketeer decks and can struggle versus elixir collector beatdown decks.  \n\nEssentially it is a good ladder deck due to strengths of the matchups and a pretty weak challenge deck IMO.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, yeah I use balloon freeze deck. You can see the deck in my profile here: &lt;a href=\"https://statsroyale.com/profile/RPLJLJUL\"&gt;https://statsroyale.com/profile/RPLJLJUL&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Uses a bunch of Commons due to levels needed to compete. My original version had musketeer instead of archers but even though musketeer was my first rare at lvl 9 (now have a couple more) I started hitting the level 10 fireball range and made the switch to archers for better consistency. &lt;/p&gt;\n\n&lt;p&gt;Deck is good versus meta decks like RG, eBarbs, and Hog. Extremely weak to 3 musketeer decks and can struggle versus elixir collector beatdown decks.  &lt;/p&gt;\n\n&lt;p&gt;Essentially it is a good ladder deck due to strengths of the matchups and a pretty weak challenge deck IMO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6jflv", "score_hidden": false, "stickied": false, "created": 1492059064.0, "created_utc": 1492030264.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gcib", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jjcoola", "parent_id": "t1_dg6e6hc", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Great PB man, mind sharing your deck and your basic strategies, and decks it feels strong against by any chance? And maybe how you leverage your advantages? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great PB man, mind sharing your deck and your basic strategies, and decks it feels strong against by any chance? And maybe how you leverage your advantages? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6gcib", "score_hidden": false, "stickied": false, "created": 1492055862.0, "created_utc": 1492027062.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e6hc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Storm1220", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Great post. I am a leader of a 40 person clan and I have a PB of 5200 last season. Next highest in my clan has PB of 4300, I wish I could get more people in my clan to read this and understand the game better. Feels like so many of the fine details to the game beyond just card level (which I've done my share of whining about) go over their heads. I try to teach about deck building and elixir trading to get advantages and every once and a while someone has a breakthrough. The main mistakes I see are inefficient spell usage and cycle cards (especially the versatile cards such as zap, skeletons, spirits), not expecting opponent counters even though the opponent has already used them in the match, over defending - especially when they are playing an elixir collector or beatdown deck, and lack of a deck identity that focuses on winning through solid play instead of the opponent making a mistake. Anyway, mini rant over, thanks for the post - this really is quality content.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post. I am a leader of a 40 person clan and I have a PB of 5200 last season. Next highest in my clan has PB of 4300, I wish I could get more people in my clan to read this and understand the game better. Feels like so many of the fine details to the game beyond just card level (which I&amp;#39;ve done my share of whining about) go over their heads. I try to teach about deck building and elixir trading to get advantages and every once and a while someone has a breakthrough. The main mistakes I see are inefficient spell usage and cycle cards (especially the versatile cards such as zap, skeletons, spirits), not expecting opponent counters even though the opponent has already used them in the match, over defending - especially when they are playing an elixir collector or beatdown deck, and lack of a deck identity that focuses on winning through solid play instead of the opponent making a mistake. Anyway, mini rant over, thanks for the post - this really is quality content.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6e6hc", "score_hidden": false, "stickied": false, "created": 1492053650.0, "created_utc": 1492024850.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg769du", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Filobel", "parent_id": "t1_dg72mnz", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Thanks for the input! \n\nUnfortunately, electro wiz is one of the few legendaries I don't have yet, but I would certainly use it over musketeer if I did. I'll give poison a try. Knight was somewhere on my list of things to try, but didn't know what to take out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the input! &lt;/p&gt;\n\n&lt;p&gt;Unfortunately, electro wiz is one of the few legendaries I don&amp;#39;t have yet, but I would certainly use it over musketeer if I did. I&amp;#39;ll give poison a try. Knight was somewhere on my list of things to try, but didn&amp;#39;t know what to take out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg769du", "score_hidden": false, "stickied": false, "created": 1492088360.0, "created_utc": 1492059560.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg72mnz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "klew256", "parent_id": "t1_dg6mp99", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I use pekka on ladder and have really struggled to find a tourney combo that works since the collector and poison nerf. I had a deck that I won some classic challenges with, but haven't won one since. I've been tinkering with ram/pekka as well because I find the combo super fun, but haven't got past 8 or 9 wins. The majority of the deck I've been trying has been the same as yours, but I use a poison instead of zap and run electro wiz and knight instead of minions and musket. Once I run into the zap/log bait with inferno at 8 wins is when things hit the wall. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I use pekka on ladder and have really struggled to find a tourney combo that works since the collector and poison nerf. I had a deck that I won some classic challenges with, but haven&amp;#39;t won one since. I&amp;#39;ve been tinkering with ram/pekka as well because I find the combo super fun, but haven&amp;#39;t got past 8 or 9 wins. The majority of the deck I&amp;#39;ve been trying has been the same as yours, but I use a poison instead of zap and run electro wiz and knight instead of minions and musket. Once I run into the zap/log bait with inferno at 8 wins is when things hit the wall. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg72mnz", "score_hidden": false, "stickied": false, "created": 1492082727.0, "created_utc": 1492053927.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6mp99", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Filobel", "parent_id": "t1_dg6g8vk", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "So, full disclosure, the deck I am most comfortable with is spell bait (more specifically, the knight variation, though I've played the hog variation a lot as well).\n\nThat said, every now and then, I like to try new and random stuff. A particular obsession of mine, since they buffed her, is PEKKA. Every now and then, I throw something together to make PEKKA work. Then I realize she's not quite there yet and give up... until I miss playing PEKKA and try to throw something together again.\n\nFor the longest time, I thought PEKKA graveyard was the way to go, but after tweaking it non-stop, I still haven't found anything I was really happy with. Sometimes it would work amazingly, but sometimes it would just be completely shut down. \n\nSo last night I said \"fuck it, I'm trying something different\" and went for PEKKA ram instead. It's a really rough build though and I'm not entirely happy with it, but it's showing some promises. \n\nThe current build (not final in any way) is PEKKA, ram, minions, furnace, goblin gang, zap, log, musketeer­. Right now, I'm really liking the PEKKA ram combo and goblin gang really fits great as well, as a defensive card, ram support (as described above) or even just to poke the opponent and force a reaction. I know I'm not the only one, as it's seeing play in tons of decks, but I find goblin gang really good right now (maybe a bit too good). \n\nThough log is usually better than zap, in PEKKA deck, I'd rather be able to instantly kill skarmies trying to surround PEKKA. I'm playing both at the moment, but if I replace one in the future, log is the one that will go. Minions, musketeer and furnace could all be replaced. They're doing fine, but I'm not sure they're exactly the best options in their slot. The thing is, PEKKA is already very strong defensively, so you don't really need a purely defensive building. Hence using furnace, as it plays on both fronts. Sometimes though, I just run no buildings at all and it's fine as well, though weaker against Golem (PEKKA doesn't kill it fast enough) and lavaloon. Minions could also be MM, but I started with minions because I felt they would support the ram better. Musketeer is very versatile, but I'm thinking I could play something cheaper to size down a little. It's always annoying that I can't play both musketeer and PEKKA from full elixir. I might try archers.", "edited": 1492034248.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, full disclosure, the deck I am most comfortable with is spell bait (more specifically, the knight variation, though I&amp;#39;ve played the hog variation a lot as well).&lt;/p&gt;\n\n&lt;p&gt;That said, every now and then, I like to try new and random stuff. A particular obsession of mine, since they buffed her, is PEKKA. Every now and then, I throw something together to make PEKKA work. Then I realize she&amp;#39;s not quite there yet and give up... until I miss playing PEKKA and try to throw something together again.&lt;/p&gt;\n\n&lt;p&gt;For the longest time, I thought PEKKA graveyard was the way to go, but after tweaking it non-stop, I still haven&amp;#39;t found anything I was really happy with. Sometimes it would work amazingly, but sometimes it would just be completely shut down. &lt;/p&gt;\n\n&lt;p&gt;So last night I said &amp;quot;fuck it, I&amp;#39;m trying something different&amp;quot; and went for PEKKA ram instead. It&amp;#39;s a really rough build though and I&amp;#39;m not entirely happy with it, but it&amp;#39;s showing some promises. &lt;/p&gt;\n\n&lt;p&gt;The current build (not final in any way) is PEKKA, ram, minions, furnace, goblin gang, zap, log, musketeer­. Right now, I&amp;#39;m really liking the PEKKA ram combo and goblin gang really fits great as well, as a defensive card, ram support (as described above) or even just to poke the opponent and force a reaction. I know I&amp;#39;m not the only one, as it&amp;#39;s seeing play in tons of decks, but I find goblin gang really good right now (maybe a bit too good). &lt;/p&gt;\n\n&lt;p&gt;Though log is usually better than zap, in PEKKA deck, I&amp;#39;d rather be able to instantly kill skarmies trying to surround PEKKA. I&amp;#39;m playing both at the moment, but if I replace one in the future, log is the one that will go. Minions, musketeer and furnace could all be replaced. They&amp;#39;re doing fine, but I&amp;#39;m not sure they&amp;#39;re exactly the best options in their slot. The thing is, PEKKA is already very strong defensively, so you don&amp;#39;t really need a purely defensive building. Hence using furnace, as it plays on both fronts. Sometimes though, I just run no buildings at all and it&amp;#39;s fine as well, though weaker against Golem (PEKKA doesn&amp;#39;t kill it fast enough) and lavaloon. Minions could also be MM, but I started with minions because I felt they would support the ram better. Musketeer is very versatile, but I&amp;#39;m thinking I could play something cheaper to size down a little. It&amp;#39;s always annoying that I can&amp;#39;t play both musketeer and PEKKA from full elixir. I might try archers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6mp99", "score_hidden": false, "stickied": false, "created": 1492062859.0, "created_utc": 1492034059.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg72mc6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "warcrime89", "parent_id": "t1_dg6g8vk", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": " Rum Ham shared a battle ram deck that I really love.\n\nBattle Ram&gt; Executioner&gt; Bowler&gt; Pekka&gt; Tombstone&gt; Tornado&gt; Zap&gt; E-wiz\n\nThis ISNT a beatdown deck. Your main win con is a punishing ram, but your defense usually survives and you can do beastly pushes, easily shredding ebarbs and royal giant with pekka and e wiz and ram as counters to the dreaded inferno tower.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Rum Ham shared a battle ram deck that I really love.&lt;/p&gt;\n\n&lt;p&gt;Battle Ram&amp;gt; Executioner&amp;gt; Bowler&amp;gt; Pekka&amp;gt; Tombstone&amp;gt; Tornado&amp;gt; Zap&amp;gt; E-wiz&lt;/p&gt;\n\n&lt;p&gt;This ISNT a beatdown deck. Your main win con is a punishing ram, but your defense usually survives and you can do beastly pushes, easily shredding ebarbs and royal giant with pekka and e wiz and ram as counters to the dreaded inferno tower.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg72mc6", "score_hidden": false, "stickied": false, "created": 1492082714.0, "created_utc": 1492053914.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6g8vk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jjcoola", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Sucks there aren't more posts like this on this sub, fuck people who can't read for 3 minutes straight.. no need for a TL:DR seeing you have the points bolded...\n\nOP, I also am a lover of the battle ram, would you be averse to sharing your deck?  I'm not as good as you as I'm still at a low trophy level (haven't even broke 4500 yet), but love different decks and how they function and trying them. Or are you just doing Miner &gt;poison &gt;log &gt; inferno &gt; knight &gt; ram &gt; e-wiz&gt; gob gang? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sucks there aren&amp;#39;t more posts like this on this sub, fuck people who can&amp;#39;t read for 3 minutes straight.. no need for a TL:DR seeing you have the points bolded...&lt;/p&gt;\n\n&lt;p&gt;OP, I also am a lover of the battle ram, would you be averse to sharing your deck?  I&amp;#39;m not as good as you as I&amp;#39;m still at a low trophy level (haven&amp;#39;t even broke 4500 yet), but love different decks and how they function and trying them. Or are you just doing Miner &amp;gt;poison &amp;gt;log &amp;gt; inferno &amp;gt; knight &amp;gt; ram &amp;gt; e-wiz&amp;gt; gob gang? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6g8vk", "score_hidden": false, "stickied": false, "created": 1492055760.0, "created_utc": 1492026960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg7dmji", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ishy-wadee", "parent_id": "t1_dg6gair", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Yeah, sorry about that. I'm actually Dutch, but it was stupid of me to miss that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, sorry about that. I&amp;#39;m actually Dutch, but it was stupid of me to miss that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7dmji", "score_hidden": false, "stickied": false, "created": 1492107654.0, "created_utc": 1492078854.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gair", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jjcoola", "parent_id": "t1_dg699d9", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "&gt;I tried to make it clear that it's a situational thing:\n\nYou did, was very clear, though it might have been someone of English as a second language I guess. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I tried to make it clear that it&amp;#39;s a situational thing:&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You did, was very clear, though it might have been someone of English as a second language I guess. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6gair", "score_hidden": false, "stickied": false, "created": 1492055807.0, "created_utc": 1492027007.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg699d9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Filobel", "parent_id": "t1_dg693bx", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I tried to make it clear that it's a situational thing:\n\n&gt; **Often**, you're much better off ignoring them and taking the +3 elixir advantage. **There are some situations where you want to avoid that** (for instance, you know you'll end up trading the towers on the left and it'll come down to a fight for the right towers... or your opponent has a deck that can easily switch lanes), but **at least take the time to consider whether or not you need to counter them.**\n\nAlso, to be clear, I'm talking about the case where the minions are attacking the tower that was not being targeted previously by your opponent. If your opponent is playing chip cycle and already managed to deal decent damage on one tower, they are not likely to switch to the tower based solely on the damage dealt by 3 minions. And if they do, you saved a zap to deal with that.\n\nAgain, you are right, it's situational, the goal was to get less experienced player to realize that they don't *need* to defend against everything coming their way, especially when it's heading towards the least damaged tower.\n\nThat said, I appreciate your feedback! If I wasn't sufficiently clear that you need to assess the situation before letting the minions unanswered, I'll try to clarify it.", "edited": 1492020188.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tried to make it clear that it&amp;#39;s a situational thing:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Often&lt;/strong&gt;, you&amp;#39;re much better off ignoring them and taking the +3 elixir advantage. &lt;strong&gt;There are some situations where you want to avoid that&lt;/strong&gt; (for instance, you know you&amp;#39;ll end up trading the towers on the left and it&amp;#39;ll come down to a fight for the right towers... or your opponent has a deck that can easily switch lanes), but &lt;strong&gt;at least take the time to consider whether or not you need to counter them.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Also, to be clear, I&amp;#39;m talking about the case where the minions are attacking the tower that was not being targeted previously by your opponent. If your opponent is playing chip cycle and already managed to deal decent damage on one tower, they are not likely to switch to the tower based solely on the damage dealt by 3 minions. And if they do, you saved a zap to deal with that.&lt;/p&gt;\n\n&lt;p&gt;Again, you are right, it&amp;#39;s situational, the goal was to get less experienced player to realize that they don&amp;#39;t &lt;em&gt;need&lt;/em&gt; to defend against everything coming their way, especially when it&amp;#39;s heading towards the least damaged tower.&lt;/p&gt;\n\n&lt;p&gt;That said, I appreciate your feedback! If I wasn&amp;#39;t sufficiently clear that you need to assess the situation before letting the minions unanswered, I&amp;#39;ll try to clarify it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg699d9", "score_hidden": false, "stickied": false, "created": 1492048583.0, "created_utc": 1492019783.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg693bx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Ishy-wadee", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I disagree on some parts, like where you said it is better to ignore 3 minions. In these situations, you need to think whether it is worth it; there isn't a solid rule if you should let them chip away at your tower. If you are playing a chip cycle deck, definitely zap them, but if not, then maybe leave them. Trying to figure out whether to leave a troop alone is very situational.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree on some parts, like where you said it is better to ignore 3 minions. In these situations, you need to think whether it is worth it; there isn&amp;#39;t a solid rule if you should let them chip away at your tower. If you are playing a chip cycle deck, definitely zap them, but if not, then maybe leave them. Trying to figure out whether to leave a troop alone is very situational.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg693bx", "score_hidden": false, "stickied": false, "created": 1492048412.0, "created_utc": 1492019612.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6f03l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lavahoundbesthound", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Great post. These are all valid and well written points. Very easy to read too cuts the bullshit. Especially the last one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great post. These are all valid and well written points. Very easy to read too cuts the bullshit. Especially the last one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6f03l", "score_hidden": false, "stickied": false, "created": 1492054492.0, "created_utc": 1492025692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6o607", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Penguin__Assault", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "&gt; Don't repeat the same move, hoping for different results\n\nWhat are you talking about? Playing royal giant lvl 13 at the bidge works everytime /s", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Don&amp;#39;t repeat the same move, hoping for different results&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What are you talking about? Playing royal giant lvl 13 at the bidge works everytime /s&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6o607", "score_hidden": false, "stickied": false, "created": 1492064677.0, "created_utc": 1492035877.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg70bgy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "S13gfr13d", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I agree with every points you wrote, especially this: The game is about trading elixir for tower damage, and vice versa.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with every points you wrote, especially this: The game is about trading elixir for tower damage, and vice versa.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg70bgy", "score_hidden": false, "stickied": false, "created": 1492079640.0, "created_utc": 1492050840.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg74upm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FrostyTie", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Oh God thank you so much I literally said yesterday I needed something like that and you saved me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh God thank you so much I literally said yesterday I needed something like that and you saved me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg74upm", "score_hidden": false, "stickied": false, "created": 1492086032.0, "created_utc": 1492057232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6u04k", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "FenrirXx", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Great write up. One thing I would add is STOP OVERCOMMITING. That 1 hp musketeers doesn't need a giant in front of it. And no you don't need to zap that goblin gang when your pushing and was that prediction fireball really necessary? Sometimes it's better to sit back and get an even bigger elixir lead. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great write up. One thing I would add is STOP OVERCOMMITING. That 1 hp musketeers doesn&amp;#39;t need a giant in front of it. And no you don&amp;#39;t need to zap that goblin gang when your pushing and was that prediction fireball really necessary? Sometimes it&amp;#39;s better to sit back and get an even bigger elixir lead. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6u04k", "score_hidden": false, "stickied": false, "created": 1492071901.0, "created_utc": 1492043101.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6566j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "imberttt", "parent_id": "t1_dg63gkc", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "My bad you're right", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My bad you&amp;#39;re right&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6566j", "score_hidden": false, "stickied": false, "created": 1492044445.0, "created_utc": 1492015645.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63gkc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Filobel", "parent_id": "t1_dg63e2v", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "The TL;DR are basically the title of each sections.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The TL;DR are basically the title of each sections.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg63gkc", "score_hidden": false, "stickied": false, "created": 1492042662.0, "created_utc": 1492013862.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6ms5x", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "imberttt", "parent_id": "t1_dg6fzeg", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "It's for the people that don't want to read, is not about time, it's about laziness.\n\nEdit:for people that gets overwhelmed for the wall of text*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s for the people that don&amp;#39;t want to read, is not about time, it&amp;#39;s about laziness.&lt;/p&gt;\n\n&lt;p&gt;Edit:for people that gets overwhelmed for the wall of text*&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6ms5x", "score_hidden": false, "stickied": false, "created": 1492062954.0, "created_utc": 1492034154.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fzeg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jjcoola", "parent_id": "t1_dg63e2v", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "it takes like 3 minutes to read.. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it takes like 3 minutes to read.. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6fzeg", "score_hidden": false, "stickied": false, "created": 1492055496.0, "created_utc": 1492026696.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg63e2v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "imberttt", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Nice post, put TL;DR it's a huge wall of text that everybody should read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice post, put TL;DR it&amp;#39;s a huge wall of text that everybody should read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg63e2v", "score_hidden": false, "stickied": false, "created": 1492042589.0, "created_utc": 1492013789.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6pjh1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "warrior101kdn", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "tl;dr", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;tl;dr&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6pjh1", "score_hidden": false, "stickied": false, "created": 1492066367.0, "created_utc": 1492037567.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6pknr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ikizzyk", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "As a fairly experienced tournament and challenge player I can't stress how important your 5th point is. I see so many people who are all but concentrated on making positive elixir trades but can't successfully convert that elixir into tower damage.\n\nOverall great post, some really important tips here", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a fairly experienced tournament and challenge player I can&amp;#39;t stress how important your 5th point is. I see so many people who are all but concentrated on making positive elixir trades but can&amp;#39;t successfully convert that elixir into tower damage.&lt;/p&gt;\n\n&lt;p&gt;Overall great post, some really important tips here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6pknr", "score_hidden": false, "stickied": false, "created": 1492066408.0, "created_utc": 1492037608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6q9ez", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PaperPlateGal", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I can't stress enough the importance of not giving up.  Until recently, I used to rage quit if an opponent took down my tower early with me doing min damage to theirs, but since I stopped, I can't count how many games I came back and won just by sticking it thru. I esp love when they laugh after getting that early advantage then I stomp them and spam laugh haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t stress enough the importance of not giving up.  Until recently, I used to rage quit if an opponent took down my tower early with me doing min damage to theirs, but since I stopped, I can&amp;#39;t count how many games I came back and won just by sticking it thru. I esp love when they laugh after getting that early advantage then I stomp them and spam laugh haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6q9ez", "score_hidden": false, "stickied": false, "created": 1492067275.0, "created_utc": 1492038475.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6quk0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PodQwerter", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "It's amazing when you use Sparky and the opponent has an Electro Wiz. The opponent thinks this Sparky will be easy. Usually I win against Electro Wiz because of this. Yeah, the first push he stopped it with an Electro Wiz. But the second push I position cards to take out the Electro Wiz before it can do much and the opponent is left clueless.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s amazing when you use Sparky and the opponent has an Electro Wiz. The opponent thinks this Sparky will be easy. Usually I win against Electro Wiz because of this. Yeah, the first push he stopped it with an Electro Wiz. But the second push I position cards to take out the Electro Wiz before it can do much and the opponent is left clueless.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6quk0", "score_hidden": false, "stickied": false, "created": 1492068006.0, "created_utc": 1492039206.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6r0m3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ry-N0h", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "&gt; probably assume that your opponent is playing properly (even if they're playing ebarbs)\n\nhaha, great write up, upvoted!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;probably assume that your opponent is playing properly (even if they&amp;#39;re playing ebarbs)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;haha, great write up, upvoted!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6r0m3", "score_hidden": false, "stickied": false, "created": 1492068211.0, "created_utc": 1492039411.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6z09p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Halo1013", "parent_id": "t1_dg6xe2u", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "&gt; lava loon\n\n&gt; destroys most decks\n\n6/10 of the decks I face are lavaloon ;-;", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;lava loon&lt;/p&gt;\n\n&lt;p&gt;destroys most decks&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;6/10 of the decks I face are lavaloon ;-;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6z09p", "score_hidden": false, "stickied": false, "created": 1492078016.0, "created_utc": 1492049216.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xe2u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MerlinTurtle", "parent_id": "t1_dg6vjls", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "you're not wrong there, deck i'm using at the moment destroys most decks but is absolutely useless against lava loon", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you&amp;#39;re not wrong there, deck i&amp;#39;m using at the moment destroys most decks but is absolutely useless against lava loon&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6xe2u", "score_hidden": false, "stickied": false, "created": 1492075998.0, "created_utc": 1492047198.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6vjls", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_Mini_Giant", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "i disagree with the don't give up early point. there should be a quit button because sometimes you really can't win", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i disagree with the don&amp;#39;t give up early point. there should be a quit button because sometimes you really can&amp;#39;t win&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6vjls", "score_hidden": false, "stickied": false, "created": 1492073714.0, "created_utc": 1492044914.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6xm1p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MerlinTurtle", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "level 13 RG at 3000 trophies? nope!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;level 13 RG at 3000 trophies? nope!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6xm1p", "score_hidden": false, "stickied": false, "created": 1492076270.0, "created_utc": 1492047470.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg7jvwu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Filobel", "parent_id": "t1_dg7j6xg", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "It's definitely not fool proof, but when the alternative is to try and defend a 15 elixir push with 10 elixir, I'll take my chances. It obviously depends on your decks capability to defend the push as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s definitely not fool proof, but when the alternative is to try and defend a 15 elixir push with 10 elixir, I&amp;#39;ll take my chances. It obviously depends on your decks capability to defend the push as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7jvwu", "score_hidden": false, "stickied": false, "created": 1492119629.0, "created_utc": 1492090829.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7j6xg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TeleriaX", "parent_id": "t1_dg764oj", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Or the enemy will drop log + skeletons and will have the elixir to play the balloon and three crown you. Pushing the opposite lane CAN give you an advantage. But there is also a huge chance that the enemy will sacrifice one tower, or gain a high elixir advantage by defending smartly. When you said Knight + Barrel using log and minions to counter it isnt played smartly. Minions would be enough to defend with minimal tower damage, therefore he would have enough elixir to do his actual push he planned for. And you are on very low elixir to defend with. \nBut to be honest, i like those \"push the other lane\" tips, because that gets me easy wins more than i lose through this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Or the enemy will drop log + skeletons and will have the elixir to play the balloon and three crown you. Pushing the opposite lane CAN give you an advantage. But there is also a huge chance that the enemy will sacrifice one tower, or gain a high elixir advantage by defending smartly. When you said Knight + Barrel using log and minions to counter it isnt played smartly. Minions would be enough to defend with minimal tower damage, therefore he would have enough elixir to do his actual push he planned for. And you are on very low elixir to defend with. \nBut to be honest, i like those &amp;quot;push the other lane&amp;quot; tips, because that gets me easy wins more than i lose through this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7j6xg", "score_hidden": false, "stickied": false, "created": 1492118698.0, "created_utc": 1492089898.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg764oj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Filobel", "parent_id": "t1_dg6y09z", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "&gt; Your opponent probably isn't going to spend the same amount of elixir that you invested into a quick push. The situation changes 30 sec later where you only have 6 elixir to defend a 16 elixir push.\n\nThe point is that if they spend elixir to defend against your push, then they won't be able to build a 16 elixir push. \n\nFor instance. Opponent plays a lavahound in the back. I send a knight + barrel. They use log to deal with my barrel, let the elixir accumulate enough to play minions to kill the knight. Sure, they're +1 elixir and I barely dealt damage (if any), but now they don't have the elixir to play the balloon, so I can just drop an inferno tower and melt the naked hound.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Your opponent probably isn&amp;#39;t going to spend the same amount of elixir that you invested into a quick push. The situation changes 30 sec later where you only have 6 elixir to defend a 16 elixir push.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The point is that if they spend elixir to defend against your push, then they won&amp;#39;t be able to build a 16 elixir push. &lt;/p&gt;\n\n&lt;p&gt;For instance. Opponent plays a lavahound in the back. I send a knight + barrel. They use log to deal with my barrel, let the elixir accumulate enough to play minions to kill the knight. Sure, they&amp;#39;re +1 elixir and I barely dealt damage (if any), but now they don&amp;#39;t have the elixir to play the balloon, so I can just drop an inferno tower and melt the naked hound.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg764oj", "score_hidden": false, "stickied": false, "created": 1492088140.0, "created_utc": 1492059340.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6y09z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GyroBallMetagross", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I find that a very underrated way to deal with a push you can't stop from a bad rotation (for example Lava-loon and your electro wizard gets lightninged, or frontal royal giant + wizard) is to rush the other lane and attempt to trade towers. This can change a very poor defense into a tower exchange which, to be honest, is a pretty spectacular defense. If your opponent plays stuff like Lava+loon+lightning (7+5+6), they probably won't have even a drop of elixir to counter a hog or miner push on EITHER side of the map\n\nThis is a bit different from rushing right when your opponent makes an elixir deposit via LH, Pump, Golem, etc because if they're down on elixir, they won't have as much to defend. A common mistake (I like to classify, especially against beatdown decks), is to pressure the opposing lane, but not deal enough damage to justify the push anyways. Your opponent probably isn't going to spend the same amount of elixir that you invested into a quick push. The situation changes 30 sec later where you only have 6 elixir to defend a 16 elixir push.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I find that a very underrated way to deal with a push you can&amp;#39;t stop from a bad rotation (for example Lava-loon and your electro wizard gets lightninged, or frontal royal giant + wizard) is to rush the other lane and attempt to trade towers. This can change a very poor defense into a tower exchange which, to be honest, is a pretty spectacular defense. If your opponent plays stuff like Lava+loon+lightning (7+5+6), they probably won&amp;#39;t have even a drop of elixir to counter a hog or miner push on EITHER side of the map&lt;/p&gt;\n\n&lt;p&gt;This is a bit different from rushing right when your opponent makes an elixir deposit via LH, Pump, Golem, etc because if they&amp;#39;re down on elixir, they won&amp;#39;t have as much to defend. A common mistake (I like to classify, especially against beatdown decks), is to pressure the opposing lane, but not deal enough damage to justify the push anyways. Your opponent probably isn&amp;#39;t going to spend the same amount of elixir that you invested into a quick push. The situation changes 30 sec later where you only have 6 elixir to defend a 16 elixir push.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6y09z", "score_hidden": false, "stickied": false, "created": 1492076758.0, "created_utc": 1492047958.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg77om6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AlohaZukunsik", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Fantastic post, really in-depth and I'm sure will help me a lot. The only thing that I probably won't try to do know is the who 'push the other lane' thing, as my deck is actually suited to out-defending huge beatdown deck and then counterpushing with a win condition. But anyway, thanks very much for the write-up!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fantastic post, really in-depth and I&amp;#39;m sure will help me a lot. The only thing that I probably won&amp;#39;t try to do know is the who &amp;#39;push the other lane&amp;#39; thing, as my deck is actually suited to out-defending huge beatdown deck and then counterpushing with a win condition. But anyway, thanks very much for the write-up!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg77om6", "score_hidden": false, "stickied": false, "created": 1492091125.0, "created_utc": 1492062325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg7jakb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TeleriaX", "parent_id": "t1_dg781f3", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Dont let the side undeffended. Just try to counter it in a cheap way. Like it´s acceptable to get some tower damage as long as the enemy used more elixir to attack than you used to defend with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dont let the side undeffended. Just try to counter it in a cheap way. Like it´s acceptable to get some tower damage as long as the enemy used more elixir to attack than you used to defend with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7jakb", "score_hidden": false, "stickied": false, "created": 1492118835.0, "created_utc": 1492090035.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg781f3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "evanthebouncy", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "so... if I'm doing lavaloon (hypothetically I don't have them) and opponent attack different side, should I just suck it up and hope for a 3 crown and go for the all-in?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;so... if I&amp;#39;m doing lavaloon (hypothetically I don&amp;#39;t have them) and opponent attack different side, should I just suck it up and hope for a 3 crown and go for the all-in?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg781f3", "score_hidden": false, "stickied": false, "created": 1492091908.0, "created_utc": 1492063108.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg7dtfq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HZCZhao", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "I always give up early since I play a siege deck. Even if I am able to get a tower, there's no way I'm getting the 2nd one", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always give up early since I play a siege deck. Even if I am able to get a tower, there&amp;#39;s no way I&amp;#39;m getting the 2nd one&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7dtfq", "score_hidden": false, "stickied": false, "created": 1492108216.0, "created_utc": 1492079416.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg7gc7x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SkepticalGerm", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Great read, but people ignoring minions is one of the reasons I keep freeze in my deck hehehe. You wouldn't believe how many towers I've taken down over 50% with minions and freeze because the other person is trying to save elixir. They usually end up rushing to use something to defend their tower but by then it's already too late and their elixir is wasted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great read, but people ignoring minions is one of the reasons I keep freeze in my deck hehehe. You wouldn&amp;#39;t believe how many towers I&amp;#39;ve taken down over 50% with minions and freeze because the other person is trying to save elixir. They usually end up rushing to use something to defend their tower but by then it&amp;#39;s already too late and their elixir is wasted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7gc7x", "score_hidden": false, "stickied": false, "created": 1492114169.0, "created_utc": 1492085369.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg7hork", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "The_casle", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Usually the overleveled players are down there for a reason", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Usually the overleveled players are down there for a reason&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7hork", "score_hidden": false, "stickied": false, "created": 1492116473.0, "created_utc": 1492087673.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg7qxir", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Monkey3ars", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Very well written and thought out. Thanks for the eye opener!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very well written and thought out. Thanks for the eye opener!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg7qxir", "score_hidden": false, "stickied": false, "created": 1492127723.0, "created_utc": 1492098923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_3bog8", "removal_reason": null, "link_id": "t3_64z3wd", "likes": null, "replies": "", "user_reports": [], "id": "dg6lp12", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Illegal_Bubble", "parent_id": "t3_64z3wd", "subreddit_name_prefixed": "r/ClashRoyale", "controversiality": 0, "body": "Very good, much upvote needed, but....\n\n^^^^You ^^^^forgot ^^^^to ^^^^say ^^^^stop ^^^^using ^^^^RGG ^^^^and ^^^^Elite ^^^^Barbarians...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very good, much upvote needed, but....&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;You&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;forgot&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;to&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;say&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;stop&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;using&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;RGG&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;and&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;Elite&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt; &lt;sup&gt;&lt;sup&gt;&lt;sup&gt;&lt;sup&gt;Barbarians...&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "ClashRoyale", "name": "t1_dg6lp12", "score_hidden": false, "stickied": false, "created": 1492061651.0, "created_utc": 1492032851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]