[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "harrypotter", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I was doing a bit of re-reading of Order of Phoenix ahead of upcoming piece of art and when it got to the duel at the ministry I began to wonder what the Department of Mysteries actually do.&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;ve got a spinning rules of doors for a start, so it&amp;#39;s obviously an attempt to guard something. First we have the locked door that has definitely got some strong charms on it seeing as though it melts Harry&amp;#39;s charmed knife. So they&amp;#39;re definitely keeping something weird behind that door.&lt;/p&gt;\n\n&lt;p&gt;Then we have the weird room with the brains in the liquid. Why on earth would you want to keep brains in a jar? What are they doing with them? The brains are obviously sentient seeing as though they grab a hold of Ron when he summons one. And there are more doors in here, leading us to wonder how big the department is. &lt;/p&gt;\n\n&lt;p&gt;As they progress the gang come upon the room with the arch. Now there are numerous theories I&amp;#39;m sure about what that veil is. I personally think that it could be made from the same stone as the resurrection stone or perhaps it is enchanted with the same spell. Whatever it is, it definitely has links to hearing the voices of people that you have seen die. Harry can hear multiple voices in the room, presumably his mum and dad, Cedric, as well as possibly the caretaker that is killed at the start of Goblet of Fire. Neville can also hear a voice, presumably his uncle, while it can be assumed that Luna can hear her mother&amp;#39;s voice. None of the others can hear it and have to pull them away from it. So any theories on the veil?&lt;/p&gt;\n\n&lt;p&gt;They encounter a room full of time turners but I think that&amp;#39;s quite self explanatory, and that they are the ones who make them using the giant hourglass. Then again, where did that come from?&lt;/p&gt;\n\n&lt;p&gt;We know that Luna, Ginny and Ron encounter a room that&amp;#39;s full of darkness and planets and Luna said that they were floating around in the dark for quite a while. One of the planets blows up in Ron&amp;#39;s face leaving him a bit funny (leading to the incident with the brain). What&amp;#39;s the purpose of this room?&lt;/p&gt;\n\n&lt;p&gt;Then finally we have the prophecy room. Why are they keeping them all? How many are there? Surely not all of them are still relevant any more so what&amp;#39;s the point of having them? Do they study them and try and prevent them from happening or do they just let it happen? And what is the magic behind prophecies anyway? Is it all just a bit of guesswork? We&amp;#39;ve seen Trelawney make several prophecies but she doesn&amp;#39;t seem the most stable of folks at the best of times.&lt;/p&gt;\n\n&lt;p&gt;So overall what do you guys think? What do you think the department are doing and do you think it&amp;#39;s morally okay?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I was doing a bit of re-reading of Order of Phoenix ahead of upcoming piece of art and when it got to the duel at the ministry I began to wonder what the Department of Mysteries actually do.\n\nThey've got a spinning rules of doors for a start, so it's obviously an attempt to guard something. First we have the locked door that has definitely got some strong charms on it seeing as though it melts Harry's charmed knife. So they're definitely keeping something weird behind that door.\n\nThen we have the weird room with the brains in the liquid. Why on earth would you want to keep brains in a jar? What are they doing with them? The brains are obviously sentient seeing as though they grab a hold of Ron when he summons one. And there are more doors in here, leading us to wonder how big the department is. \n\nAs they progress the gang come upon the room with the arch. Now there are numerous theories I'm sure about what that veil is. I personally think that it could be made from the same stone as the resurrection stone or perhaps it is enchanted with the same spell. Whatever it is, it definitely has links to hearing the voices of people that you have seen die. Harry can hear multiple voices in the room, presumably his mum and dad, Cedric, as well as possibly the caretaker that is killed at the start of Goblet of Fire. Neville can also hear a voice, presumably his uncle, while it can be assumed that Luna can hear her mother's voice. None of the others can hear it and have to pull them away from it. So any theories on the veil?\n\nThey encounter a room full of time turners but I think that's quite self explanatory, and that they are the ones who make them using the giant hourglass. Then again, where did that come from?\n\nWe know that Luna, Ginny and Ron encounter a room that's full of darkness and planets and Luna said that they were floating around in the dark for quite a while. One of the planets blows up in Ron's face leaving him a bit funny (leading to the incident with the brain). What's the purpose of this room?\n\nThen finally we have the prophecy room. Why are they keeping them all? How many are there? Surely not all of them are still relevant any more so what's the point of having them? Do they study them and try and prevent them from happening or do they just let it happen? And what is the magic behind prophecies anyway? Is it all just a bit of guesswork? We've seen Trelawney make several prophecies but she doesn't seem the most stable of folks at the best of times.\n\nSo overall what do you guys think? What do you think the department are doing and do you think it's morally okay?\n\n\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "65uxs5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "PeteDS", "saved": false, "mod_reports": [], "name": "t3_65uxs5", "subreddit_name_prefixed": "r/harrypotter", "approved_by": null, "over_18": false, "domain": "self.harrypotter", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qiqi", "edited": false, "link_flair_css_class": "media", "author_flair_css_class": "RV", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/harrypotter/comments/65uxs5/the_department_of_mysteries/", "num_reports": null, "locked": false, "stickied": false, "created": 1492456622.0, "url": "https://www.reddit.com/r/harrypotter/comments/65uxs5/the_department_of_mysteries/", "author_flair_text": "", "quarantine": false, "title": "The Department of Mysteries", "created_utc": 1492427822.0, "distinguished": null, "media": null, "upvote_ratio": 0.85, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": "", "user_reports": [], "id": "dgdtigz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AStudyinBlueBoxes", "parent_id": "t1_dgdm7au", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "I love that room, whatever it is :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love that room, whatever it is :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgdtigz", "score_hidden": false, "stickied": false, "created": 1492479689.0, "created_utc": 1492450889.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": "", "user_reports": [], "id": "dge0zrm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sarahspangles", "parent_id": "t1_dgdm7au", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "The planet room is intriguing, the planets have specific meanings in astrology (see [wikipedia](https://en.wikipedia.org/wiki/Planets_in_astrology) ) When I read this bit, about Ron giggling, it made me think of Holst's orchestral Planet Suite, where Jupiter is Bringer of Jollity - but I never followed through with a theory of what happened to Ron because I wanted to read on!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The planet room is intriguing, the planets have specific meanings in astrology (see &lt;a href=\"https://en.wikipedia.org/wiki/Planets_in_astrology\"&gt;wikipedia&lt;/a&gt; ) When I read this bit, about Ron giggling, it made me think of Holst&amp;#39;s orchestral Planet Suite, where Jupiter is Bringer of Jollity - but I never followed through with a theory of what happened to Ron because I wanted to read on!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dge0zrm", "score_hidden": false, "stickied": false, "created": 1492488098.0, "created_utc": 1492459298.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdm7au", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "clobberellabeatsyoup", "parent_id": "t1_dgdjowm", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "What a great comment!  I think you're absolutely on point with what the Department of Mysteries is all about.\n\nThe planet room is still puzzling, though.  It makes me think that it may have been a study of the void, or of creation, or a magical simulation of how the universe began.  Ron's fugue might have been all those potent forces acting on him instead of the planet after its explosion.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a great comment!  I think you&amp;#39;re absolutely on point with what the Department of Mysteries is all about.&lt;/p&gt;\n\n&lt;p&gt;The planet room is still puzzling, though.  It makes me think that it may have been a study of the void, or of creation, or a magical simulation of how the universe began.  Ron&amp;#39;s fugue might have been all those potent forces acting on him instead of the planet after its explosion.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgdm7au", "score_hidden": false, "stickied": false, "created": 1492471471.0, "created_utc": 1492442671.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": "", "user_reports": [], "id": "dge9bs9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bisonburgers", "parent_id": "t1_dgdjowm", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "Absolutely fantastic response. I've never put as much thought into the thought room, and yet everything you say is so in line with how I see magic, I wonder how I never made the connection quite the same way you have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Absolutely fantastic response. I&amp;#39;ve never put as much thought into the thought room, and yet everything you say is so in line with how I see magic, I wonder how I never made the connection quite the same way you have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dge9bs9", "score_hidden": false, "stickied": false, "created": 1492498073.0, "created_utc": 1492469273.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdjowm", "gilded": 0, "archived": false, "score": 54, "report_reasons": null, "author": "SandBook", "parent_id": "t3_65uxs5", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "Do you remember the first thing Harry was taught about magic once he arrived at Hogwarts? He was Sorted, then they had the Welcome Feast and then... Dumbledore asked them to sing the school song. Afterwards he says about it: *\"“Ah, music,” he said, wiping his eyes. “A magic beyond all we do here! And now, bedtime. Off you trot!”\"*. \n\nJ.K.Rowling repeatedly makes a point throughout her books that spells and incantations are just one area of magic and perhaps the weakest one. Truly great magic does not involve saying silly words or even a wand. Certain acts, even certain *intentions* (so basically what you're thinking and/or feeling), carry a magical power. Think of Lilly's sacrifice - she didn't cast a spell to protect Harry. But her willingness to sacrifice her life to save him created a powerful magical protection, strong enough to counteract a Killing Curse.\n\nThroughout the books, Harry discovers more and more types of magic which don't rely on spells. He even thinks in the Deathly Hallows: *\"As certainly as he had known that the doe was benign, he knew that Ron had to be the one to wield the sword. Dumbledore had at least taught Harry something about certain kinds of magic, of the incalculable power of certain acts.\"*\n\nTo answer one of your questions. What is guarded behind the locked door in the Department of Mysteries? Dumbledore explains it at the end of the Order of the Phoenix: *\"“There is a room in the Department of Mysteries,” interrupted Dumbledore, “that is kept locked at all times. It contains a force that is at once more wonderful and more terrible than death, than human intelligence, than forces of nature. It is also, perhaps, the most mysterious of the many subjects for study that reside there. It is the power held within that room that you possess in such quantities and which Voldemort has not at all. That power took you to save Sirius tonight. That power also saved you from possession by Voldemort, because he could not bear to reside in a body so full of the force he detests. In the end, it mattered not that you could not close your mind. It was your heart that saved you.”\"*\n\nThe Department of Mysteries researches the areas of magic which are not connected to spells. There is a room where they study death (the one with the Veil), human intelligence (the one with the brains), time (the area with the time turners, from which you could also access the Hall of Prophecy), and love (the locked room) among other things. The rooms seem to contain powerful magical artefacts which are connected to the different mysterious \"non-spell\" areas of magic. Like the prophecies - there seem to be no hard rules about how to foresee the future (as McGonagall tells Hermione in her third year), instead, some people seem to randomly just *know* what is going to happen. What does that tell us about the nature of time? How do the magical prophetic powers of people like Trelawney work? We don't have answers, but the people in the Department of Mysteries are obviously working on finding them.\n\nSince I'm a Ravenclaw, I found the room studying human intelligence the most interesting, for two reasons. Firstly, we know that one's intent, one's thoughts, are extremely important when it comes to magic. Students have to concentrate to make spells work, Harry has to think of a good memory to summon a Patronus, Lily's and later Harry's intent to die to save others resulted in a magical protection. Secondly, there is this interesting sentence about the damage done to Ron by the brains: *\"There were still deep welts on his forearms where the brain’s tentacles had wrapped around him. According to Madam Pomfrey, thoughts could leave deeper scarring than almost anything else, though since she had started applying copious amounts of Dr. Ubbly’s Oblivious Unction, there seemed to be some improvement.\"* It seems thoughts have some interesting magical properties, and I'm really curious about them.\n\nAs for the room studying death, the only explanation we get is from Nearly Headless Nick: *\"Nearly Headless Nick hesitated, then said, “Not everyone can come back as a ghost.” “What d’you mean?” said Harry quickly. “Only … only wizards.” [...] “I was afraid of death,” said Nick. “I chose to remain behind. I sometimes wonder whether I oughtn’t to have … Well, that is neither here nor there. … In fact, I am neither here nor there. …” He gave a small sad chuckle. “I know nothing of the secrets of death, Harry, for I chose my feeble imitation of life instead. I believe learned wizards study the matter in the Department of Mysteries —”\"* \n\nSo yeah, that's what that place is. A place to study magic, not the magic taught at Hogwarts, but the more mysterious one, which is tied to human souls, thoughts and actions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you remember the first thing Harry was taught about magic once he arrived at Hogwarts? He was Sorted, then they had the Welcome Feast and then... Dumbledore asked them to sing the school song. Afterwards he says about it: &lt;em&gt;&amp;quot;“Ah, music,” he said, wiping his eyes. “A magic beyond all we do here! And now, bedtime. Off you trot!”&amp;quot;&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;J.K.Rowling repeatedly makes a point throughout her books that spells and incantations are just one area of magic and perhaps the weakest one. Truly great magic does not involve saying silly words or even a wand. Certain acts, even certain &lt;em&gt;intentions&lt;/em&gt; (so basically what you&amp;#39;re thinking and/or feeling), carry a magical power. Think of Lilly&amp;#39;s sacrifice - she didn&amp;#39;t cast a spell to protect Harry. But her willingness to sacrifice her life to save him created a powerful magical protection, strong enough to counteract a Killing Curse.&lt;/p&gt;\n\n&lt;p&gt;Throughout the books, Harry discovers more and more types of magic which don&amp;#39;t rely on spells. He even thinks in the Deathly Hallows: &lt;em&gt;&amp;quot;As certainly as he had known that the doe was benign, he knew that Ron had to be the one to wield the sword. Dumbledore had at least taught Harry something about certain kinds of magic, of the incalculable power of certain acts.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;To answer one of your questions. What is guarded behind the locked door in the Department of Mysteries? Dumbledore explains it at the end of the Order of the Phoenix: &lt;em&gt;&amp;quot;“There is a room in the Department of Mysteries,” interrupted Dumbledore, “that is kept locked at all times. It contains a force that is at once more wonderful and more terrible than death, than human intelligence, than forces of nature. It is also, perhaps, the most mysterious of the many subjects for study that reside there. It is the power held within that room that you possess in such quantities and which Voldemort has not at all. That power took you to save Sirius tonight. That power also saved you from possession by Voldemort, because he could not bear to reside in a body so full of the force he detests. In the end, it mattered not that you could not close your mind. It was your heart that saved you.”&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The Department of Mysteries researches the areas of magic which are not connected to spells. There is a room where they study death (the one with the Veil), human intelligence (the one with the brains), time (the area with the time turners, from which you could also access the Hall of Prophecy), and love (the locked room) among other things. The rooms seem to contain powerful magical artefacts which are connected to the different mysterious &amp;quot;non-spell&amp;quot; areas of magic. Like the prophecies - there seem to be no hard rules about how to foresee the future (as McGonagall tells Hermione in her third year), instead, some people seem to randomly just &lt;em&gt;know&lt;/em&gt; what is going to happen. What does that tell us about the nature of time? How do the magical prophetic powers of people like Trelawney work? We don&amp;#39;t have answers, but the people in the Department of Mysteries are obviously working on finding them.&lt;/p&gt;\n\n&lt;p&gt;Since I&amp;#39;m a Ravenclaw, I found the room studying human intelligence the most interesting, for two reasons. Firstly, we know that one&amp;#39;s intent, one&amp;#39;s thoughts, are extremely important when it comes to magic. Students have to concentrate to make spells work, Harry has to think of a good memory to summon a Patronus, Lily&amp;#39;s and later Harry&amp;#39;s intent to die to save others resulted in a magical protection. Secondly, there is this interesting sentence about the damage done to Ron by the brains: &lt;em&gt;&amp;quot;There were still deep welts on his forearms where the brain’s tentacles had wrapped around him. According to Madam Pomfrey, thoughts could leave deeper scarring than almost anything else, though since she had started applying copious amounts of Dr. Ubbly’s Oblivious Unction, there seemed to be some improvement.&amp;quot;&lt;/em&gt; It seems thoughts have some interesting magical properties, and I&amp;#39;m really curious about them.&lt;/p&gt;\n\n&lt;p&gt;As for the room studying death, the only explanation we get is from Nearly Headless Nick: &lt;em&gt;&amp;quot;Nearly Headless Nick hesitated, then said, “Not everyone can come back as a ghost.” “What d’you mean?” said Harry quickly. “Only … only wizards.” [...] “I was afraid of death,” said Nick. “I chose to remain behind. I sometimes wonder whether I oughtn’t to have … Well, that is neither here nor there. … In fact, I am neither here nor there. …” He gave a small sad chuckle. “I know nothing of the secrets of death, Harry, for I chose my feeble imitation of life instead. I believe learned wizards study the matter in the Department of Mysteries —”&amp;quot;&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;So yeah, that&amp;#39;s what that place is. A place to study magic, not the magic taught at Hogwarts, but the more mysterious one, which is tied to human souls, thoughts and actions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgdjowm", "score_hidden": false, "stickied": false, "created": 1492468330.0, "created_utc": 1492439530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 54}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": "", "user_reports": [], "id": "dgdf8sl", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "theonlydjorkaeff1", "parent_id": "t3_65uxs5", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "I guess it's an experimental place where they test the limits of magic, just as muggles test the limits of science in laboratories and places like Area 51 ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess it&amp;#39;s an experimental place where they test the limits of magic, just as muggles test the limits of science in laboratories and places like Area 51 &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgdf8sl", "score_hidden": false, "stickied": false, "created": 1492461289.0, "created_utc": 1492432489.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": "", "user_reports": [], "id": "dgddfx5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "PeteDS", "parent_id": "t1_dgddd33", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "Ahhh yeah! I'd never thought of it that way! That makes a lot of sense now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahhh yeah! I&amp;#39;d never thought of it that way! That makes a lot of sense now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgddfx5", "score_hidden": false, "stickied": false, "created": 1492457245.0, "created_utc": 1492428445.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgddd33", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "RaRaRavenclaw", "parent_id": "t3_65uxs5", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "Just talking about why they keep them, why wouldn't you? They're prophecies. That's like saying \"why keep books written hundreds of years ago?\"", "edited": 1492428520.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just talking about why they keep them, why wouldn&amp;#39;t you? They&amp;#39;re prophecies. That&amp;#39;s like saying &amp;quot;why keep books written hundreds of years ago?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgddd33", "score_hidden": false, "stickied": false, "created": 1492457044.0, "created_utc": 1492428244.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": "", "user_reports": [], "id": "dge1dz5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "omnifeathers", "parent_id": "t1_dge0lun", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "Depends on your own morals. I think a person has a right to do what they want with their life but can also understand how other see it as selfish as it has an irreversible impact on the loved ones they leave behind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depends on your own morals. I think a person has a right to do what they want with their life but can also understand how other see it as selfish as it has an irreversible impact on the loved ones they leave behind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dge1dz5", "score_hidden": false, "stickied": false, "created": 1492488544.0, "created_utc": 1492459744.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge0lun", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sarahspangles", "parent_id": "t1_dgdp9ke", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "&gt; It's also immensely dangerous because can you imagine if a suicidal person knew of its whereabouts\n\nBut they are just choosing to step into an afterlife - so is it a problem?\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s also immensely dangerous because can you imagine if a suicidal person knew of its whereabouts&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But they are just choosing to step into an afterlife - so is it a problem?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dge0lun", "score_hidden": false, "stickied": false, "created": 1492487662.0, "created_utc": 1492458862.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdp9ke", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "omnifeathers", "parent_id": "t3_65uxs5", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "The Veil remains one of the most interesting magical items for me. It's really like a portal or barrier between realms or dimensions which is huge. Maybe the M.O.M. was studying it to try and see if there was a way to make it a two-way door instead of a one-way. \n\nIt's also immensely dangerous because can you imagine if a suicidal person knew of it's whereabouts? What easier and painless way is there to die than just walking through a veil?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Veil remains one of the most interesting magical items for me. It&amp;#39;s really like a portal or barrier between realms or dimensions which is huge. Maybe the M.O.M. was studying it to try and see if there was a way to make it a two-way door instead of a one-way. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also immensely dangerous because can you imagine if a suicidal person knew of it&amp;#39;s whereabouts? What easier and painless way is there to die than just walking through a veil?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgdp9ke", "score_hidden": false, "stickied": false, "created": 1492474978.0, "created_utc": 1492446178.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": "", "user_reports": [], "id": "dgdir6g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AStudyinBlueBoxes", "parent_id": "t3_65uxs5", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "I invented more rooms for things like hate, wealth, or life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I invented more rooms for things like hate, wealth, or life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgdir6g", "score_hidden": false, "stickied": false, "created": 1492467044.0, "created_utc": 1492438244.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qiqi", "removal_reason": null, "link_id": "t3_65uxs5", "likes": null, "replies": "", "user_reports": [], "id": "dgedc28", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Homeless_Gandhi", "parent_id": "t3_65uxs5", "subreddit_name_prefixed": "r/harrypotter", "controversiality": 0, "body": "I think the department of mysteries is more a warehouse of things that the magical world doesn't understand. It is sort of presented as a department which experiments and creates things, but I'm left feeling it's more like they found it all. Now, they're trying to figure out what it is that they've found. This interpretation allows for the sudden appearance of, say, a giant hourglass filled with sand which turns back time. You don't have to explain where it came from, you just have to explain how they found out what it did. After all, it's not the department of research, it's the department of mysteries. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the department of mysteries is more a warehouse of things that the magical world doesn&amp;#39;t understand. It is sort of presented as a department which experiments and creates things, but I&amp;#39;m left feeling it&amp;#39;s more like they found it all. Now, they&amp;#39;re trying to figure out what it is that they&amp;#39;ve found. This interpretation allows for the sudden appearance of, say, a giant hourglass filled with sand which turns back time. You don&amp;#39;t have to explain where it came from, you just have to explain how they found out what it did. After all, it&amp;#39;s not the department of research, it&amp;#39;s the department of mysteries. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "harrypotter", "name": "t1_dgedc28", "score_hidden": false, "stickied": false, "created": 1492503266.0, "created_utc": 1492474466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]