[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Filmmakers", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi guys, could I get some honest feedback on my new venture, &lt;a href=\"https://vimsy.co\"&gt;Vimsy&lt;/a&gt;?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s an online service that brings your videos from YouTube, Vimeo and Wistia together in one central, branded &amp;quot;channel&amp;quot; for you to sell on a one-off or subscription basis, or share with a closed user group (e.g. Training videos). In essence, you can create your own equivalent of Netflix or Amazon Prime for your topic of interest, business or organisation.&lt;/p&gt;\n\n&lt;p&gt;Any and all feedback is hugely appreciated. Thanks in advance!&lt;/p&gt;\n\n&lt;p&gt;(P.S. My primary profession is corporate filmmaker!)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi guys, could I get some honest feedback on my new venture, [Vimsy](https://vimsy.co)?\n\nIt's an online service that brings your videos from YouTube, Vimeo and Wistia together in one central, branded \"channel\" for you to sell on a one-off or subscription basis, or share with a closed user group (e.g. Training videos). In essence, you can create your own equivalent of Netflix or Amazon Prime for your topic of interest, business or organisation.\n\nAny and all feedback is hugely appreciated. Thanks in advance!\n\n(P.S. My primary profession is corporate filmmaker!)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Request", "id": "651c5e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "rowanjohnson", "saved": false, "mod_reports": [], "name": "t3_651c5e", "subreddit_name_prefixed": "r/Filmmakers", "approved_by": null, "over_18": false, "domain": "self.Filmmakers", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2r1ip", "edited": false, "link_flair_css_class": "red", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Filmmakers/comments/651c5e/feedback_on_my_new_venture_vimsy/", "num_reports": null, "locked": false, "stickied": false, "created": 1492063170.0, "url": "https://www.reddit.com/r/Filmmakers/comments/651c5e/feedback_on_my_new_venture_vimsy/", "author_flair_text": null, "quarantine": false, "title": "Feedback on my new venture, Vimsy", "created_utc": 1492034370.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": "", "user_reports": [], "id": "dgdh1ab", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brefix", "parent_id": "t1_dgc8r6x", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "&gt;Knowing what big companies are like, there's always a chance that they'll ruin the product and their existing users will need somewhere else to go.\n\nThis is absolutely valid. \n\n&gt;I'm optimistic.\n\nMore importantly, you don't get defensive when you're given feedback but rather take it into consideration and use it toward improving your product and pitch. As someone a couple of weeks away from completing an MBA, believe you me they don't/can't teach that shit in school -- and it's absolutely essential to being a successful entrepreneur. \n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Knowing what big companies are like, there&amp;#39;s always a chance that they&amp;#39;ll ruin the product and their existing users will need somewhere else to go.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is absolutely valid. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m optimistic.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;More importantly, you don&amp;#39;t get defensive when you&amp;#39;re given feedback but rather take it into consideration and use it toward improving your product and pitch. As someone a couple of weeks away from completing an MBA, believe you me they don&amp;#39;t/can&amp;#39;t teach that shit in school -- and it&amp;#39;s absolutely essential to being a successful entrepreneur. &lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dgdh1ab", "score_hidden": false, "stickied": false, "created": 1492464440.0, "created_utc": 1492435640.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc8r6x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rowanjohnson", "parent_id": "t1_dgc0at1", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "Thank you, this is really interesting and helpful! I've used VHX as a test but I'm far from an expert as I've never used it for anything serious; we were well under development with Vimsy before I knew VHX existed. It was the announcement that Vimeo had purchased them that put them on the radar.\n\nI've written up a proper comparison as this is a really interesting one, and going to be very common. While VHX definitely has strengths, we do have enough differences that go in our favour for certain types of customer. If you want to see it: http://support.vimsy.co/meta/comparisons/vimsy-vs-vhx (It's largely a write-up of my earlier comment with tweaks based on your feedback.)\n\nPart of this exercise (getting feedback) was to see if our sales site was promoting the right messages. I'm taking a lot away from this!\n\n&gt; I think you have competition that's extremely well established and covers most use-cases for video distribution. There may be a very small hole that Vimsy fits, but you may want to think long and hard before you spent too much money or energy trying to grow this as a business as-is and instead maybe consider a pivot to be more niche and focus more tightly on the use-cases that absolutely wouldn't be served by VHX, Brightcove and their ilk.\n\nI agree. Some of the other players in this space are certainly much bigger and have been around for longer. I'll be interested to see how Vimeo fully integrates VHX into their product line-up, especially considering Vimeo for Business has some feature overlap. It's beginning to make moves from the looks of it. Knowing what big companies are like, there's always a chance that they'll ruin the product and their existing users will need somewhere else to go.\n\nEqually, competition shows that there's a market for a product like Vimsy, and even if it can capture a portion of that I don't think that's a bad place to be. Vimeo haven't given up because they only have a fraction of Youtube's market and, likewise, smaller companies like Wistia haven't rolled over because they only have a fraction of a market that is largely occupied by Vimeo. I'm optimistic.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, this is really interesting and helpful! I&amp;#39;ve used VHX as a test but I&amp;#39;m far from an expert as I&amp;#39;ve never used it for anything serious; we were well under development with Vimsy before I knew VHX existed. It was the announcement that Vimeo had purchased them that put them on the radar.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve written up a proper comparison as this is a really interesting one, and going to be very common. While VHX definitely has strengths, we do have enough differences that go in our favour for certain types of customer. If you want to see it: &lt;a href=\"http://support.vimsy.co/meta/comparisons/vimsy-vs-vhx\"&gt;http://support.vimsy.co/meta/comparisons/vimsy-vs-vhx&lt;/a&gt; (It&amp;#39;s largely a write-up of my earlier comment with tweaks based on your feedback.)&lt;/p&gt;\n\n&lt;p&gt;Part of this exercise (getting feedback) was to see if our sales site was promoting the right messages. I&amp;#39;m taking a lot away from this!&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think you have competition that&amp;#39;s extremely well established and covers most use-cases for video distribution. There may be a very small hole that Vimsy fits, but you may want to think long and hard before you spent too much money or energy trying to grow this as a business as-is and instead maybe consider a pivot to be more niche and focus more tightly on the use-cases that absolutely wouldn&amp;#39;t be served by VHX, Brightcove and their ilk.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree. Some of the other players in this space are certainly much bigger and have been around for longer. I&amp;#39;ll be interested to see how Vimeo fully integrates VHX into their product line-up, especially considering Vimeo for Business has some feature overlap. It&amp;#39;s beginning to make moves from the looks of it. Knowing what big companies are like, there&amp;#39;s always a chance that they&amp;#39;ll ruin the product and their existing users will need somewhere else to go.&lt;/p&gt;\n\n&lt;p&gt;Equally, competition shows that there&amp;#39;s a market for a product like Vimsy, and even if it can capture a portion of that I don&amp;#39;t think that&amp;#39;s a bad place to be. Vimeo haven&amp;#39;t given up because they only have a fraction of Youtube&amp;#39;s market and, likewise, smaller companies like Wistia haven&amp;#39;t rolled over because they only have a fraction of a market that is largely occupied by Vimeo. I&amp;#39;m optimistic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dgc8r6x", "score_hidden": false, "stickied": false, "created": 1492389835.0, "created_utc": 1492361035.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0at1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "brefix", "parent_id": "t1_dg9omyy", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "A few comments/corrections which (I hope) you find helpful feedback:\n\n&gt;The thing that makes Vimsy different is that it isn't purely about selling videos. We have a whole aspect to our platform that's geared towards non-commercial users who use video (e.g. a company with internal training videos) and need to share it with a closed user group (e.g. their staff).\n\nThis is interesting and a fair point re: non-commercial use; VHX definitely isn't set up for \"free\" video access.\n\n&gt;VHX appears to be aiming for big media, as shown by their demo customers who are well known media outputs like Comedy Central, Vice, This American Life and Foo Fighters.\n\nNegative. VHX offers branded/non-branded solutions for filmmakers and very much markets to them. Same goes fro really small media entities -- they've offered white-labeling services for a variety of different types of rightsholders ranging from single filmmakers to small time-distributors who are just starting out or only own the rights to a handful of films.\n\n&gt;With Vimsy they can track who's been watching the videos, when the videos were watched, how much of the video was watched, and they can export that data as a CSV for making reports. To my knowledge, VHX doesn't seem to do any of that.\n\nThey offer their users a fair bit of analytics tools with most (the granted, not all) of the important stuff seemingly covered. You can see their analytics suite [here](http://help.vhx.tv/article/476-data-analytics-overview) in more detail. In any event, it bears mentioning that any organization of any scale that wants to offer video with these types of analytics for internal use/for free can use Brightcove which has a really robust CMS and analytics dashboard. \n\nI think you have competition that's extremely well established and covers *most* use-cases for video distribution. There may be a very small hole that Vimsy fits, but you may want to think long and hard before you spent too much money or energy trying to grow this as a business as-is and instead maybe consider a pivot to be more niche and focus more tightly on the use-cases that absolutely wouldn't be served by VHX, Brightcove and their ilk.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A few comments/corrections which (I hope) you find helpful feedback:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The thing that makes Vimsy different is that it isn&amp;#39;t purely about selling videos. We have a whole aspect to our platform that&amp;#39;s geared towards non-commercial users who use video (e.g. a company with internal training videos) and need to share it with a closed user group (e.g. their staff).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is interesting and a fair point re: non-commercial use; VHX definitely isn&amp;#39;t set up for &amp;quot;free&amp;quot; video access.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;VHX appears to be aiming for big media, as shown by their demo customers who are well known media outputs like Comedy Central, Vice, This American Life and Foo Fighters.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Negative. VHX offers branded/non-branded solutions for filmmakers and very much markets to them. Same goes fro really small media entities -- they&amp;#39;ve offered white-labeling services for a variety of different types of rightsholders ranging from single filmmakers to small time-distributors who are just starting out or only own the rights to a handful of films.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;With Vimsy they can track who&amp;#39;s been watching the videos, when the videos were watched, how much of the video was watched, and they can export that data as a CSV for making reports. To my knowledge, VHX doesn&amp;#39;t seem to do any of that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They offer their users a fair bit of analytics tools with most (the granted, not all) of the important stuff seemingly covered. You can see their analytics suite &lt;a href=\"http://help.vhx.tv/article/476-data-analytics-overview\"&gt;here&lt;/a&gt; in more detail. In any event, it bears mentioning that any organization of any scale that wants to offer video with these types of analytics for internal use/for free can use Brightcove which has a really robust CMS and analytics dashboard. &lt;/p&gt;\n\n&lt;p&gt;I think you have competition that&amp;#39;s extremely well established and covers &lt;em&gt;most&lt;/em&gt; use-cases for video distribution. There may be a very small hole that Vimsy fits, but you may want to think long and hard before you spent too much money or energy trying to grow this as a business as-is and instead maybe consider a pivot to be more niche and focus more tightly on the use-cases that absolutely wouldn&amp;#39;t be served by VHX, Brightcove and their ilk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dgc0at1", "score_hidden": false, "stickied": false, "created": 1492376991.0, "created_utc": 1492348191.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9omyy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rowanjohnson", "parent_id": "t1_dg9jabp", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "VHX is a great product and has a lot of features, including all of their cross-platform app options. For certain types of customer, like the big media guys, they're probably the better option as they have the resource for handling them and doing all of the bespoke stuff that they appear to be doing. But their product is purely focussed on selling content.\n\nThe thing that makes Vimsy different is that it isn't purely about selling videos. We have a whole aspect to our platform that's geared towards non-commercial users who use video (e.g. a company with internal training videos) and need to share it with a closed user group (e.g. their staff). \n\nThey aren't interested in selling that content, they just need a high quality, branded portal to display the videos in one place without spending lots of money getting their web developers or IT guys to implement something for them. With Vimsy they can track who's been watching the videos, when the videos were watched, how much of the video was watched, and they can export that data as a CSV for making reports. To my knowledge, VHX doesn't seem to do any of that.\n\nAnother difference is that, in my opinion, Vimsy is much easier to use as it's primarily an inline/WYSIWYG interface. VHX uses a \"dashboard\" style interface where everything is controlled more or less behind the scenes. It's a different approach, but less technical users generally do better with WYSIWYG.\n\nAnd finally, I think VHX and Vimsy are both aimed at different levels of the market. VHX appears to be aiming for big media, as shown by their demo customers who are well known media outputs like Comedy Central, Vice, This American Life and Foo Fighters. Vimsy is really for SME corporate users and independent filmmakers. Don't get me wrong, I'd love it if a big media group wanted to come on board, but it's not the immediate goal.\n\nAs I mentioned in another comment, Vimsy doesn't host the videos itself, so we bring in videos from Youtube, Vimeo and Wistia instead. Considering Youtube is free, this means that we cater for people who are only just getting going with content production. For example, one of our customers is a local dance school who just want to share (and in time, sell) their performance recordings with parents. Their shows are 2 hours each, so VHX wouldn't have even been an option for them as VHX only provides 1 hour of video hosting for free. This may change in time now that they're part of Vimeo, but for now that's how it is.\n\nTL;DR It's similar but different enough :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;VHX is a great product and has a lot of features, including all of their cross-platform app options. For certain types of customer, like the big media guys, they&amp;#39;re probably the better option as they have the resource for handling them and doing all of the bespoke stuff that they appear to be doing. But their product is purely focussed on selling content.&lt;/p&gt;\n\n&lt;p&gt;The thing that makes Vimsy different is that it isn&amp;#39;t purely about selling videos. We have a whole aspect to our platform that&amp;#39;s geared towards non-commercial users who use video (e.g. a company with internal training videos) and need to share it with a closed user group (e.g. their staff). &lt;/p&gt;\n\n&lt;p&gt;They aren&amp;#39;t interested in selling that content, they just need a high quality, branded portal to display the videos in one place without spending lots of money getting their web developers or IT guys to implement something for them. With Vimsy they can track who&amp;#39;s been watching the videos, when the videos were watched, how much of the video was watched, and they can export that data as a CSV for making reports. To my knowledge, VHX doesn&amp;#39;t seem to do any of that.&lt;/p&gt;\n\n&lt;p&gt;Another difference is that, in my opinion, Vimsy is much easier to use as it&amp;#39;s primarily an inline/WYSIWYG interface. VHX uses a &amp;quot;dashboard&amp;quot; style interface where everything is controlled more or less behind the scenes. It&amp;#39;s a different approach, but less technical users generally do better with WYSIWYG.&lt;/p&gt;\n\n&lt;p&gt;And finally, I think VHX and Vimsy are both aimed at different levels of the market. VHX appears to be aiming for big media, as shown by their demo customers who are well known media outputs like Comedy Central, Vice, This American Life and Foo Fighters. Vimsy is really for SME corporate users and independent filmmakers. Don&amp;#39;t get me wrong, I&amp;#39;d love it if a big media group wanted to come on board, but it&amp;#39;s not the immediate goal.&lt;/p&gt;\n\n&lt;p&gt;As I mentioned in another comment, Vimsy doesn&amp;#39;t host the videos itself, so we bring in videos from Youtube, Vimeo and Wistia instead. Considering Youtube is free, this means that we cater for people who are only just getting going with content production. For example, one of our customers is a local dance school who just want to share (and in time, sell) their performance recordings with parents. Their shows are 2 hours each, so VHX wouldn&amp;#39;t have even been an option for them as VHX only provides 1 hour of video hosting for free. This may change in time now that they&amp;#39;re part of Vimeo, but for now that&amp;#39;s how it is.&lt;/p&gt;\n\n&lt;p&gt;TL;DR It&amp;#39;s similar but different enough :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dg9omyy", "score_hidden": false, "stickied": false, "created": 1492229743.0, "created_utc": 1492200943.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jabp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "brefix", "parent_id": "t3_651c5e", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "Why would someone use your service when they could use [VHX](https://www.vhx.tv/) instead? They're reputable, well designed, have plenty of well-known media entities already using their services and have been operational for years without any hiccups, scandals or bad press. \n\nDoes Vimsy have a unique value proposition that VHX can't/doesn't offer?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would someone use your service when they could use &lt;a href=\"https://www.vhx.tv/\"&gt;VHX&lt;/a&gt; instead? They&amp;#39;re reputable, well designed, have plenty of well-known media entities already using their services and have been operational for years without any hiccups, scandals or bad press. &lt;/p&gt;\n\n&lt;p&gt;Does Vimsy have a unique value proposition that VHX can&amp;#39;t/doesn&amp;#39;t offer?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dg9jabp", "score_hidden": false, "stickied": false, "created": 1492223296.0, "created_utc": 1492194496.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r1ip", "removal_reason": null, "link_id": "t3_651c5e", "likes": null, "replies": "", "user_reports": [], "id": "dg7rmb7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "rowanjohnson", "parent_id": "t1_dg7ol3e", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "Yep! Users of all three platforms (Youtube, Vimeo and Wistia) can choose whether they allow for their videos to be embedded on other sites, so there's nothing shady going on here. From the perspective of a Youtuber, it's not really that different from sites like Patreon, only more \"corporate\", for lack of a better word.\n\nIn time I'm sure we'll offer direct uploads, but it would mean charging for video hosting and dealing with the encoding infrastructure on the back-end. Video files are big!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep! Users of all three platforms (Youtube, Vimeo and Wistia) can choose whether they allow for their videos to be embedded on other sites, so there&amp;#39;s nothing shady going on here. From the perspective of a Youtuber, it&amp;#39;s not really that different from sites like Patreon, only more &amp;quot;corporate&amp;quot;, for lack of a better word.&lt;/p&gt;\n\n&lt;p&gt;In time I&amp;#39;m sure we&amp;#39;ll offer direct uploads, but it would mean charging for video hosting and dealing with the encoding infrastructure on the back-end. Video files are big!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dg7rmb7", "score_hidden": false, "stickied": false, "created": 1492128461.0, "created_utc": 1492099661.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ol3e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "leopoldmedley", "parent_id": "t1_dg7od9a", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "Is this legal? To charge people to watch videos that are embedded on another site? \n\nCouldn't youtube sue you because you're charging people to acess their site in a way? \n\nIt's a good idea. I just wish users were able to upload their videos directly to your site. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this legal? To charge people to watch videos that are embedded on another site? &lt;/p&gt;\n\n&lt;p&gt;Couldn&amp;#39;t youtube sue you because you&amp;#39;re charging people to acess their site in a way? &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a good idea. I just wish users were able to upload their videos directly to your site. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dg7ol3e", "score_hidden": false, "stickied": false, "created": 1492125213.0, "created_utc": 1492096413.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7od9a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rowanjohnson", "parent_id": "t1_dg7ilke", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "Good question, although we did think of that one! Youtube and Vimeo both offer privacy options for videos, so you can hide your videos from both sites and embed them on others, including Vimsy.\n\nThis article explains how to set up your source videos before selling them: http://support.vimsy.co/selling-video/getting-started/optimising-privacy-settings-on-youtube-vimeo-and-wistia-for-vimsy-monetisation", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good question, although we did think of that one! Youtube and Vimeo both offer privacy options for videos, so you can hide your videos from both sites and embed them on others, including Vimsy.&lt;/p&gt;\n\n&lt;p&gt;This article explains how to set up your source videos before selling them: &lt;a href=\"http://support.vimsy.co/selling-video/getting-started/optimising-privacy-settings-on-youtube-vimeo-and-wistia-for-vimsy-monetisation\"&gt;http://support.vimsy.co/selling-video/getting-started/optimising-privacy-settings-on-youtube-vimeo-and-wistia-for-vimsy-monetisation&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dg7od9a", "score_hidden": false, "stickied": false, "created": 1492124972.0, "created_utc": 1492096172.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ilke", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "leopoldmedley", "parent_id": "t3_651c5e", "subreddit_name_prefixed": "r/Filmmakers", "controversiality": 0, "body": "if the videos are on youtube and vimeo why can't I just go and watch them there for free?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if the videos are on youtube and vimeo why can&amp;#39;t I just go and watch them there for free?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Filmmakers", "name": "t1_dg7ilke", "score_hidden": false, "stickied": false, "created": 1492117853.0, "created_utc": 1492089053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]