[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "FinalFantasy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;all opinionated but after playing XV and going back to XIII for post game I honestly don&amp;#39;t think FFXIII is all that different from previous FF games. &lt;/p&gt;\n\n&lt;p&gt;tbh before XV, XII seemed like the next true evolution of FF but after XII got some mixed reception it seemed like square wanted to return to some of FF roots while still pushing it forward hence why XIII is the way that it is. &lt;/p&gt;\n\n&lt;p&gt;to me FFXIII is next gen FFX with a streamlined XII battle system. I notice that people always talk about it having a &amp;quot;20hr tutorial&amp;quot; to which I didn&amp;#39;t notice on my first playthrough. But to be completely honest I feel like if I wasn&amp;#39;t held by my hand for the first couple of chapters I would have never fully understood the battle system. and after putting over 125hrs in XIII&amp;#39;s end game content I can safely say that im grateful for the hand holding in the beginning. earlier today I started a new game of FFVIII and noticed that I was being dragged by the arm to learn the junction, GF and draw system within the first hour. I know its all needed and important to the game but I feel that there&amp;#39;s a much better way to teach the player such important stuff without having them sit through  a mute menu for 5 minutes. during this I started reflecting back on XIII&amp;#39;s first hours. I feel that XIII did the tutorial better. it slowly teaches you everything you need to know about the battle system without having you sit down and stare at text blocks for a few minutes. and if your immersed in the story during these chapters then you really don&amp;#39;t notice the handholding.&lt;/p&gt;\n\n&lt;p&gt;then you have the battle system. tbh it still doesn&amp;#39;t feel all that much different from other battle systems in the series. you still have three party members, you still have (A LOT of) magic, items, spells,summons etc. The difference here is that its presented in a new way A.K.A. the paradigm system. to me the paradigm system is like a fusion of the ATB system with the job changing of XII. If im being completely honest, XIII at its best hours (grand pulse) delivers imo the most customizable and strategic battle system in the series to date. you have six characters with six roles and six slots for paradigm set ups. XIII easily keeps the strategy of the series (if not also expanding it) while making it more flashy and accessible. and the best way to truly learn the battle system is by picking all your commands &amp;quot;manually&amp;quot; instead of using auto battle 24/7. &lt;/p&gt;\n\n&lt;p&gt;then we have the characters. Now characters and story will forever remain mixed among the fans but its hard to pick on XIII&amp;#39;s cast when in truth their not so different from other characters in the series. Lightning is no more distant than cloud or squall, vanille is no more weird than rikku, snow is no more shonen than Tidus or Zack, so forth and so on. and the rest of the cast for the matter is pretty original with Sazh, fang and hope. the same goes for the plot. XIII is no more &amp;quot;convoluted&amp;quot; than VII, VIII, X ect. &lt;/p&gt;\n\n&lt;p&gt;now maybe im just really forgiving but I really don&amp;#39;t see what all the anguish thrown at XIII was for. I picked the game up blind and really enjoyed it and no im not a newbie with X,VIII and VII under my belt.&lt;/p&gt;\n\n&lt;p&gt;but that&amp;#39;s just what I think though. &lt;/p&gt;\n\n&lt;p&gt;what about you guys?     &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "all opinionated but after playing XV and going back to XIII for post game I honestly don't think FFXIII is all that different from previous FF games. \n\ntbh before XV, XII seemed like the next true evolution of FF but after XII got some mixed reception it seemed like square wanted to return to some of FF roots while still pushing it forward hence why XIII is the way that it is. \n\nto me FFXIII is next gen FFX with a streamlined XII battle system. I notice that people always talk about it having a \"20hr tutorial\" to which I didn't notice on my first playthrough. But to be completely honest I feel like if I wasn't held by my hand for the first couple of chapters I would have never fully understood the battle system. and after putting over 125hrs in XIII's end game content I can safely say that im grateful for the hand holding in the beginning. earlier today I started a new game of FFVIII and noticed that I was being dragged by the arm to learn the junction, GF and draw system within the first hour. I know its all needed and important to the game but I feel that there's a much better way to teach the player such important stuff without having them sit through  a mute menu for 5 minutes. during this I started reflecting back on XIII's first hours. I feel that XIII did the tutorial better. it slowly teaches you everything you need to know about the battle system without having you sit down and stare at text blocks for a few minutes. and if your immersed in the story during these chapters then you really don't notice the handholding.\n\nthen you have the battle system. tbh it still doesn't feel all that much different from other battle systems in the series. you still have three party members, you still have (A LOT of) magic, items, spells,summons etc. The difference here is that its presented in a new way A.K.A. the paradigm system. to me the paradigm system is like a fusion of the ATB system with the job changing of XII. If im being completely honest, XIII at its best hours (grand pulse) delivers imo the most customizable and strategic battle system in the series to date. you have six characters with six roles and six slots for paradigm set ups. XIII easily keeps the strategy of the series (if not also expanding it) while making it more flashy and accessible. and the best way to truly learn the battle system is by picking all your commands \"manually\" instead of using auto battle 24/7. \n\nthen we have the characters. Now characters and story will forever remain mixed among the fans but its hard to pick on XIII's cast when in truth their not so different from other characters in the series. Lightning is no more distant than cloud or squall, vanille is no more weird than rikku, snow is no more shonen than Tidus or Zack, so forth and so on. and the rest of the cast for the matter is pretty original with Sazh, fang and hope. the same goes for the plot. XIII is no more \"convoluted\" than VII, VIII, X ect. \n\nnow maybe im just really forgiving but I really don't see what all the anguish thrown at XIII was for. I picked the game up blind and really enjoyed it and no im not a newbie with X,VIII and VII under my belt.\n\nbut that's just what I think though. \n\nwhat about you guys?     ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "FF XIII", "id": "65aa3p", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "UltimateSolidusSnake", "saved": false, "mod_reports": [], "name": "t3_65aa3p", "subreddit_name_prefixed": "r/FinalFantasy", "approved_by": null, "over_18": false, "domain": "self.FinalFantasy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhdi", "edited": false, "link_flair_css_class": "FFXIII", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/FinalFantasy/comments/65aa3p/xiii_is_actually_a_lot_more_similar_to_other_ff/", "num_reports": null, "locked": false, "stickied": false, "created": 1492169237.0, "url": "https://www.reddit.com/r/FinalFantasy/comments/65aa3p/xiii_is_actually_a_lot_more_similar_to_other_ff/", "author_flair_text": null, "quarantine": false, "title": "XIII is actually a lot more similar to other FF games than you think!", "created_utc": 1492140437.0, "distinguished": null, "media": null, "upvote_ratio": 0.57, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": "", "user_reports": [], "id": "dg9g732", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Dazz316", "parent_id": "t1_dg9dl1e", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "That's part of all the whole thing though, all these small things as up to a whole. You take them one at a time and they aren't much but together they do something great. But yeah going back to towns to get the extra puzzles done in the temples, dark aeons, celestial weapons, talking to people and getting new dialogue depending on where you are in he story etc.  Just able to go back and visit them gives you more of a sense on a whole world you're in and there's other people and things in it to see and do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s part of all the whole thing though, all these small things as up to a whole. You take them one at a time and they aren&amp;#39;t much but together they do something great. But yeah going back to towns to get the extra puzzles done in the temples, dark aeons, celestial weapons, talking to people and getting new dialogue depending on where you are in he story etc.  Just able to go back and visit them gives you more of a sense on a whole world you&amp;#39;re in and there&amp;#39;s other people and things in it to see and do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9g732", "score_hidden": false, "stickied": false, "created": 1492219674.0, "created_utc": 1492190874.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dl1e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9dfdo", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9dl1e", "score_hidden": false, "stickied": false, "created": 1492216703.0, "created_utc": 1492187903.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9dfdo", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Dazz316", "parent_id": "t1_dg9d7i9", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "X wasn't bad at it, not the best. but still OK. It had towns to stop in and talk to people (honestly everything aside this was horendous XIII didn't have people to to talk without being in fights). People running through areas to speak to. Chocobo racing. Blitzball. Al Bhed language stuff. All that just adds to the game as a whole. Individually they aren't much but together they make a much more rounded varied game. XIII didn't manage that at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;X wasn&amp;#39;t bad at it, not the best. but still OK. It had towns to stop in and talk to people (honestly everything aside this was horendous XIII didn&amp;#39;t have people to to talk without being in fights). People running through areas to speak to. Chocobo racing. Blitzball. Al Bhed language stuff. All that just adds to the game as a whole. Individually they aren&amp;#39;t much but together they make a much more rounded varied game. XIII didn&amp;#39;t manage that at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9dfdo", "score_hidden": false, "stickied": false, "created": 1492216524.0, "created_utc": 1492187724.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9d7i9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg9bzvp", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9d7i9", "score_hidden": false, "stickied": false, "created": 1492216275.0, "created_utc": 1492187475.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9bzvp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dazz316", "parent_id": "t1_dg9beb2", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "That's not true. A lot of games do and do it well. You backtrack for sidequests, items, minigames, easter eggs, hidden cutscenes for more quests, more characters and extra story development etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s not true. A lot of games do and do it well. You backtrack for sidequests, items, minigames, easter eggs, hidden cutscenes for more quests, more characters and extra story development etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9bzvp", "score_hidden": false, "stickied": false, "created": 1492214950.0, "created_utc": 1492186150.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9beb2", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg93s9e", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9beb2", "score_hidden": false, "stickied": false, "created": 1492214274.0, "created_utc": 1492185474.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93s9e", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Dazz316", "parent_id": "t3_65aa3p", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "FFVIII draw system was particularly complex in comparison to any other FF. it needed to shove itself down your throat. FFXIII is particular straight forward. You battle, grind, put points into one of the three tress and go. Only bit to learn is the pros and cons of different jobs like Commando etc. Not really a fair comparison.\n\nThe hand holding for me is that it doesn't give you any freedom to do anything for a long time. In X you can backtrack. Stop and play blitzball, talk to people, revisit towns, chocobo racing, main story etc. It's like the game going \"OK go play and have fun\". In XIII it's drags you through the story, no taking breaks, no towns to explore, no side quests, no people to talk to, no fun games.   \nYou get dragged through the game and if you see something fun it just carries on pulling you through the main story line. I think the point I realised it when I was playing through is when Vanille and Sazh reach that city (just before Ifrit) and you get to talk to a few people. I get a tiny little bit of freedom and all of a sudden it's taken away from me and I'm thrust back into running through straight line areas and battling. I was like *I wanted to stop and talk to people, visit shops, find some sidequests, enjoy the scenery and stop battling for 5 minutes but mamma FF wouldn't let me :(*\n\nI enjoyed the game somewhat but it took me a few goes to get through. I put it down twice to play something else and there was a BIG gap inbetween. Story and characters for me were awesome but I often felt like I was just going through the motions just to get to the next custscene.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;FFVIII draw system was particularly complex in comparison to any other FF. it needed to shove itself down your throat. FFXIII is particular straight forward. You battle, grind, put points into one of the three tress and go. Only bit to learn is the pros and cons of different jobs like Commando etc. Not really a fair comparison.&lt;/p&gt;\n\n&lt;p&gt;The hand holding for me is that it doesn&amp;#39;t give you any freedom to do anything for a long time. In X you can backtrack. Stop and play blitzball, talk to people, revisit towns, chocobo racing, main story etc. It&amp;#39;s like the game going &amp;quot;OK go play and have fun&amp;quot;. In XIII it&amp;#39;s drags you through the story, no taking breaks, no towns to explore, no side quests, no people to talk to, no fun games.&lt;br/&gt;\nYou get dragged through the game and if you see something fun it just carries on pulling you through the main story line. I think the point I realised it when I was playing through is when Vanille and Sazh reach that city (just before Ifrit) and you get to talk to a few people. I get a tiny little bit of freedom and all of a sudden it&amp;#39;s taken away from me and I&amp;#39;m thrust back into running through straight line areas and battling. I was like &lt;em&gt;I wanted to stop and talk to people, visit shops, find some sidequests, enjoy the scenery and stop battling for 5 minutes but mamma FF wouldn&amp;#39;t let me :(&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I enjoyed the game somewhat but it took me a few goes to get through. I put it down twice to play something else and there was a BIG gap inbetween. Story and characters for me were awesome but I often felt like I was just going through the motions just to get to the next custscene.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg93s9e", "score_hidden": false, "stickied": false, "created": 1492204171.0, "created_utc": 1492175371.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": "", "user_reports": [], "id": "dga4ahx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mcolwander90", "parent_id": "t1_dg9wgej", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "I spent a lot of time walking to level up Gladio's Survival :( But now, I fast travel and then use Chocobos. Much more fun than walking!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I spent a lot of time walking to level up Gladio&amp;#39;s Survival :( But now, I fast travel and then use Chocobos. Much more fun than walking!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dga4ahx", "score_hidden": false, "stickied": false, "created": 1492250285.0, "created_utc": 1492221485.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wgej", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lulubear777", "parent_id": "t1_dg9g86s", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "that's why I used chocobos to go overwhere :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;that&amp;#39;s why I used chocobos to go overwhere :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9wgej", "score_hidden": false, "stickied": false, "created": 1492239745.0, "created_utc": 1492210945.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9g86s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mcolwander90", "parent_id": "t1_dg99dno", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "I like describing XIII as the Regalia of Final Fantasy games. The game is gorgeous. I replayed it last year to finally earn the platinum trophy, and was still impressed by it. The music is great. However, you're pretty much in the backseat the entire time. And when you are in the driver's seat, you can't stray far from the track you're stuck on. That's a big reason why I like XV much more (Regalia and all haha). I like distractions, going at my own pace, overleveling when I choose to, Continuing the story when I want to, and letting the game become linear when I'm ready. I want the freedom to make it my experience and not what SE wrote up word for word. If the story suffers because of that, then hopefully the moments in between, and in the postgame, make up for it. Does for some, but not for others.\n\nI agree about the linearity of the series. They often give an illusion of openness, but guide your path by having things like overleveled enemies, not giving you a certain vehicle yet, or a story event that opens a new path. When you finally have complete freedom, it's so satisfying haha. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like describing XIII as the Regalia of Final Fantasy games. The game is gorgeous. I replayed it last year to finally earn the platinum trophy, and was still impressed by it. The music is great. However, you&amp;#39;re pretty much in the backseat the entire time. And when you are in the driver&amp;#39;s seat, you can&amp;#39;t stray far from the track you&amp;#39;re stuck on. That&amp;#39;s a big reason why I like XV much more (Regalia and all haha). I like distractions, going at my own pace, overleveling when I choose to, Continuing the story when I want to, and letting the game become linear when I&amp;#39;m ready. I want the freedom to make it my experience and not what SE wrote up word for word. If the story suffers because of that, then hopefully the moments in between, and in the postgame, make up for it. Does for some, but not for others.&lt;/p&gt;\n\n&lt;p&gt;I agree about the linearity of the series. They often give an illusion of openness, but guide your path by having things like overleveled enemies, not giving you a certain vehicle yet, or a story event that opens a new path. When you finally have complete freedom, it&amp;#39;s so satisfying haha. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9g86s", "score_hidden": false, "stickied": false, "created": 1492219709.0, "created_utc": 1492190909.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": "", "user_reports": [], "id": "dga5d9c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lulubear777", "parent_id": "t1_dga2e4y", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "I know, but that's like 95% of JRPGs.  If someone want non-linear RPGs play WRPGs  I just thought u were saying u couldn't go back after a point my bad if that's not wat u meant. my bad if that's not what u meant sorry", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know, but that&amp;#39;s like 95% of JRPGs.  If someone want non-linear RPGs play WRPGs  I just thought u were saying u couldn&amp;#39;t go back after a point my bad if that&amp;#39;s not wat u meant. my bad if that&amp;#39;s not what u meant sorry&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dga5d9c", "score_hidden": false, "stickied": false, "created": 1492251861.0, "created_utc": 1492223061.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga2e4y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HolyThunderPunch", "parent_id": "t1_dg9whkn", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "Which doesn't change anything. Really no different than using different save points in other games.\n\nStill a linear game as there is one start and one ending.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which doesn&amp;#39;t change anything. Really no different than using different save points in other games.&lt;/p&gt;\n\n&lt;p&gt;Still a linear game as there is one start and one ending.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dga2e4y", "score_hidden": false, "stickied": false, "created": 1492247665.0, "created_utc": 1492218865.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9whkn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lulubear777", "parent_id": "t1_dg99dno", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "XV you can always back by giving the pupper some paw.  Yes, even in chapter 13.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;XV you can always back by giving the pupper some paw.  Yes, even in chapter 13.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9whkn", "score_hidden": false, "stickied": false, "created": 1492239789.0, "created_utc": 1492210989.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg99dno", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "HolyThunderPunch", "parent_id": "t3_65aa3p", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "The issue with XIII and what really kills it for a lot of people is not yhe battle system or the characters (Lightning and Hope mother/son/sibling dynamic is awesome). The issue comes from the fact that it's a hallway like no other FF game. \n\nAll mainline FF games are linear. Even 15. There is only one ending and it's the only one that can happen. However, what sets the games apart is how much you can explore the rooms of said hallway as you walk down it. \n\nIn FF XIII and XV (after a certain point) you get pushed forward and don't get any real choice for exploration, to go back, or to deal with NPCs. This bugs people, especially if the entire game is like that. It is the evolution of \"city tease\" that was in a lot of the FF games such as 7 (Midgar), 8 (Esthar), and 10 (Bevelle) where you could see the city or part of it... But couldnt explore. FF XIII went off the deep end and turned city tease into world tease (Caccoon).\n\nSquarenix needs to stop teasing us so fucking much. XV is a step in the right direction, mostly, but the end still had a way too long hallway at the end that was just pushing us forward.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The issue with XIII and what really kills it for a lot of people is not yhe battle system or the characters (Lightning and Hope mother/son/sibling dynamic is awesome). The issue comes from the fact that it&amp;#39;s a hallway like no other FF game. &lt;/p&gt;\n\n&lt;p&gt;All mainline FF games are linear. Even 15. There is only one ending and it&amp;#39;s the only one that can happen. However, what sets the games apart is how much you can explore the rooms of said hallway as you walk down it. &lt;/p&gt;\n\n&lt;p&gt;In FF XIII and XV (after a certain point) you get pushed forward and don&amp;#39;t get any real choice for exploration, to go back, or to deal with NPCs. This bugs people, especially if the entire game is like that. It is the evolution of &amp;quot;city tease&amp;quot; that was in a lot of the FF games such as 7 (Midgar), 8 (Esthar), and 10 (Bevelle) where you could see the city or part of it... But couldnt explore. FF XIII went off the deep end and turned city tease into world tease (Caccoon).&lt;/p&gt;\n\n&lt;p&gt;Squarenix needs to stop teasing us so fucking much. XV is a step in the right direction, mostly, but the end still had a way too long hallway at the end that was just pushing us forward.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg99dno", "score_hidden": false, "stickied": false, "created": 1492211904.0, "created_utc": 1492183104.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": "", "user_reports": [], "id": "dg9wdgi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lulubear777", "parent_id": "t3_65aa3p", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "&gt;now maybe im just really forgiving but I really don't see what all the anguish thrown at XIII was for\n\nlol hallways press X to win worst than hilter\n\nSeriously though, you're right.  Most the 'sins' of xiii people complain about can be easily applied to X, which everyone seems to love like crazy.  I feel a lot of people just stopped playing before they got to the Palamecia airship.  Convoluted stories, hyperactive girls, 'whiny emo' pretty boys, melodrama, and linear stories have always been a part of FF.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;now maybe im just really forgiving but I really don&amp;#39;t see what all the anguish thrown at XIII was for&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;lol hallways press X to win worst than hilter&lt;/p&gt;\n\n&lt;p&gt;Seriously though, you&amp;#39;re right.  Most the &amp;#39;sins&amp;#39; of xiii people complain about can be easily applied to X, which everyone seems to love like crazy.  I feel a lot of people just stopped playing before they got to the Palamecia airship.  Convoluted stories, hyperactive girls, &amp;#39;whiny emo&amp;#39; pretty boys, melodrama, and linear stories have always been a part of FF.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg9wdgi", "score_hidden": false, "stickied": false, "created": 1492239633.0, "created_utc": 1492210833.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": "", "user_reports": [], "id": "dga09mm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NagasShadow", "parent_id": "t3_65aa3p", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "I'm going to disagree with you when it comes to tutorials.  I loved VIII overly complicated battle system that took my hours to understand and all.  I like being able to do dozens of different things and having many different paths to victory.  In VII for example just hitting things solved most battles but you could do an all magic play-through or, for all but one battle, an all summon play-through.  I'm not going to say it's impossible but a no commando play-through of XIII is likely horrible.  I felt XIII had only a few solutions to most encounters, it gets better after chapter seven.  Take the ediolon fights, there is a right way to beat them and the game over screen take your pick.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to disagree with you when it comes to tutorials.  I loved VIII overly complicated battle system that took my hours to understand and all.  I like being able to do dozens of different things and having many different paths to victory.  In VII for example just hitting things solved most battles but you could do an all magic play-through or, for all but one battle, an all summon play-through.  I&amp;#39;m not going to say it&amp;#39;s impossible but a no commando play-through of XIII is likely horrible.  I felt XIII had only a few solutions to most encounters, it gets better after chapter seven.  Take the ediolon fights, there is a right way to beat them and the game over screen take your pick.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dga09mm", "score_hidden": false, "stickied": false, "created": 1492244802.0, "created_utc": 1492216002.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": "", "user_reports": [], "id": "dg8upls", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TOT1990gup", "parent_id": "t3_65aa3p", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "The Junction System isn't exactly the easiest system to understand, so be thankful for the tutorials on that.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Junction System isn&amp;#39;t exactly the easiest system to understand, so be thankful for the tutorials on that.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg8upls", "score_hidden": false, "stickied": false, "created": 1492179762.0, "created_utc": 1492150962.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhdi", "removal_reason": null, "link_id": "t3_65aa3p", "likes": null, "replies": "", "user_reports": [], "id": "dg92msc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tbarks91", "parent_id": "t1_dg8s05f", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "I think so much of this game can be fixed in a re-release on current gen simply by opening up the combat system quicker (not instantly mind you), slowing down the atb ever so slightly to give more opportunity to think and pick moves, and having the whole crystarium unlocked from the start rather than artificially restricting levelling with those tiers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think so much of this game can be fixed in a re-release on current gen simply by opening up the combat system quicker (not instantly mind you), slowing down the atb ever so slightly to give more opportunity to think and pick moves, and having the whole crystarium unlocked from the start rather than artificially restricting levelling with those tiers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg92msc", "score_hidden": false, "stickied": false, "created": 1492202066.0, "created_utc": 1492173266.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8s05f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65aa3p", "subreddit_name_prefixed": "r/FinalFantasy", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "FinalFantasy", "name": "t1_dg8s05f", "score_hidden": false, "stickied": false, "created": 1492174167.0, "created_utc": 1492145367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]