[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "DecidingToBeBetter", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m looking into expanding my network and meet some new people. I&amp;#39;m generally a very introverted person. I&amp;#39;m active I do a lot of things by myself. Hiking, Business, Fitness and while I found it lonely sometimes It&amp;#39;s ok I don&amp;#39;t mind it.&lt;/p&gt;\n\n&lt;p&gt;Anyways, I&amp;#39;ve met a couple of people and &amp;quot;befriended&amp;quot; them but I feel like it&amp;#39;s always one sided. I ask a lot of questions about them and I genuinely interested in their stories. I&amp;#39;ve come to the conclusion that I&amp;#39;m a good listener but I feel like after a while I&amp;#39;m more a listener than anything else.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;I do like to talk and I do like to share things about myself But only when someone asks me about them. I really don&amp;#39;t see the point of bringing it up if there is no initial interest. I also have this sense that it&amp;#39;s sort of like I&amp;#39;d be gloating if I talk too much. Is this a weird mindset to have? I don&amp;#39;t want to show off.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In the past, I&amp;#39;ve had one friend who ended up being toxic. No matter how many times I tried to connect to this person their intention of being nice was always in exchange for something. Even a simple session at the gym was always a competition of who has what or who can do this better and it was never really focused on just hanging out and having fun. After a while I had to slowly disconnect myself around this person. So after dealing with that for 10 years I&amp;#39;m sort of not sure if my mindset is in the wrong place or how to know when you&amp;#39;ve found a good balanced friendship.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Any advice?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Right now I&amp;#39;ve met someone who is building their startup and going through a funding phase. I don&amp;#39;t believe in his idea personally but he&amp;#39;s very optimistic about it. So I enjoy listening to him because he&amp;#39;s passionate and I give him advice whenever he wants in terms of what to do. It&amp;#39;s not for me to say whether his idea is great or not.  Lately, though this person talks to me only about their dreams and success and how much money he&amp;#39;s going to make and what he&amp;#39;s making now. I feel like it&amp;#39;s too much you know. I don&amp;#39;t know I suppose for me I view conversations of asking and listening. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Do I have a wrong mindset about proper conversation etiquette or have I just not met people I&amp;#39;m connected to yet? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm looking into expanding my network and meet some new people. I'm generally a very introverted person. I'm active I do a lot of things by myself. Hiking, Business, Fitness and while I found it lonely sometimes It's ok I don't mind it.\n\nAnyways, I've met a couple of people and \"befriended\" them but I feel like it's always one sided. I ask a lot of questions about them and I genuinely interested in their stories. I've come to the conclusion that I'm a good listener but I feel like after a while I'm more a listener than anything else.\n\n - I do like to talk and I do like to share things about myself But only when someone asks me about them. I really don't see the point of bringing it up if there is no initial interest. I also have this sense that it's sort of like I'd be gloating if I talk too much. Is this a weird mindset to have? I don't want to show off.\n\n - In the past, I've had one friend who ended up being toxic. No matter how many times I tried to connect to this person their intention of being nice was always in exchange for something. Even a simple session at the gym was always a competition of who has what or who can do this better and it was never really focused on just hanging out and having fun. After a while I had to slowly disconnect myself around this person. So after dealing with that for 10 years I'm sort of not sure if my mindset is in the wrong place or how to know when you've found a good balanced friendship.\n\nAny advice?\n\n - Right now I've met someone who is building their startup and going through a funding phase. I don't believe in his idea personally but he's very optimistic about it. So I enjoy listening to him because he's passionate and I give him advice whenever he wants in terms of what to do. It's not for me to say whether his idea is great or not.  Lately, though this person talks to me only about their dreams and success and how much money he's going to make and what he's making now. I feel like it's too much you know. I don't know I suppose for me I view conversations of asking and listening. \n\nDo I have a wrong mindset about proper conversation etiquette or have I just not met people I'm connected to yet? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sfe2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "Givemeallyourtacos", "saved": false, "mod_reports": [], "name": "t3_64sfe2", "subreddit_name_prefixed": "r/DecidingToBeBetter", "approved_by": null, "over_18": false, "domain": "self.DecidingToBeBetter", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tand", "edited": 1491961608.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/DecidingToBeBetter/comments/64sfe2/how_do_i_develop_friendships_that_dont_seem_one/", "num_reports": null, "locked": false, "stickied": false, "created": 1491961717.0, "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/64sfe2/how_do_i_develop_friendships_that_dont_seem_one/", "author_flair_text": null, "quarantine": false, "title": "How do I develop friendships that don't seem one sided?", "created_utc": 1491932917.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64sfe2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64sfe2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64sfe2", "likes": null, "replies": "", "user_reports": [], "id": "dg5prx6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Browncoat101", "parent_id": "t1_dg5j47r", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "As an extrovert, I would say this is definitely my experience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As an extrovert, I would say this is definitely my experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg5prx6", "score_hidden": false, "stickied": false, "created": 1492022981.0, "created_utc": 1491994181.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64sfe2", "likes": null, "replies": "", "user_reports": [], "id": "dg65zfq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Givemeallyourtacos", "parent_id": "t1_dg5j47r", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Well, I think it's ok to talk about yourself. Part of a conversation is sharing experiences that are related to the topic. We're all storytellers but I think most people just don't know when to stop and listen. Instead, they prefer to continue to talk. \n\nAs I mentioned I've probably had some bad luck meeting people. I just hate to always be on the listening end is all. I don't mind being assertive if I have but I try to avoid it because I want the person to naturally be interested in asking and listening not forcing it in.\n\nI don't know why it's hard to find people like that", "edited": 1492368744.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I think it&amp;#39;s ok to talk about yourself. Part of a conversation is sharing experiences that are related to the topic. We&amp;#39;re all storytellers but I think most people just don&amp;#39;t know when to stop and listen. Instead, they prefer to continue to talk. &lt;/p&gt;\n\n&lt;p&gt;As I mentioned I&amp;#39;ve probably had some bad luck meeting people. I just hate to always be on the listening end is all. I don&amp;#39;t mind being assertive if I have but I try to avoid it because I want the person to naturally be interested in asking and listening not forcing it in.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know why it&amp;#39;s hard to find people like that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg65zfq", "score_hidden": false, "stickied": false, "created": 1492045288.0, "created_utc": 1492016488.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5j47r", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "samep04", "parent_id": "t1_dg57gik", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "in my experience, most people who \"talk about themselves\" are extroverts. They say things about themselves willingly to others because that's how they know how to connect with others. They don't :always: talk about themselves. Maybe they'll say something they know, then you say something you know (or you can throw them a compliment (just make one up if needed)). Then, literally keep trying to add to the conversation until one of you can see you might like hanging out.\n\nIt's weirdly that easy. Sometimes extroverts need new people. People who talk need people who listen, it's true. \n\nSometimes people are just trying to connect.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;in my experience, most people who &amp;quot;talk about themselves&amp;quot; are extroverts. They say things about themselves willingly to others because that&amp;#39;s how they know how to connect with others. They don&amp;#39;t :always: talk about themselves. Maybe they&amp;#39;ll say something they know, then you say something you know (or you can throw them a compliment (just make one up if needed)). Then, literally keep trying to add to the conversation until one of you can see you might like hanging out.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s weirdly that easy. Sometimes extroverts need new people. People who talk need people who listen, it&amp;#39;s true. &lt;/p&gt;\n\n&lt;p&gt;Sometimes people are just trying to connect.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg5j47r", "score_hidden": false, "stickied": false, "created": 1492004296.0, "created_utc": 1491975496.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg57gik", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SmegmanHoarder", "parent_id": "t3_64sfe2", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Most people seem to like to talk about themselves. I'd like an answer to this as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most people seem to like to talk about themselves. I&amp;#39;d like an answer to this as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg57gik", "score_hidden": false, "stickied": false, "created": 1491986686.0, "created_utc": 1491957886.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64sfe2", "likes": null, "replies": "", "user_reports": [], "id": "dg5foq5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "oscarstrashcan21", "parent_id": "t3_64sfe2", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "I don't really have a direct answer to this question, only to really say that you just have to keep meeting people and asking engaging questions. It will feel like a lot of acquaintances or friendships will be one sided at times, and that comes with the territory of being generally independent and introverted.\n\nKeep connecting, keep meeting, and giving out your contact info or sending invites to friends, coworkers; etc. Everybody really is different and you will get different responses. If there's anything I can assure you, you'll get there eventually. People in general crave social interaction, and if you're always doing something, those people who gravitate towards you are likely gonna be the ones that stick and serve more to an equal friendship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really have a direct answer to this question, only to really say that you just have to keep meeting people and asking engaging questions. It will feel like a lot of acquaintances or friendships will be one sided at times, and that comes with the territory of being generally independent and introverted.&lt;/p&gt;\n\n&lt;p&gt;Keep connecting, keep meeting, and giving out your contact info or sending invites to friends, coworkers; etc. Everybody really is different and you will get different responses. If there&amp;#39;s anything I can assure you, you&amp;#39;ll get there eventually. People in general crave social interaction, and if you&amp;#39;re always doing something, those people who gravitate towards you are likely gonna be the ones that stick and serve more to an equal friendship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg5foq5", "score_hidden": false, "stickied": false, "created": 1491998055.0, "created_utc": 1491969255.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]