[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "DecidingToBeBetter", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My life has been based around the issues of everybody else.  I look at myself as others see me and its not the most positive way.  So I can change for a few but the weight of others ideas have caused me to fall back into the shelter and allow the weight to pile up.  I need some positive love my way, I am not looking for anybody to fix it for me but looking for what you might do to make a bad day a better one.  I have been single for my 28 years of life on this planet, I am an overweight Gay Man living in a city where thats judged upon unless you are into crazy and wild things... (Why can&amp;#39;t love just be love?). I work in a company that promotes those younger due to their drive to be better but they have no drive to be the better they want in the world and end up walking on everybody to get to what they want. (Corporate life I understand, but you should not tear those down in front of you to achieve your goals).  I want to adapt to some more positive things I can do.  I have filled my depression and sadness with shopping and spending way to much money on things that really don&amp;#39;t matter because its the high that I get when I swipe my card but more hate and sadness when I realize I could have done something better.  SO PLEASE HELP ME!  I want to make some changes in my life to overcome all the negative!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My life has been based around the issues of everybody else.  I look at myself as others see me and its not the most positive way.  So I can change for a few but the weight of others ideas have caused me to fall back into the shelter and allow the weight to pile up.  I need some positive love my way, I am not looking for anybody to fix it for me but looking for what you might do to make a bad day a better one.  I have been single for my 28 years of life on this planet, I am an overweight Gay Man living in a city where thats judged upon unless you are into crazy and wild things... (Why can't love just be love?). I work in a company that promotes those younger due to their drive to be better but they have no drive to be the better they want in the world and end up walking on everybody to get to what they want. (Corporate life I understand, but you should not tear those down in front of you to achieve your goals).  I want to adapt to some more positive things I can do.  I have filled my depression and sadness with shopping and spending way to much money on things that really don't matter because its the high that I get when I swipe my card but more hate and sadness when I realize I could have done something better.  SO PLEASE HELP ME!  I want to make some changes in my life to overcome all the negative!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64w57b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "arvadaguy", "saved": false, "mod_reports": [], "name": "t3_64w57b", "subreddit_name_prefixed": "r/DecidingToBeBetter", "approved_by": null, "over_18": false, "domain": "self.DecidingToBeBetter", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tand", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/DecidingToBeBetter/comments/64w57b/i_dont_know_what_i_am_looking_for_but_some_help/", "num_reports": null, "locked": false, "stickied": false, "created": 1492001347.0, "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/64w57b/i_dont_know_what_i_am_looking_for_but_some_help/", "author_flair_text": null, "quarantine": false, "title": "I don't know what I am looking for but some help would be great.", "created_utc": 1491972547.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64w57b", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64w57b", "likes": null, "replies": "", "user_reports": [], "id": "dg5jt44", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "samep04", "parent_id": "t1_dg5jsco", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "fukk you Sarah!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;fukk you Sarah!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg5jt44", "score_hidden": false, "stickied": false, "created": 1492005787.0, "created_utc": 1491976987.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64w57b", "likes": null, "replies": "", "user_reports": [], "id": "dg5m9vv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "arvadaguy", "parent_id": "t1_dg5jsco", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Started reading this and was like WTF and finished with a smile! My job knows I'm gay but again that's not an issue. And they actually do come to me for things all the time but still treat me like shit that's why I don't know what the hell to do. I do need to get out of my own way that's a fault bigger then any and thank you for the reply! Also FUCK SARAH haha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Started reading this and was like WTF and finished with a smile! My job knows I&amp;#39;m gay but again that&amp;#39;s not an issue. And they actually do come to me for things all the time but still treat me like shit that&amp;#39;s why I don&amp;#39;t know what the hell to do. I do need to get out of my own way that&amp;#39;s a fault bigger then any and thank you for the reply! Also FUCK SARAH haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg5m9vv", "score_hidden": false, "stickied": false, "created": 1492012228.0, "created_utc": 1491983428.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jsco", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "samep04", "parent_id": "t3_64w57b", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "GUY, or... ARVADA!?\n\nArvada, which is nobody's name, you have a few faults. Faults that will prevent you from succeeding in your personal, social, and professional lives. \n\nIn almost no order at all, in my personal view of social import:\n\nArvada: #1 Your skills come first. What do you do for others? When a company needs a person to do a new thing, do they come to you? If not, re-establish your skills. Make yourself THE PERSON they will come to in times of need.\n\n#2 Just to get it out of the way, your sexuality had nothing to do with it. if it did, and you can prove it, you're probably entitled to be a millionaire for allowing a company to think you were straight when you were actually gay. Why a company should be forced to legally monetarily acknowledge how you like to have sex, is beyond all of humanity's understanding.\n\n#3 See yourself. \n\n #4 See yourself, seriously. Nobody really knows how to tell you to see yourself. Go find a thing you can do, find a way to be rebelious, and discover yourself.\n\n#5 OK so you've discovered yourself. You're now two years older than that stud we've hired from NYU. He know seventeen programming languages!! \n\n#6 I know you fukkin skimmed. You know that fashion wasn't the solution. Sarah does the edits from here. Sarah isn't even five feet tall.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;GUY, or... ARVADA!?&lt;/p&gt;\n\n&lt;p&gt;Arvada, which is nobody&amp;#39;s name, you have a few faults. Faults that will prevent you from succeeding in your personal, social, and professional lives. &lt;/p&gt;\n\n&lt;p&gt;In almost no order at all, in my personal view of social import:&lt;/p&gt;\n\n&lt;p&gt;Arvada: #1 Your skills come first. What do you do for others? When a company needs a person to do a new thing, do they come to you? If not, re-establish your skills. Make yourself THE PERSON they will come to in times of need.&lt;/p&gt;\n\n&lt;h1&gt;2 Just to get it out of the way, your sexuality had nothing to do with it. if it did, and you can prove it, you&amp;#39;re probably entitled to be a millionaire for allowing a company to think you were straight when you were actually gay. Why a company should be forced to legally monetarily acknowledge how you like to have sex, is beyond all of humanity&amp;#39;s understanding.&lt;/h1&gt;\n\n&lt;h1&gt;3 See yourself.&lt;/h1&gt;\n\n&lt;p&gt;#4 See yourself, seriously. Nobody really knows how to tell you to see yourself. Go find a thing you can do, find a way to be rebelious, and discover yourself.&lt;/p&gt;\n\n&lt;h1&gt;5 OK so you&amp;#39;ve discovered yourself. You&amp;#39;re now two years older than that stud we&amp;#39;ve hired from NYU. He know seventeen programming languages!!&lt;/h1&gt;\n\n&lt;h1&gt;6 I know you fukkin skimmed. You know that fashion wasn&amp;#39;t the solution. Sarah does the edits from here. Sarah isn&amp;#39;t even five feet tall.&lt;/h1&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg5jsco", "score_hidden": false, "stickied": false, "created": 1492005740.0, "created_utc": 1491976940.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_64w57b", "likes": null, "replies": "", "user_reports": [], "id": "dg64nft", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Arnold_isnumero_uno", "parent_id": "t3_64w57b", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Hey man, sorry to hear about the rut you're feeling stuck in.  I can't fairly say I identify with everything you're going through, but I can't help but think you might benefit from something I'm working on right now in myself.\n\nI'm going to go ahead and point you towards /r/stoicism.  In addition, I was also referred to www.capablemen.com from a helpful user on *this* sub just yesterday.  In the last 24 hours I read as much from that website as I was able and found a lot of it very encouraging!\n\nStoicism though, in the world's most overly simplistic nutshell, is the philosophical school of thought that life is full of forces over which the individual has little to no control.  What we CAN control however is how we live and react in response.  That's about as useful as I personally can be on the subject, as I said I'm *just* getting started on this path myself.  Just felt like I'd share in case it helps!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey man, sorry to hear about the rut you&amp;#39;re feeling stuck in.  I can&amp;#39;t fairly say I identify with everything you&amp;#39;re going through, but I can&amp;#39;t help but think you might benefit from something I&amp;#39;m working on right now in myself.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to go ahead and point you towards &lt;a href=\"/r/stoicism\"&gt;/r/stoicism&lt;/a&gt;.  In addition, I was also referred to &lt;a href=\"http://www.capablemen.com\"&gt;www.capablemen.com&lt;/a&gt; from a helpful user on &lt;em&gt;this&lt;/em&gt; sub just yesterday.  In the last 24 hours I read as much from that website as I was able and found a lot of it very encouraging!&lt;/p&gt;\n\n&lt;p&gt;Stoicism though, in the world&amp;#39;s most overly simplistic nutshell, is the philosophical school of thought that life is full of forces over which the individual has little to no control.  What we CAN control however is how we live and react in response.  That&amp;#39;s about as useful as I personally can be on the subject, as I said I&amp;#39;m &lt;em&gt;just&lt;/em&gt; getting started on this path myself.  Just felt like I&amp;#39;d share in case it helps!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg64nft", "score_hidden": false, "stickied": false, "created": 1492043911.0, "created_utc": 1492015111.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]