[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "DecidingToBeBetter", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(Please be kind; it&amp;#39;s very embarrassing for me to post this... but the first step to fixing a problem is admitting that you have one, and here I am doing just that and asking for help. Also, throwaway account because my husband knows my regular ones.)&lt;/p&gt;\n\n&lt;p&gt;So, I&amp;#39;ve had depression/anxiety/OCD all my life, but now I&amp;#39;m at a point where I&amp;#39;m on the right meds (and have been through a course of therapy a year or two back) such that I feel that I can handle tackling the changes I want to make in life, or at least start. I know I&amp;#39;ll never not have depression, but I want to be able to live my life and enjoy it in spite of that now that it&amp;#39;s under control. I want to be a better wife for my husband, a better friend to my friends, and although it&amp;#39;s hard for me to admit, a better me for myself, since years of depression made me feel like doing anything for myself wasn&amp;#39;t worth it.&lt;/p&gt;\n\n&lt;p&gt;My list of things I want to change includes:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Showering - at least every other day, if not every day&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Washing my face - daily&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Using lotion on keratosis pilaris - post-shower, so every other day/daily &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Not picking obsessively at my skin - daily (already subbed to &lt;a href=\"/r/CalmHands\"&gt;r/CalmHands&lt;/a&gt; and &lt;a href=\"/r/CompulsiveSkinPicking\"&gt;r/CompulsiveSkinPicking&lt;/a&gt; for support)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Brushing my teeth - at least once daily (can&amp;#39;t remember the last time I had a regular teeth brushing schedule... how embarrassing is that?)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Exercise - ideally, &lt;a href=\"/r/bodyweightfitness\"&gt;r/bodyweightfitness&lt;/a&gt; recommended routine on M/W/F, and a combination of &lt;a href=\"/r/GripTraining\"&gt;r/GripTraining&lt;/a&gt; and &lt;a href=\"/r/Flexibility\"&gt;r/Flexibility&lt;/a&gt; basic routines on T/Th/Sat&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Squats - separate from exercise because I want to be able to do them unassisted, and I can&amp;#39;t do that unless I practice&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Continue losing weight - I&amp;#39;m about a year out from weight loss surgery, and ~100lbs down, but I&amp;#39;m not at my goal weight and I&amp;#39;m not where I need to be, so even though I&amp;#39;m already kind of doing this one, I can&amp;#39;t forget about it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Reading - I love to read. I want to start reading before I go to bed again, rather than messing around on my phone late into the night without realizing it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;All the other things responsible adults do - change sheets? do dishes? laundry? I usually just wait until a &amp;quot;good&amp;quot; depression day to do them, but that&amp;#39;s not as often as it should be, and that&amp;#39;s not good.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;My problem lies in the fact that for many years, I severely neglected taking caring of myself. I was suicidal at one point (have since worked through that with a therapist, and no thought or chance of hurting myself since) and I always thought, you know, why bother? And now I&amp;#39;m at the point where I&amp;#39;m overwhelmed by the amount of things that I really should be doing every day, and I&amp;#39;m so horribly ashamed of having NOT done them for so long, that I paralyzed by it all. I also have fibromyalgia (&lt;a href=\"/r/fibromyalgia\"&gt;r/fibromyalgia&lt;/a&gt; for the interested) so overworking myself leaves me in a lot of pain for the next few days.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried the whole No Zero Day attempt but I guess it&amp;#39;s just never clicked for me because I get really hard on myself. I know the whole &amp;quot;if your car had a flat you wouldn&amp;#39;t just trash it and go buy a new one&amp;quot; metaphor, but I have trouble getting that to work for me. I&amp;#39;ve always seen myself as not worth working on, and now I&amp;#39;m trying to overcome that. Based on the metaphor, it&amp;#39;s like I feel like I&amp;#39;ve been driving around a lemon junker, but I took it to a mechanic who said it was a good, solid car that just needed some work here and there, but I just can&amp;#39;t shake the idea that it&amp;#39;s still the junker lemon car I&amp;#39;ve always known.&lt;/p&gt;\n\n&lt;p&gt;Any advice would be appreciated, whether it&amp;#39;s your story of how you got out of this kind of feeling or just a book you read that helped or anything. Thank you very much in advance to anyone who answers if I don&amp;#39;t get to you individually, and I hope you all have a nice day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "(Please be kind; it's very embarrassing for me to post this... but the first step to fixing a problem is admitting that you have one, and here I am doing just that and asking for help. Also, throwaway account because my husband knows my regular ones.)\n\n\nSo, I've had depression/anxiety/OCD all my life, but now I'm at a point where I'm on the right meds (and have been through a course of therapy a year or two back) such that I feel that I can handle tackling the changes I want to make in life, or at least start. I know I'll never not have depression, but I want to be able to live my life and enjoy it in spite of that now that it's under control. I want to be a better wife for my husband, a better friend to my friends, and although it's hard for me to admit, a better me for myself, since years of depression made me feel like doing anything for myself wasn't worth it.\n\n\nMy list of things I want to change includes:\n\n1. Showering - at least every other day, if not every day\n\n2. Washing my face - daily\n\n3. Using lotion on keratosis pilaris - post-shower, so every other day/daily \n\n4. Not picking obsessively at my skin - daily (already subbed to r/CalmHands and r/CompulsiveSkinPicking for support)\n\n5. Brushing my teeth - at least once daily (can't remember the last time I had a regular teeth brushing schedule... how embarrassing is that?)\n\n6. Exercise - ideally, r/bodyweightfitness recommended routine on M/W/F, and a combination of r/GripTraining and r/Flexibility basic routines on T/Th/Sat\n\n7. Squats - separate from exercise because I want to be able to do them unassisted, and I can't do that unless I practice\n\n8. Continue losing weight - I'm about a year out from weight loss surgery, and ~100lbs down, but I'm not at my goal weight and I'm not where I need to be, so even though I'm already kind of doing this one, I can't forget about it.\n\n9. Reading - I love to read. I want to start reading before I go to bed again, rather than messing around on my phone late into the night without realizing it.\n\n10. All the other things responsible adults do - change sheets? do dishes? laundry? I usually just wait until a \"good\" depression day to do them, but that's not as often as it should be, and that's not good.\n\n\nMy problem lies in the fact that for many years, I severely neglected taking caring of myself. I was suicidal at one point (have since worked through that with a therapist, and no thought or chance of hurting myself since) and I always thought, you know, why bother? And now I'm at the point where I'm overwhelmed by the amount of things that I really should be doing every day, and I'm so horribly ashamed of having NOT done them for so long, that I paralyzed by it all. I also have fibromyalgia (r/fibromyalgia for the interested) so overworking myself leaves me in a lot of pain for the next few days.\n\n\nI've tried the whole No Zero Day attempt but I guess it's just never clicked for me because I get really hard on myself. I know the whole \"if your car had a flat you wouldn't just trash it and go buy a new one\" metaphor, but I have trouble getting that to work for me. I've always seen myself as not worth working on, and now I'm trying to overcome that. Based on the metaphor, it's like I feel like I've been driving around a lemon junker, but I took it to a mechanic who said it was a good, solid car that just needed some work here and there, but I just can't shake the idea that it's still the junker lemon car I've always known.\n\n\nAny advice would be appreciated, whether it's your story of how you got out of this kind of feeling or just a book you read that helped or anything. Thank you very much in advance to anyone who answers if I don't get to you individually, and I hope you all have a nice day.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "657yjz", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 33, "report_reasons": null, "author": "OverwhelmedbyChange", "saved": false, "mod_reports": [], "name": "t3_657yjz", "subreddit_name_prefixed": "r/DecidingToBeBetter", "approved_by": null, "over_18": false, "domain": "self.DecidingToBeBetter", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2tand", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/DecidingToBeBetter/comments/657yjz/23f_with_long_list_of_changes_to_make/", "num_reports": null, "locked": false, "stickied": false, "created": 1492142942.0, "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/657yjz/23f_with_long_list_of_changes_to_make/", "author_flair_text": null, "quarantine": false, "title": "23F with long list of changes to make \"post\"-depression... how to do it? (x-post from r/getting_over_it)", "created_utc": 1492114142.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 14, "visited": false, "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": "", "user_reports": [], "id": "dg9fvb3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OverwhelmedbyChange", "parent_id": "t1_dg8qo8r", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "I should try journaling again. I had a diary as a kid, but my mom always read it and like criticized me if I didn't write enough... but that's the past and I shouldn't dwell on it, since I did really like it. Going easy on myself for not getting to stuff daily seems like it would be my biggest hurdle, but if you can conquer that, I think I can too. (I also have suspicions that I might be bipolar as well, having a lot of the symptoms, so this could help me out with that as well.) Thank you for your response. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I should try journaling again. I had a diary as a kid, but my mom always read it and like criticized me if I didn&amp;#39;t write enough... but that&amp;#39;s the past and I shouldn&amp;#39;t dwell on it, since I did really like it. Going easy on myself for not getting to stuff daily seems like it would be my biggest hurdle, but if you can conquer that, I think I can too. (I also have suspicions that I might be bipolar as well, having a lot of the symptoms, so this could help me out with that as well.) Thank you for your response. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg9fvb3", "score_hidden": false, "stickied": false, "created": 1492219295.0, "created_utc": 1492190495.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8qo8r", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "thornfieldhalls", "parent_id": "t3_657yjz", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "God. I relate to this too much.\n\nI'm bipolar (mostly depressed) and I still struggle with some of these things. I have, however, improved. It's tough to change, and every change I managed to make was preceded by countless attempts/failures. I guess I'll just tell you what helped me.\n\n1. Counseling/talking with friends/keeping a journal. Basically, expressing/analysing how you feel. I've tried and given up on a lot of journals through my life, I've managed to keep my current one for a year. I only write in it when I'm feeling strongly anxious/happy/depressed. Writing everything out really forced me to verbalize my sadness/anxiety issues. I.e. the other day I felt anxious walking outside when a couple cars passed by me. Felt bad, wrote something along the lines of \"felt anxious and self conscious outside today. Then I made myself really examine why (just constant anxiety people see me and are judging harshly), wrote it out, realized it wasn't true and that every stranger driving by does not automatically hate me. You get the gist. When I'm particularly depressed I like to write about things I wanna do/see. I've never seen a mountain or the ocean, none of the historical sites I've wanted to see, I've never been a mother, etc. When I'm feeling good enough I just try to note it and include a few lines about why I'm content. It's usually banal like, it's a nice day/I had a meatball sub. Helps to look back on it in darker times. I can't relate to it in that moment but knowing I did feel that way and I will feel that way again with some time makes it easier to get through a depression. \n\n2. My original goal was to write in that journal every day. Not even close. Sometimes I'll go about a month without touching it. Before, I'd feel like I failed and give up. Now I know I will probably always struggle with depression and sliding back when it comes to stuff like this. Set goals, yours are all great, but don't get discouraged and give up when you stray. I also think it's a lot of stuff to start at once, I do similar things when I'm manic where I'll write lists of stuff like this and try to do them. It can be hard to remember and be overwhelming. Maybe try starting with hygiene, then the gym or whatever is next important to you, and slowly add new habits while you're getting used to more basic ones. Just works better in my experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God. I relate to this too much.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m bipolar (mostly depressed) and I still struggle with some of these things. I have, however, improved. It&amp;#39;s tough to change, and every change I managed to make was preceded by countless attempts/failures. I guess I&amp;#39;ll just tell you what helped me.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Counseling/talking with friends/keeping a journal. Basically, expressing/analysing how you feel. I&amp;#39;ve tried and given up on a lot of journals through my life, I&amp;#39;ve managed to keep my current one for a year. I only write in it when I&amp;#39;m feeling strongly anxious/happy/depressed. Writing everything out really forced me to verbalize my sadness/anxiety issues. I.e. the other day I felt anxious walking outside when a couple cars passed by me. Felt bad, wrote something along the lines of &amp;quot;felt anxious and self conscious outside today. Then I made myself really examine why (just constant anxiety people see me and are judging harshly), wrote it out, realized it wasn&amp;#39;t true and that every stranger driving by does not automatically hate me. You get the gist. When I&amp;#39;m particularly depressed I like to write about things I wanna do/see. I&amp;#39;ve never seen a mountain or the ocean, none of the historical sites I&amp;#39;ve wanted to see, I&amp;#39;ve never been a mother, etc. When I&amp;#39;m feeling good enough I just try to note it and include a few lines about why I&amp;#39;m content. It&amp;#39;s usually banal like, it&amp;#39;s a nice day/I had a meatball sub. Helps to look back on it in darker times. I can&amp;#39;t relate to it in that moment but knowing I did feel that way and I will feel that way again with some time makes it easier to get through a depression. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;My original goal was to write in that journal every day. Not even close. Sometimes I&amp;#39;ll go about a month without touching it. Before, I&amp;#39;d feel like I failed and give up. Now I know I will probably always struggle with depression and sliding back when it comes to stuff like this. Set goals, yours are all great, but don&amp;#39;t get discouraged and give up when you stray. I also think it&amp;#39;s a lot of stuff to start at once, I do similar things when I&amp;#39;m manic where I&amp;#39;ll write lists of stuff like this and try to do them. It can be hard to remember and be overwhelming. Maybe try starting with hygiene, then the gym or whatever is next important to you, and slowly add new habits while you&amp;#39;re getting used to more basic ones. Just works better in my experience.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg8qo8r", "score_hidden": false, "stickied": false, "created": 1492171865.0, "created_utc": 1492143065.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": "", "user_reports": [], "id": "dg9fxm9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OverwhelmedbyChange", "parent_id": "t1_dg8tf7q", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "This sounds very helpful... it'll be the first thing I buy and read towards my goal of reading each night. :) Thank you for sharing it with me!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds very helpful... it&amp;#39;ll be the first thing I buy and read towards my goal of reading each night. :) Thank you for sharing it with me!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg9fxm9", "score_hidden": false, "stickied": false, "created": 1492219368.0, "created_utc": 1492190568.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8tf7q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SchoolSupernintendo", "parent_id": "t3_657yjz", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Book recommendation: \"There Is Nothing Wrong With You\" by Cheri Huber. It's a very accessible \"self help\" style book about Zen meditation and awareness practice. Huge breakthrough moment for me with regards to combating shame/self-hate/self-doubt. I had it on a wish-list for years and failed to buy it because my brain was like \"Clearly there is something wrong with you\" but it ended up being the first meditation guide I found that felt possible/do-able for me. Worth a shot yo. \n\nhttps://www.amazon.ca/There-Nothing-Wrong-You-Self-Hate/dp/0971030901", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Book recommendation: &amp;quot;There Is Nothing Wrong With You&amp;quot; by Cheri Huber. It&amp;#39;s a very accessible &amp;quot;self help&amp;quot; style book about Zen meditation and awareness practice. Huge breakthrough moment for me with regards to combating shame/self-hate/self-doubt. I had it on a wish-list for years and failed to buy it because my brain was like &amp;quot;Clearly there is something wrong with you&amp;quot; but it ended up being the first meditation guide I found that felt possible/do-able for me. Worth a shot yo. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.amazon.ca/There-Nothing-Wrong-You-Self-Hate/dp/0971030901\"&gt;https://www.amazon.ca/There-Nothing-Wrong-You-Self-Hate/dp/0971030901&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg8tf7q", "score_hidden": false, "stickied": false, "created": 1492176903.0, "created_utc": 1492148103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": "", "user_reports": [], "id": "dgbd5rx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OverwhelmedbyChange", "parent_id": "t1_dg9hust", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "&lt;3 That gives me a lot of hope that I can change. Thank you, friend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;lt;3 That gives me a lot of hope that I can change. Thank you, friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dgbd5rx", "score_hidden": false, "stickied": false, "created": 1492328868.0, "created_utc": 1492300068.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9hust", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Amethyst_Lovegood", "parent_id": "t1_dg9g0ak", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Yeah, honestly the year after I started to feel better was really great. I appreciated everything so much. I mean, the mirtazapine played a big role in that haha, but even without it I think I would have been much more grateful for things after not even really seeing them for so long. I'm off it now and my mindset hasn't gone back to the way it was. \n\nOne thing I learned as well is that we're changing all the time. I wasn't sure if I would be capable of certain things because I could never do them before, and then I surprised myself when I realized I could. \n\nSurviving depression gives you a lot of strength I think. Difficult things have happened since then but in the back of my mind I know I pulled myself out of worse and that comforts me. I expect to have more episodes in the future but I think I have better tools to deal with them now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, honestly the year after I started to feel better was really great. I appreciated everything so much. I mean, the mirtazapine played a big role in that haha, but even without it I think I would have been much more grateful for things after not even really seeing them for so long. I&amp;#39;m off it now and my mindset hasn&amp;#39;t gone back to the way it was. &lt;/p&gt;\n\n&lt;p&gt;One thing I learned as well is that we&amp;#39;re changing all the time. I wasn&amp;#39;t sure if I would be capable of certain things because I could never do them before, and then I surprised myself when I realized I could. &lt;/p&gt;\n\n&lt;p&gt;Surviving depression gives you a lot of strength I think. Difficult things have happened since then but in the back of my mind I know I pulled myself out of worse and that comforts me. I expect to have more episodes in the future but I think I have better tools to deal with them now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg9hust", "score_hidden": false, "stickied": false, "created": 1492221599.0, "created_utc": 1492192799.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9g0ak", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OverwhelmedbyChange", "parent_id": "t1_dg8p57c", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "It's good to hear that there really can be life on this \"other side\" of depression, and that it can really work. Thank you for your comment, and for the well wishes. :) I wish continuing good days for you as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s good to hear that there really can be life on this &amp;quot;other side&amp;quot; of depression, and that it can really work. Thank you for your comment, and for the well wishes. :) I wish continuing good days for you as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg9g0ak", "score_hidden": false, "stickied": false, "created": 1492219454.0, "created_utc": 1492190654.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8p57c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Amethyst_Lovegood", "parent_id": "t3_657yjz", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "I made a list like that (it was actually much longer) after I recovered from depression and it seemed really overwhelming and impossible at first but it's a few years on now and I have checked most stuff off the list. I'm living very differently now. I have had some \"relapses\", but they were temporary. I don't have a how to guide on how I did it. I think you just simply have to do the stuff, and be gentle with yourself if you lose focus. Just kindly bring yourself back on track. You have your entire life to work on yourself. Good luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I made a list like that (it was actually much longer) after I recovered from depression and it seemed really overwhelming and impossible at first but it&amp;#39;s a few years on now and I have checked most stuff off the list. I&amp;#39;m living very differently now. I have had some &amp;quot;relapses&amp;quot;, but they were temporary. I don&amp;#39;t have a how to guide on how I did it. I think you just simply have to do the stuff, and be gentle with yourself if you lose focus. Just kindly bring yourself back on track. You have your entire life to work on yourself. Good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg8p57c", "score_hidden": false, "stickied": false, "created": 1492169402.0, "created_utc": 1492140602.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": "", "user_reports": [], "id": "dg9g9fu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OverwhelmedbyChange", "parent_id": "t1_dg8q0md", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "I know how you feel with the game - depression sucks even the fun things you enjoy outta you, and the new Mass Effect is calling my name to keep playing, lol. Same situation with the license... are you secretly me? :P You make a good point about not getting this way overnight. I just get tripped up on the fact that I've been this way my whole life and its weird to me to imagine NOT being this way. Comfort with the demons you know vs the ones you don't, as it were. Thank you for sharing, and I wish you all the best in your journey as well. If you ever want to chat more about it, just send me a message. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know how you feel with the game - depression sucks even the fun things you enjoy outta you, and the new Mass Effect is calling my name to keep playing, lol. Same situation with the license... are you secretly me? :P You make a good point about not getting this way overnight. I just get tripped up on the fact that I&amp;#39;ve been this way my whole life and its weird to me to imagine NOT being this way. Comfort with the demons you know vs the ones you don&amp;#39;t, as it were. Thank you for sharing, and I wish you all the best in your journey as well. If you ever want to chat more about it, just send me a message. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg9g9fu", "score_hidden": false, "stickied": false, "created": 1492219750.0, "created_utc": 1492190950.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8q0md", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "stillghoti", "parent_id": "t3_657yjz", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Oh man, I'm in the same boat as you right now. Same age, too! \nIt's not helping a lot, but it helps enough so I figured its worth sharing. \n\n\nMy list of things to do includes small, silly things as well. Right on the top of the to-do list was to beat a videogame I had been putting off for months. Every day I get up and think \"what should I do today?\", get obscenely overwhelmed at the sheer amount of all the things I NEED to do, and end up doing nothing. Beating that game was a weight off my chest and a number off my list. Now I can do something else small. And another. And another. If I keep it up, eventually I'll be tackling my bigger to-do's, like getting my license. \n\n\nIt's frustrating knowing that it's not going to be an easy fix. It's even more frustrating knowing that a \"regular\" person would have had these things done already. But I'm suffering from depression and anxiety. I didn't get this bad in one night, I'm not going to fix it in one night.\n\n\nI guess this is pretty similar to the \"No Zero Day\" thing, though.\n\n\nI wish you the best of luck. I know how tough this is and hope that you can get control of your life again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man, I&amp;#39;m in the same boat as you right now. Same age, too! \nIt&amp;#39;s not helping a lot, but it helps enough so I figured its worth sharing. &lt;/p&gt;\n\n&lt;p&gt;My list of things to do includes small, silly things as well. Right on the top of the to-do list was to beat a videogame I had been putting off for months. Every day I get up and think &amp;quot;what should I do today?&amp;quot;, get obscenely overwhelmed at the sheer amount of all the things I NEED to do, and end up doing nothing. Beating that game was a weight off my chest and a number off my list. Now I can do something else small. And another. And another. If I keep it up, eventually I&amp;#39;ll be tackling my bigger to-do&amp;#39;s, like getting my license. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s frustrating knowing that it&amp;#39;s not going to be an easy fix. It&amp;#39;s even more frustrating knowing that a &amp;quot;regular&amp;quot; person would have had these things done already. But I&amp;#39;m suffering from depression and anxiety. I didn&amp;#39;t get this bad in one night, I&amp;#39;m not going to fix it in one night.&lt;/p&gt;\n\n&lt;p&gt;I guess this is pretty similar to the &amp;quot;No Zero Day&amp;quot; thing, though.&lt;/p&gt;\n\n&lt;p&gt;I wish you the best of luck. I know how tough this is and hope that you can get control of your life again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg8q0md", "score_hidden": false, "stickied": false, "created": 1492170797.0, "created_utc": 1492141997.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": "", "user_reports": [], "id": "dg9fl4y", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OverwhelmedbyChange", "parent_id": "t1_dg8vise", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "I'm glad I could help! :) Their recommended routine has so many progressions that I can see it working for you no matter how far you get with it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad I could help! :) Their recommended routine has so many progressions that I can see it working for you no matter how far you get with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg9fl4y", "score_hidden": false, "stickied": false, "created": 1492218971.0, "created_utc": 1492190171.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vise", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zuperfly", "parent_id": "t3_657yjz", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Thanks for reminding me about r/bodyweightfitness I always wanted to do that, but didn't want to waste my gym money. But I have canceled my gym subscription now :))", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for reminding me about &lt;a href=\"/r/bodyweightfitness\"&gt;r/bodyweightfitness&lt;/a&gt; I always wanted to do that, but didn&amp;#39;t want to waste my gym money. But I have canceled my gym subscription now :))&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg8vise", "score_hidden": false, "stickied": false, "created": 1492181779.0, "created_utc": 1492152979.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2tand", "removal_reason": null, "link_id": "t3_657yjz", "likes": null, "replies": "", "user_reports": [], "id": "dg9fo3r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OverwhelmedbyChange", "parent_id": "t1_dg94rye", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "Oh, totally feel free to steal these goals! Haha, I don't even have (or want) kids... but I'll be danged if mindfulness doesn't sound like something I should probably also try. Another one for the list, lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh, totally feel free to steal these goals! Haha, I don&amp;#39;t even have (or want) kids... but I&amp;#39;ll be danged if mindfulness doesn&amp;#39;t sound like something I should probably also try. Another one for the list, lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg9fo3r", "score_hidden": false, "stickied": false, "created": 1492219065.0, "created_utc": 1492190265.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94rye", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "snarkyshan", "parent_id": "t3_657yjz", "subreddit_name_prefixed": "r/DecidingToBeBetter", "controversiality": 0, "body": "I might steal your list of daily goals - holy cow. I'm thirty and it took me having kids to realize how much I need to get myself together too. \n\nI started looking into mindfulness stuff - I'm SO scatter brained and always on the move and simultaneously exhausted. It's early in my road to getting my head on straight, but it's something. I'm just so tired of hating myself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I might steal your list of daily goals - holy cow. I&amp;#39;m thirty and it took me having kids to realize how much I need to get myself together too. &lt;/p&gt;\n\n&lt;p&gt;I started looking into mindfulness stuff - I&amp;#39;m SO scatter brained and always on the move and simultaneously exhausted. It&amp;#39;s early in my road to getting my head on straight, but it&amp;#39;s something. I&amp;#39;m just so tired of hating myself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "DecidingToBeBetter", "name": "t1_dg94rye", "score_hidden": false, "stickied": false, "created": 1492205760.0, "created_utc": 1492176960.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]