[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "DecidingToBeBetter", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a human, you are host to a problem-solving supercomputer. In fact, when you’re not daydreaming about having an affair with a celebrity or reaching max-level in your favorite pay-to-win smartphone game; you’re probably thinking about your day-to-day real life problems. &lt;/p&gt;\n\n&lt;p&gt;Why?&lt;/p&gt;\n\n&lt;p&gt;To solve them, of course.&lt;/p&gt;\n\n&lt;p&gt;You might think about how you would feel better if you got in shape. Or you might think, “If I quit my job and stop working for that asshat, things will get better.” Your brain has a fantastic ability to imagine future scenarios and to think up schemes intended to improve your life.&lt;/p&gt;\n\n&lt;p&gt;But there’s a small problem…&lt;/p&gt;\n\n&lt;p&gt;We think we know what makes us feel good, both short-term and long term (i.e. sex/a good job). Surprisingly, though, psychologists have found that we are essentially clueless about what makes us happy. We are more or less emotionally blind to ourselves. Not only that, we’re blind to our emotional blindness. &lt;/p&gt;\n\n&lt;p&gt;We feel like we know what will make us happy and what will stress us out, but have you ever questioned this assumption? \nHave you considered that the problems we spend hours thinking about each day might lead us on fruitless Don Quixote-esque pursuits? Maybe we’re chasing ghosts. &lt;/p&gt;\n\n&lt;p&gt;All of your mind’s self-improvement schemes might be helpful, but what if the thing that’s really damaging your well-being is something you’re not even aware of? &lt;/p&gt;\n\n&lt;p&gt;We all have blindspots, no one is perfectly self-aware, but what if you’re blind to the thing in your life that is having the largest negative impact on your well-being?&lt;/p&gt;\n\n&lt;p&gt;Take me, for example…&lt;/p&gt;\n\n&lt;p&gt;I’ve always devalued money, I’ve thought of it as a nasty thing and I wanted nothing to do with it. I spent my money carelessly and put little thought into improving my financial situation. I didn’t think about money, I didn’t worry about money. I told myself I had other more important and ‘elevated concerns’, yet despite my blindness to its importance, money still mattered. Despite my blindness to money, my lack of an income was still causing me stress. Despite my blindness to it, money was still a 1000-pound gorilla on my back. &lt;/p&gt;\n\n&lt;p&gt;My relationship with money was causing me constant stress, but I wasn’t consciously aware my relationship with money was problematic- I was blind to my blindness. Unfortunately, it’s easy to be unaware of the real causes of your stress and to spend energy on smaller problems. There’s a good chance you’re doing this as well, but of course, you don’t know this.&lt;/p&gt;\n\n&lt;p&gt;Is there a solution? &lt;/p&gt;\n\n&lt;p&gt;Yes, you must take a step back from the voice in your head and look at more objective measures for your happiness. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Three Pillars&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;There are three pillars of life satisfaction. If you aren’t satisfying one of these needs adequately, it can cause suffocating levels of psychological stress. &lt;/p&gt;\n\n&lt;p&gt;Take a moment to evaluate yourself on these three pillars, because no matter how much you improve the other areas of your life, if one of these pillars isn’t up to par with the others, you must focus on improving that area to significantly improve your well-being. &lt;/p&gt;\n\n&lt;p&gt;Look at it this way, imagine you want to compete in a triathlon, your running ability is amazing, you’d rate yourself a 9/10. Your cycling is also very good, you’d rate yourself an 8/10. &lt;/p&gt;\n\n&lt;p&gt;But…&lt;/p&gt;\n\n&lt;p&gt;Your swimming is terrible, you barely ever swim, and have never developed the skill, you’d rate yourself a 2/10. &lt;/p&gt;\n\n&lt;p&gt;How would you train for the triathlon? Spending time on running or cycling wouldn’t be of much value to you until you got your swimming up to par. You could train to be the best runner in the world, but you still wouldn’t win if you didn’t improve your swimming ability.&lt;/p&gt;\n\n&lt;p&gt;It’s easy to fall into this same situation in real life, and not even be aware of it. &lt;/p&gt;\n\n&lt;p&gt;Take a moment to measure your performance in the three pillars of life-satisfaction and you may find that you’ve had a huge blindspot that’s been limiting your well-being.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Monetary Wealth&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Research has found that money does correlate with happiness, up to about the 75,000 dollar a year mark (which so happens to be the amount of money necessary to take care of your basic needs), past that, money has almost no effect on your emotional well-being. &lt;/p&gt;\n\n&lt;p&gt;Money is always going to be a source of stress, but if you make less than the amount necessary to take care of your basic needs, it can be debilitating.  &lt;/p&gt;\n\n&lt;p&gt;But just making $75,000/year isn’t enough, if you make your money from a career that feels meaningless, you’ve got a better problem, but still a substantial one. Working a corporate job for a company you’re ambivalent towards and for a boss you hate is a steady drain on your psyche. It’s not so immediately painful as making too little money, but if you don’t feel like you’re accomplishing something meaningful with your time, your life won’t feel very satisfying. &lt;/p&gt;\n\n&lt;p&gt;Fortunately, if you need to change your career, time you spend towards finding something better will be enjoyable, you will be focused and determined. Once you accept that this area of your life isn’t being properly managed, and you hone in on the value you want to strive for, your efforts towards solving the problem will be stress-relieving; because that stress you felt existed because your previous career didn’t satisfy your most important psychological needs.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Relationships&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Relationships are, of course, the most important area of most people’s lives, they’re also one of the biggest sources of stress and frustration. Human relationships always have and always will involve a certain level of compromise, your values will never perfectly align with someone else’s. &lt;/p&gt;\n\n&lt;p&gt;When a relationship is toxic and destructive, it can poison the rest of your life, whether it be a close friendship, a family member, or a lover, if your thoughts often turn to how someone is frustrating you, you must address this. &lt;/p&gt;\n\n&lt;p&gt;In some cases, the only solution is to extricate yourself from the toxic relationship, if your girlfriend cheated on you, and you resent them for it, staying in that relationship might be easier than being alone and having to find someone else. But it also might be the only option that can lead to your long-term well-being. &lt;/p&gt;\n\n&lt;p&gt;I’ve literally ‘broken up’ with friends before, this might seem extreme, but if you and someone you know are having a consistently negative impact on each other, it’s worth ending that relationship for both of your sakes. Remember, you are the average of the 5 people you’re around the most. &lt;/p&gt;\n\n&lt;p&gt;In other cases, your relationships are not so toxic that they are dragging your life down, but you may have trouble expressing yourself and asserting yourself in a healthy way. We live in a generation where we are trained to be people-pleasers, unfortunately, people pleasers sacrifice their own well-being for the sake of ‘niceness’, if this is you, you must learn to disagree with other people, and to be okay with being vulnerable by being genuine. &lt;/p&gt;\n\n&lt;p&gt;If you’re having trouble relating with people in a healthy (and mostly positive), way, it doesn’t matter how much money you have, you can’t expect to feel truly content and fulfilled. &lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Physical Health&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;We take our health for granted until we lose it. If your physical health is not up to par with the other areas of your life, prioritize it. Of course, the most common health problem in America is weight control. &lt;/p&gt;\n\n&lt;p&gt;For most people, being overweight is a huge blow to their self-esteem. When you’re overweight you may not feel like you’re in control of yourself, and you can easily feel inferior and judged. You could tell yourself that you shouldn’t feel this way, but this is more likely to bring attention to the issue than fix it (I am happy with my body, I am happy with my body, I am happy with my body… fuck) &lt;/p&gt;\n\n&lt;p&gt;Being fat sucks, and it’s frustrating, and you’re probably not okay with it. The only way to properly address it is to get in shape, we all have a million excuses, but this can be a constant source of stress until you die, or it can be transformed into a source of pride because you overcame it. &lt;/p&gt;\n\n&lt;p&gt;If you prefer to be fat, or it doesn’t bother you at all, it’s still a health issue, and the major health issues being overweight can cause are also huge sources of distress. &lt;/p&gt;\n\n&lt;p&gt;If you’re overweight and you’re not happy, don’t expect a trip to the Bahamas or a promotion to make you feel better, body image is such an integral part of our self-esteem that it can’t be ignored (by the way I’m not saying that it should be this way, just that it is).&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Find Your Blindspots&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Those are the three most important areas of your life that can suck. If any of them do suck, you can’t expect to feel good about yourself until you make them better. The human brain doesn’t do a good job at sorting out issues and stressors by their importance, whatever issue you focus on will feel like the most important thing you can do, whether it be getting to a higher rank in league of legends or getting a raise (even if you already make 6 figures). &lt;/p&gt;\n\n&lt;p&gt;Make sure you don’t have a blindspot that’s getting in the way of your well-being. Measure where you’re at in each of the three pillars areas, and find the weakest link. That’s your main source of stress. That’s what’s getting in the way of your well-being, more than anything else. &lt;/p&gt;\n\n&lt;p&gt;Psychologists have found that the best route to improving your well-being isn’t to improve your life by adding more good things, but to take away things that are negatively impacting us. This is because we have an inherent negativity bias, and this bias makes it so that negative emotions are weighed about 3 times as heavily as positive emotions by your brain. &lt;/p&gt;\n\n&lt;p&gt;Getting more money when you already have enough won’t make you much happier, trying to gain 20 pounds of muscle when you’re already in above-average shape won’t make you much happier. But if you’re in poverty, money is a source of stress, so getting out of poverty will have a big impact on your well-being. If you’re obese, that obesity causes a lot of stress, so losing weight until you’re in the healthy range, will improve your well-being. &lt;/p&gt;\n\n&lt;p&gt;Rate yourself on the three pillars write down what goal you would need to meet to reach a point where that area of your life isn’t holding you back from well-being. Focus on that, and as you make progress notice how your life satisfaction improves, notice how your stress levels decrease. &lt;/p&gt;\n\n&lt;p&gt;The first step to high life-satisfaction is to be aware of the problem, and it’s shocking how easy it is for us to be blind to what’s really holding us back. When we can take a step back, and humbly evaluate ourselves, we can get a more objective, third-person view of what’s affecting us, and then the path towards an even better life becomes clear. &lt;/p&gt;\n\n&lt;p&gt;This was taken from the blog at:\n&lt;a href=\"https://tpsychnation.com/\"&gt;https://tpsychnation.com/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As a human, you are host to a problem-solving supercomputer. In fact, when you’re not daydreaming about having an affair with a celebrity or reaching max-level in your favorite pay-to-win smartphone game; you’re probably thinking about your day-to-day real life problems. \n\nWhy?\n\nTo solve them, of course.\n\nYou might think about how you would feel better if you got in shape. Or you might think, “If I quit my job and stop working for that asshat, things will get better.” Your brain has a fantastic ability to imagine future scenarios and to think up schemes intended to improve your life.\n\nBut there’s a small problem…\n\nWe think we know what makes us feel good, both short-term and long term (i.e. sex/a good job). Surprisingly, though, psychologists have found that we are essentially clueless about what makes us happy. We are more or less emotionally blind to ourselves. Not only that, we’re blind to our emotional blindness. \n\nWe feel like we know what will make us happy and what will stress us out, but have you ever questioned this assumption? \nHave you considered that the problems we spend hours thinking about each day might lead us on fruitless Don Quixote-esque pursuits? Maybe we’re chasing ghosts. \n\nAll of your mind’s self-improvement schemes might be helpful, but what if the thing that’s really damaging your well-being is something you’re not even aware of? \n\nWe all have blindspots, no one is perfectly self-aware, but what if you’re blind to the thing in your life that is having the largest negative impact on your well-being?\n\nTake me, for example…\n\nI’ve always devalued money, I’ve thought of it as a nasty thing and I wanted nothing to do with it. I spent my money carelessly and put little thought into improving my financial situation. I didn’t think about money, I didn’t worry about money. I told myself I had other more important and ‘elevated concerns’, yet despite my blindness to its importance, money still mattered. Despite my blindness to money, my lack of an income was still causing me stress. Despite my blindness to it, money was still a 1000-pound gorilla on my back. \n\nMy relationship with money was causing me constant stress, but I wasn’t consciously aware my relationship with money was problematic- I was blind to my blindness. Unfortunately, it’s easy to be unaware of the real causes of your stress and to spend energy on smaller problems. There’s a good chance you’re doing this as well, but of course, you don’t know this.\n\nIs there a solution? \n\nYes, you must take a step back from the voice in your head and look at more objective measures for your happiness. \n\n&amp;nbsp;\n\n**The Three Pillars**\n\n&amp;nbsp;\n\nThere are three pillars of life satisfaction. If you aren’t satisfying one of these needs adequately, it can cause suffocating levels of psychological stress. \n\nTake a moment to evaluate yourself on these three pillars, because no matter how much you improve the other areas of your life, if one of these pillars isn’t up to par with the others, you must focus on improving that area to significantly improve your well-being. \n\nLook at it this way, imagine you want to compete in a triathlon, your running ability is amazing, you’d rate yourself a 9/10. Your cycling is also very good, you’d rate yourself an 8/10. \n\nBut…\n\nYour swimming is terrible, you barely ever swim, and have never developed the skill, you’d rate yourself a 2/10. \n\nHow would you train for the triathlon? Spending time on running or cycling wouldn’t be of much value to you until you got your swimming up to par. You could train to be the best runner in the world, but you still wouldn’t win if you didn’t improve your swimming ability.\n\nIt’s easy to fall into this same situation in real life, and not even be aware of it. \n\nTake a moment to measure your performance in the three pillars of life-satisfaction and you may find that you’ve had a huge blindspot that’s been limiting your well-being.\n\n&amp;nbsp;\n\n**Monetary Wealth**\n\n&amp;nbsp;\n\nResearch has found that money does correlate with happiness, up to about the 75,000 dollar a year mark (which so happens to be the amount of money necessary to take care of your basic needs), past that, money has almost no effect on your emotional well-being. \n\nMoney is always going to be a source of stress, but if you make less than the amount necessary to take care of your basic needs, it can be debilitating.  \n\nBut just making $75,000/year isn’t enough, if you make your money from a career that feels meaningless, you’ve got a better problem, but still a substantial one. Working a corporate job for a company you’re ambivalent towards and for a boss you hate is a steady drain on your psyche. It’s not so immediately painful as making too little money, but if you don’t feel like you’re accomplishing something meaningful with your time, your life won’t feel very satisfying. \n\nFortunately, if you need to change your career, time you spend towards finding something better will be enjoyable, you will be focused and determined. Once you accept that this area of your life isn’t being properly managed, and you hone in on the value you want to strive for, your efforts towards solving the problem will be stress-relieving; because that stress you felt existed because your previous career didn’t satisfy your most important psychological needs.\n\n&amp;nbsp;\n\n**Relationships**\n\n&amp;nbsp;\n \nRelationships are, of course, the most important area of most people’s lives, they’re also one of the biggest sources of stress and frustration. Human relationships always have and always will involve a certain level of compromise, your values will never perfectly align with someone else’s. \n\nWhen a relationship is toxic and destructive, it can poison the rest of your life, whether it be a close friendship, a family member, or a lover, if your thoughts often turn to how someone is frustrating you, you must address this. \n\nIn some cases, the only solution is to extricate yourself from the toxic relationship, if your girlfriend cheated on you, and you resent them for it, staying in that relationship might be easier than being alone and having to find someone else. But it also might be the only option that can lead to your long-term well-being. \n\nI’ve literally ‘broken up’ with friends before, this might seem extreme, but if you and someone you know are having a consistently negative impact on each other, it’s worth ending that relationship for both of your sakes. Remember, you are the average of the 5 people you’re around the most. \n\nIn other cases, your relationships are not so toxic that they are dragging your life down, but you may have trouble expressing yourself and asserting yourself in a healthy way. We live in a generation where we are trained to be people-pleasers, unfortunately, people pleasers sacrifice their own well-being for the sake of ‘niceness’, if this is you, you must learn to disagree with other people, and to be okay with being vulnerable by being genuine. \n\nIf you’re having trouble relating with people in a healthy (and mostly positive), way, it doesn’t matter how much money you have, you can’t expect to feel truly content and fulfilled. \n\n&amp;nbsp;\n\n**Physical Health**\n\n&amp;nbsp;\n \nWe take our health for granted until we lose it. If your physical health is not up to par with the other areas of your life, prioritize it. Of course, the most common health problem in America is weight control. \n\nFor most people, being overweight is a huge blow to their self-esteem. When you’re overweight you may not feel like you’re in control of yourself, and you can easily feel inferior and judged. You could tell yourself that you shouldn’t feel this way, but this is more likely to bring attention to the issue than fix it (I am happy with my body, I am happy with my body, I am happy with my body… fuck) \n\nBeing fat sucks, and it’s frustrating, and you’re probably not okay with it. The only way to properly address it is to get in shape, we all have a million excuses, but this can be a constant source of stress until you die, or it can be transformed into a source of pride because you overcame it. \n\nIf you prefer to be fat, or it doesn’t bother you at all, it’s still a health issue, and the major health issues being overweight can cause are also huge sources of distress. \n\nIf you’re overweight and you’re not happy, don’t expect a trip to the Bahamas or a promotion to make you feel better, body image is such an integral part of our self-esteem that it can’t be ignored (by the way I’m not saying that it should be this way, just that it is).\n\n&amp;nbsp;\n\n**Find Your Blindspots**\n\n&amp;nbsp;\n\nThose are the three most important areas of your life that can suck. If any of them do suck, you can’t expect to feel good about yourself until you make them better. The human brain doesn’t do a good job at sorting out issues and stressors by their importance, whatever issue you focus on will feel like the most important thing you can do, whether it be getting to a higher rank in league of legends or getting a raise (even if you already make 6 figures). \n\nMake sure you don’t have a blindspot that’s getting in the way of your well-being. Measure where you’re at in each of the three pillars areas, and find the weakest link. That’s your main source of stress. That’s what’s getting in the way of your well-being, more than anything else. \n\nPsychologists have found that the best route to improving your well-being isn’t to improve your life by adding more good things, but to take away things that are negatively impacting us. This is because we have an inherent negativity bias, and this bias makes it so that negative emotions are weighed about 3 times as heavily as positive emotions by your brain. \n\nGetting more money when you already have enough won’t make you much happier, trying to gain 20 pounds of muscle when you’re already in above-average shape won’t make you much happier. But if you’re in poverty, money is a source of stress, so getting out of poverty will have a big impact on your well-being. If you’re obese, that obesity causes a lot of stress, so losing weight until you’re in the healthy range, will improve your well-being. \n\nRate yourself on the three pillars write down what goal you would need to meet to reach a point where that area of your life isn’t holding you back from well-being. Focus on that, and as you make progress notice how your life satisfaction improves, notice how your stress levels decrease. \n\nThe first step to high life-satisfaction is to be aware of the problem, and it’s shocking how easy it is for us to be blind to what’s really holding us back. When we can take a step back, and humbly evaluate ourselves, we can get a more objective, third-person view of what’s affecting us, and then the path towards an even better life becomes clear. \n\nThis was taken from the blog at:\nhttps://tpsychnation.com/", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65gr2c", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Aghayden", "saved": false, "mod_reports": [], "name": "t3_65gr2c", "subreddit_name_prefixed": "r/DecidingToBeBetter", "approved_by": null, "over_18": false, "domain": "self.DecidingToBeBetter", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/F6AGihc6sjMmnVLm-XWIe0jcP2vPZpBwjOqH2PhZX-c.jpg?s=56a677929f9af56fa137ae07c36cfd15", "width": 200, "height": 200}, "resolutions": [{"url": "https://i.redditmedia.com/F6AGihc6sjMmnVLm-XWIe0jcP2vPZpBwjOqH2PhZX-c.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=482dd3c6232f59884e434a498faa2cbd", "width": 108, "height": 108}], "variants": {}, "id": "sAYY86zgdT-GUuuQxQ55XhcVr4wy0uMIajd_UOBdg3Y"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2tand", "edited": 1492269628.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/DecidingToBeBetter/comments/65gr2c/the_three_pillars_of_life_satisfaction/", "num_reports": null, "locked": false, "stickied": false, "created": 1492251076.0, "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/65gr2c/the_three_pillars_of_life_satisfaction/", "author_flair_text": null, "quarantine": false, "title": "The Three Pillars of Life Satisfaction", "created_utc": 1492222276.0, "distinguished": null, "media": null, "upvote_ratio": 0.58, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]