[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "StardewValley", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a continuation of the series on my take of each of the eligible bachelors/bachelorettes in Stardew Valley. As usual, I&amp;#39;m not a professional counselor... it&amp;#39;s just my opinion, and they&amp;#39;re open to discussion and debate. :)&lt;/p&gt;\n\n&lt;p&gt;Elliott is a sentimental man with a flair for style and elegance. He prefers the finer things in life, but at the same time, he lives in a shack on the beach... a quirk that he explains as an attempt at inspiration, although he admits that his finances are not the best. Elliott is a huge flirt with both men and women alike. He&amp;#39;s a pretty man, a poetic soul, and a born romantic, and he&amp;#39;s the kind of guy that makes men roll their eyes and women trip over their own feet. But Elliott has a bit of an ego, a tendency to be snobbish and snooty, and has a bad habit of pointing out other people&amp;#39;s faults. Let&amp;#39;s take a look at Elliott.&lt;/p&gt;\n\n&lt;p&gt;Elliott is a bit full of himself. He is looking for attention from everyone, and a particular type of attention: admiration. He wants people to admire him, and for any reason he can get. Good looking people get admired, so he puts a lot of effort into his appearance. Artistic people get admired, so he makes every effort to remind everyone that he&amp;#39;s a writer. Eloquent people get admired, so his speech is flowery, concise, and designed to make others think he is a worldly, sophisticated man. And to some extent, he IS a sophisticated man... he makes the effort to be one, and he succeeds in many aspects. But... well... he&amp;#39;s just not QUITE the figure of admiration he wishes he could be, and he knows it.&lt;/p&gt;\n\n&lt;p&gt;This somewhat snobbish behavior comes from feelings of inadequacy stemmed from... I&amp;#39;m not sure what, but I&amp;#39;m guessing being bullied as a child. His past is completely unknown and he doesn&amp;#39;t let slip anything. The fact that he doesn&amp;#39;t ever mention his past suggests three things: he&amp;#39;s a man who lives in the present, he was smarter than his peers as a child, and his childhood was likely full of bullies. It&amp;#39;s a stretch, I&amp;#39;ll grant you, but stay with me here.&lt;/p&gt;\n\n&lt;p&gt;My guess is that Elliott was never an athletic child, and so his interests turned to the intellectual. This intellectual interest made him book-smarter than most other kids, and combined with his creative interests, this made him a target for kids who neither understood him nor liked him: he most likely got beaten up a lot. Since Elliott was book-smarter than most others, his attitude slowly turned him against these bullies; he felt himself superior to them, and his snooty attitude was born. After all, in his mind, only low-born idiots resort to physical violence instead of intellectual discussion, so what other reason could there be?&lt;/p&gt;\n\n&lt;p&gt;This snobbish attitude naturally made him unpopular to most kids, which made those few friends he was able to make incredibly important to him; likely to the point of acting as a social chameleon, blending in with his friends and matching their interests in an attempt to ingratiate himself with them. &lt;/p&gt;\n\n&lt;p&gt;We can see a bit of this with Elliott&amp;#39;s 2 heart event. He immediately latches onto you as his inspiration, despite the fact you&amp;#39;ve really done nothing that might inspire him other than &amp;quot;that look in your eyes that says you believe in him&amp;quot;. Exactly what had you done up to that point that would put that look in your eyes? Nothing. Elliott saw what he WANTED to see, and he created a deeper connection than what actually existed in order to ingratiate himself with you. This is even more accentuated by the fact he decides to write a book based on your suggestion rather than by his own choice, and further yet again when he joins you for a drink during the 4 heart event. Take a look at the choices you&amp;#39;re given during the toast: if you say &amp;quot;To our friendship!&amp;quot; his friendship goes up big time... his attempt to ingratiate himself with you has worked, and he&amp;#39;s incredibly happy about it! But if you badmouth him, it has the exact opposite effect... all his hard work has been for nothing, and you&amp;#39;re just another bully. &lt;/p&gt;\n\n&lt;p&gt;And it happens yet again, in the 6 heart event, when he talks about how hard his life is and wishes he could be a farmer... he&amp;#39;s trying to flatter you, not realizing that he&amp;#39;s making a social faux pas. He&amp;#39;s not actually sincere about his wish... he just wants you to like him. We can see that in both of your answers: if you tell him farmers work hard too, he gets upset that he may have accidentally offended you and immediately retracts what he said; if you tell him to come help on the farm, he realizes he&amp;#39;s just had his bluff called and he backpedals faster than an X-Games cyclist doing a trick. He doesn&amp;#39;t actually want to WORK for a living... that would be physical, not intellectual!&lt;/p&gt;\n\n&lt;p&gt;This pattern is indicative of a guy with low self-esteem desperately trying to keep a friendship, all the while expecting that friend to call him out as a fraud at any time and walk out of his life. Elliott is merely book-smart, not actually wise or naturally intelligent, so his self-esteem is based on the intellectual and creative world. But you, The Farmer, are a physical being, good with the earth and with your hands, and usually people like that are bullies to Elliott. The fact that you&amp;#39;re not a bully, that you&amp;#39;re a good and decent person to Elliott, means that he can let down his guard around you. That&amp;#39;s something that has never happened to Elliott, not by someone like you. Suddenly, the only admiration he needs... is yours.&lt;/p&gt;\n\n&lt;p&gt;Look at the 8 heart event for a minute. He is there to read his book for a public appearance, and the entire town is there to listen. But if you notice... by the time the reading has ended, there aren&amp;#39;t very many people left listening. Of course, there could be a multitude of reasons why people left, but the results are still the same: his work wasn&amp;#39;t engrossing enough to stay and listen. This indicates that, despite his desire to be a successful writer, he&amp;#39;s no Stephen King. This isn&amp;#39;t a bad thing... we can&amp;#39;t all be brilliant, and at least he&amp;#39;s trying to achieve his dream, so no disrespect to Elliott for that.&lt;/p&gt;\n\n&lt;p&gt;But his reaction to so many people walking out on his reading is telling. One would think that someone who had that kind of negative response to his work, especially someone who craves admiration and attention as much as Elliott, wouldn&amp;#39;t be quite so happy about the outcome of his reading. Yet he seems pleased by the outcome and can&amp;#39;t wait to rush to you to tell you about it. For a guy who&amp;#39;s looking for admiration from everybody and who&amp;#39;s kind of snooty and egotistical... doesn&amp;#39;t that strike you as a little odd?&lt;/p&gt;\n\n&lt;p&gt;Well, not if his subject of admiration is you. As strange as it may sound, our handsome, intellectual, well-spoken Elliott... is desperately lonely. His need for admiration was originally for ANYONE who would give it to him, but the fact he didn&amp;#39;t have to be a social chameleon in order to be your friend has changed his outlook completely. Suddenly, he doesn&amp;#39;t need the approval of the rest of the world. He needs yours. You just became the object of an obsession. Well done! I guess.&lt;/p&gt;\n\n&lt;p&gt;Now, I&amp;#39;m not talking about Silence of the Lambs psycho obsession here... you&amp;#39;re not going to wake up and find your pet being roasted alive because it got more attention than Elliott is getting. But it IS a type of obsession where Elliott has pinned all his self-esteem on your positive approval of him. The game doesn&amp;#39;t go into it, but if you WERE to suddenly turn on Elliott later after the 10 heart event, his reaction to your disapproval would be... ugly. You know that psycho ex-girlfriend/boyfriend you have that won&amp;#39;t leave you alone and goes way overboard to try and get you back and is seriously taking things to the point of creepy, obsessive, and jail-worthy? That would be Elliott being rejected by you. Enter this relationship at your own risk.&lt;/p&gt;\n\n&lt;p&gt;But all in all, Elliott might be snobby and full of himself, but he IS a creative and decent enough guy. He gives credit where credit is due, he&amp;#39;s a romantic and eloquent man who would likely give you the ride of your life, and his obsession with you means he&amp;#39;ll never leave your nor cheat on you... he is yours. Period. &lt;/p&gt;\n\n&lt;p&gt;What kind of person would do well with Elliott in real life? Anyone who was decent to him, really. Elliott needs to feel wanted and admired, and he&amp;#39;d do anything to have you feel that way. If you&amp;#39;re the manipulating type, you&amp;#39;re probably going to recognize his need and turn him into your personal sex-toy; if you&amp;#39;re the generous type, he&amp;#39;s going to probably do that to you. He needs someone who recognizes his need for what it is, and assure him that he doesn&amp;#39;t need to conform to you... you can accept him for who he is, flaws and all. But Elliott needs help, professional help, to get past his need for admiration. Since we don&amp;#39;t know his history, there&amp;#39;s no way to determine exactly what would help him get past this need for approval, and since he doesn&amp;#39;t seem willing to talk about it, he&amp;#39;s going to need a psychologist to pry it out of him. Don&amp;#39;t write him off, however... Elliott is a decent guy who just needs a good person to help him through this flaw in his personality, and he&amp;#39;ll be your best friend and companion.&lt;/p&gt;\n\n&lt;p&gt;If only he didn&amp;#39;t remind me of Fabio... ugh....&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is a continuation of the series on my take of each of the eligible bachelors/bachelorettes in Stardew Valley. As usual, I'm not a professional counselor... it's just my opinion, and they're open to discussion and debate. :)\n\nElliott is a sentimental man with a flair for style and elegance. He prefers the finer things in life, but at the same time, he lives in a shack on the beach... a quirk that he explains as an attempt at inspiration, although he admits that his finances are not the best. Elliott is a huge flirt with both men and women alike. He's a pretty man, a poetic soul, and a born romantic, and he's the kind of guy that makes men roll their eyes and women trip over their own feet. But Elliott has a bit of an ego, a tendency to be snobbish and snooty, and has a bad habit of pointing out other people's faults. Let's take a look at Elliott.\n\nElliott is a bit full of himself. He is looking for attention from everyone, and a particular type of attention: admiration. He wants people to admire him, and for any reason he can get. Good looking people get admired, so he puts a lot of effort into his appearance. Artistic people get admired, so he makes every effort to remind everyone that he's a writer. Eloquent people get admired, so his speech is flowery, concise, and designed to make others think he is a worldly, sophisticated man. And to some extent, he IS a sophisticated man... he makes the effort to be one, and he succeeds in many aspects. But... well... he's just not QUITE the figure of admiration he wishes he could be, and he knows it.\n\nThis somewhat snobbish behavior comes from feelings of inadequacy stemmed from... I'm not sure what, but I'm guessing being bullied as a child. His past is completely unknown and he doesn't let slip anything. The fact that he doesn't ever mention his past suggests three things: he's a man who lives in the present, he was smarter than his peers as a child, and his childhood was likely full of bullies. It's a stretch, I'll grant you, but stay with me here.\n\nMy guess is that Elliott was never an athletic child, and so his interests turned to the intellectual. This intellectual interest made him book-smarter than most other kids, and combined with his creative interests, this made him a target for kids who neither understood him nor liked him: he most likely got beaten up a lot. Since Elliott was book-smarter than most others, his attitude slowly turned him against these bullies; he felt himself superior to them, and his snooty attitude was born. After all, in his mind, only low-born idiots resort to physical violence instead of intellectual discussion, so what other reason could there be?\n\nThis snobbish attitude naturally made him unpopular to most kids, which made those few friends he was able to make incredibly important to him; likely to the point of acting as a social chameleon, blending in with his friends and matching their interests in an attempt to ingratiate himself with them. \n\nWe can see a bit of this with Elliott's 2 heart event. He immediately latches onto you as his inspiration, despite the fact you've really done nothing that might inspire him other than \"that look in your eyes that says you believe in him\". Exactly what had you done up to that point that would put that look in your eyes? Nothing. Elliott saw what he WANTED to see, and he created a deeper connection than what actually existed in order to ingratiate himself with you. This is even more accentuated by the fact he decides to write a book based on your suggestion rather than by his own choice, and further yet again when he joins you for a drink during the 4 heart event. Take a look at the choices you're given during the toast: if you say \"To our friendship!\" his friendship goes up big time... his attempt to ingratiate himself with you has worked, and he's incredibly happy about it! But if you badmouth him, it has the exact opposite effect... all his hard work has been for nothing, and you're just another bully. \n\nAnd it happens yet again, in the 6 heart event, when he talks about how hard his life is and wishes he could be a farmer... he's trying to flatter you, not realizing that he's making a social faux pas. He's not actually sincere about his wish... he just wants you to like him. We can see that in both of your answers: if you tell him farmers work hard too, he gets upset that he may have accidentally offended you and immediately retracts what he said; if you tell him to come help on the farm, he realizes he's just had his bluff called and he backpedals faster than an X-Games cyclist doing a trick. He doesn't actually want to WORK for a living... that would be physical, not intellectual!\n\nThis pattern is indicative of a guy with low self-esteem desperately trying to keep a friendship, all the while expecting that friend to call him out as a fraud at any time and walk out of his life. Elliott is merely book-smart, not actually wise or naturally intelligent, so his self-esteem is based on the intellectual and creative world. But you, The Farmer, are a physical being, good with the earth and with your hands, and usually people like that are bullies to Elliott. The fact that you're not a bully, that you're a good and decent person to Elliott, means that he can let down his guard around you. That's something that has never happened to Elliott, not by someone like you. Suddenly, the only admiration he needs... is yours.\n\nLook at the 8 heart event for a minute. He is there to read his book for a public appearance, and the entire town is there to listen. But if you notice... by the time the reading has ended, there aren't very many people left listening. Of course, there could be a multitude of reasons why people left, but the results are still the same: his work wasn't engrossing enough to stay and listen. This indicates that, despite his desire to be a successful writer, he's no Stephen King. This isn't a bad thing... we can't all be brilliant, and at least he's trying to achieve his dream, so no disrespect to Elliott for that.\n\nBut his reaction to so many people walking out on his reading is telling. One would think that someone who had that kind of negative response to his work, especially someone who craves admiration and attention as much as Elliott, wouldn't be quite so happy about the outcome of his reading. Yet he seems pleased by the outcome and can't wait to rush to you to tell you about it. For a guy who's looking for admiration from everybody and who's kind of snooty and egotistical... doesn't that strike you as a little odd?\n\nWell, not if his subject of admiration is you. As strange as it may sound, our handsome, intellectual, well-spoken Elliott... is desperately lonely. His need for admiration was originally for ANYONE who would give it to him, but the fact he didn't have to be a social chameleon in order to be your friend has changed his outlook completely. Suddenly, he doesn't need the approval of the rest of the world. He needs yours. You just became the object of an obsession. Well done! I guess.\n\nNow, I'm not talking about Silence of the Lambs psycho obsession here... you're not going to wake up and find your pet being roasted alive because it got more attention than Elliott is getting. But it IS a type of obsession where Elliott has pinned all his self-esteem on your positive approval of him. The game doesn't go into it, but if you WERE to suddenly turn on Elliott later after the 10 heart event, his reaction to your disapproval would be... ugly. You know that psycho ex-girlfriend/boyfriend you have that won't leave you alone and goes way overboard to try and get you back and is seriously taking things to the point of creepy, obsessive, and jail-worthy? That would be Elliott being rejected by you. Enter this relationship at your own risk.\n\nBut all in all, Elliott might be snobby and full of himself, but he IS a creative and decent enough guy. He gives credit where credit is due, he's a romantic and eloquent man who would likely give you the ride of your life, and his obsession with you means he'll never leave your nor cheat on you... he is yours. Period. \n\nWhat kind of person would do well with Elliott in real life? Anyone who was decent to him, really. Elliott needs to feel wanted and admired, and he'd do anything to have you feel that way. If you're the manipulating type, you're probably going to recognize his need and turn him into your personal sex-toy; if you're the generous type, he's going to probably do that to you. He needs someone who recognizes his need for what it is, and assure him that he doesn't need to conform to you... you can accept him for who he is, flaws and all. But Elliott needs help, professional help, to get past his need for admiration. Since we don't know his history, there's no way to determine exactly what would help him get past this need for approval, and since he doesn't seem willing to talk about it, he's going to need a psychologist to pry it out of him. Don't write him off, however... Elliott is a decent guy who just needs a good person to help him through this flaw in his personality, and he'll be your best friend and companion.\n\nIf only he didn't remind me of Fabio... ugh....", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "64ug29", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 24, "report_reasons": null, "author": "Squeaking_Lion", "saved": false, "mod_reports": [], "name": "t3_64ug29", "subreddit_name_prefixed": "r/StardewValley", "approved_by": null, "over_18": false, "domain": "self.StardewValley", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2wb7y", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": "abigail", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/StardewValley/comments/64ug29/an_indepth_look_at_the_character_of_elliott/", "num_reports": null, "locked": false, "stickied": false, "created": 1491980882.0, "url": "https://www.reddit.com/r/StardewValley/comments/64ug29/an_indepth_look_at_the_character_of_elliott/", "author_flair_text": "", "quarantine": false, "title": "An In-Depth Look At The Character Of: Elliott", "created_utc": 1491952082.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_64ug29", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_64ug29", "likes": null, "replies": "", "user_reports": [], "id": "dg70jwq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "valoreii", "parent_id": "t1_dg5ks6n", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I completely agree! I love Elliot to bits and I think this is exactly how his character is", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely agree! I love Elliot to bits and I think this is exactly how his character is&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg70jwq", "score_hidden": false, "stickied": false, "created": 1492079940.0, "created_utc": 1492051140.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_64ug29", "likes": null, "replies": "", "user_reports": [], "id": "dge4e5t", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "amaep", "parent_id": "t1_dg5ks6n", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I also agree with this assessment of Elliot's character. It is very obvious he is a writer with a block and the farmer comes along and gains his trust and friendship which slowly tears down that block in creativity. Elliot is a simple quiet man who kept to himself and was just trying to do something he was very passionate about the best way he knew how.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I also agree with this assessment of Elliot&amp;#39;s character. It is very obvious he is a writer with a block and the farmer comes along and gains his trust and friendship which slowly tears down that block in creativity. Elliot is a simple quiet man who kept to himself and was just trying to do something he was very passionate about the best way he knew how.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dge4e5t", "score_hidden": false, "stickied": false, "created": 1492491911.0, "created_utc": 1492463111.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ks6n", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "greymeta", "parent_id": "t3_64ug29", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "**Edit:** Edited for grammar and to make my points more concise.\n\nI've kept quiet about your posts for other characters since I'm unfamiliar with them, but let me just say this: I think the bachelor(ette)s in this game are far more well-adjusted than the extremities you've suggested. I have a lot more to say on Elliott though.\n\nFor one, I do not get the vibe that he's a snooty snob. Do not get me wrong; he *is* vain, with his long hair and insistence on wearing suits while living on a beach. There are no lines where he puts people down and points out faults. That's what Haley does (in the beginning, I'd want to add). \n\nElliott moved to his shack on the beach a year before the farmer. In that time, he had kept to himself because of his writing and, if he were to keep the same schedule as he has currently in-game, ventured into town only once or twice a week. Though a year is ample time to socialise, he had only made friends with a couple of Pelican Town folks (Willy and Leah; his neighbour and the other artistic out-of-towner). \n\nYou have said that he wanted to look for attention from everyone. I counter that he hasn't even interacted with most of the town. \n\nI am paraphrasing here, but Mayor Lewis had said that the townfolk were wary of strangers. That's what Elliott is to most of them. That is why everyone in town feel less inclined to support his book reading and why most had left before he even finished.\n\nCompare this with Leah's art show, where everyone shows up in the town square and paid rapt attention when Leah talks about her artwork and even compliments and bids her pieces. \n\nOr even compare this with Sam's concert with his band. Although it's an event held in a location a bus ride away from Pelican Town, his family still took time to show up and be there for him.\n\nWhy does he keeps to himself? Well, he was expecting the shack to be a temporary retreat. In fact, he was starting to lose hope when a year passed and he still doesn't have the novel written. Then this farmer moved in, gave him a genre to write about and through the year became friends with him. He became motivated to complete this novel, and succeed in doing so because of this friendship.\n\nNotice that he doesn't refer to the town as his home truly until after the farmer's 10-heart with him. He had change this view because of the farmer's *support* for him and his writing.\n\nThat's the word. Elliott didn't want admiration, he wants *support*. It is something he didn't get in his hometown, which was why he moved away. It is also something he gets so few of in Pelican Town. To him, having people support his writing is the most important thing, and he was never home until he found that.\n\nThe lack of support is also why he was melancholic and even dramatic at times when the farmer talk to him. This side of him shows up on some lines here (dialogue taken from the game files and adjusted for formatting):\n\nMonday @ 4 hearts: \n&gt; \"I hope you've come to think of this place as 'home'.\"\n\nI felt that this line, with the context of his 10-heart event I've mentioned earlier, put this in a new light.\n\nWednesday @ 8 hearts: \n&gt;\"Sorry, I'm feeling morose today. I wish there was more certainty about the future. I don't want to grow old as a lonely hermit on this beach...\"\n\nSummer Tuesday @ 6 hearts:\n&gt;\"I write in hopes of connecting with others through time and space. *sigh*...times are changing, though. People don't read anymore.\"\n\nThese next set are pretty telling, imo. They all take place on Tuesdays, when the farmer is at various heart levels with him, i.e. how far is he from completing his novel he had begun because of the farmer: \n\n@ 2 hearts:\n&gt; \"I can't seem to find the inspiration to begin writing my novel...\"\n\n@ 4 hearts:\n&gt; \"I've been feeling hopeful lately. Perhaps the weather is changing.\"\n\n@ 6 hearts:\n&gt; \"Sometimes I wonder if I might just have an inflated self-image and no real skills... No, no... I'm not fishing for compliments. Though they are appreciated...\"\n\n@ 8 hearts:\n&gt; \"It's a little lonely out here on the beach... so I apologize if I was ever a little too forward with you when we first met. I was just eager to have a friend. It feels good to have a close friend like you.\"\n\nCompare this to his dialogue after the farmer and him are married. [Please click on this link here because I don't want to make this post bigger than it already is.](http://ribbonsandstars.tumblr.com/post/155867530407/stardew-valley-elliott-marriage-dialogue). He is a lot more positive, makes jokes and became incredibly cheesy and even more over-the-top. The farmer has supported him, and now he wants to do the same to them in his own way - with coffee and seafood dinners and purple prose.\n\nTl;dr: I disagree that Elliott is snooty and needing of admiration to the point of requiring professional help. He just wanted someone who believes in him, and he found that someone with the farmer.\n\nThanks for spelling his name right at least.", "edited": 1492081195.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; Edited for grammar and to make my points more concise.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve kept quiet about your posts for other characters since I&amp;#39;m unfamiliar with them, but let me just say this: I think the bachelor(ette)s in this game are far more well-adjusted than the extremities you&amp;#39;ve suggested. I have a lot more to say on Elliott though.&lt;/p&gt;\n\n&lt;p&gt;For one, I do not get the vibe that he&amp;#39;s a snooty snob. Do not get me wrong; he &lt;em&gt;is&lt;/em&gt; vain, with his long hair and insistence on wearing suits while living on a beach. There are no lines where he puts people down and points out faults. That&amp;#39;s what Haley does (in the beginning, I&amp;#39;d want to add). &lt;/p&gt;\n\n&lt;p&gt;Elliott moved to his shack on the beach a year before the farmer. In that time, he had kept to himself because of his writing and, if he were to keep the same schedule as he has currently in-game, ventured into town only once or twice a week. Though a year is ample time to socialise, he had only made friends with a couple of Pelican Town folks (Willy and Leah; his neighbour and the other artistic out-of-towner). &lt;/p&gt;\n\n&lt;p&gt;You have said that he wanted to look for attention from everyone. I counter that he hasn&amp;#39;t even interacted with most of the town. &lt;/p&gt;\n\n&lt;p&gt;I am paraphrasing here, but Mayor Lewis had said that the townfolk were wary of strangers. That&amp;#39;s what Elliott is to most of them. That is why everyone in town feel less inclined to support his book reading and why most had left before he even finished.&lt;/p&gt;\n\n&lt;p&gt;Compare this with Leah&amp;#39;s art show, where everyone shows up in the town square and paid rapt attention when Leah talks about her artwork and even compliments and bids her pieces. &lt;/p&gt;\n\n&lt;p&gt;Or even compare this with Sam&amp;#39;s concert with his band. Although it&amp;#39;s an event held in a location a bus ride away from Pelican Town, his family still took time to show up and be there for him.&lt;/p&gt;\n\n&lt;p&gt;Why does he keeps to himself? Well, he was expecting the shack to be a temporary retreat. In fact, he was starting to lose hope when a year passed and he still doesn&amp;#39;t have the novel written. Then this farmer moved in, gave him a genre to write about and through the year became friends with him. He became motivated to complete this novel, and succeed in doing so because of this friendship.&lt;/p&gt;\n\n&lt;p&gt;Notice that he doesn&amp;#39;t refer to the town as his home truly until after the farmer&amp;#39;s 10-heart with him. He had change this view because of the farmer&amp;#39;s &lt;em&gt;support&lt;/em&gt; for him and his writing.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the word. Elliott didn&amp;#39;t want admiration, he wants &lt;em&gt;support&lt;/em&gt;. It is something he didn&amp;#39;t get in his hometown, which was why he moved away. It is also something he gets so few of in Pelican Town. To him, having people support his writing is the most important thing, and he was never home until he found that.&lt;/p&gt;\n\n&lt;p&gt;The lack of support is also why he was melancholic and even dramatic at times when the farmer talk to him. This side of him shows up on some lines here (dialogue taken from the game files and adjusted for formatting):&lt;/p&gt;\n\n&lt;p&gt;Monday @ 4 hearts: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I hope you&amp;#39;ve come to think of this place as &amp;#39;home&amp;#39;.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I felt that this line, with the context of his 10-heart event I&amp;#39;ve mentioned earlier, put this in a new light.&lt;/p&gt;\n\n&lt;p&gt;Wednesday @ 8 hearts: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Sorry, I&amp;#39;m feeling morose today. I wish there was more certainty about the future. I don&amp;#39;t want to grow old as a lonely hermit on this beach...&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Summer Tuesday @ 6 hearts:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I write in hopes of connecting with others through time and space. &lt;em&gt;sigh&lt;/em&gt;...times are changing, though. People don&amp;#39;t read anymore.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These next set are pretty telling, imo. They all take place on Tuesdays, when the farmer is at various heart levels with him, i.e. how far is he from completing his novel he had begun because of the farmer: &lt;/p&gt;\n\n&lt;p&gt;@ 2 hearts:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I can&amp;#39;t seem to find the inspiration to begin writing my novel...&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;@ 4 hearts:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;I&amp;#39;ve been feeling hopeful lately. Perhaps the weather is changing.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;@ 6 hearts:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Sometimes I wonder if I might just have an inflated self-image and no real skills... No, no... I&amp;#39;m not fishing for compliments. Though they are appreciated...&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;@ 8 hearts:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;It&amp;#39;s a little lonely out here on the beach... so I apologize if I was ever a little too forward with you when we first met. I was just eager to have a friend. It feels good to have a close friend like you.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Compare this to his dialogue after the farmer and him are married. &lt;a href=\"http://ribbonsandstars.tumblr.com/post/155867530407/stardew-valley-elliott-marriage-dialogue\"&gt;Please click on this link here because I don&amp;#39;t want to make this post bigger than it already is.&lt;/a&gt;. He is a lot more positive, makes jokes and became incredibly cheesy and even more over-the-top. The farmer has supported him, and now he wants to do the same to them in his own way - with coffee and seafood dinners and purple prose.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr: I disagree that Elliott is snooty and needing of admiration to the point of requiring professional help. He just wanted someone who believes in him, and he found that someone with the farmer.&lt;/p&gt;\n\n&lt;p&gt;Thanks for spelling his name right at least.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg5ks6n", "score_hidden": false, "stickied": false, "created": 1492008153.0, "created_utc": 1491979353.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_64ug29", "likes": null, "replies": "", "user_reports": [], "id": "dg5hn19", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "valoreii", "parent_id": "t3_64ug29", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I married Elliot and my sister always judges me for it lmao, but I've noticed a pattern in the guys I'm into. Uh, this any be a bit of a weird example, but take Mystic Messenger. It has a character called Zen who's pretty similar to Elliot- is creative (he's an actor) and is also quite full of himself (talks about his appearances a lot). However, the closer you become with him the more he takes care of you and he gets realllllyy attached, the same way I'd imagine Elliot is. The list continues... Ahn Min Hyuk from Strong Woman Do Bong Soon is similar (runs a video game company and is involved with the creative aspect, is snooty, then falls in love vvverrryy strongly with Do Bong Soon), and more. People always point out that he looks like Fabio to me that I've just started calling him Fabio ;-; Great breakdown of the character, I do agree that Elliot needs to get in touch with a psychologist, I just read the whole thing in a pessimistic tone so I kind of wish these were the tiniest bit more upbeat  \n\nAlso, I wouldn't think that people left Elliot's book reading because his book was bad, but mainly because these are some busy people. You often only see Penny, the kids, and Elliot in the library, and not much others. I personally thought that it was the fact that not many people read in the valley (the trio of Abigail, Sebastian, and Sam seem to mainly play video games and make music) and because of the fact that the book is probably long. Reading a book out loud takes much longer than reading it silently and eventually voices just become a background noise when they keep going and going. Maybe I'm just biased towards Elliot because I want him to be successful but hey, you never know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I married Elliot and my sister always judges me for it lmao, but I&amp;#39;ve noticed a pattern in the guys I&amp;#39;m into. Uh, this any be a bit of a weird example, but take Mystic Messenger. It has a character called Zen who&amp;#39;s pretty similar to Elliot- is creative (he&amp;#39;s an actor) and is also quite full of himself (talks about his appearances a lot). However, the closer you become with him the more he takes care of you and he gets realllllyy attached, the same way I&amp;#39;d imagine Elliot is. The list continues... Ahn Min Hyuk from Strong Woman Do Bong Soon is similar (runs a video game company and is involved with the creative aspect, is snooty, then falls in love vvverrryy strongly with Do Bong Soon), and more. People always point out that he looks like Fabio to me that I&amp;#39;ve just started calling him Fabio ;-; Great breakdown of the character, I do agree that Elliot needs to get in touch with a psychologist, I just read the whole thing in a pessimistic tone so I kind of wish these were the tiniest bit more upbeat  &lt;/p&gt;\n\n&lt;p&gt;Also, I wouldn&amp;#39;t think that people left Elliot&amp;#39;s book reading because his book was bad, but mainly because these are some busy people. You often only see Penny, the kids, and Elliot in the library, and not much others. I personally thought that it was the fact that not many people read in the valley (the trio of Abigail, Sebastian, and Sam seem to mainly play video games and make music) and because of the fact that the book is probably long. Reading a book out loud takes much longer than reading it silently and eventually voices just become a background noise when they keep going and going. Maybe I&amp;#39;m just biased towards Elliot because I want him to be successful but hey, you never know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg5hn19", "score_hidden": false, "stickied": false, "created": 1492001429.0, "created_utc": 1491972629.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_64ug29", "likes": null, "replies": "", "user_reports": [], "id": "dg53do1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "MurDoct", "parent_id": "t3_64ug29", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I call him Smelliott because it irritates my wife who decided to marry the guy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I call him Smelliott because it irritates my wife who decided to marry the guy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg53do1", "score_hidden": false, "stickied": false, "created": 1491981221.0, "created_utc": 1491952421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_64ug29", "likes": null, "replies": "", "user_reports": [], "id": "dg557gq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ahhhlexiseve", "parent_id": "t3_64ug29", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Elliot reminds me of Gilderoy Lockhart from Harry Potter and The Chamber of Secrets. He's a tad smarmy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Elliot reminds me of Gilderoy Lockhart from Harry Potter and The Chamber of Secrets. He&amp;#39;s a tad smarmy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg557gq", "score_hidden": false, "stickied": false, "created": 1491983702.0, "created_utc": 1491954902.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_64ug29", "likes": null, "replies": "", "user_reports": [], "id": "dg58vv4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sushi864", "parent_id": "t3_64ug29", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I think u should make this a weekly thing so it becomes a weekly treat :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think u should make this a weekly thing so it becomes a weekly treat :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg58vv4", "score_hidden": false, "stickied": false, "created": 1491988541.0, "created_utc": 1491959741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_64ug29", "likes": null, "replies": "", "user_reports": [], "id": "dgewlib", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ronsce", "parent_id": "t3_64ug29", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "When you DIVORCE him in the game, you make him just a sad man who doesn't want to talk to you or gifts from you, not a \"psycho ex-girlfriend/boyfriend you have that won't leave you alone and goes way overboard to try and get you back and is seriously taking things to the point of creepy, obsessive, and jail-worthy\". That's OOC.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When you DIVORCE him in the game, you make him just a sad man who doesn&amp;#39;t want to talk to you or gifts from you, not a &amp;quot;psycho ex-girlfriend/boyfriend you have that won&amp;#39;t leave you alone and goes way overboard to try and get you back and is seriously taking things to the point of creepy, obsessive, and jail-worthy&amp;quot;. That&amp;#39;s OOC.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dgewlib", "score_hidden": false, "stickied": false, "created": 1492536302.0, "created_utc": 1492507502.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]