[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "StardewValley", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a continuation of the series on my take of each of the eligible bachelors/bachelorettes in Stardew Valley. As usual, I&amp;#39;m not a professional counselor... it&amp;#39;s just my opinion, and they&amp;#39;re open to discussion and debate. :)&lt;/p&gt;\n\n&lt;p&gt;I deliberately left Shane and Abigail for last in this series, since those two seem to be the favorites for each sex. I think part of the reason they are so popular is because their stories are complete and don&amp;#39;t really leave much room for interpretation, like the rest of the bachelors/bachelorettes... the game does a fine job of giving us the whole picture, especially for Shane. To be honest, most of what I&amp;#39;m going to write for both Shane and Abigail are likely going to be things that everyone here already knows, because the game does a great job with both characters. Just FYI.&lt;/p&gt;\n\n&lt;p&gt;Shane is an alcoholic, as we all know. He has a tendency to be rude and abrupt at first, and even later he&amp;#39;s a rough and tumble kind of character who tells it like it is. He also suffers from a chronic depression, which is different than a situational depression... this means Shane can&amp;#39;t simply &amp;quot;get over&amp;quot; his depression by fixing a particular problem, he needs extensive and thorough psychotherapy in order to determine the root of his depression. &lt;/p&gt;\n\n&lt;p&gt;What is at the root of his depression, you may ask? I have no idea. We&amp;#39;re not given any information about Shane&amp;#39;s past at all. In fact, so much time is devoted to Shane&amp;#39;s alcoholism and depression that we hardly know anything about Shane, except perhaps his love of chickens. After a thorough examination of all his heart events and quotes and comments that he says throughout this game, there simply isn&amp;#39;t anything he says that gives us anything about Shane other than chickens, depression, and beer. Even looking close at the other characters in Stardew Valley, I find absolutely nothing about Shane&amp;#39;s history or personality. It&amp;#39;s a little aggravating, to be honest.&lt;/p&gt;\n\n&lt;p&gt;He works at JojaMart all the way up until he&amp;#39;s let go when you complete the Community Center... if you&amp;#39;re going for Shane as your hubby, you may want to go Joja Warehouse to prevent him from being fired. Although, all things considered, he doesn&amp;#39;t really like the job anyway, and maybe he&amp;#39;s be better off just raising his chickens when you marry him... JojaMart sucks, amirite?&lt;/p&gt;\n\n&lt;p&gt;The only indication of Shane&amp;#39;s past (and even that is iffy) is the 7 heart event, when he&amp;#39;s making a commercial for Joja Cola. It&amp;#39;s a contest for 10,000g, so it&amp;#39;s possible they&amp;#39;re just a group of amateurs here, but... it got me thinking. Could we have a clue as to what Shane did before Stardew Valley? Could Shane have been in the advertising biz, or perhaps in film or television? Again, there&amp;#39;s no indication one way or another, and once again... we are stymied by the mystery of Shane&amp;#39;s past.&lt;/p&gt;\n\n&lt;p&gt;The one aspect of Shane&amp;#39;s character outside of booze and chickens is his relationship with Jas, who is his goddaughter... and this just brings up even MORE questions. Goddaughter??? Someone entrusted this child to Shane? Why? Does this mean Shane was once sober, or did Jas&amp;#39; parents know Shane was an alcoholic and a depressive? How did Jas&amp;#39; parents die? And since they both live with Marnie (Shane&amp;#39;s aunt), how did THIS dynamic come about? Why does Shane care so much about Jas? Typically, alcoholism comes with a separation from others, like he does with the townsfolk and Marnie... so why is Jas&amp;#39; opinion of him so important? Does this have to do with his depression?&lt;/p&gt;\n\n&lt;p&gt;Annnnd.... that&amp;#39;s when it hit me. How it all tied together. The reason Shane is drinking himself into a stupor, the reason he feels he&amp;#39;s worthless and talks about self-hatred, the reason Jas is living with him, the reason Jas gets so upset when he talks about ending his life... it was obvious once it all clicked.&lt;/p&gt;\n\n&lt;p&gt;Jas&amp;#39; parents committed suicide, and Shane was unable to prevent it.&lt;/p&gt;\n\n&lt;p&gt;Before Shane came to Stardew Valley, he was good friends with Jas&amp;#39; parents... good enough for them to name him godfather of their child. He was dealing with depression even then, and was likely already an alcoholic. If I&amp;#39;m right, Jas&amp;#39; parents were also going through depression... it&amp;#39;s likely how they all met, in some sort of group counseling for alcohol abuse or depression. &lt;/p&gt;\n\n&lt;p&gt;This is all just guesswork, since we know nothing for certain, but I&amp;#39;m thinking Shane knew full well the depression Jas&amp;#39; parents were going through, knew the alcohol abuse they were going through, and knew they were in a bad way. He himself was dealing with the same situation, and they all became close friends... it&amp;#39;s a common situation to happen in support groups, and anyone who has been through AA can tell you the bonds that can form from those groups. Shane was likely even further along in the program than Jas&amp;#39; parents, maybe even their sponsor guy for when they were about to go off the wagon or needed someone to talk to.&lt;/p&gt;\n\n&lt;p&gt;Again, it&amp;#39;s all speculation, but what likely happened (sadly, it&amp;#39;s all too common) is that one of the parents got low, very low, and called Shane for help. Shane came over, talked, did everything he could to help that parent, and probably thought he did some good... but the parent waited until he left and then committed suicide. Shane felt awful, but the other parent was even worse off. The situation likely was too much for the second parent to handle, and despite Shane&amp;#39;s desperate attempt to help... several days or weeks later, the second parent also committed suicide. Although Shane did his best to help them, he blamed himself for their deaths, which is why he considers himself a failure.&lt;/p&gt;\n\n&lt;p&gt;Jas suddenly found herself with two parents that had killed themselves, and she clung to the only parental figure she had left... Shane. Shane couldn&amp;#39;t just abandon Jas, even though he was not prepared nor equipped to handle the responsibility of a child, and he took her in.&lt;/p&gt;\n\n&lt;p&gt;But Shane was a hot mess himself, and without warning, he had a freaked-out orphan on his hands. What else could he do but move in with the only relative that would help him... Marnie. Marnie was likely thrilled with the idea of having a child to raise... probably less thrilled that Shane was included in the package. Since Shane had needed to move, he naturally needed a new job to provide for himself and Jas, so he took a job at JojaMart: a dead-end job that sucks the soul out of normal people, much less an alcoholic with chronic depression dealing with massive guilt issues.&lt;/p&gt;\n\n&lt;p&gt;Thus, the downward spiral began. Shane blames himself for Jas&amp;#39; parents&amp;#39; deaths and bears a huge burden of guilt on his shoulders. He knows he&amp;#39;s a lousy godfather for Jas, which makes him feel even worse. He was doing so well with his alcoholism, and now he&amp;#39;s even worse, which makes him feel like a failure even more than his failure to save Jas&amp;#39; parents. Throw in the dead-end job, and his descent was complete... Shane was on his way to his own suicide. But he couldn&amp;#39;t just kill himself, because he had a responsibility to Jas, so.... he started drinking himself to death. This is why we see Shane passed out drunk in the 4 and 6 heart events, and why he had gotten so bad that Harvey had to save his life. The Farmer is entering Shane&amp;#39;s life at rock bottom.&lt;/p&gt;\n\n&lt;p&gt;But when you hit rock bottom, all you can do is climb or die... and Shane couldn&amp;#39;t die, not while he had Jas. He had found hope in the form of you and Jas, and with that hope, he found purpose. His chickens are more than just something he wants to do with his life. Those chickens add to his list of reasons to live, and is the primary reason his little white chicken is so important to him: raising chickens is his new purpose. &lt;/p&gt;\n\n&lt;p&gt;But Shane isn&amp;#39;t out of the woods, not by a long shot. We see him drinking sparkling water and cutting back on his drinking... but we also see that MAYBE he hasn&amp;#39;t stopped drinking. In the 10 heart event, he hands you &amp;quot;a cold one&amp;quot;, and he has several comments in his married list that include drinking. Now, it is POSSIBLE that he&amp;#39;s talking about cold sparkling water or Joja cola or something... when you drink the &amp;quot;cold one&amp;quot; he hands you, you don&amp;#39;t get tipsy, so it&amp;#39;s very possible that he&amp;#39;s turned over a new leaf. But the comments about drinking are still there, so... while I believe Shane is on the right path, there&amp;#39;s no such thing as an ex-alcoholic. Shane will struggle with that the rest of his life, and it&amp;#39;s quite possible that his comments about drinking are simply related to that struggle. For his sake, I hope that&amp;#39;s true. Addiction is a scary beast, and there&amp;#39;s no easy struggle with that. So do him a favor, and don&amp;#39;t gift him anything with alcohol.&lt;/p&gt;\n\n&lt;p&gt;So who would do well with Shane in real life? That&amp;#39;s a tough question to answer. Anyone who decides to spend their life with Shane is going to struggle with his addiction just as much as he will, minus the physical craving. You&amp;#39;re going to have to be tough on him when he gets weak, because he&amp;#39;s going to have slips... all addicts do, and you can be his/her line in the sand to keep him from crossing that line. There will be arguments, but every relationship has arguments... you&amp;#39;re going to need to be the voice of reason when his addiction becomes unreasonable. He has a rough climb ahead dealing with his alcoholism, and even worse... with his depression. Shane is chronic, which means this is only going to get better with years of professional help. The good news is that he was on the right road before his collapse; if he got on that road once, he&amp;#39;ll do it again. Patience is going to be key, but also tough love... you can&amp;#39;t let him collapse again, because he may not survive a third time.&lt;/p&gt;\n\n&lt;p&gt;Of course, this is all speculation, but... sure makes sense, doesn&amp;#39;t it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is a continuation of the series on my take of each of the eligible bachelors/bachelorettes in Stardew Valley. As usual, I'm not a professional counselor... it's just my opinion, and they're open to discussion and debate. :)\n\nI deliberately left Shane and Abigail for last in this series, since those two seem to be the favorites for each sex. I think part of the reason they are so popular is because their stories are complete and don't really leave much room for interpretation, like the rest of the bachelors/bachelorettes... the game does a fine job of giving us the whole picture, especially for Shane. To be honest, most of what I'm going to write for both Shane and Abigail are likely going to be things that everyone here already knows, because the game does a great job with both characters. Just FYI.\n\nShane is an alcoholic, as we all know. He has a tendency to be rude and abrupt at first, and even later he's a rough and tumble kind of character who tells it like it is. He also suffers from a chronic depression, which is different than a situational depression... this means Shane can't simply \"get over\" his depression by fixing a particular problem, he needs extensive and thorough psychotherapy in order to determine the root of his depression. \n\nWhat is at the root of his depression, you may ask? I have no idea. We're not given any information about Shane's past at all. In fact, so much time is devoted to Shane's alcoholism and depression that we hardly know anything about Shane, except perhaps his love of chickens. After a thorough examination of all his heart events and quotes and comments that he says throughout this game, there simply isn't anything he says that gives us anything about Shane other than chickens, depression, and beer. Even looking close at the other characters in Stardew Valley, I find absolutely nothing about Shane's history or personality. It's a little aggravating, to be honest.\n\nHe works at JojaMart all the way up until he's let go when you complete the Community Center... if you're going for Shane as your hubby, you may want to go Joja Warehouse to prevent him from being fired. Although, all things considered, he doesn't really like the job anyway, and maybe he's be better off just raising his chickens when you marry him... JojaMart sucks, amirite?\n\nThe only indication of Shane's past (and even that is iffy) is the 7 heart event, when he's making a commercial for Joja Cola. It's a contest for 10,000g, so it's possible they're just a group of amateurs here, but... it got me thinking. Could we have a clue as to what Shane did before Stardew Valley? Could Shane have been in the advertising biz, or perhaps in film or television? Again, there's no indication one way or another, and once again... we are stymied by the mystery of Shane's past.\n\nThe one aspect of Shane's character outside of booze and chickens is his relationship with Jas, who is his goddaughter... and this just brings up even MORE questions. Goddaughter??? Someone entrusted this child to Shane? Why? Does this mean Shane was once sober, or did Jas' parents know Shane was an alcoholic and a depressive? How did Jas' parents die? And since they both live with Marnie (Shane's aunt), how did THIS dynamic come about? Why does Shane care so much about Jas? Typically, alcoholism comes with a separation from others, like he does with the townsfolk and Marnie... so why is Jas' opinion of him so important? Does this have to do with his depression?\n\nAnnnnd.... that's when it hit me. How it all tied together. The reason Shane is drinking himself into a stupor, the reason he feels he's worthless and talks about self-hatred, the reason Jas is living with him, the reason Jas gets so upset when he talks about ending his life... it was obvious once it all clicked.\n\nJas' parents committed suicide, and Shane was unable to prevent it.\n\nBefore Shane came to Stardew Valley, he was good friends with Jas' parents... good enough for them to name him godfather of their child. He was dealing with depression even then, and was likely already an alcoholic. If I'm right, Jas' parents were also going through depression... it's likely how they all met, in some sort of group counseling for alcohol abuse or depression. \n\nThis is all just guesswork, since we know nothing for certain, but I'm thinking Shane knew full well the depression Jas' parents were going through, knew the alcohol abuse they were going through, and knew they were in a bad way. He himself was dealing with the same situation, and they all became close friends... it's a common situation to happen in support groups, and anyone who has been through AA can tell you the bonds that can form from those groups. Shane was likely even further along in the program than Jas' parents, maybe even their sponsor guy for when they were about to go off the wagon or needed someone to talk to.\n\nAgain, it's all speculation, but what likely happened (sadly, it's all too common) is that one of the parents got low, very low, and called Shane for help. Shane came over, talked, did everything he could to help that parent, and probably thought he did some good... but the parent waited until he left and then committed suicide. Shane felt awful, but the other parent was even worse off. The situation likely was too much for the second parent to handle, and despite Shane's desperate attempt to help... several days or weeks later, the second parent also committed suicide. Although Shane did his best to help them, he blamed himself for their deaths, which is why he considers himself a failure.\n\nJas suddenly found herself with two parents that had killed themselves, and she clung to the only parental figure she had left... Shane. Shane couldn't just abandon Jas, even though he was not prepared nor equipped to handle the responsibility of a child, and he took her in.\n\nBut Shane was a hot mess himself, and without warning, he had a freaked-out orphan on his hands. What else could he do but move in with the only relative that would help him... Marnie. Marnie was likely thrilled with the idea of having a child to raise... probably less thrilled that Shane was included in the package. Since Shane had needed to move, he naturally needed a new job to provide for himself and Jas, so he took a job at JojaMart: a dead-end job that sucks the soul out of normal people, much less an alcoholic with chronic depression dealing with massive guilt issues.\n\nThus, the downward spiral began. Shane blames himself for Jas' parents' deaths and bears a huge burden of guilt on his shoulders. He knows he's a lousy godfather for Jas, which makes him feel even worse. He was doing so well with his alcoholism, and now he's even worse, which makes him feel like a failure even more than his failure to save Jas' parents. Throw in the dead-end job, and his descent was complete... Shane was on his way to his own suicide. But he couldn't just kill himself, because he had a responsibility to Jas, so.... he started drinking himself to death. This is why we see Shane passed out drunk in the 4 and 6 heart events, and why he had gotten so bad that Harvey had to save his life. The Farmer is entering Shane's life at rock bottom.\n\nBut when you hit rock bottom, all you can do is climb or die... and Shane couldn't die, not while he had Jas. He had found hope in the form of you and Jas, and with that hope, he found purpose. His chickens are more than just something he wants to do with his life. Those chickens add to his list of reasons to live, and is the primary reason his little white chicken is so important to him: raising chickens is his new purpose. \n\nBut Shane isn't out of the woods, not by a long shot. We see him drinking sparkling water and cutting back on his drinking... but we also see that MAYBE he hasn't stopped drinking. In the 10 heart event, he hands you \"a cold one\", and he has several comments in his married list that include drinking. Now, it is POSSIBLE that he's talking about cold sparkling water or Joja cola or something... when you drink the \"cold one\" he hands you, you don't get tipsy, so it's very possible that he's turned over a new leaf. But the comments about drinking are still there, so... while I believe Shane is on the right path, there's no such thing as an ex-alcoholic. Shane will struggle with that the rest of his life, and it's quite possible that his comments about drinking are simply related to that struggle. For his sake, I hope that's true. Addiction is a scary beast, and there's no easy struggle with that. So do him a favor, and don't gift him anything with alcohol.\n\nSo who would do well with Shane in real life? That's a tough question to answer. Anyone who decides to spend their life with Shane is going to struggle with his addiction just as much as he will, minus the physical craving. You're going to have to be tough on him when he gets weak, because he's going to have slips... all addicts do, and you can be his/her line in the sand to keep him from crossing that line. There will be arguments, but every relationship has arguments... you're going to need to be the voice of reason when his addiction becomes unreasonable. He has a rough climb ahead dealing with his alcoholism, and even worse... with his depression. Shane is chronic, which means this is only going to get better with years of professional help. The good news is that he was on the right road before his collapse; if he got on that road once, he'll do it again. Patience is going to be key, but also tough love... you can't let him collapse again, because he may not survive a third time.\n\nOf course, this is all speculation, but... sure makes sense, doesn't it?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "650zug", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 29, "report_reasons": null, "author": "Squeaking_Lion", "saved": false, "mod_reports": [], "name": "t3_650zug", "subreddit_name_prefixed": "r/StardewValley", "approved_by": null, "over_18": false, "domain": "self.StardewValley", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2wb7y", "edited": 1492031853.0, "link_flair_css_class": "discussion", "author_flair_css_class": "abigail", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/StardewValley/comments/650zug/an_indepth_look_at_the_character_of_shane/", "num_reports": null, "locked": false, "stickied": false, "created": 1492059770.0, "url": "https://www.reddit.com/r/StardewValley/comments/650zug/an_indepth_look_at_the_character_of_shane/", "author_flair_text": "", "quarantine": false, "title": "An In-Depth Look At The Character Of: Shane", "created_utc": 1492030970.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_650zug", "likes": null, "replies": "", "user_reports": [], "id": "dg6ktjv", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Eldachleich", "parent_id": "t3_650zug", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Very nice.\n\nI very much disagree with one point. Shane is not an alcoholic. He's not dependant on beer. He's covering up his depression with alcohol. \n\nI highly suspect he would've latched on to the first thing that helped him cope. Be it beer, hard drugs, or thrill seeking like skydiving.\n\nHis marriage dialogue straight up tells you he's still drinking. He never once tells you he's quitting. Simply that he's recognised his abuse of alcohol, is ready to face his depression, and is cutting back to normal levels. Harvey even says the alcohol is not the problem, it's his mental state.\n\nIf he was truly an alcoholic he would not be able to cut back to reasonable levels like he is. And he would be going to more than a therapist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very nice.&lt;/p&gt;\n\n&lt;p&gt;I very much disagree with one point. Shane is not an alcoholic. He&amp;#39;s not dependant on beer. He&amp;#39;s covering up his depression with alcohol. &lt;/p&gt;\n\n&lt;p&gt;I highly suspect he would&amp;#39;ve latched on to the first thing that helped him cope. Be it beer, hard drugs, or thrill seeking like skydiving.&lt;/p&gt;\n\n&lt;p&gt;His marriage dialogue straight up tells you he&amp;#39;s still drinking. He never once tells you he&amp;#39;s quitting. Simply that he&amp;#39;s recognised his abuse of alcohol, is ready to face his depression, and is cutting back to normal levels. Harvey even says the alcohol is not the problem, it&amp;#39;s his mental state.&lt;/p&gt;\n\n&lt;p&gt;If he was truly an alcoholic he would not be able to cut back to reasonable levels like he is. And he would be going to more than a therapist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg6ktjv", "score_hidden": false, "stickied": false, "created": 1492060623.0, "created_utc": 1492031823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_650zug", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_650zug", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_650zug", "likes": null, "replies": "", "user_reports": [], "id": "dg74ote", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SassyWalkingGoldfish", "parent_id": "t1_dg747rl", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "In my head he was clearly an alcoholic for almost 2 in-game years. By the time I married him and realized he was still drinking, I felt very strange about it. Because I'd already filled in his whole life in my head, lol.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my head he was clearly an alcoholic for almost 2 in-game years. By the time I married him and realized he was still drinking, I felt very strange about it. Because I&amp;#39;d already filled in his whole life in my head, lol.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg74ote", "score_hidden": false, "stickied": false, "created": 1492085783.0, "created_utc": 1492056983.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg747rl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NatashaRomanof", "parent_id": "t1_dg6pngz", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "&gt; I know the game implies Shane is NOT alcoholic, but I'm with you - in my headcanon, he totally is.\n\nI'm kinda there with you guys as well. To the extent that after the 6 heart event I felt too guilty gifting him beers anymore, haha. I will not be an enabler!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I know the game implies Shane is NOT alcoholic, but I&amp;#39;m with you - in my headcanon, he totally is.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m kinda there with you guys as well. To the extent that after the 6 heart event I felt too guilty gifting him beers anymore, haha. I will not be an enabler!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg747rl", "score_hidden": false, "stickied": false, "created": 1492085065.0, "created_utc": 1492056265.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pngz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SassyWalkingGoldfish", "parent_id": "t3_650zug", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "So I made a thread about this a few weeks ago, but I wrote a [novel-length fanfiction](http://archiveofourown.org/works/9634940/chapters/21766157) about Shane because his character/mysterious backstory fascinated me so much.\n\nI like your interpretation of events, and it's very different from my own (spoilers if you do decide to read my fic!):\n\n- Shane mentions he \"didn't have much of a family\" growing up. I interpreted this as he was raised by neglectful, parents, his father in particular an alcoholic. He doesn't want to be like his dad, but due to severe depression and anxiety he has turned to alcohol anyway.\n\n- He already has an addiction in high school, and is generally friendless. He meets Jas's father, who becomes his first true friend (I call him Garrett). They bond for several years. He helps Shane sober up, he convinces him to join the gridball team, keeps him afloat, etc.\n\n- After high school, Shane works at Joja because he was never an academic and doesn't think he is smart enough for a real career. He's sober but still struggles hardcore with depression. His best friend goes to college, falls in love with a girl, and eventually has Jas. Shane has been away from alcohol for years and is like a brother to Garrett, and that is why they appoint him guardian. From the time she was born, Shane has been in Jas's life as an uncle figure, so she is already very comfortable around him.\n\n- When Jas is four, her parents are killed by a drunk driver. Shane is incredibly lost without them, and despite the bitter irony, he returns to drinking as a means to cope. He is suddenly responsible for a little girl while unable to even care for himself. The drinking fuels the guilt which fuels the drinking.\n\n- He has to bring Jas to live with him at his parents, and with working at Joja full-time he requires the help of his mother to baby-sit. When she up and leaves one day (former addict herself, flighty personality), Shane has no choice but to move in with Marnie (his dad's sister). Marnie works from home and can watch Jas while Shane works at Joja. It's clear he did not come to Pelican Town by choice, so this makes sense to me - it was a necessity after Jas became his responsibility.\n\n- Shane continues to drink because he lost his only true friend, he feels guilty about how shitty of a life he's given Jas so far, and with his depression/anxiety he has never learned healthy methods of coping. He feels dumb and worthless (low self esteem telling him he can't do anything outside of retail), and like he is a burden to the people who need him.\n\nI know the game implies Shane is NOT alcoholic, but I'm with you - in my headcanon, he totally is.\n\nRegarding his love affair with the farmer, I did not make her a quick fix for him. His depression is chronic and something he will always struggle with, and low self-esteem can wreck absolute *havoc* on a relationship. It's no joke being in a relationship with someone with mental illness. That said, I think there is a healthy balance between \"I can save/fix you\" and \"You're unworthy of even trying.\" In my mind, the farmer keeps him afloat, but Shane will always be codependent to the extent that if he didn't have one person who loved and believed in him, he would sink right back down to his destructive ways.     ", "edited": 1492040628.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I made a thread about this a few weeks ago, but I wrote a &lt;a href=\"http://archiveofourown.org/works/9634940/chapters/21766157\"&gt;novel-length fanfiction&lt;/a&gt; about Shane because his character/mysterious backstory fascinated me so much.&lt;/p&gt;\n\n&lt;p&gt;I like your interpretation of events, and it&amp;#39;s very different from my own (spoilers if you do decide to read my fic!):&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Shane mentions he &amp;quot;didn&amp;#39;t have much of a family&amp;quot; growing up. I interpreted this as he was raised by neglectful, parents, his father in particular an alcoholic. He doesn&amp;#39;t want to be like his dad, but due to severe depression and anxiety he has turned to alcohol anyway.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;He already has an addiction in high school, and is generally friendless. He meets Jas&amp;#39;s father, who becomes his first true friend (I call him Garrett). They bond for several years. He helps Shane sober up, he convinces him to join the gridball team, keeps him afloat, etc.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;After high school, Shane works at Joja because he was never an academic and doesn&amp;#39;t think he is smart enough for a real career. He&amp;#39;s sober but still struggles hardcore with depression. His best friend goes to college, falls in love with a girl, and eventually has Jas. Shane has been away from alcohol for years and is like a brother to Garrett, and that is why they appoint him guardian. From the time she was born, Shane has been in Jas&amp;#39;s life as an uncle figure, so she is already very comfortable around him.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;When Jas is four, her parents are killed by a drunk driver. Shane is incredibly lost without them, and despite the bitter irony, he returns to drinking as a means to cope. He is suddenly responsible for a little girl while unable to even care for himself. The drinking fuels the guilt which fuels the drinking.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;He has to bring Jas to live with him at his parents, and with working at Joja full-time he requires the help of his mother to baby-sit. When she up and leaves one day (former addict herself, flighty personality), Shane has no choice but to move in with Marnie (his dad&amp;#39;s sister). Marnie works from home and can watch Jas while Shane works at Joja. It&amp;#39;s clear he did not come to Pelican Town by choice, so this makes sense to me - it was a necessity after Jas became his responsibility.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Shane continues to drink because he lost his only true friend, he feels guilty about how shitty of a life he&amp;#39;s given Jas so far, and with his depression/anxiety he has never learned healthy methods of coping. He feels dumb and worthless (low self esteem telling him he can&amp;#39;t do anything outside of retail), and like he is a burden to the people who need him.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I know the game implies Shane is NOT alcoholic, but I&amp;#39;m with you - in my headcanon, he totally is.&lt;/p&gt;\n\n&lt;p&gt;Regarding his love affair with the farmer, I did not make her a quick fix for him. His depression is chronic and something he will always struggle with, and low self-esteem can wreck absolute &lt;em&gt;havoc&lt;/em&gt; on a relationship. It&amp;#39;s no joke being in a relationship with someone with mental illness. That said, I think there is a healthy balance between &amp;quot;I can save/fix you&amp;quot; and &amp;quot;You&amp;#39;re unworthy of even trying.&amp;quot; In my mind, the farmer keeps him afloat, but Shane will always be codependent to the extent that if he didn&amp;#39;t have one person who loved and believed in him, he would sink right back down to his destructive ways.     &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg6pngz", "score_hidden": false, "stickied": false, "created": 1492066504.0, "created_utc": 1492037704.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_650zug", "likes": null, "replies": "", "user_reports": [], "id": "dg6n7ts", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "beachhotdog", "parent_id": "t3_650zug", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I think a lot of people latched onto Shane because they recognize themselves in his narrative, it's just detailed enough to be a good story and open enough to be relatable almost across the board. I'm in the service industry and 70% of my coworkers are Shanes, we go to work, we get are asses kicked, we go to the bar to hang out and chill and unwind, we go sleep, we go back to work... It just goes around until you realize it's been 3 years and *holy shit what happened to my plans???* There were no plans, we were just winging it until something came up. But at the same time, I'm sure someone else's industry or college experience or late career plan can feel exactly like Shane's predicament.\n\nYour thoughts on his family are interesting. I find any interpretation fascinating because it's so unexplained so it's cool to see where people go with that. My ideas went in a completely different direction but I'm bad at laying thoughts out so I won't go into it unless someone really wants to know. :x\n\nBut good work on all of these! They're a fun read and it's cool to see your pov on the game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of people latched onto Shane because they recognize themselves in his narrative, it&amp;#39;s just detailed enough to be a good story and open enough to be relatable almost across the board. I&amp;#39;m in the service industry and 70% of my coworkers are Shanes, we go to work, we get are asses kicked, we go to the bar to hang out and chill and unwind, we go sleep, we go back to work... It just goes around until you realize it&amp;#39;s been 3 years and &lt;em&gt;holy shit what happened to my plans???&lt;/em&gt; There were no plans, we were just winging it until something came up. But at the same time, I&amp;#39;m sure someone else&amp;#39;s industry or college experience or late career plan can feel exactly like Shane&amp;#39;s predicament.&lt;/p&gt;\n\n&lt;p&gt;Your thoughts on his family are interesting. I find any interpretation fascinating because it&amp;#39;s so unexplained so it&amp;#39;s cool to see where people go with that. My ideas went in a completely different direction but I&amp;#39;m bad at laying thoughts out so I won&amp;#39;t go into it unless someone really wants to know. :x&lt;/p&gt;\n\n&lt;p&gt;But good work on all of these! They&amp;#39;re a fun read and it&amp;#39;s cool to see your pov on the game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg6n7ts", "score_hidden": false, "stickied": false, "created": 1492063482.0, "created_utc": 1492034682.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]