[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "StardewValley", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a continuation of the series on my take of each of the eligible bachelors/bachelorettes in Stardew Valley. As usual, I&amp;#39;m not a professional counselor... it&amp;#39;s just my opinion, and they&amp;#39;re open to discussion and debate. :)&lt;/p&gt;\n\n&lt;p&gt;The last of the eligible bachelors/bachelorettes I&amp;#39;ll be writing on is Abigail, and for good reason... she&amp;#39;s my favorite, and the favorite of quite a large number of players due to her unusual habit of eating amethysts and other gems. What was originally just a bug in the game has turned into a cute little quirk she has, and people love quirky. Abigail is an adventuresome girl with purple hair and overbearing parents. She has a curious heart, a desire for action, a poet&amp;#39;s soul, and an independent spirit. Of all the bachelorettes, Abigail would be the most exciting to be with, even more than Emily (although Emily would be the most positive and energetic). There&amp;#39;s speculation that Abigail&amp;#39;s biological father might be the Wizard, although the evidence for this is rather flimsy, but she certainly shows interest in the world of spirits and magic. Let&amp;#39;s take a look at Abigail.&lt;/p&gt;\n\n&lt;p&gt;Abigail is an origin story, a bona fide monomyth. Every great adventurer and hero has an origin story, and we are seeing Abigail&amp;#39;s. The loner who comes from a home that doesn&amp;#39;t understand her, the training montage to get better at her combat skills, the struggle to learn about the mystic arts or higher powers, the outlet for her taste for adventure due to being unable to fulfill her destiny... I mean, the only thing missing here is her holding the body of a loved one during a thunderstorm while shaking her fist at the heavens and screaming &amp;quot;NOOOOOOO!!!!!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;We can see the progression of her origin story throughout her entire heart event series. First, the longing for a better life in  Caroline&amp;#39;s 6 heart event, where mother and daughter are arguing over Abigail&amp;#39;s actions. There&amp;#39;s also Abigail&amp;#39;s 2 heart event, where she&amp;#39;s playing video games and longing to be the hero she&amp;#39;s playing. Then we start seeing her struggles to be understood with Caroline&amp;#39;s comments about her hair and her interest in the occult, and her 6 heart event with her father demanding she come home and help with dinner. Naturally, her training montage is during the 6 heart event, and her struggle with the mystic during the 8 heart event as well as her weekly trips to visit the Wizard. And finally, her testing of self happens during the 10 heart event when she heads into the mines and encounters her first danger, where she confronts her reality against her expectations and discovers what she&amp;#39;s really up against, and still comes out strong. She does eventually become a hero and starts adventuring in the mines once you marry her. When you think about it, even her taste for gems gives her the unique aspect that allows her to stand out from her peers, like all heroes have. Hell, where is Abigail&amp;#39;s cape??? (NO CAPES!)&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re interested in looking into the hero&amp;#39;s journey, also known as the monomyth, here&amp;#39;s a link to the Wikipedia. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Hero%27s_journey\"&gt;https://en.wikipedia.org/wiki/Hero%27s_journey&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;Compare it to Abigail and see how many correlations you find, you&amp;#39;ll see match-ups for each one. &lt;/p&gt;\n\n&lt;p&gt;But like all origin stories, the hero must struggle with not only outside forces, but her own self, and Abigail is no exception. Abigail&amp;#39;s internal struggle is against traditional roles for women, where her very traditional parents are attempting to shove her into a very traditional role... something very similar to Mulan from the Disney movie. Abigail craves excitement and adventure, to find her own path in life instead of submitting to one chosen for her. &lt;/p&gt;\n\n&lt;p&gt;While I&amp;#39;m not one for bucking parental guidance for their children, in this case Pierre and Caroline are the ones in the wrong... rather than recognizing that their daughter is unique and special and could make her mark on the world in more ways than traditional, they want a status quo that doesn&amp;#39;t buck the system. And we can understand their point of view: Pierre is a business owner with a very strict schedule that doesn&amp;#39;t allow him much time outside his own shop, and Caroline is a woman who likes, understands, and respects her own traditional role as a housewife. It&amp;#39;s natural that they want something similar for their own child... it&amp;#39;s what they&amp;#39;re comfortable with.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s nothing wrong with either lifestyle... if that&amp;#39;s what they&amp;#39;re happy with, they should stick to that. But forcing one&amp;#39;s lifestyle upon another and demanding they comply with it... that&amp;#39;s wrong no matter which side you&amp;#39;re taking. Everyone is entitled to pursue their happiness in the manner they feel best, but with that entitlement must come the understanding that everyone ELSE also gets that respect, and not everyone is going to agree with your choice. And THAT&amp;#39;S okay, too! It&amp;#39;s the kaleidoscope of the human experience... if we were all lime green, we&amp;#39;d be a pretty boring species.  &lt;/p&gt;\n\n&lt;p&gt;The one thing that defines Abigail more than anything else is her independence. She wants to be taken as she is and carve her own path in life. We can see that in her reactions to your responses in the heart events. Abigail sees herself as an adventurer, which entails hardship... so naturally, in the 4 heart event, when you say you enjoy the rain, she respects that choice and you get a large bonus in friendship. When she asks about your use of weapons, it&amp;#39;s a small bonus if you say positive things about it, but a huge negative if you dare to say she shouldn&amp;#39;t use them!&lt;/p&gt;\n\n&lt;p&gt;But take a look at the 10 heart event. While Abigail continues to assert her independence, she is suddenly confronted with the reality that there will be dangers that she isn&amp;#39;t prepared for. But you, The Farmer, have proven your worth to her, and what&amp;#39;s more... you&amp;#39;re concerned for her while respecting her own capabilities, assuming you make the right choices. You and she just became a Dynamic Duo.&lt;/p&gt;\n\n&lt;p&gt;Regarding the rumors that the Wizard might be her biological father... nah. Doesn&amp;#39;t make sense. Caroline is FAR too conservative to cheat on her husband, and unless the Wizard used his magic to coerce her into sex (something that doesn&amp;#39;t really fall into character for the Wizard), that tryst just doesn&amp;#39;t fall into place. But then, I haven&amp;#39;t done an analysis on Caroline, Pierre, or the Wizard other than how they relate to Abigail. It makes far more sense that Abigail is in the process of the Supernatural Aid portion of her hero&amp;#39;s journey and trying to learn about magic in her search for adventure, or perhaps the Mystical Child mythos that often gets applied to heroes. Yeah, I know, the comments from Pierre and Caroline saying she visited the Wizard and the Wizard thinking he has a daughter in Stardew Valley... there&amp;#39;s also this Chupacabra in South America and Jackalopes in North America and fairies in the Black Forest in Germany. Sometimes rumors take on a mind of their own... show me a DNA test. It&amp;#39;s technically possible, but... until we have better proof other than hearsay, I&amp;#39;m not buying it.&lt;/p&gt;\n\n&lt;p&gt;Of all the bachelors/bachelorettes, Abigail is the only one that actually has a story beyond marriage. With all the rest, the game simply assumes &amp;quot;Happily Ever After&amp;quot; with The Farmer, and they sort of become background noise after that... something ConcernedApe really should have addressed before releasing the game. But with Abigail, her origin story is done, and now her life of heroism has begun! She goes adventuring, bringing back objects that she found while she was in the Mines. It&amp;#39;s still done in the background, but at least we can see progression in the character of Abigail that we don&amp;#39;t see in many other characters. The Farmer would be smart to keep encouraging Abigail in her quest for adventure... who knows, there might be a Gollum down there with a &amp;quot;Precious&amp;quot; that she&amp;#39;ll end up liberating at some point!&lt;/p&gt;\n\n&lt;p&gt;What kind of person would do well with Abigail in real life? If you aren&amp;#39;t an adventurer yourself, don&amp;#39;t bother. The best you&amp;#39;ll be is a footnote in her adventures as she continues to grow and improve and become the great hero she&amp;#39;s destined to be. While the game has Abigail stay in one place, the real-life Abigail would never stop moving; always looking for the next great adventure, always wanting to try new things and explore new places, investigating rumors of supernatural things and solving mysteries, and crawling all over ancient places in her quest for adventure. If you&amp;#39;re not willing to stand next to her on every quest, she will leave you behind... nothing is going to stop Abigail the Great, She of the Purple Hair! She is a female Odysseus, and like that famous Greek adventurer... she will never stop until she achieves her destiny. But if you&amp;#39;re her type, and she respects you as much as you respect her, she will be free and wild and probably the best lover you&amp;#39;ll ever have. And if you just happen to be the Marion to her Indiana Jones... you&amp;#39;ve hit the motherlode of all motherlodes, baby. &lt;/p&gt;\n\n&lt;p&gt;Now, if only we could convince her to wear bikini chainmail or a superheroine costume....&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is a continuation of the series on my take of each of the eligible bachelors/bachelorettes in Stardew Valley. As usual, I'm not a professional counselor... it's just my opinion, and they're open to discussion and debate. :)\n\nThe last of the eligible bachelors/bachelorettes I'll be writing on is Abigail, and for good reason... she's my favorite, and the favorite of quite a large number of players due to her unusual habit of eating amethysts and other gems. What was originally just a bug in the game has turned into a cute little quirk she has, and people love quirky. Abigail is an adventuresome girl with purple hair and overbearing parents. She has a curious heart, a desire for action, a poet's soul, and an independent spirit. Of all the bachelorettes, Abigail would be the most exciting to be with, even more than Emily (although Emily would be the most positive and energetic). There's speculation that Abigail's biological father might be the Wizard, although the evidence for this is rather flimsy, but she certainly shows interest in the world of spirits and magic. Let's take a look at Abigail.\n\nAbigail is an origin story, a bona fide monomyth. Every great adventurer and hero has an origin story, and we are seeing Abigail's. The loner who comes from a home that doesn't understand her, the training montage to get better at her combat skills, the struggle to learn about the mystic arts or higher powers, the outlet for her taste for adventure due to being unable to fulfill her destiny... I mean, the only thing missing here is her holding the body of a loved one during a thunderstorm while shaking her fist at the heavens and screaming \"NOOOOOOO!!!!!\" \n\nWe can see the progression of her origin story throughout her entire heart event series. First, the longing for a better life in  Caroline's 6 heart event, where mother and daughter are arguing over Abigail's actions. There's also Abigail's 2 heart event, where she's playing video games and longing to be the hero she's playing. Then we start seeing her struggles to be understood with Caroline's comments about her hair and her interest in the occult, and her 6 heart event with her father demanding she come home and help with dinner. Naturally, her training montage is during the 6 heart event, and her struggle with the mystic during the 8 heart event as well as her weekly trips to visit the Wizard. And finally, her testing of self happens during the 10 heart event when she heads into the mines and encounters her first danger, where she confronts her reality against her expectations and discovers what she's really up against, and still comes out strong. She does eventually become a hero and starts adventuring in the mines once you marry her. When you think about it, even her taste for gems gives her the unique aspect that allows her to stand out from her peers, like all heroes have. Hell, where is Abigail's cape??? (NO CAPES!)\n\nIf you're interested in looking into the hero's journey, also known as the monomyth, here's a link to the Wikipedia. \n\nhttps://en.wikipedia.org/wiki/Hero%27s_journey \n\nCompare it to Abigail and see how many correlations you find, you'll see match-ups for each one. \n\nBut like all origin stories, the hero must struggle with not only outside forces, but her own self, and Abigail is no exception. Abigail's internal struggle is against traditional roles for women, where her very traditional parents are attempting to shove her into a very traditional role... something very similar to Mulan from the Disney movie. Abigail craves excitement and adventure, to find her own path in life instead of submitting to one chosen for her. \n\nWhile I'm not one for bucking parental guidance for their children, in this case Pierre and Caroline are the ones in the wrong... rather than recognizing that their daughter is unique and special and could make her mark on the world in more ways than traditional, they want a status quo that doesn't buck the system. And we can understand their point of view: Pierre is a business owner with a very strict schedule that doesn't allow him much time outside his own shop, and Caroline is a woman who likes, understands, and respects her own traditional role as a housewife. It's natural that they want something similar for their own child... it's what they're comfortable with.\n\nThere's nothing wrong with either lifestyle... if that's what they're happy with, they should stick to that. But forcing one's lifestyle upon another and demanding they comply with it... that's wrong no matter which side you're taking. Everyone is entitled to pursue their happiness in the manner they feel best, but with that entitlement must come the understanding that everyone ELSE also gets that respect, and not everyone is going to agree with your choice. And THAT'S okay, too! It's the kaleidoscope of the human experience... if we were all lime green, we'd be a pretty boring species.  \n\nThe one thing that defines Abigail more than anything else is her independence. She wants to be taken as she is and carve her own path in life. We can see that in her reactions to your responses in the heart events. Abigail sees herself as an adventurer, which entails hardship... so naturally, in the 4 heart event, when you say you enjoy the rain, she respects that choice and you get a large bonus in friendship. When she asks about your use of weapons, it's a small bonus if you say positive things about it, but a huge negative if you dare to say she shouldn't use them!\n\nBut take a look at the 10 heart event. While Abigail continues to assert her independence, she is suddenly confronted with the reality that there will be dangers that she isn't prepared for. But you, The Farmer, have proven your worth to her, and what's more... you're concerned for her while respecting her own capabilities, assuming you make the right choices. You and she just became a Dynamic Duo.\n\nRegarding the rumors that the Wizard might be her biological father... nah. Doesn't make sense. Caroline is FAR too conservative to cheat on her husband, and unless the Wizard used his magic to coerce her into sex (something that doesn't really fall into character for the Wizard), that tryst just doesn't fall into place. But then, I haven't done an analysis on Caroline, Pierre, or the Wizard other than how they relate to Abigail. It makes far more sense that Abigail is in the process of the Supernatural Aid portion of her hero's journey and trying to learn about magic in her search for adventure, or perhaps the Mystical Child mythos that often gets applied to heroes. Yeah, I know, the comments from Pierre and Caroline saying she visited the Wizard and the Wizard thinking he has a daughter in Stardew Valley... there's also this Chupacabra in South America and Jackalopes in North America and fairies in the Black Forest in Germany. Sometimes rumors take on a mind of their own... show me a DNA test. It's technically possible, but... until we have better proof other than hearsay, I'm not buying it.\n\nOf all the bachelors/bachelorettes, Abigail is the only one that actually has a story beyond marriage. With all the rest, the game simply assumes \"Happily Ever After\" with The Farmer, and they sort of become background noise after that... something ConcernedApe really should have addressed before releasing the game. But with Abigail, her origin story is done, and now her life of heroism has begun! She goes adventuring, bringing back objects that she found while she was in the Mines. It's still done in the background, but at least we can see progression in the character of Abigail that we don't see in many other characters. The Farmer would be smart to keep encouraging Abigail in her quest for adventure... who knows, there might be a Gollum down there with a \"Precious\" that she'll end up liberating at some point!\n\nWhat kind of person would do well with Abigail in real life? If you aren't an adventurer yourself, don't bother. The best you'll be is a footnote in her adventures as she continues to grow and improve and become the great hero she's destined to be. While the game has Abigail stay in one place, the real-life Abigail would never stop moving; always looking for the next great adventure, always wanting to try new things and explore new places, investigating rumors of supernatural things and solving mysteries, and crawling all over ancient places in her quest for adventure. If you're not willing to stand next to her on every quest, she will leave you behind... nothing is going to stop Abigail the Great, She of the Purple Hair! She is a female Odysseus, and like that famous Greek adventurer... she will never stop until she achieves her destiny. But if you're her type, and she respects you as much as you respect her, she will be free and wild and probably the best lover you'll ever have. And if you just happen to be the Marion to her Indiana Jones... you've hit the motherlode of all motherlodes, baby. \n\nNow, if only we could convince her to wear bikini chainmail or a superheroine costume....", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "6584ke", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 43, "report_reasons": null, "author": "Squeaking_Lion", "saved": false, "mod_reports": [], "name": "t3_6584ke", "subreddit_name_prefixed": "r/StardewValley", "approved_by": null, "over_18": false, "domain": "self.StardewValley", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/wFMzrDtku-FJVh6JCCVI9PQSv1wW86ANXn0_exWwq9I.jpg?s=6e14f622cb5a1bf317ee73bb47aa7223", "width": 1200, "height": 1206}, "resolutions": [{"url": "https://i.redditmedia.com/wFMzrDtku-FJVh6JCCVI9PQSv1wW86ANXn0_exWwq9I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=6f2cb9bb1fa47b31af360bd00798b8ad", "width": 108, "height": 108}, {"url": "https://i.redditmedia.com/wFMzrDtku-FJVh6JCCVI9PQSv1wW86ANXn0_exWwq9I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=2a1c9e081c050988821e9f8b789694ce", "width": 216, "height": 217}, {"url": "https://i.redditmedia.com/wFMzrDtku-FJVh6JCCVI9PQSv1wW86ANXn0_exWwq9I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=6dd676880978b8d010589c00ce71888f", "width": 320, "height": 321}, {"url": "https://i.redditmedia.com/wFMzrDtku-FJVh6JCCVI9PQSv1wW86ANXn0_exWwq9I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=0581a487b5dd8f6f5ddb1195207af999", "width": 640, "height": 643}, {"url": "https://i.redditmedia.com/wFMzrDtku-FJVh6JCCVI9PQSv1wW86ANXn0_exWwq9I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=e1a0e634694c45c232ca5de2a54a686b", "width": 960, "height": 964}, {"url": "https://i.redditmedia.com/wFMzrDtku-FJVh6JCCVI9PQSv1wW86ANXn0_exWwq9I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=fd41ae16c4eee3b56caa78d9c9cf703e", "width": 1080, "height": 1085}], "variants": {}, "id": "KupAccSYjiE0xMVIqUIBU3ABFd8XZIIRC45eUMY6wfI"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2wb7y", "edited": 1492117621.0, "link_flair_css_class": "discussion", "author_flair_css_class": "abigail", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/StardewValley/comments/6584ke/an_indepth_look_at_the_character_of_abigail/", "num_reports": null, "locked": false, "stickied": false, "created": 1492144527.0, "url": "https://www.reddit.com/r/StardewValley/comments/6584ke/an_indepth_look_at_the_character_of_abigail/", "author_flair_text": "", "quarantine": false, "title": "An In-Depth Look At The Character Of: Abigail", "created_utc": 1492115727.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 43}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": "", "user_reports": [], "id": "dgaeom5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sweet_Merciful_Balls", "parent_id": "t1_dg9i2si", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Marnie's not her mother though XD Her parents are dead and I think since Shane's her godfather him and his aunt marnie took her in", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Marnie&amp;#39;s not her mother though XD Her parents are dead and I think since Shane&amp;#39;s her godfather him and his aunt marnie took her in&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dgaeom5", "score_hidden": false, "stickied": false, "created": 1492268751.0, "created_utc": 1492239951.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": "", "user_reports": [], "id": "dg9mwtr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Squeaking_Lion", "parent_id": "t1_dg9i2si", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I tend to agree with you, MissCarnivora. Jas does strike me as an unusual character in the game, and the theory that Jas is the Wizard's daughter makes more sense than Abigail.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tend to agree with you, MissCarnivora. Jas does strike me as an unusual character in the game, and the theory that Jas is the Wizard&amp;#39;s daughter makes more sense than Abigail.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9mwtr", "score_hidden": false, "stickied": false, "created": 1492227668.0, "created_utc": 1492198868.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9i2si", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MissCarnivora", "parent_id": "t1_dg8kes0", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "TBH i always thought Jas is the wizards daughter. She has purple hair as well and Marnie is... well... easy :P?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;TBH i always thought Jas is the wizards daughter. She has purple hair as well and Marnie is... well... easy :P?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9i2si", "score_hidden": false, "stickied": false, "created": 1492221862.0, "created_utc": 1492193062.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8kes0", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Sweet_Merciful_Balls", "parent_id": "t3_6584ke", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Really nice analysis ;7;\n\nI did read somewhere that Caroline used to hang around the wizard tower when she was younger...and Abigail apparently hasn't dyed her hair in ages but it's stayed purple ;7;", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really nice analysis ;7;&lt;/p&gt;\n\n&lt;p&gt;I did read somewhere that Caroline used to hang around the wizard tower when she was younger...and Abigail apparently hasn&amp;#39;t dyed her hair in ages but it&amp;#39;s stayed purple ;7;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg8kes0", "score_hidden": false, "stickied": false, "created": 1492162556.0, "created_utc": 1492133756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": "", "user_reports": [], "id": "dg8vn2d", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "greymeta", "parent_id": "t3_6584ke", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "First of all: congrats on making it through! Making and posting twelve of these (eleven and a half?) must not be easy.\n\nStill though:\n\n&gt;With all the rest, the game simply assumes \"Happily Ever After\" with The Farmer, and they sort of become background noise after that.\n\n-\n&gt;She goes adventuring, bringing back objects that she found while she was in the Mines. It's still done in the background,\n\n\nYou kinda just prove your first point there buddy. Adventuring the mines *is* Abigail's Happily Ever After. This is not unique to her by the way; Sebastian does the same.\n\n&gt;but at least we can see progression in the character of Abigail that we don't see in many other characters.\n\n All bachelor(ette)s have a hobby or a career or an action that defines the majority of their character. Elliott still writes, Leah still creates art, Maru still tinkers, Haley still photographs, and **Abigail still explores**. \n\nExploring the mines over and over again is not progression, it is simply part of what differentiate her from the other characters. She is just as stagnant as everyone else otherwise.\n\nI mean, bully for you if you see it as anything more, but I think it makes it less of an \"in-depth look\" and more of [Wild Mass Guess](http://tvtropes.org/pmwiki/pmwiki.php/WMG/StardewValley).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all: congrats on making it through! Making and posting twelve of these (eleven and a half?) must not be easy.&lt;/p&gt;\n\n&lt;p&gt;Still though:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;With all the rest, the game simply assumes &amp;quot;Happily Ever After&amp;quot; with The Farmer, and they sort of become background noise after that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She goes adventuring, bringing back objects that she found while she was in the Mines. It&amp;#39;s still done in the background,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You kinda just prove your first point there buddy. Adventuring the mines &lt;em&gt;is&lt;/em&gt; Abigail&amp;#39;s Happily Ever After. This is not unique to her by the way; Sebastian does the same.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;but at least we can see progression in the character of Abigail that we don&amp;#39;t see in many other characters.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;All bachelor(ette)s have a hobby or a career or an action that defines the majority of their character. Elliott still writes, Leah still creates art, Maru still tinkers, Haley still photographs, and &lt;strong&gt;Abigail still explores&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;Exploring the mines over and over again is not progression, it is simply part of what differentiate her from the other characters. She is just as stagnant as everyone else otherwise.&lt;/p&gt;\n\n&lt;p&gt;I mean, bully for you if you see it as anything more, but I think it makes it less of an &amp;quot;in-depth look&amp;quot; and more of &lt;a href=\"http://tvtropes.org/pmwiki/pmwiki.php/WMG/StardewValley\"&gt;Wild Mass Guess&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg8vn2d", "score_hidden": false, "stickied": false, "created": 1492182099.0, "created_utc": 1492153299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": "", "user_reports": [], "id": "dg8amjw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Squeaking_Lion", "parent_id": "t1_dg8ackd", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Being an English Literature major with specialties in mythology helps. :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Being an English Literature major with specialties in mythology helps. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg8amjw", "score_hidden": false, "stickied": false, "created": 1492149384.0, "created_utc": 1492120584.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ackd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CrimsonPact", "parent_id": "t3_6584ke", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "If I could write something this in-depth and interesting for my school assignments.... lets just say I wouldn't be hiding my grades whenever my parents ask me about school", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I could write something this in-depth and interesting for my school assignments.... lets just say I wouldn&amp;#39;t be hiding my grades whenever my parents ask me about school&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg8ackd", "score_hidden": false, "stickied": false, "created": 1492149037.0, "created_utc": 1492120237.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": "", "user_reports": [], "id": "dg8yq8k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Levyathyn", "parent_id": "t3_6584ke", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I picked Abigail and only Abigail for all the reasons you mentioned, and a few more. It's unlikely, due to how I work and Abby in particular, that so long as I play Stardew I will ever marry any other individual. It's *possible*, I suppose. But there is no need, nor any desire for it. She is simply my complementary color on the color wheel, and no other match will go with me as perfectly. And, with this, my apologies for not diving into any of your other analysis posts; the other characters are simply, as you say, background noise.\n\nAbigail represents **Courage**. I mean, all of them are, in a way; courage of realizing and accepting who you are, or courage of testing your limits. But Abigail is about pure courage, about facing the unknown and keeping on facing it. It's about facing even your parents, even the possibility of a potential or likely death, and chasing that dram of yours regardless. Of course she plays her flute in the rain; in the light of embracing her goal of being a hero, of confronting the mines and whatever lurks inside, simply getting wet doesn't stand a chance. She's no dainty city girl covering up her designer top. All the same, Abigail also faces true fear, and even though she breaks down when confronted by monsters, *real* monsters, she also has the courage to accept that she had been hasty. That she had set off half-cocked, and had become something of her own enemy. And she has the courage to accept you as a spouse, a lover, to confirm that you *will* change her and shape her life around you, but that this isn't a bad thing. Like a sword, Abigail was tempered by the light of the forge her adventures thrust her into. And she came out of the experience for the better.\n\nWhen I first came to town, I thought this brash, interesting, purple-haired girl was the choice for me. When she was the best at finding hidden eggs, I suspected. When I found a girl that loved games, and swords, and pumpkins as much as I did... I knew. And when she ate her first amethyst, I thought it was adorable. And then I found her, stoic and calm in the middle of the Halloween maze, stopped by fear--but a rational, controlled fear. Acceptance that this was her limit. And that was too much for me.\n\nPersonally, I've long debated about the Wizard and his role in this. I feel like he does, indeed have a relation in the town, a daughter in fact, but after a lot of study and perhaps more time spent looking into these characters and spending time with them than is prudent for a living human, I've decided it isn't Abigail.\n\nMy headcanon states that Caroline is generally infertile, and has long been unable to reliably produce a child. Her trips to the Wizard were apparently a constant, infrequent thing that up and ended one day, and my explanation is that the Wizard concocted a brew or spell to increase her chances at pregnancy. The result was Abigail, who is at the very least a special girl.\n\nHer own trips to the tower seem fruitless. I've never seen Abigail  go into the Wizard's tower, and she seems taken up with the sword and perhaps not very interested in magic. Nonetheless, her hair is dyed to resemble is. Perhaps she's heard the talk of the town? Or maybe her mother spent a lot of time with young Abby talking about the Wizard and his spells, speaking on the level of a friend as one would about the man responsible for giving you a child, or at least helping your husband do so. And maybe in a world where her parents can't support that wild, magical (in a metaphorical sense) side of her, and try to confine her to this life they have set, the idea of a distant tower-bound figure that would understand how she feels is a pipe dream for her. And maybe she keeps her distance because part of her *is* worried that the Wizard is her real father. I couldn't say.\n\nAlso, while reminiscing, I want to point out that perhaps my favorite thing about Abigail is that she's a musician. Music is my life, and her early scene in the rain made me smile.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I picked Abigail and only Abigail for all the reasons you mentioned, and a few more. It&amp;#39;s unlikely, due to how I work and Abby in particular, that so long as I play Stardew I will ever marry any other individual. It&amp;#39;s &lt;em&gt;possible&lt;/em&gt;, I suppose. But there is no need, nor any desire for it. She is simply my complementary color on the color wheel, and no other match will go with me as perfectly. And, with this, my apologies for not diving into any of your other analysis posts; the other characters are simply, as you say, background noise.&lt;/p&gt;\n\n&lt;p&gt;Abigail represents &lt;strong&gt;Courage&lt;/strong&gt;. I mean, all of them are, in a way; courage of realizing and accepting who you are, or courage of testing your limits. But Abigail is about pure courage, about facing the unknown and keeping on facing it. It&amp;#39;s about facing even your parents, even the possibility of a potential or likely death, and chasing that dram of yours regardless. Of course she plays her flute in the rain; in the light of embracing her goal of being a hero, of confronting the mines and whatever lurks inside, simply getting wet doesn&amp;#39;t stand a chance. She&amp;#39;s no dainty city girl covering up her designer top. All the same, Abigail also faces true fear, and even though she breaks down when confronted by monsters, &lt;em&gt;real&lt;/em&gt; monsters, she also has the courage to accept that she had been hasty. That she had set off half-cocked, and had become something of her own enemy. And she has the courage to accept you as a spouse, a lover, to confirm that you &lt;em&gt;will&lt;/em&gt; change her and shape her life around you, but that this isn&amp;#39;t a bad thing. Like a sword, Abigail was tempered by the light of the forge her adventures thrust her into. And she came out of the experience for the better.&lt;/p&gt;\n\n&lt;p&gt;When I first came to town, I thought this brash, interesting, purple-haired girl was the choice for me. When she was the best at finding hidden eggs, I suspected. When I found a girl that loved games, and swords, and pumpkins as much as I did... I knew. And when she ate her first amethyst, I thought it was adorable. And then I found her, stoic and calm in the middle of the Halloween maze, stopped by fear--but a rational, controlled fear. Acceptance that this was her limit. And that was too much for me.&lt;/p&gt;\n\n&lt;p&gt;Personally, I&amp;#39;ve long debated about the Wizard and his role in this. I feel like he does, indeed have a relation in the town, a daughter in fact, but after a lot of study and perhaps more time spent looking into these characters and spending time with them than is prudent for a living human, I&amp;#39;ve decided it isn&amp;#39;t Abigail.&lt;/p&gt;\n\n&lt;p&gt;My headcanon states that Caroline is generally infertile, and has long been unable to reliably produce a child. Her trips to the Wizard were apparently a constant, infrequent thing that up and ended one day, and my explanation is that the Wizard concocted a brew or spell to increase her chances at pregnancy. The result was Abigail, who is at the very least a special girl.&lt;/p&gt;\n\n&lt;p&gt;Her own trips to the tower seem fruitless. I&amp;#39;ve never seen Abigail  go into the Wizard&amp;#39;s tower, and she seems taken up with the sword and perhaps not very interested in magic. Nonetheless, her hair is dyed to resemble is. Perhaps she&amp;#39;s heard the talk of the town? Or maybe her mother spent a lot of time with young Abby talking about the Wizard and his spells, speaking on the level of a friend as one would about the man responsible for giving you a child, or at least helping your husband do so. And maybe in a world where her parents can&amp;#39;t support that wild, magical (in a metaphorical sense) side of her, and try to confine her to this life they have set, the idea of a distant tower-bound figure that would understand how she feels is a pipe dream for her. And maybe she keeps her distance because part of her &lt;em&gt;is&lt;/em&gt; worried that the Wizard is her real father. I couldn&amp;#39;t say.&lt;/p&gt;\n\n&lt;p&gt;Also, while reminiscing, I want to point out that perhaps my favorite thing about Abigail is that she&amp;#39;s a musician. Music is my life, and her early scene in the rain made me smile.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg8yq8k", "score_hidden": false, "stickied": false, "created": 1492191516.0, "created_utc": 1492162716.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": "", "user_reports": [], "id": "dg9fcuc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iKeychain", "parent_id": "t3_6584ke", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "The Abigail being the Wizard's daughter thing has always clearly been a red herring that CA left in the game to throw us off-track. It's basically debunked by Abby's hair color not being naturally purple, and is infact a chestnut color like Pierre's. It just hasn't faded from purple in a long time, which she states in-game. \n\nAlso Abigail is and will always be the best wifey. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The Abigail being the Wizard&amp;#39;s daughter thing has always clearly been a red herring that CA left in the game to throw us off-track. It&amp;#39;s basically debunked by Abby&amp;#39;s hair color not being naturally purple, and is infact a chestnut color like Pierre&amp;#39;s. It just hasn&amp;#39;t faded from purple in a long time, which she states in-game. &lt;/p&gt;\n\n&lt;p&gt;Also Abigail is and will always be the best wifey. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9fcuc", "score_hidden": false, "stickied": false, "created": 1492218706.0, "created_utc": 1492189906.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": "", "user_reports": [], "id": "dga8wv4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Taiyama", "parent_id": "t3_6584ke", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I would love to see the world with Abigail.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would love to see the world with Abigail.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dga8wv4", "score_hidden": false, "stickied": false, "created": 1492257223.0, "created_utc": 1492228423.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_6584ke", "likes": null, "replies": "", "user_reports": [], "id": "dgapxe9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Squeaking_Lion", "parent_id": "t1_dgafdik", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Yes. I've done one of these for 11 out of 12 of the marriageable characters, and sort of a half one for Haley.\n\nhttps://www.reddit.com/r/StardewValley/comments/650zug/an_indepth_look_at_the_character_of_shane/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. I&amp;#39;ve done one of these for 11 out of 12 of the marriageable characters, and sort of a half one for Haley.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/StardewValley/comments/650zug/an_indepth_look_at_the_character_of_shane/\"&gt;https://www.reddit.com/r/StardewValley/comments/650zug/an_indepth_look_at_the_character_of_shane/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dgapxe9", "score_hidden": false, "stickied": false, "created": 1492296559.0, "created_utc": 1492267759.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgafdik", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Fredwary", "parent_id": "t3_6584ke", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Have you done one of these for Shane? Looking through some of your comments I get the impression it might be negative but I'd like to hear a well-thought out PoV anyway. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you done one of these for Shane? Looking through some of your comments I get the impression it might be negative but I&amp;#39;d like to hear a well-thought out PoV anyway. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dgafdik", "score_hidden": false, "stickied": false, "created": 1492270556.0, "created_utc": 1492241756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]