[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "StardewValley", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Looking for the greenhouse year 1. I also want to maximise my income and earn a lot of money. I&amp;#39;m not sure how many seeds to plant (because it costs a lot of energy to water them) and what seeds to buy. Potatoes? &lt;/p&gt;\n\n&lt;p&gt;I want to earn as much money as possible because I&amp;#39;ve read this game is much about snowballing.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Looking for the greenhouse year 1. I also want to maximise my income and earn a lot of money. I'm not sure how many seeds to plant (because it costs a lot of energy to water them) and what seeds to buy. Potatoes? \n\nI want to earn as much money as possible because I've read this game is much about snowballing.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Help", "id": "65cnoj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "Chippelchen88", "saved": false, "mod_reports": [], "name": "t3_65cnoj", "subreddit_name_prefixed": "r/StardewValley", "approved_by": null, "over_18": false, "domain": "self.StardewValley", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2wb7y", "edited": false, "link_flair_css_class": "help", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/StardewValley/comments/65cnoj/best_guide_for_year_1/", "num_reports": null, "locked": false, "stickied": false, "created": 1492207130.0, "url": "https://www.reddit.com/r/StardewValley/comments/65cnoj/best_guide_for_year_1/", "author_flair_text": null, "quarantine": false, "title": "Best guide for year 1?", "created_utc": 1492178330.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 12, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": "", "user_reports": [], "id": "dgbfmzk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PokerusBreeder", "parent_id": "t1_dg9sowy", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Good tip! I didn't realize there was a window where it didn't matter. I'll be using that in my next play through. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good tip! I didn&amp;#39;t realize there was a window where it didn&amp;#39;t matter. I&amp;#39;ll be using that in my next play through. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dgbfmzk", "score_hidden": false, "stickied": false, "created": 1492332388.0, "created_utc": 1492303588.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9sowy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ngowonder", "parent_id": "t1_dg9mv72", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Actually, during your first spring going to bed before 2 am will give full regen. It gives new players a good start. I think it stops after the egg festival (Spring 13) or when the Salmonberry harvest starts (Spring 15-18).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, during your first spring going to bed before 2 am will give full regen. It gives new players a good start. I think it stops after the egg festival (Spring 13) or when the Salmonberry harvest starts (Spring 15-18).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9sowy", "score_hidden": false, "stickied": false, "created": 1492234766.0, "created_utc": 1492205966.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9mv72", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PokerusBreeder", "parent_id": "t1_dg9jl5e", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I found that the before 11:50 timer also allows for full hp regen which is important for the mines. I haven't timed it in awhile so I may be using outdated modeling. If true, you're right, that extra hour can be super key to extra min-maxing. I'll give it a shot tonight. Thanks for the tip. :-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I found that the before 11:50 timer also allows for full hp regen which is important for the mines. I haven&amp;#39;t timed it in awhile so I may be using outdated modeling. If true, you&amp;#39;re right, that extra hour can be super key to extra min-maxing. I&amp;#39;ll give it a shot tonight. Thanks for the tip. :-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9mv72", "score_hidden": false, "stickied": false, "created": 1492227613.0, "created_utc": 1492198813.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9jl5e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BendyBlitzle", "parent_id": "t1_dg9b241", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Nice guide! :) I just have one question though: why do you keep emphasizing getting into bed by 11:50? All the other guides say to be in bed by/before 1am, and on a personal note I've always been able to stay up until 12:50 with no risk of energy loss the next day. That extra hour can be useful for extra foraging or fishing in the early game.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice guide! :) I just have one question though: why do you keep emphasizing getting into bed by 11:50? All the other guides say to be in bed by/before 1am, and on a personal note I&amp;#39;ve always been able to stay up until 12:50 with no risk of energy loss the next day. That extra hour can be useful for extra foraging or fishing in the early game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9jl5e", "score_hidden": false, "stickied": false, "created": 1492223666.0, "created_utc": 1492194866.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9b241", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "PokerusBreeder", "parent_id": "t3_65cnoj", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "I do speed runs for community center completion for fun. I found that the best way to think about your first year is to look at automation. As you said, watering crops is both time and energy intensive until you get to late game watering can / farming skill. My goal is to always have Farming up to level 6 prior to the first day of Summer. \n\nMy first day of Spring year 1 consists of clearing enough ground for 24ish crops, cutting enough trees for your first chest, hitting up the store to buy 1 Cauliflower seed, 1 Potato seed, 1 Green Bean seed, and whatever else I can in parsnips. Depending on what map you are playing, breaking enough ground and getting enough wood for that first chest can sometimes leave you enough time in the day to scavenge the beach for shells (early money) and/or hitting the south-east end of the woods below your farm for free food (spring onions). The goal is to be in bed between 10pm-11:50pm to get a full night's sleep but to spend as much time as you can getting wood (skilling up foraging for the field snacks and getting enough wood to fix the bridge on the beach). If you get unlucky with the onions and have run out of energy, foraging and scything plants do not consume energy. Clear out some more of your farm area, try to find some forageables for the community center, and get some sleep.\n\nDay 2, after you water your crops, head over to see Willy and get your free fishing pole. If you got enough wood (rarely), fix the bridge and pick up shells. You can sell shells directly to Willy to get the cash right away. Spend the rest of the day fishing in the lake outside Robin's house. Large mouth Bass sell for a good amount early game. You can usually make over 1K on day 2 if you spend the whole afternoon/evening fishing in the lake. If you get low on energy but have lots of daylight left, eat some green algae you caught or any extra chubs. They are plentiful and restore enough energy to be able to keep fishing. Leave the lake around 10-10:30pm to make sure you have enough time to sell all your fish (in the box) and get in bed before 11:50pm. \n\nDay 3 always rains from my experience. I am not particularly good at the fishing game so I usually skip trying for the catfish at this point (only appears during the rain in rivers). I spend all day fishing in the lake for more large mouth bass and getting that skill up for later. Your goal at this point is to try and get as much gold as possible to reinvest in 3 things - checking if you get lucky with the traveling cart and get her to sell you a red cabbage seeds / red cabbage, parsnip seeds and the first backpack upgrade. Why red cabbage? It's the only thing in the community center that cannot be naturally obtained until year 2. Also, inventory issues are a pain in the first week of spring and getting that upgraded backpack early allows for more fruitful missions into the mine and at the lake. \n\nDay 4 - Usually no rain. At this point, chop as many trees as you can while still watering your crops and looking for free food/shells on the beach. Your goal is to fix the bridge on the beach to get the more valuable shells and to save your sap for when you get to farming level 1. Investing in fertilizer as soon as you can is a generally smart idea as sap isn't particularly useful for anything else. Work until you run out of energy and food or run out of daylight. Get a full night's sleep.\n\nDay 5 opens up the mines. If memory serves, it is also your first parsnip day. Harvest your parsnips and sell all but 2-3 in the bin. You aren't going to get your farming skill upgrade until you sleep and you need to a) make fertilizer and b) make a scarecrow for the quest. Empty your inventory other than your food of choice and your pick. It's time to mine! Hit the mines and get your free sword. Prioritize progressing down over anything else. If you see copper or other easy loot along the way, go for it. If you happen to get a super lucky day on day 5, you will likely get 30+ ore just by accident. Save at least 25 stone for your first furnace (you get the recipe from clint the next day assuming you find at least one copper ore). Progress as far as you can and leave the mine around 10pm. Save your sap from slimes, copper ore and stone. Sell your gems. Hopefully you made it to at least level 20 in the mines to get your first upgraded sword. Get some rest for the next day.\n\nDay 6 allows you to build your first scarecrow to complete the intro quest (150g) and allows you to start making fertilizer. Hopefully none of your primary plants got eaten by crows before you made your first scarecrow. It appears to be a luck thing. Craft as much fertilizer as you can and go invest in some more parsnips. Why parsnips? You need 5 gold star parsnips for the community center and parsnips have a very quick return on investment. They are tied with potatoes for exp per day and with the community center requirements for the greenhouse, it's the breakeven point for me. It's a balancing act trying to get a good return on your investment while still skilling up as fast as you can. At this point you should have a large amount of fertilized parsnips planted, 1 or 2 scarecrows protecting your investments, a furnace to smelt future ores, at least 1 chest to hold your extra tools/stuff you're saving for later, and have fixed the bridge by the beach. How lucky you were up to this point will determine what you should focus on next. Make lots of parsnips. Keep up a steady supply of sap for Summer. Get at least one of every spring crop for the community center. Meet all the townsfolk to get the quest completed. Find at least 1 of every forageable for the community center. Get extra spring onions for the free energy boost. When the salmon berries come into season, pick a ton of them (80+). They make a good return on investment in jars (5 gold to sell a berry plain, 55(?) to sell them as jam). Dig deep into the mines on good luck days with the goal of getting to level 90. Why 90? You get the obsidian edge there and it makes killing things MUCH easier when you're hunting for gold/iron/crystals. I try to have 10+ each of iron bars, gold bars, and smelted crystals before Summer 1. That way you can make a ton of good sprinklers (the 8 plot ones) and spend your time doing other things after the first day. The more, the better. \n\nI'll write more if you think it will help, but this should be enough to get you started in spring. The game can be done at any pace you feel, but I find it more fun when there is a challenge involved.\n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do speed runs for community center completion for fun. I found that the best way to think about your first year is to look at automation. As you said, watering crops is both time and energy intensive until you get to late game watering can / farming skill. My goal is to always have Farming up to level 6 prior to the first day of Summer. &lt;/p&gt;\n\n&lt;p&gt;My first day of Spring year 1 consists of clearing enough ground for 24ish crops, cutting enough trees for your first chest, hitting up the store to buy 1 Cauliflower seed, 1 Potato seed, 1 Green Bean seed, and whatever else I can in parsnips. Depending on what map you are playing, breaking enough ground and getting enough wood for that first chest can sometimes leave you enough time in the day to scavenge the beach for shells (early money) and/or hitting the south-east end of the woods below your farm for free food (spring onions). The goal is to be in bed between 10pm-11:50pm to get a full night&amp;#39;s sleep but to spend as much time as you can getting wood (skilling up foraging for the field snacks and getting enough wood to fix the bridge on the beach). If you get unlucky with the onions and have run out of energy, foraging and scything plants do not consume energy. Clear out some more of your farm area, try to find some forageables for the community center, and get some sleep.&lt;/p&gt;\n\n&lt;p&gt;Day 2, after you water your crops, head over to see Willy and get your free fishing pole. If you got enough wood (rarely), fix the bridge and pick up shells. You can sell shells directly to Willy to get the cash right away. Spend the rest of the day fishing in the lake outside Robin&amp;#39;s house. Large mouth Bass sell for a good amount early game. You can usually make over 1K on day 2 if you spend the whole afternoon/evening fishing in the lake. If you get low on energy but have lots of daylight left, eat some green algae you caught or any extra chubs. They are plentiful and restore enough energy to be able to keep fishing. Leave the lake around 10-10:30pm to make sure you have enough time to sell all your fish (in the box) and get in bed before 11:50pm. &lt;/p&gt;\n\n&lt;p&gt;Day 3 always rains from my experience. I am not particularly good at the fishing game so I usually skip trying for the catfish at this point (only appears during the rain in rivers). I spend all day fishing in the lake for more large mouth bass and getting that skill up for later. Your goal at this point is to try and get as much gold as possible to reinvest in 3 things - checking if you get lucky with the traveling cart and get her to sell you a red cabbage seeds / red cabbage, parsnip seeds and the first backpack upgrade. Why red cabbage? It&amp;#39;s the only thing in the community center that cannot be naturally obtained until year 2. Also, inventory issues are a pain in the first week of spring and getting that upgraded backpack early allows for more fruitful missions into the mine and at the lake. &lt;/p&gt;\n\n&lt;p&gt;Day 4 - Usually no rain. At this point, chop as many trees as you can while still watering your crops and looking for free food/shells on the beach. Your goal is to fix the bridge on the beach to get the more valuable shells and to save your sap for when you get to farming level 1. Investing in fertilizer as soon as you can is a generally smart idea as sap isn&amp;#39;t particularly useful for anything else. Work until you run out of energy and food or run out of daylight. Get a full night&amp;#39;s sleep.&lt;/p&gt;\n\n&lt;p&gt;Day 5 opens up the mines. If memory serves, it is also your first parsnip day. Harvest your parsnips and sell all but 2-3 in the bin. You aren&amp;#39;t going to get your farming skill upgrade until you sleep and you need to a) make fertilizer and b) make a scarecrow for the quest. Empty your inventory other than your food of choice and your pick. It&amp;#39;s time to mine! Hit the mines and get your free sword. Prioritize progressing down over anything else. If you see copper or other easy loot along the way, go for it. If you happen to get a super lucky day on day 5, you will likely get 30+ ore just by accident. Save at least 25 stone for your first furnace (you get the recipe from clint the next day assuming you find at least one copper ore). Progress as far as you can and leave the mine around 10pm. Save your sap from slimes, copper ore and stone. Sell your gems. Hopefully you made it to at least level 20 in the mines to get your first upgraded sword. Get some rest for the next day.&lt;/p&gt;\n\n&lt;p&gt;Day 6 allows you to build your first scarecrow to complete the intro quest (150g) and allows you to start making fertilizer. Hopefully none of your primary plants got eaten by crows before you made your first scarecrow. It appears to be a luck thing. Craft as much fertilizer as you can and go invest in some more parsnips. Why parsnips? You need 5 gold star parsnips for the community center and parsnips have a very quick return on investment. They are tied with potatoes for exp per day and with the community center requirements for the greenhouse, it&amp;#39;s the breakeven point for me. It&amp;#39;s a balancing act trying to get a good return on your investment while still skilling up as fast as you can. At this point you should have a large amount of fertilized parsnips planted, 1 or 2 scarecrows protecting your investments, a furnace to smelt future ores, at least 1 chest to hold your extra tools/stuff you&amp;#39;re saving for later, and have fixed the bridge by the beach. How lucky you were up to this point will determine what you should focus on next. Make lots of parsnips. Keep up a steady supply of sap for Summer. Get at least one of every spring crop for the community center. Meet all the townsfolk to get the quest completed. Find at least 1 of every forageable for the community center. Get extra spring onions for the free energy boost. When the salmon berries come into season, pick a ton of them (80+). They make a good return on investment in jars (5 gold to sell a berry plain, 55(?) to sell them as jam). Dig deep into the mines on good luck days with the goal of getting to level 90. Why 90? You get the obsidian edge there and it makes killing things MUCH easier when you&amp;#39;re hunting for gold/iron/crystals. I try to have 10+ each of iron bars, gold bars, and smelted crystals before Summer 1. That way you can make a ton of good sprinklers (the 8 plot ones) and spend your time doing other things after the first day. The more, the better. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll write more if you think it will help, but this should be enough to get you started in spring. The game can be done at any pace you feel, but I find it more fun when there is a challenge involved.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9b241", "score_hidden": false, "stickied": false, "created": 1492213884.0, "created_utc": 1492185084.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": "", "user_reports": [], "id": "dg971o7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Bradsooner", "parent_id": "t3_65cnoj", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Potatoes for spring blue berry for summer my advice is to straight up save one of everything you find", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Potatoes for spring blue berry for summer my advice is to straight up save one of everything you find&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg971o7", "score_hidden": false, "stickied": false, "created": 1492208960.0, "created_utc": 1492180160.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": "", "user_reports": [], "id": "dg9qspt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greyhoundknight", "parent_id": "t1_dg9q5jk", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "True. I go for parsnip, melon, corn for speed purpose and since you can make fertilizer from sap at a low level. If I don't have 5 corn by fall then I put fertilizer on pumpkin as well just to be safe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True. I go for parsnip, melon, corn for speed purpose and since you can make fertilizer from sap at a low level. If I don&amp;#39;t have 5 corn by fall then I put fertilizer on pumpkin as well just to be safe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9qspt", "score_hidden": false, "stickied": false, "created": 1492232357.0, "created_utc": 1492203557.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9q5jk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bayoel", "parent_id": "t1_dg9eqm2", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "You only need 3 type of crops for quality bundle. I always skip parsnip and go for 3 others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You only need 3 type of crops for quality bundle. I always skip parsnip and go for 3 others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9q5jk", "score_hidden": false, "stickied": false, "created": 1492231569.0, "created_utc": 1492202769.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9eqm2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "greyhoundknight", "parent_id": "t3_65cnoj", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "This is what I am currently doing with my Riverlands farm. Spring was super easy and I probably had 50-80 crops. Down side was my foraging level was garbage. I over planted in summer at 150 and spent most of my energy watering. I also missed upgrading my watering can in the Spring rains.\n\nFor the greenhouse bundles I would look at which crops you need for each season and grow at least one of them. For the quality bundle make quality fertilizer and put it on parsnips, melons, corn, and pumpkins. I planted about 5 corn with the quality fertilizer in summer and was able to have all the quality crops by the end of summer.\n\nI also chose the fruit bats to make the artisan bundle easier. That is a relatively easy bundle. The animal products are the hardest. I would get the coop first, get chickens 1 at a time until you have 1 white and 1 brown. Then get the big barn with a cow and goat. I would upgrade to the big coop for the duck egg last.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what I am currently doing with my Riverlands farm. Spring was super easy and I probably had 50-80 crops. Down side was my foraging level was garbage. I over planted in summer at 150 and spent most of my energy watering. I also missed upgrading my watering can in the Spring rains.&lt;/p&gt;\n\n&lt;p&gt;For the greenhouse bundles I would look at which crops you need for each season and grow at least one of them. For the quality bundle make quality fertilizer and put it on parsnips, melons, corn, and pumpkins. I planted about 5 corn with the quality fertilizer in summer and was able to have all the quality crops by the end of summer.&lt;/p&gt;\n\n&lt;p&gt;I also chose the fruit bats to make the artisan bundle easier. That is a relatively easy bundle. The animal products are the hardest. I would get the coop first, get chickens 1 at a time until you have 1 white and 1 brown. Then get the big barn with a cow and goat. I would upgrade to the big coop for the duck egg last.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9eqm2", "score_hidden": false, "stickied": false, "created": 1492217999.0, "created_utc": 1492189199.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": "", "user_reports": [], "id": "dg9op7q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "niu-", "parent_id": "t1_dg9k68f", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Especially the first one you cite is solid. \n\nMy fave for money was yet [another guide](https://www.reddit.com/r/StardewValley/comments/4cvgf5/guide_to_getting_5_million_your_first_year/), though. Although, I think 5mil must have been before the latest adjustment of revenues on berries. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Especially the first one you cite is solid. &lt;/p&gt;\n\n&lt;p&gt;My fave for money was yet &lt;a href=\"https://www.reddit.com/r/StardewValley/comments/4cvgf5/guide_to_getting_5_million_your_first_year/\"&gt;another guide&lt;/a&gt;, though. Although, I think 5mil must have been before the latest adjustment of revenues on berries. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9op7q", "score_hidden": false, "stickied": false, "created": 1492229817.0, "created_utc": 1492201017.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9k68f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BendyBlitzle", "parent_id": "t3_65cnoj", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Personally I'd recommend [this guide](https://www.reddit.com/r/StardewValley/comments/5ewiqk/year_one_guide/) as the one that I vaguely followed my first playthrough and got the greenhouse in late Fall. I emphasized animals before house to better guarantee the needed animal products, and ate cheese instead of sashimi.\n\nThere's also [this guide](http://community.playstarbound.com/threads/stardew-valley-1-1-newbie-guide.125018/) which is a great general guide but doesn't really emphasize early greenhouse acquisition. The top comments contribute as well, so read them too!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally I&amp;#39;d recommend &lt;a href=\"https://www.reddit.com/r/StardewValley/comments/5ewiqk/year_one_guide/\"&gt;this guide&lt;/a&gt; as the one that I vaguely followed my first playthrough and got the greenhouse in late Fall. I emphasized animals before house to better guarantee the needed animal products, and ate cheese instead of sashimi.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also &lt;a href=\"http://community.playstarbound.com/threads/stardew-valley-1-1-newbie-guide.125018/\"&gt;this guide&lt;/a&gt; which is a great general guide but doesn&amp;#39;t really emphasize early greenhouse acquisition. The top comments contribute as well, so read them too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dg9k68f", "score_hidden": false, "stickied": false, "created": 1492224364.0, "created_utc": 1492195564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2wb7y", "removal_reason": null, "link_id": "t3_65cnoj", "likes": null, "replies": "", "user_reports": [], "id": "dga2v4o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "1stofspringyear1", "parent_id": "t3_65cnoj", "subreddit_name_prefixed": "r/StardewValley", "controversiality": 0, "body": "Well I wrote this little thing about a way to get a large triple strawberry harvest in the first spring.\n https://www.reddit.com/r/StardewValley/comments/64hdv3/please_try_this_and_report_back_new_file_route/ ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I wrote this little thing about a way to get a large triple strawberry harvest in the first spring.\n &lt;a href=\"https://www.reddit.com/r/StardewValley/comments/64hdv3/please_try_this_and_report_back_new_file_route/\"&gt;https://www.reddit.com/r/StardewValley/comments/64hdv3/please_try_this_and_report_back_new_file_route/&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "StardewValley", "name": "t1_dga2v4o", "score_hidden": false, "stickied": false, "created": 1492248320.0, "created_utc": 1492219520.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]