[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TW: Abuse&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to keep this relatively vague for privacy and security.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a divorced parent of one child, and for some time attempted to peacefully coparent with my ex husband. In spite of his generally manipulative and narcissistic behavior, I believed that it would be best for my son to have both parents involved in his life, and that the best thing for him would be if me and his dad got along and worked together.  &lt;/p&gt;\n\n&lt;p&gt;His dad tried to gaslight be a few times in the beginning of visitation, which I quickly shut down by limiting almost all contact except for visitation. &lt;/p&gt;\n\n&lt;p&gt;My son started getting sick when he was at his dad&amp;#39;s. My son has a number of allergies and food intolerances, and like clockwork, he would come back from his dad&amp;#39;s and get sick. I reminded him each time what my son couldn&amp;#39;t eat and let him know he had gotten sick. Eventually it stopped.  &lt;/p&gt;\n\n&lt;p&gt;But other things started happening as well. My son was suddenly touching himself-a LOT. He starting wetting the bed again, and when he would, he would wake up and be inconsolably upset.  &lt;/p&gt;\n\n&lt;p&gt;He started becoming aggressive. He would get angry-extremely angry, and he would hit, pinch, and bite.  &lt;/p&gt;\n\n&lt;p&gt;Sometimes he would drop something or spill a drink, and he would take two steps back and look completely terrified.  &lt;/p&gt;\n\n&lt;p&gt;Sometimes he was just plain badly behaved in a way that was really out of character for him. He talked back a lot, growled, yelled, and would say things like &amp;quot;I&amp;#39;m going to hurt you!&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;Almost a year since he started having visitation with his dad, he was suddenly terrified of seeing his dad. I mean, screaming, kicking, crying to the point of almost throwing up. I didn&amp;#39;t force him to go, but I tried to reconcile him and his dad.  &lt;/p&gt;\n\n&lt;p&gt;At this point, you&amp;#39;re probably wondering what the heck I was thinking. My son is four, three at the time. I would ask him about these things, ask him if anyone ever hit him or touched him inappropriately, and he was say &amp;quot;no&amp;quot;. Sometimes he would say &amp;quot;I can&amp;#39;t talk about it&amp;quot;. I would ask him questions and sometimes he wouldn&amp;#39;t give an answer at all. And some of it seemed like maybe it was normal developmental stuff. Kids go through hitting stages. Sometimes they play with themselves around this age.  Sometimes they&amp;#39;re just brats when they&amp;#39;re three. Plus, years of gas lighting and manipulation from his dad left me doubting my perception of reality and feeling guilty that it was somehow my fault, and that I was biased against him.  &lt;/p&gt;\n\n&lt;p&gt;Eventually my son and his dad reconciled, kind of. I left him at his dad&amp;#39;s one day, much to my son&amp;#39;s dismay, but he wasn&amp;#39;t screaming and crying this time. And when he came back, he was joyful! Daddy had taken him somewhere special. He had eaten candy and cookies and drank juice.  &lt;/p&gt;\n\n&lt;p&gt;In hindsight, I know this was part of the abuse cycle. In hindsight, I feel a profound amount of guilt for not recognizing the signs of abuse.  &lt;/p&gt;\n\n&lt;p&gt;Now I know much of what happened. My son is coming out about what happened, and it&amp;#39;s even worse than I thought. He sexually, physically, and emotionally abused him. He threatened him to stay quiet. I&amp;#39;m horrified and livid that this happened right under my nose.  &lt;/p&gt;\n\n&lt;p&gt;So this is what I&amp;#39;m saying to all of you, and I hope you live by it: Trust your gut. When you feel like something isn&amp;#39;t quite right, listen to it. Investigate.  &lt;/p&gt;\n\n&lt;p&gt;Educate yourselves on the symptoms of abuse. My son never came home with a suspicious bruise, and yet I know he was hit only because my son told me. Everyone thinks that abuse won&amp;#39;t happen to their child-until it does.  &lt;/p&gt;\n\n&lt;p&gt;Arm your kids against abuse as soon as they can understand-around two or three. Talk to them about good touches verses bad touches, and let them know that if anyone tells them to keep a secret from you, that they need to tell you right away. Also remind them frequently that they can always talk to you about anything.  &lt;/p&gt;\n\n&lt;p&gt;And if, God forbid, something ever happens, fight like hell to get it taken care of. CPS is a joke. The police are extremely limited on what they can do. It has been a long and arduous process getting legal action, and I am just now making real headway. But it&amp;#39;s worth it. Anything is worth it to keep our kids safe.  &lt;/p&gt;\n\n&lt;p&gt;A parent&amp;#39;s intuition is extremely valuable. Keep your eyes and ears wide open, and I pray that none of your children ever experience this type of hell. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;A lot of people are missing the point of this post.  &lt;/p&gt;\n\n&lt;p&gt;I left out a number of details in order to preserve our safety and my son&amp;#39;s privacy. The purpose of this post is to warn other parents to be vigilant, even if they think their child is 100% safe from any potential abuse. I outlined some of the sings of abuse I noticed in order to help other parents notice similar signs in their own kids if, God forbid, the same were to happen.  &lt;/p&gt;\n\n&lt;p&gt;Yes, my son is in therapy. Yes, legal action is being taken. No, my son is not having any contact whatsoever with his dad (over my dead body would he ever).  &lt;/p&gt;\n\n&lt;p&gt;To the people questioning if this really happened, that is really, &lt;em&gt;really&lt;/em&gt; not the point of this post. I have spent agonizing months trying to explain this situation to a number of authorities riding on their belief to protect my son legally, which means that not being believed not only hurts emotionally, but can put my son in danger. So I have a bit of anxiety about this. I&amp;#39;m not going to violate my son&amp;#39;s privacy and security to prove our situation to a bunch of internet strangers.  &lt;/p&gt;\n\n&lt;p&gt;To the people who have been supportive and have offered resources to help us and other children, thank-you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "TW: Abuse\n\nI'm going to keep this relatively vague for privacy and security.\n  \nI'm a divorced parent of one child, and for some time attempted to peacefully coparent with my ex husband. In spite of his generally manipulative and narcissistic behavior, I believed that it would be best for my son to have both parents involved in his life, and that the best thing for him would be if me and his dad got along and worked together.  \n  \nHis dad tried to gaslight be a few times in the beginning of visitation, which I quickly shut down by limiting almost all contact except for visitation. \n  \nMy son started getting sick when he was at his dad's. My son has a number of allergies and food intolerances, and like clockwork, he would come back from his dad's and get sick. I reminded him each time what my son couldn't eat and let him know he had gotten sick. Eventually it stopped.  \n  \nBut other things started happening as well. My son was suddenly touching himself-a LOT. He starting wetting the bed again, and when he would, he would wake up and be inconsolably upset.  \n  \nHe started becoming aggressive. He would get angry-extremely angry, and he would hit, pinch, and bite.  \n  \nSometimes he would drop something or spill a drink, and he would take two steps back and look completely terrified.  \n  \nSometimes he was just plain badly behaved in a way that was really out of character for him. He talked back a lot, growled, yelled, and would say things like \"I'm going to hurt you!\"  \n  \nAlmost a year since he started having visitation with his dad, he was suddenly terrified of seeing his dad. I mean, screaming, kicking, crying to the point of almost throwing up. I didn't force him to go, but I tried to reconcile him and his dad.  \n  \nAt this point, you're probably wondering what the heck I was thinking. My son is four, three at the time. I would ask him about these things, ask him if anyone ever hit him or touched him inappropriately, and he was say \"no\". Sometimes he would say \"I can't talk about it\". I would ask him questions and sometimes he wouldn't give an answer at all. And some of it seemed like maybe it was normal developmental stuff. Kids go through hitting stages. Sometimes they play with themselves around this age.  Sometimes they're just brats when they're three. Plus, years of gas lighting and manipulation from his dad left me doubting my perception of reality and feeling guilty that it was somehow my fault, and that I was biased against him.  \n  \nEventually my son and his dad reconciled, kind of. I left him at his dad's one day, much to my son's dismay, but he wasn't screaming and crying this time. And when he came back, he was joyful! Daddy had taken him somewhere special. He had eaten candy and cookies and drank juice.  \n  \nIn hindsight, I know this was part of the abuse cycle. In hindsight, I feel a profound amount of guilt for not recognizing the signs of abuse.  \n  \nNow I know much of what happened. My son is coming out about what happened, and it's even worse than I thought. He sexually, physically, and emotionally abused him. He threatened him to stay quiet. I'm horrified and livid that this happened right under my nose.  \n   \nSo this is what I'm saying to all of you, and I hope you live by it: Trust your gut. When you feel like something isn't quite right, listen to it. Investigate.  \n  \nEducate yourselves on the symptoms of abuse. My son never came home with a suspicious bruise, and yet I know he was hit only because my son told me. Everyone thinks that abuse won't happen to their child-until it does.  \n  \nArm your kids against abuse as soon as they can understand-around two or three. Talk to them about good touches verses bad touches, and let them know that if anyone tells them to keep a secret from you, that they need to tell you right away. Also remind them frequently that they can always talk to you about anything.  \n  \nAnd if, God forbid, something ever happens, fight like hell to get it taken care of. CPS is a joke. The police are extremely limited on what they can do. It has been a long and arduous process getting legal action, and I am just now making real headway. But it's worth it. Anything is worth it to keep our kids safe.  \n  \n  \nA parent's intuition is extremely valuable. Keep your eyes and ears wide open, and I pray that none of your children ever experience this type of hell. \n\n**Edit**  \n  \nA lot of people are missing the point of this post.  \n  \nI left out a number of details in order to preserve our safety and my son's privacy. The purpose of this post is to warn other parents to be vigilant, even if they think their child is 100% safe from any potential abuse. I outlined some of the sings of abuse I noticed in order to help other parents notice similar signs in their own kids if, God forbid, the same were to happen.  \n  \nYes, my son is in therapy. Yes, legal action is being taken. No, my son is not having any contact whatsoever with his dad (over my dead body would he ever).  \n  \nTo the people questioning if this really happened, that is really, *really* not the point of this post. I have spent agonizing months trying to explain this situation to a number of authorities riding on their belief to protect my son legally, which means that not being believed not only hurts emotionally, but can put my son in danger. So I have a bit of anxiety about this. I'm not going to violate my son's privacy and security to prove our situation to a bunch of internet strangers.  \n   \nTo the people who have been supportive and have offered resources to help us and other children, thank-you.\n  ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Safety", "id": "64nvc5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 515, "report_reasons": null, "author": "parentthrowaway1456", "saved": false, "mod_reports": [], "name": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": 1491922299.0, "link_flair_css_class": "safety", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/64nvc5/parents_please_listen_to_your_gut_and_protect/", "num_reports": null, "locked": false, "stickied": false, "created": 1491903179.0, "url": "https://www.reddit.com/r/Parenting/comments/64nvc5/parents_please_listen_to_your_gut_and_protect/", "author_flair_text": null, "quarantine": false, "title": "Parents: Please listen to your gut and protect your kids", "created_utc": 1491874379.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 74, "visited": false, "subreddit_type": "public", "ups": 515}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4cymd", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg3ui39", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We have been receiving trauma-focused therapy. Thank-you for your suggestion. It has been wonderful for him and even our relationship. I am a huge supporter of this sort of therapy for children who have experienced abuse. \n  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We have been receiving trauma-focused therapy. Thank-you for your suggestion. It has been wonderful for him and even our relationship. I am a huge supporter of this sort of therapy for children who have experienced abuse. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4cymd", "score_hidden": false, "stickied": false, "created": 1491951239.0, "created_utc": 1491922439.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3ui39", "gilded": 0, "archived": false, "score": 51, "report_reasons": null, "author": "escapevelocity11", "parent_id": "t1_dg3ric7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Totally agree with the therapy suggestion.  I'd highly recommend the [National Child Traumatic Stress Network](http://www.nctsn.org/) as a general resource for families of children who have been abused or traumatized.  Regarding specific treatments, I specifically suggest considering [**Trauma-Focused Cognitive Behavioral Therapy**](https://tfcbt.org/), an evidence-based treatment for children with PTSD/traumatic stress. That second link will help you find resources such as therapists who have been certified in TF-CBT in your area.\n\nI'm so sorry this happened to your son. I hope that getting him intro treatment will help him (and you) develop coping skills to deal with the symptoms of traumatic stress and help him process what has happened to him.  Please PM me if you have any additional questions about TF-CBT or other trauma resources.\n\nEdit:  I also want to add that I don't typically jump straight to recommending therapy when instances of abuse are uncovered.  Not all children exhibit signs of trauma; however, your description of your child's changes in behavior (e.g., aggression towards you, bed wetting, etc) are pretty typical signs of traumatic stress in young children. A trained therapist will conduct assessments to see if your son has clinically-significant levels of PTSD and then help you formulate a treatment plan to address his specific presenting problems.  ", "edited": 1491885982.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Totally agree with the therapy suggestion.  I&amp;#39;d highly recommend the &lt;a href=\"http://www.nctsn.org/\"&gt;National Child Traumatic Stress Network&lt;/a&gt; as a general resource for families of children who have been abused or traumatized.  Regarding specific treatments, I specifically suggest considering &lt;a href=\"https://tfcbt.org/\"&gt;&lt;strong&gt;Trauma-Focused Cognitive Behavioral Therapy&lt;/strong&gt;&lt;/a&gt;, an evidence-based treatment for children with PTSD/traumatic stress. That second link will help you find resources such as therapists who have been certified in TF-CBT in your area.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so sorry this happened to your son. I hope that getting him intro treatment will help him (and you) develop coping skills to deal with the symptoms of traumatic stress and help him process what has happened to him.  Please PM me if you have any additional questions about TF-CBT or other trauma resources.&lt;/p&gt;\n\n&lt;p&gt;Edit:  I also want to add that I don&amp;#39;t typically jump straight to recommending therapy when instances of abuse are uncovered.  Not all children exhibit signs of trauma; however, your description of your child&amp;#39;s changes in behavior (e.g., aggression towards you, bed wetting, etc) are pretty typical signs of traumatic stress in young children. A trained therapist will conduct assessments to see if your son has clinically-significant levels of PTSD and then help you formulate a treatment plan to address his specific presenting problems.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3ui39", "score_hidden": false, "stickied": false, "created": 1491913237.0, "created_utc": 1491884437.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 51}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4mfdf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Sjb1985", "parent_id": "t1_dg48ubh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm glad you did this. I also agree with this message - listen, and advocate for your children. On posts similar to yours in the past (so sad that there are many), people have stated that - 'Oh you're lucky, the child won't remember.' I don't want any parent to take the advice of redditors when it comes to this. A trained professional is necessary. \n\nI'm glad you shared your story. It is unfortunate that you even went through this and that your son experienced any of what he did. Hopefully other parents will research the signs and be their child's voice when no one else will.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad you did this. I also agree with this message - listen, and advocate for your children. On posts similar to yours in the past (so sad that there are many), people have stated that - &amp;#39;Oh you&amp;#39;re lucky, the child won&amp;#39;t remember.&amp;#39; I don&amp;#39;t want any parent to take the advice of redditors when it comes to this. A trained professional is necessary. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m glad you shared your story. It is unfortunate that you even went through this and that your son experienced any of what he did. Hopefully other parents will research the signs and be their child&amp;#39;s voice when no one else will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4mfdf", "score_hidden": false, "stickied": false, "created": 1491961661.0, "created_utc": 1491932861.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg524p5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "clevercalamity", "parent_id": "t1_dg48ubh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I know you said you feel guilty but I just want to say that what happened wasn't your fault. Little kids are hard to understand and while there were red flags no ones mind jumps to the worst. I think it's great you are educating other parents and you are going above and beyond to help your son heal. \n\nYou are a good mom. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know you said you feel guilty but I just want to say that what happened wasn&amp;#39;t your fault. Little kids are hard to understand and while there were red flags no ones mind jumps to the worst. I think it&amp;#39;s great you are educating other parents and you are going above and beyond to help your son heal. &lt;/p&gt;\n\n&lt;p&gt;You are a good mom. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg524p5", "score_hidden": false, "stickied": false, "created": 1491979563.0, "created_utc": 1491950763.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48ubh", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg3ric7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "He is in therapy. I didn't add many details because I felt the post was getting long. The purpose of the post is to warn other parents to be vigilant, not to blab on about our situation.  \n  \nTherapy has been amazing for him and he's part of a marvelous program. I am being very careful to always listen whenever he wants to talk and give him the most support possible. He is a clever boy and much of this abuse occurred a year or more ago. If he remembers now, he will remember later. He has many people in his life who are extremely understanding and supportive about what happened. I'm sorry you went through that, and I hope you're getting help and on the path to recovery.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is in therapy. I didn&amp;#39;t add many details because I felt the post was getting long. The purpose of the post is to warn other parents to be vigilant, not to blab on about our situation.  &lt;/p&gt;\n\n&lt;p&gt;Therapy has been amazing for him and he&amp;#39;s part of a marvelous program. I am being very careful to always listen whenever he wants to talk and give him the most support possible. He is a clever boy and much of this abuse occurred a year or more ago. If he remembers now, he will remember later. He has many people in his life who are extremely understanding and supportive about what happened. I&amp;#39;m sorry you went through that, and I hope you&amp;#39;re getting help and on the path to recovery.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48ubh", "score_hidden": false, "stickied": false, "created": 1491946059.0, "created_utc": 1491917259.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4gnnw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "anothermuggle", "parent_id": "t1_dg4f87j", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": ":( I'm so sorry. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;:( I&amp;#39;m so sorry. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4gnnw", "score_hidden": false, "stickied": false, "created": 1491955362.0, "created_utc": 1491926562.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4f87j", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "bugscuz", "parent_id": "t1_dg43fhq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I was sexually abused as a toddler, and it still affects me in a big way even if I can't remember it happening - I remember the feelings I was left with afterwards", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was sexually abused as a toddler, and it still affects me in a big way even if I can&amp;#39;t remember it happening - I remember the feelings I was left with afterwards&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4f87j", "score_hidden": false, "stickied": false, "created": 1491953786.0, "created_utc": 1491924986.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43fhq", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "istara", "parent_id": "t1_dg3tblm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "A relative of mine suffered sexual abuse as a young child, a little older than OP's son and possibly not as severe, but it caused a nervous breakdown in his fifties. Of course in his day such a thing was NEVER talked about and therapy was non-existent.\n\nTotally agree to get therapy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A relative of mine suffered sexual abuse as a young child, a little older than OP&amp;#39;s son and possibly not as severe, but it caused a nervous breakdown in his fifties. Of course in his day such a thing was NEVER talked about and therapy was non-existent.&lt;/p&gt;\n\n&lt;p&gt;Totally agree to get therapy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg43fhq", "score_hidden": false, "stickied": false, "created": 1491935549.0, "created_utc": 1491906749.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4cvgf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg3tblm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It does affect him, and he does remember things, even over a year back. He is in therapy and it's been great for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It does affect him, and he does remember things, even over a year back. He is in therapy and it&amp;#39;s been great for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4cvgf", "score_hidden": false, "stickied": false, "created": 1491951140.0, "created_utc": 1491922340.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3tblm", "gilded": 0, "archived": false, "score": 50, "report_reasons": null, "author": "lynn", "parent_id": "t1_dg3ric7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "And even if they don't, it'll still affect him. I don't remember anything but I have some issues and looking back it seems pretty obvious that I was probably abused at some point. I won't ask, because the worst thing now would be confirmation that they knew he'd done it and still stayed with him and still sent me over there (even with someone else always being with me). But I'm like 95% certain. And the issues remain.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And even if they don&amp;#39;t, it&amp;#39;ll still affect him. I don&amp;#39;t remember anything but I have some issues and looking back it seems pretty obvious that I was probably abused at some point. I won&amp;#39;t ask, because the worst thing now would be confirmation that they knew he&amp;#39;d done it and still stayed with him and still sent me over there (even with someone else always being with me). But I&amp;#39;m like 95% certain. And the issues remain.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3tblm", "score_hidden": false, "stickied": false, "created": 1491911359.0, "created_utc": 1491882559.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 50}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg40n62", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Kakita987", "parent_id": "t1_dg3ric7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I was sexually abused by my father around that age. I barely remember anything at all from my visitation, but my mom did have me in counseling for various reasons. Also, he went to jail for a little while because of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was sexually abused by my father around that age. I barely remember anything at all from my visitation, but my mom did have me in counseling for various reasons. Also, he went to jail for a little while because of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg40n62", "score_hidden": false, "stickied": false, "created": 1491926931.0, "created_utc": 1491898131.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg486dp", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "jeangenie18", "parent_id": "t1_dg3ric7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Even if they don't remember, the body does. Emotional flashbacks are a real thing and just as debilitating. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if they don&amp;#39;t remember, the body does. Emotional flashbacks are a real thing and just as debilitating. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg486dp", "score_hidden": false, "stickied": false, "created": 1491945105.0, "created_utc": 1491916305.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4u0be", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg4mviq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't know if I'd agree with the therapist, but psychology is constantly evolving, just like other medical science. My son's therapy encourages us to listen to him whenever he talks about it, but of course we aren't supposed to directly address it. We do, however, constantly affirm his safety and give him tons of positive reinforcement which has made a world of difference for him. Also reminding him that he's not at fault.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if I&amp;#39;d agree with the therapist, but psychology is constantly evolving, just like other medical science. My son&amp;#39;s therapy encourages us to listen to him whenever he talks about it, but of course we aren&amp;#39;t supposed to directly address it. We do, however, constantly affirm his safety and give him tons of positive reinforcement which has made a world of difference for him. Also reminding him that he&amp;#39;s not at fault.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4u0be", "score_hidden": false, "stickied": false, "created": 1491969859.0, "created_utc": 1491941059.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mviq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "davidnicol22", "parent_id": "t1_dg4m53s", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Makes sense, I hope I'm not coming across as bashing therapy, that's not my intent.\n\nWhat the therapist told us still make sense, but it's a tough call and hindsight is 20/20.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Makes sense, I hope I&amp;#39;m not coming across as bashing therapy, that&amp;#39;s not my intent.&lt;/p&gt;\n\n&lt;p&gt;What the therapist told us still make sense, but it&amp;#39;s a tough call and hindsight is 20/20.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4mviq", "score_hidden": false, "stickied": false, "created": 1491962151.0, "created_utc": 1491933351.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4twl4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg4m53s", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You're right. The therapy we're actually doing now is parent-child interaction therapy, which helps me create a really safe place for my son in my home and help him work through his emotions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. The therapy we&amp;#39;re actually doing now is parent-child interaction therapy, which helps me create a really safe place for my son in my home and help him work through his emotions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4twl4", "score_hidden": false, "stickied": false, "created": 1491969744.0, "created_utc": 1491940944.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4m53s", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Sjb1985", "parent_id": "t1_dg4kdmh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "At that young of an age they do play therapy. It's very different than adult therapy. Just an FYI.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At that young of an age they do play therapy. It&amp;#39;s very different than adult therapy. Just an FYI.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4m53s", "score_hidden": false, "stickied": false, "created": 1491961347.0, "created_utc": 1491932547.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kdmh", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "davidnicol22", "parent_id": "t1_dg3ric7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My little brother was sexually abused by my cousin at around your kids age. The therapist told us not to discuss it with him unless he brought it up because maybe he didn't attach any feelings to the act since he was so young (I'm ten years older). By taking about it we might assign special significance to it that he wasn't aware of. \n\nWe never discussed it, Alex eventually got into trouble with drugs and alcohol (not just because of the abuse). After a while we learned that he remembered the abuse but didn't talk about it because we didn't, he figured he'd done something wrong.\n\nAs his older brother (I also half raised him) that was very painful for me to hear. In hindsight of course I wish of talked to him about it earlier. Maybe I could have saved him some grief. Then again maybe it could go the other way with another child.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My little brother was sexually abused by my cousin at around your kids age. The therapist told us not to discuss it with him unless he brought it up because maybe he didn&amp;#39;t attach any feelings to the act since he was so young (I&amp;#39;m ten years older). By taking about it we might assign special significance to it that he wasn&amp;#39;t aware of. &lt;/p&gt;\n\n&lt;p&gt;We never discussed it, Alex eventually got into trouble with drugs and alcohol (not just because of the abuse). After a while we learned that he remembered the abuse but didn&amp;#39;t talk about it because we didn&amp;#39;t, he figured he&amp;#39;d done something wrong.&lt;/p&gt;\n\n&lt;p&gt;As his older brother (I also half raised him) that was very painful for me to hear. In hindsight of course I wish of talked to him about it earlier. Maybe I could have saved him some grief. Then again maybe it could go the other way with another child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4kdmh", "score_hidden": false, "stickied": false, "created": 1491959424.0, "created_utc": 1491930624.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg48884", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "roofuskit", "parent_id": "t1_dg3ric7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Not that this compares, but I remember having my head sewed back up. If it's traumatic enough kids will definitely remember.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not that this compares, but I remember having my head sewed back up. If it&amp;#39;s traumatic enough kids will definitely remember.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48884", "score_hidden": false, "stickied": false, "created": 1491945181.0, "created_utc": 1491916381.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4cpwx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "slowsuby", "parent_id": "t1_dg3ric7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "And even if you don't explicitly remember what happened, it manifests itself in destructive ways. Agree 100% therapy is necessary. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And even if you don&amp;#39;t explicitly remember what happened, it manifests itself in destructive ways. Agree 100% therapy is necessary. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4cpwx", "score_hidden": false, "stickied": false, "created": 1491950963.0, "created_utc": 1491922163.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3ric7", "gilded": 0, "archived": false, "score": 341, "report_reasons": null, "author": "Sjb1985", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Get your child in therapy. Don't believe any of the bullshit people tell you about not remembering shit at that age. I remember all the stuff that happened to me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get your child in therapy. Don&amp;#39;t believe any of the bullshit people tell you about not remembering shit at that age. I remember all the stuff that happened to me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3ric7", "score_hidden": false, "stickied": false, "created": 1491908796.0, "created_utc": 1491879996.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 341}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4d0uk", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg3tdj5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank-you so much. It's hard for me because it took me so long to recognize the signs. That's why I'm making this post-to keep other parents aware. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank-you so much. It&amp;#39;s hard for me because it took me so long to recognize the signs. That&amp;#39;s why I&amp;#39;m making this post-to keep other parents aware. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4d0uk", "score_hidden": false, "stickied": false, "created": 1491951309.0, "created_utc": 1491922509.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3tdj5", "gilded": 0, "archived": false, "score": 59, "report_reasons": null, "author": "TheHatOnTheCat", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This is so awful. I'm so sorry this happened to your little boy. \n\nI can only imagine how guilty you must feel but OP you aren't the one who abused your child. His father is the @#$%* here. You did what you thought was best for him. You thought a relationship with his father, even though you personally disliked the man, was best. You were wrong. But you were not wrong on purpose. You just didn't know. That's very sad but it's not a moral failing on your part. \n\nYou are a good mother. You did what you thought was best for your child. You never hurt your child. You took care of him. And now you've fought for him. You are protecting him. It sounds like you are doing everything for him you know how. Which is all that can be expected of any of us. \n\nBad things happen in the world. Bad things happen to good people and to sweet little toddler people. It's awful. But you would never do that. You aren't bad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is so awful. I&amp;#39;m so sorry this happened to your little boy. &lt;/p&gt;\n\n&lt;p&gt;I can only imagine how guilty you must feel but OP you aren&amp;#39;t the one who abused your child. His father is the @#$%* here. You did what you thought was best for him. You thought a relationship with his father, even though you personally disliked the man, was best. You were wrong. But you were not wrong on purpose. You just didn&amp;#39;t know. That&amp;#39;s very sad but it&amp;#39;s not a moral failing on your part. &lt;/p&gt;\n\n&lt;p&gt;You are a good mother. You did what you thought was best for your child. You never hurt your child. You took care of him. And now you&amp;#39;ve fought for him. You are protecting him. It sounds like you are doing everything for him you know how. Which is all that can be expected of any of us. &lt;/p&gt;\n\n&lt;p&gt;Bad things happen in the world. Bad things happen to good people and to sweet little toddler people. It&amp;#39;s awful. But you would never do that. You aren&amp;#39;t bad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3tdj5", "score_hidden": false, "stickied": false, "created": 1491911438.0, "created_utc": 1491882638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 59}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg48pys", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg3u85m", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm so sorry that happened to you. What a terrible thing to go through. I am also the victim of sibling abuse and it has been a long road in recovering from that. I hope that you are getting help and support to help yourself heal.  \n  \nHe is in therapy through a local chid abuse program, and it has made all the difference. He feels more secure now and even our home life is better and more stable. He has a lot of behavioral issues that pop up whenever he gets upset about his dad, and I now know how to manage them in a gentle and effective way. He's finally becoming (slowly) comfortable with talking about what happened.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry that happened to you. What a terrible thing to go through. I am also the victim of sibling abuse and it has been a long road in recovering from that. I hope that you are getting help and support to help yourself heal.  &lt;/p&gt;\n\n&lt;p&gt;He is in therapy through a local chid abuse program, and it has made all the difference. He feels more secure now and even our home life is better and more stable. He has a lot of behavioral issues that pop up whenever he gets upset about his dad, and I now know how to manage them in a gentle and effective way. He&amp;#39;s finally becoming (slowly) comfortable with talking about what happened.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48pys", "score_hidden": false, "stickied": false, "created": 1491945892.0, "created_utc": 1491917092.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3u85m", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "Kitten_Esque", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I may not be a parent, but as a child I was abused by my brother. I'm 25 now, and only told my family years after the fact because he stopped his meds and therapy and was arrested for assaulting his ex girlfriend about a year ago. Now, my aunt had suspected something was wrong because she fostered many broken children and saw the same behavior in me, but never spoke out or asked me about it, so it got dropped. She heavily regrets not following her gut, but you've got a chance to help your son with therapy at a VERY young age, and I say you should get into a program ASAP. If he ever asks about it in later life, sit down with him and have an open conversation that the nightmares did occur, but that it wasn't his fault, and that you helped as best as you could after the abuse happened. Don't beat yourself up over what happened, just be sure to be supportive of your son, and assure him that you acted as quickly as possible to keep him safe. Thank you for sharing your story.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I may not be a parent, but as a child I was abused by my brother. I&amp;#39;m 25 now, and only told my family years after the fact because he stopped his meds and therapy and was arrested for assaulting his ex girlfriend about a year ago. Now, my aunt had suspected something was wrong because she fostered many broken children and saw the same behavior in me, but never spoke out or asked me about it, so it got dropped. She heavily regrets not following her gut, but you&amp;#39;ve got a chance to help your son with therapy at a VERY young age, and I say you should get into a program ASAP. If he ever asks about it in later life, sit down with him and have an open conversation that the nightmares did occur, but that it wasn&amp;#39;t his fault, and that you helped as best as you could after the abuse happened. Don&amp;#39;t beat yourself up over what happened, just be sure to be supportive of your son, and assure him that you acted as quickly as possible to keep him safe. Thank you for sharing your story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3u85m", "score_hidden": false, "stickied": false, "created": 1491912785.0, "created_utc": 1491883985.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4g2ij", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "chickpea_fille", "parent_id": "t1_dg3wdfy", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It may sound nitpicky, but talking about body safety in terms of \"safe\" and \"unsafe\" touch is a better approach, especially for kids who have been abused. \"Good\" vs \"bad\" have moralistic and shame-laden undertones. It can also be confusing for kids because physiological responses can feel \"good\" even if a touch is unwanted. There are a lot of resources about safe and unsafe touch, and any trauma focused therapy has a built-in body safety component.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It may sound nitpicky, but talking about body safety in terms of &amp;quot;safe&amp;quot; and &amp;quot;unsafe&amp;quot; touch is a better approach, especially for kids who have been abused. &amp;quot;Good&amp;quot; vs &amp;quot;bad&amp;quot; have moralistic and shame-laden undertones. It can also be confusing for kids because physiological responses can feel &amp;quot;good&amp;quot; even if a touch is unwanted. There are a lot of resources about safe and unsafe touch, and any trauma focused therapy has a built-in body safety component.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4g2ij", "score_hidden": false, "stickied": false, "created": 1491954717.0, "created_utc": 1491925917.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg43lwb", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "hokoonchi", "parent_id": "t1_dg3wdfy", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The \"It's So Amazing\" and \"You're So Amazing\" books are fantastic. Good for discussing body parts. Your kid's kindergarten should also do some teaching about it, but we started with the books when he was four or so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The &amp;quot;It&amp;#39;s So Amazing&amp;quot; and &amp;quot;You&amp;#39;re So Amazing&amp;quot; books are fantastic. Good for discussing body parts. Your kid&amp;#39;s kindergarten should also do some teaching about it, but we started with the books when he was four or so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg43lwb", "score_hidden": false, "stickied": false, "created": 1491936036.0, "created_utc": 1491907236.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4b32k", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "octobertwins", "parent_id": "t1_dg3wdfy", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My parent group had a guy give a speech to our group. He was a cop that had 30+ years in child abuse cases. \n\nHe suggested putting your child in a swimsuit and explain that areas under the suit are off limits to everyone - friends, grandparents, etc. \n\nHe also said to always use anatomical names. Words like penis and vagina should be used openly. He said many kids lack the vocabulary to even speak about abuse - like, they had no idea how to even say their penis was touched! \n\nSorry I don't have a good resource. Just a few things I remember from the speaker. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My parent group had a guy give a speech to our group. He was a cop that had 30+ years in child abuse cases. &lt;/p&gt;\n\n&lt;p&gt;He suggested putting your child in a swimsuit and explain that areas under the suit are off limits to everyone - friends, grandparents, etc. &lt;/p&gt;\n\n&lt;p&gt;He also said to always use anatomical names. Words like penis and vagina should be used openly. He said many kids lack the vocabulary to even speak about abuse - like, they had no idea how to even say their penis was touched! &lt;/p&gt;\n\n&lt;p&gt;Sorry I don&amp;#39;t have a good resource. Just a few things I remember from the speaker. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4b32k", "score_hidden": false, "stickied": false, "created": 1491949012.0, "created_utc": 1491920212.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4e0ru", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Ebaudendi", "parent_id": "t1_dg3wdfy", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The books \"My Body Belongs To Me\" and \"My Body Is Private\" are good ones! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The books &amp;quot;My Body Belongs To Me&amp;quot; and &amp;quot;My Body Is Private&amp;quot; are good ones! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4e0ru", "score_hidden": false, "stickied": false, "created": 1491952444.0, "created_utc": 1491923644.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg3z56o", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "amityville", "parent_id": "t1_dg3wdfy", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I would like this too. I'm in work but a quick google revealed nothing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would like this too. I&amp;#39;m in work but a quick google revealed nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3z56o", "score_hidden": false, "stickied": false, "created": 1491922713.0, "created_utc": 1491893913.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3wdfy", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "smaches", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Does anyone know of any good resources to help you explain good touch/bad touch to a child? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does anyone know of any good resources to help you explain good touch/bad touch to a child? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3wdfy", "score_hidden": false, "stickied": false, "created": 1491916513.0, "created_utc": 1491887713.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg3tpla", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Enovara", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "To add to this- my thought is that if nobody else will believe my child, it is my job to do so.  It is my job to protect her and if I even get the slightest feeling that something is wrong, I investigate further.\n\nMy biggest story regarding this:\nA few months ago, my 2-year-old told me \"Grandma smack-y face.\"  Now, she sees these grandparents every week, and I know they adore her, so this surprised me.  Just in case, I asked them about it, telling them what my daughter told me and asking if maybe Grandma got overwhelmed one day or something.  It turned out to be a false alarm, but they were still glad I asked, and I was too.  I'd rather wrongly accuse someone of hurting my child than risk her actually being hurt and not believing her.\n\nOP, as a victim of abuse myself, I can only imagine how horrifying it was to find out that not only were you a victim, but your son was too.  When it finally clicked that things were NOT supposed to be this way, it was terrifying, everything I thought I knew was wrong.  I'm glad you're making your way out of it.  It's one of the hardest things to do, and I applaud you for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add to this- my thought is that if nobody else will believe my child, it is my job to do so.  It is my job to protect her and if I even get the slightest feeling that something is wrong, I investigate further.&lt;/p&gt;\n\n&lt;p&gt;My biggest story regarding this:\nA few months ago, my 2-year-old told me &amp;quot;Grandma smack-y face.&amp;quot;  Now, she sees these grandparents every week, and I know they adore her, so this surprised me.  Just in case, I asked them about it, telling them what my daughter told me and asking if maybe Grandma got overwhelmed one day or something.  It turned out to be a false alarm, but they were still glad I asked, and I was too.  I&amp;#39;d rather wrongly accuse someone of hurting my child than risk her actually being hurt and not believing her.&lt;/p&gt;\n\n&lt;p&gt;OP, as a victim of abuse myself, I can only imagine how horrifying it was to find out that not only were you a victim, but your son was too.  When it finally clicked that things were NOT supposed to be this way, it was terrifying, everything I thought I knew was wrong.  I&amp;#39;m glad you&amp;#39;re making your way out of it.  It&amp;#39;s one of the hardest things to do, and I applaud you for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3tpla", "score_hidden": false, "stickied": false, "created": 1491911958.0, "created_utc": 1491883158.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg48ave", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg44583", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank-you for the suggestion. I will definitely check it out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank-you for the suggestion. I will definitely check it out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48ave", "score_hidden": false, "stickied": false, "created": 1491945290.0, "created_utc": 1491916490.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4qekh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "peacewithcylons", "parent_id": "t1_dg44583", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "He wrote another, Protecting the Gift, that specifically talks about protecting your children from violence and abuse. Many of the same themes as The Gift of Fear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He wrote another, Protecting the Gift, that specifically talks about protecting your children from violence and abuse. Many of the same themes as The Gift of Fear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4qekh", "score_hidden": false, "stickied": false, "created": 1491965985.0, "created_utc": 1491937185.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44583", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "haventbeenthereyet", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Shout out to the book, The Gift of Fear, by Gavin deBecker. It teaches how to listen to your gut. \n\nNot just for OP, but for all parents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shout out to the book, The Gift of Fear, by Gavin deBecker. It teaches how to listen to your gut. &lt;/p&gt;\n\n&lt;p&gt;Not just for OP, but for all parents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg44583", "score_hidden": false, "stickied": false, "created": 1491937447.0, "created_utc": 1491908647.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg3tbet", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "The-Scarlet-Witch", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Please give yourself a bit of forgiveness. You could not know. The cruelest truth -- hindsight is 20/20 -- makes it so easy to judge your actions harshly, when you were ignorant of what was happening. And who could imagine their child's own father would abuse him? It is easy to miss signs. It is easy to misread signs.\n\nPlease make sure that you and your son receive counseling, if you haven't already. Take as much as you need and as long as you need to find a good space to cope.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please give yourself a bit of forgiveness. You could not know. The cruelest truth -- hindsight is 20/20 -- makes it so easy to judge your actions harshly, when you were ignorant of what was happening. And who could imagine their child&amp;#39;s own father would abuse him? It is easy to miss signs. It is easy to misread signs.&lt;/p&gt;\n\n&lt;p&gt;Please make sure that you and your son receive counseling, if you haven&amp;#39;t already. Take as much as you need and as long as you need to find a good space to cope.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3tbet", "score_hidden": false, "stickied": false, "created": 1491911350.0, "created_utc": 1491882550.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4ahn5", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "octobertwins", "parent_id": "t1_dg3vkdq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I watched an episode of Oprah years ago where the mom shot the man (in the courtroom!) that sexually abused her son. \n\nShe went to jail. The kids turned out really bad. The son is now in prison for stomping a man to death. \n\nThey all agreed that it was a horrible decision that destroyed all of them.  The story has always stuck with me for some reason. Her name was Ellie Nesler, if you wanna check out the story. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I watched an episode of Oprah years ago where the mom shot the man (in the courtroom!) that sexually abused her son. &lt;/p&gt;\n\n&lt;p&gt;She went to jail. The kids turned out really bad. The son is now in prison for stomping a man to death. &lt;/p&gt;\n\n&lt;p&gt;They all agreed that it was a horrible decision that destroyed all of them.  The story has always stuck with me for some reason. Her name was Ellie Nesler, if you wanna check out the story. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ahn5", "score_hidden": false, "stickied": false, "created": 1491948253.0, "created_utc": 1491919453.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg48kuz", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg3vkdq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank-you. My son and I are so blessed to have a solid support system around us keeping us secure. CPS is overworked and undermanned, but the local children's hospital has a phenomenal child abuse program that has helped us so much. I fully believe that we will come out of this ok, but it's a tough journey in the meantime.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank-you. My son and I are so blessed to have a solid support system around us keeping us secure. CPS is overworked and undermanned, but the local children&amp;#39;s hospital has a phenomenal child abuse program that has helped us so much. I fully believe that we will come out of this ok, but it&amp;#39;s a tough journey in the meantime.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48kuz", "score_hidden": false, "stickied": false, "created": 1491945689.0, "created_utc": 1491916889.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3vkdq", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "magicgash", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Hey its none of my business but I had to comment- I am a single dad to my 2 year old son and if any of the hurt you have described was to happen to him I wouldn't know what to do with myself. Congratulations for not killing your ex and ending up in jail cuz thats what I would have done in all seriousness.. Makes me sad to think shit like this actually happens around the world.. I know its not much but I sincerely wish you the best with the long journey ahead of you.. obviously you care for your son a lot and i pray one day you and him can both be happy despite the horrors of what has happened.. as I said- none of my business but objectively I can tell you love your son and you're doing the best you can.. from the bottom of my heart i hope things work out for you and your son.. take care", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey its none of my business but I had to comment- I am a single dad to my 2 year old son and if any of the hurt you have described was to happen to him I wouldn&amp;#39;t know what to do with myself. Congratulations for not killing your ex and ending up in jail cuz thats what I would have done in all seriousness.. Makes me sad to think shit like this actually happens around the world.. I know its not much but I sincerely wish you the best with the long journey ahead of you.. obviously you care for your son a lot and i pray one day you and him can both be happy despite the horrors of what has happened.. as I said- none of my business but objectively I can tell you love your son and you&amp;#39;re doing the best you can.. from the bottom of my heart i hope things work out for you and your son.. take care&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3vkdq", "score_hidden": false, "stickied": false, "created": 1491915036.0, "created_utc": 1491886236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg3tme3", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "MzFitz", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for this. I know it probably wasn't easy to write. \n\nMy son is seven and his dad walked out when I was pregnant. He's been consistently visiting for about three years. I also taught him about good and bad touches as well as the difference between a secret and a surprise. I sometimes feel paranoid, but my goal is to help him know what is right and be confident to tell me when he feels like something is wrong. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. I know it probably wasn&amp;#39;t easy to write. &lt;/p&gt;\n\n&lt;p&gt;My son is seven and his dad walked out when I was pregnant. He&amp;#39;s been consistently visiting for about three years. I also taught him about good and bad touches as well as the difference between a secret and a surprise. I sometimes feel paranoid, but my goal is to help him know what is right and be confident to tell me when he feels like something is wrong. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3tme3", "score_hidden": false, "stickied": false, "created": 1491911821.0, "created_utc": 1491883021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4uory", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg4g5ls", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm so sorry this happened. Like I said, CPS is a joke. It's not their fault really, they are so restricted and undermanned. I hope that someone else eventually came forward, maybe a teacher since teachers are mandated reporters. Kids are products of their environments, and it's so sad to see a \"bad\" kid develop from a bad environment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry this happened. Like I said, CPS is a joke. It&amp;#39;s not their fault really, they are so restricted and undermanned. I hope that someone else eventually came forward, maybe a teacher since teachers are mandated reporters. Kids are products of their environments, and it&amp;#39;s so sad to see a &amp;quot;bad&amp;quot; kid develop from a bad environment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4uory", "score_hidden": false, "stickied": false, "created": 1491970620.0, "created_utc": 1491941820.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4g5ls", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "parentanon", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for being your child's advocate.\n\nWhen my daughter was barely 4, a 6 year old child acted out on her. Because we had been very clear about body part names and boundaries, she knew it was inappropriate and was able to tell us exactly what happened.  \nMountains of red flags were revealed about the 6YO and two other children after that and every single adult in a position to help those kids turned a blind eye, deciding that they had probably seen the behavior through media and were just trying to emulate it without knowing it was wrong, even though that directly contradicted many of the things those kids said and the behaviors that were present.  \nI later contacted an official and a report to CPS was made, but I was told most likely nothing would come of it because my information was too \"third-party\".   \nPeople willfully ignore or discount the signs of child abuse all the time because it's not a pleasant reality to think about. Every time I see a personal story shared to raise awareness or read about somebody who trusted their instincts and paid attention, I'm ridiculously proud of them. I'm proud of YOU.   \n\nI know somebody already recommended Gavin de Becker's The Gift of Fear, but I'd also like to recommend his book Protecting the Gift. It's the one he wrote for parents and is an amazing resource that specifically addresses child abuse prevention.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for being your child&amp;#39;s advocate.&lt;/p&gt;\n\n&lt;p&gt;When my daughter was barely 4, a 6 year old child acted out on her. Because we had been very clear about body part names and boundaries, she knew it was inappropriate and was able to tell us exactly what happened.&lt;br/&gt;\nMountains of red flags were revealed about the 6YO and two other children after that and every single adult in a position to help those kids turned a blind eye, deciding that they had probably seen the behavior through media and were just trying to emulate it without knowing it was wrong, even though that directly contradicted many of the things those kids said and the behaviors that were present.&lt;br/&gt;\nI later contacted an official and a report to CPS was made, but I was told most likely nothing would come of it because my information was too &amp;quot;third-party&amp;quot;.&lt;br/&gt;\nPeople willfully ignore or discount the signs of child abuse all the time because it&amp;#39;s not a pleasant reality to think about. Every time I see a personal story shared to raise awareness or read about somebody who trusted their instincts and paid attention, I&amp;#39;m ridiculously proud of them. I&amp;#39;m proud of YOU.   &lt;/p&gt;\n\n&lt;p&gt;I know somebody already recommended Gavin de Becker&amp;#39;s The Gift of Fear, but I&amp;#39;d also like to recommend his book Protecting the Gift. It&amp;#39;s the one he wrote for parents and is an amazing resource that specifically addresses child abuse prevention.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4g5ls", "score_hidden": false, "stickied": false, "created": 1491954810.0, "created_utc": 1491926010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg48zhk", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg3p6u4", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Like I said in another post, I didn't add more details because the purpose of this post is to warn other parents, not to write a novel about what's going on in our lives. I also need to remain vague for security and privacy.  \n  \nMy son has not seen his dad for over half a year and there are protective measures in place. He is in therapy specifically geared toward abuse victims and it has been wonderful. CPS dicked around with our case for several months before finally opening up the case, only because I had made a police report. Legal action is being taken, it's just a long and slow road.  \n  \nEven if his dad was legally allowed to see him, I wouldn't allow that to happen. They could arrest me for all I care. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like I said in another post, I didn&amp;#39;t add more details because the purpose of this post is to warn other parents, not to write a novel about what&amp;#39;s going on in our lives. I also need to remain vague for security and privacy.  &lt;/p&gt;\n\n&lt;p&gt;My son has not seen his dad for over half a year and there are protective measures in place. He is in therapy specifically geared toward abuse victims and it has been wonderful. CPS dicked around with our case for several months before finally opening up the case, only because I had made a police report. Legal action is being taken, it&amp;#39;s just a long and slow road.  &lt;/p&gt;\n\n&lt;p&gt;Even if his dad was legally allowed to see him, I wouldn&amp;#39;t allow that to happen. They could arrest me for all I care. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48zhk", "score_hidden": false, "stickied": false, "created": 1491946258.0, "created_utc": 1491917458.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3p6u4", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "haberstachery", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "What is the current custody status? Where's dad? Have charges been filed?  Does child still see dad and have parenting time with him?  Is the child reporting this to a doctor or psychologist? Or to you?  Why is CPS a joke?\n\nEdit - I appreciate your story and am just wanting to make sure it is not a \"mom's beware of father's in divorce situations\".  We've worked hard to get 50/50 shared parenting and in my case it has made for wonderful children considering the circumstances.  Looks like you've gotten great responses here for support of your child which is number 1.  The system is flawed.  What would be helpful is to hear the about the timeline of how you got from point A to point B.  Where things failed - what you did to overcome the hurdles.  Are charges filed? Is there a court hearing?  Trusting our guts is important.  But understanding the process is also important so parents know how to respond if they suspect this is happening to them.\n\n", "edited": 1491918482.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What is the current custody status? Where&amp;#39;s dad? Have charges been filed?  Does child still see dad and have parenting time with him?  Is the child reporting this to a doctor or psychologist? Or to you?  Why is CPS a joke?&lt;/p&gt;\n\n&lt;p&gt;Edit - I appreciate your story and am just wanting to make sure it is not a &amp;quot;mom&amp;#39;s beware of father&amp;#39;s in divorce situations&amp;quot;.  We&amp;#39;ve worked hard to get 50/50 shared parenting and in my case it has made for wonderful children considering the circumstances.  Looks like you&amp;#39;ve gotten great responses here for support of your child which is number 1.  The system is flawed.  What would be helpful is to hear the about the timeline of how you got from point A to point B.  Where things failed - what you did to overcome the hurdles.  Are charges filed? Is there a court hearing?  Trusting our guts is important.  But understanding the process is also important so parents know how to respond if they suspect this is happening to them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3p6u4", "score_hidden": false, "stickied": false, "created": 1491905882.0, "created_utc": 1491877082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg48tcx", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Redheadstarchild", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for writing this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for writing this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48tcx", "score_hidden": false, "stickied": false, "created": 1491946023.0, "created_utc": 1491917223.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4ule5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg4hpb9", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Hopefully. The justice system is slow and extremely careful. Regardless of what happens, I will fight tooth and nail to keep my son safe.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hopefully. The justice system is slow and extremely careful. Regardless of what happens, I will fight tooth and nail to keep my son safe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ule5", "score_hidden": false, "stickied": false, "created": 1491970514.0, "created_utc": 1491941714.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hpb9", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "weregildgrimes", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Please tell me your ex is going to do jail time and be registered as a sex offender for the rest of his life.  I'm so sorry you both went through that. Just reading that filled with me with rage (towards your ex husband). I don't know what I would do in a situation like that. I mean, controlling my rage would be difficult if someone harmed my son.  You did, and are doing, the right thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please tell me your ex is going to do jail time and be registered as a sex offender for the rest of his life.  I&amp;#39;m so sorry you both went through that. Just reading that filled with me with rage (towards your ex husband). I don&amp;#39;t know what I would do in a situation like that. I mean, controlling my rage would be difficult if someone harmed my son.  You did, and are doing, the right thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4hpb9", "score_hidden": false, "stickied": false, "created": 1491956505.0, "created_utc": 1491927705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4gg27", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "w4etched", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Hugs to you, OP. I'm so sorry this happened to your son, and to you as well. I hope you're also in therapy, or that you at least have a strong support system in place to help get you through such an awful time. \n\nI'm a single parent to my 12-year old son, and I have also struggled not to beat myself up at times for mistakes I've made as a parent. One of the best things I ever realized (through therapy and support) is that as soon as I recognize that I've made a mistake, I take steps to rectify it immediately. Which is exactly what you are doing. Your son knows his mum is and always will be in his corner. I commend you for your strength and for fighting tooth and nail to protect your child. \n\nSending thoughts and healing vibes your way&lt;3\n\nP.S. Fuck that guy. ", "edited": 1491929569.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hugs to you, OP. I&amp;#39;m so sorry this happened to your son, and to you as well. I hope you&amp;#39;re also in therapy, or that you at least have a strong support system in place to help get you through such an awful time. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a single parent to my 12-year old son, and I have also struggled not to beat myself up at times for mistakes I&amp;#39;ve made as a parent. One of the best things I ever realized (through therapy and support) is that as soon as I recognize that I&amp;#39;ve made a mistake, I take steps to rectify it immediately. Which is exactly what you are doing. Your son knows his mum is and always will be in his corner. I commend you for your strength and for fighting tooth and nail to protect your child. &lt;/p&gt;\n\n&lt;p&gt;Sending thoughts and healing vibes your way&amp;lt;3&lt;/p&gt;\n\n&lt;p&gt;P.S. Fuck that guy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4gg27", "score_hidden": false, "stickied": false, "created": 1491955125.0, "created_utc": 1491926325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg3uhb7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Mjayybb", "parent_id": "t1_dg3ucim", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for not being mean ❤ one of my son's is three turning four very soon and the story hit me in a strange way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for not being mean ❤ one of my son&amp;#39;s is three turning four very soon and the story hit me in a strange way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3uhb7", "score_hidden": false, "stickied": false, "created": 1491913200.0, "created_utc": 1491884400.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3ucim", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "TheHatOnTheCat", "parent_id": "t1_dg3tul8", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you.\n\nAnd I know that wasn't your intent which is why I said that. We all say the wrong thing sometimes. I don't want you to feel like you have to be quiet. Just give it a little more thought is all. &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you.&lt;/p&gt;\n\n&lt;p&gt;And I know that wasn&amp;#39;t your intent which is why I said that. We all say the wrong thing sometimes. I don&amp;#39;t want you to feel like you have to be quiet. Just give it a little more thought is all. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3ucim", "score_hidden": false, "stickied": false, "created": 1491912982.0, "created_utc": 1491884182.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3tul8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Mjayybb", "parent_id": "t1_dg3t3vq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It wasn't. No seriously the intent behind it wasn't bad, I just worded it really badly. I do that often. Next time I will just be quiet. I apologize and the comment is gone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It wasn&amp;#39;t. No seriously the intent behind it wasn&amp;#39;t bad, I just worded it really badly. I do that often. Next time I will just be quiet. I apologize and the comment is gone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3tul8", "score_hidden": false, "stickied": false, "created": 1491912176.0, "created_utc": 1491883376.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3t3vq", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "TheHatOnTheCat", "parent_id": "t1_dg3qcm3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I would seriously consider deleting your above comment. \n\nStop and consider if what you are saying to OP is helpful. OP says \"in hindsight, I feel a profound amount of guilt for not recognizing the signs of abuse\". She already knows this and she already feels awful. Also, she can't go back in time. Advice for the past is not constructive here. \n\nIf you have to start your statement with \"I'm not blaming you but\" it's probably because what you are saying sounds like you are blaming them. It's a lot like \"I'm not racist but\" or \"I'm not sexist but\". There is almost never a good not that thing end to the sentence.  \n\nIt's hard for me to imagine your goal is to cause this mother more pain. Please rethink. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would seriously consider deleting your above comment. &lt;/p&gt;\n\n&lt;p&gt;Stop and consider if what you are saying to OP is helpful. OP says &amp;quot;in hindsight, I feel a profound amount of guilt for not recognizing the signs of abuse&amp;quot;. She already knows this and she already feels awful. Also, she can&amp;#39;t go back in time. Advice for the past is not constructive here. &lt;/p&gt;\n\n&lt;p&gt;If you have to start your statement with &amp;quot;I&amp;#39;m not blaming you but&amp;quot; it&amp;#39;s probably because what you are saying sounds like you are blaming them. It&amp;#39;s a lot like &amp;quot;I&amp;#39;m not racist but&amp;quot; or &amp;quot;I&amp;#39;m not sexist but&amp;quot;. There is almost never a good not that thing end to the sentence.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s hard for me to imagine your goal is to cause this mother more pain. Please rethink. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3t3vq", "score_hidden": false, "stickied": false, "created": 1491911032.0, "created_utc": 1491882232.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg3see4", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "letmebeJo", "parent_id": "t1_dg3qcm3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm sure that she has thought on those things more than you can imagine and you saying something like -\n\n&gt;That should have been enough for you to know...\n\nis such a horrid thing for you to say. Hindsight's 20/20.\n\nI am so sorry that this happened to your boy. Get him and yourself into therapy. It is only your ex's fault. It is **only** his fault.", "edited": 1491881464.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure that she has thought on those things more than you can imagine and you saying something like -&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That should have been enough for you to know...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;is such a horrid thing for you to say. Hindsight&amp;#39;s 20/20.&lt;/p&gt;\n\n&lt;p&gt;I am so sorry that this happened to your boy. Get him and yourself into therapy. It is only your ex&amp;#39;s fault. It is &lt;strong&gt;only&lt;/strong&gt; his fault.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3see4", "score_hidden": false, "stickied": false, "created": 1491910010.0, "created_utc": 1491881210.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg3tgpa", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "The-Scarlet-Witch", "parent_id": "t1_dg3qcm3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Why would you tell someone that? It is fully possible now for OP to see the pattern. But when dealing with a 3 year old in a traumatic situation (post-divorce), it's reasonable to assume that acting out is normal. Furthermore, any number of factors, including disrupting a preschooler's routine or the child picking up on trouble between Mom and Dad, can lead to severe acting out. It's not the OP's fault for failing to see signals she had no reason to believe would be there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would you tell someone that? It is fully possible now for OP to see the pattern. But when dealing with a 3 year old in a traumatic situation (post-divorce), it&amp;#39;s reasonable to assume that acting out is normal. Furthermore, any number of factors, including disrupting a preschooler&amp;#39;s routine or the child picking up on trouble between Mom and Dad, can lead to severe acting out. It&amp;#39;s not the OP&amp;#39;s fault for failing to see signals she had no reason to believe would be there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3tgpa", "score_hidden": false, "stickied": false, "created": 1491911572.0, "created_utc": 1491882772.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3qcm3", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3qcm3", "score_hidden": false, "stickied": false, "created": 1491907292.0, "created_utc": 1491878492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg5xcn9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tercerero", "parent_id": "t1_dg5x9ob", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "So true, but that does not mean you are immune from consequences of your expressions.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So true, but that does not mean you are immune from consequences of your expressions.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5xcn9", "score_hidden": false, "stickied": false, "created": 1492035860.0, "created_utc": 1492007060.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x9ob", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5rm99", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5x9ob", "score_hidden": false, "stickied": false, "created": 1492035763.0, "created_utc": 1492006963.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5rm99", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tercerero", "parent_id": "t1_dg4p7jb", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Do not leave such comments.  If you have concerns, message the moderators.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do not leave such comments.  If you have concerns, message the moderators.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5rm99", "score_hidden": false, "stickied": false, "created": 1492027279.0, "created_utc": 1491998479.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4p7jb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4p7jb", "score_hidden": false, "stickied": false, "created": 1491964724.0, "created_utc": 1491935924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg48hpt", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg41wlv", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "He is in therapy. Honestly, therapy has been the absolute best thing for us, especially because he's in therapy specifically for trauma victims. It has been monumental in his healing, and his ability to overcome his fears of sharing what happened. Eventually he found himself able to talk to his therapist, and that is huge in a case like this because the therapist is a mandated reporter and can testify in court.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is in therapy. Honestly, therapy has been the absolute best thing for us, especially because he&amp;#39;s in therapy specifically for trauma victims. It has been monumental in his healing, and his ability to overcome his fears of sharing what happened. Eventually he found himself able to talk to his therapist, and that is huge in a case like this because the therapist is a mandated reporter and can testify in court.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48hpt", "score_hidden": false, "stickied": false, "created": 1491945565.0, "created_utc": 1491916765.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg41wlv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cs24601", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I agree with everyone saying to get your son in therapy, but I would like to add that counseling would be good for you too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with everyone saying to get your son in therapy, but I would like to add that counseling would be good for you too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg41wlv", "score_hidden": false, "stickied": false, "created": 1491930821.0, "created_utc": 1491902021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4w7ed", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jmw74", "parent_id": "t1_dg4ubgb", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; The judicial system makes it extremely difficult to get a conviction in these cases\n\nYes, I know, and I'm sorry that the system may not arrive at the correct answer in your case, I really am.\n\nI just didn't want to gloss over the fact that the reason the judicial system often gets these cases wrong is not because they're corrupt, it's because there's insufficient evidence.\n\nYou should take your own advice - protect your kid. You may end up in the unfortunate position of having to choose between obeying the law and protecting your child. I hope you know what to do if it comes to that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The judicial system makes it extremely difficult to get a conviction in these cases&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, I know, and I&amp;#39;m sorry that the system may not arrive at the correct answer in your case, I really am.&lt;/p&gt;\n\n&lt;p&gt;I just didn&amp;#39;t want to gloss over the fact that the reason the judicial system often gets these cases wrong is not because they&amp;#39;re corrupt, it&amp;#39;s because there&amp;#39;s insufficient evidence.&lt;/p&gt;\n\n&lt;p&gt;You should take your own advice - protect your kid. You may end up in the unfortunate position of having to choose between obeying the law and protecting your child. I hope you know what to do if it comes to that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4w7ed", "score_hidden": false, "stickied": false, "created": 1491972315.0, "created_utc": 1491943515.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ubgb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg4i2mi", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Again, really not the point of this post. I don't need to be policed by internet strangers about the validity of this very serious claim.  \n  \nThe judicial system makes it extremely difficult to get a conviction in these cases, especially with a child so young. There is still a possibility they will throw my case out because of his young age in spite of hard evidence. Frustrating isn't the word for it. It's *terrifying* for me because my job is to keep my son safe and the justice system makes that so hard. So please, keep your opinion to yourself and keep an eye on your kids.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Again, really not the point of this post. I don&amp;#39;t need to be policed by internet strangers about the validity of this very serious claim.  &lt;/p&gt;\n\n&lt;p&gt;The judicial system makes it extremely difficult to get a conviction in these cases, especially with a child so young. There is still a possibility they will throw my case out because of his young age in spite of hard evidence. Frustrating isn&amp;#39;t the word for it. It&amp;#39;s &lt;em&gt;terrifying&lt;/em&gt; for me because my job is to keep my son safe and the justice system makes that so hard. So please, keep your opinion to yourself and keep an eye on your kids.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ubgb", "score_hidden": false, "stickied": false, "created": 1491970208.0, "created_utc": 1491941408.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4i2mi", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4i2mi", "score_hidden": false, "stickied": false, "created": 1491956903.0, "created_utc": 1491928103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4lbm9", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Moeder_Coyote", "parent_id": "t1_dg4ithu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Are you . . . serious?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you . . . serious?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4lbm9", "score_hidden": false, "stickied": false, "created": 1491960460.0, "created_utc": 1491931660.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg563on", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "letmebeJo", "parent_id": "t1_dg4uejk", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It's hard for me to understand just how someone can live now with access to information and stay *that* naive.\n\nIt's one of the reasons that 'stranger danger' was/is such a dangerous thing to teach kids. Abusers are almost always someone that you know. \n\nThank you for sharing your story. It cannot have been easy and I think that you are brave for looking past that to help others. Good luck to you and your son, it sounds like he has a pretty great mom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s hard for me to understand just how someone can live now with access to information and stay &lt;em&gt;that&lt;/em&gt; naive.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s one of the reasons that &amp;#39;stranger danger&amp;#39; was/is such a dangerous thing to teach kids. Abusers are almost always someone that you know. &lt;/p&gt;\n\n&lt;p&gt;Thank you for sharing your story. It cannot have been easy and I think that you are brave for looking past that to help others. Good luck to you and your son, it sounds like he has a pretty great mom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg563on", "score_hidden": false, "stickied": false, "created": 1491984889.0, "created_utc": 1491956089.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4uejk", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg4ithu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That's what the entire post was about. But the purpose of the point was to educate and warn parents.  \n  \nAnyone can be an abuser. Often, it's the last person you'd expect. They can be very nice, charming even. They often are, and the victim feels guilty and conflicted about coming forward, not just because of possible threats, but because they care about their abuser. My son still loves his dad, in spite of being terrified of him.  \n  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what the entire post was about. But the purpose of the point was to educate and warn parents.  &lt;/p&gt;\n\n&lt;p&gt;Anyone can be an abuser. Often, it&amp;#39;s the last person you&amp;#39;d expect. They can be very nice, charming even. They often are, and the victim feels guilty and conflicted about coming forward, not just because of possible threats, but because they care about their abuser. My son still loves his dad, in spite of being terrified of him.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4uejk", "score_hidden": false, "stickied": false, "created": 1491970302.0, "created_utc": 1491941502.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64nvc5", "likes": null, "replies": "", "user_reports": [], "id": "dg4p1ge", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4ithu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4p1ge", "score_hidden": false, "stickied": false, "created": 1491964539.0, "created_utc": 1491935739.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ithu", "gilded": 0, "archived": false, "score": -20, "report_reasons": null, "author": "EuropeanLady", "parent_id": "t1_dg48eqa", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Oh my. And everything is confirmed? I don't understand why his father would do anything like that to him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my. And everything is confirmed? I don&amp;#39;t understand why his father would do anything like that to him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ithu", "score_hidden": false, "stickied": false, "created": 1491957732.0, "created_utc": 1491928932.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48eqa", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "parentthrowaway1456", "parent_id": "t1_dg3x25m", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "He is. Absolutely. The fear that he is portraying, and the specificity of the events is very clear. His stories remain consistent. I realize that I didn't go into detail in this post, and that's for the sake of privacy, but there is no doubt that these things happened. It's only through several months of therapy that he began slowly sharing, and the events he's sharing are not vague.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is. Absolutely. The fear that he is portraying, and the specificity of the events is very clear. His stories remain consistent. I realize that I didn&amp;#39;t go into detail in this post, and that&amp;#39;s for the sake of privacy, but there is no doubt that these things happened. It&amp;#39;s only through several months of therapy that he began slowly sharing, and the events he&amp;#39;s sharing are not vague.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg48eqa", "score_hidden": false, "stickied": false, "created": 1491945447.0, "created_utc": 1491916647.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3x25m", "gilded": 0, "archived": false, "score": -29, "report_reasons": null, "author": "EuropeanLady", "parent_id": "t3_64nvc5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Are you sure that your young child is relaying the events exactly as they happened? \n\nI'm not saying they didn't happen but young children have very vivid imaginations, and they like to please, consequently, they may make up wild stories which they think their parent (or another respected adult) wants to hear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you sure that your young child is relaying the events exactly as they happened? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying they didn&amp;#39;t happen but young children have very vivid imaginations, and they like to please, consequently, they may make up wild stories which they think their parent (or another respected adult) wants to hear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg3x25m", "score_hidden": false, "stickied": false, "created": 1491917870.0, "created_utc": 1491889070.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -29}}], "after": null, "before": null}}]