[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;New parents to a 5 month old. My MIL makes comments to the baby in a teasing/joking manner about my husband, for example &amp;quot;I&amp;#39;m sorry, I did everything I could, he&amp;#39;s your problem now&amp;quot;. My SIL does the same thing. This has happened twice now (one time by each of them) and I want to tell them to stop but not start a war between us. I&amp;#39;m a straight forward person (I call it as I see it) and this isn&amp;#39;t always the best tactic. &lt;/p&gt;\n\n&lt;p&gt;My husband says he doesn&amp;#39;t take offence to the comments, but I do. More importantly, I don&amp;#39;t want my child being raised to think that sarcastic comments are how we show love. It&amp;#39;s undermining and disrespectful. I realize the baby doesn&amp;#39;t understand the comments, but I&amp;#39;m hoping to stop a habit before she gets to an age where she does understand (kids take comments literally). Any advice as to how I can get this to stop? Should I address this, or is this an area my husband should manage because it&amp;#39;s his Mother and sister doing it? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "New parents to a 5 month old. My MIL makes comments to the baby in a teasing/joking manner about my husband, for example \"I'm sorry, I did everything I could, he's your problem now\". My SIL does the same thing. This has happened twice now (one time by each of them) and I want to tell them to stop but not start a war between us. I'm a straight forward person (I call it as I see it) and this isn't always the best tactic. \n\nMy husband says he doesn't take offence to the comments, but I do. More importantly, I don't want my child being raised to think that sarcastic comments are how we show love. It's undermining and disrespectful. I realize the baby doesn't understand the comments, but I'm hoping to stop a habit before she gets to an age where she does understand (kids take comments literally). Any advice as to how I can get this to stop? Should I address this, or is this an area my husband should manage because it's his Mother and sister doing it? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "In-Laws", "id": "64q1nl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 62, "report_reasons": null, "author": "runbabyrun_21", "saved": false, "mod_reports": [], "name": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "in-laws", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/64q1nl/mil_undermining_her_son_my_husband_to_child/", "num_reports": null, "locked": false, "stickied": false, "created": 1491935835.0, "url": "https://www.reddit.com/r/Parenting/comments/64q1nl/mil_undermining_her_son_my_husband_to_child/", "author_flair_text": null, "quarantine": false, "title": "MIL undermining her son (my husband) to child", "created_utc": 1491907035.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 59, "visited": false, "subreddit_type": "public", "ups": 62}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4dkrt", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "theninjaforhire", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If the sarcastic comments are meant as loving teasing and not actual digs at your husband, I think you should find a way to let it go. Sarcasm is pervasive and you'd be surprised how quickly kids pick up on it. I'm certainly biased because we're a very sarcastic family, but I think it's super helpful. If someone says something mean to my daughter she can quickly, and without intention, evaluate if it's true or not. She loves sarcasm and gives it as good as she gets. If it really bothers you, you can ask your husband's family to refrain from making those comments around you, but I wouldn't worry too much about your child taking those comments literally. \n\n\nIf the comments are actual digs at your husband, that's another story. The next time it happens, respond in kind(same tone) with a sarcastic comment about the offender. They can't get mad at you for \"continuing the joke\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the sarcastic comments are meant as loving teasing and not actual digs at your husband, I think you should find a way to let it go. Sarcasm is pervasive and you&amp;#39;d be surprised how quickly kids pick up on it. I&amp;#39;m certainly biased because we&amp;#39;re a very sarcastic family, but I think it&amp;#39;s super helpful. If someone says something mean to my daughter she can quickly, and without intention, evaluate if it&amp;#39;s true or not. She loves sarcasm and gives it as good as she gets. If it really bothers you, you can ask your husband&amp;#39;s family to refrain from making those comments around you, but I wouldn&amp;#39;t worry too much about your child taking those comments literally. &lt;/p&gt;\n\n&lt;p&gt;If the comments are actual digs at your husband, that&amp;#39;s another story. The next time it happens, respond in kind(same tone) with a sarcastic comment about the offender. They can&amp;#39;t get mad at you for &amp;quot;continuing the joke&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4dkrt", "score_hidden": false, "stickied": false, "created": 1491951939.0, "created_utc": 1491923139.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4lyg7", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "Carcul", "parent_id": "t1_dg4iflu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It sounds to me like you're a very different type of person than they are with a different way of expressing yourself than them.\n\nThis is ok. You're allowed to be you, and they are allowed to be themselves.\n\nWhat's not ok though, is you telling them who they are allowed to be or what they are allowed to say. They get to be in control of themselves.\n\nIt sounds like gentle poking fun to me. If there's a grain of truth there, or they get slightly edgy about it, shake it off. No good will come of falling out with them over something so small.\n\nIf you're worried about their influence on him, for the 1st 12 years or so of his life, he will be far more influenced by you and your husband than anyone else, so model the behaviour you want to see.\n\nAs a teenager, he'll lean towards the communication style he likes best. If it's yours, great. He'll probably distance himself from your in-laws himself at that stage. If it's your husbands family's, also great, and you will have to learn to cope with it.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds to me like you&amp;#39;re a very different type of person than they are with a different way of expressing yourself than them.&lt;/p&gt;\n\n&lt;p&gt;This is ok. You&amp;#39;re allowed to be you, and they are allowed to be themselves.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s not ok though, is you telling them who they are allowed to be or what they are allowed to say. They get to be in control of themselves.&lt;/p&gt;\n\n&lt;p&gt;It sounds like gentle poking fun to me. If there&amp;#39;s a grain of truth there, or they get slightly edgy about it, shake it off. No good will come of falling out with them over something so small.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re worried about their influence on him, for the 1st 12 years or so of his life, he will be far more influenced by you and your husband than anyone else, so model the behaviour you want to see.&lt;/p&gt;\n\n&lt;p&gt;As a teenager, he&amp;#39;ll lean towards the communication style he likes best. If it&amp;#39;s yours, great. He&amp;#39;ll probably distance himself from your in-laws himself at that stage. If it&amp;#39;s your husbands family&amp;#39;s, also great, and you will have to learn to cope with it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4lyg7", "score_hidden": false, "stickied": false, "created": 1491961149.0, "created_utc": 1491932349.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg526cr", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ink_puppy", "parent_id": "t1_dg4iflu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think you are taking these comments the wrong way. It sounds like they are trying to make you feel like part of the family by treating you like they treat the family which is a jokey sarcastic loving way. I think you need to try to meet them halfway on this. Its not fair for you to tell them how to behave when it really doesn't seem like they arn't being that disrespectful. Of course this is a two way street and mil and sil and fil can also be asked to just rein it in a bit but I do think that when you tell them that their feelings are going to be hurt because this is how they are trying to show familial love and you are basically saying you think its a bad way to do it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are taking these comments the wrong way. It sounds like they are trying to make you feel like part of the family by treating you like they treat the family which is a jokey sarcastic loving way. I think you need to try to meet them halfway on this. Its not fair for you to tell them how to behave when it really doesn&amp;#39;t seem like they arn&amp;#39;t being that disrespectful. Of course this is a two way street and mil and sil and fil can also be asked to just rein it in a bit but I do think that when you tell them that their feelings are going to be hurt because this is how they are trying to show familial love and you are basically saying you think its a bad way to do it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg526cr", "score_hidden": false, "stickied": false, "created": 1491979621.0, "created_utc": 1491950821.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4m7i6", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dg4iflu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You do sound very sensitive. If I were your SIL I would try to walk on eggshells around you, but I really doubt I would succeed because I don't perceive anything here as a slight - it's hard to avoid something you don't see. And while it is easy for you to articulate why you feel her comments as hurtful to you, I suspect you don't see how your comments feel hurtful to her. \n\nIt may be helpful to look at this as a clash of cultures. Neither side is wrong, just different. You won't change them and they won't change you, so the only things to work on are improved communication, understanding, and mutual tolerance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You do sound very sensitive. If I were your SIL I would try to walk on eggshells around you, but I really doubt I would succeed because I don&amp;#39;t perceive anything here as a slight - it&amp;#39;s hard to avoid something you don&amp;#39;t see. And while it is easy for you to articulate why you feel her comments as hurtful to you, I suspect you don&amp;#39;t see how your comments feel hurtful to her. &lt;/p&gt;\n\n&lt;p&gt;It may be helpful to look at this as a clash of cultures. Neither side is wrong, just different. You won&amp;#39;t change them and they won&amp;#39;t change you, so the only things to work on are improved communication, understanding, and mutual tolerance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4m7i6", "score_hidden": false, "stickied": false, "created": 1491961421.0, "created_utc": 1491932621.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4xviz", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "diggexpat", "parent_id": "t1_dg4iflu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; Maybe I'm too sensitive\n\n\n&gt;she started with the teasing me again and made a comment to the baby about having to call social services because I cut the baby's nails and caught a bit of skin on the end of her finger (I cried more than the baby did when that happened)\n\n\nI don't think there's any maybe about it. You need to lighten up. These people aren't going away and they aren't going to change.\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Maybe I&amp;#39;m too sensitive&lt;/p&gt;\n\n&lt;p&gt;she started with the teasing me again and made a comment to the baby about having to call social services because I cut the baby&amp;#39;s nails and caught a bit of skin on the end of her finger (I cried more than the baby did when that happened)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think there&amp;#39;s any maybe about it. You need to lighten up. These people aren&amp;#39;t going away and they aren&amp;#39;t going to change.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4xviz", "score_hidden": false, "stickied": false, "created": 1491974267.0, "created_utc": 1491945467.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg5ejdk", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "runbabyrun_21", "parent_id": "t1_dg4n6t2", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for this well articulated advice. The positivity will be well received and an easy way to deliver what I want to say. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this well articulated advice. The positivity will be well received and an easy way to deliver what I want to say. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ejdk", "score_hidden": false, "stickied": false, "created": 1491996267.0, "created_utc": 1491967467.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4n6t2", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ZenMommy", "parent_id": "t1_dg4iflu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Okay, so it's clear that there's an undertone here. When we really show love to someone, the very first thing we think about it \"will they feel loved if I do this?\" If the answer is \"no\", then to continue this behavior only proves that they are *not* showing love, they are being mean. \n\nYou can't stop them from doing this. But you CAN use it as a learning experience for your child. No matter what their age is, you can directly address your child whenever someone speaks like this around them and say things like \n\n\"that's not how our family shows love. We make sure that we make people *feel* loved, not hurt.\" \n\n\"Grandma is being passive aggressive here. You don't have to listen to her when she does this.\" \n\n\"There are many ways to show love. Let's practice a better one, and give Daddy a hug instead!\" \n\nAs for the two women themselves, I suggest that you counter by taking them at face value and praising your husband to the highest heavens. \n\n\"He's your problem now!\" = \"I can't understand why you say that! SO is so hard working/respectful/kind/loving/incredible partner/loving father/etc. \n\n\"Aren't you lucky he's all yours?\"  = YES!!!! I AM SO LUCKY! I just wish you guys could appreciate him more for the amazing person he is.\n\n\"We can't work on him anymore\" = \"well, that's a strange and unhealthy thing to say about an adult. All growth comes from within, so you don't need to worry about that, do you?\" \n\nBecause here's the thing: can you every imagine talking like this to your own child? Of course not. And what will happen when they start doing this to your kid and hurting their feelings? \n\nWhen they talk like that, and defend their rudeness, it's just like people being racist and trying to excuse it because \"I'm just joking\". So it's okay to call them on it. When they defend themselves, try saying \"many a true word is spoken in jest\" \"I think that statement says more about you than anything about my husband\" \"just because you're used to it doesn't mean it's kind or loving\" \"it's the impact, not the intent that matters\". Often, simply holding eye contact while softly and firmly saying \"that's unkind\" works wonders. They protest, and you repeat \"that's unkind\" until they stop. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, so it&amp;#39;s clear that there&amp;#39;s an undertone here. When we really show love to someone, the very first thing we think about it &amp;quot;will they feel loved if I do this?&amp;quot; If the answer is &amp;quot;no&amp;quot;, then to continue this behavior only proves that they are &lt;em&gt;not&lt;/em&gt; showing love, they are being mean. &lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t stop them from doing this. But you CAN use it as a learning experience for your child. No matter what their age is, you can directly address your child whenever someone speaks like this around them and say things like &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;that&amp;#39;s not how our family shows love. We make sure that we make people &lt;em&gt;feel&lt;/em&gt; loved, not hurt.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Grandma is being passive aggressive here. You don&amp;#39;t have to listen to her when she does this.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;There are many ways to show love. Let&amp;#39;s practice a better one, and give Daddy a hug instead!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;As for the two women themselves, I suggest that you counter by taking them at face value and praising your husband to the highest heavens. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He&amp;#39;s your problem now!&amp;quot; = &amp;quot;I can&amp;#39;t understand why you say that! SO is so hard working/respectful/kind/loving/incredible partner/loving father/etc. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Aren&amp;#39;t you lucky he&amp;#39;s all yours?&amp;quot;  = YES!!!! I AM SO LUCKY! I just wish you guys could appreciate him more for the amazing person he is.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We can&amp;#39;t work on him anymore&amp;quot; = &amp;quot;well, that&amp;#39;s a strange and unhealthy thing to say about an adult. All growth comes from within, so you don&amp;#39;t need to worry about that, do you?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Because here&amp;#39;s the thing: can you every imagine talking like this to your own child? Of course not. And what will happen when they start doing this to your kid and hurting their feelings? &lt;/p&gt;\n\n&lt;p&gt;When they talk like that, and defend their rudeness, it&amp;#39;s just like people being racist and trying to excuse it because &amp;quot;I&amp;#39;m just joking&amp;quot;. So it&amp;#39;s okay to call them on it. When they defend themselves, try saying &amp;quot;many a true word is spoken in jest&amp;quot; &amp;quot;I think that statement says more about you than anything about my husband&amp;quot; &amp;quot;just because you&amp;#39;re used to it doesn&amp;#39;t mean it&amp;#39;s kind or loving&amp;quot; &amp;quot;it&amp;#39;s the impact, not the intent that matters&amp;quot;. Often, simply holding eye contact while softly and firmly saying &amp;quot;that&amp;#39;s unkind&amp;quot; works wonders. They protest, and you repeat &amp;quot;that&amp;#39;s unkind&amp;quot; until they stop. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4n6t2", "score_hidden": false, "stickied": false, "created": 1491962498.0, "created_utc": 1491933698.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg5mv24", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "cadburycantstop", "parent_id": "t1_dg4iflu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Honestly OP I'm surprised by how many people are saying that you are being too sensitive when SIL threatened to skip your wedding when asked politely to tone down the teasing. That's a ridiculous and manipulative overreaction to hearing that someone who you are trying to \"show love\" to doesn't appreciate your methods. \n\nI grew up in a sarcastic and teasing family and since I was young and shy I was often the target. Sure, I learned how to dish it out in return. But It never really made me feel especially loved or appreciated, or like my teasing back was some special expression of love for my fam. I always felt on the defensive/like it wasn't my natural personality. And also that teasing me seemed like a great way for my parents and sis to bond at my expense. \n\nPoint being everyone is different and there's no one right way to be. It's good to try to let things roll off your back but it's also good to not just be sarcastic 24/7. Like, that's boring. \n\nI think the advice to cover it with kindness is excellent. The best way is to respond genuinely and in a way that's not also a criticism of them. When they say poor baby is stuck with your DH, say \"that's okay with us, we like him\" or \"he's doing a great job.\" It's the best of both worlds. They get to tease and you get to provide a positive alternative without attacking their approach.\n\nAnother option if they start in on your or DH's parenting is to make a crack like \"at least we don't leave you alone with Grandma/SIL.\" That at least will tell you if this teasing is really equal opportunity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly OP I&amp;#39;m surprised by how many people are saying that you are being too sensitive when SIL threatened to skip your wedding when asked politely to tone down the teasing. That&amp;#39;s a ridiculous and manipulative overreaction to hearing that someone who you are trying to &amp;quot;show love&amp;quot; to doesn&amp;#39;t appreciate your methods. &lt;/p&gt;\n\n&lt;p&gt;I grew up in a sarcastic and teasing family and since I was young and shy I was often the target. Sure, I learned how to dish it out in return. But It never really made me feel especially loved or appreciated, or like my teasing back was some special expression of love for my fam. I always felt on the defensive/like it wasn&amp;#39;t my natural personality. And also that teasing me seemed like a great way for my parents and sis to bond at my expense. &lt;/p&gt;\n\n&lt;p&gt;Point being everyone is different and there&amp;#39;s no one right way to be. It&amp;#39;s good to try to let things roll off your back but it&amp;#39;s also good to not just be sarcastic 24/7. Like, that&amp;#39;s boring. &lt;/p&gt;\n\n&lt;p&gt;I think the advice to cover it with kindness is excellent. The best way is to respond genuinely and in a way that&amp;#39;s not also a criticism of them. When they say poor baby is stuck with your DH, say &amp;quot;that&amp;#39;s okay with us, we like him&amp;quot; or &amp;quot;he&amp;#39;s doing a great job.&amp;quot; It&amp;#39;s the best of both worlds. They get to tease and you get to provide a positive alternative without attacking their approach.&lt;/p&gt;\n\n&lt;p&gt;Another option if they start in on your or DH&amp;#39;s parenting is to make a crack like &amp;quot;at least we don&amp;#39;t leave you alone with Grandma/SIL.&amp;quot; That at least will tell you if this teasing is really equal opportunity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5mv24", "score_hidden": false, "stickied": false, "created": 1492014001.0, "created_utc": 1491985201.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iflu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "runbabyrun_21", "parent_id": "t1_dg45sa0", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "When my husband and I first got together, regular Sunday dinners at his parents house meant me dealing with remarks from his sister about how I was 'perfect' and calling me by a nickname I had asked not to be called...the parents thought these comments were funny and either remained silent or laughed. I didn't stand up and punch her in the throat like I wanted to, instead I gave no response or changed the subject. Before we got married my husband asked her to stop and she threw a fit, said that's how their family shows love, wasnt coming to the wedding...she became more respectful until after the baby was born when she started with the teasing me again and made a comment to the baby about having to call social services because I cut the baby's nails and caught a bit of skin on the end of her finger (I cried more than the baby did when that happened). Both the sister and mother would make comments to me about my husband being 'my problem now', 'they can't work on him any more' and 'aren't you lucky that he's all yours'...Maybe these comments are how they show love, but I don't want this type of behaviour in my family (baby and husband). I feel a lack of support and loyalty when things like this are said. Maybe I'm too sensitive, or nit-picky, but there are a million other things that can be said in a joking or sarcastic manner, why does it need to be personal? My mother has a saying: many a true word spoken in jest. So leaving it alone dosent feel like an option I want to exercise, it how I approach it so I don't create a rift and damage relationships that concerns me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When my husband and I first got together, regular Sunday dinners at his parents house meant me dealing with remarks from his sister about how I was &amp;#39;perfect&amp;#39; and calling me by a nickname I had asked not to be called...the parents thought these comments were funny and either remained silent or laughed. I didn&amp;#39;t stand up and punch her in the throat like I wanted to, instead I gave no response or changed the subject. Before we got married my husband asked her to stop and she threw a fit, said that&amp;#39;s how their family shows love, wasnt coming to the wedding...she became more respectful until after the baby was born when she started with the teasing me again and made a comment to the baby about having to call social services because I cut the baby&amp;#39;s nails and caught a bit of skin on the end of her finger (I cried more than the baby did when that happened). Both the sister and mother would make comments to me about my husband being &amp;#39;my problem now&amp;#39;, &amp;#39;they can&amp;#39;t work on him any more&amp;#39; and &amp;#39;aren&amp;#39;t you lucky that he&amp;#39;s all yours&amp;#39;...Maybe these comments are how they show love, but I don&amp;#39;t want this type of behaviour in my family (baby and husband). I feel a lack of support and loyalty when things like this are said. Maybe I&amp;#39;m too sensitive, or nit-picky, but there are a million other things that can be said in a joking or sarcastic manner, why does it need to be personal? My mother has a saying: many a true word spoken in jest. So leaving it alone dosent feel like an option I want to exercise, it how I approach it so I don&amp;#39;t create a rift and damage relationships that concerns me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4iflu", "score_hidden": false, "stickied": false, "created": 1491957306.0, "created_utc": 1491928506.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg45sa0", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "ZenMommy", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It really depends on the context. Does your husband have a healthy, loving relationship with his family? Or is there a history of him being the scapegoat and being treated like he's less?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It really depends on the context. Does your husband have a healthy, loving relationship with his family? Or is there a history of him being the scapegoat and being treated like he&amp;#39;s less?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg45sa0", "score_hidden": false, "stickied": false, "created": 1491941083.0, "created_utc": 1491912283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4rvto", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "DEEP_SEA_MAX", "parent_id": "t1_dg4gd10", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My whole family teases each other, my friends tease each other, the guys I work with we tease each other. The only people I don't make fun of are the people I don't like, I just ignore them. Love can be shown in all kinds if ways, and it sounds like your husband's family shows it this way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My whole family teases each other, my friends tease each other, the guys I work with we tease each other. The only people I don&amp;#39;t make fun of are the people I don&amp;#39;t like, I just ignore them. Love can be shown in all kinds if ways, and it sounds like your husband&amp;#39;s family shows it this way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4rvto", "score_hidden": false, "stickied": false, "created": 1491967559.0, "created_utc": 1491938759.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4tp3h", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "dorianrose", "parent_id": "t1_dg4gd10", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I personally think if husband is there, and laughing along with it, it's probably fine. But if he not present, than the situation has a different tone, and she absolutely should say something, if she's uncomfortable.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I personally think if husband is there, and laughing along with it, it&amp;#39;s probably fine. But if he not present, than the situation has a different tone, and she absolutely should say something, if she&amp;#39;s uncomfortable.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4tp3h", "score_hidden": false, "stickied": false, "created": 1491969512.0, "created_utc": 1491940712.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gd10", "gilded": 0, "archived": false, "score": 70, "report_reasons": null, "author": "nowhereian", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; I don't want my child being raised to think that sarcastic comments are how we show love.\n\nI was raised the same way your husband was. My family sarcastically jokes around like this *constantly*. It doesn't mean we don't love each other. It's all in good fun. \n\nMy wife was raised like you. It feels like she takes offense to everything. My parents and sister comment that I've lost a lot of my sense of humor since our relationship started (in private, of course) when we go to visit. It's very, very draining.\n\nPlease, let this go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t want my child being raised to think that sarcastic comments are how we show love.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I was raised the same way your husband was. My family sarcastically jokes around like this &lt;em&gt;constantly&lt;/em&gt;. It doesn&amp;#39;t mean we don&amp;#39;t love each other. It&amp;#39;s all in good fun. &lt;/p&gt;\n\n&lt;p&gt;My wife was raised like you. It feels like she takes offense to everything. My parents and sister comment that I&amp;#39;ve lost a lot of my sense of humor since our relationship started (in private, of course) when we go to visit. It&amp;#39;s very, very draining.&lt;/p&gt;\n\n&lt;p&gt;Please, let this go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4gd10", "score_hidden": false, "stickied": false, "created": 1491955032.0, "created_utc": 1491926232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 70}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4h0kt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "eatdrinkandbemerry80", "parent_id": "t1_dg44e7q", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If they don't \"get\" sarcasm by the time they go to Kindergarten, I'm afraid these days it will do a lot more harm than good considering what other kids say sometimes! If they are taking sarcasm literally, feelings are really going to get hurt, for sure! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If they don&amp;#39;t &amp;quot;get&amp;quot; sarcasm by the time they go to Kindergarten, I&amp;#39;m afraid these days it will do a lot more harm than good considering what other kids say sometimes! If they are taking sarcasm literally, feelings are really going to get hurt, for sure! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4h0kt", "score_hidden": false, "stickied": false, "created": 1491955758.0, "created_utc": 1491926958.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44e7q", "gilded": 0, "archived": false, "score": 66, "report_reasons": null, "author": "Ktbearmoo", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If your husband doesn't have a problem with it, neither should you. It sounds like the comments are light hearted and I wouldn't read too much into them.\n\nAs for your child, it's important that they learn sarcasm at some point in their lives. While young children do not understand sarcasm, as they grow and develop they will and I think it's an important thing to at least understand sarcasm (even if it isn't your sense of humor) to navigate every day life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your husband doesn&amp;#39;t have a problem with it, neither should you. It sounds like the comments are light hearted and I wouldn&amp;#39;t read too much into them.&lt;/p&gt;\n\n&lt;p&gt;As for your child, it&amp;#39;s important that they learn sarcasm at some point in their lives. While young children do not understand sarcasm, as they grow and develop they will and I think it&amp;#39;s an important thing to at least understand sarcasm (even if it isn&amp;#39;t your sense of humor) to navigate every day life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg44e7q", "score_hidden": false, "stickied": false, "created": 1491938059.0, "created_utc": 1491909259.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 66}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg47m3r", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Spartyjason", "parent_id": "t1_dg43zid", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Its completely ok to do this as long as everyone is ok with it. This is the way that groups of men and young men relate as they are able to show closeness to their peers without being overly emotional. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its completely ok to do this as long as everyone is ok with it. This is the way that groups of men and young men relate as they are able to show closeness to their peers without being overly emotional. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg47m3r", "score_hidden": false, "stickied": false, "created": 1491944221.0, "created_utc": 1491915421.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4gwc9", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "eatdrinkandbemerry80", "parent_id": "t1_dg4ae2e", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Well, if this is the case, that they have said other things that weren't good natured and more insulting, that might be a different story, but it would be way more concerning than the sarcasm, so why not share that in your OP? It would help people understand the situation a whole lot better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, if this is the case, that they have said other things that weren&amp;#39;t good natured and more insulting, that might be a different story, but it would be way more concerning than the sarcasm, so why not share that in your OP? It would help people understand the situation a whole lot better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4gwc9", "score_hidden": false, "stickied": false, "created": 1491955630.0, "created_utc": 1491926830.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4zzpc", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "jennybean42", "parent_id": "t1_dg4owuw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This is a really good way to explain it. Our family shows love this way too. We're all basically sarcastic. I hope OP takes this to heart. I can see how it would be frustrating if you weren't raised with that dynamic.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a really good way to explain it. Our family shows love this way too. We&amp;#39;re all basically sarcastic. I hope OP takes this to heart. I can see how it would be frustrating if you weren&amp;#39;t raised with that dynamic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4zzpc", "score_hidden": false, "stickied": false, "created": 1491976836.0, "created_utc": 1491948036.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4owuw", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dg4ae2e", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Actually no; if this is the way they show love it wouldn't be (and shouldn't be) an isolated incident. It should flow freely, like love itself. We are a family like this. It isn't a problem, because both my husband and I come from this sort of family and all of our siblings married into similar families. So there is no risk of misunderstanding. I'm going to offer a couple of recent examples to try to illustrate how this works in a healthy family.\n\nMy sons are teens, and teens tend to make a lot of mistakes - that's why we don't call them adults at puberty. It is completely normal for my son to start a conversation with \"You're right, mom, I'm an idiot\", and I respond with \"Yep. Told ya so.\"  (Translation: \"I made a mistake\" and \"it's ok, I know things happen\".) I know something's coming and I'm probably not going to like it. But it is easier for him to confess once he's broken the ice and warned me with humor. And my response reassures him - had I said \"oh my god what have you done?\" he would tense and freeze up.  Likewise, the exchange \"How stupid am I?\" \"Pretty stupid, why do you ask?\" translates as \"I have a problem I can't solve\" and \"how can I help?\" Teens don't always want to admit they need help, but the exaggerated exchange takes the edge off their discomfort. \n\nThere is a great deal of warmth and security in this sort of exchange as long as everyone is comfortable with it. In a mixed marriage, I'm not so sure what happens. I don't envy you this problem - it sounds very awkward and uncomfortable for everyone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually no; if this is the way they show love it wouldn&amp;#39;t be (and shouldn&amp;#39;t be) an isolated incident. It should flow freely, like love itself. We are a family like this. It isn&amp;#39;t a problem, because both my husband and I come from this sort of family and all of our siblings married into similar families. So there is no risk of misunderstanding. I&amp;#39;m going to offer a couple of recent examples to try to illustrate how this works in a healthy family.&lt;/p&gt;\n\n&lt;p&gt;My sons are teens, and teens tend to make a lot of mistakes - that&amp;#39;s why we don&amp;#39;t call them adults at puberty. It is completely normal for my son to start a conversation with &amp;quot;You&amp;#39;re right, mom, I&amp;#39;m an idiot&amp;quot;, and I respond with &amp;quot;Yep. Told ya so.&amp;quot;  (Translation: &amp;quot;I made a mistake&amp;quot; and &amp;quot;it&amp;#39;s ok, I know things happen&amp;quot;.) I know something&amp;#39;s coming and I&amp;#39;m probably not going to like it. But it is easier for him to confess once he&amp;#39;s broken the ice and warned me with humor. And my response reassures him - had I said &amp;quot;oh my god what have you done?&amp;quot; he would tense and freeze up.  Likewise, the exchange &amp;quot;How stupid am I?&amp;quot; &amp;quot;Pretty stupid, why do you ask?&amp;quot; translates as &amp;quot;I have a problem I can&amp;#39;t solve&amp;quot; and &amp;quot;how can I help?&amp;quot; Teens don&amp;#39;t always want to admit they need help, but the exaggerated exchange takes the edge off their discomfort. &lt;/p&gt;\n\n&lt;p&gt;There is a great deal of warmth and security in this sort of exchange as long as everyone is comfortable with it. In a mixed marriage, I&amp;#39;m not so sure what happens. I don&amp;#39;t envy you this problem - it sounds very awkward and uncomfortable for everyone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4owuw", "score_hidden": false, "stickied": false, "created": 1491964395.0, "created_utc": 1491935595.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg52mc0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ink_puppy", "parent_id": "t1_dg4ae2e", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "can you give us examples of the actual offensive things? it might help offer better advice and perspective", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;can you give us examples of the actual offensive things? it might help offer better advice and perspective&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg52mc0", "score_hidden": false, "stickied": false, "created": 1491980197.0, "created_utc": 1491951397.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ae2e", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "runbabyrun_21", "parent_id": "t1_dg43zid", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "I would tend to agree with you if this was an isolated incident. There have been other comments made in the past that were not \"good natured ribbing\", as you say, but comments that displayed doubt about the capabilities of my husband. I really appreciate your reply to my post though, it's a perspective I had not considered. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would tend to agree with you if this was an isolated incident. There have been other comments made in the past that were not &amp;quot;good natured ribbing&amp;quot;, as you say, but comments that displayed doubt about the capabilities of my husband. I really appreciate your reply to my post though, it&amp;#39;s a perspective I had not considered. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ae2e", "score_hidden": false, "stickied": false, "created": 1491948123.0, "created_utc": 1491919323.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43zid", "gilded": 0, "archived": false, "score": 94, "report_reasons": null, "author": "also_HIM", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You shouldn't do anything because you are way overreacting to a couple of harmless (and hardly unusual) jokes. \n\nEdit: And, believe it or not, a good-natured ribbing *is* one way many people show love. It's predicated on a security, closeness, and understanding between two people that *this is all in fun* and/or *your 'flaws' aren't a real problem to me* (often you can look at it as self-deprecating humor, where you're extending \"self\" to someone with whom you have a close bond). ", "edited": 1491909929.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You shouldn&amp;#39;t do anything because you are way overreacting to a couple of harmless (and hardly unusual) jokes. &lt;/p&gt;\n\n&lt;p&gt;Edit: And, believe it or not, a good-natured ribbing &lt;em&gt;is&lt;/em&gt; one way many people show love. It&amp;#39;s predicated on a security, closeness, and understanding between two people that &lt;em&gt;this is all in fun&lt;/em&gt; and/or &lt;em&gt;your &amp;#39;flaws&amp;#39; aren&amp;#39;t a real problem to me&lt;/em&gt; (often you can look at it as self-deprecating humor, where you&amp;#39;re extending &amp;quot;self&amp;quot; to someone with whom you have a close bond). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg43zid", "score_hidden": false, "stickied": false, "created": 1491937033.0, "created_utc": 1491908233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 94}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4kcd7", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "jintana", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'll bet that you've been in situations where you've felt hurt by comments like that and felt ineffective at getting the person to quit making them. Perhaps by painful family or peers?\n\nHowever, when people have good self-esteem, feel warmly toward each other emotionally, that their personal boundaries are respected, and that they're bonded securely, etc. that sort of commentary won't hurt. \n\nOne of the best skills a child (hell, or adult) can have is letting people's opinions of them roll off their back like so many droplets of water, rather than getting under their skin like so many ticks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll bet that you&amp;#39;ve been in situations where you&amp;#39;ve felt hurt by comments like that and felt ineffective at getting the person to quit making them. Perhaps by painful family or peers?&lt;/p&gt;\n\n&lt;p&gt;However, when people have good self-esteem, feel warmly toward each other emotionally, that their personal boundaries are respected, and that they&amp;#39;re bonded securely, etc. that sort of commentary won&amp;#39;t hurt. &lt;/p&gt;\n\n&lt;p&gt;One of the best skills a child (hell, or adult) can have is letting people&amp;#39;s opinions of them roll off their back like so many droplets of water, rather than getting under their skin like so many ticks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4kcd7", "score_hidden": false, "stickied": false, "created": 1491959387.0, "created_utc": 1491930587.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg5osaf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SeppoX", "parent_id": "t1_dg567hg", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Well the other option is to cut the family out. She doesnt like it, she doesnt want it around her or her baby. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well the other option is to cut the family out. She doesnt like it, she doesnt want it around her or her baby. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5osaf", "score_hidden": false, "stickied": false, "created": 1492020048.0, "created_utc": 1491991248.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg5rk8u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tercerero", "parent_id": "t1_dg567hg", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Keep your comments civil please.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Keep your comments civil please.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5rk8u", "score_hidden": false, "stickied": false, "created": 1492027166.0, "created_utc": 1491998366.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg567hg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg55tyq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg567hg", "score_hidden": false, "stickied": false, "created": 1491985030.0, "created_utc": 1491956230.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg55tyq", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "runbabyrun_21", "parent_id": "t1_dg4zg5z", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "It's also a sign of being insensitive in some situations (like this one). But thanks for your input. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s also a sign of being insensitive in some situations (like this one). But thanks for your input. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg55tyq", "score_hidden": false, "stickied": false, "created": 1491984537.0, "created_utc": 1491955737.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4zg5z", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Gynsyng", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[Sarcasm is a sign of intelligence](http://www.sciencedirect.com/science/article/pii/S074959781500076X)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://www.sciencedirect.com/science/article/pii/S074959781500076X\"&gt;Sarcasm is a sign of intelligence&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4zg5z", "score_hidden": false, "stickied": false, "created": 1491976162.0, "created_utc": 1491947362.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4d3dr", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "silliesandsmiles", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "So these sound like joking, light hearted comments. There could be more going on here, but if you want a full answer, we need the full information. But really, it sounds like a non issue to me, and it kind of sounds like you are upset about something else and want to use this as an excuse. These comments are teasing and light, and also are not insulting you. If your husband is fine with it, then it's really not your issue. It might be a different type of relationship that what you have with your family, but that doesn't make it wrong. \n\nAlso, I'm concerned about you saying this is undermining him. Your child is 5 months old. It is doing absolutely nothing to his perception of his father. I say ridiculous things to babies all the time, and all they understand is my tone. Kids might take comments literally, but they usually pick up teasing and joking quickly. If the 4F I nanny was told something  similar by her grandma about her dad, she'd probably laugh and say something like, \"couldn't you have taught him how to do hair?!\" As long as there is also love and comfort, this will do nothing negative to your child. In fact, teaching them about light hearted teasing is good for them. It's not bullying or being me, or saying things like, \"I don't like how your father turned out.\" It's self deprecating, and funny, and will ultimately help your child understand the multifacets of personality, and relationships, and communication. If all your child hears is rainbows and giggles, then they might struggle when they enter school/daycare and face more playful children. I'm not saying be mean to them, or teach them to be sassy, but more, just experience and show a range of emotions. I see where you are coming from, but in all, I think you need to breathe, and relax, and let your family be silly and funny with your child. At this age, comments like these keep people sane. If they get older and your in laws are actually being rude, then that's an issue. But from what you've told us here, you need to let this one go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So these sound like joking, light hearted comments. There could be more going on here, but if you want a full answer, we need the full information. But really, it sounds like a non issue to me, and it kind of sounds like you are upset about something else and want to use this as an excuse. These comments are teasing and light, and also are not insulting you. If your husband is fine with it, then it&amp;#39;s really not your issue. It might be a different type of relationship that what you have with your family, but that doesn&amp;#39;t make it wrong. &lt;/p&gt;\n\n&lt;p&gt;Also, I&amp;#39;m concerned about you saying this is undermining him. Your child is 5 months old. It is doing absolutely nothing to his perception of his father. I say ridiculous things to babies all the time, and all they understand is my tone. Kids might take comments literally, but they usually pick up teasing and joking quickly. If the 4F I nanny was told something  similar by her grandma about her dad, she&amp;#39;d probably laugh and say something like, &amp;quot;couldn&amp;#39;t you have taught him how to do hair?!&amp;quot; As long as there is also love and comfort, this will do nothing negative to your child. In fact, teaching them about light hearted teasing is good for them. It&amp;#39;s not bullying or being me, or saying things like, &amp;quot;I don&amp;#39;t like how your father turned out.&amp;quot; It&amp;#39;s self deprecating, and funny, and will ultimately help your child understand the multifacets of personality, and relationships, and communication. If all your child hears is rainbows and giggles, then they might struggle when they enter school/daycare and face more playful children. I&amp;#39;m not saying be mean to them, or teach them to be sassy, but more, just experience and show a range of emotions. I see where you are coming from, but in all, I think you need to breathe, and relax, and let your family be silly and funny with your child. At this age, comments like these keep people sane. If they get older and your in laws are actually being rude, then that&amp;#39;s an issue. But from what you&amp;#39;ve told us here, you need to let this one go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4d3dr", "score_hidden": false, "stickied": false, "created": 1491951386.0, "created_utc": 1491922586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg51hri", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "CharlieChuu", "parent_id": "t1_dg514su", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That makes literally zero sense given the context of the OP...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That makes literally zero sense given the context of the OP...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg51hri", "score_hidden": false, "stickied": false, "created": 1491978739.0, "created_utc": 1491949939.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg514su", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "dorianrose", "parent_id": "t1_dg4va60", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "And I'm saying, if he's in the room, it's aimed at him. If he's not, then it's aimed at her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And I&amp;#39;m saying, if he&amp;#39;s in the room, it&amp;#39;s aimed at him. If he&amp;#39;s not, then it&amp;#39;s aimed at her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg514su", "score_hidden": false, "stickied": false, "created": 1491978287.0, "created_utc": 1491949487.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4va60", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "CharlieChuu", "parent_id": "t1_dg4u4hd", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My point a that it's *my* mom saying it about *me* and it's OPs *husband's* mom saying it about *him*.  If he's not bothered by it there's no reason to be upset. She's obviously not understanding the dynamic, which is fine since it's not about her anyway, but that's why most of us are telling her relax. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My point a that it&amp;#39;s &lt;em&gt;my&lt;/em&gt; mom saying it about &lt;em&gt;me&lt;/em&gt; and it&amp;#39;s OPs &lt;em&gt;husband&amp;#39;s&lt;/em&gt; mom saying it about &lt;em&gt;him&lt;/em&gt;.  If he&amp;#39;s not bothered by it there&amp;#39;s no reason to be upset. She&amp;#39;s obviously not understanding the dynamic, which is fine since it&amp;#39;s not about her anyway, but that&amp;#39;s why most of us are telling her relax. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4va60", "score_hidden": false, "stickied": false, "created": 1491971285.0, "created_utc": 1491942485.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4u4hd", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "dorianrose", "parent_id": "t1_dg4idn1", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That particular example seems perfect to me, because it really shows that type of needs the relationship to be there. If my mom said that, I'd be upset, and talk it out with her, if my sister said it, I'd laugh, and if my husband's mother said it, I'd freeze her out and ask to leave. So, op is the one who came here asking for advice, so everything is geared towards her, but I think it's worth talking to them, and asking them to keep in mind she doesn't communicate that way, or find it funny, so maybe they can meet half way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That particular example seems perfect to me, because it really shows that type of needs the relationship to be there. If my mom said that, I&amp;#39;d be upset, and talk it out with her, if my sister said it, I&amp;#39;d laugh, and if my husband&amp;#39;s mother said it, I&amp;#39;d freeze her out and ask to leave. So, op is the one who came here asking for advice, so everything is geared towards her, but I think it&amp;#39;s worth talking to them, and asking them to keep in mind she doesn&amp;#39;t communicate that way, or find it funny, so maybe they can meet half way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4u4hd", "score_hidden": false, "stickied": false, "created": 1491969991.0, "created_utc": 1491941191.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4idn1", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "CharlieChuu", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It sounds like your husband has a sense of humor and you should find yours. Her comments made me chuckle. My mom would say stuff like this about me to my baby. When my son clings to me my mother in a cutsy voice goes \"oh she's not that great! I know!\" It always makes us laugh. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like your husband has a sense of humor and you should find yours. Her comments made me chuckle. My mom would say stuff like this about me to my baby. When my son clings to me my mother in a cutsy voice goes &amp;quot;oh she&amp;#39;s not that great! I know!&amp;quot; It always makes us laugh. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4idn1", "score_hidden": false, "stickied": false, "created": 1491957245.0, "created_utc": 1491928445.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4gryi", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "eatdrinkandbemerry80", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She's just teasing him, and to a baby who has no clue what she is even teasing about! I think it would be a really bad choice to even mention it at all. Just because you \"call it as you see it\" doesn't mean that the way you see it is always right. Please don't start trouble over a Grandma good-naturedly teasing her own Son. Your Husband shouldn't \"manage\" it because there is nothing to manage in his mind (you stated he doesn't take offense). I know that concern for our children is the number one thing for (good) Mother's, but we can't nitpick so much that it drives people away that only have good and loving intentions and aren't harming anyone. Pick your battles.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s just teasing him, and to a baby who has no clue what she is even teasing about! I think it would be a really bad choice to even mention it at all. Just because you &amp;quot;call it as you see it&amp;quot; doesn&amp;#39;t mean that the way you see it is always right. Please don&amp;#39;t start trouble over a Grandma good-naturedly teasing her own Son. Your Husband shouldn&amp;#39;t &amp;quot;manage&amp;quot; it because there is nothing to manage in his mind (you stated he doesn&amp;#39;t take offense). I know that concern for our children is the number one thing for (good) Mother&amp;#39;s, but we can&amp;#39;t nitpick so much that it drives people away that only have good and loving intentions and aren&amp;#39;t harming anyone. Pick your battles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4gryi", "score_hidden": false, "stickied": false, "created": 1491955492.0, "created_utc": 1491926692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg5chil", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Schwingalingaling", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You know, a lot of people are defending sarcasm but I'll give my pov. I was raised in a sarcastic family and took it for granted as normal. When I started my first job I brought those patterns with me, and it totally backfired. I actually learned from my colleagues that families can honestly show love to one another without having digs at each other. \n\nSo yeah I support your perspective. One thing I heard a colleague say to her brother which I still remember is \"that's a very loving thing to do\". It works pretty well to reinforce behaviour you like.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, a lot of people are defending sarcasm but I&amp;#39;ll give my pov. I was raised in a sarcastic family and took it for granted as normal. When I started my first job I brought those patterns with me, and it totally backfired. I actually learned from my colleagues that families can honestly show love to one another without having digs at each other. &lt;/p&gt;\n\n&lt;p&gt;So yeah I support your perspective. One thing I heard a colleague say to her brother which I still remember is &amp;quot;that&amp;#39;s a very loving thing to do&amp;quot;. It works pretty well to reinforce behaviour you like.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5chil", "score_hidden": false, "stickied": false, "created": 1491993331.0, "created_utc": 1491964531.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4rvb8", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Information_High", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There's an easy way to tell whether you're overreacting or not:\n\nFlip the script.\n\nIf your husband were to start making the same sorts of comments towards his mother and sister, would they find it funny, or completely lose their minds in rage?\n\nThe former is rough-and-tumble love.  The latter is abuse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s an easy way to tell whether you&amp;#39;re overreacting or not:&lt;/p&gt;\n\n&lt;p&gt;Flip the script.&lt;/p&gt;\n\n&lt;p&gt;If your husband were to start making the same sorts of comments towards his mother and sister, would they find it funny, or completely lose their minds in rage?&lt;/p&gt;\n\n&lt;p&gt;The former is rough-and-tumble love.  The latter is abuse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4rvb8", "score_hidden": false, "stickied": false, "created": 1491967543.0, "created_utc": 1491938743.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4ixxb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "mollyme123", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I would light heartedly ask them to stop. Next time a comment is made nicely say you don't want the baby growing up thinking daddy isn't capable. Or joke that you both know that's true but you don't want the baby to know yet. \n\nAs long as you say it in a nice way I don't think it would start any problems. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would light heartedly ask them to stop. Next time a comment is made nicely say you don&amp;#39;t want the baby growing up thinking daddy isn&amp;#39;t capable. Or joke that you both know that&amp;#39;s true but you don&amp;#39;t want the baby to know yet. &lt;/p&gt;\n\n&lt;p&gt;As long as you say it in a nice way I don&amp;#39;t think it would start any problems. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ixxb", "score_hidden": false, "stickied": false, "created": 1491957866.0, "created_utc": 1491929066.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg57qtd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "buttercuphipp0", "parent_id": "t1_dg4ji8s", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "OP I'm with you on not liking sarcasm. It's fine in small doses, but if you're going to have small amounts of \"tearing down\" talk (like negative things said sarcastically) you have to balance it with plenty of \"building up\" talk (positive things said in a direct way). Sounds like maybe your in laws overdo the negative talk and don't balance it with positive talk. You can be the positive talk!\n\nI'm also not sure sarcasm really says someone is smart. It can be a verbal crutch for some and a way to build walls and avoid intimacy for others. Or, it can be cute and funny if it's within the boundaries of a generally trusting relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP I&amp;#39;m with you on not liking sarcasm. It&amp;#39;s fine in small doses, but if you&amp;#39;re going to have small amounts of &amp;quot;tearing down&amp;quot; talk (like negative things said sarcastically) you have to balance it with plenty of &amp;quot;building up&amp;quot; talk (positive things said in a direct way). Sounds like maybe your in laws overdo the negative talk and don&amp;#39;t balance it with positive talk. You can be the positive talk!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also not sure sarcasm really says someone is smart. It can be a verbal crutch for some and a way to build walls and avoid intimacy for others. Or, it can be cute and funny if it&amp;#39;s within the boundaries of a generally trusting relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg57qtd", "score_hidden": false, "stickied": false, "created": 1491987065.0, "created_utc": 1491958265.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ji8s", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "runbabyrun_21", "parent_id": "t1_dg4iqs4", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you! This sounds like a great way to keep a lighthearted atmosphere and shed some light on the preferred positive talk. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! This sounds like a great way to keep a lighthearted atmosphere and shed some light on the preferred positive talk. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ji8s", "score_hidden": false, "stickied": false, "created": 1491958471.0, "created_utc": 1491929671.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iqs4", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Elaine_dance", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Wow surprised so many people are telling you to just get over it. \n\nI'd do the 'kill it with kindness' approach. MIL says, oh he's your prob now' and you smile and say Oh he's not a problem. He's awesome. \n\nThis only works if you think he's awesome and MIL doesn't actually have a point about hubby slacking on baby care duties etc. \n\nThen baby, as it grows, hears positive talk to combat the negative. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow surprised so many people are telling you to just get over it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d do the &amp;#39;kill it with kindness&amp;#39; approach. MIL says, oh he&amp;#39;s your prob now&amp;#39; and you smile and say Oh he&amp;#39;s not a problem. He&amp;#39;s awesome. &lt;/p&gt;\n\n&lt;p&gt;This only works if you think he&amp;#39;s awesome and MIL doesn&amp;#39;t actually have a point about hubby slacking on baby care duties etc. &lt;/p&gt;\n\n&lt;p&gt;Then baby, as it grows, hears positive talk to combat the negative. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4iqs4", "score_hidden": false, "stickied": false, "created": 1491957652.0, "created_utc": 1491928852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg53sjk", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ink_puppy", "parent_id": "t1_dg4ju1s", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "thing is baby is gonna hear sarcasm eventually and its actually better for them to be exposed so they can learn what it is because when they start interacting with other kids you don't want your kid to be the special snowflake that can't take a joke", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thing is baby is gonna hear sarcasm eventually and its actually better for them to be exposed so they can learn what it is because when they start interacting with other kids you don&amp;#39;t want your kid to be the special snowflake that can&amp;#39;t take a joke&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg53sjk", "score_hidden": false, "stickied": false, "created": 1491981788.0, "created_utc": 1491952988.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ju1s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "runbabyrun_21", "parent_id": "t1_dg4hfvl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "For me to say something now (when baby is 5 months, instead of when she is 3 years) is strictly to avoid a habit developing and a defence argument of: it's been like this for years and you never said anything. It's more about preventing a pattern of behaviour and the cumulative effects of that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me to say something now (when baby is 5 months, instead of when she is 3 years) is strictly to avoid a habit developing and a defence argument of: it&amp;#39;s been like this for years and you never said anything. It&amp;#39;s more about preventing a pattern of behaviour and the cumulative effects of that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ju1s", "score_hidden": false, "stickied": false, "created": 1491958826.0, "created_utc": 1491930026.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4hfvl", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "eatdrinkandbemerry80", "parent_id": "t1_dg44erw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't know about the \"decent\" people thing. I'm just being honest here, but if my Sister and her Husband came over with her baby and I was teasing my Sister while pretending to look at the baby and said something like \"Too bad you didn't luck out in the Mommy department!\" (which would totally be something I would say and my Sister would find this funny and laugh.) so we have a good laugh about it and then her Husband comes up to me and says he doesn't like me talking like that in front of a 5 month old baby and could I please not do that? I'm not going to lie, it would irritate the heck out of me and question my relationship with him, for sure. Maybe that makes me a bad, indecent person, I don't know. Now, if we were talking about a 3 year old, it would be a different situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know about the &amp;quot;decent&amp;quot; people thing. I&amp;#39;m just being honest here, but if my Sister and her Husband came over with her baby and I was teasing my Sister while pretending to look at the baby and said something like &amp;quot;Too bad you didn&amp;#39;t luck out in the Mommy department!&amp;quot; (which would totally be something I would say and my Sister would find this funny and laugh.) so we have a good laugh about it and then her Husband comes up to me and says he doesn&amp;#39;t like me talking like that in front of a 5 month old baby and could I please not do that? I&amp;#39;m not going to lie, it would irritate the heck out of me and question my relationship with him, for sure. Maybe that makes me a bad, indecent person, I don&amp;#39;t know. Now, if we were talking about a 3 year old, it would be a different situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4hfvl", "score_hidden": false, "stickied": false, "created": 1491956223.0, "created_utc": 1491927423.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg450fe", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "biglebowski55", "parent_id": "t1_dg44erw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Right. You say it's happened twice, but they are two separate people. Each has made one isolated comment. Speak up if it becomes a pattern and explain why it bothers you. \n\nEdit: Many people will also say things to a 5 month old that they wouldn't say to a child they believed to be old enough to understand them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right. You say it&amp;#39;s happened twice, but they are two separate people. Each has made one isolated comment. Speak up if it becomes a pattern and explain why it bothers you. &lt;/p&gt;\n\n&lt;p&gt;Edit: Many people will also say things to a 5 month old that they wouldn&amp;#39;t say to a child they believed to be old enough to understand them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg450fe", "score_hidden": false, "stickied": false, "created": 1491939485.0, "created_utc": 1491910685.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44erw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "BubbaDawgg", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "If you are the one offended you need to be the one to say something. Just tell them in the moment (if it happens again). \"MIL/SIL I do not find those jokes very funny, please do not talk like that around LO\". If they are decent people that should be all that's needed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are the one offended you need to be the one to say something. Just tell them in the moment (if it happens again). &amp;quot;MIL/SIL I do not find those jokes very funny, please do not talk like that around LO&amp;quot;. If they are decent people that should be all that&amp;#39;s needed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg44erw", "score_hidden": false, "stickied": false, "created": 1491938098.0, "created_utc": 1491909298.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4wdzt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Love_asweetbooty", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "Let it go. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let it go. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4wdzt", "score_hidden": false, "stickied": false, "created": 1491972521.0, "created_utc": 1491943721.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4eeqt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "niako", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "Right now it seems pretty harmless since your husband doesn't mind and your child is so young. Once your child does start to understand more, I feel like your husband will put a stop to it if it effects his relationship with his child. I think it's one of those things that'll fix itself if you wait.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right now it seems pretty harmless since your husband doesn&amp;#39;t mind and your child is so young. Once your child does start to understand more, I feel like your husband will put a stop to it if it effects his relationship with his child. I think it&amp;#39;s one of those things that&amp;#39;ll fix itself if you wait.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4eeqt", "score_hidden": false, "stickied": false, "created": 1491952879.0, "created_utc": 1491924079.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg4nt72", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SeaSickPirate", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "pick your battles, let this one slide until your child is old enough where it matter, it might stop naturally. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;pick your battles, let this one slide until your child is old enough where it matter, it might stop naturally. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4nt72", "score_hidden": false, "stickied": false, "created": 1491963184.0, "created_utc": 1491934384.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg51tt9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nikita46", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I would never directly confront my husband's family directly.  Its his family and its his responsibility.  To me, that's an absolute recipe for conflict.\n\nI wouldn't be ok with my husband confronting my family members either. \n\nYou guys need to work out something so that he's on your side.  You need to reach an agreement with him and he needs to deal with it because otherwise, you'll not only cause arguments with them but between the two of you.  If he's not on your side, you'll force him into a decision about who he sides with and that's not really fair.\nBy the way, you're making a mountain out of a molehill.  Going forward with a child, you'll have MUCH bigger fish to fry.  It seems a little controlling that you're trying to school these people on how to talk.  I would find someone telling me how to express myself offensive and probably tell them to go pound sand.\nUnnecessary conflict.  Let other people be who they are...just because they don't say or do things they way you do doesn't make you superior to them in any way.  They're just different.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would never directly confront my husband&amp;#39;s family directly.  Its his family and its his responsibility.  To me, that&amp;#39;s an absolute recipe for conflict.&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t be ok with my husband confronting my family members either. &lt;/p&gt;\n\n&lt;p&gt;You guys need to work out something so that he&amp;#39;s on your side.  You need to reach an agreement with him and he needs to deal with it because otherwise, you&amp;#39;ll not only cause arguments with them but between the two of you.  If he&amp;#39;s not on your side, you&amp;#39;ll force him into a decision about who he sides with and that&amp;#39;s not really fair.\nBy the way, you&amp;#39;re making a mountain out of a molehill.  Going forward with a child, you&amp;#39;ll have MUCH bigger fish to fry.  It seems a little controlling that you&amp;#39;re trying to school these people on how to talk.  I would find someone telling me how to express myself offensive and probably tell them to go pound sand.\nUnnecessary conflict.  Let other people be who they are...just because they don&amp;#39;t say or do things they way you do doesn&amp;#39;t make you superior to them in any way.  They&amp;#39;re just different.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg51tt9", "score_hidden": false, "stickied": false, "created": 1491979168.0, "created_utc": 1491950368.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg5r955", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ink_puppy", "parent_id": "t1_dg5r0nm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I didn't really see what mil fil and sil were doing as mean.  It seemed playful and like they were trying to treat her like family but I agree if the intent was to hurt her feelings that's not oki.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I didn&amp;#39;t really see what mil fil and sil were doing as mean.  It seemed playful and like they were trying to treat her like family but I agree if the intent was to hurt her feelings that&amp;#39;s not oki.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5r955", "score_hidden": false, "stickied": false, "created": 1492026528.0, "created_utc": 1491997728.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5r0nm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "handsofanautomaton", "parent_id": "t1_dg53uww", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My kid is great with sarcasm. And yet we never be mean to each other as in the OP. \n\nThe biggest problem we ran into was an auntie who likes to fake threaten shit all the time, and while kiddo was sensitive about something teased her and told her she wouldn't be welcome at their house anymore.  Which did upset my kid a lot - they talked it out but that aunty doesn't make it to the trusted adult list for my kid any more either. And is all sad and salty about it like it isn't her own fault for giving a 7 year old shit for something they have no control over and are sensitive about.\n\nWhen there is only sarcasm, no sincerity, or only sincerity for their feels, that is a problem. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My kid is great with sarcasm. And yet we never be mean to each other as in the OP. &lt;/p&gt;\n\n&lt;p&gt;The biggest problem we ran into was an auntie who likes to fake threaten shit all the time, and while kiddo was sensitive about something teased her and told her she wouldn&amp;#39;t be welcome at their house anymore.  Which did upset my kid a lot - they talked it out but that aunty doesn&amp;#39;t make it to the trusted adult list for my kid any more either. And is all sad and salty about it like it isn&amp;#39;t her own fault for giving a 7 year old shit for something they have no control over and are sensitive about.&lt;/p&gt;\n\n&lt;p&gt;When there is only sarcasm, no sincerity, or only sincerity for their feels, that is a problem. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5r0nm", "score_hidden": false, "stickied": false, "created": 1492026028.0, "created_utc": 1491997228.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg53uww", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ink_puppy", "parent_id": "t1_dg4uj62", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Most little kids I know already understand sarcasm so likely itll go the other way and her kid will just be getting her feelings hurt over jokes  and have trouble making friends", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most little kids I know already understand sarcasm so likely itll go the other way and her kid will just be getting her feelings hurt over jokes  and have trouble making friends&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg53uww", "score_hidden": false, "stickied": false, "created": 1491981876.0, "created_utc": 1491953076.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4uj62", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "devaldogz", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "Address it.  The child will learn to communicate with sarcasm and that doesn't work well when playing with other kids.  It can turn into teasing which they think is playing, but it hurts the other kids.  Follow your gut Mom...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Address it.  The child will learn to communicate with sarcasm and that doesn&amp;#39;t work well when playing with other kids.  It can turn into teasing which they think is playing, but it hurts the other kids.  Follow your gut Mom...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4uj62", "score_hidden": false, "stickied": false, "created": 1491970447.0, "created_utc": 1491941647.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dg53o70", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Twoundertwotwo", "parent_id": "t1_dg4cntl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I feel like all the replies are 100% opposite of what I would have expected from this sub too. Yikes. See ya at justnomil! ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like all the replies are 100% opposite of what I would have expected from this sub too. Yikes. See ya at justnomil! ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg53o70", "score_hidden": false, "stickied": false, "created": 1491981624.0, "created_utc": 1491952824.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4cntl", "gilded": 0, "archived": false, "score": -13, "report_reasons": null, "author": "auriem", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "/r/JUSTNOMIL   Join us...\n\nMy MIL is horrible for this. I've dealt with it by feigning ignorance every time and asking her to explain what she means. When she says it's \"just a joke\", i explain that jokes are meant to be funny and there is nothing funny about her belittling my wife/family.  She usually gets all CBF (cat butt face) and leaves shortly, so win win for us.\n\n\nedit - wow, lot of in laws frequent this subreddit ?  I would have thought that standing up to emotional abuse would be seen as a good thing in /r/Parenting ", "edited": 1492014028.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/JUSTNOMIL\"&gt;/r/JUSTNOMIL&lt;/a&gt;   Join us...&lt;/p&gt;\n\n&lt;p&gt;My MIL is horrible for this. I&amp;#39;ve dealt with it by feigning ignorance every time and asking her to explain what she means. When she says it&amp;#39;s &amp;quot;just a joke&amp;quot;, i explain that jokes are meant to be funny and there is nothing funny about her belittling my wife/family.  She usually gets all CBF (cat butt face) and leaves shortly, so win win for us.&lt;/p&gt;\n\n&lt;p&gt;edit - wow, lot of in laws frequent this subreddit ?  I would have thought that standing up to emotional abuse would be seen as a good thing in &lt;a href=\"/r/Parenting\"&gt;/r/Parenting&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4cntl", "score_hidden": false, "stickied": false, "created": 1491950897.0, "created_utc": 1491922097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64q1nl", "likes": null, "replies": "", "user_reports": [], "id": "dgd1z46", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Aurelia72", "parent_id": "t3_64q1nl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Your comments here make it pretty clear that you made the decision that you're in the right before even posting this...that's unfortunate.  My parents could be oversensitive as well, I didn't see it as a way of love of defending me -- I found it alienating.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your comments here make it pretty clear that you made the decision that you&amp;#39;re in the right before even posting this...that&amp;#39;s unfortunate.  My parents could be oversensitive as well, I didn&amp;#39;t see it as a way of love of defending me -- I found it alienating.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgd1z46", "score_hidden": false, "stickied": false, "created": 1492428998.0, "created_utc": 1492400198.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]