[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A little background:\nMy son&amp;#39;s dad and I split up almost 7 years ago. Because we were never married, sole physical custody defaulted to me, therefore I was granted monthly child support. I&amp;#39;ve been raising our son, mostly alone, for the last 7 years, and my ex still thinks that I am selfish for accepting the monetary support that was granted to me by the court, despite his being entirely unavailable as a parent. \nMy ex lives 100 miles away has never been able or willing to adhere to any kind of schedule with our son. It&amp;#39;s always been an at his convenience type of situation. We try to have an every other weekend schedule, but time and time and time again, my ex has bailed, or changed plans last minute, sometimes going months without seeing my son, usually because he has to work or has something going on with his family or wife&amp;#39;s family that make it too inconvenient. Over the years my son has been treated like an option. He now views the time he spends with his dad as optional.\nMy ex has never come to sporting events or school events, he didn&amp;#39;t come to the hospital when my son had his tonsils and adenoids taken out, because he &amp;quot;had to work.&amp;quot; (According to him, he has to work so much to support his family because the amount he pays me in child support is extortion and makes it impossible for him to provide off of his one job. Also, his wife doesn&amp;#39;t work.)\nA couple of months ago my son&amp;#39;s step mom and their 3 other kids went out of state to visit family. My ex wasn&amp;#39;t able to go, but he told our son that they would be able to spend time together, just the two of them, while the others were away. My son was so excited. He told all of his teachers about it, he told his friends. It&amp;#39;s probably been close to 5 years since he has had any one on one time with his dad, and it was a big deal to him. Two days before my ex was supposed to pick up our son, he called to say that he couldn&amp;#39;t take him, and I was the one who had to break the news. For the first time, ever, instead of defending his dad, my son&amp;#39;s lip began to quiver and he struggled to deal with his emotions. He was hurt and he was angry. I refuse to make excuses for his dad&amp;#39;s behavior and I always try to validate his emotions. His dad thinks that this is inappropriate.\nSince then, my son has been pretty indifferent to spending time with his dad.\nYesterday my ex texted me to see if he could have our son for Easter, (less than a week away!)which I had no problem with, but my son told me that he would rather spend time with me. I&amp;#39;ve been really trying to encourage my son to speak openly to his dad about his feelings, but whenever he tries, his dad completely shuts him down. Last night, my son was trying to tell his dad that he wanted to stay home for Easter, and my ex told him that he &amp;quot;didn&amp;#39;t have a choice.&amp;quot;\nWell, I say that my son DOES have a choice and my ex says that our son isn&amp;#39;t old enough to make the decision and we have to make the decision for him.\nGuys, my ex is an abusive ass hole. I&amp;#39;ve done everything in my power to facilitate their relationship, but the older my son gets, the less inclined I am to do so. I see the same manipulation I endured being used on my child and it&amp;#39;s absolutely enraging. \nMy son feels comfortable talking to me about his feelings, about how he wishes his dad and his step mom would get divorced, and that he misses the way his dad was before he got married. He tells me that his dad and step mom fight a lot and swear at eachother a lot. He says he can&amp;#39;t talk to his dad because he can&amp;#39;t trust him. Whenever I&amp;#39;ve confronted my ex about the things my son tells me, he tells me I am baby-ing my son and that these are just facts of life that he has to learn to deal with. I try to represent my son&amp;#39;s emotions when he isn&amp;#39;t able tk, but my ex takes it as a personal affront and completely berates me, time and time and time again. \nI know that I&amp;#39;m doing the right thing. My son is my first priority. If I have to be the shield and take the abuse, then I will. But at what point to I draw the line? I have a lawyer. My ex and I both know that he has no legal recourse and he&amp;#39;s just so angry about his lack of control over me and our son. He regularly tells me he doesn&amp;#39;t respect my parenting decisions and it&amp;#39;s only a matter of time before our son realizes how toxic I am.\nI have been through therapy to deal with some of the PTSD I&amp;#39;ve experienced as a result of our relationship, but I still become crippled by his attacks, though I&amp;#39;m strong enough to stand up to him now, instead of cowering or conceding, and he HATES me for it. Last night he told me, &amp;quot;You make me sick.&amp;quot; I found it ironic considering that he literally makes me sick.&lt;/p&gt;\n\n&lt;p&gt;Also, my ex refuses to go to court for a parenting agreement. He once wrote up his &amp;quot;terms&amp;quot; and sent them to my lawyer. (Basically, he wants to have 50/50 custody on paper. Because of our difference in location, it&amp;#39;s impossible for us to have 50/50. His motive is to eliminate child support, not spend more time with our son.) His terms were so outlandish that my lawyer told me he could not even dignify it with a response and that no judge would ever sign off on it. &lt;/p&gt;\n\n&lt;p&gt;TL;DR - My 8 year old son doesn&amp;#39;t always want to spend time with his dad. I refuse to force him. Does anyone think it&amp;#39;s ok to force a child to spend time with a parent if they don&amp;#39;t want to, if the reasons are valid?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A little background:\nMy son's dad and I split up almost 7 years ago. Because we were never married, sole physical custody defaulted to me, therefore I was granted monthly child support. I've been raising our son, mostly alone, for the last 7 years, and my ex still thinks that I am selfish for accepting the monetary support that was granted to me by the court, despite his being entirely unavailable as a parent. \nMy ex lives 100 miles away has never been able or willing to adhere to any kind of schedule with our son. It's always been an at his convenience type of situation. We try to have an every other weekend schedule, but time and time and time again, my ex has bailed, or changed plans last minute, sometimes going months without seeing my son, usually because he has to work or has something going on with his family or wife's family that make it too inconvenient. Over the years my son has been treated like an option. He now views the time he spends with his dad as optional.\nMy ex has never come to sporting events or school events, he didn't come to the hospital when my son had his tonsils and adenoids taken out, because he \"had to work.\" (According to him, he has to work so much to support his family because the amount he pays me in child support is extortion and makes it impossible for him to provide off of his one job. Also, his wife doesn't work.)\nA couple of months ago my son's step mom and their 3 other kids went out of state to visit family. My ex wasn't able to go, but he told our son that they would be able to spend time together, just the two of them, while the others were away. My son was so excited. He told all of his teachers about it, he told his friends. It's probably been close to 5 years since he has had any one on one time with his dad, and it was a big deal to him. Two days before my ex was supposed to pick up our son, he called to say that he couldn't take him, and I was the one who had to break the news. For the first time, ever, instead of defending his dad, my son's lip began to quiver and he struggled to deal with his emotions. He was hurt and he was angry. I refuse to make excuses for his dad's behavior and I always try to validate his emotions. His dad thinks that this is inappropriate.\nSince then, my son has been pretty indifferent to spending time with his dad.\nYesterday my ex texted me to see if he could have our son for Easter, (less than a week away!)which I had no problem with, but my son told me that he would rather spend time with me. I've been really trying to encourage my son to speak openly to his dad about his feelings, but whenever he tries, his dad completely shuts him down. Last night, my son was trying to tell his dad that he wanted to stay home for Easter, and my ex told him that he \"didn't have a choice.\"\nWell, I say that my son DOES have a choice and my ex says that our son isn't old enough to make the decision and we have to make the decision for him.\nGuys, my ex is an abusive ass hole. I've done everything in my power to facilitate their relationship, but the older my son gets, the less inclined I am to do so. I see the same manipulation I endured being used on my child and it's absolutely enraging. \nMy son feels comfortable talking to me about his feelings, about how he wishes his dad and his step mom would get divorced, and that he misses the way his dad was before he got married. He tells me that his dad and step mom fight a lot and swear at eachother a lot. He says he can't talk to his dad because he can't trust him. Whenever I've confronted my ex about the things my son tells me, he tells me I am baby-ing my son and that these are just facts of life that he has to learn to deal with. I try to represent my son's emotions when he isn't able tk, but my ex takes it as a personal affront and completely berates me, time and time and time again. \nI know that I'm doing the right thing. My son is my first priority. If I have to be the shield and take the abuse, then I will. But at what point to I draw the line? I have a lawyer. My ex and I both know that he has no legal recourse and he's just so angry about his lack of control over me and our son. He regularly tells me he doesn't respect my parenting decisions and it's only a matter of time before our son realizes how toxic I am.\nI have been through therapy to deal with some of the PTSD I've experienced as a result of our relationship, but I still become crippled by his attacks, though I'm strong enough to stand up to him now, instead of cowering or conceding, and he HATES me for it. Last night he told me, \"You make me sick.\" I found it ironic considering that he literally makes me sick.\n\nAlso, my ex refuses to go to court for a parenting agreement. He once wrote up his \"terms\" and sent them to my lawyer. (Basically, he wants to have 50/50 custody on paper. Because of our difference in location, it's impossible for us to have 50/50. His motive is to eliminate child support, not spend more time with our son.) His terms were so outlandish that my lawyer told me he could not even dignify it with a response and that no judge would ever sign off on it. \n\nTL;DR - My 8 year old son doesn't always want to spend time with his dad. I refuse to force him. Does anyone think it's ok to force a child to spend time with a parent if they don't want to, if the reasons are valid?\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Co-parenting", "id": "64r79u", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 59, "report_reasons": null, "author": "SassafrassMcGee", "saved": false, "mod_reports": [], "name": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "co-parenting", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/64r79u/my_8_year_old_son_doesnt_want_to_spend_time_with/", "num_reports": null, "locked": false, "stickied": false, "created": 1491950235.0, "url": "https://www.reddit.com/r/Parenting/comments/64r79u/my_8_year_old_son_doesnt_want_to_spend_time_with/", "author_flair_text": null, "quarantine": false, "title": "My 8 year old son doesn't want to spend time with his dad. His dad wants me to force him.", "created_utc": 1491921435.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 54, "visited": false, "subreddit_type": "public", "ups": 59}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg5daq2", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "pixikins78", "parent_id": "t1_dg4g477", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I guess he'll \"just have to learn to deal with it,\" to use his words.  ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess he&amp;#39;ll &amp;quot;just have to learn to deal with it,&amp;quot; to use his words.  ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5daq2", "score_hidden": false, "stickied": false, "created": 1491994465.0, "created_utc": 1491965665.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg5t57h", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "istara", "parent_id": "t1_dg4g477", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Just in case, get documenting everything.  Keep copies of all correspondence related to planned trips as well as their cancellation. Note down phone call times etc as well.\n\nJust in case your ex decides to play dirty out of spite or some attempt to stop paying support.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just in case, get documenting everything.  Keep copies of all correspondence related to planned trips as well as their cancellation. Note down phone call times etc as well.&lt;/p&gt;\n\n&lt;p&gt;Just in case your ex decides to play dirty out of spite or some attempt to stop paying support.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5t57h", "score_hidden": false, "stickied": false, "created": 1492030045.0, "created_utc": 1492001245.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4g477", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4g2mu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You're absolutely right. \nTough noogies for him!! :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re absolutely right. \nTough noogies for him!! :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4g477", "score_hidden": false, "stickied": false, "created": 1491954768.0, "created_utc": 1491925968.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4g2mu", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "your_moms_a_clone", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt;Also, my ex refuses to go to court for a parenting agreement. \n\nTough noogies for him. If he doesn't want to get the court involved, and your son doesn't want to see him, he doesn't get to see him. You're either a father or you're not; this canceling on him at the last minute is doing more harm than not having a father at all. He's abusive and you said it yourself: your most important duty is to protect your son. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Also, my ex refuses to go to court for a parenting agreement. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Tough noogies for him. If he doesn&amp;#39;t want to get the court involved, and your son doesn&amp;#39;t want to see him, he doesn&amp;#39;t get to see him. You&amp;#39;re either a father or you&amp;#39;re not; this canceling on him at the last minute is doing more harm than not having a father at all. He&amp;#39;s abusive and you said it yourself: your most important duty is to protect your son. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4g2mu", "score_hidden": false, "stickied": false, "created": 1491954720.0, "created_utc": 1491925920.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 56}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg4elng", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4dxg9", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you so much for this response! This is EXACTLY the situation.\nHis step mom is not kind to him. He often gets stuck watching his younger brothers. A lot of the time he's at his dad's, his dad isn't even there, and when he is, he's busy doing other things around the house or taking care of the kids. My son just kind of falls to the wayside. When he tries to talk to his dad about it, his dad completely invalidates his feelings. Instead of saying something like, \"I understand that this is hard for you,\" he says things like, \"Too bad, you just have to deal with it.\"\nMy son is just starting to become aware that his dad's choices have continually left him as a second or third priority. Up until a few months ago, when his dad would cancel, he'd say, \"It's ok. I know he has to work. He's just really busy.\" But something changed this last time. He wrote a poem about it at school that he showed me, and he talks to me about it, but his dad REFUSES to acknowledge that my son's feelings are valid. In fact, he thinks that I'm poisoning my son against him when I have done SO MUCH to try and avoid that. \nThe other thing is, his dad never calls him. When they don't see each other, they don't speak, and when he's at his dad's, his dad won't allow him to call me, which I also think is quite abusive. I added hangouts on my son's tablet so that when he goes to dad's we can chat if he wants to and his dad forbade it. He told me that he feels like I'm trying to impose on their time together, and keep track of them, which isn't the case at all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for this response! This is EXACTLY the situation.\nHis step mom is not kind to him. He often gets stuck watching his younger brothers. A lot of the time he&amp;#39;s at his dad&amp;#39;s, his dad isn&amp;#39;t even there, and when he is, he&amp;#39;s busy doing other things around the house or taking care of the kids. My son just kind of falls to the wayside. When he tries to talk to his dad about it, his dad completely invalidates his feelings. Instead of saying something like, &amp;quot;I understand that this is hard for you,&amp;quot; he says things like, &amp;quot;Too bad, you just have to deal with it.&amp;quot;\nMy son is just starting to become aware that his dad&amp;#39;s choices have continually left him as a second or third priority. Up until a few months ago, when his dad would cancel, he&amp;#39;d say, &amp;quot;It&amp;#39;s ok. I know he has to work. He&amp;#39;s just really busy.&amp;quot; But something changed this last time. He wrote a poem about it at school that he showed me, and he talks to me about it, but his dad REFUSES to acknowledge that my son&amp;#39;s feelings are valid. In fact, he thinks that I&amp;#39;m poisoning my son against him when I have done SO MUCH to try and avoid that. \nThe other thing is, his dad never calls him. When they don&amp;#39;t see each other, they don&amp;#39;t speak, and when he&amp;#39;s at his dad&amp;#39;s, his dad won&amp;#39;t allow him to call me, which I also think is quite abusive. I added hangouts on my son&amp;#39;s tablet so that when he goes to dad&amp;#39;s we can chat if he wants to and his dad forbade it. He told me that he feels like I&amp;#39;m trying to impose on their time together, and keep track of them, which isn&amp;#39;t the case at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4elng", "score_hidden": false, "stickied": false, "created": 1491953086.0, "created_utc": 1491924286.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dxg9", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "Carrot_fan", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "What a lousy situation for your son. His dad doesn't have him on his priority list at all. \nI'm a kid of divorced parents, and my mom tried to force us to see our dad according to the schedule they'd agreed.\nIt was quite clear that we were just a nuisance to him sometimes, and he would also make commitments and cancel at the last minute or just not show up.\nAt 8, he probably knows that his dad isn't that committed to him, and if the time he spends over there isn't even nice (half-siblings he likes or his stepmom being nice to him, his dad making some extra effort to spend time with him), why should he keep putting himself out there just to be ignored or shut down?\n\nMaybe after the disappointment of being stood up when he was promised one-on-one time, he decided that he wouldn't let himself get hurt like that again. \nIt's a good mechanism for a kid to have. If you're not nice to me, I don't want to spend time with you.\n\nMaybe keep him home for a while and have him Skype/call his dad instead of physically going over there. His dad will have to make an effort to talk to him regularly. Then, if your son's comfort level increases (if dad gets his head out of his ass, which seems unlikely), he can go for another visit.\n\nI wouldn't force my kid. It really sucks to be somewhere where you're not wanted, even as a kid.\n\nIt sounds like you're doing a good job trying to balance your kids needs and keeping your own experiences with your ex out of the equation.\n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a lousy situation for your son. His dad doesn&amp;#39;t have him on his priority list at all. \nI&amp;#39;m a kid of divorced parents, and my mom tried to force us to see our dad according to the schedule they&amp;#39;d agreed.\nIt was quite clear that we were just a nuisance to him sometimes, and he would also make commitments and cancel at the last minute or just not show up.\nAt 8, he probably knows that his dad isn&amp;#39;t that committed to him, and if the time he spends over there isn&amp;#39;t even nice (half-siblings he likes or his stepmom being nice to him, his dad making some extra effort to spend time with him), why should he keep putting himself out there just to be ignored or shut down?&lt;/p&gt;\n\n&lt;p&gt;Maybe after the disappointment of being stood up when he was promised one-on-one time, he decided that he wouldn&amp;#39;t let himself get hurt like that again. \nIt&amp;#39;s a good mechanism for a kid to have. If you&amp;#39;re not nice to me, I don&amp;#39;t want to spend time with you.&lt;/p&gt;\n\n&lt;p&gt;Maybe keep him home for a while and have him Skype/call his dad instead of physically going over there. His dad will have to make an effort to talk to him regularly. Then, if your son&amp;#39;s comfort level increases (if dad gets his head out of his ass, which seems unlikely), he can go for another visit.&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t force my kid. It really sucks to be somewhere where you&amp;#39;re not wanted, even as a kid.&lt;/p&gt;\n\n&lt;p&gt;It sounds like you&amp;#39;re doing a good job trying to balance your kids needs and keeping your own experiences with your ex out of the equation.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4dxg9", "score_hidden": false, "stickied": false, "created": 1491952345.0, "created_utc": 1491923545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg4opxv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4o5c3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't have a ton of support in my life and I just needed reassurance. I LOGICALLY know why he behaves this way. I LOGICALLY know that he is mentally ill. I LOGICALLY know that I have been a scapegoat for all of his problems since even before we broke up. But the emotional experience is always the same for me. I am terrible with dealing with conflict, I always have been. I've gone to great measure to get stronger and handle stress better, but because our relationship was so dysfunctional for so long, I still struggle with getting sucked back into his manipulation. \n\nLuckily I'm strong enough to stand up to him now, even when it's hard. I used to just cave in and give him his way. He got used to that, so having me be strong and empowered and refuse to back down has been difficult for him to handle. I think that's probably why his attacks have gotten worse and worse. \n\nI honestly believe that he believes that he is right and I am wrong. It's much easier to blame me than to do a little soul searching and acknowledge that maybe it's his fault his own son doesn't want to spend time with him. Had he ever, since we broke up, made an effort to be more present in our son's life, I would have been much more willing to at least consider his perspective. But I truly believe that if he wants a say about HOW our son is parented, he needs to actually **do** more parenting. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have a ton of support in my life and I just needed reassurance. I LOGICALLY know why he behaves this way. I LOGICALLY know that he is mentally ill. I LOGICALLY know that I have been a scapegoat for all of his problems since even before we broke up. But the emotional experience is always the same for me. I am terrible with dealing with conflict, I always have been. I&amp;#39;ve gone to great measure to get stronger and handle stress better, but because our relationship was so dysfunctional for so long, I still struggle with getting sucked back into his manipulation. &lt;/p&gt;\n\n&lt;p&gt;Luckily I&amp;#39;m strong enough to stand up to him now, even when it&amp;#39;s hard. I used to just cave in and give him his way. He got used to that, so having me be strong and empowered and refuse to back down has been difficult for him to handle. I think that&amp;#39;s probably why his attacks have gotten worse and worse. &lt;/p&gt;\n\n&lt;p&gt;I honestly believe that he believes that he is right and I am wrong. It&amp;#39;s much easier to blame me than to do a little soul searching and acknowledge that maybe it&amp;#39;s his fault his own son doesn&amp;#39;t want to spend time with him. Had he ever, since we broke up, made an effort to be more present in our son&amp;#39;s life, I would have been much more willing to at least consider his perspective. But I truly believe that if he wants a say about HOW our son is parented, he needs to actually &lt;strong&gt;do&lt;/strong&gt; more parenting. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4opxv", "score_hidden": false, "stickied": false, "created": 1491964189.0, "created_utc": 1491935389.0, "depth": 9, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4o5c3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t1_dg4mvk6", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Well good on you for having adult, mature conversations about his feelings and encouraging him to be open with you. One of the best signs that a kid (or anyone, for that matter) is being raised right is their ability to communicate and articulate about how they're feeling at a young age in a calm, mature manner. So I'm really glad to hear that. And it's good you're giving him little lessons on how some people aren't perfect. I'd keep him informed should things go south and your ex takes the nuclear option, but obviously don't badmouth your ex for the obvious reasons. Keep things relatively neutral when talking about him should your son ask about things. Objective and honest, but neutral. Again, you seem to know that.\n\nThe documentation he said/she said thing...it's true that it's not hard, solid evidence in the court of law... but should the worst come to pass - your husband demands forced visitation or custody against your son's wishes at that time, and your son is called up to that stand to state his preferences and experiences at both homes before the judge, if his story lines up with your notes, it lends credibility to what your son is saying and your point of view, and will make the judge more likely to give more weight to what your son says. Thus, the odds of a favorable outcome will increase.\n\nHonestly, you sound like you're handling things superbly. Why'd you even come here? You don't need us :P\n\nIf you just keep handling things with your kid like you have been and document, I honestly can't see an outcome where your ex going to court works out well for him. Your son is obviously much closer to you, in any event. It will likely end badly for him at worst, change nothing at best. So try not worry too much. One step at a time. I wish you luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well good on you for having adult, mature conversations about his feelings and encouraging him to be open with you. One of the best signs that a kid (or anyone, for that matter) is being raised right is their ability to communicate and articulate about how they&amp;#39;re feeling at a young age in a calm, mature manner. So I&amp;#39;m really glad to hear that. And it&amp;#39;s good you&amp;#39;re giving him little lessons on how some people aren&amp;#39;t perfect. I&amp;#39;d keep him informed should things go south and your ex takes the nuclear option, but obviously don&amp;#39;t badmouth your ex for the obvious reasons. Keep things relatively neutral when talking about him should your son ask about things. Objective and honest, but neutral. Again, you seem to know that.&lt;/p&gt;\n\n&lt;p&gt;The documentation he said/she said thing...it&amp;#39;s true that it&amp;#39;s not hard, solid evidence in the court of law... but should the worst come to pass - your husband demands forced visitation or custody against your son&amp;#39;s wishes at that time, and your son is called up to that stand to state his preferences and experiences at both homes before the judge, if his story lines up with your notes, it lends credibility to what your son is saying and your point of view, and will make the judge more likely to give more weight to what your son says. Thus, the odds of a favorable outcome will increase.&lt;/p&gt;\n\n&lt;p&gt;Honestly, you sound like you&amp;#39;re handling things superbly. Why&amp;#39;d you even come here? You don&amp;#39;t need us :P&lt;/p&gt;\n\n&lt;p&gt;If you just keep handling things with your kid like you have been and document, I honestly can&amp;#39;t see an outcome where your ex going to court works out well for him. Your son is obviously much closer to you, in any event. It will likely end badly for him at worst, change nothing at best. So try not worry too much. One step at a time. I wish you luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4o5c3", "score_hidden": false, "stickied": false, "created": 1491963558.0, "created_utc": 1491934758.0, "depth": 8, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mvk6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4marn", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That's pretty much where we're at. I always try to keep lines of communication open with my son without prying. Usually when he DOES talk about what goes on at his dad's house, it's unprompted. He'll randomly bring it out of the blue while playing legos or coloring or while we're eating dinner, not even talking about his dad at all.\n\nI always ask him how he feels about things and I am so proud of his ability to communicate his feelings so well at such a young age. I will always encourage him to do so, regardless of what his dad says.\n\nAs for the documentation, I'm not sure how well that would hold up since it's basically hearsay and \"he said/she said\" isn't the most reliable form of evidence, but I will definitely make note.\n\nI try not to let my son know how bad it is between his dad and me. Even when I don't agree with his dad, after I validate my son's feelings, I try to put things in perspective. For example, when he tells me that they fight a lot when he's there, I tell him something like: \"I bet it's really hard for you to deal with their fighting all the time, and it's not your fault. Blending families can be very hard because there are different rules and different expectations, and sometimes stress causes people to say and do things they don't really mean.\" I don't want him to think that their behavior is ok, but I want him to understand that we are all imperfect, myself included, and we don't always do the right thing or make the right choices, and that's ok. That's part of being human.\n\nHe has told me before that he's overheard his step mom saying that she doesn't want him there. When I bring it up to my ex, he says that I'm taking it out of context, completely invalidates my concern, and there is no resolution.\n\nBefore last night, it has probably been close to a year since my ex and I had this kind of blow out, and it's always the same. Everything that he brings up is always the same. His refusal to compromise. The same points and counterpoints. Nothing changes and there's never a resolution because he wants to get his way, regardless of the impact on our son.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s pretty much where we&amp;#39;re at. I always try to keep lines of communication open with my son without prying. Usually when he DOES talk about what goes on at his dad&amp;#39;s house, it&amp;#39;s unprompted. He&amp;#39;ll randomly bring it out of the blue while playing legos or coloring or while we&amp;#39;re eating dinner, not even talking about his dad at all.&lt;/p&gt;\n\n&lt;p&gt;I always ask him how he feels about things and I am so proud of his ability to communicate his feelings so well at such a young age. I will always encourage him to do so, regardless of what his dad says.&lt;/p&gt;\n\n&lt;p&gt;As for the documentation, I&amp;#39;m not sure how well that would hold up since it&amp;#39;s basically hearsay and &amp;quot;he said/she said&amp;quot; isn&amp;#39;t the most reliable form of evidence, but I will definitely make note.&lt;/p&gt;\n\n&lt;p&gt;I try not to let my son know how bad it is between his dad and me. Even when I don&amp;#39;t agree with his dad, after I validate my son&amp;#39;s feelings, I try to put things in perspective. For example, when he tells me that they fight a lot when he&amp;#39;s there, I tell him something like: &amp;quot;I bet it&amp;#39;s really hard for you to deal with their fighting all the time, and it&amp;#39;s not your fault. Blending families can be very hard because there are different rules and different expectations, and sometimes stress causes people to say and do things they don&amp;#39;t really mean.&amp;quot; I don&amp;#39;t want him to think that their behavior is ok, but I want him to understand that we are all imperfect, myself included, and we don&amp;#39;t always do the right thing or make the right choices, and that&amp;#39;s ok. That&amp;#39;s part of being human.&lt;/p&gt;\n\n&lt;p&gt;He has told me before that he&amp;#39;s overheard his step mom saying that she doesn&amp;#39;t want him there. When I bring it up to my ex, he says that I&amp;#39;m taking it out of context, completely invalidates my concern, and there is no resolution.&lt;/p&gt;\n\n&lt;p&gt;Before last night, it has probably been close to a year since my ex and I had this kind of blow out, and it&amp;#39;s always the same. Everything that he brings up is always the same. His refusal to compromise. The same points and counterpoints. Nothing changes and there&amp;#39;s never a resolution because he wants to get his way, regardless of the impact on our son.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4mvk6", "score_hidden": false, "stickied": false, "created": 1491962152.0, "created_utc": 1491933352.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4marn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t1_dg4kgl6", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Gotcha. *Fuck*, this is a really hard situation.\n\nIf *I* were you (disclaimer: results may vary), when your son comes back from visits in the future, your son needs to keep you in the loop about the environment at your ex's home, again for documentation purposes in the future. That said, I actually *wouldn't* confront your husband about it unless something happens there that directly involves your son. If your ex and his wife fight a lot in front of him, that's something to talk to your son about because *anything* that involves your kid, even peripherally like being exposed to their hissy fits *is* your business. \n\nBut I wouldn't bring it up with your ex-husband. I'd talk to your son about it alone and just try to comfort him over it. Not because I think you don't have the right to confront him or that your ex is in the right, but so that your son will know that he won't be in trouble for telling you. It's better for you to be aware of what's happening in that house while your son is there and not confront your ex about it, than it is for your son to hide everything that happens there from you for fear of retribution by your ex. \n\nI *would* document his \"reports\" though, again just in case he goes to court. Whether you let your son in on the fact that you're documenting it for court purposes and by proxy, whether you inform your son about your worst case fear and why you're documenting is your prerogative. I honestly *don't* know whether I would tell my kid my fears. I wouldn't want to worry him or look like I was manipulating my kid or anything, but on the other hand something that may affect his life so much should shit hit the fan...I'd have wanted to know when I was eight. And I generally advocate with parents being super open with their kids about everything, since it's worked out great with me in the past. Maybe someone else with more personal experience could chime in?\n\nThat said, you want your son to continue to be open to you about everything: his feelings towards his father's living situation, the environment there, what *he* wants to have happen, whether he wants to keep seeing his father down the line, everything. \n\nIt sounds like you know all this, but don't ever be afraid to simply ask your son how he feels about anything (not just this situation, in general too), and implore on him that his feelings are always valid, his wants and desires are valid, and that you respect his feelings. Even if they don't line up with your own. He may have a therapist, but he needs to know that you're always there to talk with him too and that he can tell you anything and that he'll never be in trouble for telling the truth.\n\nOn the *other* hand, if your son says that, say, your ex was screaming and calling your son horrible names and emotionally abusive or god forbid actually becomes physically abusive or something like that, obviously all bets = off. All the more reason that your son keep giving you reports, so to speak. You want him to tell you if something serious was done to him. And in that case you *do* have the right to confront your ex. Physically and legally, if need be.\n\n**TL;DR** Pick your battles with your ex to keep your son out of the crossfire, but keep having your son tell you everything with you and document it all. How much you get your son in the loop...I honestly don't know what's best.\n\n**EDIT** Words.", "edited": 1491933404.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gotcha. &lt;em&gt;Fuck&lt;/em&gt;, this is a really hard situation.&lt;/p&gt;\n\n&lt;p&gt;If &lt;em&gt;I&lt;/em&gt; were you (disclaimer: results may vary), when your son comes back from visits in the future, your son needs to keep you in the loop about the environment at your ex&amp;#39;s home, again for documentation purposes in the future. That said, I actually &lt;em&gt;wouldn&amp;#39;t&lt;/em&gt; confront your husband about it unless something happens there that directly involves your son. If your ex and his wife fight a lot in front of him, that&amp;#39;s something to talk to your son about because &lt;em&gt;anything&lt;/em&gt; that involves your kid, even peripherally like being exposed to their hissy fits &lt;em&gt;is&lt;/em&gt; your business. &lt;/p&gt;\n\n&lt;p&gt;But I wouldn&amp;#39;t bring it up with your ex-husband. I&amp;#39;d talk to your son about it alone and just try to comfort him over it. Not because I think you don&amp;#39;t have the right to confront him or that your ex is in the right, but so that your son will know that he won&amp;#39;t be in trouble for telling you. It&amp;#39;s better for you to be aware of what&amp;#39;s happening in that house while your son is there and not confront your ex about it, than it is for your son to hide everything that happens there from you for fear of retribution by your ex. &lt;/p&gt;\n\n&lt;p&gt;I &lt;em&gt;would&lt;/em&gt; document his &amp;quot;reports&amp;quot; though, again just in case he goes to court. Whether you let your son in on the fact that you&amp;#39;re documenting it for court purposes and by proxy, whether you inform your son about your worst case fear and why you&amp;#39;re documenting is your prerogative. I honestly &lt;em&gt;don&amp;#39;t&lt;/em&gt; know whether I would tell my kid my fears. I wouldn&amp;#39;t want to worry him or look like I was manipulating my kid or anything, but on the other hand something that may affect his life so much should shit hit the fan...I&amp;#39;d have wanted to know when I was eight. And I generally advocate with parents being super open with their kids about everything, since it&amp;#39;s worked out great with me in the past. Maybe someone else with more personal experience could chime in?&lt;/p&gt;\n\n&lt;p&gt;That said, you want your son to continue to be open to you about everything: his feelings towards his father&amp;#39;s living situation, the environment there, what &lt;em&gt;he&lt;/em&gt; wants to have happen, whether he wants to keep seeing his father down the line, everything. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you know all this, but don&amp;#39;t ever be afraid to simply ask your son how he feels about anything (not just this situation, in general too), and implore on him that his feelings are always valid, his wants and desires are valid, and that you respect his feelings. Even if they don&amp;#39;t line up with your own. He may have a therapist, but he needs to know that you&amp;#39;re always there to talk with him too and that he can tell you anything and that he&amp;#39;ll never be in trouble for telling the truth.&lt;/p&gt;\n\n&lt;p&gt;On the &lt;em&gt;other&lt;/em&gt; hand, if your son says that, say, your ex was screaming and calling your son horrible names and emotionally abusive or god forbid actually becomes physically abusive or something like that, obviously all bets = off. All the more reason that your son keep giving you reports, so to speak. You want him to tell you if something serious was done to him. And in that case you &lt;em&gt;do&lt;/em&gt; have the right to confront your ex. Physically and legally, if need be.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; Pick your battles with your ex to keep your son out of the crossfire, but keep having your son tell you everything with you and document it all. How much you get your son in the loop...I honestly don&amp;#39;t know what&amp;#39;s best.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT&lt;/strong&gt; Words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4marn", "score_hidden": false, "stickied": false, "created": 1491961522.0, "created_utc": 1491932722.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kgl6", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4jj8v", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Not really. This change in his attitude toward all this is relatively recent. He mentions that he wishes his dad still lived in their apartment (where he lived before he met his wife), and that he wishes that he could have time with his dad without everyone else (which his dad believes is unacceptable because it doesn't fit his narrative.) He told me that he wishes his dad and his step mom would get divorced. When I told him that I didn't think that was going to happen he told me, \"But (step mom) wants to! She told my dad when I was there!\"\nWe have gone to therapy, we started a couple of years ago. He's gone alone and we've gone together. I sought out our therapist to make sure that I was doing the best I could for him in this situation, and to make sure I didn't unfairly project my negative feelings about the situation onto my son, and to make sure that I'm not doing any unintentional damage. Our therapist tried to talk to my ex as well to really press the issue of how important it is to have a regular schedule, to have fulfilled expectations and consistency, and my ex said he refuses to be dictated by me. \nBut my son comes home from his dad telling me things about how his dad and step mom fight ALL THE TIME and swear at each other in front of him and it makes him uncomfortable. This has been going on, on and off, for a few years. When I brought it up to my ex and asked him to talk to our son about it, he got mad at our son and told him that what happens at their house is private and that he was wrong to tell me about it. I adamantly disagree with this, and I told my son that he can tell me anything no matter what, and he does. But now he's in a position where if he tells me something that happened at his dad's and I bring it up to his dad, he feels like he's going to be in trouble, which I think is wrong. \nNeedless to say, my ex and I don't agree on anything at all. Not when it comes to life or parenting. This is one of the main reasons that we didn't stay together to begin with.\n", "edited": 1491930900.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not really. This change in his attitude toward all this is relatively recent. He mentions that he wishes his dad still lived in their apartment (where he lived before he met his wife), and that he wishes that he could have time with his dad without everyone else (which his dad believes is unacceptable because it doesn&amp;#39;t fit his narrative.) He told me that he wishes his dad and his step mom would get divorced. When I told him that I didn&amp;#39;t think that was going to happen he told me, &amp;quot;But (step mom) wants to! She told my dad when I was there!&amp;quot;\nWe have gone to therapy, we started a couple of years ago. He&amp;#39;s gone alone and we&amp;#39;ve gone together. I sought out our therapist to make sure that I was doing the best I could for him in this situation, and to make sure I didn&amp;#39;t unfairly project my negative feelings about the situation onto my son, and to make sure that I&amp;#39;m not doing any unintentional damage. Our therapist tried to talk to my ex as well to really press the issue of how important it is to have a regular schedule, to have fulfilled expectations and consistency, and my ex said he refuses to be dictated by me. \nBut my son comes home from his dad telling me things about how his dad and step mom fight ALL THE TIME and swear at each other in front of him and it makes him uncomfortable. This has been going on, on and off, for a few years. When I brought it up to my ex and asked him to talk to our son about it, he got mad at our son and told him that what happens at their house is private and that he was wrong to tell me about it. I adamantly disagree with this, and I told my son that he can tell me anything no matter what, and he does. But now he&amp;#39;s in a position where if he tells me something that happened at his dad&amp;#39;s and I bring it up to his dad, he feels like he&amp;#39;s going to be in trouble, which I think is wrong. \nNeedless to say, my ex and I don&amp;#39;t agree on anything at all. Not when it comes to life or parenting. This is one of the main reasons that we didn&amp;#39;t stay together to begin with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4kgl6", "score_hidden": false, "stickied": false, "created": 1491959513.0, "created_utc": 1491930713.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4jj8v", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t1_dg4gw3l", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Ugh. She sounds like a bundle of joy. \n\nI know /u/AnnaLemma mentioned this (and gave tons of great advice in case this does come to blows in court) below, but I'm echoing it: *document all communications, including texts like that*. Heck, *everything. Document everything.* This includes when you *don't* respond.\n\nIf I may ask, how privy is your son to the precise situation? Obviously he's aware things must be tense between you and your ex, but does he know to what extent? Has he made his opinions known on what *he* would want if this were to go court or get more serious to you? Any hints? I know you said above he wrote a poem, anything else like that? I'm only asking because if he at any point shows an unwillingness to go over his dad's or shows any signs of truly dreading it, that's something to consider documenting in some fashion as well.", "edited": 1491929903.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ugh. She sounds like a bundle of joy. &lt;/p&gt;\n\n&lt;p&gt;I know &lt;a href=\"/u/AnnaLemma\"&gt;/u/AnnaLemma&lt;/a&gt; mentioned this (and gave tons of great advice in case this does come to blows in court) below, but I&amp;#39;m echoing it: &lt;em&gt;document all communications, including texts like that&lt;/em&gt;. Heck, &lt;em&gt;everything. Document everything.&lt;/em&gt; This includes when you &lt;em&gt;don&amp;#39;t&lt;/em&gt; respond.&lt;/p&gt;\n\n&lt;p&gt;If I may ask, how privy is your son to the precise situation? Obviously he&amp;#39;s aware things must be tense between you and your ex, but does he know to what extent? Has he made his opinions known on what &lt;em&gt;he&lt;/em&gt; would want if this were to go court or get more serious to you? Any hints? I know you said above he wrote a poem, anything else like that? I&amp;#39;m only asking because if he at any point shows an unwillingness to go over his dad&amp;#39;s or shows any signs of truly dreading it, that&amp;#39;s something to consider documenting in some fashion as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4jj8v", "score_hidden": false, "stickied": false, "created": 1491958501.0, "created_utc": 1491929701.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gw3l", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4glur", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I agree. She got involved when she was pregnant with their first son and sent me a nasty text attacking me, calling me selfish, etc. I didn't even respond to her and I told my ex to keep her out of it. \nI had no choice when he married her, I had no choice when he decided to have more kids, and even though I completely disagreed with the entire scenario, I kept my mouth shut, because his life is his business. \nShe was a single mother before she married my ex and she didn't get child support because her son's dad is on disability and unable to provide. She thinks she's a superior human because she was able to survive without child support and that I need to \"work harder and work smarter\" instead of \"ruining\" my ex's life. \nIt is complete insanity! But they fuel each other's irrational thoughts and abusive behaviors. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. She got involved when she was pregnant with their first son and sent me a nasty text attacking me, calling me selfish, etc. I didn&amp;#39;t even respond to her and I told my ex to keep her out of it. \nI had no choice when he married her, I had no choice when he decided to have more kids, and even though I completely disagreed with the entire scenario, I kept my mouth shut, because his life is his business. \nShe was a single mother before she married my ex and she didn&amp;#39;t get child support because her son&amp;#39;s dad is on disability and unable to provide. She thinks she&amp;#39;s a superior human because she was able to survive without child support and that I need to &amp;quot;work harder and work smarter&amp;quot; instead of &amp;quot;ruining&amp;quot; my ex&amp;#39;s life. \nIt is complete insanity! But they fuel each other&amp;#39;s irrational thoughts and abusive behaviors. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4gw3l", "score_hidden": false, "stickied": false, "created": 1491955622.0, "created_utc": 1491926822.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4glur", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t1_dg4fo5v", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Like I said, if your son expresses his desire to still see his dad and brothers, that's one thing. Just like your ex needs to respect your kid's wishes to not see him sometimes, it's up to you to do the same if he wants to see his brothers and dad.\n\nSounds like you already understand that though by not cutting him off completely. Again, another sacrifice you make for your kid. You sound like you're handling this very well. Do not question yourself. I don't know the details, extent, or severity of the abuse, but it doesn't really matter: The abuser is the one who is doing something wrong, not you. You've got this.\n\nSide note: I have no idea why your ex's wife is involving herself. Like *at all.* I know this affects her, but it's not her kid in any capacity, and according to you isn't remotely kind or nurturing to him. It would be akin to you wanting to take legal action to spend time with *her kids* when you know you have no right to do so, because it's overreaching. If it's about the child support payment, she knew about that going into this relationship. It should've been a sunk cost for her.\n\nTo put it bluntly: this is none of her fucking business.", "edited": 1491926735.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like I said, if your son expresses his desire to still see his dad and brothers, that&amp;#39;s one thing. Just like your ex needs to respect your kid&amp;#39;s wishes to not see him sometimes, it&amp;#39;s up to you to do the same if he wants to see his brothers and dad.&lt;/p&gt;\n\n&lt;p&gt;Sounds like you already understand that though by not cutting him off completely. Again, another sacrifice you make for your kid. You sound like you&amp;#39;re handling this very well. Do not question yourself. I don&amp;#39;t know the details, extent, or severity of the abuse, but it doesn&amp;#39;t really matter: The abuser is the one who is doing something wrong, not you. You&amp;#39;ve got this.&lt;/p&gt;\n\n&lt;p&gt;Side note: I have no idea why your ex&amp;#39;s wife is involving herself. Like &lt;em&gt;at all.&lt;/em&gt; I know this affects her, but it&amp;#39;s not her kid in any capacity, and according to you isn&amp;#39;t remotely kind or nurturing to him. It would be akin to you wanting to take legal action to spend time with &lt;em&gt;her kids&lt;/em&gt; when you know you have no right to do so, because it&amp;#39;s overreaching. If it&amp;#39;s about the child support payment, she knew about that going into this relationship. It should&amp;#39;ve been a sunk cost for her.&lt;/p&gt;\n\n&lt;p&gt;To put it bluntly: this is none of her fucking business.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4glur", "score_hidden": false, "stickied": false, "created": 1491955306.0, "created_utc": 1491926506.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4fo5v", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4f3w4", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you!\nYou are right.\nI know I'm doing the right thing. Even after years of therapy and trying to break the cycle of abuse, I still get sucked in.\nTo this day, even after all these years, after we have our disagreements, I rake over every word he's sad in my brain, wondering if there is any truth to any of it, and suddenly I find myself unsure if I'm doing the right thing, and questioning myself. Even though I know that I am doing the right thing, the emotional experience is still as if I am crazy, which is why attacking me is one of his favorite emotional tactics. It used to work. It worked while we were together, until he finally broke me and I had to leave. I imagine that it's extremely frustrating for him now that I am not so quick to crumble under the stress of his abuse.\nMy son still wants to see his dad sometimes. He does miss him and he loves his brothers. That's why I haven't completely cut off contact, though I want to, and have wanted to for years. \nI agree whole heartedly that he should be willing to do whatever it takes to be a part of his son's life. In the past, I've driven the 200 miles round trip to drop my son off and 200 miles to pick him up so that he can spend the weekend with his dad.\nI have been prepared to lawyer up since my ex got married and his wife got involved. Before then, he was somewhat rational, but since then, whatever thread of civility we shared has completely unraveled.\nThank you for the support!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!\nYou are right.\nI know I&amp;#39;m doing the right thing. Even after years of therapy and trying to break the cycle of abuse, I still get sucked in.\nTo this day, even after all these years, after we have our disagreements, I rake over every word he&amp;#39;s sad in my brain, wondering if there is any truth to any of it, and suddenly I find myself unsure if I&amp;#39;m doing the right thing, and questioning myself. Even though I know that I am doing the right thing, the emotional experience is still as if I am crazy, which is why attacking me is one of his favorite emotional tactics. It used to work. It worked while we were together, until he finally broke me and I had to leave. I imagine that it&amp;#39;s extremely frustrating for him now that I am not so quick to crumble under the stress of his abuse.\nMy son still wants to see his dad sometimes. He does miss him and he loves his brothers. That&amp;#39;s why I haven&amp;#39;t completely cut off contact, though I want to, and have wanted to for years. \nI agree whole heartedly that he should be willing to do whatever it takes to be a part of his son&amp;#39;s life. In the past, I&amp;#39;ve driven the 200 miles round trip to drop my son off and 200 miles to pick him up so that he can spend the weekend with his dad.\nI have been prepared to lawyer up since my ex got married and his wife got involved. Before then, he was somewhat rational, but since then, whatever thread of civility we shared has completely unraveled.\nThank you for the support!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4fo5v", "score_hidden": false, "stickied": false, "created": 1491954276.0, "created_utc": 1491925476.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4f3w4", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Okay...\n\nOkay.\n\nHopefully I'm not drawing too many conclusions, so if I do, I apologize in advance.\n\nAssuming you aren't legally required to give your son over to your ex as you said? I wouldn't force him too go with his dad, *especially* if he is as manipulative and emotionally abusive as you say he is (and frankly sounds). Kids are more emotionally mature than we give them credit for. At his age, you're right. He *should* have a choice or say in where and who he spends time with and when. \n\nI know at the age of eight, had my parents divorced due to my mom's drug addiction, I would've been furious if I were forced to stay with my mom against my will. She emotionally abused me for five years. I know this story and how it can end if not handled right.\n\nIf an *eight* year old no longer wants to consistently spend time with his dad? Something that practically all kids in normal situations his age die to do? That should tell you enough right there. I mean, you say your ex makes you sick and has given you PTSD from his emotional abuse. From one emotional abuse victim to another: Don't put your son at risk of that. Not unless your ex changes his attitude.\n\nIt doesn't sound like his dad's place is an environment is a great one by your son's own descriptions. That's another thing: what *kid* observes those kinds of dynamics and turns out happier for it? Nobody, your son included. And the fact that your ex's only response to your son bringing up his concerns about them fighting and swearing all of the time and the having to watch his step-siblings on his own and the negative environment is that the son needs to \"get over it?\" and that you need to \"stop babying him\"? When your ex shows absolutely no emotional support for your son's feelings and just invalidates his feelings, he had that kind of audacity?\n\nAre you *kidding* me? \n\nHow does a father who never attended his school/sports events and bails on the weekends and pushing quality time to the side with your son justify that he's now entitled to easter with him? I know he lives far away, but 100 miles is two hours. I drove that distance roundtrip for *work/school* four days/week for years. I drove that distance almost every day, even on my days off, for two years just because I wanted to make sure my god sibling had someone watching him and keeping him company and giving him support since his mom works a ton, often sacrificing sleep, meals, studying, or hours of pay just to do so.\n\nIf I can do that for a kid I'm not even *related* too but love more than just about anything and for *work*, he had *no* excuse not to make the drive a regular thing for a kid that is actually his that he should love as much as his other kids.\n\nHow are you *selfish* for accepting child support payments when that money is used to give your kid the best life you can? I'm sure you've made sacrifices for him as any decent parent does, yet he blows off time with your son and puts his wants, his other family, and desires over the wants of your son, doesn't respect your son's wishes, and *you're* selfish? That's rich.\n\nI'm sorry he feels that his child support is *extortion*. If he *really* cared about his son's wellbeing, he would be *happy* to send some money your way to give him a better life.\n\nYou know what's best for your son, certainly far better than your ex does seeing as you were the one who raised and supported him. Unless a court order forces you to hand him over (and even then, I'd encourage you to fight against that legally by the sounds of it), your husband changes, or your son changes his mind, do not force him to go with your ex. Respect the wishes of your kid. You have a lawyer. He has no legal recourse, but be prepared to lawyer up. Just in case.\n\nOh and for the love of god, sign absolutely *nothing*.\n\n\n\n", "edited": 1491925735.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay...&lt;/p&gt;\n\n&lt;p&gt;Okay.&lt;/p&gt;\n\n&lt;p&gt;Hopefully I&amp;#39;m not drawing too many conclusions, so if I do, I apologize in advance.&lt;/p&gt;\n\n&lt;p&gt;Assuming you aren&amp;#39;t legally required to give your son over to your ex as you said? I wouldn&amp;#39;t force him too go with his dad, &lt;em&gt;especially&lt;/em&gt; if he is as manipulative and emotionally abusive as you say he is (and frankly sounds). Kids are more emotionally mature than we give them credit for. At his age, you&amp;#39;re right. He &lt;em&gt;should&lt;/em&gt; have a choice or say in where and who he spends time with and when. &lt;/p&gt;\n\n&lt;p&gt;I know at the age of eight, had my parents divorced due to my mom&amp;#39;s drug addiction, I would&amp;#39;ve been furious if I were forced to stay with my mom against my will. She emotionally abused me for five years. I know this story and how it can end if not handled right.&lt;/p&gt;\n\n&lt;p&gt;If an &lt;em&gt;eight&lt;/em&gt; year old no longer wants to consistently spend time with his dad? Something that practically all kids in normal situations his age die to do? That should tell you enough right there. I mean, you say your ex makes you sick and has given you PTSD from his emotional abuse. From one emotional abuse victim to another: Don&amp;#39;t put your son at risk of that. Not unless your ex changes his attitude.&lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t sound like his dad&amp;#39;s place is an environment is a great one by your son&amp;#39;s own descriptions. That&amp;#39;s another thing: what &lt;em&gt;kid&lt;/em&gt; observes those kinds of dynamics and turns out happier for it? Nobody, your son included. And the fact that your ex&amp;#39;s only response to your son bringing up his concerns about them fighting and swearing all of the time and the having to watch his step-siblings on his own and the negative environment is that the son needs to &amp;quot;get over it?&amp;quot; and that you need to &amp;quot;stop babying him&amp;quot;? When your ex shows absolutely no emotional support for your son&amp;#39;s feelings and just invalidates his feelings, he had that kind of audacity?&lt;/p&gt;\n\n&lt;p&gt;Are you &lt;em&gt;kidding&lt;/em&gt; me? &lt;/p&gt;\n\n&lt;p&gt;How does a father who never attended his school/sports events and bails on the weekends and pushing quality time to the side with your son justify that he&amp;#39;s now entitled to easter with him? I know he lives far away, but 100 miles is two hours. I drove that distance roundtrip for &lt;em&gt;work/school&lt;/em&gt; four days/week for years. I drove that distance almost every day, even on my days off, for two years just because I wanted to make sure my god sibling had someone watching him and keeping him company and giving him support since his mom works a ton, often sacrificing sleep, meals, studying, or hours of pay just to do so.&lt;/p&gt;\n\n&lt;p&gt;If I can do that for a kid I&amp;#39;m not even &lt;em&gt;related&lt;/em&gt; too but love more than just about anything and for &lt;em&gt;work&lt;/em&gt;, he had &lt;em&gt;no&lt;/em&gt; excuse not to make the drive a regular thing for a kid that is actually his that he should love as much as his other kids.&lt;/p&gt;\n\n&lt;p&gt;How are you &lt;em&gt;selfish&lt;/em&gt; for accepting child support payments when that money is used to give your kid the best life you can? I&amp;#39;m sure you&amp;#39;ve made sacrifices for him as any decent parent does, yet he blows off time with your son and puts his wants, his other family, and desires over the wants of your son, doesn&amp;#39;t respect your son&amp;#39;s wishes, and &lt;em&gt;you&amp;#39;re&lt;/em&gt; selfish? That&amp;#39;s rich.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry he feels that his child support is &lt;em&gt;extortion&lt;/em&gt;. If he &lt;em&gt;really&lt;/em&gt; cared about his son&amp;#39;s wellbeing, he would be &lt;em&gt;happy&lt;/em&gt; to send some money your way to give him a better life.&lt;/p&gt;\n\n&lt;p&gt;You know what&amp;#39;s best for your son, certainly far better than your ex does seeing as you were the one who raised and supported him. Unless a court order forces you to hand him over (and even then, I&amp;#39;d encourage you to fight against that legally by the sounds of it), your husband changes, or your son changes his mind, do not force him to go with your ex. Respect the wishes of your kid. You have a lawyer. He has no legal recourse, but be prepared to lawyer up. Just in case.&lt;/p&gt;\n\n&lt;p&gt;Oh and for the love of god, sign absolutely &lt;em&gt;nothing&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4f3w4", "score_hidden": false, "stickied": false, "created": 1491953651.0, "created_utc": 1491924851.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg5bji6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg5al4e", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It was one of the hardest moments in my parenting experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It was one of the hardest moments in my parenting experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5bji6", "score_hidden": false, "stickied": false, "created": 1491992026.0, "created_utc": 1491963226.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5al4e", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "mexicoeslaonda", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Fuck, I almost cried when I read about your son being excited about one-on-one time with your ex only for him to crush your son's spirit. That is incredibly fucked up", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fuck, I almost cried when I read about your son being excited about one-on-one time with your ex only for him to crush your son&amp;#39;s spirit. That is incredibly fucked up&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5al4e", "score_hidden": false, "stickied": false, "created": 1491990753.0, "created_utc": 1491961953.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg4tjia", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4syao", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I told my ex last night: Our son didn't have a choice when we split up. He didn't have a choice when you got married. He didn't have a choice when you had more kids. He DOES have a choice in this and I will never force him.\n\nBut this is pretty much the same advice I've been given time and time again by friends, family, therapists. \n\nHe's already been advised to direct any discussion of the MONETARY aspects of parenting to my lawyer, which he refused to do, and he plays the victim when it comes to communicating with me regarding any parenting issues. It's futile for us to even discuss parenting because we don't agree on anything. \n\nHe is perfectly aware that I have complete control over whether or not he sees his son (though I've never once said that he can't see our son, other than when my son has expressed to me that he doesn't want to go) and he uses that as an excuse as to why he's not a more present/active father. Arguing with him is completely pointless and I hate that I still allow myself to get sucked into it!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I told my ex last night: Our son didn&amp;#39;t have a choice when we split up. He didn&amp;#39;t have a choice when you got married. He didn&amp;#39;t have a choice when you had more kids. He DOES have a choice in this and I will never force him.&lt;/p&gt;\n\n&lt;p&gt;But this is pretty much the same advice I&amp;#39;ve been given time and time again by friends, family, therapists. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s already been advised to direct any discussion of the MONETARY aspects of parenting to my lawyer, which he refused to do, and he plays the victim when it comes to communicating with me regarding any parenting issues. It&amp;#39;s futile for us to even discuss parenting because we don&amp;#39;t agree on anything. &lt;/p&gt;\n\n&lt;p&gt;He is perfectly aware that I have complete control over whether or not he sees his son (though I&amp;#39;ve never once said that he can&amp;#39;t see our son, other than when my son has expressed to me that he doesn&amp;#39;t want to go) and he uses that as an excuse as to why he&amp;#39;s not a more present/active father. Arguing with him is completely pointless and I hate that I still allow myself to get sucked into it!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4tjia", "score_hidden": false, "stickied": false, "created": 1491969347.0, "created_utc": 1491940547.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4syao", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "lynn", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Don't make your son go over there. He's protecting himself from his father and, as you know, you should protect him too. He depends on you for that.\n\nI'd give the father a shrug and say something like, \"yeah, that's what happens when you break plans with people over and over: they stop wanting to be around you.\" \n\nAnd when he says mean things to you, tell him you're sorry he feels that way. I mean, if he's going to throw a tantrum like a little kid, might as well treat him like a little kid. Then tell him you won't be treated this way and when he's ready to talk calmly and reasonably like an adult, then he can call you back. Bye. *click* Ignore his calls and texts for a few hours and, when you're ready, ask him if he's ready to discuss the issue calmly. If he does so, great, you can have a productive conversation. If he starts in on you again, repeat the process.\n\nHe'll stop berating you one way or another, either because he recognizes that you aren't going to lie down and take it, or because he will be unable to contact you, because if he continues to berate you for too long, you'll make it so that all communication goes through your lawyer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t make your son go over there. He&amp;#39;s protecting himself from his father and, as you know, you should protect him too. He depends on you for that.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d give the father a shrug and say something like, &amp;quot;yeah, that&amp;#39;s what happens when you break plans with people over and over: they stop wanting to be around you.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;And when he says mean things to you, tell him you&amp;#39;re sorry he feels that way. I mean, if he&amp;#39;s going to throw a tantrum like a little kid, might as well treat him like a little kid. Then tell him you won&amp;#39;t be treated this way and when he&amp;#39;s ready to talk calmly and reasonably like an adult, then he can call you back. Bye. &lt;em&gt;click&lt;/em&gt; Ignore his calls and texts for a few hours and, when you&amp;#39;re ready, ask him if he&amp;#39;s ready to discuss the issue calmly. If he does so, great, you can have a productive conversation. If he starts in on you again, repeat the process.&lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;ll stop berating you one way or another, either because he recognizes that you aren&amp;#39;t going to lie down and take it, or because he will be unable to contact you, because if he continues to berate you for too long, you&amp;#39;ll make it so that all communication goes through your lawyer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4syao", "score_hidden": false, "stickied": false, "created": 1491968713.0, "created_utc": 1491939913.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg4m5ih", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4lr1m", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I am 100% on my kid's side.\nMy parents didn't get divorced until I was in my late twenties. As hard as that was, I have absolutely no experience being a young child of divorce. I try to acknowledge that I'm limited by my own ignorance and seek out experiences and opinions of other people to get a handle of how best to deal with the situation. Unfortunately, my ex is adamant that he is right and I am wrong, based on principle alone, no matter what degree I go to to try and prove otherwise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am 100% on my kid&amp;#39;s side.\nMy parents didn&amp;#39;t get divorced until I was in my late twenties. As hard as that was, I have absolutely no experience being a young child of divorce. I try to acknowledge that I&amp;#39;m limited by my own ignorance and seek out experiences and opinions of other people to get a handle of how best to deal with the situation. Unfortunately, my ex is adamant that he is right and I am wrong, based on principle alone, no matter what degree I go to to try and prove otherwise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4m5ih", "score_hidden": false, "stickied": false, "created": 1491961359.0, "created_utc": 1491932559.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4lr1m", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "LovelyLights", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "As a child of divorce I would say don't make your son visit his dad. You need to be on your kid's side.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As a child of divorce I would say don&amp;#39;t make your son visit his dad. You need to be on your kid&amp;#39;s side.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4lr1m", "score_hidden": false, "stickied": false, "created": 1491960923.0, "created_utc": 1491932123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg4ey6z", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4egte", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You're absolutely right. Thank you!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re absolutely right. Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ey6z", "score_hidden": false, "stickied": false, "created": 1491953472.0, "created_utc": 1491924672.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4egte", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "AnnaLemma", "parent_id": "t1_dg4e9zn", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Hang in there, it sound like you're doing everything right. And also keep in mind that you're not under *any* obligation to communicate with people who are assholes to you - it's even easier since you say he doesn't talk on the phone. Just let those texts and emails keep piling up. Answer the schedule-related ones, and let silence be your answer for the rest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hang in there, it sound like you&amp;#39;re doing everything right. And also keep in mind that you&amp;#39;re not under &lt;em&gt;any&lt;/em&gt; obligation to communicate with people who are assholes to you - it&amp;#39;s even easier since you say he doesn&amp;#39;t talk on the phone. Just let those texts and emails keep piling up. Answer the schedule-related ones, and let silence be your answer for the rest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4egte", "score_hidden": false, "stickied": false, "created": 1491952941.0, "created_utc": 1491924141.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4e9zn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4dnmw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This is the same understanding I've had of the situation from the get go. I initially got a lawyer in an effort to have someone advise me of the laws and my rights, and he told me the exact same thing. I have no desire to pursue any further court order because I have nothing to lose or gain by it. I truly want what's best for my son. In this case, I believe that it would be best if there was a regular schedule that we all adhered to. I think that if there was an expectation that he goes to his dad's every other weekend, and it happened with consistency, I would have no problem adhering to and enforcing that schedule. What I have a problem with is his dad refusing to make any sort of commitment more than a week ahead of time, and often bailing out last minute, regardless. If he wants to force my son to spend time with him, should he not be forced to do the same?  (Rhetorical question.)\nMy ex and I don't actually speak on the phone, so all of our interactions are via text and e-mail, which makes it extremely convenient to keep track of.\nA part of me wishes my ex would take me to court just so I don't have to deal with his harassment anymore, but, as I mentioned, he refuses. I believe that he refuses because he knows that he doesn't have a leg to stand on. He already refers to child support as extortion, and like I said, tells me I'm selfish because I won't willfully terminate the court order. I'm not stupid and I'm not going to just sign over my rights because my ex can't handle his responsibility. I'm just so anxious and tired. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the same understanding I&amp;#39;ve had of the situation from the get go. I initially got a lawyer in an effort to have someone advise me of the laws and my rights, and he told me the exact same thing. I have no desire to pursue any further court order because I have nothing to lose or gain by it. I truly want what&amp;#39;s best for my son. In this case, I believe that it would be best if there was a regular schedule that we all adhered to. I think that if there was an expectation that he goes to his dad&amp;#39;s every other weekend, and it happened with consistency, I would have no problem adhering to and enforcing that schedule. What I have a problem with is his dad refusing to make any sort of commitment more than a week ahead of time, and often bailing out last minute, regardless. If he wants to force my son to spend time with him, should he not be forced to do the same?  (Rhetorical question.)\nMy ex and I don&amp;#39;t actually speak on the phone, so all of our interactions are via text and e-mail, which makes it extremely convenient to keep track of.\nA part of me wishes my ex would take me to court just so I don&amp;#39;t have to deal with his harassment anymore, but, as I mentioned, he refuses. I believe that he refuses because he knows that he doesn&amp;#39;t have a leg to stand on. He already refers to child support as extortion, and like I said, tells me I&amp;#39;m selfish because I won&amp;#39;t willfully terminate the court order. I&amp;#39;m not stupid and I&amp;#39;m not going to just sign over my rights because my ex can&amp;#39;t handle his responsibility. I&amp;#39;m just so anxious and tired. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4e9zn", "score_hidden": false, "stickied": false, "created": 1491952731.0, "created_utc": 1491923931.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dnmw", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "AnnaLemma", "parent_id": "t1_dg4d149", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It probably goes without saying, but don't sign *anything*. Since there is no court order, you are under no obligation to permit any visitation; child support is a separate issue and would be considered separately by the courts.\n\nIf your ex wants to change anything, let him take you to court. You shouldn't assume that he won't change his mind about doing so at a later date, so in the meantime document *everything* - if/when it comes to court, it's to your advantage to have detailed documentation. Keep printouts and digital copies of all emails/texts; keep written notes of all verbal interactions; if and only if your state is a one-party consent state, you can also record verbal interactions (if your state is *not* a one-party consent state, you will need to get your ex's permission before recording, and I can only imagine how well *that* will go over). Keep a calendar detailing all the events *which he knew about* but which he skipped out on.\n\nIf it comes to court, your son's preferences will likely have *some* weight, but not as much as he would if he were older. Ultimately the court will make a decision based on what *they* feel is best for your son, so you'll need to convince them that visitation with the father is *not* what's best for him.\n\nYou are under no obligation to communicate with your ex, although practically speaking that might increase the likelihood of him taking you to court. [begin ninja-edit] It's also tough to say \"look at all the events he missed\" if he was never informed about these events. So. [end ninja-edit]\n\nThat's the legal aspect, as far as I understand it. I am not a lawyer.\n\nAs for the moral aspect - you know the situation best, so only you can make that decision. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It probably goes without saying, but don&amp;#39;t sign &lt;em&gt;anything&lt;/em&gt;. Since there is no court order, you are under no obligation to permit any visitation; child support is a separate issue and would be considered separately by the courts.&lt;/p&gt;\n\n&lt;p&gt;If your ex wants to change anything, let him take you to court. You shouldn&amp;#39;t assume that he won&amp;#39;t change his mind about doing so at a later date, so in the meantime document &lt;em&gt;everything&lt;/em&gt; - if/when it comes to court, it&amp;#39;s to your advantage to have detailed documentation. Keep printouts and digital copies of all emails/texts; keep written notes of all verbal interactions; if and only if your state is a one-party consent state, you can also record verbal interactions (if your state is &lt;em&gt;not&lt;/em&gt; a one-party consent state, you will need to get your ex&amp;#39;s permission before recording, and I can only imagine how well &lt;em&gt;that&lt;/em&gt; will go over). Keep a calendar detailing all the events &lt;em&gt;which he knew about&lt;/em&gt; but which he skipped out on.&lt;/p&gt;\n\n&lt;p&gt;If it comes to court, your son&amp;#39;s preferences will likely have &lt;em&gt;some&lt;/em&gt; weight, but not as much as he would if he were older. Ultimately the court will make a decision based on what &lt;em&gt;they&lt;/em&gt; feel is best for your son, so you&amp;#39;ll need to convince them that visitation with the father is &lt;em&gt;not&lt;/em&gt; what&amp;#39;s best for him.&lt;/p&gt;\n\n&lt;p&gt;You are under no obligation to communicate with your ex, although practically speaking that might increase the likelihood of him taking you to court. [begin ninja-edit] It&amp;#39;s also tough to say &amp;quot;look at all the events he missed&amp;quot; if he was never informed about these events. So. [end ninja-edit]&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the legal aspect, as far as I understand it. I am not a lawyer.&lt;/p&gt;\n\n&lt;p&gt;As for the moral aspect - you know the situation best, so only you can make that decision. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4dnmw", "score_hidden": false, "stickied": false, "created": 1491952032.0, "created_utc": 1491923232.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg4iefp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4ht8w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I have never requested a modification for child support except when I started working and my son started going to daycare, which was 5 years ago. I was previously a nanny for a child and I was able to bring my son with me, thus eliminating the need for child care, but when I went back to working a \"normal\" job, I would not have been able to afford to put my son in daycare without the adjustment. My state is (I believe) #5 in the country for the most expensive child care and I live in an area with a high cost of living.\nI get a base amount a month for child support and then half of daycare. I COULD request a modification and I COULD get more money because he makes more money now, but honestly, I don't want to fight about it, and I get by just fine as it is. Basically, what I get in child support covers what I pay in day care a month. I am responsible for everything else, and I don't have a problem with that.\nI will not cooperate with him because his motivation is the money and not our son. If his motivation was to spend more time with our son, I would do everything in my power to make that possible.\nMy biggest complaint is that HE DOESN'T SPEND ANY TIME WITH HIS SON! He doesn't put forth any effort to be more a part of his life. I do everything, by myself, all the time. All doctors appointments, conferences, sports and activities. I drop him off and pick him up from daycare. I do everything on a day to day basis regarding my son. His dad does literally nothing. \nHe also made a choice to get married and have more kids. I don't think I should have to make sacrifices on my son's behalf so that he can provide for a family that he chose years after my son was born.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have never requested a modification for child support except when I started working and my son started going to daycare, which was 5 years ago. I was previously a nanny for a child and I was able to bring my son with me, thus eliminating the need for child care, but when I went back to working a &amp;quot;normal&amp;quot; job, I would not have been able to afford to put my son in daycare without the adjustment. My state is (I believe) #5 in the country for the most expensive child care and I live in an area with a high cost of living.\nI get a base amount a month for child support and then half of daycare. I COULD request a modification and I COULD get more money because he makes more money now, but honestly, I don&amp;#39;t want to fight about it, and I get by just fine as it is. Basically, what I get in child support covers what I pay in day care a month. I am responsible for everything else, and I don&amp;#39;t have a problem with that.\nI will not cooperate with him because his motivation is the money and not our son. If his motivation was to spend more time with our son, I would do everything in my power to make that possible.\nMy biggest complaint is that HE DOESN&amp;#39;T SPEND ANY TIME WITH HIS SON! He doesn&amp;#39;t put forth any effort to be more a part of his life. I do everything, by myself, all the time. All doctors appointments, conferences, sports and activities. I drop him off and pick him up from daycare. I do everything on a day to day basis regarding my son. His dad does literally nothing. \nHe also made a choice to get married and have more kids. I don&amp;#39;t think I should have to make sacrifices on my son&amp;#39;s behalf so that he can provide for a family that he chose years after my son was born.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4iefp", "score_hidden": false, "stickied": false, "created": 1491957270.0, "created_utc": 1491928470.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ht8w", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "waterbuffalo750", "parent_id": "t1_dg4d149", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Is his child support still based on your scenario from 7 years ago? How much is he paying? If it's as ridiculous as he says it is, he's probably already bitter about his end of the whole deal, which makes cooperation nearly impossible. \n\nNot saying it's the case with you, but o see too many posts here of mom wanting dad to give give give, but isn't willing to cooperate because they don't legally have to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is his child support still based on your scenario from 7 years ago? How much is he paying? If it&amp;#39;s as ridiculous as he says it is, he&amp;#39;s probably already bitter about his end of the whole deal, which makes cooperation nearly impossible. &lt;/p&gt;\n\n&lt;p&gt;Not saying it&amp;#39;s the case with you, but o see too many posts here of mom wanting dad to give give give, but isn&amp;#39;t willing to cooperate because they don&amp;#39;t legally have to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4ht8w", "score_hidden": false, "stickied": false, "created": 1491956622.0, "created_utc": 1491927822.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4d149", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4crfu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We don't have a court order for visitation. My ex refuses to go to court. He wants me to sign off on an agreement that he wrote up himself. \nThe only reason I get child support is because when he and I split up, I had lost my job and moved back home with my mom, and I was on public assistance. The county automatically pursues child support in that scenario, but there is nothing about parenting time/visitation, etc. included in that.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We don&amp;#39;t have a court order for visitation. My ex refuses to go to court. He wants me to sign off on an agreement that he wrote up himself. \nThe only reason I get child support is because when he and I split up, I had lost my job and moved back home with my mom, and I was on public assistance. The county automatically pursues child support in that scenario, but there is nothing about parenting time/visitation, etc. included in that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4d149", "score_hidden": false, "stickied": false, "created": 1491951317.0, "created_utc": 1491922517.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4crfu", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AnnaLemma", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "What does your court-order say about visitation?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What does your court-order say about visitation?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4crfu", "score_hidden": false, "stickied": false, "created": 1491951011.0, "created_utc": 1491922211.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg4uns5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LawBot2016", "parent_id": "t1_dg4evl1", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The parent mentioned [**Court Order**](http://legaliq.com/Definition/Court_Order). For anyone unfamiliar with this term, **here is the definition:**^\\(In ^beta, ^be ^kind)\r\n****\r\nA court order is an official proclamation by a judge (or panel of judges) that defines the legal relationships between the parties to a hearing, a trial, an appeal or other court proceedings. Such ruling requires or authorizes the carrying out of certain steps by one or more parties to a case. A court order must be signed by a judge; some jurisdictions may require it to be notarized. An order can be as simple as setting a date for trial or as complex as restructuring contractual relationships by and between many corporations in a ... [[View More](http://legaliq.com/Definition/Court_Order)]\r\n****\r\n^(**See also:**) [^Enforceable](http://legaliq.com/Definition/Enforceable) ^| [^Deem](http://legaliq.com/Definition/Deem) ^| [^In ^Open ^Court](http://legaliq.com/Definition/In_Open_Court) ^| [^Interim ^Order](http://legaliq.com/Definition/Interim_Order) ^| [^Evidentiary](http://legaliq.com/Definition/Evidentiary) ^| [^Restructuring](http://legaliq.com/Definition/Restructuring) ^| [^Proclamation](http://legaliq.com/Definition/Proclamation)\r\n\r\n^(**Note**: The parent poster ) ^\\(SassafrassMcGee) ^can [^delete ^this ^post](/message/compose?to=LawBot2016&amp;subject=Deletion+Request&amp;message=cmd%3A+delete+reply+t1_dg4evl1) ^| [^**FAQ**](http://legaliq.com/reddit)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The parent mentioned &lt;a href=\"http://legaliq.com/Definition/Court_Order\"&gt;&lt;strong&gt;Court Order&lt;/strong&gt;&lt;/a&gt;. For anyone unfamiliar with this term, &lt;strong&gt;here is the definition:&lt;/strong&gt;&lt;sup&gt;(In&lt;/sup&gt; &lt;sup&gt;beta,&lt;/sup&gt; &lt;sup&gt;be&lt;/sup&gt; &lt;sup&gt;kind)&lt;/sup&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;A court order is an official proclamation by a judge (or panel of judges) that defines the legal relationships between the parties to a hearing, a trial, an appeal or other court proceedings. Such ruling requires or authorizes the carrying out of certain steps by one or more parties to a case. A court order must be signed by a judge; some jurisdictions may require it to be notarized. An order can be as simple as setting a date for trial or as complex as restructuring contractual relationships by and between many corporations in a ... [&lt;a href=\"http://legaliq.com/Definition/Court_Order\"&gt;View More&lt;/a&gt;]&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;strong&gt;See also:&lt;/strong&gt;&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Enforceable\"&gt;&lt;sup&gt;Enforceable&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Deem\"&gt;&lt;sup&gt;Deem&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/In_Open_Court\"&gt;&lt;sup&gt;In&lt;/sup&gt; &lt;sup&gt;Open&lt;/sup&gt; &lt;sup&gt;Court&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Interim_Order\"&gt;&lt;sup&gt;Interim&lt;/sup&gt; &lt;sup&gt;Order&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Evidentiary\"&gt;&lt;sup&gt;Evidentiary&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Restructuring\"&gt;&lt;sup&gt;Restructuring&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/Definition/Proclamation\"&gt;&lt;sup&gt;Proclamation&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;&lt;strong&gt;Note&lt;/strong&gt;: The parent poster &lt;/sup&gt; &lt;sup&gt;(SassafrassMcGee)&lt;/sup&gt; &lt;sup&gt;can&lt;/sup&gt; &lt;a href=\"/message/compose?to=LawBot2016&amp;amp;subject=Deletion+Request&amp;amp;message=cmd%3A+delete+reply+t1_dg4evl1\"&gt;&lt;sup&gt;delete&lt;/sup&gt; &lt;sup&gt;this&lt;/sup&gt; &lt;sup&gt;post&lt;/sup&gt;&lt;/a&gt; &lt;sup&gt;|&lt;/sup&gt; &lt;a href=\"http://legaliq.com/reddit\"&gt;&lt;sup&gt;&lt;strong&gt;FAQ&lt;/strong&gt;&lt;/sup&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4uns5", "score_hidden": false, "stickied": false, "created": 1491970588.0, "created_utc": 1491941788.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4evl1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4dzrp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I could be mistaken, but as my lawyer explained it to me, a court order would not REQUIRE that my ex spend time with his son, but that I make my son available based on that schedule. Whether or not he actually takes that time is entirely up to him, and not legally enforceable. \nWe have no previous agreements, written or court ordered, as we have never been able to come to any kind of terms that we deem mutually fair, and my lawyer said that the ball is in his court. If he wants to bring me to court and establish parenting time, it's up to him. Unfortunately, the fact that it's been close to 7 years at this point, and he hasn't ever made any kind of documented effort, doesn't really bode well for him. \nI have been willing to do whatever I can to facilitate their relationship, and I definitely don't feel that my ex has done the same. He's put himself and his family before our son, which is his right and his choice, but that choice is not without consequences. Unfortunately, the consequence is that his son feels marginalized, though he refuses to acknowledge that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I could be mistaken, but as my lawyer explained it to me, a court order would not REQUIRE that my ex spend time with his son, but that I make my son available based on that schedule. Whether or not he actually takes that time is entirely up to him, and not legally enforceable. \nWe have no previous agreements, written or court ordered, as we have never been able to come to any kind of terms that we deem mutually fair, and my lawyer said that the ball is in his court. If he wants to bring me to court and establish parenting time, it&amp;#39;s up to him. Unfortunately, the fact that it&amp;#39;s been close to 7 years at this point, and he hasn&amp;#39;t ever made any kind of documented effort, doesn&amp;#39;t really bode well for him. \nI have been willing to do whatever I can to facilitate their relationship, and I definitely don&amp;#39;t feel that my ex has done the same. He&amp;#39;s put himself and his family before our son, which is his right and his choice, but that choice is not without consequences. Unfortunately, the consequence is that his son feels marginalized, though he refuses to acknowledge that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4evl1", "score_hidden": false, "stickied": false, "created": 1491953390.0, "created_utc": 1491924590.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dzrp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thinkevolution", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I have an 8 yo myself, so I can understand and sympathize.  It's an age where they are starting to get what the schedule is, what their parents are doing (or not doing) and it does take a toll on them.  I'm sorry that your son is going through this with his dad. \nIf you have no current court agreement in place that outlines who has parenting time with your son when, then you are not under any obligation to let him go with his father if you don't feel it's in his best interest.  If it's an agreement on paper that you have been following, there would be some precedent saying you've been willing to work with him out of court in the past, however, he is not consistent in showing up and doing what he says he will with your son, so really, why would you be ok with setting up parenting time only to have your son disappointed?\nI would record all the times your ex hasn't shown up or has not been on-time, changed plans, etc.  Then I would draft a plan you feel would be in the best interest of your son.  Consult with your attorney and go to court asking for a court ordered schedule.  If he doesn't show up that's on him and will only prove to the court that he doesn't take this seriously and that your child isn't his first priority.  It's unrealistic for your ex to think that you can just agree to your him seeing your son on a whim (I consider a week prior to a major holiday sort of whimsical) and it doesn't provide any stability or consistency for your son.  It's not surprising he wouldn't want to go with his dad under those circumstances.\nI'd probably tell my ex that we already made plans for the holiday so this time wouldn't be best.  It's too soon to the day, son's looking forward to it...then I'd go meet my attorney and have a plan drafted and served to your ex.  Let him sort out what he does and doesn't want to agree too.  If he's not willing to sign a court document saying he'll follow the schedule, then something needs to be put in place to protect your son from the disappointment and give you a legal consequence to this behavior.  \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have an 8 yo myself, so I can understand and sympathize.  It&amp;#39;s an age where they are starting to get what the schedule is, what their parents are doing (or not doing) and it does take a toll on them.  I&amp;#39;m sorry that your son is going through this with his dad. \nIf you have no current court agreement in place that outlines who has parenting time with your son when, then you are not under any obligation to let him go with his father if you don&amp;#39;t feel it&amp;#39;s in his best interest.  If it&amp;#39;s an agreement on paper that you have been following, there would be some precedent saying you&amp;#39;ve been willing to work with him out of court in the past, however, he is not consistent in showing up and doing what he says he will with your son, so really, why would you be ok with setting up parenting time only to have your son disappointed?\nI would record all the times your ex hasn&amp;#39;t shown up or has not been on-time, changed plans, etc.  Then I would draft a plan you feel would be in the best interest of your son.  Consult with your attorney and go to court asking for a court ordered schedule.  If he doesn&amp;#39;t show up that&amp;#39;s on him and will only prove to the court that he doesn&amp;#39;t take this seriously and that your child isn&amp;#39;t his first priority.  It&amp;#39;s unrealistic for your ex to think that you can just agree to your him seeing your son on a whim (I consider a week prior to a major holiday sort of whimsical) and it doesn&amp;#39;t provide any stability or consistency for your son.  It&amp;#39;s not surprising he wouldn&amp;#39;t want to go with his dad under those circumstances.\nI&amp;#39;d probably tell my ex that we already made plans for the holiday so this time wouldn&amp;#39;t be best.  It&amp;#39;s too soon to the day, son&amp;#39;s looking forward to it...then I&amp;#39;d go meet my attorney and have a plan drafted and served to your ex.  Let him sort out what he does and doesn&amp;#39;t want to agree too.  If he&amp;#39;s not willing to sign a court document saying he&amp;#39;ll follow the schedule, then something needs to be put in place to protect your son from the disappointment and give you a legal consequence to this behavior.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4dzrp", "score_hidden": false, "stickied": false, "created": 1491952415.0, "created_utc": 1491923615.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg5g4z2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "xxonemoredayxx", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You sound like you've got w lot of great responses and I just want to add one comment that I haven't seen mentioned --\n\nYou said you've relayed your son's concerns to his father. I'd be careful about what you tell him because it may serve as more ammo for him against your son. Just make sure your son is okay with you telling the father what he's told you, because he might be thinking it's told to you in confidence.\n\nBut other than that you sound like you're doing great &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like you&amp;#39;ve got w lot of great responses and I just want to add one comment that I haven&amp;#39;t seen mentioned --&lt;/p&gt;\n\n&lt;p&gt;You said you&amp;#39;ve relayed your son&amp;#39;s concerns to his father. I&amp;#39;d be careful about what you tell him because it may serve as more ammo for him against your son. Just make sure your son is okay with you telling the father what he&amp;#39;s told you, because he might be thinking it&amp;#39;s told to you in confidence.&lt;/p&gt;\n\n&lt;p&gt;But other than that you sound like you&amp;#39;re doing great &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5g4z2", "score_hidden": false, "stickied": false, "created": 1491998787.0, "created_utc": 1491969987.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg4yhmt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZenMommy", "parent_id": "t1_dg4r5xo", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That's great! And I commend you on your thoughtfulness and maturity. You are giving him every chance, and he's just using that rope to hang himself. Honestly, I'd consult with the lawyer, but absolutely back my son up on this one. If he doesn't want to go to his father's, he doesn't have to. If the father doesn't like it, he can go to court. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s great! And I commend you on your thoughtfulness and maturity. You are giving him every chance, and he&amp;#39;s just using that rope to hang himself. Honestly, I&amp;#39;d consult with the lawyer, but absolutely back my son up on this one. If he doesn&amp;#39;t want to go to his father&amp;#39;s, he doesn&amp;#39;t have to. If the father doesn&amp;#39;t like it, he can go to court. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4yhmt", "score_hidden": false, "stickied": false, "created": 1491975009.0, "created_utc": 1491946209.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4r5xo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4qhby", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We don't have a custody agreement. He refuses to go to court. I have sole physical custody because we were never married. He would have to take ME to court in order to establish his parental rights, but he refuses to do so because, for one, he doesn't have the monetary resources, and for two, he knows that he doesn't have a leg to stand on. He believes that the courts are biased and unfair, so he wants me to sign this RIDICULOUS thing he wrote up about itemizing every dime I spend on my son, and a bunch of other demands based solely on money, with no focus on parenting time. He has refused, on several occasions, to commit to any kind of schedule.\n\nIn the past, he has asked me to give him (and his wife) full custody and I refuse, and I will continue to refuse. He has no legal recourse AGAINST me, and he bullies me because he knows that the court will never side with him, especially after 7 years. The only chance he has at getting out of his monetary obligation is to get me to willfully close the child support case, which I will never do. It's the only thing he cares about.\n\nWe fundamentally disagree on every aspect of parenting. He's very traditional and conservative, I'm very progressive. He thinks that because he has a wife and I am single that it is better for our son to be there than with me, despite their constant dysfunction. He is delusional. My attorney even said as much, and I don't see that being something attorneys would often say.\nI have casually jotted down notes and have emails and text messages. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We don&amp;#39;t have a custody agreement. He refuses to go to court. I have sole physical custody because we were never married. He would have to take ME to court in order to establish his parental rights, but he refuses to do so because, for one, he doesn&amp;#39;t have the monetary resources, and for two, he knows that he doesn&amp;#39;t have a leg to stand on. He believes that the courts are biased and unfair, so he wants me to sign this RIDICULOUS thing he wrote up about itemizing every dime I spend on my son, and a bunch of other demands based solely on money, with no focus on parenting time. He has refused, on several occasions, to commit to any kind of schedule.&lt;/p&gt;\n\n&lt;p&gt;In the past, he has asked me to give him (and his wife) full custody and I refuse, and I will continue to refuse. He has no legal recourse AGAINST me, and he bullies me because he knows that the court will never side with him, especially after 7 years. The only chance he has at getting out of his monetary obligation is to get me to willfully close the child support case, which I will never do. It&amp;#39;s the only thing he cares about.&lt;/p&gt;\n\n&lt;p&gt;We fundamentally disagree on every aspect of parenting. He&amp;#39;s very traditional and conservative, I&amp;#39;m very progressive. He thinks that because he has a wife and I am single that it is better for our son to be there than with me, despite their constant dysfunction. He is delusional. My attorney even said as much, and I don&amp;#39;t see that being something attorneys would often say.\nI have casually jotted down notes and have emails and text messages. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4r5xo", "score_hidden": false, "stickied": false, "created": 1491966783.0, "created_utc": 1491937983.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qhby", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZenMommy", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Okay, first of all GREAT JOB on getting rid of this asshole as much as possible. That was a seriously good decision! \n\nWhat is your legal custody agreement? You should have a record, preferably written, of all the times he's bailed, of examples of his attitude towards his payments, etc. Go to city and renegotiate your custody. It's clear, from his behavior, that he isn't interested in a relationship with his son. So any custody he would pursue is actually an act of vindication against you, which is not a valid reason. Make the court date; it's up to him to attend or not. \n\nMay the odds be ever in your favor!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, first of all GREAT JOB on getting rid of this asshole as much as possible. That was a seriously good decision! &lt;/p&gt;\n\n&lt;p&gt;What is your legal custody agreement? You should have a record, preferably written, of all the times he&amp;#39;s bailed, of examples of his attitude towards his payments, etc. Go to city and renegotiate your custody. It&amp;#39;s clear, from his behavior, that he isn&amp;#39;t interested in a relationship with his son. So any custody he would pursue is actually an act of vindication against you, which is not a valid reason. Make the court date; it&amp;#39;s up to him to attend or not. &lt;/p&gt;\n\n&lt;p&gt;May the odds be ever in your favor!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4qhby", "score_hidden": false, "stickied": false, "created": 1491966065.0, "created_utc": 1491937265.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg55p5d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kittenpanties", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Trust yourself mama!! Sounds like you're doing a good job protecting your son. Don't let yourself be pushed into doing something you regret, like forcing your son to go stay in an abusive environment. You don't want to damage your relationship with your son and you don't want to be kicking yourself later. Hug that boy, sounds like he needs it. And may the fleas of a thousand camels invade your ex's crotch and may his arms be to short too scratch.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Trust yourself mama!! Sounds like you&amp;#39;re doing a good job protecting your son. Don&amp;#39;t let yourself be pushed into doing something you regret, like forcing your son to go stay in an abusive environment. You don&amp;#39;t want to damage your relationship with your son and you don&amp;#39;t want to be kicking yourself later. Hug that boy, sounds like he needs it. And may the fleas of a thousand camels invade your ex&amp;#39;s crotch and may his arms be to short too scratch.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg55p5d", "score_hidden": false, "stickied": false, "created": 1491984363.0, "created_utc": 1491955563.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg57cd2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg56hdl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I agree whole heartedly. I tell my son his dad loves him. We practice mindfulness and we talk about how lucky we are to have so many people who love us. He finds it especially cool that he has extra grandparents (through his step mom) and that he gets to be an only child AND have brothers. \nMy ex is a bad person in my opinion. But my son loves him SO MUCH and I will continue to try to nurture that for as long as possible, even when it takes every ounce of will power I have to maintain my composure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree whole heartedly. I tell my son his dad loves him. We practice mindfulness and we talk about how lucky we are to have so many people who love us. He finds it especially cool that he has extra grandparents (through his step mom) and that he gets to be an only child AND have brothers. \nMy ex is a bad person in my opinion. But my son loves him SO MUCH and I will continue to try to nurture that for as long as possible, even when it takes every ounce of will power I have to maintain my composure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg57cd2", "score_hidden": false, "stickied": false, "created": 1491986535.0, "created_utc": 1491957735.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg56hdl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheL0nePonderer", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Psychologist here, I work with kids, but I also am in a similar situation with an 8 year old who doesn't want to spend time with his mom.  Our court order gives her 50% of the time, she spends about 15% of his time with him, and when she does, it's all about her (narcissistic and histrionic.)  The reality is, it is damaging to my son, but it is that way because it's so constant...to have to go over there constantly just to be put into daycare because 'this is my time, and I get to decide what you do -mom' is NOT the best thing for him.\n\nIf I were in your position, I would tell him tough shit also.  If he wants to force your son to be a part of his life, he can convince a family court judge.  Otherwise, he can start making an effort by showing up in your son's life on his own accord: Go to ball games.  Go have lunch at school.  Attend school functions.  Show up for birthday parties, etc.\n\nLet me stress, however...your message to your son needs to be that his dad loves him, but just isn't very reliable.  Because that's the truth.  Some people just have a harder time focusing on others.  That doesn't change the fact that his dad loves him.  But your son also doesn't have to sacrifice to make that relationship happen, because he's the child, and that is the job of the adult.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Psychologist here, I work with kids, but I also am in a similar situation with an 8 year old who doesn&amp;#39;t want to spend time with his mom.  Our court order gives her 50% of the time, she spends about 15% of his time with him, and when she does, it&amp;#39;s all about her (narcissistic and histrionic.)  The reality is, it is damaging to my son, but it is that way because it&amp;#39;s so constant...to have to go over there constantly just to be put into daycare because &amp;#39;this is my time, and I get to decide what you do -mom&amp;#39; is NOT the best thing for him.&lt;/p&gt;\n\n&lt;p&gt;If I were in your position, I would tell him tough shit also.  If he wants to force your son to be a part of his life, he can convince a family court judge.  Otherwise, he can start making an effort by showing up in your son&amp;#39;s life on his own accord: Go to ball games.  Go have lunch at school.  Attend school functions.  Show up for birthday parties, etc.&lt;/p&gt;\n\n&lt;p&gt;Let me stress, however...your message to your son needs to be that his dad loves him, but just isn&amp;#39;t very reliable.  Because that&amp;#39;s the truth.  Some people just have a harder time focusing on others.  That doesn&amp;#39;t change the fact that his dad loves him.  But your son also doesn&amp;#39;t have to sacrifice to make that relationship happen, because he&amp;#39;s the child, and that is the job of the adult.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg56hdl", "score_hidden": false, "stickied": false, "created": 1491985392.0, "created_utc": 1491956592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg59cc5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg596lp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Exactly. I knew this day would come. I had hoped it would be later, but my son is so smart and intuitive, it was only a matter of time before the truth surfaced. \nI hope that my son and his dad are able to maintain a relationship, for my son's sake, but I expect that my ex steps up his game and take action. I don't know how likely that is, unfortunately. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. I knew this day would come. I had hoped it would be later, but my son is so smart and intuitive, it was only a matter of time before the truth surfaced. \nI hope that my son and his dad are able to maintain a relationship, for my son&amp;#39;s sake, but I expect that my ex steps up his game and take action. I don&amp;#39;t know how likely that is, unfortunately. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg59cc5", "score_hidden": false, "stickied": false, "created": 1491989120.0, "created_utc": 1491960320.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg596lp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "mblueskies", "parent_id": "t1_dg58wju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think you are doing an amazing job of protecting your son.  Sounds like you have a good lawyer, too.  It must be so hard to watch your son's feelings about his father deteriorate.   My grandchildren had a father like that.  They've refused to talk to him for 2 years now and he can't be bothered to set up a supervised visit for himself.  So I know what it is to watch a child realize that his father really isn't a good person.  It's hard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you are doing an amazing job of protecting your son.  Sounds like you have a good lawyer, too.  It must be so hard to watch your son&amp;#39;s feelings about his father deteriorate.   My grandchildren had a father like that.  They&amp;#39;ve refused to talk to him for 2 years now and he can&amp;#39;t be bothered to set up a supervised visit for himself.  So I know what it is to watch a child realize that his father really isn&amp;#39;t a good person.  It&amp;#39;s hard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg596lp", "score_hidden": false, "stickied": false, "created": 1491988918.0, "created_utc": 1491960118.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58wju", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg58mjy", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We rarely speak on the phone because of this. Almost all of our conversations happen over text. I can, and should, refuse to respond. I'm still a work in progress! I get caught up in the whirlwind of emotion. It had been probably over a year before last night since we last had this kind of interaction because I was advised by my lawyer only to communicate about necessary details regarding our son. But when my son got upset trying to talk to his dad, doing a great job of communicating his feelings, and his dad completely shut him down, I lost my cool. I do regret that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We rarely speak on the phone because of this. Almost all of our conversations happen over text. I can, and should, refuse to respond. I&amp;#39;m still a work in progress! I get caught up in the whirlwind of emotion. It had been probably over a year before last night since we last had this kind of interaction because I was advised by my lawyer only to communicate about necessary details regarding our son. But when my son got upset trying to talk to his dad, doing a great job of communicating his feelings, and his dad completely shut him down, I lost my cool. I do regret that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg58wju", "score_hidden": false, "stickied": false, "created": 1491988565.0, "created_utc": 1491959765.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58mjy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mblueskies", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Sounds like you've got a realistic understanding of your son's dad and his behavior, and you've gotten some good advice here.  I totally support you in respecting your son's feelings and not forcing him to see his father.   Just one thing to add:  If you are still listening to this guy yell at you and tell you stuff like, \"you make me sick\", it might be time to reduce your communication.  You don't need to talk to him.  He can email you or text.  You can tell him you aren't really interested in his opinions and to that you'll discuss details of the next visit and things he needs to know about your son.  Then, do not respond to his provocations - only discuss what you absolutely have to.  You can even refuse to respond if he insults you.  You'll probably find out a lot of what keeps him in touch with your son is his need to abuse you.  You and your son deserve better treatment than he's been giving you.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you&amp;#39;ve got a realistic understanding of your son&amp;#39;s dad and his behavior, and you&amp;#39;ve gotten some good advice here.  I totally support you in respecting your son&amp;#39;s feelings and not forcing him to see his father.   Just one thing to add:  If you are still listening to this guy yell at you and tell you stuff like, &amp;quot;you make me sick&amp;quot;, it might be time to reduce your communication.  You don&amp;#39;t need to talk to him.  He can email you or text.  You can tell him you aren&amp;#39;t really interested in his opinions and to that you&amp;#39;ll discuss details of the next visit and things he needs to know about your son.  Then, do not respond to his provocations - only discuss what you absolutely have to.  You can even refuse to respond if he insults you.  You&amp;#39;ll probably find out a lot of what keeps him in touch with your son is his need to abuse you.  You and your son deserve better treatment than he&amp;#39;s been giving you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg58mjy", "score_hidden": false, "stickied": false, "created": 1491988212.0, "created_utc": 1491959412.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64r79u", "likes": null, "replies": "", "user_reports": [], "id": "dg6s9it", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ghastlycitrus", "parent_id": "t1_dg6d5yp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That's good, I misunderstood ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s good, I misunderstood &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6s9it", "score_hidden": false, "stickied": false, "created": 1492069737.0, "created_utc": 1492040937.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6d5yp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg5msga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I would definitely not consider my approach to be singing of praises, by any means. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would definitely not consider my approach to be singing of praises, by any means. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6d5yp", "score_hidden": false, "stickied": false, "created": 1492052596.0, "created_utc": 1492023796.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5msga", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ghastlycitrus", "parent_id": "t1_dg57je5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'd try to be more neutral, rather than lying and singing his praises ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d try to be more neutral, rather than lying and singing his praises &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5msga", "score_hidden": false, "stickied": false, "created": 1492013771.0, "created_utc": 1491984971.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg57je5", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg56n2e", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I know that I am not always good at controlling my emotions, especially when I am dealing with a child who has been hurt by his dad, who hurt me a lot. I try to encourage my son to spend time with his dad and to call his dad. I speak positively about his dad, even when I absolutely don't believe a word coming out of my mouth. I try to plead my ex'scase, that he is doing the best he can, and that has gone over fairly well, for the most part.\nI try to always take into account what's best for my son and I know that having a relationship with his dad is extremely important, but I also think his dad needs to pull his own weight. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know that I am not always good at controlling my emotions, especially when I am dealing with a child who has been hurt by his dad, who hurt me a lot. I try to encourage my son to spend time with his dad and to call his dad. I speak positively about his dad, even when I absolutely don&amp;#39;t believe a word coming out of my mouth. I try to plead my ex&amp;#39;scase, that he is doing the best he can, and that has gone over fairly well, for the most part.\nI try to always take into account what&amp;#39;s best for my son and I know that having a relationship with his dad is extremely important, but I also think his dad needs to pull his own weight. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg57je5", "score_hidden": false, "stickied": false, "created": 1491986792.0, "created_utc": 1491957992.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg56n2e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Justagreewithme", "parent_id": "t1_dg52z1n", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I can understand that, just let me explain my experience.  When I was 4 years old a judge asked me if I wanted visitation with my father.  This was at the end of a 4 year custody battle where my mother had primary custody, due to my father not being able to afford child support and going to debtors prison.  Well, I said no, because I was 4, had spent most days with my mom and I knew that's the answer she wanted.  I spent my teens-twenties pretty heavily resenting my mom.  I was convinced she was a liar.  So I stopped talking to her and reconnected with my father.  Truth is, he isn't he best person.  I realize that now, but her scathing hatred just seemed so illogical that her opinion was invalidated.  My point is, your ex may be an asshole, but make sure your son knows it for himself, not because you say so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can understand that, just let me explain my experience.  When I was 4 years old a judge asked me if I wanted visitation with my father.  This was at the end of a 4 year custody battle where my mother had primary custody, due to my father not being able to afford child support and going to debtors prison.  Well, I said no, because I was 4, had spent most days with my mom and I knew that&amp;#39;s the answer she wanted.  I spent my teens-twenties pretty heavily resenting my mom.  I was convinced she was a liar.  So I stopped talking to her and reconnected with my father.  Truth is, he isn&amp;#39;t he best person.  I realize that now, but her scathing hatred just seemed so illogical that her opinion was invalidated.  My point is, your ex may be an asshole, but make sure your son knows it for himself, not because you say so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg56n2e", "score_hidden": false, "stickied": false, "created": 1491985603.0, "created_utc": 1491956803.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52z1n", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SassafrassMcGee", "parent_id": "t1_dg4zm3l", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I try really hard not to project my feelings about my ex onto my son, but my ex is an abuser. I can't help but feel bitter. He broke me to the point that I nearly killed myself. I mean that in the least romanticized way possible. When we broke up, I was a hollow shell of a person. I've fought long and hard to get healthy. I know I'm not perfect. I know my son is affected by my emotions. But I am only human. I try to stay level headed. It would be one thing if my bitterness were unwarranted, but it's not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I try really hard not to project my feelings about my ex onto my son, but my ex is an abuser. I can&amp;#39;t help but feel bitter. He broke me to the point that I nearly killed myself. I mean that in the least romanticized way possible. When we broke up, I was a hollow shell of a person. I&amp;#39;ve fought long and hard to get healthy. I know I&amp;#39;m not perfect. I know my son is affected by my emotions. But I am only human. I try to stay level headed. It would be one thing if my bitterness were unwarranted, but it&amp;#39;s not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg52z1n", "score_hidden": false, "stickied": false, "created": 1491980669.0, "created_utc": 1491951869.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4zm3l", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "Justagreewithme", "parent_id": "t3_64r79u", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Just a bit of unsolicited advice...lose the bitterness.  You may completely right but halfway through I wanted you to be wrong just because of your attitude.  Your son can pick up on it and it will affect how he acts too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just a bit of unsolicited advice...lose the bitterness.  You may completely right but halfway through I wanted you to be wrong just because of your attitude.  Your son can pick up on it and it will affect how he acts too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg4zm3l", "score_hidden": false, "stickied": false, "created": 1491976361.0, "created_utc": 1491947561.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}]