[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to decide what to do with my 4 year old daughter. Right now she&amp;#39;s in a home day care, there are 6 kids in total. She loves it there and she barely gets sick. Last year she got a cold in January and then no cough or runny nose til December (and then she got 3 back to back). Last year she was in the home daycare 4/5 days a week and I even had her take a ballet class. So I&amp;#39;m surprised how little she got sick. This was a blessing for me because I was pregnant last year and I had Hyperemesis Gravidarum and was throwing up til I had the baby. So when my 4 year old got the 3 back to back colds this flu season so did my baby. We all got sick and needed antibiotics because of ear infections and sinus infection. So now I&amp;#39;m trying to decide on sending my daughter to preschool or keeping her at the home daycare. At the home daycare she&amp;#39;s not really getting much of an education (alphabet, numbers, writing, etc). If I compare her with kids her age who go to preschool she is behind in education. Though she&amp;#39;s advanced or good in arts and crafts, following instructions and has no behavioral issues. The lady who watches the kids believes kids should just be kids and play. We kind of feel the same as well, my husband is from Europe and they don&amp;#39;t really push education on kids when they are preschool age. I&amp;#39;m asian so I was raised the opposite. I&amp;#39;m wondering if my daughter will be behind when she enters kindergarten and make her have low self esteem? By keeping her at the home daycare is she being exposed to less interesting things than at a preschool? My two friends who have their kids in preschool have been venting to me about how often their kids get sick but love the education they are getting from preschool. One friend her kid has been sick 10 times back to back this last flu season and my other friend said there&amp;#39;s only 1 week where her kid will not have a runny nose or cough and 2 weeks between if there&amp;#39;s a miracle but she comes home talking about evergreen trees and deciduous trees and is starting to read already. I dunno what to do. Having two sick kids all the time also seems like a nightmare to me. My kids are prone to ear infections so I don&amp;#39;t want them to be on antibiotics all the time too. Anyone have any advice for me. I can&amp;#39;t sleep cause I keep thinking about what to do and what&amp;#39;s best for the whole family. I also understand that once my 4 yr old starts kindergarten she will get sick often but by then my baby will be a bit older.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm trying to decide what to do with my 4 year old daughter. Right now she's in a home day care, there are 6 kids in total. She loves it there and she barely gets sick. Last year she got a cold in January and then no cough or runny nose til December (and then she got 3 back to back). Last year she was in the home daycare 4/5 days a week and I even had her take a ballet class. So I'm surprised how little she got sick. This was a blessing for me because I was pregnant last year and I had Hyperemesis Gravidarum and was throwing up til I had the baby. So when my 4 year old got the 3 back to back colds this flu season so did my baby. We all got sick and needed antibiotics because of ear infections and sinus infection. So now I'm trying to decide on sending my daughter to preschool or keeping her at the home daycare. At the home daycare she's not really getting much of an education (alphabet, numbers, writing, etc). If I compare her with kids her age who go to preschool she is behind in education. Though she's advanced or good in arts and crafts, following instructions and has no behavioral issues. The lady who watches the kids believes kids should just be kids and play. We kind of feel the same as well, my husband is from Europe and they don't really push education on kids when they are preschool age. I'm asian so I was raised the opposite. I'm wondering if my daughter will be behind when she enters kindergarten and make her have low self esteem? By keeping her at the home daycare is she being exposed to less interesting things than at a preschool? My two friends who have their kids in preschool have been venting to me about how often their kids get sick but love the education they are getting from preschool. One friend her kid has been sick 10 times back to back this last flu season and my other friend said there's only 1 week where her kid will not have a runny nose or cough and 2 weeks between if there's a miracle but she comes home talking about evergreen trees and deciduous trees and is starting to read already. I dunno what to do. Having two sick kids all the time also seems like a nightmare to me. My kids are prone to ear infections so I don't want them to be on antibiotics all the time too. Anyone have any advice for me. I can't sleep cause I keep thinking about what to do and what's best for the whole family. I also understand that once my 4 yr old starts kindergarten she will get sick often but by then my baby will be a bit older.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Advice", "id": "64txvq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 31, "report_reasons": null, "author": "frieswithicecream", "saved": false, "mod_reports": [], "name": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": 1491948928.0, "link_flair_css_class": "advice", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/64txvq/continue_sending_4_year_old_to_home_daycare_or/", "num_reports": null, "locked": false, "stickied": false, "created": 1491975696.0, "url": "https://www.reddit.com/r/Parenting/comments/64txvq/continue_sending_4_year_old_to_home_daycare_or/", "author_flair_text": null, "quarantine": false, "title": "Continue sending 4 year old to home daycare or preschool", "created_utc": 1491946896.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 29, "visited": false, "subreddit_type": "public", "ups": 31}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg51to0", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "funchy", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Sickness is just something that happens. I wouldn't make any school/daycare decisions based on this.\n\nAt this age she should be learning socialization and learning through play.  She doesn't need to go to class for ABCs yet.   Pick the place that offers the best environment and most attention.  Where is shs happiest?  Where is she learning social skills, some manners, &amp; some self control?\n\nIf you want her to learn ABCs and such, it's quite easily to teach at home.  Make it fun.  There are games and matching cards that you can play with her *for fun* that will also introduce her to letters and numbers.   My little one isnt 3 yet, but she knows ABCs, counting to 20, starting to recognize words, etc.  She's never been to a class.  We just do fun stuff together that happens to include these things.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sickness is just something that happens. I wouldn&amp;#39;t make any school/daycare decisions based on this.&lt;/p&gt;\n\n&lt;p&gt;At this age she should be learning socialization and learning through play.  She doesn&amp;#39;t need to go to class for ABCs yet.   Pick the place that offers the best environment and most attention.  Where is shs happiest?  Where is she learning social skills, some manners, &amp;amp; some self control?&lt;/p&gt;\n\n&lt;p&gt;If you want her to learn ABCs and such, it&amp;#39;s quite easily to teach at home.  Make it fun.  There are games and matching cards that you can play with her &lt;em&gt;for fun&lt;/em&gt; that will also introduce her to letters and numbers.   My little one isnt 3 yet, but she knows ABCs, counting to 20, starting to recognize words, etc.  She&amp;#39;s never been to a class.  We just do fun stuff together that happens to include these things.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg51to0", "score_hidden": false, "stickied": false, "created": 1491979163.0, "created_utc": 1491950363.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg54cf2", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Avoiding germs isn't a great basis for making this decision. Delaying exposure at best postpones the inevitable, but may actually increase her susceptibility to illness. \n\nI agree that they don't need letters and numbers drills at this age, but a good play based preschool teaches so much more than academic skills. I don't think a family environment supplemented with play dates is at all the same. Some people argue that they will catch up in K-1, just like they will with the academic skills. But I'm a big fan of ECE. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Avoiding germs isn&amp;#39;t a great basis for making this decision. Delaying exposure at best postpones the inevitable, but may actually increase her susceptibility to illness. &lt;/p&gt;\n\n&lt;p&gt;I agree that they don&amp;#39;t need letters and numbers drills at this age, but a good play based preschool teaches so much more than academic skills. I don&amp;#39;t think a family environment supplemented with play dates is at all the same. Some people argue that they will catch up in K-1, just like they will with the academic skills. But I&amp;#39;m a big fan of ECE. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg54cf2", "score_hidden": false, "stickied": false, "created": 1491982527.0, "created_utc": 1491953727.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg51eay", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "irishgirl249", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I wouldn't base the decision on where she gets sick less. Personally, id send her to preschool. I think she needs to be in a classroom setting and socialize with more than 6 kids. It will help her transition to kindergarten. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t base the decision on where she gets sick less. Personally, id send her to preschool. I think she needs to be in a classroom setting and socialize with more than 6 kids. It will help her transition to kindergarten. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg51eay", "score_hidden": false, "stickied": false, "created": 1491978619.0, "created_utc": 1491949819.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg62xhz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dg5tni4", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "As the parent of a dyslexic child, I'm not sure that's true. Reading readiness has a brain maturation component (unlinked to intelligence) that has a wide range of normal. It is considered normal to be unable to learn to read up until age 7, which is actually one of the objections to pushing reading skills too early - kids get prematurely and inappropriately labeled. \n\nKnowing what I know now, if I had a do-over I would keep the dyslexic one in Montessori through kindergarten. Some of the tactile exercises might have helped him, but that's the only thing I can think of that might have made a difference, short of professional intervention before diagnosis. I did meet one little girl getting dyslexia tutoring at 5 but she had an extreme family history. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As the parent of a dyslexic child, I&amp;#39;m not sure that&amp;#39;s true. Reading readiness has a brain maturation component (unlinked to intelligence) that has a wide range of normal. It is considered normal to be unable to learn to read up until age 7, which is actually one of the objections to pushing reading skills too early - kids get prematurely and inappropriately labeled. &lt;/p&gt;\n\n&lt;p&gt;Knowing what I know now, if I had a do-over I would keep the dyslexic one in Montessori through kindergarten. Some of the tactile exercises might have helped him, but that&amp;#39;s the only thing I can think of that might have made a difference, short of professional intervention before diagnosis. I did meet one little girl getting dyslexia tutoring at 5 but she had an extreme family history. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg62xhz", "score_hidden": false, "stickied": false, "created": 1492042094.0, "created_utc": 1492013294.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tni4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "istara", "parent_id": "t1_dg50xgu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I agree.\n\nRe the learning thing: they pretty much all catch up in Kindergarten, so it may not make the hugest difference if they have already learnt the alphabet or even learnt to read.\n\nBUT: if there are any learning issues, eg dyslexia, and you can pick that up early, so much the better. It may be a more comfortable start for such a child to have at least some knowledge of the alphabet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree.&lt;/p&gt;\n\n&lt;p&gt;Re the learning thing: they pretty much all catch up in Kindergarten, so it may not make the hugest difference if they have already learnt the alphabet or even learnt to read.&lt;/p&gt;\n\n&lt;p&gt;BUT: if there are any learning issues, eg dyslexia, and you can pick that up early, so much the better. It may be a more comfortable start for such a child to have at least some knowledge of the alphabet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5tni4", "score_hidden": false, "stickied": false, "created": 1492030852.0, "created_utc": 1492002052.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg653r2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SlaughterhouseIce9", "parent_id": "t1_dg50xgu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Plus every spring and summer, illnesses are disseminated through school; whether it's preschool or kindergarten or grade school. It's gonna happen. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plus every spring and summer, illnesses are disseminated through school; whether it&amp;#39;s preschool or kindergarten or grade school. It&amp;#39;s gonna happen. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg653r2", "score_hidden": false, "stickied": false, "created": 1492044375.0, "created_utc": 1492015575.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg50xgu", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "gigglesmcbug", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Whenever you send her into a new environment she's going to get sick.  \n\nWould you rather her be sick in preschool or kindergarten?\n\nI'd rather they get sick in preschool, personally. ", "edited": 1491949670.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whenever you send her into a new environment she&amp;#39;s going to get sick.  &lt;/p&gt;\n\n&lt;p&gt;Would you rather her be sick in preschool or kindergarten?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d rather they get sick in preschool, personally. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg50xgu", "score_hidden": false, "stickied": false, "created": 1491978024.0, "created_utc": 1491949224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg6je2o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dg5iqz4", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That may be a bit overstated.  Many things do balance out by 3rd grade, notably reading (that one has been well established for decades). Other skills and abilities are less clear; many things have weak or conflicting evidence on both sides, some studies suggest that certain subgroups benefit more than others (SOE or child's individual aptitudes and challenges), while other studies suggest that the type of preschool matters. We can't wait for definitive answers, though, and most children turn out fine no matter what the background. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That may be a bit overstated.  Many things do balance out by 3rd grade, notably reading (that one has been well established for decades). Other skills and abilities are less clear; many things have weak or conflicting evidence on both sides, some studies suggest that certain subgroups benefit more than others (SOE or child&amp;#39;s individual aptitudes and challenges), while other studies suggest that the type of preschool matters. We can&amp;#39;t wait for definitive answers, though, and most children turn out fine no matter what the background. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6je2o", "score_hidden": false, "stickied": false, "created": 1492059019.0, "created_utc": 1492030219.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5iqz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frieswithicecream", "parent_id": "t1_dg5coc8", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you! Good to know that it all balances out by third grade and to hear your experience with your daughter. Need to talk it over with husband. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you! Good to know that it all balances out by third grade and to hear your experience with your daughter. Need to talk it over with husband. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5iqz4", "score_hidden": false, "stickied": false, "created": 1492003543.0, "created_utc": 1491974743.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5coc8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "manda_hates_you", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You have to go with your gut. Preschool is great if you want your child to learn certain things sooner. But keep in mind that she will start out behind in kindergarten if she doesn't attend preschool. Most research says that kids who had preschool tend to excel early but that it all balances out by third grade, regardless of preschool attendance. My daughter (first grade) didn't go to preschool because of financial constraints and she is a little behind the other kids. She also catches up everyday. The only thing she struggles with now is reading comprehension. \n\nDon't make your decision based on sickness. In an ideal world, kids would never get sick. But it's not an ideal world and, for the most part, getting sick isn't a deal breaker. Your kid will get sick no matter what once she starts school. It's just a fact of life. I would make sure that the preschool requires vaccines. That would be the only deal breaker for me. \n\nGood luck with your decision. Don't forget that it comes down to what's best for you and your family. At the end of the day, only you know what's best. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have to go with your gut. Preschool is great if you want your child to learn certain things sooner. But keep in mind that she will start out behind in kindergarten if she doesn&amp;#39;t attend preschool. Most research says that kids who had preschool tend to excel early but that it all balances out by third grade, regardless of preschool attendance. My daughter (first grade) didn&amp;#39;t go to preschool because of financial constraints and she is a little behind the other kids. She also catches up everyday. The only thing she struggles with now is reading comprehension. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t make your decision based on sickness. In an ideal world, kids would never get sick. But it&amp;#39;s not an ideal world and, for the most part, getting sick isn&amp;#39;t a deal breaker. Your kid will get sick no matter what once she starts school. It&amp;#39;s just a fact of life. I would make sure that the preschool requires vaccines. That would be the only deal breaker for me. &lt;/p&gt;\n\n&lt;p&gt;Good luck with your decision. Don&amp;#39;t forget that it comes down to what&amp;#39;s best for you and your family. At the end of the day, only you know what&amp;#39;s best. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5coc8", "score_hidden": false, "stickied": false, "created": 1491993597.0, "created_utc": 1491964797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg5hy6w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frieswithicecream", "parent_id": "t1_dg5fzac", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Good to know that they start from the beginning at kindergarten. Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good to know that they start from the beginning at kindergarten. Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hy6w", "score_hidden": false, "stickied": false, "created": 1492002009.0, "created_utc": 1491973209.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fzac", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Rose1718", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "They're going to get sick either at preschool or when they start school. It's simply exposure. At least that's how my doctor explained and it and seems pretty accurate. My sister in law had her kids home until school and now they are almost always sick- way more often then my child that goes to preschool. \n\nAs for the education part, as long as your child learns basic counting and alphabet I wouldn't worry. I have a friend who is a kindergarten teacher and they start at the beginning assuming kids don't know  that stuff. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re going to get sick either at preschool or when they start school. It&amp;#39;s simply exposure. At least that&amp;#39;s how my doctor explained and it and seems pretty accurate. My sister in law had her kids home until school and now they are almost always sick- way more often then my child that goes to preschool. &lt;/p&gt;\n\n&lt;p&gt;As for the education part, as long as your child learns basic counting and alphabet I wouldn&amp;#39;t worry. I have a friend who is a kindergarten teacher and they start at the beginning assuming kids don&amp;#39;t know  that stuff. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5fzac", "score_hidden": false, "stickied": false, "created": 1491998529.0, "created_utc": 1491969729.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg5j7mh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wepwepwepwe", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I definitely wouldn't worry about academics at the age of 4.  I think you're right to worry about health, and as long as the kid is happy in the daycare she's in, and takes ballet classes and maybe has other opportunities to socialize, I'd keep her there.  You can always do academic stuff at home.  Multiple courses of antibiotics at a young age are bad news.  (There's a correlation between obesity and antibiotic usage in children, and that's just one of the side effects)\n\nYou can teach her about evergreen trees and deciduous trees and teach her the letters and numbers yourself.  It's not like she needs to get a Ph.D. at this point.  My kid is learning her letters as a \"find me\" game.  I show her a page with some large-font text and ask her to find the A, or whatever (it's a good distraction for when she's on the potty).  She likes it and by now she can reliably recognize about half the alphabet.  Same for numbers, same for writing - just play with her and teach all those things through play.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I definitely wouldn&amp;#39;t worry about academics at the age of 4.  I think you&amp;#39;re right to worry about health, and as long as the kid is happy in the daycare she&amp;#39;s in, and takes ballet classes and maybe has other opportunities to socialize, I&amp;#39;d keep her there.  You can always do academic stuff at home.  Multiple courses of antibiotics at a young age are bad news.  (There&amp;#39;s a correlation between obesity and antibiotic usage in children, and that&amp;#39;s just one of the side effects)&lt;/p&gt;\n\n&lt;p&gt;You can teach her about evergreen trees and deciduous trees and teach her the letters and numbers yourself.  It&amp;#39;s not like she needs to get a Ph.D. at this point.  My kid is learning her letters as a &amp;quot;find me&amp;quot; game.  I show her a page with some large-font text and ask her to find the A, or whatever (it&amp;#39;s a good distraction for when she&amp;#39;s on the potty).  She likes it and by now she can reliably recognize about half the alphabet.  Same for numbers, same for writing - just play with her and teach all those things through play.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5j7mh", "score_hidden": false, "stickied": false, "created": 1492004491.0, "created_utc": 1491975691.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg766ww", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "What_makes_you_happy", "parent_id": "t1_dg6nix3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "In Australia, kindy is 3-4 year olds,  from there they go to pre primary (first compulsory year) as 4-5yo then year 1 as 5-6yo", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In Australia, kindy is 3-4 year olds,  from there they go to pre primary (first compulsory year) as 4-5yo then year 1 as 5-6yo&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg766ww", "score_hidden": false, "stickied": false, "created": 1492088245.0, "created_utc": 1492059445.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nix3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dg6m860", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Most kids do here as well, since public kindergarten starts at age 5 and is free. However the Montessori preschool program as designed by Montessori herself is a 3 year program with age 5/6 being the leadership year. I don't think it was designed to match up with any particular country's school system unless it was designed with Italy's system in mind. Certified Montessoris offer all 3 years but our school didn't have many kids doing the 3rd year and I suspect that's common. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most kids do here as well, since public kindergarten starts at age 5 and is free. However the Montessori preschool program as designed by Montessori herself is a 3 year program with age 5/6 being the leadership year. I don&amp;#39;t think it was designed to match up with any particular country&amp;#39;s school system unless it was designed with Italy&amp;#39;s system in mind. Certified Montessoris offer all 3 years but our school didn&amp;#39;t have many kids doing the 3rd year and I suspect that&amp;#39;s common. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6nix3", "score_hidden": false, "stickied": false, "created": 1492063872.0, "created_utc": 1492035072.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6m860", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "istara", "parent_id": "t1_dg6k7a0", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think it's probably structured differently here. From what I'm aware of, kids go from Montessori to Kindergarten. But it may vary by centre. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it&amp;#39;s probably structured differently here. From what I&amp;#39;m aware of, kids go from Montessori to Kindergarten. But it may vary by centre. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6m860", "score_hidden": false, "stickied": false, "created": 1492062286.0, "created_utc": 1492033486.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6k7a0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dg5tqyv", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That's weird. Because if you do all 3 years - the way Montessori preschool is originally designed and structured, though most parents I knew skipped year 3 - you do kindy in Montessori and start school in first grade. But it's self paced, and both of my boys were doing some of the kindergarten work in year 2. Since preschool is optional in the first place, it's hard to see how Montessori could actually make the kids less prepared. \n\nThe only thing I can think of is reading. Montessori emphasizes prereading skills and allows the kids to move forward if they choose to, but does not actually push the kids to read. So if your schools want the kids to come in already reading - yeah, that's not going to happen. That doesn't mean the kids are \"behind\", it means the schools are behind - research consistently fails to find any benefit to early reading. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s weird. Because if you do all 3 years - the way Montessori preschool is originally designed and structured, though most parents I knew skipped year 3 - you do kindy in Montessori and start school in first grade. But it&amp;#39;s self paced, and both of my boys were doing some of the kindergarten work in year 2. Since preschool is optional in the first place, it&amp;#39;s hard to see how Montessori could actually make the kids less prepared. &lt;/p&gt;\n\n&lt;p&gt;The only thing I can think of is reading. Montessori emphasizes prereading skills and allows the kids to move forward if they choose to, but does not actually push the kids to read. So if your schools want the kids to come in already reading - yeah, that&amp;#39;s not going to happen. That doesn&amp;#39;t mean the kids are &amp;quot;behind&amp;quot;, it means the schools are behind - research consistently fails to find any benefit to early reading. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6k7a0", "score_hidden": false, "stickied": false, "created": 1492059916.0, "created_utc": 1492031116.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tqyv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "istara", "parent_id": "t1_dg5itoj", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Check what its programme is. When I was at my kid's school information evening, I heard the headteacher tell the father ahead of me that kids at Montessori tend to start kindergarten up to a year behind those that have been to a more regular pre-school. I was pretty shocked to hear this, and felt awful for the guy in front.\n\nThis was in Australia, it may be different where you are. But it's something to bear in mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Check what its programme is. When I was at my kid&amp;#39;s school information evening, I heard the headteacher tell the father ahead of me that kids at Montessori tend to start kindergarten up to a year behind those that have been to a more regular pre-school. I was pretty shocked to hear this, and felt awful for the guy in front.&lt;/p&gt;\n\n&lt;p&gt;This was in Australia, it may be different where you are. But it&amp;#39;s something to bear in mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5tqyv", "score_hidden": false, "stickied": false, "created": 1492031003.0, "created_utc": 1492002203.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5itoj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frieswithicecream", "parent_id": "t1_dg54kze", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There's actually a Montessori preschool close by that I was interested in. Thank you for your feedback!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s actually a Montessori preschool close by that I was interested in. Thank you for your feedback!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5itoj", "score_hidden": false, "stickied": false, "created": 1492003691.0, "created_utc": 1491974891.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg5wbyz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GanoBlivia", "parent_id": "t1_dg5huw8", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Nope. It levels out by the middle of kindergarten for the most part. \n\nI just think that if you have the option to send your kid to preschool, why not do it? They learn so much and I do think the preschool my kids went to has helped set them up for success. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope. It levels out by the middle of kindergarten for the most part. &lt;/p&gt;\n\n&lt;p&gt;I just think that if you have the option to send your kid to preschool, why not do it? They learn so much and I do think the preschool my kids went to has helped set them up for success. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5wbyz", "score_hidden": false, "stickied": false, "created": 1492034609.0, "created_utc": 1492005809.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5huw8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "harbinjer", "parent_id": "t1_dg54kze", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "But do you think a 1st grade teacher can point out which kids didn't do preschool? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But do you think a 1st grade teacher can point out which kids didn&amp;#39;t do preschool? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5huw8", "score_hidden": false, "stickied": false, "created": 1492001837.0, "created_utc": 1491973037.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg54kze", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GanoBlivia", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I would send her to preschool. Sickness will happen, but that's not what you want to be basing this kind of decision on. I have 4 kids. 3 in school and 1 in daycare. Someone is always sick.  \n\nI think preschool is best, especially if you can find a play based preschool. I teach kindergarten and can easily point out which kids went to preschool and which ones didn't and it has nothing to do with their academics. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would send her to preschool. Sickness will happen, but that&amp;#39;s not what you want to be basing this kind of decision on. I have 4 kids. 3 in school and 1 in daycare. Someone is always sick.  &lt;/p&gt;\n\n&lt;p&gt;I think preschool is best, especially if you can find a play based preschool. I teach kindergarten and can easily point out which kids went to preschool and which ones didn&amp;#39;t and it has nothing to do with their academics. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg54kze", "score_hidden": false, "stickied": false, "created": 1491982850.0, "created_utc": 1491954050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg5iji5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "frieswithicecream", "parent_id": "t1_dg5dgel", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The home daycare has 3 girls older than my daughter so they have a gated area where they do art projects. She's really good with arts and crafts. She doesn't like to play alphabet and number games for very long and it seems like she doesn't have the sharpest memory. I've been trying to teach her how to write her name. She doesn't know lower case yet and doesn't know the sounds of all the alphabets. We do read to her everyday and she knows colors and shapes. I feel like she may flourish in preschool but wonder if she's gonna be miserable too cause she's sick all the time. I will definitely think about part time preschool as well. Thank you for the feedback!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The home daycare has 3 girls older than my daughter so they have a gated area where they do art projects. She&amp;#39;s really good with arts and crafts. She doesn&amp;#39;t like to play alphabet and number games for very long and it seems like she doesn&amp;#39;t have the sharpest memory. I&amp;#39;ve been trying to teach her how to write her name. She doesn&amp;#39;t know lower case yet and doesn&amp;#39;t know the sounds of all the alphabets. We do read to her everyday and she knows colors and shapes. I feel like she may flourish in preschool but wonder if she&amp;#39;s gonna be miserable too cause she&amp;#39;s sick all the time. I will definitely think about part time preschool as well. Thank you for the feedback!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5iji5", "score_hidden": false, "stickied": false, "created": 1492003141.0, "created_utc": 1491974341.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5dgel", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mudslideme", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Send her where you think she'll be happiest. \n\nMy oldest started getting bored in a home daycare at 4, so we switched her to preschool and she flourished. \n\nMy younger 2 kids (now in kindergarten and 3) both went/go to preschool and love(d) it. They do spend some time on learning their letters and reading, but they also spend a lot of time in free play (inside and outside) and doing crafts. \n\nI think the biggest difference is that, in preschool, they do more activities that are age specific. In a family daycare, it's hard to do scissor and glue projects when there are babies too. My kids have attended 2 different preschools and both have been small enough the teachers know each kid well and real affection develops. \n\nThat said, if you are reading with your kid every day (to develop a love), practicing colors with her, and doing basic counting games, she'll catch up in no time. There is something to be said for your husband's perspective.\n\nAnother option might be sending her to preschool some days, home day care some days.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Send her where you think she&amp;#39;ll be happiest. &lt;/p&gt;\n\n&lt;p&gt;My oldest started getting bored in a home daycare at 4, so we switched her to preschool and she flourished. &lt;/p&gt;\n\n&lt;p&gt;My younger 2 kids (now in kindergarten and 3) both went/go to preschool and love(d) it. They do spend some time on learning their letters and reading, but they also spend a lot of time in free play (inside and outside) and doing crafts. &lt;/p&gt;\n\n&lt;p&gt;I think the biggest difference is that, in preschool, they do more activities that are age specific. In a family daycare, it&amp;#39;s hard to do scissor and glue projects when there are babies too. My kids have attended 2 different preschools and both have been small enough the teachers know each kid well and real affection develops. &lt;/p&gt;\n\n&lt;p&gt;That said, if you are reading with your kid every day (to develop a love), practicing colors with her, and doing basic counting games, she&amp;#39;ll catch up in no time. There is something to be said for your husband&amp;#39;s perspective.&lt;/p&gt;\n\n&lt;p&gt;Another option might be sending her to preschool some days, home day care some days.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5dgel", "score_hidden": false, "stickied": false, "created": 1491994686.0, "created_utc": 1491965886.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg5i5vg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frieswithicecream", "parent_id": "t1_dg5e6es", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thanks for your feedback. I will schedule an appointment with a preschool soon. You're right I think it will help me with the decision. I actually did talk to my pediatrician and she did say that kids will get sick every month once they start preschool or kindergarten. Last year was a special/lucky year for us with how little she got sick. Previous year she was sick a lot more. It's just especially hard when she gets the baby sick and then I get sick and then taking care of two sick kids while being sick. Then all of us getting another one and then another one. I got so depressed and exhausted. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your feedback. I will schedule an appointment with a preschool soon. You&amp;#39;re right I think it will help me with the decision. I actually did talk to my pediatrician and she did say that kids will get sick every month once they start preschool or kindergarten. Last year was a special/lucky year for us with how little she got sick. Previous year she was sick a lot more. It&amp;#39;s just especially hard when she gets the baby sick and then I get sick and then taking care of two sick kids while being sick. Then all of us getting another one and then another one. I got so depressed and exhausted. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5i5vg", "score_hidden": false, "stickied": false, "created": 1492002419.0, "created_utc": 1491973619.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e6es", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "prettywannapancake", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Find out if you can visit some local preschools, ideally bringing her along. It might help you get a sense of what feels good and comfortable. \n\nI wouldn't be too worried about her being being academically--they can catch up so quickly at that age and you can teach her tons at home with games.\n\nI do understand the concerns about illness, but as long as your baby isn't especially delicate, I would try not to base decisions on that, as it's just going to happen. You could have a chat with the paediatrician next time you see them if you want. Just tell them you've been mulling about this and ask if they have any thoughts on it. \n\nReally, whatever you choose your kids are going to be grand. You've totally got this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Find out if you can visit some local preschools, ideally bringing her along. It might help you get a sense of what feels good and comfortable. &lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t be too worried about her being being academically--they can catch up so quickly at that age and you can teach her tons at home with games.&lt;/p&gt;\n\n&lt;p&gt;I do understand the concerns about illness, but as long as your baby isn&amp;#39;t especially delicate, I would try not to base decisions on that, as it&amp;#39;s just going to happen. You could have a chat with the paediatrician next time you see them if you want. Just tell them you&amp;#39;ve been mulling about this and ask if they have any thoughts on it. &lt;/p&gt;\n\n&lt;p&gt;Really, whatever you choose your kids are going to be grand. You&amp;#39;ve totally got this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5e6es", "score_hidden": false, "stickied": false, "created": 1491995731.0, "created_utc": 1491966931.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg5irso", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frieswithicecream", "parent_id": "t1_dg56n5w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I could see this happening. Thanks!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I could see this happening. Thanks!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5irso", "score_hidden": false, "stickied": false, "created": 1492003586.0, "created_utc": 1491974786.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg56n5w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jabbsgeuwiabsvfj", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Preschool, they outgrow daycare at that age and need more. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Preschool, they outgrow daycare at that age and need more. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg56n5w", "score_hidden": false, "stickied": false, "created": 1491985607.0, "created_utc": 1491956807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64txvq", "likes": null, "replies": "", "user_reports": [], "id": "dg5ubm4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "veggiesaur", "parent_id": "t3_64txvq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I agree with everyone saying not to base it on her getting sick. If it's not preschool, it'll be kindergarten where she starts to pick everything up. That's just the way of things. \n\nMy son goes to an in-home daycare. I don't really believe he needs preschool before he starts kindergarten. He gets a lot of enrichment from their activities there, and he's learning a lot of social cues, etc. just from interacting with the other kids there. We work with him at home as well. If I felt like he would benefit from being in preschool I would switch him in a heartbeat, but I just don't see how it could possibly be any more beneficial than what he's got now. My gut tells me he's in the right place for him until he starts kindergarten, so that's what we're going to do. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with everyone saying not to base it on her getting sick. If it&amp;#39;s not preschool, it&amp;#39;ll be kindergarten where she starts to pick everything up. That&amp;#39;s just the way of things. &lt;/p&gt;\n\n&lt;p&gt;My son goes to an in-home daycare. I don&amp;#39;t really believe he needs preschool before he starts kindergarten. He gets a lot of enrichment from their activities there, and he&amp;#39;s learning a lot of social cues, etc. just from interacting with the other kids there. We work with him at home as well. If I felt like he would benefit from being in preschool I would switch him in a heartbeat, but I just don&amp;#39;t see how it could possibly be any more beneficial than what he&amp;#39;s got now. My gut tells me he&amp;#39;s in the right place for him until he starts kindergarten, so that&amp;#39;s what we&amp;#39;re going to do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ubm4", "score_hidden": false, "stickied": false, "created": 1492031875.0, "created_utc": 1492003075.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]