[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;9 years ago, my older brother and his wife had twins - two girls. I was (and am) single and was very close with my brother&amp;#39;s family. We actually owned three houses in a row - my brother and his family (wife and two girls) in one, myself in the second, and my sister-in-law (brother&amp;#39;s wife&amp;#39;s sister) and her 14 year old son in the third. I realize that&amp;#39;s a very unusual situation. People always thought it was very unusual/interesting whenever we explain it. It&amp;#39;s not particularly relevant to the story. I just wanted to include it to give a sense of how close our whole extended family was.&lt;/p&gt;\n\n&lt;p&gt;About three months after the twins were born, my dad passed away unexpectedly from a sudden stroke. I obviously really wanted to go to the funeral, but I couldn&amp;#39;t because of work (that&amp;#39;s a whole other sad story, but not relevant to this one). It was just all around a shitty situation. So the plan was that my brother, his wife, the two girls, my sister-in-law, and her son would take my brother&amp;#39;s van to Quebec and my brother would read my half of the eulogy for me. The night before they were going to leave, one of my nieces got really sick and my brother and his wife asked if I could take care of her for the week since they didn&amp;#39;t want the added stress of a sick kid during an already difficult time. Obviously I agreed, and made arrangements for a sitter for when I was working at the hospital.&lt;/p&gt;\n\n&lt;p&gt;Long story short, the five of them died on their way to Montreal. There wasn&amp;#39;t even a drunk driver or some careless idiot that I could blame it on. They hit a fucking deer and the car flipped. It&amp;#39;s been over 9 years and I still cry about it sometimes. I lost my entire family in the span of three days. My mom left when I was a kid, so I never really knew her. My brother and my dad were the only family I had growing up, and when my brother met his wife, she and her sister immediately welcomed me into their own family. They were like my sisters, and it was like we were one big family with four parents and three kids. I realize how weird it sounds. I get how unusual it is. But I didn&amp;#39;t just feel like I lost my dad and brother. I felt like I lost my dad, my brother, two sisters, a daughter, and a son.&lt;/p&gt;\n\n&lt;p&gt;Honestly, if it weren&amp;#39;t for my niece getting sick and staying back with me, I probably would have killed myself. Knowing that she still needed me was the only thing that got me through that time.&lt;/p&gt;\n\n&lt;p&gt;She was only a few months old when it happened and doesn&amp;#39;t remember any of it. My brother and sister-in-law chose me to be their daughters&amp;#39; guardian if anything were to happen to them. I raised her for the past nine years. I never planned on having kids, but having her in my life brings me more happiness than anything else. She&amp;#39;s still just a little kid, but she&amp;#39;s way more intelligent, mature, compassionate, and funny than I or anyone I know was at that age.&lt;/p&gt;\n\n&lt;p&gt;As soon as she was able to talk, I told her the whole story of her parents and what happened. Obviously I sugar-coated it initially, but I wanted her to understand how much she was loved, and by so many people. It was a difficult thing for a kid to grasp, especially since most of her friends have that typical nuclear family structure. I think it&amp;#39;s still hard for her to grasp, to be honest.&lt;/p&gt;\n\n&lt;p&gt;A few months after the accident, I talked to one of my friends from med school who became a child psychiatrist. She recommended that since my brother and sister-in-law died when she was not even three months old, I should just raise her as my daughter since I&amp;#39;m the only parental figure that she would know. So, despite telling her about her parents, she grew up calling me &amp;quot;Dad,&amp;quot; and I called her my daughter.&lt;/p&gt;\n\n&lt;p&gt;Near the end of the last school year, I picked her up from school and she was crying her eyes out. She said that she was being made fun of by this girl named Susan for having no parents. As a side note, I went to the elementary school she goes to now (way back when) with Susan&amp;#39;s dad, and he was a huge asshole back then. It&amp;#39;s sad to see that his daughter is the same way. It killed me to see her like that. I reassured her that even though her parents died, she &lt;em&gt;did&lt;/em&gt; have a dad, no matter what anyone said. That seemed to reassure her, but she kept on getting bullied. Eventually, I spoke to her teacher, who spoke to Susan&amp;#39;s parents, and the bullying stopped.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to Friday. I picked her up from school and she was crying just like she was last year. I somehow knew in my gut that it was going to be about the same thing. It was actually 1000x worse. We live in an almost entirely white town. Growing up, my brother and I faced &lt;em&gt;a lot&lt;/em&gt; of racism (we are of Indian descent). Honestly, I never thought it would be an issue anymore, since three decades have passed and people have generally become a lot more understanding since then. Apparently I was being too optimistic. My daughter told me that a group of bullies a few grades above her had been making fun of her for weeks, saying that Indian people have incestuous families and that since we all look the same, we just pick our babies at random and hope it&amp;#39;s the right one (alluding to the fact that I&amp;#39;m not her biological dad). They also called her a race traitor (her mom was white), which I never thought was a term I would hear in Canada, let alone from kids who are still in grade school. I&amp;#39;m still fucking livid. I can&amp;#39;t believe it. No matter what I said, I couldn&amp;#39;t console her. She didn&amp;#39;t even understand what these kids were saying. She obviously has no idea what incest is, or what being a &amp;quot;race traitor&amp;quot; means, other than that those are bad. I still can&amp;#39;t believe that people could be this nasty, especially to a girl who has never once been mean to someone or done anything to deserve this sort of hate.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s still really upset by it, but the weekend gave her a chance to calm down, and gave me a chance to explain that these people were just being mean and that she should talk to a teacher &lt;em&gt;immediately&lt;/em&gt; if they say anything like that again. She was still upset on Sunday, so I took Monday off work and decided that I would let her miss school for a day, so we ended up going kayaking and hiking instead. It was honestly such a fun day for both of us, and she was so happy by Monday night that I was hoping that she would forget about it (before anyone says it, I recognize that I was being naive).&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, today, when I picked her up, she was really quiet. She wouldn&amp;#39;t tell me what was wrong until I got home. She said that she thought about what the bullies were saying and that she agreed with them. I&amp;#39;m not her real dad and she doesn&amp;#39;t think of me as one anymore. She said she wanted to stop calling me Dad and start calling me &amp;quot;Uncle &amp;lt;my name&amp;gt;&amp;quot; instead (which is how she refers to my cousins and friends). She also said that I should call her my niece instead of my daughter (I&amp;#39;ve always introduced her as my daughter for as long as I can remember). I told her that I understand where she&amp;#39;s coming from and that I understand it must be hard, and that I would respect her choice. But, honestly, I never felt so hurt since that day nine years ago. She went to sleep an hour ago and I&amp;#39;ve been crying nonstop since. I haven&amp;#39;t felt like this in years. I will of course respect her wishes (until she hopefully changes her mind, but I will continue to respect it even if she doesn&amp;#39;t). I will call her my niece. But I don&amp;#39;t think I can ever think of her as anything other than my daughter. I raised her since she was three months old. Before she could even speak. I was there for her first words. I took her to preschool on her first day. I taught her how to play hockey and ride a bike and paint. I don&amp;#39;t know how to stop crying and show her that I&amp;#39;m willing to respect her choice. I&amp;#39;d appreciate any advice. Thanks in advance. Sorry for the length.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Raised my niece since she was three months old. She&amp;#39;s been getting bullied at school (about her parents dying and about her race) and doesn&amp;#39;t consider me her dad anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "9 years ago, my older brother and his wife had twins - two girls. I was (and am) single and was very close with my brother's family. We actually owned three houses in a row - my brother and his family (wife and two girls) in one, myself in the second, and my sister-in-law (brother's wife's sister) and her 14 year old son in the third. I realize that's a very unusual situation. People always thought it was very unusual/interesting whenever we explain it. It's not particularly relevant to the story. I just wanted to include it to give a sense of how close our whole extended family was.\n\nAbout three months after the twins were born, my dad passed away unexpectedly from a sudden stroke. I obviously really wanted to go to the funeral, but I couldn't because of work (that's a whole other sad story, but not relevant to this one). It was just all around a shitty situation. So the plan was that my brother, his wife, the two girls, my sister-in-law, and her son would take my brother's van to Quebec and my brother would read my half of the eulogy for me. The night before they were going to leave, one of my nieces got really sick and my brother and his wife asked if I could take care of her for the week since they didn't want the added stress of a sick kid during an already difficult time. Obviously I agreed, and made arrangements for a sitter for when I was working at the hospital.\n\nLong story short, the five of them died on their way to Montreal. There wasn't even a drunk driver or some careless idiot that I could blame it on. They hit a fucking deer and the car flipped. It's been over 9 years and I still cry about it sometimes. I lost my entire family in the span of three days. My mom left when I was a kid, so I never really knew her. My brother and my dad were the only family I had growing up, and when my brother met his wife, she and her sister immediately welcomed me into their own family. They were like my sisters, and it was like we were one big family with four parents and three kids. I realize how weird it sounds. I get how unusual it is. But I didn't just feel like I lost my dad and brother. I felt like I lost my dad, my brother, two sisters, a daughter, and a son.\n\nHonestly, if it weren't for my niece getting sick and staying back with me, I probably would have killed myself. Knowing that she still needed me was the only thing that got me through that time.\n\nShe was only a few months old when it happened and doesn't remember any of it. My brother and sister-in-law chose me to be their daughters' guardian if anything were to happen to them. I raised her for the past nine years. I never planned on having kids, but having her in my life brings me more happiness than anything else. She's still just a little kid, but she's way more intelligent, mature, compassionate, and funny than I or anyone I know was at that age.\n\nAs soon as she was able to talk, I told her the whole story of her parents and what happened. Obviously I sugar-coated it initially, but I wanted her to understand how much she was loved, and by so many people. It was a difficult thing for a kid to grasp, especially since most of her friends have that typical nuclear family structure. I think it's still hard for her to grasp, to be honest.\n\nA few months after the accident, I talked to one of my friends from med school who became a child psychiatrist. She recommended that since my brother and sister-in-law died when she was not even three months old, I should just raise her as my daughter since I'm the only parental figure that she would know. So, despite telling her about her parents, she grew up calling me \"Dad,\" and I called her my daughter.\n\nNear the end of the last school year, I picked her up from school and she was crying her eyes out. She said that she was being made fun of by this girl named Susan for having no parents. As a side note, I went to the elementary school she goes to now (way back when) with Susan's dad, and he was a huge asshole back then. It's sad to see that his daughter is the same way. It killed me to see her like that. I reassured her that even though her parents died, she *did* have a dad, no matter what anyone said. That seemed to reassure her, but she kept on getting bullied. Eventually, I spoke to her teacher, who spoke to Susan's parents, and the bullying stopped.\n\nFast forward to Friday. I picked her up from school and she was crying just like she was last year. I somehow knew in my gut that it was going to be about the same thing. It was actually 1000x worse. We live in an almost entirely white town. Growing up, my brother and I faced *a lot* of racism (we are of Indian descent). Honestly, I never thought it would be an issue anymore, since three decades have passed and people have generally become a lot more understanding since then. Apparently I was being too optimistic. My daughter told me that a group of bullies a few grades above her had been making fun of her for weeks, saying that Indian people have incestuous families and that since we all look the same, we just pick our babies at random and hope it's the right one (alluding to the fact that I'm not her biological dad). They also called her a race traitor (her mom was white), which I never thought was a term I would hear in Canada, let alone from kids who are still in grade school. I'm still fucking livid. I can't believe it. No matter what I said, I couldn't console her. She didn't even understand what these kids were saying. She obviously has no idea what incest is, or what being a \"race traitor\" means, other than that those are bad. I still can't believe that people could be this nasty, especially to a girl who has never once been mean to someone or done anything to deserve this sort of hate.\n\nShe's still really upset by it, but the weekend gave her a chance to calm down, and gave me a chance to explain that these people were just being mean and that she should talk to a teacher *immediately* if they say anything like that again. She was still upset on Sunday, so I took Monday off work and decided that I would let her miss school for a day, so we ended up going kayaking and hiking instead. It was honestly such a fun day for both of us, and she was so happy by Monday night that I was hoping that she would forget about it (before anyone says it, I recognize that I was being naive).\n\nUnfortunately, today, when I picked her up, she was really quiet. She wouldn't tell me what was wrong until I got home. She said that she thought about what the bullies were saying and that she agreed with them. I'm not her real dad and she doesn't think of me as one anymore. She said she wanted to stop calling me Dad and start calling me \"Uncle &lt;my name&gt;\" instead (which is how she refers to my cousins and friends). She also said that I should call her my niece instead of my daughter (I've always introduced her as my daughter for as long as I can remember). I told her that I understand where she's coming from and that I understand it must be hard, and that I would respect her choice. But, honestly, I never felt so hurt since that day nine years ago. She went to sleep an hour ago and I've been crying nonstop since. I haven't felt like this in years. I will of course respect her wishes (until she hopefully changes her mind, but I will continue to respect it even if she doesn't). I will call her my niece. But I don't think I can ever think of her as anything other than my daughter. I raised her since she was three months old. Before she could even speak. I was there for her first words. I took her to preschool on her first day. I taught her how to play hockey and ride a bike and paint. I don't know how to stop crying and show her that I'm willing to respect her choice. I'd appreciate any advice. Thanks in advance. Sorry for the length.\n\n  ---   \n  **tl;dr**: Raised my niece since she was three months old. She's been getting bullied at school (about her parents dying and about her race) and doesn't consider me her dad anymore.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Child", "id": "64v4l3", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 457, "report_reasons": null, "author": "qazmlpwsxnkoedc", "saved": false, "mod_reports": [], "name": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "child", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/64v4l3/my_42_m_adopted_daughter_9_f_doesnt_think_of_me/", "num_reports": null, "locked": false, "stickied": false, "created": 1491988572.0, "url": "https://www.reddit.com/r/Parenting/comments/64v4l3/my_42_m_adopted_daughter_9_f_doesnt_think_of_me/", "author_flair_text": null, "quarantine": false, "title": "My [42 M] adopted daughter [9 F] doesn't think of me as her dad anymore", "created_utc": 1491959772.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 107, "visited": false, "subreddit_type": "public", "ups": 457}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5imsp", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "seringen", "parent_id": "t1_dg5a7is", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Just because there's a crisis like this shouldn't stop her from being your daughter. Make sure she gets the support she needs emotionally, and you should make sure she knows that you think of her as your daughter no matter what words you two use. Then she can come around to accepting you again as her father. A therapist is really a must and will help both you and her. Good luck and don't take it too poorly, it was bound to be an issue but it's something that could bring you together even more in the long run.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just because there&amp;#39;s a crisis like this shouldn&amp;#39;t stop her from being your daughter. Make sure she gets the support she needs emotionally, and you should make sure she knows that you think of her as your daughter no matter what words you two use. Then she can come around to accepting you again as her father. A therapist is really a must and will help both you and her. Good luck and don&amp;#39;t take it too poorly, it was bound to be an issue but it&amp;#39;s something that could bring you together even more in the long run.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5imsp", "score_hidden": false, "stickied": false, "created": 1492003315.0, "created_utc": 1491974515.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5tjgr", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "istara", "parent_id": "t1_dg5a7is", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Is there any option for her to change schools?\n\nThe sad fact is that these issues don't go away if you have a core group of asshole kids, indifferent parents and useless teachers. If the school isn't tackling this kind of harassment effectively (or even tackling it at all) for your kid's sake it's probably best to move.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is there any option for her to change schools?&lt;/p&gt;\n\n&lt;p&gt;The sad fact is that these issues don&amp;#39;t go away if you have a core group of asshole kids, indifferent parents and useless teachers. If the school isn&amp;#39;t tackling this kind of harassment effectively (or even tackling it at all) for your kid&amp;#39;s sake it&amp;#39;s probably best to move.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5tjgr", "score_hidden": false, "stickied": false, "created": 1492030676.0, "created_utc": 1492001876.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5yy06", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "simtel20", "parent_id": "t1_dg5a7is", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Having grown up in NYC, and raising my daughter here, racism isn't as bad as it used to be.  But racism is passed down in families and goes away slowly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having grown up in NYC, and raising my daughter here, racism isn&amp;#39;t as bad as it used to be.  But racism is passed down in families and goes away slowly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5yy06", "score_hidden": false, "stickied": false, "created": 1492037702.0, "created_utc": 1492008902.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5a7is", "gilded": 0, "archived": false, "score": 82, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg59x63", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you very much for your perspective and advice.\n\nI'm also sorry that your kids have to deal with racism. I'm saddened that that is still an issue in a city as diverse and cosmopolitan as NYC.\n\nBest of luck, and thanks again!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much for your perspective and advice.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also sorry that your kids have to deal with racism. I&amp;#39;m saddened that that is still an issue in a city as diverse and cosmopolitan as NYC.&lt;/p&gt;\n\n&lt;p&gt;Best of luck, and thanks again!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5a7is", "score_hidden": false, "stickied": false, "created": 1491990244.0, "created_utc": 1491961444.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 82}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5o17s", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "jeleanor11", "parent_id": "t1_dg5goeg", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You really have done everything right. There isn't a single part of your post where you acted in a way I would disagree with. \n\nI was a nine year old girl once, too. It's such a difficult time. She's approaching (or in) puberty now, and her hormones will be doing things to her that she doesn't understand. Peers are so important to you when you are that age, and she is lucky enough to know that you will love her unconditionally even if she tests the boundaries of your relationship. I second the recommendation of therapy, and I would also suggest it for you - what you experienced is a pain that is second to none, and I am so sorry for your losses. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You really have done everything right. There isn&amp;#39;t a single part of your post where you acted in a way I would disagree with. &lt;/p&gt;\n\n&lt;p&gt;I was a nine year old girl once, too. It&amp;#39;s such a difficult time. She&amp;#39;s approaching (or in) puberty now, and her hormones will be doing things to her that she doesn&amp;#39;t understand. Peers are so important to you when you are that age, and she is lucky enough to know that you will love her unconditionally even if she tests the boundaries of your relationship. I second the recommendation of therapy, and I would also suggest it for you - what you experienced is a pain that is second to none, and I am so sorry for your losses. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5o17s", "score_hidden": false, "stickied": false, "created": 1492017697.0, "created_utc": 1491988897.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5goeg", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5gkvg", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You're right. It's impossible for me to experience her reality and see the situation through a lens other than my own. I just have to respect her wishes and support her in any way that I can and, hopefully, one day our interpretations of our relationship will align.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right. It&amp;#39;s impossible for me to experience her reality and see the situation through a lens other than my own. I just have to respect her wishes and support her in any way that I can and, hopefully, one day our interpretations of our relationship will align.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5goeg", "score_hidden": false, "stickied": false, "created": 1491999708.0, "created_utc": 1491970908.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gkvg", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "tacosaladinabowl", "parent_id": "t1_dg5gfsr", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "As well as can be expected, considering. Thank you for asking. I didn't share the anecdote to scare you, but to show you how real these issues can be even if the kid can't remember their birth parents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As well as can be expected, considering. Thank you for asking. I didn&amp;#39;t share the anecdote to scare you, but to show you how real these issues can be even if the kid can&amp;#39;t remember their birth parents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5gkvg", "score_hidden": false, "stickied": false, "created": 1491999538.0, "created_utc": 1491970738.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gfsr", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5fxl5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Oh my god. That's terrible. How is your friend doing now?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my god. That&amp;#39;s terrible. How is your friend doing now?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5gfsr", "score_hidden": false, "stickied": false, "created": 1491999293.0, "created_utc": 1491970493.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fxl5", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "tacosaladinabowl", "parent_id": "t1_dg59x63", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "A close friend of mine is a gay man who adopted his three nephews and niece when their parents died of AIDS. His youngest was about a year old. Last year, his youngest killed himself in his mid-20s from survivors guilt specifically because he was the only one who couldn't remember his parents. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A close friend of mine is a gay man who adopted his three nephews and niece when their parents died of AIDS. His youngest was about a year old. Last year, his youngest killed himself in his mid-20s from survivors guilt specifically because he was the only one who couldn&amp;#39;t remember his parents. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5fxl5", "score_hidden": false, "stickied": false, "created": 1491998452.0, "created_utc": 1491969652.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 44}}], "after": null, "before": null}}, "user_reports": [], "id": "dg59x63", "gilded": 0, "archived": false, "score": 300, "report_reasons": null, "author": "Zeeeke", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I strongly recommend therapy. She may not remember her parents, but that doesn't mean there isn't still pain. My 3 are all adopted. They have different birth families and we adopted at different ages. My (now) 10 year old was 7 months when he was placed with us. He was about 2.5 when we adopted. We are the only parents he has ever known. He is an extremely well adjusted kid. He is very confident and secure. Mr. Popularity. He still talks about his birth mom and refers to her as his mom. He doesn't remember her and he knows why she lost her parental rights, but she still holds a place in his heart and he loves her. There is pain there. It isn't outward or noticeable, but it's there. Losing your whole family is tough even if you don't remember it. It may even hurt more not being able to remember. \n\nOne of my other kids (now 11) went through a phase where he called my husband and I by our first names only. It only lasted for a couple of weeks, but I didn't let it bother me. I am secure in my role as his dad. The title he gives me doesn't change that. He is long past that now. \n\nWe are a same-sex couple and are kids are not white, so we have experienced some of those issues as well. We live in NYC and it's pretty diverse here, but kids still make comments. My 10 year old has never been phased by it and is quick with a comeback, but my 11 year old had a rough time with the teasing in elementary school. It seems like those days are behind us as well. \n\nI would seek out family therapy. In the mean time, don't get too caught up in the name she calls you. She is aware of everything you did for her. If she is having trouble with bullies in school, maybe try an out of school organization for her to be involved with. Somewhere that doesn't have kids who know her whole story. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I strongly recommend therapy. She may not remember her parents, but that doesn&amp;#39;t mean there isn&amp;#39;t still pain. My 3 are all adopted. They have different birth families and we adopted at different ages. My (now) 10 year old was 7 months when he was placed with us. He was about 2.5 when we adopted. We are the only parents he has ever known. He is an extremely well adjusted kid. He is very confident and secure. Mr. Popularity. He still talks about his birth mom and refers to her as his mom. He doesn&amp;#39;t remember her and he knows why she lost her parental rights, but she still holds a place in his heart and he loves her. There is pain there. It isn&amp;#39;t outward or noticeable, but it&amp;#39;s there. Losing your whole family is tough even if you don&amp;#39;t remember it. It may even hurt more not being able to remember. &lt;/p&gt;\n\n&lt;p&gt;One of my other kids (now 11) went through a phase where he called my husband and I by our first names only. It only lasted for a couple of weeks, but I didn&amp;#39;t let it bother me. I am secure in my role as his dad. The title he gives me doesn&amp;#39;t change that. He is long past that now. &lt;/p&gt;\n\n&lt;p&gt;We are a same-sex couple and are kids are not white, so we have experienced some of those issues as well. We live in NYC and it&amp;#39;s pretty diverse here, but kids still make comments. My 10 year old has never been phased by it and is quick with a comeback, but my 11 year old had a rough time with the teasing in elementary school. It seems like those days are behind us as well. &lt;/p&gt;\n\n&lt;p&gt;I would seek out family therapy. In the mean time, don&amp;#39;t get too caught up in the name she calls you. She is aware of everything you did for her. If she is having trouble with bullies in school, maybe try an out of school organization for her to be involved with. Somewhere that doesn&amp;#39;t have kids who know her whole story. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg59x63", "score_hidden": false, "stickied": false, "created": 1491989862.0, "created_utc": 1491961062.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 300}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5i0i0", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "gingerfied", "parent_id": "t1_dg5gjsh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I've heard of therapists that do sessions over Skype.  It might be worth looking into.  \n\nMy heart hurts for you and your daughter.  I hope you are able to find the help you need. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve heard of therapists that do sessions over Skype.  It might be worth looking into.  &lt;/p&gt;\n\n&lt;p&gt;My heart hurts for you and your daughter.  I hope you are able to find the help you need. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5i0i0", "score_hidden": false, "stickied": false, "created": 1492002134.0, "created_utc": 1491973334.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5hlqn", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Pamzella", "parent_id": "t1_dg5gjsh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Every parent faces stuff they don't feel equipped to handle.  Most people haven't had to deal with losing their entire family in less than a week and be responsible for an infant. You are doing an amazing job, especially with so much grief in your life, and in hers.   Therapy isn't a failing, therapy can bring strength and courage.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Every parent faces stuff they don&amp;#39;t feel equipped to handle.  Most people haven&amp;#39;t had to deal with losing their entire family in less than a week and be responsible for an infant. You are doing an amazing job, especially with so much grief in your life, and in hers.   Therapy isn&amp;#39;t a failing, therapy can bring strength and courage.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hlqn", "score_hidden": false, "stickied": false, "created": 1492001362.0, "created_utc": 1491972562.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ihch", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "jintana", "parent_id": "t1_dg5gjsh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt;it'll feel like I'm acknowledging just how much she's hurting\n\nThis is what she needs for you to do.\n\n\n&gt;I was never made to be a parent.\n\nYou certainly were. You explained how you became one: through sudden adoption prompted by loss of your family.\n\nAdditionally, video counseling is a thing these days.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;ll feel like I&amp;#39;m acknowledging just how much she&amp;#39;s hurting&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is what she needs for you to do.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I was never made to be a parent.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You certainly were. You explained how you became one: through sudden adoption prompted by loss of your family.&lt;/p&gt;\n\n&lt;p&gt;Additionally, video counseling is a thing these days.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ihch", "score_hidden": false, "stickied": false, "created": 1492003024.0, "created_utc": 1491974224.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5hpyg", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "lightbulbfragment", "parent_id": "t1_dg5gjsh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Give yourself more credit. You stepped up in a huge way when it would have been very easy to give in to your grief. It sounds like you have dealt with this situation as well as anyone could. Therapy for her is probably a good idea. \n\nDo you talk with her about her parents? My parents are living but as a kid I secretly loved hearing people tell me the ways that I was similar to my parents. It made me proud. Maybe telling her things like that would help when she has others trying to make her ashamed of her family. \n\nIs there any where she could take martial arts classes in your area? Not to learn to fight but for the big confidence boost it can give kids. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Give yourself more credit. You stepped up in a huge way when it would have been very easy to give in to your grief. It sounds like you have dealt with this situation as well as anyone could. Therapy for her is probably a good idea. &lt;/p&gt;\n\n&lt;p&gt;Do you talk with her about her parents? My parents are living but as a kid I secretly loved hearing people tell me the ways that I was similar to my parents. It made me proud. Maybe telling her things like that would help when she has others trying to make her ashamed of her family. &lt;/p&gt;\n\n&lt;p&gt;Is there any where she could take martial arts classes in your area? Not to learn to fight but for the big confidence boost it can give kids. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hpyg", "score_hidden": false, "stickied": false, "created": 1492001578.0, "created_utc": 1491972778.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5m6wp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "jmurphy42", "parent_id": "t1_dg5gjsh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My daughter is in therapy for an anxiety disorder. It's honestly the best thing I've ever done for her. It's made a huge difference in her stress levels, resiliency, coping skills, and general outlook on life.\n\nThe parent appointments have also been a godsend. The therapist gives me really useful insight into how my daughter's brain works, and has really helped me to parent my kid better.\n\nI completely understand not wanting to use your friend as a therapist, but you should absolutely tell her what's going on and ask her if she can refer you to someone good nearby.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My daughter is in therapy for an anxiety disorder. It&amp;#39;s honestly the best thing I&amp;#39;ve ever done for her. It&amp;#39;s made a huge difference in her stress levels, resiliency, coping skills, and general outlook on life.&lt;/p&gt;\n\n&lt;p&gt;The parent appointments have also been a godsend. The therapist gives me really useful insight into how my daughter&amp;#39;s brain works, and has really helped me to parent my kid better.&lt;/p&gt;\n\n&lt;p&gt;I completely understand not wanting to use your friend as a therapist, but you should absolutely tell her what&amp;#39;s going on and ask her if she can refer you to someone good nearby.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5m6wp", "score_hidden": false, "stickied": false, "created": 1492011981.0, "created_utc": 1491983181.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5tcaw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "alcimedes", "parent_id": "t1_dg5gjsh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Based on what I read, you sound like a natural to me, way above the average.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Based on what I read, you sound like a natural to me, way above the average.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5tcaw", "score_hidden": false, "stickied": false, "created": 1492030358.0, "created_utc": 1492001558.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ulj4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "phoenix_silaqui", "parent_id": "t1_dg5gjsh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There are several really good resources that provide online therapy and counseling. In whatever method or manner you prefer (text, e-mail, Skype or Facetime and probably more options I'm not thinking of). This could really be useful for you. I'm not sure if they can prescribe anything like that, but you could definitely find someone who is a complete stranger to be your therapist and maybe take your daughter to see your friend. She will probably have suggestions after a visit or two of who would be the most convenient and also best fit if she does not feel able to handle your daughter as well.*\n\n*not that I think she might have more serious issues, just that there are specialties and dealing with kids is a whole different animal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are several really good resources that provide online therapy and counseling. In whatever method or manner you prefer (text, e-mail, Skype or Facetime and probably more options I&amp;#39;m not thinking of). This could really be useful for you. I&amp;#39;m not sure if they can prescribe anything like that, but you could definitely find someone who is a complete stranger to be your therapist and maybe take your daughter to see your friend. She will probably have suggestions after a visit or two of who would be the most convenient and also best fit if she does not feel able to handle your daughter as well.*&lt;/p&gt;\n\n&lt;p&gt;*not that I think she might have more serious issues, just that there are specialties and dealing with kids is a whole different animal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ulj4", "score_hidden": false, "stickied": false, "created": 1492032275.0, "created_utc": 1492003475.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5um4z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "albeaner", "parent_id": "t1_dg5gjsh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "No one is a natural parent. Part of being a parent is realizing that you are not equipped to deal with everything, and knowing when to call in reinforcements or other professionals.\n\nGo to a nearby town. You owe this to her. It will not reflect poorly on your capability as a parent. Rather, quite the opposite.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one is a natural parent. Part of being a parent is realizing that you are not equipped to deal with everything, and knowing when to call in reinforcements or other professionals.&lt;/p&gt;\n\n&lt;p&gt;Go to a nearby town. You owe this to her. It will not reflect poorly on your capability as a parent. Rather, quite the opposite.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5um4z", "score_hidden": false, "stickied": false, "created": 1492032299.0, "created_utc": 1492003499.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gjsh", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5d8ld", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; I would consider therapy for your daughter\n\nI have, too. The emotional side of me wants to resist because it'll feel like I'm acknowledging just how much she's hurting, but obviously that's selfish and stupid. I've been raising her for 9 years, but I still constantly face problems that I just don't feel equipped to handle. I was never made to be a parent. My brother was a natural - I'm just not.\n\n&gt; Have you considered therapy for you?\n\nI have. The problem is that there is only one psychiatrist in my town and she's one of my best friends, so it'd be weird seeing her in a professional sort of setting. As for psychologists and therapists, our town is woefully lacking. I might look into going to a nearby town, though, if worst comes to worst. Thanks for the advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I would consider therapy for your daughter&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have, too. The emotional side of me wants to resist because it&amp;#39;ll feel like I&amp;#39;m acknowledging just how much she&amp;#39;s hurting, but obviously that&amp;#39;s selfish and stupid. I&amp;#39;ve been raising her for 9 years, but I still constantly face problems that I just don&amp;#39;t feel equipped to handle. I was never made to be a parent. My brother was a natural - I&amp;#39;m just not.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Have you considered therapy for you?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have. The problem is that there is only one psychiatrist in my town and she&amp;#39;s one of my best friends, so it&amp;#39;d be weird seeing her in a professional sort of setting. As for psychologists and therapists, our town is woefully lacking. I might look into going to a nearby town, though, if worst comes to worst. Thanks for the advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5gjsh", "score_hidden": false, "stickied": false, "created": 1491999488.0, "created_utc": 1491970688.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5d8ld", "gilded": 0, "archived": false, "score": 80, "report_reasons": null, "author": "samesongnewverse", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I first want to extend to the both of you my condolences and heartfelt sympathy. What a horrifying situation for you, and a confusing one for her; heartbreaking for you both.\n\nI would consider therapy for your daughter (yes, daughter. You are raising and loving her as your own, and she does know and recognize that on a deep level). She is having a hell of a time being beset by her peers with obnoxious, noxious taunting and bullying. A therapist can help her sort her feelings and guide her into strategies for dealing with those heartless little monsters. Her desire to distance herself from you sounds like a confused and upset little girl trying to claim her place in the world. As she grows more, she will always have you and the security that you are, for all intents and purposes, her dad. I know how painful it is that she is exploring all of this in the manner she is, but I don't think it means she loves you any less. Given time, I would imagine she will go back to calling you dad, as well.\n\nHave you considered therapy for you? Even a few sessions can give you a place to get the recurring grief and new aches off your chest. Perhaps also, it could give you coping techniques. It does sound like you are doing your very best, and I commend you so much for doing the impossible and putting aside your own pain to raise your little girl. Best wishes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I first want to extend to the both of you my condolences and heartfelt sympathy. What a horrifying situation for you, and a confusing one for her; heartbreaking for you both.&lt;/p&gt;\n\n&lt;p&gt;I would consider therapy for your daughter (yes, daughter. You are raising and loving her as your own, and she does know and recognize that on a deep level). She is having a hell of a time being beset by her peers with obnoxious, noxious taunting and bullying. A therapist can help her sort her feelings and guide her into strategies for dealing with those heartless little monsters. Her desire to distance herself from you sounds like a confused and upset little girl trying to claim her place in the world. As she grows more, she will always have you and the security that you are, for all intents and purposes, her dad. I know how painful it is that she is exploring all of this in the manner she is, but I don&amp;#39;t think it means she loves you any less. Given time, I would imagine she will go back to calling you dad, as well.&lt;/p&gt;\n\n&lt;p&gt;Have you considered therapy for you? Even a few sessions can give you a place to get the recurring grief and new aches off your chest. Perhaps also, it could give you coping techniques. It does sound like you are doing your very best, and I commend you so much for doing the impossible and putting aside your own pain to raise your little girl. Best wishes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5d8ld", "score_hidden": false, "stickied": false, "created": 1491994383.0, "created_utc": 1491965583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 80}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5hp9d", "gilded": 0, "archived": false, "score": 35, "report_reasons": null, "author": "adhdcombinationokay", "parent_id": "t1_dg5glpi", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We're nearing the end of the school year. Can you discretely ask that they are in separate classes next year? Presumably kids class make up changes year to year. They may not notice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;re nearing the end of the school year. Can you discretely ask that they are in separate classes next year? Presumably kids class make up changes year to year. They may not notice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hp9d", "score_hidden": false, "stickied": false, "created": 1492001542.0, "created_utc": 1491972742.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 35}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5hr7u", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Pamzella", "parent_id": "t1_dg5glpi", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It is at least worth talking to the administration about what's happening and how she's being targeted. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is at least worth talking to the administration about what&amp;#39;s happening and how she&amp;#39;s being targeted. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hr7u", "score_hidden": false, "stickied": false, "created": 1492001646.0, "created_utc": 1491972846.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5hu9m", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "lightbulbfragment", "parent_id": "t1_dg5glpi", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I was bullied in 6th grade. Unfortunately the bully was my teacher but that's another story. When my parents insisted I be moved to another class there was definitely some whispering. Ultimately I didn't care. I explained to the other kids what had happened. It was like a huge weight had been lifted off of me getting out of that toxic environment. Maybe a classroom change would accomplish the same for your daughter? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was bullied in 6th grade. Unfortunately the bully was my teacher but that&amp;#39;s another story. When my parents insisted I be moved to another class there was definitely some whispering. Ultimately I didn&amp;#39;t care. I explained to the other kids what had happened. It was like a huge weight had been lifted off of me getting out of that toxic environment. Maybe a classroom change would accomplish the same for your daughter? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hu9m", "score_hidden": false, "stickied": false, "created": 1492001804.0, "created_utc": 1491973004.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5wcwo", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "AberrantRambler", "parent_id": "t1_dg5glpi", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It might be worth pointing out to the school that those students have targeted your daughter at least partially because of race and if anything were to happen you want to know exactly how the school handles \"hate crimes\" \"in case things escalate\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might be worth pointing out to the school that those students have targeted your daughter at least partially because of race and if anything were to happen you want to know exactly how the school handles &amp;quot;hate crimes&amp;quot; &amp;quot;in case things escalate&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5wcwo", "score_hidden": false, "stickied": false, "created": 1492034642.0, "created_utc": 1492005842.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ndc9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Schwingalingaling", "parent_id": "t1_dg5glpi", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "A few days while people adjust is preferable to daily torture... yes look into moving her - perhaps at the end of the school year so it's not so obvious?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A few days while people adjust is preferable to daily torture... yes look into moving her - perhaps at the end of the school year so it&amp;#39;s not so obvious?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ndc9", "score_hidden": false, "stickied": false, "created": 1492015569.0, "created_utc": 1491986769.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg6985q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "inkathebadger", "parent_id": "t1_dg5glpi", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I've been through the school system with bullies and I'm the oldest of four kids. I assume by the Catholic school board note you are in Ontario? Good news they are supposed to document every single complaint. It doesn't matter if these kids are related to the Queen of England. Look up the anti-bullying legislation and meet with the admin again. If they brush it off (which considering the racist nature of the taunts they sure as hell better not cause you got a bigger case there alone) quote the law. Print it off and read it verbatim if need be.\n\nYour going to need to be an advocate for your daughter. Tell her to tell the teachers and you. Tell them if she complains about bullying you want an email about it by days end (in writing you do not want from them not a phone call). Build a paper trail. \n\nKids can be assholes but show her how to protect herself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been through the school system with bullies and I&amp;#39;m the oldest of four kids. I assume by the Catholic school board note you are in Ontario? Good news they are supposed to document every single complaint. It doesn&amp;#39;t matter if these kids are related to the Queen of England. Look up the anti-bullying legislation and meet with the admin again. If they brush it off (which considering the racist nature of the taunts they sure as hell better not cause you got a bigger case there alone) quote the law. Print it off and read it verbatim if need be.&lt;/p&gt;\n\n&lt;p&gt;Your going to need to be an advocate for your daughter. Tell her to tell the teachers and you. Tell them if she complains about bullying you want an email about it by days end (in writing you do not want from them not a phone call). Build a paper trail. &lt;/p&gt;\n\n&lt;p&gt;Kids can be assholes but show her how to protect herself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6985q", "score_hidden": false, "stickied": false, "created": 1492048549.0, "created_utc": 1492019749.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5glpi", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5c5gb", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There are only two schools in my town, unfortunately. One is a Catholic school (open to everyone, but I won't send her there for ethical reasons that are not really relevant here). I'm considering asking the administration to put her (or the bullies) in a different class, but I think that might make her other classmates more aware of everything and make her feel uncomfortable. What do you think?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are only two schools in my town, unfortunately. One is a Catholic school (open to everyone, but I won&amp;#39;t send her there for ethical reasons that are not really relevant here). I&amp;#39;m considering asking the administration to put her (or the bullies) in a different class, but I think that might make her other classmates more aware of everything and make her feel uncomfortable. What do you think?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5glpi", "score_hidden": false, "stickied": false, "created": 1491999578.0, "created_utc": 1491970778.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5c5gb", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Schwingalingaling", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Man that's rough. I suggest family therapy for he two of you. And perhaps try role playing so that she gets some confidence in how to deal with the bullies. \n\nTbh though, although you might not be at this point yet, don't forget you can change schools. You wouldn't stay at a job if you hated every day (unless you had no choice of course). I moved schools and it gave me a fresh start and made all the difference.\n\nI wIsh you guys all the best. Ten years from now she'll realise how hurtful it is to say this to you but for now - just keep being there for her. You sound like an amazing dad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man that&amp;#39;s rough. I suggest family therapy for he two of you. And perhaps try role playing so that she gets some confidence in how to deal with the bullies. &lt;/p&gt;\n\n&lt;p&gt;Tbh though, although you might not be at this point yet, don&amp;#39;t forget you can change schools. You wouldn&amp;#39;t stay at a job if you hated every day (unless you had no choice of course). I moved schools and it gave me a fresh start and made all the difference.&lt;/p&gt;\n\n&lt;p&gt;I wIsh you guys all the best. Ten years from now she&amp;#39;ll realise how hurtful it is to say this to you but for now - just keep being there for her. You sound like an amazing dad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5c5gb", "score_hidden": false, "stickied": false, "created": 1491992868.0, "created_utc": 1491964068.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5j8u4", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Daddy-Pig", "parent_id": "t1_dg5hjce", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There is something to be said about being called a certain thing though and being able to truthfully call somebody by it. I'm not sure if OP feels this way, but I know that one of the hardest things to live with since my mum died (I was an only child and she was a single parent) was that ever since March 2003, I've not been able to call anybody 'Mum'. It's a seemingly insignificant thing, but it is far more than just a label to me. I was adopted into another family at 13 and had two parent figures there and I call them 'mum and dad' in third person, but have never been able to do it to their face. At the same time though, I would be very hurt if any of my adopted family stopped referring to me as their 'brother' or 'son'. I'm in my late twenties now and it's still just as important to me, so while labels may not matter to some, they can mean a lot to others.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is something to be said about being called a certain thing though and being able to truthfully call somebody by it. I&amp;#39;m not sure if OP feels this way, but I know that one of the hardest things to live with since my mum died (I was an only child and she was a single parent) was that ever since March 2003, I&amp;#39;ve not been able to call anybody &amp;#39;Mum&amp;#39;. It&amp;#39;s a seemingly insignificant thing, but it is far more than just a label to me. I was adopted into another family at 13 and had two parent figures there and I call them &amp;#39;mum and dad&amp;#39; in third person, but have never been able to do it to their face. At the same time though, I would be very hurt if any of my adopted family stopped referring to me as their &amp;#39;brother&amp;#39; or &amp;#39;son&amp;#39;. I&amp;#39;m in my late twenties now and it&amp;#39;s still just as important to me, so while labels may not matter to some, they can mean a lot to others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5j8u4", "score_hidden": false, "stickied": false, "created": 1492004559.0, "created_utc": 1491975759.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hjce", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "GlabadosChurch", "parent_id": "t1_dg5d4g3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I totally agree with this.  Those are just the words of a confused 9 year old.  You love her and I like to believe she loves you too OP.  That's all that really matters.  Labels are just that, labels.  \"Uncle\" \"step-dad\" etc. doesn't really matter.  People know who love them and raised them.\n\nI would also consider therapy as others suggested but as someone that loves his dad (technically step-dad but he is my father as far as I'm concerned), despite not being biologically related I don't think titles matter too much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I totally agree with this.  Those are just the words of a confused 9 year old.  You love her and I like to believe she loves you too OP.  That&amp;#39;s all that really matters.  Labels are just that, labels.  &amp;quot;Uncle&amp;quot; &amp;quot;step-dad&amp;quot; etc. doesn&amp;#39;t really matter.  People know who love them and raised them.&lt;/p&gt;\n\n&lt;p&gt;I would also consider therapy as others suggested but as someone that loves his dad (technically step-dad but he is my father as far as I&amp;#39;m concerned), despite not being biologically related I don&amp;#39;t think titles matter too much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hjce", "score_hidden": false, "stickied": false, "created": 1492001242.0, "created_utc": 1491972442.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5d4g3", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Snowflake41", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You sound like a wonderful Dad. All kids push back against their parents, and this is especially painful because of the situation you are in. Don't let it rock you or doubt yourself. She needs you and is testing that. Be the same guy yoy always have been. Go along with her requests, but you both need to work through this with supportive therapists. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like a wonderful Dad. All kids push back against their parents, and this is especially painful because of the situation you are in. Don&amp;#39;t let it rock you or doubt yourself. She needs you and is testing that. Be the same guy yoy always have been. Go along with her requests, but you both need to work through this with supportive therapists. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5d4g3", "score_hidden": false, "stickied": false, "created": 1491994221.0, "created_utc": 1491965421.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5f8su", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ElleAnn42", "parent_id": "t1_dg5ebpx", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think that this post hits the nail on the head. She might also be testing you in a way--if you are really her dad you'll fight to not be demoted to uncle. Tell her in clear and simple language that you will always be her dad and that you will always love her no matter what. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that this post hits the nail on the head. She might also be testing you in a way--if you are really her dad you&amp;#39;ll fight to not be demoted to uncle. Tell her in clear and simple language that you will always be her dad and that you will always love her no matter what. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5f8su", "score_hidden": false, "stickied": false, "created": 1491997351.0, "created_utc": 1491968551.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5hcsc", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5h7te", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Cheers!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cheers!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hcsc", "score_hidden": false, "stickied": false, "created": 1492000909.0, "created_utc": 1491972109.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5h7te", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "kaossfusion", "parent_id": "t1_dg5gf1x", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "As someone living in Northern Ontario who also lived in Toronto for several years, I just want to empathize with how hard it is to find competent doctors up here comparatively and how grateful I am that you are helping provide care to our community! \n\nI really hope the best for you in finding your place in the world with your daughter!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone living in Northern Ontario who also lived in Toronto for several years, I just want to empathize with how hard it is to find competent doctors up here comparatively and how grateful I am that you are helping provide care to our community! &lt;/p&gt;\n\n&lt;p&gt;I really hope the best for you in finding your place in the world with your daughter!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5h7te", "score_hidden": false, "stickied": false, "created": 1492000659.0, "created_utc": 1491971859.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5rgpy", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "charlottespider", "parent_id": "t1_dg5hc1a", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "But clearly ENOUGH of them are racist that your daughter is in a tremendous amount of pain.  She has to go to school every day and get tortured, and you're like: well, not *all* of them are racist...\n\nWait -- also in your post you say: \"Growing up, my brother and I faced a lot of racism.\"  Why on earth would you raise your daughter in this place?  It sounds awful.  Because she might one day have an outdoor party with a bunch of racists, you can't move to Toronto?  WTF.\n\nAnd what is up with the SCHOOL?  Why the hell are they letting this happen?  Why would you let her go to this school when it's killing her, and why haven't you gone in to talk to her teachers about this??", "edited": 1491998520.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But clearly ENOUGH of them are racist that your daughter is in a tremendous amount of pain.  She has to go to school every day and get tortured, and you&amp;#39;re like: well, not &lt;em&gt;all&lt;/em&gt; of them are racist...&lt;/p&gt;\n\n&lt;p&gt;Wait -- also in your post you say: &amp;quot;Growing up, my brother and I faced a lot of racism.&amp;quot;  Why on earth would you raise your daughter in this place?  It sounds awful.  Because she might one day have an outdoor party with a bunch of racists, you can&amp;#39;t move to Toronto?  WTF.&lt;/p&gt;\n\n&lt;p&gt;And what is up with the SCHOOL?  Why the hell are they letting this happen?  Why would you let her go to this school when it&amp;#39;s killing her, and why haven&amp;#39;t you gone in to talk to her teachers about this??&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5rgpy", "score_hidden": false, "stickied": false, "created": 1492026972.0, "created_utc": 1491998172.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5hc1a", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5h5ys", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I grew up in this town and I've known like a third of my neighbourhood since I was a kid. Most people in this town are far from racist and I won't let one incident sully my view of a town that has some of the friendliest people I know.\n\nI'm not sure where you're from, but small towns are different everywhere. Small town Ontario does not necessarily suffer from the same widespread racism as small town Mississippi (for example).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I grew up in this town and I&amp;#39;ve known like a third of my neighbourhood since I was a kid. Most people in this town are far from racist and I won&amp;#39;t let one incident sully my view of a town that has some of the friendliest people I know.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure where you&amp;#39;re from, but small towns are different everywhere. Small town Ontario does not necessarily suffer from the same widespread racism as small town Mississippi (for example).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5hc1a", "score_hidden": false, "stickied": false, "created": 1492000872.0, "created_utc": 1491972072.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5qam4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "bob_cock", "parent_id": "t1_dg5j276", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Unfortunately, there are many small towns like that. I am sorry you and your family had to deal with that, no one should have to. It sounds like you guys are in a better place now! I live in the PNW, my experience with small towns has been good, and that is as a Mexican. But it is the PNW.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately, there are many small towns like that. I am sorry you and your family had to deal with that, no one should have to. It sounds like you guys are in a better place now! I live in the PNW, my experience with small towns has been good, and that is as a Mexican. But it is the PNW.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5qam4", "score_hidden": false, "stickied": false, "created": 1492024351.0, "created_utc": 1491995551.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5j276", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "killingnazis1945", "parent_id": "t1_dg5ic7b", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "In case it matters I lived in what was historically a sundown town 2 hours out of st louis that was 98.5% white.  i'm not saying that it's chock full of racists or that all the people were huge racists deep down in their heart of hearts or whatever, but my SO would be That One Nonwhite Guy and my kids would be That One Nonwhite Kid In Class if we lived there.  We live in a diverse big city where they aren't burdened with standing out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In case it matters I lived in what was historically a sundown town 2 hours out of st louis that was 98.5% white.  i&amp;#39;m not saying that it&amp;#39;s chock full of racists or that all the people were huge racists deep down in their heart of hearts or whatever, but my SO would be That One Nonwhite Guy and my kids would be That One Nonwhite Kid In Class if we lived there.  We live in a diverse big city where they aren&amp;#39;t burdened with standing out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5j276", "score_hidden": false, "stickied": false, "created": 1492004176.0, "created_utc": 1491975376.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ic7b", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "bob_cock", "parent_id": "t1_dg5h5ys", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This could not be further from the truth. There is no constant for how people are in a town. There are plenty of small towns, tiny towns that are not chock full of racists as you indicate, just as there are plenty of large cities with racist people. Please don't generalize like that, i'd hate for someone considering moving to small town to think they are all racist and decide to not do so.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This could not be further from the truth. There is no constant for how people are in a town. There are plenty of small towns, tiny towns that are not chock full of racists as you indicate, just as there are plenty of large cities with racist people. Please don&amp;#39;t generalize like that, i&amp;#39;d hate for someone considering moving to small town to think they are all racist and decide to not do so.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ic7b", "score_hidden": false, "stickied": false, "created": 1492002750.0, "created_utc": 1491973950.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5h5ys", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "killingnazis1945", "parent_id": "t1_dg5gf1x", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "After living in suburbs, a small town, and various medium to large cities, there is no way in hell I would raise mixed kids in a small town. \n\n Not a day would go by where they wouldn't be reminded that they're different from all the other kids.  Negotiating the race issue would suck up so much mental energy and brain space. \n\n In a city, the race issue isn't even on my radar most of the time.  All that mental energy can be put to better use.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After living in suburbs, a small town, and various medium to large cities, there is no way in hell I would raise mixed kids in a small town. &lt;/p&gt;\n\n&lt;p&gt;Not a day would go by where they wouldn&amp;#39;t be reminded that they&amp;#39;re different from all the other kids.  Negotiating the race issue would suck up so much mental energy and brain space. &lt;/p&gt;\n\n&lt;p&gt;In a city, the race issue isn&amp;#39;t even on my radar most of the time.  All that mental energy can be put to better use.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5h5ys", "score_hidden": false, "stickied": false, "created": 1492000568.0, "created_utc": 1491971768.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ua89", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "liseux", "parent_id": "t1_dg5gf1x", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Can you speak privately with the teachers? Do they know her history and what is being said by the kids? As a former teacher, I would like to know. I'd like to address things like this because it's impossible to hear everything kids say in the classroom and it's impossible to know how deeply some things can affect certain kids. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you speak privately with the teachers? Do they know her history and what is being said by the kids? As a former teacher, I would like to know. I&amp;#39;d like to address things like this because it&amp;#39;s impossible to hear everything kids say in the classroom and it&amp;#39;s impossible to know how deeply some things can affect certain kids. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ua89", "score_hidden": false, "stickied": false, "created": 1492031818.0, "created_utc": 1492003018.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gf1x", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5ebpx", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thanks for the response! I do want to address your last paragraph, though.\n\n&gt; The only other thing I can suggest is move somewhere more urban and diverse. We live in a big city and my family is mixed white and Indian and no one has ever given us shit for it.\n\nI've seriously considered this before (for unrelated reasons), and I have to admit that this incident is making me consider it again. However, unless the situation gets worse, I don't think I will. I grew up in this town, and I think that this community needs me. I realize how pretentious these next sentences are going to sound, but please bear with me. This is a northern Ontario town (of medium size). All of the doctors here (other than myself) graduated from the Northern Ontario School of Medicine. Because Northern Ontario has such a need for doctors, this school admits anyone who is from Northern Ontario, to the point that people with undergrad GPAs of 3.5-3.6 are getting in. It's ridiculous. The positive side is that our communities are no longer as strapped for doctors as we were a couple decades ago. The downside is that most of the doctors just suck. Again, I realize how pretentious that sounds (a small-town kid going to the University of Toronto, then coming back and thinking that he's better than everyone who went to the local school). Still, the few other doctors here in Northern Ontario that went to more reputable schools completely agree with me - every single one. I feel like I have an obligation to my community to provide adequate medical care, and I would feel incredibly guilty for leaving.\n\nMy first priority is of course to her, but I'd rather see if the problem resolves itself instead of immediately abandoning my home.\n\nI also would really miss our camping trips, and I know she would too. There are a ton of reasons not to go, for both of us. Hell, even stupid shit like the outdoor parties we used to throw in high school. Can't do stuff like that in the cities, and I wouldn't want her to miss out on that sort of stuff when she gets older.\n\nThat being said, the twelve years I spent in Toronto were the best years of my life, so who knows?", "edited": 1491971405.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the response! I do want to address your last paragraph, though.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The only other thing I can suggest is move somewhere more urban and diverse. We live in a big city and my family is mixed white and Indian and no one has ever given us shit for it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;ve seriously considered this before (for unrelated reasons), and I have to admit that this incident is making me consider it again. However, unless the situation gets worse, I don&amp;#39;t think I will. I grew up in this town, and I think that this community needs me. I realize how pretentious these next sentences are going to sound, but please bear with me. This is a northern Ontario town (of medium size). All of the doctors here (other than myself) graduated from the Northern Ontario School of Medicine. Because Northern Ontario has such a need for doctors, this school admits anyone who is from Northern Ontario, to the point that people with undergrad GPAs of 3.5-3.6 are getting in. It&amp;#39;s ridiculous. The positive side is that our communities are no longer as strapped for doctors as we were a couple decades ago. The downside is that most of the doctors just suck. Again, I realize how pretentious that sounds (a small-town kid going to the University of Toronto, then coming back and thinking that he&amp;#39;s better than everyone who went to the local school). Still, the few other doctors here in Northern Ontario that went to more reputable schools completely agree with me - every single one. I feel like I have an obligation to my community to provide adequate medical care, and I would feel incredibly guilty for leaving.&lt;/p&gt;\n\n&lt;p&gt;My first priority is of course to her, but I&amp;#39;d rather see if the problem resolves itself instead of immediately abandoning my home.&lt;/p&gt;\n\n&lt;p&gt;I also would really miss our camping trips, and I know she would too. There are a ton of reasons not to go, for both of us. Hell, even stupid shit like the outdoor parties we used to throw in high school. Can&amp;#39;t do stuff like that in the cities, and I wouldn&amp;#39;t want her to miss out on that sort of stuff when she gets older.&lt;/p&gt;\n\n&lt;p&gt;That being said, the twelve years I spent in Toronto were the best years of my life, so who knows?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5gf1x", "score_hidden": false, "stickied": false, "created": 1491999258.0, "created_utc": 1491970458.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ebpx", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "killingnazis1945", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "As kids hit mature and hit developmental milestones, they have to use their new brain capacities to \"re-grieve\" their losses.  As her brain matures, she's going to get hit with more and more insights into what she loss.\n\nYou're right that you are her dad in that you're the only parental figure in her life, but she doesn't know how to reconcile that the knowledge that she had another mom and dad, and she doesn't know how to honor the relationship she never got to have with them.  I don't have any advice because her emotions are going to be complicated as hell and they are only going to get more complicated as her brain gets more complicated over the next few years.\n\nThe only other thing I can suggest is move somewhere more urban and diverse.  We live in a big city and my family is mixed white and Indian and no one has ever given us shit for it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As kids hit mature and hit developmental milestones, they have to use their new brain capacities to &amp;quot;re-grieve&amp;quot; their losses.  As her brain matures, she&amp;#39;s going to get hit with more and more insights into what she loss.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re right that you are her dad in that you&amp;#39;re the only parental figure in her life, but she doesn&amp;#39;t know how to reconcile that the knowledge that she had another mom and dad, and she doesn&amp;#39;t know how to honor the relationship she never got to have with them.  I don&amp;#39;t have any advice because her emotions are going to be complicated as hell and they are only going to get more complicated as her brain gets more complicated over the next few years.&lt;/p&gt;\n\n&lt;p&gt;The only other thing I can suggest is move somewhere more urban and diverse.  We live in a big city and my family is mixed white and Indian and no one has ever given us shit for it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ebpx", "score_hidden": false, "stickied": false, "created": 1491995947.0, "created_utc": 1491967147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ci2t", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Iamyourmummy", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I will also recommend therapy. A lot of adoption specialists and advocates are suggesting that every adoptee receives counseling, even in an open and otherwise unremarkable adoption.\n\nAlmost every adoptee will at some point or another work through the grief that comes with loosing one's birth family - and in your situation the situation was especially tragic, so her reaction seems appropriate, even if she doesn't remember her birth family or the accident. It sounds like you would both benefit from counseling.\nMaybe also consider posting an r/adoption for input from other adoptees. You might find it quite reassuring.\n\nOne other thing: do not let the bullying go. If you have not YOU need to speak to the teacher (even if your kid doesn't want you to) AND the principal. You need to ask/demand that the school address the issue and communicates to you how they are planning to remedy it. If that does not yield satisfactory results you need to work your way up the ladder. It doesn't matter what your kid is being bullied for, it is not acceptable and the school has a responsibility to provide a physically and emotionally safe environment for your child.\n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will also recommend therapy. A lot of adoption specialists and advocates are suggesting that every adoptee receives counseling, even in an open and otherwise unremarkable adoption.&lt;/p&gt;\n\n&lt;p&gt;Almost every adoptee will at some point or another work through the grief that comes with loosing one&amp;#39;s birth family - and in your situation the situation was especially tragic, so her reaction seems appropriate, even if she doesn&amp;#39;t remember her birth family or the accident. It sounds like you would both benefit from counseling.\nMaybe also consider posting an &lt;a href=\"/r/adoption\"&gt;r/adoption&lt;/a&gt; for input from other adoptees. You might find it quite reassuring.&lt;/p&gt;\n\n&lt;p&gt;One other thing: do not let the bullying go. If you have not YOU need to speak to the teacher (even if your kid doesn&amp;#39;t want you to) AND the principal. You need to ask/demand that the school address the issue and communicates to you how they are planning to remedy it. If that does not yield satisfactory results you need to work your way up the ladder. It doesn&amp;#39;t matter what your kid is being bullied for, it is not acceptable and the school has a responsibility to provide a physically and emotionally safe environment for your child.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ci2t", "score_hidden": false, "stickied": false, "created": 1491993354.0, "created_utc": 1491964554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5d030", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Peacefulchick", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "In regards to the bullying you defiantly need to speak to the principal because the teacher isn't taking care of it. It may take more than one trip (speaking from experience, some kids are just relentless). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In regards to the bullying you defiantly need to speak to the principal because the teacher isn&amp;#39;t taking care of it. It may take more than one trip (speaking from experience, some kids are just relentless). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5d030", "score_hidden": false, "stickied": false, "created": 1491994054.0, "created_utc": 1491965254.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5gpui", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5gmfy", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for the advice!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the advice!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5gpui", "score_hidden": false, "stickied": false, "created": 1491999781.0, "created_utc": 1491970981.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gmfy", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "miparasito", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "What kind of asshole kids make fun of someone for living through a tragedy like that? Wow. \n\nKids will go through stages that can be hurtful. Try not to internalize it. She knows you're her dad even if you aren't her father. It's not about you, this is nothing you did or didn't do. Right now she's hurting and came up with this as a way to quell some intense emotions. Don't let it hurt your feelings or make a big deal about it. Tell her \"I will always be your dad. If you want to call me something else, that's fine. Just know that in my mind I will always translate 'Uncle' as Dad.\"\n\nIt's kind of like when a toddler says \"I hate you!\" -- they just feel overwhelmed and don't know how else to express it. If you let it hurt your feelings, you're sunk. Instead you say \"I know you feel that way. Just know that I always love you no matter what.\"\nSo the message is: *it's okay to have these feelings. It's safe to express them. I am a strong adult, I would rather absorb the pain than leave it to you to deal with on your own.*\n\nGood luck. &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kind of asshole kids make fun of someone for living through a tragedy like that? Wow. &lt;/p&gt;\n\n&lt;p&gt;Kids will go through stages that can be hurtful. Try not to internalize it. She knows you&amp;#39;re her dad even if you aren&amp;#39;t her father. It&amp;#39;s not about you, this is nothing you did or didn&amp;#39;t do. Right now she&amp;#39;s hurting and came up with this as a way to quell some intense emotions. Don&amp;#39;t let it hurt your feelings or make a big deal about it. Tell her &amp;quot;I will always be your dad. If you want to call me something else, that&amp;#39;s fine. Just know that in my mind I will always translate &amp;#39;Uncle&amp;#39; as Dad.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s kind of like when a toddler says &amp;quot;I hate you!&amp;quot; -- they just feel overwhelmed and don&amp;#39;t know how else to express it. If you let it hurt your feelings, you&amp;#39;re sunk. Instead you say &amp;quot;I know you feel that way. Just know that I always love you no matter what.&amp;quot;\nSo the message is: &lt;em&gt;it&amp;#39;s okay to have these feelings. It&amp;#39;s safe to express them. I am a strong adult, I would rather absorb the pain than leave it to you to deal with on your own.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Good luck. &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5gmfy", "score_hidden": false, "stickied": false, "created": 1491999612.0, "created_utc": 1491970812.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5kugw", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "fruitjerky", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Honestly, I would sit her down and tell her that, after thinking about it, you aren't willing to let racists weaken your family or come between your relationship. That you'll support her choice if she wants to call you Uncle, but that you need her to understand that she *is* your daughter and you feel more comfortable sticking with that.  \n  \nShe's nine. She needs you to rally for her and show the strength of your conviction, not to cow to the poison planted by racism. Show your daughter how to be brave by telling her that, no, you aren't willing to let racism weaken your family.  \n  \nI teach her grade. Kids are fickle. I get \"I love you\" and \"You're the best teacher\" and \"I hate you\" and even \"I'm going to tell my daddy to get you fired\" from the same kids regularly. Don't jump right into shifting your whole family dynamic over this. You are her dad. Dad is the man that's by your side, raising you. She doesn't get to put that aside so easily, whether it's out of hurt or fear or anger.  \n  \nYou also need to contact the principal to be sure the bullying is handled. If you aren't satisfied with their handling of it, contact the superintendent. I would also consider posting in /r/legaladvice", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, I would sit her down and tell her that, after thinking about it, you aren&amp;#39;t willing to let racists weaken your family or come between your relationship. That you&amp;#39;ll support her choice if she wants to call you Uncle, but that you need her to understand that she &lt;em&gt;is&lt;/em&gt; your daughter and you feel more comfortable sticking with that.  &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s nine. She needs you to rally for her and show the strength of your conviction, not to cow to the poison planted by racism. Show your daughter how to be brave by telling her that, no, you aren&amp;#39;t willing to let racism weaken your family.  &lt;/p&gt;\n\n&lt;p&gt;I teach her grade. Kids are fickle. I get &amp;quot;I love you&amp;quot; and &amp;quot;You&amp;#39;re the best teacher&amp;quot; and &amp;quot;I hate you&amp;quot; and even &amp;quot;I&amp;#39;m going to tell my daddy to get you fired&amp;quot; from the same kids regularly. Don&amp;#39;t jump right into shifting your whole family dynamic over this. You are her dad. Dad is the man that&amp;#39;s by your side, raising you. She doesn&amp;#39;t get to put that aside so easily, whether it&amp;#39;s out of hurt or fear or anger.  &lt;/p&gt;\n\n&lt;p&gt;You also need to contact the principal to be sure the bullying is handled. If you aren&amp;#39;t satisfied with their handling of it, contact the superintendent. I would also consider posting in &lt;a href=\"/r/legaladvice\"&gt;/r/legaladvice&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5kugw", "score_hidden": false, "stickied": false, "created": 1492008313.0, "created_utc": 1491979513.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5khik", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Sontlux", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'd move her to a different school.  The pressure of a child's peers is so ridiculously formative, far more influential than any action a parent can take.  You could side step a lot of torment for her by changing her situation.  With your whole family dead (sorry if this sounds callous), you really have nothing tieing you to this place except pain.  Do whatever it takes to protect the love and happiness you two have.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d move her to a different school.  The pressure of a child&amp;#39;s peers is so ridiculously formative, far more influential than any action a parent can take.  You could side step a lot of torment for her by changing her situation.  With your whole family dead (sorry if this sounds callous), you really have nothing tieing you to this place except pain.  Do whatever it takes to protect the love and happiness you two have.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5khik", "score_hidden": false, "stickied": false, "created": 1492007410.0, "created_utc": 1491978610.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5c4sj", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ricodemus", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I can't relate to most of your problem but I would venture to guess she is just upset and she doesn't know how to handle it. What I can say is I've probably said some terrible shit to my parents when I was growing up with no real understanding of how much it could hurt them. There's nothing wrong with being upset but I'm sure she'll come around when she gets a grasp of the big picture. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t relate to most of your problem but I would venture to guess she is just upset and she doesn&amp;#39;t know how to handle it. What I can say is I&amp;#39;ve probably said some terrible shit to my parents when I was growing up with no real understanding of how much it could hurt them. There&amp;#39;s nothing wrong with being upset but I&amp;#39;m sure she&amp;#39;ll come around when she gets a grasp of the big picture. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5c4sj", "score_hidden": false, "stickied": false, "created": 1491992843.0, "created_utc": 1491964043.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5syyf", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "sugarbearnoah", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I was adopted by white parents and I am Bolivian. They also adopted two other boys who are Guatemalan and Bolivian. We look nothing alike and my parents and myself would always get stupid questions about or family. All three of us went through a phase of not wanting them to be our parents, even though we were raised from infants by them. Adoption is hard sometimes. Especially when it's so noticeable to other people that this isn't your mom or dad. \nI don't want to downplay your neices feelings, it seems like she needs counseling. Neither myself or my brothers were bullied like that about our adoption.\nI guess, I just wanted to offer perspective as an adoptee that it's hard for us and I went through a phase of being mean. I would tell my dad he isn't my real dad and I hated him ECT ECT. My brothers also lashed out in their own ways. \nEventually, we got though it. So hopefully, this is just a temporary phase while your niece works through everything in her own time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was adopted by white parents and I am Bolivian. They also adopted two other boys who are Guatemalan and Bolivian. We look nothing alike and my parents and myself would always get stupid questions about or family. All three of us went through a phase of not wanting them to be our parents, even though we were raised from infants by them. Adoption is hard sometimes. Especially when it&amp;#39;s so noticeable to other people that this isn&amp;#39;t your mom or dad. \nI don&amp;#39;t want to downplay your neices feelings, it seems like she needs counseling. Neither myself or my brothers were bullied like that about our adoption.\nI guess, I just wanted to offer perspective as an adoptee that it&amp;#39;s hard for us and I went through a phase of being mean. I would tell my dad he isn&amp;#39;t my real dad and I hated him ECT ECT. My brothers also lashed out in their own ways. \nEventually, we got though it. So hopefully, this is just a temporary phase while your niece works through everything in her own time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5syyf", "score_hidden": false, "stickied": false, "created": 1492029761.0, "created_utc": 1492000961.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ukr9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Irixian", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Brother, you're a hero. Don't ever let your present circumstances diminish what you've done or who you've become to your daughter. And yes, she is your daughter, and she always will be. \n \nKeep in mind that she's a child and that trauma surfaces in cycles. This is a flashpoint of one of those cycles and it's rough on both of you. If you can get family counseling, do so. For both of you.\n \nYou're doing a great job and it's admirable and wonderful that you stepped up the way you did. Don't give up!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Brother, you&amp;#39;re a hero. Don&amp;#39;t ever let your present circumstances diminish what you&amp;#39;ve done or who you&amp;#39;ve become to your daughter. And yes, she is your daughter, and she always will be. &lt;/p&gt;\n\n&lt;p&gt;Keep in mind that she&amp;#39;s a child and that trauma surfaces in cycles. This is a flashpoint of one of those cycles and it&amp;#39;s rough on both of you. If you can get family counseling, do so. For both of you.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re doing a great job and it&amp;#39;s admirable and wonderful that you stepped up the way you did. Don&amp;#39;t give up!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ukr9", "score_hidden": false, "stickied": false, "created": 1492032243.0, "created_utc": 1492003443.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5uzmf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rayzzles", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Okay a lot of people are suggesting therapy or relocating. Both are great ideas that I'm sure you've already thought about, but they have some difficulties. First let me say that I'm a birth mom, I placed my daughter with another family when I was a teenager and it's an open adoption so I get constant updates and can follow her progress on social media. The family is very happy, they have more kids that are also adopted and every child is aware of their situation and talk about it frequently. \n\nHere's something about my daughter. They put her in gymnastics and they home school her. She spends so much time in gymnastics and just loves it because she is building herself to be a strong beautiful athlete. The homeschooling helps in giving her more time to focus on the sport and she's with so many friends who are similar minded to her.\n\nI'd suggest a few other things: get her involved in an activity, sport, hobby, etc that she really really loves. Sports (physical activity in general) are great in how they relieve your mind from stress. It was actually the best way for me to get over the depression and pain of losing her; I run and do weight lifting all the time and it always makes me happy when I do. It's been more successful than drugs and therapy for me (which I've had a ton of). I'm still on anti depressants and they help but nothing helps more than exercise. Remember you went through major severe trauma and you need to be taken care of too. The best way you can help your family is to make sure you are happy and well adjusted. \n\nNext I would suggest (and it may be hard to consider) expanding your family. It might be good to find a girlfriend/wife for your comfort and hers. Someone that she can talk to and have a female perspective. And/or possibly... adopting another child. A sibling that she can help raise and love. Basically this can help her change her focus towards family more, and help you guys become more of a unit. My husband and I were together five years, going through lots of depression (mostly cuz of my lost girl) and when we finally got pregnant everything changed. We have a son now and it made us change everything in our life; we got a house, new jobs, new location and now we have plans (happy plans) for the future. Life is wonderful now I've never been happier. I'm an atheist but I strongly believe in family, I really think that having family and love is the purpose of life. \n\nFinally have you considered homeschool? She may be a lot happier at home and you could try having her be involved in more activities. Basically she needs a new focus, a new interest. Something to get away from the bullies and the past, and to learn to love the present. \n\nAs for the father thing, it is of course important to respect her wishes, she's trying to understand her identity. Though it's also important for her to learn that families come in all shapes and sizes, all colors and backgrounds. It doesn't make you any less her father and her any less your daughter. A parent isn't just someone who's biologically your maker, a parent is the one who raises and loves the child. Ask the many people sho have step parents or adopted parents, people whose biological parents were worse to them or didn't even care for them. They will always say something like \"my step dad is my dad, no question to it\". Sit down with her and show her on the internet the hundreds of thousands of different families out there. Give her as much perspective as you can, because she's only learning from naive children from a small town. Once the information is there, there's far more comfort. \n\nThink of it like in the movie Tarzan (Disney version). The gorilla mom who adopts Tarzan teaches her son that regardless of their differences, their hearts are exactly the same. You love her, your her family, and your her dad. She will understand that, just never stop showing that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay a lot of people are suggesting therapy or relocating. Both are great ideas that I&amp;#39;m sure you&amp;#39;ve already thought about, but they have some difficulties. First let me say that I&amp;#39;m a birth mom, I placed my daughter with another family when I was a teenager and it&amp;#39;s an open adoption so I get constant updates and can follow her progress on social media. The family is very happy, they have more kids that are also adopted and every child is aware of their situation and talk about it frequently. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s something about my daughter. They put her in gymnastics and they home school her. She spends so much time in gymnastics and just loves it because she is building herself to be a strong beautiful athlete. The homeschooling helps in giving her more time to focus on the sport and she&amp;#39;s with so many friends who are similar minded to her.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d suggest a few other things: get her involved in an activity, sport, hobby, etc that she really really loves. Sports (physical activity in general) are great in how they relieve your mind from stress. It was actually the best way for me to get over the depression and pain of losing her; I run and do weight lifting all the time and it always makes me happy when I do. It&amp;#39;s been more successful than drugs and therapy for me (which I&amp;#39;ve had a ton of). I&amp;#39;m still on anti depressants and they help but nothing helps more than exercise. Remember you went through major severe trauma and you need to be taken care of too. The best way you can help your family is to make sure you are happy and well adjusted. &lt;/p&gt;\n\n&lt;p&gt;Next I would suggest (and it may be hard to consider) expanding your family. It might be good to find a girlfriend/wife for your comfort and hers. Someone that she can talk to and have a female perspective. And/or possibly... adopting another child. A sibling that she can help raise and love. Basically this can help her change her focus towards family more, and help you guys become more of a unit. My husband and I were together five years, going through lots of depression (mostly cuz of my lost girl) and when we finally got pregnant everything changed. We have a son now and it made us change everything in our life; we got a house, new jobs, new location and now we have plans (happy plans) for the future. Life is wonderful now I&amp;#39;ve never been happier. I&amp;#39;m an atheist but I strongly believe in family, I really think that having family and love is the purpose of life. &lt;/p&gt;\n\n&lt;p&gt;Finally have you considered homeschool? She may be a lot happier at home and you could try having her be involved in more activities. Basically she needs a new focus, a new interest. Something to get away from the bullies and the past, and to learn to love the present. &lt;/p&gt;\n\n&lt;p&gt;As for the father thing, it is of course important to respect her wishes, she&amp;#39;s trying to understand her identity. Though it&amp;#39;s also important for her to learn that families come in all shapes and sizes, all colors and backgrounds. It doesn&amp;#39;t make you any less her father and her any less your daughter. A parent isn&amp;#39;t just someone who&amp;#39;s biologically your maker, a parent is the one who raises and loves the child. Ask the many people sho have step parents or adopted parents, people whose biological parents were worse to them or didn&amp;#39;t even care for them. They will always say something like &amp;quot;my step dad is my dad, no question to it&amp;quot;. Sit down with her and show her on the internet the hundreds of thousands of different families out there. Give her as much perspective as you can, because she&amp;#39;s only learning from naive children from a small town. Once the information is there, there&amp;#39;s far more comfort. &lt;/p&gt;\n\n&lt;p&gt;Think of it like in the movie Tarzan (Disney version). The gorilla mom who adopts Tarzan teaches her son that regardless of their differences, their hearts are exactly the same. You love her, your her family, and your her dad. She will understand that, just never stop showing that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5uzmf", "score_hidden": false, "stickied": false, "created": 1492032829.0, "created_utc": 1492004029.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5vf7i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SpaghettiTues", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Kids go through phases like this all the time. Try your best not to take it personal. \n\n#You're doing a great job! \n\nI've never even been kayaking with my family. I never even had the confidence in my parents to tell them about my bullying. And I don't even think I had bad parents. My point is you seem like an **awesome** dad!\n\n1. Call the school. Change classes. Get the toxic environment fixed. \n\n2. Is there any way to talk to those kid's parents? The asshole kids probably don't understand the family situation.\n\n3. Therapy, just once a week to talk. Might help her sort through everything and gain confidence. \n\nYou're doing a great job!!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kids go through phases like this all the time. Try your best not to take it personal. &lt;/p&gt;\n\n&lt;h1&gt;You&amp;#39;re doing a great job!&lt;/h1&gt;\n\n&lt;p&gt;I&amp;#39;ve never even been kayaking with my family. I never even had the confidence in my parents to tell them about my bullying. And I don&amp;#39;t even think I had bad parents. My point is you seem like an &lt;strong&gt;awesome&lt;/strong&gt; dad!&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Call the school. Change classes. Get the toxic environment fixed. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Is there any way to talk to those kid&amp;#39;s parents? The asshole kids probably don&amp;#39;t understand the family situation.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Therapy, just once a week to talk. Might help her sort through everything and gain confidence. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;You&amp;#39;re doing a great job!!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5vf7i", "score_hidden": false, "stickied": false, "created": 1492033419.0, "created_utc": 1492004619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5g083", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "runbabyrun_21", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Raising children is an exercise in patience.  Could this new decision of calling you Uncle be a knee jerk reaction to the thugs at school giving her a hard time? She's likely frustrated with being powerless to the bullies and this could be a way to gain some power for herself. Give her some time with this, maybe it won't feel so comfortable for her to call you anything but Dad. \n\nI have some first hand experience with being bullied through most of my elementary and junior high years. I wish I had someone to protect me at the time and provide me with some tools to navigate through such difficulty. Therapy could be  very helpful for her (or both of you) not only for the bullying, but also for dealing with the deaths of her family members. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Raising children is an exercise in patience.  Could this new decision of calling you Uncle be a knee jerk reaction to the thugs at school giving her a hard time? She&amp;#39;s likely frustrated with being powerless to the bullies and this could be a way to gain some power for herself. Give her some time with this, maybe it won&amp;#39;t feel so comfortable for her to call you anything but Dad. &lt;/p&gt;\n\n&lt;p&gt;I have some first hand experience with being bullied through most of my elementary and junior high years. I wish I had someone to protect me at the time and provide me with some tools to navigate through such difficulty. Therapy could be  very helpful for her (or both of you) not only for the bullying, but also for dealing with the deaths of her family members. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5g083", "score_hidden": false, "stickied": false, "created": 1491998570.0, "created_utc": 1491969770.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5icfc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pmMeOurLoveStory", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Jesus dude, what an awful story. I'm so sorry for everything you both have been through.   \n\nOne thing you should think about if you haven't already:   \n\nThe bullying is obviously absolutely awful and has got to be incredibly painful for your daughter. It seems to me that her request is little more than a reaction to that bullying, and not actually what she feels. In her mind, if she *agrees* with the bullies, that will make their words less hurtful. She's also nearing an age where kids want to try bucking the status quo, to begin toying with discovering who they are, and \"who they are\" doesn't last long. I know what she's saying is painful, but I really don't think she actually means it; she's just trying to find a way to deal with the pain. \"Laugh at yourself and the bully's words won't hurt\" kind of thing.   \n\nIn any case, tell her that she can call you whatever makes her comfortable, and you will try to grant her wish, but that what you call her *does not* change how you feel about her; you may be her uncle, but your love for her will always be that of a father and daughter. And remember: even if she's trying to change names to battle the assault of bullies, she still loves you and you will always be her dad, no matter what titles are used. ", "edited": 1491974167.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus dude, what an awful story. I&amp;#39;m so sorry for everything you both have been through.   &lt;/p&gt;\n\n&lt;p&gt;One thing you should think about if you haven&amp;#39;t already:   &lt;/p&gt;\n\n&lt;p&gt;The bullying is obviously absolutely awful and has got to be incredibly painful for your daughter. It seems to me that her request is little more than a reaction to that bullying, and not actually what she feels. In her mind, if she &lt;em&gt;agrees&lt;/em&gt; with the bullies, that will make their words less hurtful. She&amp;#39;s also nearing an age where kids want to try bucking the status quo, to begin toying with discovering who they are, and &amp;quot;who they are&amp;quot; doesn&amp;#39;t last long. I know what she&amp;#39;s saying is painful, but I really don&amp;#39;t think she actually means it; she&amp;#39;s just trying to find a way to deal with the pain. &amp;quot;Laugh at yourself and the bully&amp;#39;s words won&amp;#39;t hurt&amp;quot; kind of thing.   &lt;/p&gt;\n\n&lt;p&gt;In any case, tell her that she can call you whatever makes her comfortable, and you will try to grant her wish, but that what you call her &lt;em&gt;does not&lt;/em&gt; change how you feel about her; you may be her uncle, but your love for her will always be that of a father and daughter. And remember: even if she&amp;#39;s trying to change names to battle the assault of bullies, she still loves you and you will always be her dad, no matter what titles are used. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5icfc", "score_hidden": false, "stickied": false, "created": 1492002761.0, "created_utc": 1491973961.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5j7z9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "glacierfanclub", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't have a lot to add except that you *are* her dad and clearly an excellent one. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have a lot to add except that you &lt;em&gt;are&lt;/em&gt; her dad and clearly an excellent one. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5j7z9", "score_hidden": false, "stickied": false, "created": 1492004510.0, "created_utc": 1491975710.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5m4v1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "brokenpurrbox", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It sounds like the bullying is pretty bad, that she would start to think that way. Is there a possibility of moving her to a different school?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like the bullying is pretty bad, that she would start to think that way. Is there a possibility of moving her to a different school?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5m4v1", "score_hidden": false, "stickied": false, "created": 1492011817.0, "created_utc": 1491983017.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5olw0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dinosaur_boots", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't know what to say. But I wish you the best! I think you have been doing wonderful with her. She is so lucky to have you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know what to say. But I wish you the best! I think you have been doing wonderful with her. She is so lucky to have you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5olw0", "score_hidden": false, "stickied": false, "created": 1492019499.0, "created_utc": 1491990699.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5oolq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BagelNCreamCheeze", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm sorry you're going through this. I remember at 9 I was being picked on a lot. It's easy to cope by agreeing with the bullies and hoping things smooth out. \n\nHer past is a tragic one ( as is yours). Therapy would be beneficial for the both of you. I used to hate being told I should talk to someone. It helped immensely. \n\nYou are an amazing father to her. She will learn one day that DNA  isn't what made you her father. You keep doing what you're doing. Support her. My dad used to get his female friends to help me when I was younger. They took me shopping. She will always be your little girl. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry you&amp;#39;re going through this. I remember at 9 I was being picked on a lot. It&amp;#39;s easy to cope by agreeing with the bullies and hoping things smooth out. &lt;/p&gt;\n\n&lt;p&gt;Her past is a tragic one ( as is yours). Therapy would be beneficial for the both of you. I used to hate being told I should talk to someone. It helped immensely. &lt;/p&gt;\n\n&lt;p&gt;You are an amazing father to her. She will learn one day that DNA  isn&amp;#39;t what made you her father. You keep doing what you&amp;#39;re doing. Support her. My dad used to get his female friends to help me when I was younger. They took me shopping. She will always be your little girl. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5oolq", "score_hidden": false, "stickied": false, "created": 1492019730.0, "created_utc": 1491990930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5p95m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SFFChat", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't have any helpful advice to offer but I just want to say that I'm so sorry you've had to go through all of this and your daughter is so lucky to have you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have any helpful advice to offer but I just want to say that I&amp;#39;m so sorry you&amp;#39;ve had to go through all of this and your daughter is so lucky to have you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5p95m", "score_hidden": false, "stickied": false, "created": 1492021478.0, "created_utc": 1491992678.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5re1j", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SEND_MORE_PIZZA", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm late to the party here and I have no kids, so I can't offer you advice on parenting, but I am adopted. My grandparents adopted me at 10 months old. Long story short, I grew up calling them mom and dad and we moved away. \n\nI do highly recommend therapy of some sort, and make her stick to it. Its not fun at first, she won't enjoy it, but it will help and that's what matters. \n\nShe is going to call you what makes sense to *her* right now. Her mind is racing trying to process something that can't really be processed yet. Hell, I'm 26 and still having to figure things out. Its confusing, she's been bullied and she's reacting to *that* situation, not how she feels about you. You are her father figure. You are raising her, loving her, providing for her. Thats a dad's job and you're doing it. She may not call you dad right now, she may never call you dad, but that's what you are being for her. It may hurt, but your relationship with her is more important than what she calls you. You know in your heart what you are. Hold onto that. \n\nAs she gets older you can have more complex conversations about it. I still ask my mom things about my bio-mom who I call by her first name. Its complicated, but know that you're taking the right steps. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m late to the party here and I have no kids, so I can&amp;#39;t offer you advice on parenting, but I am adopted. My grandparents adopted me at 10 months old. Long story short, I grew up calling them mom and dad and we moved away. &lt;/p&gt;\n\n&lt;p&gt;I do highly recommend therapy of some sort, and make her stick to it. Its not fun at first, she won&amp;#39;t enjoy it, but it will help and that&amp;#39;s what matters. &lt;/p&gt;\n\n&lt;p&gt;She is going to call you what makes sense to &lt;em&gt;her&lt;/em&gt; right now. Her mind is racing trying to process something that can&amp;#39;t really be processed yet. Hell, I&amp;#39;m 26 and still having to figure things out. Its confusing, she&amp;#39;s been bullied and she&amp;#39;s reacting to &lt;em&gt;that&lt;/em&gt; situation, not how she feels about you. You are her father figure. You are raising her, loving her, providing for her. Thats a dad&amp;#39;s job and you&amp;#39;re doing it. She may not call you dad right now, she may never call you dad, but that&amp;#39;s what you are being for her. It may hurt, but your relationship with her is more important than what she calls you. You know in your heart what you are. Hold onto that. &lt;/p&gt;\n\n&lt;p&gt;As she gets older you can have more complex conversations about it. I still ask my mom things about my bio-mom who I call by her first name. Its complicated, but know that you&amp;#39;re taking the right steps. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5re1j", "score_hidden": false, "stickied": false, "created": 1492026816.0, "created_utc": 1491998016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5rp32", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nanner99", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "*You're doing a fabulous job*. Just posting here says a lot about you and how much you care for your daughter. Then I read your comments about your community... being a good role model is one of the number one best possible things you can do for your kid. Especially with your circumstances.\n\nKids- particularly ones on the brink of puberty- can rip a parents heart out, without meaning to. And sometimes they can say stuff bc they *do* want to cause you pain- especially angry/upset preteen girls. They just can't grasp how deeply their words can hurt.\n\nThis happens in \"typical\" families as well. I know it doesn't feel this way... But her talking to you and telling you she wants to call you uncle has a silver lining. It means she feels unconditionally loved and secure with you. She knows you are her Dad and will be there for her no matter what. Just keep reassuring her. My daughter was bullied and also started really questioning herself/me at the same age as your daughter is now. Different situation- her bio dad hadn't been aaround at all since she was two. My (now ex) husband adopted her at 5. I'd always been honest with her about this. Puberty brought out a lot of questions and feelings about both of her dads. I wish my ex had handled it half as well as you are... \n\nHang tight and keep doing what you are doing. You obviously *are* meant to be a parent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;You&amp;#39;re doing a fabulous job&lt;/em&gt;. Just posting here says a lot about you and how much you care for your daughter. Then I read your comments about your community... being a good role model is one of the number one best possible things you can do for your kid. Especially with your circumstances.&lt;/p&gt;\n\n&lt;p&gt;Kids- particularly ones on the brink of puberty- can rip a parents heart out, without meaning to. And sometimes they can say stuff bc they &lt;em&gt;do&lt;/em&gt; want to cause you pain- especially angry/upset preteen girls. They just can&amp;#39;t grasp how deeply their words can hurt.&lt;/p&gt;\n\n&lt;p&gt;This happens in &amp;quot;typical&amp;quot; families as well. I know it doesn&amp;#39;t feel this way... But her talking to you and telling you she wants to call you uncle has a silver lining. It means she feels unconditionally loved and secure with you. She knows you are her Dad and will be there for her no matter what. Just keep reassuring her. My daughter was bullied and also started really questioning herself/me at the same age as your daughter is now. Different situation- her bio dad hadn&amp;#39;t been aaround at all since she was two. My (now ex) husband adopted her at 5. I&amp;#39;d always been honest with her about this. Puberty brought out a lot of questions and feelings about both of her dads. I wish my ex had handled it half as well as you are... &lt;/p&gt;\n\n&lt;p&gt;Hang tight and keep doing what you are doing. You obviously &lt;em&gt;are&lt;/em&gt; meant to be a parent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5rp32", "score_hidden": false, "stickied": false, "created": 1492027440.0, "created_utc": 1491998640.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5u5b7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "liseux", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My instinct is she's pushing you away. She's testing you to see if you will give up on being her dad. Tell her that you understand why she's sad, but that ever since you held her in your arms as a baby she became your whole world, the joy and light of your life. Tell her that she deserves a father who will give anything for her. If she calls you Uncle, that's her choice, but it won't reflect the love that you feel for her and how you would sacrifice everything for her in a second. She needs to hear that your love for her is unstoppable and deeper than any uncle. She doesn't have to be your biological child for this to be true. It doesn't negate the love her biological parents had for her. It adds to it, deepens it. Tell her how special she is. She deserves a father. \n\nYou might also remind her that when couples marry, they aren't related, but they love each other just as much and maybe even more than their own children. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My instinct is she&amp;#39;s pushing you away. She&amp;#39;s testing you to see if you will give up on being her dad. Tell her that you understand why she&amp;#39;s sad, but that ever since you held her in your arms as a baby she became your whole world, the joy and light of your life. Tell her that she deserves a father who will give anything for her. If she calls you Uncle, that&amp;#39;s her choice, but it won&amp;#39;t reflect the love that you feel for her and how you would sacrifice everything for her in a second. She needs to hear that your love for her is unstoppable and deeper than any uncle. She doesn&amp;#39;t have to be your biological child for this to be true. It doesn&amp;#39;t negate the love her biological parents had for her. It adds to it, deepens it. Tell her how special she is. She deserves a father. &lt;/p&gt;\n\n&lt;p&gt;You might also remind her that when couples marry, they aren&amp;#39;t related, but they love each other just as much and maybe even more than their own children. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5u5b7", "score_hidden": false, "stickied": false, "created": 1492031620.0, "created_utc": 1492002820.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ud1q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "flora_pompeii", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This poor kid is going to spend the next four or five years of her life trying to accommodate the moving goal-posts that other kids are setting in order to fit in, and it will never work. They will always find some new way to be cruel. She is the victim of brutal, relentless bullying, and you need to escalate the issue until someone deals with it. If not the school, the superintendent. If not the superintendent, the school board. If not the school board, the police and the media.\n\nYou may need to consider moving her to another school where she can get a fresh start away from these awful people.\n\nIn the meantime, remember that it's not about you. She's doing what she thinks she must in order to escape the torment she is facing every day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This poor kid is going to spend the next four or five years of her life trying to accommodate the moving goal-posts that other kids are setting in order to fit in, and it will never work. They will always find some new way to be cruel. She is the victim of brutal, relentless bullying, and you need to escalate the issue until someone deals with it. If not the school, the superintendent. If not the superintendent, the school board. If not the school board, the police and the media.&lt;/p&gt;\n\n&lt;p&gt;You may need to consider moving her to another school where she can get a fresh start away from these awful people.&lt;/p&gt;\n\n&lt;p&gt;In the meantime, remember that it&amp;#39;s not about you. She&amp;#39;s doing what she thinks she must in order to escape the torment she is facing every day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ud1q", "score_hidden": false, "stickied": false, "created": 1492031935.0, "created_utc": 1492003135.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5zbw6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Happy_Fun_Balll", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Dude. I am so sorry that you've had it so rough and the fact that it is bothering you like this gives me absolutely no doubt in my mind that you are her father. You're thinking like her dad, you're reacting like her dad, you are her dad, regardless of what she's saying right now. This too shall pass. You are not only dad, but I can tell you that what you have done for your daughter is about 999x more than what my own daughter's biological father has done for her.\n\nNow to her point of view. There's no real great answer I can come up with here but others have said therapy and I second (or forty-seven... I didn't count how many) it emphatically. Also, more needs to be done at her school to address how these children are getting away with essentially what amounts to hate speech. I am unfamiliar with the Canadian educational system but is there some sort of \"zero tolerance\" policy involved? I know even then, kids are going to say dumb things because usually their parents act that way, but the school should be stepping in here. No child should be made to feel like that because of their ethnic background OR their family background. It is infuriating to me, as I type this I'm typing faster and angrier with each sentence, that these children are allowed to continue this disgusting behavior when you've already said something.\n\nI don't think your daughter's reasoning will last, I really don't, especially when she is older, knows the entire story in the capacity of a young adult, and sees all that you've done for her. But for now, counseling and choosing love over reaction, continuing to respect her choices (and knowing they're likely temporary) will help.\n\nAlso, if she likes to read, get her some books. That's what my family did any time I went through something. When I finally had enough of my now-ex-husband flaunting his mistress and blaming me for driving him to cheat (I know now he is a sociopath, but I still have to share our child with him and his less-than-chaste mistress who tells my child to call her \"Mommy\" and badmouths me every chance she gets, in addition to trying to undermine every rule I make... she's what those bullies at your daughter's school grow up to be) I got my daughter a book called \"My Family, Your Family\", which helped a little. It was illustrated by a former college roommate of mine which is kind of cool, too, but the main thing is it talks about many family dynamics, as well as features many races! Best of luck to you.\n\nI will not be replying to any comments on this because I am done with this sub. The mods are absolutely **rude** and can't take suggestions.", "edited": 1492012172.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude. I am so sorry that you&amp;#39;ve had it so rough and the fact that it is bothering you like this gives me absolutely no doubt in my mind that you are her father. You&amp;#39;re thinking like her dad, you&amp;#39;re reacting like her dad, you are her dad, regardless of what she&amp;#39;s saying right now. This too shall pass. You are not only dad, but I can tell you that what you have done for your daughter is about 999x more than what my own daughter&amp;#39;s biological father has done for her.&lt;/p&gt;\n\n&lt;p&gt;Now to her point of view. There&amp;#39;s no real great answer I can come up with here but others have said therapy and I second (or forty-seven... I didn&amp;#39;t count how many) it emphatically. Also, more needs to be done at her school to address how these children are getting away with essentially what amounts to hate speech. I am unfamiliar with the Canadian educational system but is there some sort of &amp;quot;zero tolerance&amp;quot; policy involved? I know even then, kids are going to say dumb things because usually their parents act that way, but the school should be stepping in here. No child should be made to feel like that because of their ethnic background OR their family background. It is infuriating to me, as I type this I&amp;#39;m typing faster and angrier with each sentence, that these children are allowed to continue this disgusting behavior when you&amp;#39;ve already said something.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think your daughter&amp;#39;s reasoning will last, I really don&amp;#39;t, especially when she is older, knows the entire story in the capacity of a young adult, and sees all that you&amp;#39;ve done for her. But for now, counseling and choosing love over reaction, continuing to respect her choices (and knowing they&amp;#39;re likely temporary) will help.&lt;/p&gt;\n\n&lt;p&gt;Also, if she likes to read, get her some books. That&amp;#39;s what my family did any time I went through something. When I finally had enough of my now-ex-husband flaunting his mistress and blaming me for driving him to cheat (I know now he is a sociopath, but I still have to share our child with him and his less-than-chaste mistress who tells my child to call her &amp;quot;Mommy&amp;quot; and badmouths me every chance she gets, in addition to trying to undermine every rule I make... she&amp;#39;s what those bullies at your daughter&amp;#39;s school grow up to be) I got my daughter a book called &amp;quot;My Family, Your Family&amp;quot;, which helped a little. It was illustrated by a former college roommate of mine which is kind of cool, too, but the main thing is it talks about many family dynamics, as well as features many races! Best of luck to you.&lt;/p&gt;\n\n&lt;p&gt;I will not be replying to any comments on this because I am done with this sub. The mods are absolutely &lt;strong&gt;rude&lt;/strong&gt; and can&amp;#39;t take suggestions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5zbw6", "score_hidden": false, "stickied": false, "created": 1492038143.0, "created_utc": 1492009343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg7wqew", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PopularPoplar", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She can't continue attending that school.  No amount of teacher intervention will stop the bullying and even if it did, it wouldn't fix the social dynamic that's already been set.  You have to enroll her in a new school or homeschool her.  Therapy is a fine idea, but it's a bandaid on an amputation as long as you keep sending her to that classroom.  It's not your daughter's responsibility to reform a bunch of racist bullies, and you should not continue to put that on her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She can&amp;#39;t continue attending that school.  No amount of teacher intervention will stop the bullying and even if it did, it wouldn&amp;#39;t fix the social dynamic that&amp;#39;s already been set.  You have to enroll her in a new school or homeschool her.  Therapy is a fine idea, but it&amp;#39;s a bandaid on an amputation as long as you keep sending her to that classroom.  It&amp;#39;s not your daughter&amp;#39;s responsibility to reform a bunch of racist bullies, and you should not continue to put that on her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7wqew", "score_hidden": false, "stickied": false, "created": 1492133899.0, "created_utc": 1492105099.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg6ahd7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fatfrost", "parent_id": "t1_dg5gwee", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You're right and that's why you aren't a meathead.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right and that&amp;#39;s why you aren&amp;#39;t a meathead.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6ahd7", "score_hidden": false, "stickied": false, "created": 1492049844.0, "created_utc": 1492021044.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gwee", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg5gnfc", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thanks for the support, but I have to condemn this sort of response. As a parent, what sort of example would I be setting for my daughter if I showed her that violence was a valid solution? As a member of the community, how could I justify using violence instead of communicating with my neighbours? As a doctor, why should I willingly hurt somebody that I vowed to protect? As a human, how can I hurt either (a) a minor (who should have known better than to be a bully, but is still just a kid) or (b) their parents (who are not *necessarily* at fault)? As an ethnic minority, why would I contribute to stereotypes that people who look like me are violent and can't fit into Canadian society?\n\nIf I found a way to answer these five questions convincingly, sure, I would beat the shit out of somebody. But, as of right now, I can't answer any of them and I don't think I will ever be able to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the support, but I have to condemn this sort of response. As a parent, what sort of example would I be setting for my daughter if I showed her that violence was a valid solution? As a member of the community, how could I justify using violence instead of communicating with my neighbours? As a doctor, why should I willingly hurt somebody that I vowed to protect? As a human, how can I hurt either (a) a minor (who should have known better than to be a bully, but is still just a kid) or (b) their parents (who are not &lt;em&gt;necessarily&lt;/em&gt; at fault)? As an ethnic minority, why would I contribute to stereotypes that people who look like me are violent and can&amp;#39;t fit into Canadian society?&lt;/p&gt;\n\n&lt;p&gt;If I found a way to answer these five questions convincingly, sure, I would beat the shit out of somebody. But, as of right now, I can&amp;#39;t answer any of them and I don&amp;#39;t think I will ever be able to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5gwee", "score_hidden": false, "stickied": false, "created": 1492000096.0, "created_utc": 1491971296.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5jl56", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CharlieChuu", "parent_id": "t1_dg5gnfc", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "lol me too.  At first I was crying my eyes out, then towards the end I just wanted to fight someone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol me too.  At first I was crying my eyes out, then towards the end I just wanted to fight someone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5jl56", "score_hidden": false, "stickied": false, "created": 1492005285.0, "created_utc": 1491976485.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gnfc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "fatfrost", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm such a fucking meathead.  I know it wouldn't help things, but I would beat the shit out of someone behind this we're I in your shoes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m such a fucking meathead.  I know it wouldn&amp;#39;t help things, but I would beat the shit out of someone behind this we&amp;#39;re I in your shoes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5gnfc", "score_hidden": false, "stickied": false, "created": 1491999661.0, "created_utc": 1491970861.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5n8oa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "someredditorguy", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "These are great suggestions already. I wanted to ask: did you ever officially adopt her? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These are great suggestions already. I wanted to ask: did you ever officially adopt her? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5n8oa", "score_hidden": false, "stickied": false, "created": 1492015169.0, "created_utc": 1491986369.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ifxu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ttoc", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Be persistent with the bullying issue. Sit down with teachers and admin to make an action plan. It sounds like a particularly nasty case of bullying. I'd also let your daughter know how much she hurt you. Kids by nature are pretty egocentric and empathy doesn't always come naturally. Respect her wishes, but also share the reasons why you rightfully see her as a daughter. Hopefully she'll come around soon! Also, let her know that she can have more than one dad. She may be dealing with survivor's guilt as others have mentioned. Help her find a connection to her family by sharing stories about her mom and dad and fill up photo albums so she has that story of where she came from. It sounds like she's going through a tough time and trying to figure out her identity. I'm very sorry for all the sadness you have both had to face and I hope things get better soon.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be persistent with the bullying issue. Sit down with teachers and admin to make an action plan. It sounds like a particularly nasty case of bullying. I&amp;#39;d also let your daughter know how much she hurt you. Kids by nature are pretty egocentric and empathy doesn&amp;#39;t always come naturally. Respect her wishes, but also share the reasons why you rightfully see her as a daughter. Hopefully she&amp;#39;ll come around soon! Also, let her know that she can have more than one dad. She may be dealing with survivor&amp;#39;s guilt as others have mentioned. Help her find a connection to her family by sharing stories about her mom and dad and fill up photo albums so she has that story of where she came from. It sounds like she&amp;#39;s going through a tough time and trying to figure out her identity. I&amp;#39;m very sorry for all the sadness you have both had to face and I hope things get better soon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ifxu", "score_hidden": false, "stickied": false, "created": 1492002948.0, "created_utc": 1491974148.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5inhu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jintana", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Her job is to learn how to work out her feelings at home with you (and with any professional(s) you enlist to help), and for her to respond to the bullies if they've said nothing of consequence.\n\nYour job is to let her call you uncle, and call her niece if she asks you to say it. It is to acknowledge and let her work out her feelings while being secure and confident in yours (and getting professional help if necessary). It is to work with school staff and admin to get a handle on the bullying. It is to be her dad while she works out her mixed feelings.\n\n~hugs~", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Her job is to learn how to work out her feelings at home with you (and with any professional(s) you enlist to help), and for her to respond to the bullies if they&amp;#39;ve said nothing of consequence.&lt;/p&gt;\n\n&lt;p&gt;Your job is to let her call you uncle, and call her niece if she asks you to say it. It is to acknowledge and let her work out her feelings while being secure and confident in yours (and getting professional help if necessary). It is to work with school staff and admin to get a handle on the bullying. It is to be her dad while she works out her mixed feelings.&lt;/p&gt;\n\n&lt;p&gt;~hugs~&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5inhu", "score_hidden": false, "stickied": false, "created": 1492003352.0, "created_utc": 1491974552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5j3u5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KimmieBlag", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Hey there, I wanted to tell you my own personal experience with adoption. For context I was adopted out if states and look nothing like my parents. By the way I dont know any information about my biological parents and I have never met then. I love both of my parents dearly, I myself have experienced extereme amounts of racism growing up. This sounds like an extermely difficult time seeing that you were so close to your brother and now are so close to her. I agree with the others about therapy, it sounds like your in a not so great area. I actually used to live in the suburbs moving into the middle of nowehere. If I were you in this situation I would concider trying to get her into a school thats more urban. 9 is a very young age to have to hear those awful slurs. I know its a big desision to decide to move or change schools, but bullying can be really damaging to a child. Especially if your trying to be closer to her it may be difficult to compete with her peers. I also agree that you are being hard on yourself, I think all children say things to their parents that they dont realize are hurtful to them. You also have to remember everyone deals with loss differently than you may yourself. I would definitely give her the time to come to her own terms because without enough space she will feel constricted. At the same time too much space will lead to feeling uncared for. It seems like you put thought into rasing your daughter and remember, things change. She is only 9, children sometimes say things because they are hurt. I know for myself I never felt ashamed of my adoption ( its not like it could be a secret anyways). My parents rasied me knowing that Im adopted and left open doors for conversation. I personally feel that is it exteremely important to leave those doors open for conversation in order to talk to her. At times I felt as if I was being forced to talk about my adoption when it didnt feel important to me and it was at the point where I felt like it was obsessive talking about it so frequently that it just was a annoying to talk about. I know every adoptee runs through different emotions of being adopted. I personally heard stories of adopted kids feeling the need to meet their biological parents all the way to not caring about the details. I also wanted to mention that I think its good you spend time with her, being a kid in general can be lonely and isolating, if she knows you are there it will make it easier on her. Perhaps you may want to look into homeschooling and talk to some of the counselors at the school. I know there are a lot of resources for bullying and such. Good luck, I know when I was younger I really struggled with finding myself and being able to navigate social situations, I wanted to reassure you of my own personal life and let you know these things. I may not be able to promise that your relationship with her will be perfect, but it's important to remember you are the adult, these hurtful words can cloud judgement. Just remember that she does need you as a father. I didn't always have a good relationship with my parents (unrelated to adoption), overtime though we learned how to communicate with one another in a more positive way. Feel free to ask any questions and I'll be more than happy to answer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there, I wanted to tell you my own personal experience with adoption. For context I was adopted out if states and look nothing like my parents. By the way I dont know any information about my biological parents and I have never met then. I love both of my parents dearly, I myself have experienced extereme amounts of racism growing up. This sounds like an extermely difficult time seeing that you were so close to your brother and now are so close to her. I agree with the others about therapy, it sounds like your in a not so great area. I actually used to live in the suburbs moving into the middle of nowehere. If I were you in this situation I would concider trying to get her into a school thats more urban. 9 is a very young age to have to hear those awful slurs. I know its a big desision to decide to move or change schools, but bullying can be really damaging to a child. Especially if your trying to be closer to her it may be difficult to compete with her peers. I also agree that you are being hard on yourself, I think all children say things to their parents that they dont realize are hurtful to them. You also have to remember everyone deals with loss differently than you may yourself. I would definitely give her the time to come to her own terms because without enough space she will feel constricted. At the same time too much space will lead to feeling uncared for. It seems like you put thought into rasing your daughter and remember, things change. She is only 9, children sometimes say things because they are hurt. I know for myself I never felt ashamed of my adoption ( its not like it could be a secret anyways). My parents rasied me knowing that Im adopted and left open doors for conversation. I personally feel that is it exteremely important to leave those doors open for conversation in order to talk to her. At times I felt as if I was being forced to talk about my adoption when it didnt feel important to me and it was at the point where I felt like it was obsessive talking about it so frequently that it just was a annoying to talk about. I know every adoptee runs through different emotions of being adopted. I personally heard stories of adopted kids feeling the need to meet their biological parents all the way to not caring about the details. I also wanted to mention that I think its good you spend time with her, being a kid in general can be lonely and isolating, if she knows you are there it will make it easier on her. Perhaps you may want to look into homeschooling and talk to some of the counselors at the school. I know there are a lot of resources for bullying and such. Good luck, I know when I was younger I really struggled with finding myself and being able to navigate social situations, I wanted to reassure you of my own personal life and let you know these things. I may not be able to promise that your relationship with her will be perfect, but it&amp;#39;s important to remember you are the adult, these hurtful words can cloud judgement. Just remember that she does need you as a father. I didn&amp;#39;t always have a good relationship with my parents (unrelated to adoption), overtime though we learned how to communicate with one another in a more positive way. Feel free to ask any questions and I&amp;#39;ll be more than happy to answer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5j3u5", "score_hidden": false, "stickied": false, "created": 1492004275.0, "created_utc": 1491975475.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5je1a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CharlieChuu", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "fuckin god damn I have no advice but this post made me cry like I haven't in a long time.  I'm so sorry OP.  I am empathizing with you so much right now... I cannot even imagine your heart ache.  It's too much.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;fuckin god damn I have no advice but this post made me cry like I haven&amp;#39;t in a long time.  I&amp;#39;m so sorry OP.  I am empathizing with you so much right now... I cannot even imagine your heart ache.  It&amp;#39;s too much.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5je1a", "score_hidden": false, "stickied": false, "created": 1492004861.0, "created_utc": 1491976061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ke9f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ftothem", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I just wanted to say you're a good parent, and seem like an all round awesome person. I'm so sorry for your losses, and wish you and your daughter the best. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just wanted to say you&amp;#39;re a good parent, and seem like an all round awesome person. I&amp;#39;m so sorry for your losses, and wish you and your daughter the best. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ke9f", "score_hidden": false, "stickied": false, "created": 1492007191.0, "created_utc": 1491978391.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5l0n3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "galaxiekat", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My heart breaks for you.  \n\nYou both **need** to go to therapy.  For your losses, and so that she can get help understanding her emotions.  Let her call you  \"Uncle\" for now.  She'll come to understand that not all families look the same.\n\nYou need to contact the school.  Clearly someone is dropping the ball in looking out for her best interests.  As soon as you hear anything that could be construed as harassment or bullying, you need to talk to the principal--her teacher is not doing a good enough job making her feel safe, so I'd bypass the teacher altogether.  As a teacher myself, I would not take this kind of thing lightly and neither would my school's admin.  If the school situation doesn't get better, I would take her to a different school.  Hopefully, one that is more diverse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My heart breaks for you.  &lt;/p&gt;\n\n&lt;p&gt;You both &lt;strong&gt;need&lt;/strong&gt; to go to therapy.  For your losses, and so that she can get help understanding her emotions.  Let her call you  &amp;quot;Uncle&amp;quot; for now.  She&amp;#39;ll come to understand that not all families look the same.&lt;/p&gt;\n\n&lt;p&gt;You need to contact the school.  Clearly someone is dropping the ball in looking out for her best interests.  As soon as you hear anything that could be construed as harassment or bullying, you need to talk to the principal--her teacher is not doing a good enough job making her feel safe, so I&amp;#39;d bypass the teacher altogether.  As a teacher myself, I would not take this kind of thing lightly and neither would my school&amp;#39;s admin.  If the school situation doesn&amp;#39;t get better, I would take her to a different school.  Hopefully, one that is more diverse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5l0n3", "score_hidden": false, "stickied": false, "created": 1492008754.0, "created_utc": 1491979954.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ls1h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thrgd456", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You're doing a good job. Just keep it up. Always remember who the adult is and please please please let her make all the mistakes and choices that she needs to make. My daughters have both told me that they hate me. On occasion. You really should find someone to talk to, a professional. A woman. What is your plan for puberty? Who is going to teach her about menstruation, boys, sex, pregnancy, love and her role in the world as a woman in the 21st century? My girls give me a ton of shit (on occasion) but I still love them and they still love me. As she gets into the teen years things will become more emotional, more dramatic sometimes my youngest daughter will cry for seemingly no reason at all, scream that she hates me and slam her door. Please get ready for this. These things are not necessarily a reflection on you or your parenting skills at all but the next ten or eleven years might be really tough. Brace yourself now and get a plan together. And hey, if she wants to call you by your first name then maybe you should consider it. Nothing can ever change the time you have put in raising her and living her. She might not express her appreciation for you until her mid twenties but she will always know who was there for her. Choose your battles wisely. Say \"yes\" as much as possible. Love her even when she is giving you shit. It's not her fault. She got a raw deal but in the end (after college) things will get better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re doing a good job. Just keep it up. Always remember who the adult is and please please please let her make all the mistakes and choices that she needs to make. My daughters have both told me that they hate me. On occasion. You really should find someone to talk to, a professional. A woman. What is your plan for puberty? Who is going to teach her about menstruation, boys, sex, pregnancy, love and her role in the world as a woman in the 21st century? My girls give me a ton of shit (on occasion) but I still love them and they still love me. As she gets into the teen years things will become more emotional, more dramatic sometimes my youngest daughter will cry for seemingly no reason at all, scream that she hates me and slam her door. Please get ready for this. These things are not necessarily a reflection on you or your parenting skills at all but the next ten or eleven years might be really tough. Brace yourself now and get a plan together. And hey, if she wants to call you by your first name then maybe you should consider it. Nothing can ever change the time you have put in raising her and living her. She might not express her appreciation for you until her mid twenties but she will always know who was there for her. Choose your battles wisely. Say &amp;quot;yes&amp;quot; as much as possible. Love her even when she is giving you shit. It&amp;#39;s not her fault. She got a raw deal but in the end (after college) things will get better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ls1h", "score_hidden": false, "stickied": false, "created": 1492010808.0, "created_utc": 1491982008.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5qisu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HoraceTheWookie", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Lots of hugs and taking gut punches from her with more hugs, and yeah want they said about therapy, which is a great way to reaffirm your position.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of hugs and taking gut punches from her with more hugs, and yeah want they said about therapy, which is a great way to reaffirm your position.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5qisu", "score_hidden": false, "stickied": false, "created": 1492024898.0, "created_utc": 1491996098.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5u7bw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "expandingexperiences", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Although I am 23 now, I was once a nine year old girl. 9-13 are some especially rough times for most girls in terms of figuring out who they are and their place in the world at the same time that their mind and body is making major changes. Also peer acceptance and how your peers see you plays a role in the formation of your own identity. Your daughter is trying on different \"hats\" as they say, to figure out who she is and her place in the world. One of these \"hats\" is trying on the labels of niece/uncle instead of daughter/dad. It's incredibly likely she's doing this in large part because she thinks those labels will be more accepted by peers who clearly don't accept her label as \"daughter\" (because in her peers minds she has no parents ergo she can't be anyone's daughter). My point in saying all this is to hopefully shed some perspective into the mind of a 9 year old girl, reassure you that this \"change of names\" request is in no way an indication that you've done anything wrong or that she loves you any less. Also, I strongly believe that this is temporary. My interpretation is that this has far more to do with an age appropraite search for her place/roles in the world and nothing to do with her actual feelings toward you. It's speaks volumes to me about how comfortable and safe she feels with you to be able to try on these different roles and explore herself. That shows her bond to you is solid and she feels secure in it. this will pass, you've done nothing wrong and it actually seems like a sign she feels safe with you. Continue to let her know that even if labels change your feelings toward her won't, and while you will always respect her wishes, you will also always love her. Let her know she has a special place in your heart that belongs to no one but her -and that'll never change whether she calls you dad, uncle, or king big nose. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Although I am 23 now, I was once a nine year old girl. 9-13 are some especially rough times for most girls in terms of figuring out who they are and their place in the world at the same time that their mind and body is making major changes. Also peer acceptance and how your peers see you plays a role in the formation of your own identity. Your daughter is trying on different &amp;quot;hats&amp;quot; as they say, to figure out who she is and her place in the world. One of these &amp;quot;hats&amp;quot; is trying on the labels of niece/uncle instead of daughter/dad. It&amp;#39;s incredibly likely she&amp;#39;s doing this in large part because she thinks those labels will be more accepted by peers who clearly don&amp;#39;t accept her label as &amp;quot;daughter&amp;quot; (because in her peers minds she has no parents ergo she can&amp;#39;t be anyone&amp;#39;s daughter). My point in saying all this is to hopefully shed some perspective into the mind of a 9 year old girl, reassure you that this &amp;quot;change of names&amp;quot; request is in no way an indication that you&amp;#39;ve done anything wrong or that she loves you any less. Also, I strongly believe that this is temporary. My interpretation is that this has far more to do with an age appropraite search for her place/roles in the world and nothing to do with her actual feelings toward you. It&amp;#39;s speaks volumes to me about how comfortable and safe she feels with you to be able to try on these different roles and explore herself. That shows her bond to you is solid and she feels secure in it. this will pass, you&amp;#39;ve done nothing wrong and it actually seems like a sign she feels safe with you. Continue to let her know that even if labels change your feelings toward her won&amp;#39;t, and while you will always respect her wishes, you will also always love her. Let her know she has a special place in your heart that belongs to no one but her -and that&amp;#39;ll never change whether she calls you dad, uncle, or king big nose. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5u7bw", "score_hidden": false, "stickied": false, "created": 1492031701.0, "created_utc": 1492002901.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5uu9x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "patchgrrl", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I am so sorry to hear your story has been filled with loss and pain. I want to commend you for rising to a great challenge and reassure you that although this most recent chapter is painful, it will result in good things in the long term with the right guidance. \n\nYour niece is at an age where she is starting to define her self. She does not see her request as a painful imposition to you but a grasp at literal reality. You can respect her wishes and explain to her that you have reared her and love her as your own (just like an adoption with any other family). \n\nThe bullying is going to be a challenge that must be addressed on many levels. Go after the school hardcore. Help your niece come up with coping strategies. Lastly, if the other avenues do not curb the issue, I would go after the families of the bullies any way I could. \n\nYou will come through this stronger, both of you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so sorry to hear your story has been filled with loss and pain. I want to commend you for rising to a great challenge and reassure you that although this most recent chapter is painful, it will result in good things in the long term with the right guidance. &lt;/p&gt;\n\n&lt;p&gt;Your niece is at an age where she is starting to define her self. She does not see her request as a painful imposition to you but a grasp at literal reality. You can respect her wishes and explain to her that you have reared her and love her as your own (just like an adoption with any other family). &lt;/p&gt;\n\n&lt;p&gt;The bullying is going to be a challenge that must be addressed on many levels. Go after the school hardcore. Help your niece come up with coping strategies. Lastly, if the other avenues do not curb the issue, I would go after the families of the bullies any way I could. &lt;/p&gt;\n\n&lt;p&gt;You will come through this stronger, both of you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5uu9x", "score_hidden": false, "stickied": false, "created": 1492032620.0, "created_utc": 1492003820.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5uyzt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "amityville", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I've nothing to add that hasn't been said brilliantly already, but I want you to know that you are such a wonderful human being and I hope you remember that when it's rough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve nothing to add that hasn&amp;#39;t been said brilliantly already, but I want you to know that you are such a wonderful human being and I hope you remember that when it&amp;#39;s rough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5uyzt", "score_hidden": false, "stickied": false, "created": 1492032804.0, "created_utc": 1492004004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5v86d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "albeaner", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I have a 9yo son. This is a really hard age. \n\nHave you explained to him that bullies say mean things because they want to feel better about themselves? Have you rehearsed ways for her to deal with their harsh words?\n\nI'm working on getting my 9yo to try and advocate for himself rather than just 'play along' when kids (and supposed friends) are acting like total dicks. It's hard. My husband and I agreed that we'll  get therapy for him if it worsens/continues, because I wouldn't want him thinking it's not ok to assert himself (it took me decades to realize this). \n\nWe talk about the importance of being a nice person and 'taking the high road'. We also rehearse snarky/sarcastic comments to shut down the bullies (like, 'Are you done yet?', 'Wow you're SOOO right, what would I do without your wisdom', 'OOOh good one, you got me there!') and simply walking away and ignoring them (not giving them a reaction). \n\nI strongly feel like kids need to learn to advocate for themselves; teachers and adults will not always be there to 'rescue' them. Rather than simply run to a grown-up, I'd teach her techniques to handle things on her own. Then of course I'd continue to get details about these interactions from her, because you're absolutely right that this should not be tolerated. But the reality is, adults aren't going to be there 24/7, so a dual-pronged approach is needed.\n\nLastly, I'd also talk about what it means to be a kind, decent person, and how the bullies made a choice to be jerks. But it's much more important that she makes the choice to be kind than to act cruel to someone else, even if her friends are doing it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a 9yo son. This is a really hard age. &lt;/p&gt;\n\n&lt;p&gt;Have you explained to him that bullies say mean things because they want to feel better about themselves? Have you rehearsed ways for her to deal with their harsh words?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m working on getting my 9yo to try and advocate for himself rather than just &amp;#39;play along&amp;#39; when kids (and supposed friends) are acting like total dicks. It&amp;#39;s hard. My husband and I agreed that we&amp;#39;ll  get therapy for him if it worsens/continues, because I wouldn&amp;#39;t want him thinking it&amp;#39;s not ok to assert himself (it took me decades to realize this). &lt;/p&gt;\n\n&lt;p&gt;We talk about the importance of being a nice person and &amp;#39;taking the high road&amp;#39;. We also rehearse snarky/sarcastic comments to shut down the bullies (like, &amp;#39;Are you done yet?&amp;#39;, &amp;#39;Wow you&amp;#39;re SOOO right, what would I do without your wisdom&amp;#39;, &amp;#39;OOOh good one, you got me there!&amp;#39;) and simply walking away and ignoring them (not giving them a reaction). &lt;/p&gt;\n\n&lt;p&gt;I strongly feel like kids need to learn to advocate for themselves; teachers and adults will not always be there to &amp;#39;rescue&amp;#39; them. Rather than simply run to a grown-up, I&amp;#39;d teach her techniques to handle things on her own. Then of course I&amp;#39;d continue to get details about these interactions from her, because you&amp;#39;re absolutely right that this should not be tolerated. But the reality is, adults aren&amp;#39;t going to be there 24/7, so a dual-pronged approach is needed.&lt;/p&gt;\n\n&lt;p&gt;Lastly, I&amp;#39;d also talk about what it means to be a kind, decent person, and how the bullies made a choice to be jerks. But it&amp;#39;s much more important that she makes the choice to be kind than to act cruel to someone else, even if her friends are doing it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5v86d", "score_hidden": false, "stickied": false, "created": 1492033155.0, "created_utc": 1492004355.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5vm19", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_tpyo", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt;  since three decades have passed and people have generally become a lot more understanding since then. Apparently I was being too optimistic.\n\nIts not that, its just that racism isn't a disease that can be vaccinated against like Polio and eradicated. Its a simple answer that requires minimal thought to \"address\" any complex problem and people are often vulnerable to clutching at straws when the chips are down. As such the solution to this problem must forever be sustained and applied as long as we look different from one another.  \n\nSo here we have the moment where the cure has to be applied again for the next generation. Take this opportunity to hand and do what you can to ensure that the poison these children have picked up doesn't fester or spread and cure it with knowledge.  \nPerhaps this is a good opportunity to explain what Zoroastrianism was and how those beliefs have mostly died out (perhaps this is where the ideas of incest come from?). Perhaps its worth discussing how Islander genes (England, Japan) are more susceptible to genetic troubles due to inbreeding. The story of [Royal Haemophilia](https://en.wikipedia.org/wiki/Haemophilia_in_European_royalty) and the general problems that the European aristocracy faced due to keeping their blood \"pure\". In contrast the Indias were always continental and more fluid in their culture shifts so to consider the Indias more inbred then anywhere else is silly, especially if her mother was a \"race traitor\" because that \"fixes\" the problems of the genes. The arguments these children make contradict each other, they need to appreciate that, we can't let them continue to be wilfully so stupid.  \nIf anything its worth remembering the history of the Americas and how it continues to act as a refuge. The west coast to the Chinese Famine, the East coast to World War II and the Irish Famine, why the Statue of Liberty was placed in New York (not the same country I know... but its the same premise).  \nThe history of the Canadian East and its French roots and generally the mixing pot of meritocracy that has replaced the barbarism of feudalism, unrestrained capitalism and classism over the years. Diversity is a story of success and these children need to be given the perspective to appreciate this. \n\nIn terms of the rest of your situation I would personally refuse to call her \"niece\" in general (perhaps in specific contexts upon request as a favour) because its part of a connection you both possess, its not just her connection ,its yours too. To you; I'd imagine she IS your daughter so I think its wrong for you to acquiesce, especially so easily. We could argue that continuing to call her your daughter (in part) would demonstrate your commitment to that bond. She can call you Uncle if she wishes as they're her words but I'd imagine you will forever want to call her what she is; your daughter.  \n\nThere is plenty of food for thought and as someone that is currently in such a similar situation as you were prior to the accident my mind has occasionally wondered toward that possibility. Your story means a lot to me as it helps describe a future I will hopefully avoid but should be prepared for if I am unlucky.\n", "edited": 1492006884.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;since three decades have passed and people have generally become a lot more understanding since then. Apparently I was being too optimistic.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Its not that, its just that racism isn&amp;#39;t a disease that can be vaccinated against like Polio and eradicated. Its a simple answer that requires minimal thought to &amp;quot;address&amp;quot; any complex problem and people are often vulnerable to clutching at straws when the chips are down. As such the solution to this problem must forever be sustained and applied as long as we look different from one another.  &lt;/p&gt;\n\n&lt;p&gt;So here we have the moment where the cure has to be applied again for the next generation. Take this opportunity to hand and do what you can to ensure that the poison these children have picked up doesn&amp;#39;t fester or spread and cure it with knowledge.&lt;br/&gt;\nPerhaps this is a good opportunity to explain what Zoroastrianism was and how those beliefs have mostly died out (perhaps this is where the ideas of incest come from?). Perhaps its worth discussing how Islander genes (England, Japan) are more susceptible to genetic troubles due to inbreeding. The story of &lt;a href=\"https://en.wikipedia.org/wiki/Haemophilia_in_European_royalty\"&gt;Royal Haemophilia&lt;/a&gt; and the general problems that the European aristocracy faced due to keeping their blood &amp;quot;pure&amp;quot;. In contrast the Indias were always continental and more fluid in their culture shifts so to consider the Indias more inbred then anywhere else is silly, especially if her mother was a &amp;quot;race traitor&amp;quot; because that &amp;quot;fixes&amp;quot; the problems of the genes. The arguments these children make contradict each other, they need to appreciate that, we can&amp;#39;t let them continue to be wilfully so stupid.&lt;br/&gt;\nIf anything its worth remembering the history of the Americas and how it continues to act as a refuge. The west coast to the Chinese Famine, the East coast to World War II and the Irish Famine, why the Statue of Liberty was placed in New York (not the same country I know... but its the same premise).&lt;br/&gt;\nThe history of the Canadian East and its French roots and generally the mixing pot of meritocracy that has replaced the barbarism of feudalism, unrestrained capitalism and classism over the years. Diversity is a story of success and these children need to be given the perspective to appreciate this. &lt;/p&gt;\n\n&lt;p&gt;In terms of the rest of your situation I would personally refuse to call her &amp;quot;niece&amp;quot; in general (perhaps in specific contexts upon request as a favour) because its part of a connection you both possess, its not just her connection ,its yours too. To you; I&amp;#39;d imagine she IS your daughter so I think its wrong for you to acquiesce, especially so easily. We could argue that continuing to call her your daughter (in part) would demonstrate your commitment to that bond. She can call you Uncle if she wishes as they&amp;#39;re her words but I&amp;#39;d imagine you will forever want to call her what she is; your daughter.  &lt;/p&gt;\n\n&lt;p&gt;There is plenty of food for thought and as someone that is currently in such a similar situation as you were prior to the accident my mind has occasionally wondered toward that possibility. Your story means a lot to me as it helps describe a future I will hopefully avoid but should be prepared for if I am unlucky.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5vm19", "score_hidden": false, "stickied": false, "created": 1492033674.0, "created_utc": 1492004874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5wz9p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "W1ULH", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Sounds to me like both of your need to get some therapy. \n\n   No matter how young a child was when their parents died, they still miss them and wonder what life would have been like if things had been \"normal\". She's clearly going been going thru some introspective internalizations and is deep into wondering these things.. and to be honest a kinship placement can be harder for this than an outside placement. My two adoptees still miss their birth mom, but have never seen my wife as anything other than their new mom. (they both hate their fathers so much there was never an issue calling me Dad). But with kinship placement you have to deal with the fact that you already had a relationship prior to parental, and that can make it hard sometimes to fully see you as a parent. Sounds like one of the ways she is dealing with this teasing (and more likely, the introspection she's doing in her head) is to say to herself \"I don't have a new dad, my uncle is raising me!\" which is true. I would like to hope that she doesnt love you any less for it, she just needs that distiction to help contain the loss. Trauma therapy could go a long long way towards dealing with these issues, it's been a great help to my oldest to get him past his anxiety issues and feelings of worthlessness that he has had over what happened to him (little dude remembers nothing, he was 10 days old).\n\n  You also might want to get some therapy. Have you ever taken the time to deal with the fact that you lost so much of your family? often times \"sudden parents\" dont get too, as they focus on the unexpected little human who they now have to protect. But that doesn't change the fact that you lost your brother and his family, a huge part of your life was ripped away and you need to deal with it. It's possible that you are compenstating for some of the loss by projecting onto your daughter/niece, and that may be making her insistance on the distinction extra hard on you.\n\n  Also, please please please come join us in /r/AdoptiveParents/ \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds to me like both of your need to get some therapy. &lt;/p&gt;\n\n&lt;p&gt;No matter how young a child was when their parents died, they still miss them and wonder what life would have been like if things had been &amp;quot;normal&amp;quot;. She&amp;#39;s clearly going been going thru some introspective internalizations and is deep into wondering these things.. and to be honest a kinship placement can be harder for this than an outside placement. My two adoptees still miss their birth mom, but have never seen my wife as anything other than their new mom. (they both hate their fathers so much there was never an issue calling me Dad). But with kinship placement you have to deal with the fact that you already had a relationship prior to parental, and that can make it hard sometimes to fully see you as a parent. Sounds like one of the ways she is dealing with this teasing (and more likely, the introspection she&amp;#39;s doing in her head) is to say to herself &amp;quot;I don&amp;#39;t have a new dad, my uncle is raising me!&amp;quot; which is true. I would like to hope that she doesnt love you any less for it, she just needs that distiction to help contain the loss. Trauma therapy could go a long long way towards dealing with these issues, it&amp;#39;s been a great help to my oldest to get him past his anxiety issues and feelings of worthlessness that he has had over what happened to him (little dude remembers nothing, he was 10 days old).&lt;/p&gt;\n\n&lt;p&gt;You also might want to get some therapy. Have you ever taken the time to deal with the fact that you lost so much of your family? often times &amp;quot;sudden parents&amp;quot; dont get too, as they focus on the unexpected little human who they now have to protect. But that doesn&amp;#39;t change the fact that you lost your brother and his family, a huge part of your life was ripped away and you need to deal with it. It&amp;#39;s possible that you are compenstating for some of the loss by projecting onto your daughter/niece, and that may be making her insistance on the distinction extra hard on you.&lt;/p&gt;\n\n&lt;p&gt;Also, please please please come join us in &lt;a href=\"/r/AdoptiveParents/\"&gt;/r/AdoptiveParents/&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5wz9p", "score_hidden": false, "stickied": false, "created": 1492035417.0, "created_utc": 1492006617.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5ykv8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[deleted]", "edited": 1492008798.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5ykv8", "score_hidden": false, "stickied": false, "created": 1492037290.0, "created_utc": 1492008490.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5z9d0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AutoModerator", "parent_id": "t1_dg5z9cs", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Your post has been automatically removed.  Bigotry is not welcome in /r/parenting.  If you've received this in error please help us out and [send a modmail](http://np.reddit.com/message/compose?to=%2Fr%2FParenting).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Parenting) if you have any questions or concerns.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your post has been automatically removed.  Bigotry is not welcome in &lt;a href=\"/r/parenting\"&gt;/r/parenting&lt;/a&gt;.  If you&amp;#39;ve received this in error please help us out and &lt;a href=\"http://np.reddit.com/message/compose?to=%2Fr%2FParenting\"&gt;send a modmail&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;I am a bot, and this action was performed automatically. Please &lt;a href=\"/message/compose/?to=/r/Parenting\"&gt;contact the moderators of this subreddit&lt;/a&gt; if you have any questions or concerns.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5z9d0", "score_hidden": false, "stickied": false, "created": 1492038064.0, "created_utc": 1492009264.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5z9cs", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5z9cs", "score_hidden": false, "stickied": false, "created": 1492038064.0, "created_utc": 1492009264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg5zutd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lockraemono", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't know if it's the right thing to do, but in your shoes I'd sit her down in the morning and tell her, \"I know I told you yesterday that I would call you niece from now on, but after thinking about it last night, I can't do that. You may call me dad or uncle, but to me you are still my daughter and I will call you that.\" If you think of her as your daughter and you've put in the years of work being dad, then call her daughter. I think that that's okay. But I strongly agree with others that you both would benefit from therapy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if it&amp;#39;s the right thing to do, but in your shoes I&amp;#39;d sit her down in the morning and tell her, &amp;quot;I know I told you yesterday that I would call you niece from now on, but after thinking about it last night, I can&amp;#39;t do that. You may call me dad or uncle, but to me you are still my daughter and I will call you that.&amp;quot; If you think of her as your daughter and you&amp;#39;ve put in the years of work being dad, then call her daughter. I think that that&amp;#39;s okay. But I strongly agree with others that you both would benefit from therapy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg5zutd", "score_hidden": false, "stickied": false, "created": 1492038730.0, "created_utc": 1492009930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg6255u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "apis_cerana", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You sound like an incredibly kind person and a wonderful dad. Despite growing up in an area that was a mix of Asian and white (I'm Japanese) I didn't really fit in ever and was bullied in school as well. What helped was going to a Japanese weekend school and being able to hang out with other kids with similar backgrounds.\n\nI'm not suggesting that you go and put her in an Indian weekend school or anything that, per se (I know there are also pretty complex issues with being mixed race) -- but maybe there's an after school group or camp dedicated to one of her interests, or something like that? If there is absolutely no way you could change the school she goes to, at least that way she could make better friends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like an incredibly kind person and a wonderful dad. Despite growing up in an area that was a mix of Asian and white (I&amp;#39;m Japanese) I didn&amp;#39;t really fit in ever and was bullied in school as well. What helped was going to a Japanese weekend school and being able to hang out with other kids with similar backgrounds.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not suggesting that you go and put her in an Indian weekend school or anything that, per se (I know there are also pretty complex issues with being mixed race) -- but maybe there&amp;#39;s an after school group or camp dedicated to one of her interests, or something like that? If there is absolutely no way you could change the school she goes to, at least that way she could make better friends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6255u", "score_hidden": false, "stickied": false, "created": 1492041246.0, "created_utc": 1492012446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg62wko", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "atcoyou", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Best of luck my friend.  As the father to a \"mixed race\" daughter, it is sad to hear this... especially as someone who hails from I suspect the same city as you.  Children can be pretty mean, and I suspect your daughter will change her mind at some point.  Don't get caught up on the name thing... or at least try not to.\n\nPersonally I would want to explain that 1. I would respect her wishes because you respect her, but 2. that you think the \"friends'\" attitudes are very out of date... perhaps draw parallels to people who still think the world is flat if you want to go for a PC analogy.  The world she will grow up in will almost certainly find the outdated attitudes unacceptable.\n\nI would watch out for her pulling back, as despite how old she seems, she still needs her Dad, and that is you.  (a rose by any other name is still a rose and all that)\n\nNow is not the right time, as it is still fresh.  As she starts to grow and discover who she is, she may start to think about things like how you compare as a father vs. someone who has a one night stand with someone and is technically a biological father, but doesn't even know they exist.  At some point, it may be good for her to know that your reaction to hearing how she felt was sadness.  (Personally I think it is important, especially in this case, that you emphasize that you are in control of your emotions, and she isn't the one making you feel this way, but letting her know how you feel so she can empathize.)\n\nAnyway, again best of luck with the situation... it is sad to heart that some of us have passed on some terrible ideas to the next generation.  As you pointed out, they are throwing around the ideas without an understanding of them, so it is likely coming from other parents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Best of luck my friend.  As the father to a &amp;quot;mixed race&amp;quot; daughter, it is sad to hear this... especially as someone who hails from I suspect the same city as you.  Children can be pretty mean, and I suspect your daughter will change her mind at some point.  Don&amp;#39;t get caught up on the name thing... or at least try not to.&lt;/p&gt;\n\n&lt;p&gt;Personally I would want to explain that 1. I would respect her wishes because you respect her, but 2. that you think the &amp;quot;friends&amp;#39;&amp;quot; attitudes are very out of date... perhaps draw parallels to people who still think the world is flat if you want to go for a PC analogy.  The world she will grow up in will almost certainly find the outdated attitudes unacceptable.&lt;/p&gt;\n\n&lt;p&gt;I would watch out for her pulling back, as despite how old she seems, she still needs her Dad, and that is you.  (a rose by any other name is still a rose and all that)&lt;/p&gt;\n\n&lt;p&gt;Now is not the right time, as it is still fresh.  As she starts to grow and discover who she is, she may start to think about things like how you compare as a father vs. someone who has a one night stand with someone and is technically a biological father, but doesn&amp;#39;t even know they exist.  At some point, it may be good for her to know that your reaction to hearing how she felt was sadness.  (Personally I think it is important, especially in this case, that you emphasize that you are in control of your emotions, and she isn&amp;#39;t the one making you feel this way, but letting her know how you feel so she can empathize.)&lt;/p&gt;\n\n&lt;p&gt;Anyway, again best of luck with the situation... it is sad to heart that some of us have passed on some terrible ideas to the next generation.  As you pointed out, they are throwing around the ideas without an understanding of them, so it is likely coming from other parents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg62wko", "score_hidden": false, "stickied": false, "created": 1492042066.0, "created_utc": 1492013266.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg63r98", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bleeker_street", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Honestly, I would not respect her choice. I mean if she calls you dad answer. If she calls you uncle answer and just don't make a big deal out of it. But I would not start calling her your niece.  She is your daughter. You adopted her. You raised her.  That's it. She needs that safety and security even if she doesn't know it. She also needs to understand that family takes many forms, and your form is completely valid.  \n\nA confused, grieving, bullied nine year old just isn't in the place to be making those kinds of choices. \n\nI'd sit here down and tell her you've been thinking about it and she's always going to be your daughter and your little girl. No matter what.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, I would not respect her choice. I mean if she calls you dad answer. If she calls you uncle answer and just don&amp;#39;t make a big deal out of it. But I would not start calling her your niece.  She is your daughter. You adopted her. You raised her.  That&amp;#39;s it. She needs that safety and security even if she doesn&amp;#39;t know it. She also needs to understand that family takes many forms, and your form is completely valid.  &lt;/p&gt;\n\n&lt;p&gt;A confused, grieving, bullied nine year old just isn&amp;#39;t in the place to be making those kinds of choices. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d sit here down and tell her you&amp;#39;ve been thinking about it and she&amp;#39;s always going to be your daughter and your little girl. No matter what.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg63r98", "score_hidden": false, "stickied": false, "created": 1492042973.0, "created_utc": 1492014173.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg67ue7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "S-Plantagenet", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Between 9 and 19 the child is trying to figure out who they are. Let them. Be kind and supportive, but firm when you need to be...\n\nIt will work out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Between 9 and 19 the child is trying to figure out who they are. Let them. Be kind and supportive, but firm when you need to be...&lt;/p&gt;\n\n&lt;p&gt;It will work out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg67ue7", "score_hidden": false, "stickied": false, "created": 1492047159.0, "created_utc": 1492018359.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg6au75", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RideDarkHorseRide", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I read your story about you and your daughter. First off, sorry for all your loses. Second, she is your daughter and you are her father. She may not see it right now and she may have a different outlook on the situation right now because of the bullying. I do believe that if you just help her grow up and teach her how to be a good person, then in time she will come back round to understanding you are her father. I am 28 now and I look back at how many of the things I did when I was younger which was wrong or hurtful and then realize how much I have changed. I had good guidance from people who are my family and people who are not my family that helped me become the person I am today. I am 100 times more compassionate and caring for others today than what I used to be. What I am trying to say that your daughter is just going through a tough time in her life and it may take some time for her to realize that you are her dad. I think it is good that you are respecting her wishes but I would also tell her that deep down that you see her as your daughter and that being her father is not a title or a name but rather a feeling and a connection between you two. In time she will see the truth. Keep your head up and keep being a great dad. I hope this helps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read your story about you and your daughter. First off, sorry for all your loses. Second, she is your daughter and you are her father. She may not see it right now and she may have a different outlook on the situation right now because of the bullying. I do believe that if you just help her grow up and teach her how to be a good person, then in time she will come back round to understanding you are her father. I am 28 now and I look back at how many of the things I did when I was younger which was wrong or hurtful and then realize how much I have changed. I had good guidance from people who are my family and people who are not my family that helped me become the person I am today. I am 100 times more compassionate and caring for others today than what I used to be. What I am trying to say that your daughter is just going through a tough time in her life and it may take some time for her to realize that you are her dad. I think it is good that you are respecting her wishes but I would also tell her that deep down that you see her as your daughter and that being her father is not a title or a name but rather a feeling and a connection between you two. In time she will see the truth. Keep your head up and keep being a great dad. I hope this helps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6au75", "score_hidden": false, "stickied": false, "created": 1492050210.0, "created_utc": 1492021410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg6hlju", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "caliv0608", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I did not lose my parents, but my bio dad left before I was born.  My mom married an older white guy when I was about 3, and I called him dad.  When a kid at school asked who the old white guy picking me up from school was, I happily replied that it was my dad.  She made a face and said that wasn't possible.  Being 6 years old and confused, I told my mom what happened.  She sat me down and explained that \"that guy Michael\" I had talked to on the phone twice was actually my dad and that her husband was my stepdad.  I was devastated and never called my stepdad \"dad\" again.  I remember every time my mom, grandmother, aunts or friends said I was being ridiculous but in my kid mind I blamed my stepdad for my bio dad not being around.  \nYour daughter will see things more clearly as she gets older.  She has been through much harder than I have, so I can only imagine how tumultuous her feelings are on the subject.  Please don't give up on her. My stepdad respected my choice to not call him dad anymore and never even talked to me about it.  Once again, being a kid, I felt like he didn't really care if he didn't mind the change.  It sounds like you are being much more communicative, but give her time and continue to be there for her.  She might benefit from talking to the school counselor to start about the issues at school and maybe more counseling from there.  But honestly- I think she just needs time to sort this out, and to know that you will be the firm ground for her to stand on while she does.  Don't mean to sound weird, but sometimes that's what kids really want.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did not lose my parents, but my bio dad left before I was born.  My mom married an older white guy when I was about 3, and I called him dad.  When a kid at school asked who the old white guy picking me up from school was, I happily replied that it was my dad.  She made a face and said that wasn&amp;#39;t possible.  Being 6 years old and confused, I told my mom what happened.  She sat me down and explained that &amp;quot;that guy Michael&amp;quot; I had talked to on the phone twice was actually my dad and that her husband was my stepdad.  I was devastated and never called my stepdad &amp;quot;dad&amp;quot; again.  I remember every time my mom, grandmother, aunts or friends said I was being ridiculous but in my kid mind I blamed my stepdad for my bio dad not being around.&lt;br/&gt;\nYour daughter will see things more clearly as she gets older.  She has been through much harder than I have, so I can only imagine how tumultuous her feelings are on the subject.  Please don&amp;#39;t give up on her. My stepdad respected my choice to not call him dad anymore and never even talked to me about it.  Once again, being a kid, I felt like he didn&amp;#39;t really care if he didn&amp;#39;t mind the change.  It sounds like you are being much more communicative, but give her time and continue to be there for her.  She might benefit from talking to the school counselor to start about the issues at school and maybe more counseling from there.  But honestly- I think she just needs time to sort this out, and to know that you will be the firm ground for her to stand on while she does.  Don&amp;#39;t mean to sound weird, but sometimes that&amp;#39;s what kids really want.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6hlju", "score_hidden": false, "stickied": false, "created": 1492057154.0, "created_utc": 1492028354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg6swb7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Rosiegrace", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "From a mother's point of view - wow, you are doing an amazing thing for your daughter, even though I can't even imagine how much you must be hurting right now from her words. She is so so lucky to have you.\n\nFrom a teacher's point of view - please, please go in to talk to the teachers (and the principal if possible). I know you aren't interested in switching to the Catholic school, but they don't need to know that. Principals (at least in my district) definitely want to make things right when there's a problem, as opposed to losing a possible pupil to private school.\n\nOther than that, just sending so many hugs your way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From a mother&amp;#39;s point of view - wow, you are doing an amazing thing for your daughter, even though I can&amp;#39;t even imagine how much you must be hurting right now from her words. She is so so lucky to have you.&lt;/p&gt;\n\n&lt;p&gt;From a teacher&amp;#39;s point of view - please, please go in to talk to the teachers (and the principal if possible). I know you aren&amp;#39;t interested in switching to the Catholic school, but they don&amp;#39;t need to know that. Principals (at least in my district) definitely want to make things right when there&amp;#39;s a problem, as opposed to losing a possible pupil to private school.&lt;/p&gt;\n\n&lt;p&gt;Other than that, just sending so many hugs your way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6swb7", "score_hidden": false, "stickied": false, "created": 1492070535.0, "created_utc": 1492041735.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg7h0fv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "livinghorcrux", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "No advice, just wanted to express my admiration. You are one strong wonderful human being. To have learnt to live with so much pain and remain so kind and thoughtful. Your daughter, because she is, is entering a different phase of development psychologically and will be more open to external influences, but in her heart she will still know that you are her dad, the person who raised her, was there for most of her firsts and will continue to be there. Trust both of you that she will come around. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No advice, just wanted to express my admiration. You are one strong wonderful human being. To have learnt to live with so much pain and remain so kind and thoughtful. Your daughter, because she is, is entering a different phase of development psychologically and will be more open to external influences, but in her heart she will still know that you are her dad, the person who raised her, was there for most of her firsts and will continue to be there. Trust both of you that she will come around. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7h0fv", "score_hidden": false, "stickied": false, "created": 1492115367.0, "created_utc": 1492086567.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dgdb71w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ms-anthrope", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She IS your daughter.  She's going through some rough stuff right now.  Remind her how much she is loved.  Tell her she can call you whatever she wants, but you'll always be there for her.  You will always be her family.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She IS your daughter.  She&amp;#39;s going through some rough stuff right now.  Remind her how much she is loved.  Tell her she can call you whatever she wants, but you&amp;#39;ll always be there for her.  You will always be her family.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdb71w", "score_hidden": false, "stickied": false, "created": 1492450257.0, "created_utc": 1492421457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg6qzdp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "vault_dweller1031", "parent_id": "t1_dg6g4eo", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Ignore this dude, OP. My dad isn't my biological father, but he's still my dad. He's always loved me unconditionally. He dropped me off on my first day of kindegarten and on my last day of high school. He gave me away at my wedding. He's an amazing grandfather to my daughter. He didn't have to be those things, but he chose to. The same way you do with your daughter. That makes you an amazing father. Parenting goes deeper than technicalities.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ignore this dude, OP. My dad isn&amp;#39;t my biological father, but he&amp;#39;s still my dad. He&amp;#39;s always loved me unconditionally. He dropped me off on my first day of kindegarten and on my last day of high school. He gave me away at my wedding. He&amp;#39;s an amazing grandfather to my daughter. He didn&amp;#39;t have to be those things, but he chose to. The same way you do with your daughter. That makes you an amazing father. Parenting goes deeper than technicalities.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6qzdp", "score_hidden": false, "stickied": false, "created": 1492068170.0, "created_utc": 1492039370.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg7ovqe", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "IcarusGoodman", "parent_id": "t1_dg6r4pg", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "He's not her real father, that is a biological fact. He is fulfilling the role of her father, also true. It's not complicated.The advice was not to take it as a slight that his Niece no longer wants to call him Dad, it doesn't lessen their relationship or devalue what he's doing for her or decrease the amount of love between them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s not her real father, that is a biological fact. He is fulfilling the role of her father, also true. It&amp;#39;s not complicated.The advice was not to take it as a slight that his Niece no longer wants to call him Dad, it doesn&amp;#39;t lessen their relationship or devalue what he&amp;#39;s doing for her or decrease the amount of love between them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7ovqe", "score_hidden": false, "stickied": false, "created": 1492125540.0, "created_utc": 1492096740.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6r4pg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "vault_dweller1031", "parent_id": "t1_dg6js2g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt;I try not to give advice unless asked for...\n\nGoes on to say despite almost 9 years of parenting OP isn't a real dad and give absolutely zero advice on the situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I try not to give advice unless asked for...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Goes on to say despite almost 9 years of parenting OP isn&amp;#39;t a real dad and give absolutely zero advice on the situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6r4pg", "score_hidden": false, "stickied": false, "created": 1492068349.0, "created_utc": 1492039549.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6js2g", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "IcarusGoodman", "parent_id": "t1_dg6g4eo", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You come to Reddit and make a post, obviously asking for advice. I try not to give advice unless asked for and in this case it was. Obviously the majority of people have a different opinion than mine, so there's plenty of that if you wish to read the same thing over and over again. Mine is simply a different opinion for you to chew on. A different angle. You don't have to agree or accept it. But I'd like to think it may be beneficial to think about things differently, even if it only serves to further cement your acceptance of the opposite. \n\nObviously you know much more about your situation and your brother than some stranger on the internet does. Which is a good reason why there's no reason for you to get angry at my opinion. If it angers you so, I'd question why and wonder if I haven't struck on something internal that you need to wrestle and deal with. \n\nI agree that \"Dad\" and the like aren't always used in the formal context, and there are times where it may be the best option to use it. But as a general principle, I think it better to simply use the true Uncle/Niece strategy. Peter Parker didn't call them Mom and Dad it was Uncle Ben and Aunt Mae (sorry for all the comic references, there's just so many orphans in there). If starting from scratch, that's the strategy I would recommend. In your situation, you chose differently and now the issue is coming up after many years, so it's a bit messier. But it's your niece herself who is bringing this up and saying that she wants to call you uncle. Her well being comes first. \n\nYou seem to be hurt by her asking for this change. I'm simply saying you shouldn't feel hurt or slighted at all. It's not some diss or downgrade because she dislikes you or think you're a bad parent. It's just a recognition of the truth, which again, I'll say actually puts you in greater light, as caring for your niece as you have is a greater sacrifice than if she were your biological daughter (and why is it a greater sacrifice? Because there's less genetic connection, and hence less biological benefit, though still a decent amount as she is your biological niece)\n\nAdoption of strangers is a noble act, and the child should be treated as though they are your kid. But they aren't. If my kid adopted a stranger's child, I'd treat them like a grandchild for the most part, but not entirely the same. I'd encourage them to keep their biological name for instance. Genetics does matter to me, more so than you it seems. That's OK.We have different values, just take that into account when considering any of these points and throw them in the dumpster if you find them incompatible with your values. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You come to Reddit and make a post, obviously asking for advice. I try not to give advice unless asked for and in this case it was. Obviously the majority of people have a different opinion than mine, so there&amp;#39;s plenty of that if you wish to read the same thing over and over again. Mine is simply a different opinion for you to chew on. A different angle. You don&amp;#39;t have to agree or accept it. But I&amp;#39;d like to think it may be beneficial to think about things differently, even if it only serves to further cement your acceptance of the opposite. &lt;/p&gt;\n\n&lt;p&gt;Obviously you know much more about your situation and your brother than some stranger on the internet does. Which is a good reason why there&amp;#39;s no reason for you to get angry at my opinion. If it angers you so, I&amp;#39;d question why and wonder if I haven&amp;#39;t struck on something internal that you need to wrestle and deal with. &lt;/p&gt;\n\n&lt;p&gt;I agree that &amp;quot;Dad&amp;quot; and the like aren&amp;#39;t always used in the formal context, and there are times where it may be the best option to use it. But as a general principle, I think it better to simply use the true Uncle/Niece strategy. Peter Parker didn&amp;#39;t call them Mom and Dad it was Uncle Ben and Aunt Mae (sorry for all the comic references, there&amp;#39;s just so many orphans in there). If starting from scratch, that&amp;#39;s the strategy I would recommend. In your situation, you chose differently and now the issue is coming up after many years, so it&amp;#39;s a bit messier. But it&amp;#39;s your niece herself who is bringing this up and saying that she wants to call you uncle. Her well being comes first. &lt;/p&gt;\n\n&lt;p&gt;You seem to be hurt by her asking for this change. I&amp;#39;m simply saying you shouldn&amp;#39;t feel hurt or slighted at all. It&amp;#39;s not some diss or downgrade because she dislikes you or think you&amp;#39;re a bad parent. It&amp;#39;s just a recognition of the truth, which again, I&amp;#39;ll say actually puts you in greater light, as caring for your niece as you have is a greater sacrifice than if she were your biological daughter (and why is it a greater sacrifice? Because there&amp;#39;s less genetic connection, and hence less biological benefit, though still a decent amount as she is your biological niece)&lt;/p&gt;\n\n&lt;p&gt;Adoption of strangers is a noble act, and the child should be treated as though they are your kid. But they aren&amp;#39;t. If my kid adopted a stranger&amp;#39;s child, I&amp;#39;d treat them like a grandchild for the most part, but not entirely the same. I&amp;#39;d encourage them to keep their biological name for instance. Genetics does matter to me, more so than you it seems. That&amp;#39;s OK.We have different values, just take that into account when considering any of these points and throw them in the dumpster if you find them incompatible with your values. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6js2g", "score_hidden": false, "stickied": false, "created": 1492059439.0, "created_utc": 1492030639.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6g4eo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg6f8z3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; Words have specific meanings\n\nAgreed. But \"dad\" doesn't always mean \"biological dad.\" If she wasn't my brother's kid, would you be saying the same thing? If I adopted her from a family from another country, would you still be saying that she should call me her uncle or something else instead of her dad?\n\n&gt; She should be raised to know her father and respect her father's memory\n\nShe is being raised that way. You're making a lot of assumptions.\n\n&gt; People can have different opinions, but I know that's what I'd want if I died and my brother raised my kid\n\nFocus on the first part of this sentence, not the second. What *you* would want if you died is completely irrelevant to what I think *my* brother would have wanted. The fact that you think you know what he would have wanted more than I do is making me ridiculously angry.\n\n&gt; if she says you're her father, well, there's going to be times where people realize that's not factually true\n\nWhat? I explicitly said in the post that I've told her since she could first talk about my brother and sister-in-law. She knows that I'm not her biological dad and she always has. Do you think every adopted kid should always say \"my adoptive dad\" whenever talking about their dad? Obviously not. Do you think any kid ever says anything to their friends like \"my adoptive dad is taking me to the park.\" No. They say \"my dad is taking me to the park.\" We're not hiding the fact that I'm not her biological dad from anyone, but that doesn't mean she has to tell everyone she knows that I'm not her biological dad whenever I come up in conversation (or vice-versa).\n\n&gt; To be clear, I feel the same way about any adoption situation. They're not your son or daughter. \n\nAlright, man. If you think that genes are more important than actual relationships, then feel free to think that. I wonder if you would be saying the same thing if one of your kids adopted somebody. Would you expect that kid to call you \"adoptive grandpa\" or your first name or some stupid shit like that, or would you treat your grandchild like *your grandchild*?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Words have specific meanings&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agreed. But &amp;quot;dad&amp;quot; doesn&amp;#39;t always mean &amp;quot;biological dad.&amp;quot; If she wasn&amp;#39;t my brother&amp;#39;s kid, would you be saying the same thing? If I adopted her from a family from another country, would you still be saying that she should call me her uncle or something else instead of her dad?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She should be raised to know her father and respect her father&amp;#39;s memory&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She is being raised that way. You&amp;#39;re making a lot of assumptions.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;People can have different opinions, but I know that&amp;#39;s what I&amp;#39;d want if I died and my brother raised my kid&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Focus on the first part of this sentence, not the second. What &lt;em&gt;you&lt;/em&gt; would want if you died is completely irrelevant to what I think &lt;em&gt;my&lt;/em&gt; brother would have wanted. The fact that you think you know what he would have wanted more than I do is making me ridiculously angry.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;if she says you&amp;#39;re her father, well, there&amp;#39;s going to be times where people realize that&amp;#39;s not factually true&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What? I explicitly said in the post that I&amp;#39;ve told her since she could first talk about my brother and sister-in-law. She knows that I&amp;#39;m not her biological dad and she always has. Do you think every adopted kid should always say &amp;quot;my adoptive dad&amp;quot; whenever talking about their dad? Obviously not. Do you think any kid ever says anything to their friends like &amp;quot;my adoptive dad is taking me to the park.&amp;quot; No. They say &amp;quot;my dad is taking me to the park.&amp;quot; We&amp;#39;re not hiding the fact that I&amp;#39;m not her biological dad from anyone, but that doesn&amp;#39;t mean she has to tell everyone she knows that I&amp;#39;m not her biological dad whenever I come up in conversation (or vice-versa).&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;To be clear, I feel the same way about any adoption situation. They&amp;#39;re not your son or daughter. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Alright, man. If you think that genes are more important than actual relationships, then feel free to think that. I wonder if you would be saying the same thing if one of your kids adopted somebody. Would you expect that kid to call you &amp;quot;adoptive grandpa&amp;quot; or your first name or some stupid shit like that, or would you treat your grandchild like &lt;em&gt;your grandchild&lt;/em&gt;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6g4eo", "score_hidden": false, "stickied": false, "created": 1492055633.0, "created_utc": 1492026833.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6f8z3", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "IcarusGoodman", "parent_id": "t1_dg6crp2", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It's just the facts as I see them. He's her father. This is undeniably true. You have taken over the role of father figure due to the tragedy that happened, but that doesn't mean he's still not her father. You're her Uncle who stepped up and chose to take the very commendable act of raising your niece and treating her as well as you would have treated your own daughter. \n\nWords have specific meanings, the more we gloss over them the more confused we make things. She should be raised to know her father and respect her father's memory and when someone asks who her father is and she says you and not your brother how is that not a slight against him? It's a kind of erasure. If asked that question she say that your brother is her father but he died when she was young and my uncle raises me and he's the best. \n\nPeople can have different opinions, but I know that's what I'd want if I died and my brother raised my kid. And by trying to ignore the truth of what happened you're actually setting up these tricky and difficult situations for your daughter. Because people will ask, continually throughout her life, and if she says you're her father, well, there's going to be times where people realize that's not factually true, and some will be asses about it. The better option is to be straight up from the beginning. Some people might still be asses, but there will be less of them and they will have less ammunition. \n\nTo be clear, I feel the same way about any adoption situation. They're not your son or daughter. They're your ward. Robin isn't Batman's son. You love them like a son or daughter, but I feel it's better to be honest about the nature of the relationship than to pretend it's something it's not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s just the facts as I see them. He&amp;#39;s her father. This is undeniably true. You have taken over the role of father figure due to the tragedy that happened, but that doesn&amp;#39;t mean he&amp;#39;s still not her father. You&amp;#39;re her Uncle who stepped up and chose to take the very commendable act of raising your niece and treating her as well as you would have treated your own daughter. &lt;/p&gt;\n\n&lt;p&gt;Words have specific meanings, the more we gloss over them the more confused we make things. She should be raised to know her father and respect her father&amp;#39;s memory and when someone asks who her father is and she says you and not your brother how is that not a slight against him? It&amp;#39;s a kind of erasure. If asked that question she say that your brother is her father but he died when she was young and my uncle raises me and he&amp;#39;s the best. &lt;/p&gt;\n\n&lt;p&gt;People can have different opinions, but I know that&amp;#39;s what I&amp;#39;d want if I died and my brother raised my kid. And by trying to ignore the truth of what happened you&amp;#39;re actually setting up these tricky and difficult situations for your daughter. Because people will ask, continually throughout her life, and if she says you&amp;#39;re her father, well, there&amp;#39;s going to be times where people realize that&amp;#39;s not factually true, and some will be asses about it. The better option is to be straight up from the beginning. Some people might still be asses, but there will be less of them and they will have less ammunition. &lt;/p&gt;\n\n&lt;p&gt;To be clear, I feel the same way about any adoption situation. They&amp;#39;re not your son or daughter. They&amp;#39;re your ward. Robin isn&amp;#39;t Batman&amp;#39;s son. You love them like a son or daughter, but I feel it&amp;#39;s better to be honest about the nature of the relationship than to pretend it&amp;#39;s something it&amp;#39;s not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6f8z3", "score_hidden": false, "stickied": false, "created": 1492054744.0, "created_utc": 1492025944.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6crp2", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "qazmlpwsxnkoedc", "parent_id": "t1_dg62bg7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Man, that's a shitty thing to say. Saying that she's not my daughter is one thing. I disagree, but I can see where you're coming from. But to say that I'm somehow tainting my brother's memory or disrespecting him by calling her my daughter is incredibly rude. I loved my brother as much as brothers can love each other and I would never say or do *anything* to disrespect him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, that&amp;#39;s a shitty thing to say. Saying that she&amp;#39;s not my daughter is one thing. I disagree, but I can see where you&amp;#39;re coming from. But to say that I&amp;#39;m somehow tainting my brother&amp;#39;s memory or disrespecting him by calling her my daughter is incredibly rude. I loved my brother as much as brothers can love each other and I would never say or do &lt;em&gt;anything&lt;/em&gt; to disrespect him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6crp2", "score_hidden": false, "stickied": false, "created": 1492052184.0, "created_utc": 1492023384.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64v4l3", "likes": null, "replies": "", "user_reports": [], "id": "dg6x6rb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "GrrrArrgh", "parent_id": "t1_dg62bg7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Jesus, dude. He's not her biological father, but he is her father. You can have more than one. It's also usually comforting for children to be able to call their primary caregiver a parent. The 9-year-old's feelings are important and big, but this situation was brought on by bullying and trauma and and may not reflect what she really wants. That's why all the suggestions for therapy, to work through this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jesus, dude. He&amp;#39;s not her biological father, but he is her father. You can have more than one. It&amp;#39;s also usually comforting for children to be able to call their primary caregiver a parent. The 9-year-old&amp;#39;s feelings are important and big, but this situation was brought on by bullying and trauma and and may not reflect what she really wants. That&amp;#39;s why all the suggestions for therapy, to work through this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6x6rb", "score_hidden": false, "stickied": false, "created": 1492075752.0, "created_utc": 1492046952.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg62bg7", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "IcarusGoodman", "parent_id": "t3_64v4l3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Never try to deny reality. She's not your daughter. You're not her father. To say otherwise is not only untrue, it's also a bit of a slight against her actual father. She only has one father and his memory should be remembered and respected. \n\nYou're her uncle. A father figure, to be sure. But her Uncle. And that's something to be proud of. The fact that you're not her father, yet you've taken her care under your wing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Never try to deny reality. She&amp;#39;s not your daughter. You&amp;#39;re not her father. To say otherwise is not only untrue, it&amp;#39;s also a bit of a slight against her actual father. She only has one father and his memory should be remembered and respected. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re her uncle. A father figure, to be sure. But her Uncle. And that&amp;#39;s something to be proud of. The fact that you&amp;#39;re not her father, yet you&amp;#39;ve taken her care under your wing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg62bg7", "score_hidden": false, "stickied": false, "created": 1492041434.0, "created_utc": 1492012634.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}], "after": null, "before": null}}]