[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi. I&amp;#39;ve replied to a lot of posts here but this is my first time asking my own question. I have a 7 (very close to being 8) year old Son. He is doing wonderful in all aspects of life and I am quite proud of him- good grades, lots of friends, kind, he&amp;#39;s in cub scouts and loves going to the Boys and Girls Club twice a week as well. The issue is that I wish he had more confidence in himself. I worry about this more than some, I suppose, because when I went through puberty, I developed Social Anxiety Disorder and went through years of turmoil until I finally got help from a doctor. I&amp;#39;ve always tried extra hard to instill confidence in both of my kids, but my Son seems to have doubts about himself in some situations, for instance he gets embarrassed easily and doesn&amp;#39;t do some things if he thinks he won&amp;#39;t be good at it or will be singled out. I think this is fine if he is just introverted and doesn&amp;#39;t want to be in the spotlight, but here is the thing that broke my heart. Yesterday and the day before it was warm outside, and he wore shorts to school the day before. When I was getting him ready for school yesterday, I handed him some shorts and he said he didn&amp;#39;t want to wear shorts anymore. I asked him why and he said that he didn&amp;#39;t want anybody to see his birthmark. He has a brown, quarter size birthmark right below his knee. He said somebody (maybe more than one person, I&amp;#39;m not sure) asked what it was and he lied and said it was from falling down. So, I talked with him the best I could about just telling the truth, that it&amp;#39;s a birthmark and that almost everyone has them, but a lot of times it&amp;#39;s where you can&amp;#39;t see it and there&amp;#39;s nothing wrong with it, but it seems like he brushed me off and wanted to change the subject. Any ideas from you wonderful people out there about what the best thing for me say to him about this? I also welcome any advice, reading material, etc. about instilling confidence in children. He is such a great kid and I want him to see and feel that. Thank you ahead of time!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi. I've replied to a lot of posts here but this is my first time asking my own question. I have a 7 (very close to being 8) year old Son. He is doing wonderful in all aspects of life and I am quite proud of him- good grades, lots of friends, kind, he's in cub scouts and loves going to the Boys and Girls Club twice a week as well. The issue is that I wish he had more confidence in himself. I worry about this more than some, I suppose, because when I went through puberty, I developed Social Anxiety Disorder and went through years of turmoil until I finally got help from a doctor. I've always tried extra hard to instill confidence in both of my kids, but my Son seems to have doubts about himself in some situations, for instance he gets embarrassed easily and doesn't do some things if he thinks he won't be good at it or will be singled out. I think this is fine if he is just introverted and doesn't want to be in the spotlight, but here is the thing that broke my heart. Yesterday and the day before it was warm outside, and he wore shorts to school the day before. When I was getting him ready for school yesterday, I handed him some shorts and he said he didn't want to wear shorts anymore. I asked him why and he said that he didn't want anybody to see his birthmark. He has a brown, quarter size birthmark right below his knee. He said somebody (maybe more than one person, I'm not sure) asked what it was and he lied and said it was from falling down. So, I talked with him the best I could about just telling the truth, that it's a birthmark and that almost everyone has them, but a lot of times it's where you can't see it and there's nothing wrong with it, but it seems like he brushed me off and wanted to change the subject. Any ideas from you wonderful people out there about what the best thing for me say to him about this? I also welcome any advice, reading material, etc. about instilling confidence in children. He is such a great kid and I want him to see and feel that. Thank you ahead of time!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Advice", "id": "64x8n7", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "eatdrinkandbemerry80", "saved": false, "mod_reports": [], "name": "t3_64x8n7", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "advice", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/64x8n7/childs_insecurity/", "num_reports": null, "locked": false, "stickied": false, "created": 1492020381.0, "url": "https://www.reddit.com/r/Parenting/comments/64x8n7/childs_insecurity/", "author_flair_text": null, "quarantine": false, "title": "Child's Insecurity", "created_utc": 1491991581.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64x8n7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64x8n7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64x8n7", "likes": null, "replies": "", "user_reports": [], "id": "dg6mbex", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t1_dg6hfyx", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Ahh okay. He seems like a well adjusted kid. Is it *just* his birthmark he's expressed insecurities over, or is it one of a list of things, the \"straw that broke the camel's back\" per se? \n\nIf it's the former, I wouldn't worry or do too much besides what you've already been doing, not unless he's specifically being bullied for it or something. I'm sure he'll get over his worries and cave and wear shorts when it gets to 90 degrees outside if it was just some kid asking about it. If he doesn't, it's possible he might've been getting bullied for it. I know you wrote he was asked about it, but that might've just been another kid that was genuinely curious\n\nIf it's the later, if he starts saying he doesn't like the way he looks in general, that's when I'd truly get more concerned that he's either being bullied or has underlying body issues.\n\nAlso, if he hasn't already, consider letting him pick out new clothes or his outfits every day, within reason obviously. I started picking what I wore around his age. It's an easy way to ensure he feels good about what he wears every day, and it lets you subtly keep watch over how he dresses as it gets warmer. If he keeps refusing to wear shorts when it's in the middle of July and he absolutely refuses to go bare below the knees...that's when you start to take more serious interventions with the birthmark thing. So just...keep a close eye out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahh okay. He seems like a well adjusted kid. Is it &lt;em&gt;just&lt;/em&gt; his birthmark he&amp;#39;s expressed insecurities over, or is it one of a list of things, the &amp;quot;straw that broke the camel&amp;#39;s back&amp;quot; per se? &lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s the former, I wouldn&amp;#39;t worry or do too much besides what you&amp;#39;ve already been doing, not unless he&amp;#39;s specifically being bullied for it or something. I&amp;#39;m sure he&amp;#39;ll get over his worries and cave and wear shorts when it gets to 90 degrees outside if it was just some kid asking about it. If he doesn&amp;#39;t, it&amp;#39;s possible he might&amp;#39;ve been getting bullied for it. I know you wrote he was asked about it, but that might&amp;#39;ve just been another kid that was genuinely curious&lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s the later, if he starts saying he doesn&amp;#39;t like the way he looks in general, that&amp;#39;s when I&amp;#39;d truly get more concerned that he&amp;#39;s either being bullied or has underlying body issues.&lt;/p&gt;\n\n&lt;p&gt;Also, if he hasn&amp;#39;t already, consider letting him pick out new clothes or his outfits every day, within reason obviously. I started picking what I wore around his age. It&amp;#39;s an easy way to ensure he feels good about what he wears every day, and it lets you subtly keep watch over how he dresses as it gets warmer. If he keeps refusing to wear shorts when it&amp;#39;s in the middle of July and he absolutely refuses to go bare below the knees...that&amp;#39;s when you start to take more serious interventions with the birthmark thing. So just...keep a close eye out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6mbex", "score_hidden": false, "stickied": false, "created": 1492062395.0, "created_utc": 1492033595.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hfyx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "eatdrinkandbemerry80", "parent_id": "t1_dg60c51", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thanks for your reply. I understand how you felt because I went through that also, which is why I'm extra sensitive to self-esteem issues with my kids. I have sat down and talked to him a lot about the fact that it's ok to make mistakes and people are different, etc. He seems to understand those and applies it to personality just fine, but he seems like he is more concerned with his appearance and being embarrassed about that at this point. (He isn't nerdy in the least, not yet anyway. He's more sporty, trendy). I will take your advice and try to apply those things I have taught him to the outside appearance as well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your reply. I understand how you felt because I went through that also, which is why I&amp;#39;m extra sensitive to self-esteem issues with my kids. I have sat down and talked to him a lot about the fact that it&amp;#39;s ok to make mistakes and people are different, etc. He seems to understand those and applies it to personality just fine, but he seems like he is more concerned with his appearance and being embarrassed about that at this point. (He isn&amp;#39;t nerdy in the least, not yet anyway. He&amp;#39;s more sporty, trendy). I will take your advice and try to apply those things I have taught him to the outside appearance as well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6hfyx", "score_hidden": false, "stickied": false, "created": 1492056996.0, "created_utc": 1492028196.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60c51", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t3_64x8n7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Hi there. So, full disclaimer: I am not a biological parent. I've raised a child like my own for the last five years since he was five, however. That said, if anything, \"my\" kid is anything but lacking confidence. If anything, sometimes I wish he could reign himself in, lol. So my advice may not be sound or sound like me spewing random suggestions at the wall and seeing what sticks.\n\nThat said, when I was your son's age - a little older, perhaps, I started developing Social Anxiety. I hit my nadir when I was 15 or 16 or so; I couldn't even check out at a register or talk on the phone with a stranger without having a full-blown panic attack for fear of \"fucking it up\", and I too was very conscious about my appearance. I was afraid to do anything for fear of failing or looking like an idiot all throughout my childhood. I couldn't get a job because I was afraid of fucking up the interview or following up on the phone. I couldn't bring myself to get my license until I was almost 18 because I was afraid of failing the test. I never did any extracurriculars for fear of failing. I couldn't bring myself to recognize that sometimes you're going to fail.\n\nPart of this was that I was emotionally abused for five years, which obviously doesn't seem to be a factor here. But I'm almost 23 now and I'm a lot better than I was. Not perfect, but better. Therapy was a godsend, and I wished I'd gone sooner. I didn't because it would've made me feel worse since mental health and therapy has an absurd stigma that I fell into. But I started at 17 and it quite literally saved my life. I don't mean to scare you, but my issues made me depressed and suicidal. But let's *not* get ahead of ourselves. Your kid isn't nearly that bad yet and ironically, I'd ask you to relax. This may just be a passing thing, for all you know that he'll grow out of. Be concerned, but conservative in your approach.\n\nNow, as for your kid - I'm assuming the answer is yes, but have you sat down with him and had any one-on-one conversations with him about your worries? I know he's young, but if you haven't had a serious talk with him, he's probably smarter and more articulate in his feelings than you know, and any other insights would be helpful. When I was dealing with this, nothing was worse than realizing I couldn't talk to my parents about my issues (they were actively the emotional abusers contributing to my problems until I was 9, and actively dismissed my problems as being imaginary until I went to therapy and my therapist gave them a very scathing call). \n\nSo I can't emphasize how even at this young an age it's vital that you talk with your kid about everything in a serious, adult manner despite him being anything but an adult, because it'll give you insights, foster his emotional maturity, and because it will beget him growing up knowing he can come to you about anything and everything. That right there will give him some confidence, because he'll know you're there for when he's feeling down or bad about himself.\n\nHowever, I think the best thing that helped me with my confidence was coming to the realization that even though on the outside people have their shit together, nothing could be further from the truth. Everyone I meet is faking it 'til they're making it or coming off a recent failure or fuck up, even though they hide it. That helped me realize that it was okay if I messed up at any one thing, because I'm far from the first, only, or last person to do so. It made me realize I was setting unrealistically high of expectations of perfection of myself.\n\nNow let's apply that to your kid. You say he's afraid of failing. Demonstrate to him that it's okay, expected, and hell, even *good* to fail sometimes. That's how you learn, both to deal with failing and from your mistakes. I was so scared of failing that I rarely took risks, never failed, and to this day struggle with dealing with that. Don't just say that, give him some real life examples of when you, someone he loves, a sports hero of his, a celebrity that he likes, anyone he looks up to has failed. Even little things, like \"you know, I burned dinner the other day, but that's okay. We're human and make mistakes\" would do wonders. And he needs to keep in mind that the reason everyone seems so successful is that in our society, you hear about people's successes more than their failures. You never hear about in small talk when someone messes up. In public, they only tell you good things in their life.\n\nAbout his appearance, I'd take a similar approach. I don't know if your son is particularly nerdy, but I sure as hell was. Stephen Hawking was one of my idols in my teen years, and his condition and how it affected his appearance only made me look up to him more. Because that man said to his condition and its detrimental effect \"fuck you\" and he achieved his dreams anyways, as corny as it sounds. \n\nSame thing here. Nobody is perfect on the outside either, and those imperfections both inside and out are what make people so interesting to know. If somebody was perfect, that person would be the single most *boring* person in existence. You want to tell him all of that that, both with specific examples and in general. You want to find a way to get your son to embrace that birthmark. Has he ever seen Finding Nemo? Nemo in that movie turned his disfigured fin into a \"lucky\" fin. Maybe this can be his \"lucky mark.\" Hell, some people even find birthmarks cute (although at his age, that might only make things worse lol). Body-positivity helps a lot here. He doesn't have to be perfect. The most perfect people are those that know that they themselves aren't and accept that about themselves. That's how *all* imperfections *become* perfect. \n\nHopefully these aren't approaches or thoughts you've already tried sharing with your son, but it's useful in that case to know that you're doing all you can do.\n\n**EDIT** Grammar and words.", "edited": 1492018432.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there. So, full disclaimer: I am not a biological parent. I&amp;#39;ve raised a child like my own for the last five years since he was five, however. That said, if anything, &amp;quot;my&amp;quot; kid is anything but lacking confidence. If anything, sometimes I wish he could reign himself in, lol. So my advice may not be sound or sound like me spewing random suggestions at the wall and seeing what sticks.&lt;/p&gt;\n\n&lt;p&gt;That said, when I was your son&amp;#39;s age - a little older, perhaps, I started developing Social Anxiety. I hit my nadir when I was 15 or 16 or so; I couldn&amp;#39;t even check out at a register or talk on the phone with a stranger without having a full-blown panic attack for fear of &amp;quot;fucking it up&amp;quot;, and I too was very conscious about my appearance. I was afraid to do anything for fear of failing or looking like an idiot all throughout my childhood. I couldn&amp;#39;t get a job because I was afraid of fucking up the interview or following up on the phone. I couldn&amp;#39;t bring myself to get my license until I was almost 18 because I was afraid of failing the test. I never did any extracurriculars for fear of failing. I couldn&amp;#39;t bring myself to recognize that sometimes you&amp;#39;re going to fail.&lt;/p&gt;\n\n&lt;p&gt;Part of this was that I was emotionally abused for five years, which obviously doesn&amp;#39;t seem to be a factor here. But I&amp;#39;m almost 23 now and I&amp;#39;m a lot better than I was. Not perfect, but better. Therapy was a godsend, and I wished I&amp;#39;d gone sooner. I didn&amp;#39;t because it would&amp;#39;ve made me feel worse since mental health and therapy has an absurd stigma that I fell into. But I started at 17 and it quite literally saved my life. I don&amp;#39;t mean to scare you, but my issues made me depressed and suicidal. But let&amp;#39;s &lt;em&gt;not&lt;/em&gt; get ahead of ourselves. Your kid isn&amp;#39;t nearly that bad yet and ironically, I&amp;#39;d ask you to relax. This may just be a passing thing, for all you know that he&amp;#39;ll grow out of. Be concerned, but conservative in your approach.&lt;/p&gt;\n\n&lt;p&gt;Now, as for your kid - I&amp;#39;m assuming the answer is yes, but have you sat down with him and had any one-on-one conversations with him about your worries? I know he&amp;#39;s young, but if you haven&amp;#39;t had a serious talk with him, he&amp;#39;s probably smarter and more articulate in his feelings than you know, and any other insights would be helpful. When I was dealing with this, nothing was worse than realizing I couldn&amp;#39;t talk to my parents about my issues (they were actively the emotional abusers contributing to my problems until I was 9, and actively dismissed my problems as being imaginary until I went to therapy and my therapist gave them a very scathing call). &lt;/p&gt;\n\n&lt;p&gt;So I can&amp;#39;t emphasize how even at this young an age it&amp;#39;s vital that you talk with your kid about everything in a serious, adult manner despite him being anything but an adult, because it&amp;#39;ll give you insights, foster his emotional maturity, and because it will beget him growing up knowing he can come to you about anything and everything. That right there will give him some confidence, because he&amp;#39;ll know you&amp;#39;re there for when he&amp;#39;s feeling down or bad about himself.&lt;/p&gt;\n\n&lt;p&gt;However, I think the best thing that helped me with my confidence was coming to the realization that even though on the outside people have their shit together, nothing could be further from the truth. Everyone I meet is faking it &amp;#39;til they&amp;#39;re making it or coming off a recent failure or fuck up, even though they hide it. That helped me realize that it was okay if I messed up at any one thing, because I&amp;#39;m far from the first, only, or last person to do so. It made me realize I was setting unrealistically high of expectations of perfection of myself.&lt;/p&gt;\n\n&lt;p&gt;Now let&amp;#39;s apply that to your kid. You say he&amp;#39;s afraid of failing. Demonstrate to him that it&amp;#39;s okay, expected, and hell, even &lt;em&gt;good&lt;/em&gt; to fail sometimes. That&amp;#39;s how you learn, both to deal with failing and from your mistakes. I was so scared of failing that I rarely took risks, never failed, and to this day struggle with dealing with that. Don&amp;#39;t just say that, give him some real life examples of when you, someone he loves, a sports hero of his, a celebrity that he likes, anyone he looks up to has failed. Even little things, like &amp;quot;you know, I burned dinner the other day, but that&amp;#39;s okay. We&amp;#39;re human and make mistakes&amp;quot; would do wonders. And he needs to keep in mind that the reason everyone seems so successful is that in our society, you hear about people&amp;#39;s successes more than their failures. You never hear about in small talk when someone messes up. In public, they only tell you good things in their life.&lt;/p&gt;\n\n&lt;p&gt;About his appearance, I&amp;#39;d take a similar approach. I don&amp;#39;t know if your son is particularly nerdy, but I sure as hell was. Stephen Hawking was one of my idols in my teen years, and his condition and how it affected his appearance only made me look up to him more. Because that man said to his condition and its detrimental effect &amp;quot;fuck you&amp;quot; and he achieved his dreams anyways, as corny as it sounds. &lt;/p&gt;\n\n&lt;p&gt;Same thing here. Nobody is perfect on the outside either, and those imperfections both inside and out are what make people so interesting to know. If somebody was perfect, that person would be the single most &lt;em&gt;boring&lt;/em&gt; person in existence. You want to tell him all of that that, both with specific examples and in general. You want to find a way to get your son to embrace that birthmark. Has he ever seen Finding Nemo? Nemo in that movie turned his disfigured fin into a &amp;quot;lucky&amp;quot; fin. Maybe this can be his &amp;quot;lucky mark.&amp;quot; Hell, some people even find birthmarks cute (although at his age, that might only make things worse lol). Body-positivity helps a lot here. He doesn&amp;#39;t have to be perfect. The most perfect people are those that know that they themselves aren&amp;#39;t and accept that about themselves. That&amp;#39;s how &lt;em&gt;all&lt;/em&gt; imperfections &lt;em&gt;become&lt;/em&gt; perfect. &lt;/p&gt;\n\n&lt;p&gt;Hopefully these aren&amp;#39;t approaches or thoughts you&amp;#39;ve already tried sharing with your son, but it&amp;#39;s useful in that case to know that you&amp;#39;re doing all you can do.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT&lt;/strong&gt; Grammar and words.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg60c51", "score_hidden": false, "stickied": false, "created": 1492039264.0, "created_utc": 1492010464.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64x8n7", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_64x8n7", "likes": null, "replies": "", "user_reports": [], "id": "dg6hiwh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "eatdrinkandbemerry80", "parent_id": "t1_dg61ag5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I haven't heard of a group like that, but I will look into it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t heard of a group like that, but I will look into it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg6hiwh", "score_hidden": false, "stickied": false, "created": 1492057080.0, "created_utc": 1492028280.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg61ag5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Amazingamazone", "parent_id": "t3_64x8n7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Our school has a pretty good programme that covers anti-bullying, assertiveness and confidence training. It is in a group and very playful. Starts at kindergarten already. \nIt really helped my son and others a lot, especially at this young age. \nSo inform with school, municipality or pediatrician if such a programme is available for your kid. \nIf not, maybe a therapist can help out? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Our school has a pretty good programme that covers anti-bullying, assertiveness and confidence training. It is in a group and very playful. Starts at kindergarten already. \nIt really helped my son and others a lot, especially at this young age. \nSo inform with school, municipality or pediatrician if such a programme is available for your kid. \nIf not, maybe a therapist can help out? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg61ag5", "score_hidden": false, "stickied": false, "created": 1492040308.0, "created_utc": 1492011508.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]