[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My son is 2.5 years old and potty training has been OK. He quickly accepted going pee on the potty and got really good at it. He even holds it in the morning and when he has the pull ups on (we use them for bed and when we go on a car ride somewhere). Once in a while he might get a little in his underwear if he can&amp;#39;t get to the potty in time, but otherwise he&amp;#39;s a pro. &lt;/p&gt;\n\n&lt;p&gt;Poop is a whole different story. He always tells us he has to go, but once we&amp;#39;re in the bathroom he will sit down and either say no poo and get up, or just start screaming and crying. Under no circumstances will he poop in the potty. &lt;/p&gt;\n\n&lt;p&gt;We are trying to be as calm and non threatening as possible. We don&amp;#39;t get mad at him for it. But it&amp;#39;s been about 2 months with near perfect pee performance. But poop is a total no go. &lt;/p&gt;\n\n&lt;p&gt;Any advice on this is appreciated. My daughter, who is almost 6, took to potty training like a champ. No challenge at all with pee or poo. So we&amp;#39;re at a loss since she was so damn easy and he&amp;#39;s not. What can we do? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My son is 2.5 years old and potty training has been OK. He quickly accepted going pee on the potty and got really good at it. He even holds it in the morning and when he has the pull ups on (we use them for bed and when we go on a car ride somewhere). Once in a while he might get a little in his underwear if he can't get to the potty in time, but otherwise he's a pro. \n\nPoop is a whole different story. He always tells us he has to go, but once we're in the bathroom he will sit down and either say no poo and get up, or just start screaming and crying. Under no circumstances will he poop in the potty. \n\nWe are trying to be as calm and non threatening as possible. We don't get mad at him for it. But it's been about 2 months with near perfect pee performance. But poop is a total no go. \n\nAny advice on this is appreciated. My daughter, who is almost 6, took to potty training like a champ. No challenge at all with pee or poo. So we're at a loss since she was so damn easy and he's not. What can we do? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Potty-training", "id": "652xga", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "ytsejam024", "saved": false, "mod_reports": [], "name": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "potty-training", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/652xga/why_wont_he_poop_on_the_potty/", "num_reports": null, "locked": false, "stickied": false, "created": 1492080886.0, "url": "https://www.reddit.com/r/Parenting/comments/652xga/why_wont_he_poop_on_the_potty/", "author_flair_text": null, "quarantine": false, "title": "Why won't he poop on the potty?!", "created_utc": 1492052086.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 20, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg799ip", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "ytsejam024", "parent_id": "t1_dg75kzj", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You know, I did sticker charts with my daughter for potty training and other things along the way. Totally forgot about that. She loved being able to place a new one on the chart so she did stuff good all the time. I'm gonna have to try this tomorrow. Thanks for involuntarily reminding me about that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, I did sticker charts with my daughter for potty training and other things along the way. Totally forgot about that. She loved being able to place a new one on the chart so she did stuff good all the time. I&amp;#39;m gonna have to try this tomorrow. Thanks for involuntarily reminding me about that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg799ip", "score_hidden": false, "stickied": false, "created": 1492094862.0, "created_utc": 1492066062.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75kzj", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "What_makes_you_happy", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My son was like this. Good lord it was frustrating. And hard to be patient and calm. I would sing to him, stroke his hand, give him privacy, let him watch an Elmo app on my phone, praise and rewards for just sitting down. Anything. \n\nThen it got to the stage where I just gave up and I was like \"well where do you want to poo? Here? Toilet? Bath? Closet?\". Each was met with a \"no\". Then one day I asked again as routine \"where do you want to poo?\". No answer. I started daydreaming and kind of forgot what we were doing then he hesitantly pointed to the toilet. \"You want to poo there?\". Got a head nod. \"Well ok buddy, let's try sitting down!\"\n\nSo he sat down and got massive praise. No poo but that was fine. 10 minutes later he still had to go so I said \"let's try sitting on the toilet then\". As soon as he sat down with his feet up on a stool he couldn't hold it in. He got everything in the world. Praise, a sticker chart for each poo (to start with we did 3 poos for a big reward, but in hindsight I'd go for 2 to start with) and he got McDonalds that night for dinner. And every reward we kept emphasising it. \"Do you know why we are having this treat? Because you pood on the toilet, you big clever boy!\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My son was like this. Good lord it was frustrating. And hard to be patient and calm. I would sing to him, stroke his hand, give him privacy, let him watch an Elmo app on my phone, praise and rewards for just sitting down. Anything. &lt;/p&gt;\n\n&lt;p&gt;Then it got to the stage where I just gave up and I was like &amp;quot;well where do you want to poo? Here? Toilet? Bath? Closet?&amp;quot;. Each was met with a &amp;quot;no&amp;quot;. Then one day I asked again as routine &amp;quot;where do you want to poo?&amp;quot;. No answer. I started daydreaming and kind of forgot what we were doing then he hesitantly pointed to the toilet. &amp;quot;You want to poo there?&amp;quot;. Got a head nod. &amp;quot;Well ok buddy, let&amp;#39;s try sitting down!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So he sat down and got massive praise. No poo but that was fine. 10 minutes later he still had to go so I said &amp;quot;let&amp;#39;s try sitting on the toilet then&amp;quot;. As soon as he sat down with his feet up on a stool he couldn&amp;#39;t hold it in. He got everything in the world. Praise, a sticker chart for each poo (to start with we did 3 poos for a big reward, but in hindsight I&amp;#39;d go for 2 to start with) and he got McDonalds that night for dinner. And every reward we kept emphasising it. &amp;quot;Do you know why we are having this treat? Because you pood on the toilet, you big clever boy!&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg75kzj", "score_hidden": false, "stickied": false, "created": 1492087219.0, "created_utc": 1492058419.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg79cvn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ytsejam024", "parent_id": "t1_dg74sk7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "He doesn't seem to care about any of that. The other day he had a little bit of poo in the potty from a fart that was a little more than he bargained for. He just got mad when we tried to say anything about it. It almost seems like he's afraid. My daughter got that way shortly after my son was born. She was 3 and kinda regressed a little, probably from a lack of attention due to a new baby. She would hold her poo for days and when she was finally ready to go, it was massive and painful. That put her out for a little while before she kinda self regulated again. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He doesn&amp;#39;t seem to care about any of that. The other day he had a little bit of poo in the potty from a fart that was a little more than he bargained for. He just got mad when we tried to say anything about it. It almost seems like he&amp;#39;s afraid. My daughter got that way shortly after my son was born. She was 3 and kinda regressed a little, probably from a lack of attention due to a new baby. She would hold her poo for days and when she was finally ready to go, it was massive and painful. That put her out for a little while before she kinda self regulated again. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg79cvn", "score_hidden": false, "stickied": false, "created": 1492095098.0, "created_utc": 1492066298.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg74sk7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "LDawg618", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Offer rewards/prizes/praise!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Offer rewards/prizes/praise!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg74sk7", "score_hidden": false, "stickied": false, "created": 1492085940.0, "created_utc": 1492057140.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg77fzp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SkatingOnThinIce", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "One of ours was trained before 2.  The other took till he was 4.  He refused and refused and refused. We tried everything, Then one day he asked his mom what she wanted for her birthday. She said: for you to poop in the potty.  He did it.  He started in a dirty, crappy, uncomfortable restaurant bathroom and that was it. No more diapers.  \n\nI didn't believe​ it when everybody told me that he'll just do it when he's ready but ...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of ours was trained before 2.  The other took till he was 4.  He refused and refused and refused. We tried everything, Then one day he asked his mom what she wanted for her birthday. She said: for you to poop in the potty.  He did it.  He started in a dirty, crappy, uncomfortable restaurant bathroom and that was it. No more diapers.  &lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t believe​ it when everybody told me that he&amp;#39;ll just do it when he&amp;#39;s ready but ...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg77fzp", "score_hidden": false, "stickied": false, "created": 1492090607.0, "created_utc": 1492061807.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg785ol", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "wepwepwepwe", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think a lot of it is just a matter of habit, and it works for grownups as well as babies - people form unconscious associations between particular places or situations and pooping.  My mother is like this with grocery stores, for some reason - she always has to go to the bathroom as soon as she enters a grocery store.\n\nI think it just takes patience and retraining of the subconscious mind to teach the kid a different \"poop association\".  Right now, he associates pooping with standing up wearing a diaper (or wearing pants), because that's what he did for the first 2 years of his life.  The more he is encouraged to sit on the potty and try, the more likely it will be for a new association to form.\n\nMy kid, for some reason, formed an association between her high chair and pooping, early on in our potty training.  The only place she'd poop was in her high chair.  Drove us crazy.  Then she got diarrhea and happened to let go while on the potty.  Cue lots of praise and hugs and kisses, and the next time she pooped on the potty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of it is just a matter of habit, and it works for grownups as well as babies - people form unconscious associations between particular places or situations and pooping.  My mother is like this with grocery stores, for some reason - she always has to go to the bathroom as soon as she enters a grocery store.&lt;/p&gt;\n\n&lt;p&gt;I think it just takes patience and retraining of the subconscious mind to teach the kid a different &amp;quot;poop association&amp;quot;.  Right now, he associates pooping with standing up wearing a diaper (or wearing pants), because that&amp;#39;s what he did for the first 2 years of his life.  The more he is encouraged to sit on the potty and try, the more likely it will be for a new association to form.&lt;/p&gt;\n\n&lt;p&gt;My kid, for some reason, formed an association between her high chair and pooping, early on in our potty training.  The only place she&amp;#39;d poop was in her high chair.  Drove us crazy.  Then she got diarrhea and happened to let go while on the potty.  Cue lots of praise and hugs and kisses, and the next time she pooped on the potty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg785ol", "score_hidden": false, "stickied": false, "created": 1492092176.0, "created_utc": 1492063376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg75j1y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Switchbak", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Could be a possession thing from what I have been reading. At the same stage with my daughter ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could be a possession thing from what I have been reading. At the same stage with my daughter &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg75j1y", "score_hidden": false, "stickied": false, "created": 1492087131.0, "created_utc": 1492058331.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg7qsty", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pickleodeon09", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "ugh, my kid is the same way. We started potty training in September, over Labor Day weekend, and with pee she's fine and has been for months. She only wears diapers overnight. I don't expect her to be able to stay dry all night. But she will only poop in her diapers overnight. I know she CAN poop on the potty. It started with her being afraid to. She did it once, then once in a week, then we got to the point where she did it 2 or 3 times in a week, then back to nothing, since Christmas. We went to freaking Build-A-Bear when she pooped 3 times on the potty, and she'd poop on the potty once in a while, and then she gradually stopped going on the potty again. We made a huge deal when she went, gave her rewards. \n\nIt's so frustrating. We give her a low dose of Miralax, cause she'll hold it for 2-3 days and be absolutely miserable and uncomfortable, and she will still hold it until she has a diaper on in bed. Everyone keeps telling me she'll do it when she's ready. Ugh. Sorry I don't have any better suggestions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ugh, my kid is the same way. We started potty training in September, over Labor Day weekend, and with pee she&amp;#39;s fine and has been for months. She only wears diapers overnight. I don&amp;#39;t expect her to be able to stay dry all night. But she will only poop in her diapers overnight. I know she CAN poop on the potty. It started with her being afraid to. She did it once, then once in a week, then we got to the point where she did it 2 or 3 times in a week, then back to nothing, since Christmas. We went to freaking Build-A-Bear when she pooped 3 times on the potty, and she&amp;#39;d poop on the potty once in a while, and then she gradually stopped going on the potty again. We made a huge deal when she went, gave her rewards. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s so frustrating. We give her a low dose of Miralax, cause she&amp;#39;ll hold it for 2-3 days and be absolutely miserable and uncomfortable, and she will still hold it until she has a diaper on in bed. Everyone keeps telling me she&amp;#39;ll do it when she&amp;#39;s ready. Ugh. Sorry I don&amp;#39;t have any better suggestions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7qsty", "score_hidden": false, "stickied": false, "created": 1492127585.0, "created_utc": 1492098785.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg79n12", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bookwitchx", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "the idea of something falling out of your asshole seems kinda daunting at that age. Even now, amirite. but it's just a thing, he won't poop in his pants forever I swear. My daughter was the same, I had her poop outside in summer, for some reason the toilet like, sucking her soul out via her butthole was a thing..So that helped. Maybe that or a lot of m&amp;ms. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;the idea of something falling out of your asshole seems kinda daunting at that age. Even now, amirite. but it&amp;#39;s just a thing, he won&amp;#39;t poop in his pants forever I swear. My daughter was the same, I had her poop outside in summer, for some reason the toilet like, sucking her soul out via her butthole was a thing..So that helped. Maybe that or a lot of m&amp;amp;ms. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg79n12", "score_hidden": false, "stickied": false, "created": 1492095864.0, "created_utc": 1492067064.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg7xdoh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlueBomber13", "parent_id": "t1_dg7rc95", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Haha, exactly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha, exactly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7xdoh", "score_hidden": false, "stickied": false, "created": 1492134586.0, "created_utc": 1492105786.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7rc95", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "xinit", "parent_id": "t1_dg7jb83", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Which is why we took the pullups out of the mix. \n\nOurs was just over three and he had one poop accident, where his eyes got big and wide and he yelled \"IT'S COMING OUT!\" \n\nHe did not like that messy experience, apparently, and suddenly decided it was time to use the toilet from then on. He'd announce \"my tummy hurts\" or \"I have to poop!\" and off he'd go. \n\nLess scary than pooping in your Rubble Paw Patrol pants. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Which is why we took the pullups out of the mix. &lt;/p&gt;\n\n&lt;p&gt;Ours was just over three and he had one poop accident, where his eyes got big and wide and he yelled &amp;quot;IT&amp;#39;S COMING OUT!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;He did not like that messy experience, apparently, and suddenly decided it was time to use the toilet from then on. He&amp;#39;d announce &amp;quot;my tummy hurts&amp;quot; or &amp;quot;I have to poop!&amp;quot; and off he&amp;#39;d go. &lt;/p&gt;\n\n&lt;p&gt;Less scary than pooping in your Rubble Paw Patrol pants. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7rc95", "score_hidden": false, "stickied": false, "created": 1492128159.0, "created_utc": 1492099359.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7jb83", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlueBomber13", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Pooping is effing scary when you're not doing it in the comfort and safety of a diaper, which is all they've ever known.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pooping is effing scary when you&amp;#39;re not doing it in the comfort and safety of a diaper, which is all they&amp;#39;ve ever known.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7jb83", "score_hidden": false, "stickied": false, "created": 1492118861.0, "created_utc": 1492090061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg7niz4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sarcazm", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My oldest son was the same way. I think it took almost 3-4 months after he finally got peeing down that he finally went poop in the potty. I think part of it is the unknown factor: \"What happens when I poop in the potty?\" To you and me, we know the answer: the same as pee. In the back of their little mind, they don't want to do it because *something* might happen if they poop in the potty. Where does it go? What does it do? Will I get backsplash or a monster come up and eat me? Who knows what they're thinking. All they know is that they've never done this before and have no idea what happens when it happens.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My oldest son was the same way. I think it took almost 3-4 months after he finally got peeing down that he finally went poop in the potty. I think part of it is the unknown factor: &amp;quot;What happens when I poop in the potty?&amp;quot; To you and me, we know the answer: the same as pee. In the back of their little mind, they don&amp;#39;t want to do it because &lt;em&gt;something&lt;/em&gt; might happen if they poop in the potty. Where does it go? What does it do? Will I get backsplash or a monster come up and eat me? Who knows what they&amp;#39;re thinking. All they know is that they&amp;#39;ve never done this before and have no idea what happens when it happens.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7niz4", "score_hidden": false, "stickied": false, "created": 1492124049.0, "created_utc": 1492095249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg84jsk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "americanairman469", "parent_id": "t1_dg7tu9n", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That last line, flushing a piece of himself....I think that's why a lot of kids have trouble with #2. Up until this point, it stayed with them until you changed their diaper. Because it's solids leaving their body, sometimes they have a fear that a part of their body is falling into the water. They'll do it eventually, it might not be the same as other kids or when you want them to, but they all eventually get it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That last line, flushing a piece of himself....I think that&amp;#39;s why a lot of kids have trouble with #2. Up until this point, it stayed with them until you changed their diaper. Because it&amp;#39;s solids leaving their body, sometimes they have a fear that a part of their body is falling into the water. They&amp;#39;ll do it eventually, it might not be the same as other kids or when you want them to, but they all eventually get it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg84jsk", "score_hidden": false, "stickied": false, "created": 1492142295.0, "created_utc": 1492113495.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7tu9n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ytsejam024", "parent_id": "t1_dg7t3u3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm thinking he's gonna get it soon. He wants to, but once it's time he gets cold feet. He always comes to get one of us and gets on the potty. He didn't do that even a month ago, so it's progress. I just feel so bad for him cuz he gets so upset. It's like he's afraid he's gonna flush a piece of himself or something lol. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m thinking he&amp;#39;s gonna get it soon. He wants to, but once it&amp;#39;s time he gets cold feet. He always comes to get one of us and gets on the potty. He didn&amp;#39;t do that even a month ago, so it&amp;#39;s progress. I just feel so bad for him cuz he gets so upset. It&amp;#39;s like he&amp;#39;s afraid he&amp;#39;s gonna flush a piece of himself or something lol. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7tu9n", "score_hidden": false, "stickied": false, "created": 1492130830.0, "created_utc": 1492102030.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7t3u3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "americanairman469", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Just went through this last year with my daughter. We started a month before her 3rd birthday and she took peeing like a champ, less than a week, but it took MONTHS for her to poop in the potty. We tried it all. Sticker charts, offered prizes, positive reinforcement,  different pottys and seats, nothing worked. It was like a switch flipped around 4 months into being potty trained that she finally pooped and started doing it on a regular basis. Sometimes they just do it when they're ready and there's nothing we can do.\n\nLike you, my older son was a breeze to potty train, so we compared our experience and probably shouldn't have. Be patient, they'll get it. I just kept telling myself that there aren't a lot of kids in diapers at 5-6, so as long as she gets it by then, I'm good. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just went through this last year with my daughter. We started a month before her 3rd birthday and she took peeing like a champ, less than a week, but it took MONTHS for her to poop in the potty. We tried it all. Sticker charts, offered prizes, positive reinforcement,  different pottys and seats, nothing worked. It was like a switch flipped around 4 months into being potty trained that she finally pooped and started doing it on a regular basis. Sometimes they just do it when they&amp;#39;re ready and there&amp;#39;s nothing we can do.&lt;/p&gt;\n\n&lt;p&gt;Like you, my older son was a breeze to potty train, so we compared our experience and probably shouldn&amp;#39;t have. Be patient, they&amp;#39;ll get it. I just kept telling myself that there aren&amp;#39;t a lot of kids in diapers at 5-6, so as long as she gets it by then, I&amp;#39;m good. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7t3u3", "score_hidden": false, "stickied": false, "created": 1492130036.0, "created_utc": 1492101236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg81s4z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CrossWired", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My son figured it out at 26 months, my daughter was nearly 34 months, my youngest girl is seeing big sister go and is interested at 20 months. they all have their own time.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My son figured it out at 26 months, my daughter was nearly 34 months, my youngest girl is seeing big sister go and is interested at 20 months. they all have their own time.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg81s4z", "score_hidden": false, "stickied": false, "created": 1492139297.0, "created_utc": 1492110497.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dga9l5e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ytsejam024", "parent_id": "t1_dga3gi7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I know how you feel. Tonight we were putting the kids to bed and right as we laid him down he asked to pee. So we took him and he went. Then about 5 minutes after we left the room he was yelling about poo. And sure enough, poop in the pull up. And he thinks of the pull up as undies rather than a diaper so it's really frustrating. It'll happen eventually. Everyone gets it at some point or another, right? Lol", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know how you feel. Tonight we were putting the kids to bed and right as we laid him down he asked to pee. So we took him and he went. Then about 5 minutes after we left the room he was yelling about poo. And sure enough, poop in the pull up. And he thinks of the pull up as undies rather than a diaper so it&amp;#39;s really frustrating. It&amp;#39;ll happen eventually. Everyone gets it at some point or another, right? Lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dga9l5e", "score_hidden": false, "stickied": false, "created": 1492258355.0, "created_utc": 1492229555.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga3gi7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Razorhoof78", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Having the exact same problem with my daughter, only a little worse - She'll be 4 this summer and she's peed without any problems for a little over 6 months. Poop is just a no go - she'll go hide in the closet or find a corner in an unoccupied room. We've tried everything under the sun but she pitches a nuclear fit whenever using the potty comes up. The new thing is offering her a bike (her school hosted a bike ride and she loved riding). Still nothing. We're buying panties in bulk and waiting for the switch everyone keeps talking about to flip...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having the exact same problem with my daughter, only a little worse - She&amp;#39;ll be 4 this summer and she&amp;#39;s peed without any problems for a little over 6 months. Poop is just a no go - she&amp;#39;ll go hide in the closet or find a corner in an unoccupied room. We&amp;#39;ve tried everything under the sun but she pitches a nuclear fit whenever using the potty comes up. The new thing is offering her a bike (her school hosted a bike ride and she loved riding). Still nothing. We&amp;#39;re buying panties in bulk and waiting for the switch everyone keeps talking about to flip...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dga3gi7", "score_hidden": false, "stickied": false, "created": 1492249148.0, "created_utc": 1492220348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_652xga", "likes": null, "replies": "", "user_reports": [], "id": "dg7ge9z", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "livinghorcrux", "parent_id": "t3_652xga", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My almost 4 year old still gets a pull up to do a poo. He says it's because it feels more comfortable. He is very sensitive so I'm not putting any pressure on him. But I though you'd appreciate their perspective!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My almost 4 year old still gets a pull up to do a poo. He says it&amp;#39;s because it feels more comfortable. He is very sensitive so I&amp;#39;m not putting any pressure on him. But I though you&amp;#39;d appreciate their perspective!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg7ge9z", "score_hidden": false, "stickied": false, "created": 1492114278.0, "created_utc": 1492085478.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}]