[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or at least in a way that I&amp;#39;m confused with. &lt;/p&gt;\n\n&lt;p&gt;Naturally we all go through a period in our lives where we start to realize what feels good, and we start to go for it more often. For me that was in middle school, which is what I thought was pretty normal.&lt;/p&gt;\n\n&lt;p&gt;My son is 7. He&amp;#39;s a great kid, but he&amp;#39;s developed this obsession with playing with his butt in the shower. My wife and I discovered it when we found feces in the shower, and feces on his body and fingers after he&amp;#39;d step out of the bathroom. He has had a hard time getting used to wiping himself after pooping, so at first we attributed this to runoff, so to speak. It wasn&amp;#39;t until yesterday that he told us he does it because it feels good. Apparently he is sticking fingers in his anus and when there is feces up there, he &amp;quot;accidentally&amp;quot; pulls it out. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m at an absolute loss. I&amp;#39;m not a religious nut, I&amp;#39;m not some ultra-conservative douche that forbids masturbation and saved sex for marriage. That being said, I kind of think that violating your own butt is something that a seven year old just shouldn&amp;#39;t be doing while he&amp;#39;s in the shower. I&amp;#39;m trying to get him to talk to me about it, and explain to him that it isn&amp;#39;t sanitary and that he can get sick. As close-minded as it sounds, I want him to &lt;em&gt;fucking stop&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;My wife is taking a different tack - she is telling him basically the same advice you&amp;#39;d give to a young man or woman before their first time performing anal: be clean, wash before and after, etc... It&amp;#39;s causing a bit of an argument between us because I can&amp;#39;t get behind the notion that anal play in the shower is acceptable for seven year old.&lt;/p&gt;\n\n&lt;p&gt;Has anyone here ever dealt with something like this before? I need an outside opinion. I feel equipped to deal with pretty much any situation in life, except this one. At least at this age. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Or at least in a way that I'm confused with. \n\nNaturally we all go through a period in our lives where we start to realize what feels good, and we start to go for it more often. For me that was in middle school, which is what I thought was pretty normal.\n\nMy son is 7. He's a great kid, but he's developed this obsession with playing with his butt in the shower. My wife and I discovered it when we found feces in the shower, and feces on his body and fingers after he'd step out of the bathroom. He has had a hard time getting used to wiping himself after pooping, so at first we attributed this to runoff, so to speak. It wasn't until yesterday that he told us he does it because it feels good. Apparently he is sticking fingers in his anus and when there is feces up there, he \"accidentally\" pulls it out. \n\nI'm at an absolute loss. I'm not a religious nut, I'm not some ultra-conservative douche that forbids masturbation and saved sex for marriage. That being said, I kind of think that violating your own butt is something that a seven year old just shouldn't be doing while he's in the shower. I'm trying to get him to talk to me about it, and explain to him that it isn't sanitary and that he can get sick. As close-minded as it sounds, I want him to *fucking stop*.\n\nMy wife is taking a different tack - she is telling him basically the same advice you'd give to a young man or woman before their first time performing anal: be clean, wash before and after, etc... It's causing a bit of an argument between us because I can't get behind the notion that anal play in the shower is acceptable for seven year old.\n\nHas anyone here ever dealt with something like this before? I need an outside opinion. I feel equipped to deal with pretty much any situation in life, except this one. At least at this age. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Health&amp;Development", "id": "659ghp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 20, "report_reasons": null, "author": "dadthrowingitaway", "saved": false, "mod_reports": [], "name": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "health", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/659ghp/my_7_year_old_is_starting_to_explore_himself_but/", "num_reports": null, "locked": false, "stickied": false, "created": 1492158911.0, "url": "https://www.reddit.com/r/Parenting/comments/659ghp/my_7_year_old_is_starting_to_explore_himself_but/", "author_flair_text": null, "quarantine": false, "title": "My 7 year old is starting to explore himself, but in an unhealthy way", "created_utc": 1492130111.0, "distinguished": null, "media": null, "upvote_ratio": 0.76, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dg8qvwm", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "Iamyourmummy", "parent_id": "t1_dg8oplu", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This. I would get him into the pediatrician just to make sure he is physically ok. \n\nIf no medical issues follow your wife's lead.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. I would get him into the pediatrician just to make sure he is physically ok. &lt;/p&gt;\n\n&lt;p&gt;If no medical issues follow your wife&amp;#39;s lead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg8qvwm", "score_hidden": false, "stickied": false, "created": 1492172209.0, "created_utc": 1492143409.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8oplu", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "twocatstoo", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Is it possible he is constipated and it literally feels 'good' to disimpact himself?  If his rectum (where he could touch feces with fingers) is overfull of feces it is possible there is a medical issue at play here too.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is it possible he is constipated and it literally feels &amp;#39;good&amp;#39; to disimpact himself?  If his rectum (where he could touch feces with fingers) is overfull of feces it is possible there is a medical issue at play here too.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg8oplu", "score_hidden": false, "stickied": false, "created": 1492168728.0, "created_utc": 1492139928.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dg8j5x3", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Moeder_Coyote", "parent_id": "t1_dg8idad", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Exactly this. It's masturbation, pure and simple. Nothing wrong with it. The male prostate feels good stimulated. He found that out.\n\n-\n\nHe just needs to clean up after himself, thoroughly wash his hands, and be safe about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly this. It&amp;#39;s masturbation, pure and simple. Nothing wrong with it. The male prostate feels good stimulated. He found that out.&lt;/p&gt;\n\n&lt;h2&gt;&lt;/h2&gt;\n\n&lt;p&gt;He just needs to clean up after himself, thoroughly wash his hands, and be safe about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg8j5x3", "score_hidden": false, "stickied": false, "created": 1492160834.0, "created_utc": 1492132034.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8idad", "gilded": 0, "archived": false, "score": 48, "report_reasons": null, "author": "gigglesmcbug", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I agree  with your wife.  Long as he wasn't taught this by an adult, the best approach is to simply educate him on the importance of not sticking things up his butt and hand washing. \n\n\nRealistically, what are you going to do? Shame him into stopping? Observe his showers for the rest of forever? \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree  with your wife.  Long as he wasn&amp;#39;t taught this by an adult, the best approach is to simply educate him on the importance of not sticking things up his butt and hand washing. &lt;/p&gt;\n\n&lt;p&gt;Realistically, what are you going to do? Shame him into stopping? Observe his showers for the rest of forever? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg8idad", "score_hidden": false, "stickied": false, "created": 1492159750.0, "created_utc": 1492130950.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 48}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dg8iucl", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "dss8503", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My son once at school wiped poop on the wall of the bathroom when he was 5, and not a little but a lot. And that was the only time that had ever happened. We got on to him, advised about cleanliness and stuff but luckily it was only the one time. I wouldn't really know what to do about this. After speaking with my parents and in-laws my father-in-law who works with abused children did ask me if we were certain nothing was happening to him outside of the home, because a lot of kids he had dealt with in the court systems that had been abused responded at times by playing in their own feces. It's such a scary thought, so we made sure nothing was going on in anyway, and found out luckily it was just something he did, and it was over. THANK GOD. \n\nNot trying to scare you, or anything at all and I'm sure it's just a phase but definitely worth carefully making sure the kids and adults your son comes in contact on a daily basis are treating him appropriately. I hate that's the world we live in, but just some advice. Hope everything works out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My son once at school wiped poop on the wall of the bathroom when he was 5, and not a little but a lot. And that was the only time that had ever happened. We got on to him, advised about cleanliness and stuff but luckily it was only the one time. I wouldn&amp;#39;t really know what to do about this. After speaking with my parents and in-laws my father-in-law who works with abused children did ask me if we were certain nothing was happening to him outside of the home, because a lot of kids he had dealt with in the court systems that had been abused responded at times by playing in their own feces. It&amp;#39;s such a scary thought, so we made sure nothing was going on in anyway, and found out luckily it was just something he did, and it was over. THANK GOD. &lt;/p&gt;\n\n&lt;p&gt;Not trying to scare you, or anything at all and I&amp;#39;m sure it&amp;#39;s just a phase but definitely worth carefully making sure the kids and adults your son comes in contact on a daily basis are treating him appropriately. I hate that&amp;#39;s the world we live in, but just some advice. Hope everything works out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg8iucl", "score_hidden": false, "stickied": false, "created": 1492160393.0, "created_utc": 1492131593.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dg8r13n", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Eh, I wouldn't be *too* concerned unless there's more evidence of foul play. Masturbation is quite normal, even in pre-pubescent children. I mean, I was an exploratory kid and I started masturbating properly right around his age, and I got curious and started fingering myself a few months later. The anus is quite sensitive and it can feel very good when stimulated properly, to put it mildly. I'm only pointing this out in case you have some lingering, subconscious \"eww how does that feel good\" factor in your brain, because I swear to god, It's like this taboo place pretty much every straight guy I know is afraid to touch because they think it makes them gay.\n\nBut I digress.  \n\nIt's his body, it's his to explore at will. What exactly is so much more troubling about a kid exploring their anus versus playing with their genitals, which is seen as more \"typical\"? So long as he's not showing any other signs of sexual abuse and as long as you're reasonably certain it's not because of some medical problem causing him to be constipated or something, I fully agree with your wife. Just teach him about being sanitary and safe, i.e don't use household objects. One mention on how something, particularly small objects, can get sucked up there and result in a rather humiliating visit to the doctor's should hammer *that* in pretty loud and clear. \n\nPlease don't shame him into stopping unless he wants to stop. Even at his young age, that can create lots of problems with views towards being shamed about sex down the road or prevent him from exploring his body in a healthy, guilt free way when he's older.\n\nAnd if you want to be really careful, you can always reinforce that while it's okay if he touches himself there or anywhere private, it's absolutely a no-go if another adult does and that if anyone forcibly touches him like that, he should tell you or his mom immediately. And you might want to start talking with him about the concepts of consent if you haven't yet so that he knows not to do the same with another kid.\n\n", "edited": 1492145245.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh, I wouldn&amp;#39;t be &lt;em&gt;too&lt;/em&gt; concerned unless there&amp;#39;s more evidence of foul play. Masturbation is quite normal, even in pre-pubescent children. I mean, I was an exploratory kid and I started masturbating properly right around his age, and I got curious and started fingering myself a few months later. The anus is quite sensitive and it can feel very good when stimulated properly, to put it mildly. I&amp;#39;m only pointing this out in case you have some lingering, subconscious &amp;quot;eww how does that feel good&amp;quot; factor in your brain, because I swear to god, It&amp;#39;s like this taboo place pretty much every straight guy I know is afraid to touch because they think it makes them gay.&lt;/p&gt;\n\n&lt;p&gt;But I digress.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s his body, it&amp;#39;s his to explore at will. What exactly is so much more troubling about a kid exploring their anus versus playing with their genitals, which is seen as more &amp;quot;typical&amp;quot;? So long as he&amp;#39;s not showing any other signs of sexual abuse and as long as you&amp;#39;re reasonably certain it&amp;#39;s not because of some medical problem causing him to be constipated or something, I fully agree with your wife. Just teach him about being sanitary and safe, i.e don&amp;#39;t use household objects. One mention on how something, particularly small objects, can get sucked up there and result in a rather humiliating visit to the doctor&amp;#39;s should hammer &lt;em&gt;that&lt;/em&gt; in pretty loud and clear. &lt;/p&gt;\n\n&lt;p&gt;Please don&amp;#39;t shame him into stopping unless he wants to stop. Even at his young age, that can create lots of problems with views towards being shamed about sex down the road or prevent him from exploring his body in a healthy, guilt free way when he&amp;#39;s older.&lt;/p&gt;\n\n&lt;p&gt;And if you want to be really careful, you can always reinforce that while it&amp;#39;s okay if he touches himself there or anywhere private, it&amp;#39;s absolutely a no-go if another adult does and that if anyone forcibly touches him like that, he should tell you or his mom immediately. And you might want to start talking with him about the concepts of consent if you haven&amp;#39;t yet so that he knows not to do the same with another kid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg8r13n", "score_hidden": false, "stickied": false, "created": 1492172451.0, "created_utc": 1492143651.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dg90qp2", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "JayDeeCW", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "When I was 5, I regularly put my finger up my ass. It felt good. Not even in a masturbating way, more like in a petting a cat or touching silk kind of way. Just, \"yeah, that's nice.\" I also started masturbating around age 8. I'm decades older now, and I have what would probably be called a normal sex life, and I don't stick my finger up my ass anymore. Don't worry about it, that's my advice, even though it's hard not to worry when your kids are doing some weird shit.\n\nAfaik, you can't get sick from your own poop. I know because my toddling daughter once came out of the bathroom and asked, \"What happens if you eat your own poop?\", so I looked it up. You can get sick from other people's though, so it's important to teach him to wash his hands (same as after using the toilet). If you find poop in the shower or on the walls or something, get him to be the one cleaning it up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was 5, I regularly put my finger up my ass. It felt good. Not even in a masturbating way, more like in a petting a cat or touching silk kind of way. Just, &amp;quot;yeah, that&amp;#39;s nice.&amp;quot; I also started masturbating around age 8. I&amp;#39;m decades older now, and I have what would probably be called a normal sex life, and I don&amp;#39;t stick my finger up my ass anymore. Don&amp;#39;t worry about it, that&amp;#39;s my advice, even though it&amp;#39;s hard not to worry when your kids are doing some weird shit.&lt;/p&gt;\n\n&lt;p&gt;Afaik, you can&amp;#39;t get sick from your own poop. I know because my toddling daughter once came out of the bathroom and asked, &amp;quot;What happens if you eat your own poop?&amp;quot;, so I looked it up. You can get sick from other people&amp;#39;s though, so it&amp;#39;s important to teach him to wash his hands (same as after using the toilet). If you find poop in the shower or on the walls or something, get him to be the one cleaning it up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg90qp2", "score_hidden": false, "stickied": false, "created": 1492197763.0, "created_utc": 1492168963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dg8iwct", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "tiffanywebb87", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Unhealthy because of the risk of contamination or unhealthy in your view of what is morally correct?  \n\nMy brother used to stick the shower hose (sans shower head) up his butt, fill up with water, then BLAST it out... Growing up we thought this was hilarious.  He grew up to be perfectly healthy (and into BDSM lol).  To each his own, as long as they are happy!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unhealthy because of the risk of contamination or unhealthy in your view of what is morally correct?  &lt;/p&gt;\n\n&lt;p&gt;My brother used to stick the shower hose (sans shower head) up his butt, fill up with water, then BLAST it out... Growing up we thought this was hilarious.  He grew up to be perfectly healthy (and into BDSM lol).  To each his own, as long as they are happy!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg8iwct", "score_hidden": false, "stickied": false, "created": 1492160468.0, "created_utc": 1492131668.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dg9lj8w", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wepwepwepwe", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If the pediatrician finds nothing wrong, I'd just go to the standard masturbation advice - \"do it in private and wash your hands afterwards\".  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the pediatrician finds nothing wrong, I&amp;#39;d just go to the standard masturbation advice - &amp;quot;do it in private and wash your hands afterwards&amp;quot;.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9lj8w", "score_hidden": false, "stickied": false, "created": 1492226008.0, "created_utc": 1492197208.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dgbiml0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "angry_pecan", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It's his body, it feels good, and if he's not hurting himself (no medical issues I assume?), let him be.  Make him be clean about it, and I'm sure he'll grow out of it.  \n\nThat said, I'd probably feel the exact same way you do, but I try to remember I do things other people find weird. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s his body, it feels good, and if he&amp;#39;s not hurting himself (no medical issues I assume?), let him be.  Make him be clean about it, and I&amp;#39;m sure he&amp;#39;ll grow out of it.  &lt;/p&gt;\n\n&lt;p&gt;That said, I&amp;#39;d probably feel the exact same way you do, but I try to remember I do things other people find weird. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbiml0", "score_hidden": false, "stickied": false, "created": 1492336684.0, "created_utc": 1492307884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_659ghp", "likes": null, "replies": "", "user_reports": [], "id": "dgal0rh", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "xiangusk", "parent_id": "t3_659ghp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't think it's anal play. My apologies, but I think your wife is needlessly sexualising it. Just tell him to stop. Poop is yucky. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think it&amp;#39;s anal play. My apologies, but I think your wife is needlessly sexualising it. Just tell him to stop. Poop is yucky. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgal0rh", "score_hidden": false, "stickied": false, "created": 1492287357.0, "created_utc": 1492258557.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]