[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Mainly I just want to complain about this situation, but I&amp;#39;m also desperately hoping somebody else has been through something similar and has advice for what to do, because I&amp;#39;m completely lost. Probably going to be a long post.&lt;/p&gt;\n\n&lt;p&gt;So, my daughter is 16. For most of her life, she was fine. She was shyer than most people (e.g. wouldn&amp;#39;t play in a park with other kids she didn&amp;#39;t know well, even as a toddler; hated talking to strangers and would sometimes just not respond if somebody talked to her because she was so shy), but still played outside on our street, had friends at school, volunteered in school plays, etc. She was perfectly happy playing on her own, and I would&amp;#39;ve described her as generally quiet and shy. She has a 3-years-younger sister, who is the opposite, generally loud and outgoing. &lt;/p&gt;\n\n&lt;p&gt;Even with her shyness, there was no hint of any depression, she was almost always very cheerful, had positive thoughts, and would bring herself out of a low mood, and her shyness didn&amp;#39;t seem to hold her back from anything.&lt;/p&gt;\n\n&lt;p&gt;Starting at around 13, she grew to be more and more shy, and became very anxious about what other people were thinking of her. She stopped playing outside with other kids in the neighborhood. She stopped going into shops on her own. If you shopped with her, she would not select a garment from the rack by herself; she said she was anxious she would drop it and be laughed at, or something like that.&lt;/p&gt;\n\n&lt;p&gt;She gradually had less and less friends at school. She worried that the friends she did have actually didn&amp;#39;t like her, and were only pretending.&lt;/p&gt;\n\n&lt;p&gt;At age 14 she started having panic attacks. Sometimes it would be about something (watching a scary movie), and other times brought on seemingly by nothing, like just sitting in class. They started out a few months apart, but became more frequent, probably weekly. But still she was (at least outwardly) happy. She had plenty of interests (mostly solitary). She enjoyed reading, writing, playing videogames, baking, fashion design, playing her guitar, and keeping a hamster. She also generally got along well with her younger sister, they played together a lot.&lt;/p&gt;\n\n&lt;p&gt;When she started doing her GCSE exams, things got worse. For non-English people, GCSEs are subjects you choose and then take exams in, you then leave high school at 16 with your qualifications from those GCSEs. GCSE grades are important to the schools (they&amp;#39;re ranked nationally against all schools), and the schools really drum it into you the importance of them, tell you to be thinking about a career, what you want to do for the rest of your life, etc. She felt really anxious about the future, and she had no idea what she wanted to do. She said everyone around her at school was doing well and knew what they wanted to do. &lt;/p&gt;\n\n&lt;p&gt;She still enjoyed school, and was always enthusiastic about her subjects. But when it came to exam time, she was having panic attacks more or less daily. She started saying she couldn&amp;#39;t get out of bed. She would lay awake at night worrying about things. She struggled through, passed 5 GCSEs with good grades and stayed home for a further 2 exams so she failed them. It was a really stressful time for all of us. Then it was summer vacation, and things were fine. She turned 16 and decided to stay at the same school for sixth form (for Americans, this is like midway between high school and college). In sixth form you get to choose all of your subjects, and you get about 10 hours of school less each week than in high school.&lt;/p&gt;\n\n&lt;p&gt;We went to the doctor and got her a prescription for an anti-anxiety medicine, which doesn&amp;#39;t stop you being anxious but damps down the symptoms (heart rate, sweating, breathing) so it doesn&amp;#39;t spiral into panic attacks. That helped some, and she didn&amp;#39;t have any panic attacks while on it.&lt;/p&gt;\n\n&lt;p&gt;On the first week of school, she missed a day and said she couldn&amp;#39;t get out of bed. She said she needed a break from school. She said she couldn&amp;#39;t do it. Things carried on like that for a month or so, with her missing one or two days a week. Then it moved to three days a week. We tried all kinds of punishments and rewards, to no effect. Eventually she was missing four days a week. We talked to the school, they said she could go to a special room on her own in school, that she could change her classes, reduce her classload, get her schoolwork sent home some days, etc. but it gave no improvement. A couple months into the new school year, she dropped out of school.&lt;/p&gt;\n\n&lt;p&gt;We got her a therapist, who she saw I think four times. The therapist said she has depression. The first three times, she lied about things and said what she thought the therapist wanted to hear. The fourth time, after we talked about that, she was honest about her feelings, and she said it was a good session and that she felt hopeful about the future. Then she stopped going. First she said she didn&amp;#39;t want help, that she didn&amp;#39;t want to get better. Then she said that she would get better on her own.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s been out of school for four months now, but things are just getting worse. She started harming herself. Cutting her arms, burning herself on the radiator, clipping her skin with nail clippers. She&amp;#39;s applied for paid apprenticeships in fields she&amp;#39;s interested in, but even when they&amp;#39;ve told her she will definitely get the position, she has not contacted them back because of anxiety. She&amp;#39;s been staying up later and later, often until 6 in the morning just before everyone else gets up, and then sleeping until mid-afternoon. She isn&amp;#39;t fat, but she says she is, and tries to eat less. But when she has allowance money, she spends almost 100% of it on stuff like ice cream and chips. It&amp;#39;s common for her to have a pint of ice cream every day if she has the money for it. She&amp;#39;s very, very down on herself. She asks why I&amp;#39;m being nice if I tell her I love her. She says she doesn&amp;#39;t deserve it if I give her a gift. She says she has no skills and there is nothing interesting about her. She asks why we don&amp;#39;t just give up on her. She will sometimes do some baking (if one of us is helping her), but the whole time she&amp;#39;s saying things like &amp;quot;This is going to be terrible,&amp;quot; &amp;quot;I&amp;#39;m doing this wrong,&amp;quot; &amp;quot;I&amp;#39;ve messed it all up,&amp;quot; even though basically everything she makes is great.&lt;/p&gt;\n\n&lt;p&gt;Her shyness continues to get worse. She&amp;#39;s completely fine with us and her sister, but absolutely nobody else. Her grandparents visit every few weeks, but she won&amp;#39;t even come out of her room to see them. If I ask her to come out and see them, she says she can&amp;#39;t. She rarely goes out of the house. She won&amp;#39;t go into our corner shop (literally 50 feet away from the house), and actually pays her sister to go buy things for her.&lt;/p&gt;\n\n&lt;p&gt;About a month ago she tried to kill herself by overdosing on her anti-anxiety medicine while she was alone at home. After she took the overdose, she changed her mind (or didn&amp;#39;t really want it in the first place), then she called the police and they saved her at the hospital.&lt;/p&gt;\n\n&lt;p&gt;For a couple months she carried on saying she didn&amp;#39;t want help (even after the suicide attempt), that she didn&amp;#39;t want things to change. She still refused to see the therapist. I told her I thought that she did want change, but that she was afraid of it, that she was afraid of getting better because she would have to do uncomfortable things for it (i.e. things outside her comfort zone). She cried and agreed, which felt like a major breakthrough even though it didn&amp;#39;t change anything. She sabotages herself in lots of ways. Recently we tried triple chronotherapy, a 4 day treatment for depression which involves resetting your circadian rhythm with a SAD light daily, restricting your sleep, and going to bed and getting up at prescribed times. She was hopeful about it before we started, although also worried and said she was anxious that if she got better she would have to do things. It went graet the first two days, but on the third day she intentionally stayed up past the prescribed sleep time so that the whole things was ruined.&lt;/p&gt;\n\n&lt;p&gt;So, here we are. My daughter is depressed, anxious almost beyond belief, and refuses or sabotages anything that could possibly help. Has anyone else experienced this? What can I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Mainly I just want to complain about this situation, but I'm also desperately hoping somebody else has been through something similar and has advice for what to do, because I'm completely lost. Probably going to be a long post.\n\nSo, my daughter is 16. For most of her life, she was fine. She was shyer than most people (e.g. wouldn't play in a park with other kids she didn't know well, even as a toddler; hated talking to strangers and would sometimes just not respond if somebody talked to her because she was so shy), but still played outside on our street, had friends at school, volunteered in school plays, etc. She was perfectly happy playing on her own, and I would've described her as generally quiet and shy. She has a 3-years-younger sister, who is the opposite, generally loud and outgoing. \n\nEven with her shyness, there was no hint of any depression, she was almost always very cheerful, had positive thoughts, and would bring herself out of a low mood, and her shyness didn't seem to hold her back from anything.\n\nStarting at around 13, she grew to be more and more shy, and became very anxious about what other people were thinking of her. She stopped playing outside with other kids in the neighborhood. She stopped going into shops on her own. If you shopped with her, she would not select a garment from the rack by herself; she said she was anxious she would drop it and be laughed at, or something like that.\n\nShe gradually had less and less friends at school. She worried that the friends she did have actually didn't like her, and were only pretending.\n\nAt age 14 she started having panic attacks. Sometimes it would be about something (watching a scary movie), and other times brought on seemingly by nothing, like just sitting in class. They started out a few months apart, but became more frequent, probably weekly. But still she was (at least outwardly) happy. She had plenty of interests (mostly solitary). She enjoyed reading, writing, playing videogames, baking, fashion design, playing her guitar, and keeping a hamster. She also generally got along well with her younger sister, they played together a lot.\n\nWhen she started doing her GCSE exams, things got worse. For non-English people, GCSEs are subjects you choose and then take exams in, you then leave high school at 16 with your qualifications from those GCSEs. GCSE grades are important to the schools (they're ranked nationally against all schools), and the schools really drum it into you the importance of them, tell you to be thinking about a career, what you want to do for the rest of your life, etc. She felt really anxious about the future, and she had no idea what she wanted to do. She said everyone around her at school was doing well and knew what they wanted to do. \n\nShe still enjoyed school, and was always enthusiastic about her subjects. But when it came to exam time, she was having panic attacks more or less daily. She started saying she couldn't get out of bed. She would lay awake at night worrying about things. She struggled through, passed 5 GCSEs with good grades and stayed home for a further 2 exams so she failed them. It was a really stressful time for all of us. Then it was summer vacation, and things were fine. She turned 16 and decided to stay at the same school for sixth form (for Americans, this is like midway between high school and college). In sixth form you get to choose all of your subjects, and you get about 10 hours of school less each week than in high school.\n\nWe went to the doctor and got her a prescription for an anti-anxiety medicine, which doesn't stop you being anxious but damps down the symptoms (heart rate, sweating, breathing) so it doesn't spiral into panic attacks. That helped some, and she didn't have any panic attacks while on it.\n\nOn the first week of school, she missed a day and said she couldn't get out of bed. She said she needed a break from school. She said she couldn't do it. Things carried on like that for a month or so, with her missing one or two days a week. Then it moved to three days a week. We tried all kinds of punishments and rewards, to no effect. Eventually she was missing four days a week. We talked to the school, they said she could go to a special room on her own in school, that she could change her classes, reduce her classload, get her schoolwork sent home some days, etc. but it gave no improvement. A couple months into the new school year, she dropped out of school.\n\nWe got her a therapist, who she saw I think four times. The therapist said she has depression. The first three times, she lied about things and said what she thought the therapist wanted to hear. The fourth time, after we talked about that, she was honest about her feelings, and she said it was a good session and that she felt hopeful about the future. Then she stopped going. First she said she didn't want help, that she didn't want to get better. Then she said that she would get better on her own.\n\nShe's been out of school for four months now, but things are just getting worse. She started harming herself. Cutting her arms, burning herself on the radiator, clipping her skin with nail clippers. She's applied for paid apprenticeships in fields she's interested in, but even when they've told her she will definitely get the position, she has not contacted them back because of anxiety. She's been staying up later and later, often until 6 in the morning just before everyone else gets up, and then sleeping until mid-afternoon. She isn't fat, but she says she is, and tries to eat less. But when she has allowance money, she spends almost 100% of it on stuff like ice cream and chips. It's common for her to have a pint of ice cream every day if she has the money for it. She's very, very down on herself. She asks why I'm being nice if I tell her I love her. She says she doesn't deserve it if I give her a gift. She says she has no skills and there is nothing interesting about her. She asks why we don't just give up on her. She will sometimes do some baking (if one of us is helping her), but the whole time she's saying things like \"This is going to be terrible,\" \"I'm doing this wrong,\" \"I've messed it all up,\" even though basically everything she makes is great.\n\nHer shyness continues to get worse. She's completely fine with us and her sister, but absolutely nobody else. Her grandparents visit every few weeks, but she won't even come out of her room to see them. If I ask her to come out and see them, she says she can't. She rarely goes out of the house. She won't go into our corner shop (literally 50 feet away from the house), and actually pays her sister to go buy things for her.\n\nAbout a month ago she tried to kill herself by overdosing on her anti-anxiety medicine while she was alone at home. After she took the overdose, she changed her mind (or didn't really want it in the first place), then she called the police and they saved her at the hospital.\n\nFor a couple months she carried on saying she didn't want help (even after the suicide attempt), that she didn't want things to change. She still refused to see the therapist. I told her I thought that she did want change, but that she was afraid of it, that she was afraid of getting better because she would have to do uncomfortable things for it (i.e. things outside her comfort zone). She cried and agreed, which felt like a major breakthrough even though it didn't change anything. She sabotages herself in lots of ways. Recently we tried triple chronotherapy, a 4 day treatment for depression which involves resetting your circadian rhythm with a SAD light daily, restricting your sleep, and going to bed and getting up at prescribed times. She was hopeful about it before we started, although also worried and said she was anxious that if she got better she would have to do things. It went graet the first two days, but on the third day she intentionally stayed up past the prescribed sleep time so that the whole things was ruined.\n\nSo, here we are. My daughter is depressed, anxious almost beyond belief, and refuses or sabotages anything that could possibly help. Has anyone else experienced this? What can I do?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Teenager", "id": "65biju", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 23, "report_reasons": null, "author": "SimpleMcflea", "saved": false, "mod_reports": [], "name": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "teenager", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65biju/teenage_daughter_has_depression_and_anxiety_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492189518.0, "url": "https://www.reddit.com/r/Parenting/comments/65biju/teenage_daughter_has_depression_and_anxiety_and/", "author_flair_text": null, "quarantine": false, "title": "Teenage daughter has depression and anxiety and refuses help", "created_utc": 1492160718.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 49, "visited": false, "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg92umm", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Babywhale", "parent_id": "t1_dg90mup", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Physically force her if you have to. \n\nWhat does she do at home all day? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Physically force her if you have to. &lt;/p&gt;\n\n&lt;p&gt;What does she do at home all day? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg92umm", "score_hidden": false, "stickied": false, "created": 1492202483.0, "created_utc": 1492173683.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg99gid", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "Babywhale", "parent_id": "t1_dg98sda", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You're not listening. Her life is at stake. You have to do more. She needs therapy. The entire family needs therapy. Start making appointments. Or call around for options. Otherwise find an in patient program that will take her in.\n\nWhat does her daily routine look like right now? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not listening. Her life is at stake. You have to do more. She needs therapy. The entire family needs therapy. Start making appointments. Or call around for options. Otherwise find an in patient program that will take her in.&lt;/p&gt;\n\n&lt;p&gt;What does her daily routine look like right now? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg99gid", "score_hidden": false, "stickied": false, "created": 1492212002.0, "created_utc": 1492183202.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 29}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98sda", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg963fx", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If she was an infant, I'd just carry her in a car seat. But short of using actual violence, surely physically forcing a 16 year old is impossible.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she was an infant, I&amp;#39;d just carry her in a car seat. But short of using actual violence, surely physically forcing a 16 year old is impossible.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg98sda", "score_hidden": false, "stickied": false, "created": 1492211186.0, "created_utc": 1492182386.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg963fx", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "funyunsgood", "parent_id": "t1_dg90mup", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I hate to say force her but it's out love for her. Put her in the car and make her go. This is urgent. It's like if your infant needed to be rushed to the hospital, you don't hesitate. You get her to help no matter what it takes. Her life is at stake ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate to say force her but it&amp;#39;s out love for her. Put her in the car and make her go. This is urgent. It&amp;#39;s like if your infant needed to be rushed to the hospital, you don&amp;#39;t hesitate. You get her to help no matter what it takes. Her life is at stake &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg963fx", "score_hidden": false, "stickied": false, "created": 1492207669.0, "created_utc": 1492178869.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9ikl0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mndtrp", "parent_id": "t1_dg98opl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Just because she says that it doesn't mean she won't if they do come. Maybe not the first session, maybe not the third, maybe not ever. On the other hand, maybe she will. Wouldn't you rather try than not?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just because she says that it doesn&amp;#39;t mean she won&amp;#39;t if they do come. Maybe not the first session, maybe not the third, maybe not ever. On the other hand, maybe she will. Wouldn&amp;#39;t you rather try than not?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9ikl0", "score_hidden": false, "stickied": false, "created": 1492222452.0, "created_utc": 1492193652.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98opl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg93hip", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She's said she won't talk to a counselor if they come, and they haven't suggested doing it against her will. I guess it's worth a try, though. Maybe somebody could come talk to her and get her to come around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s said she won&amp;#39;t talk to a counselor if they come, and they haven&amp;#39;t suggested doing it against her will. I guess it&amp;#39;s worth a try, though. Maybe somebody could come talk to her and get her to come around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg98opl", "score_hidden": false, "stickied": false, "created": 1492211060.0, "created_utc": 1492182260.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93hip", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Miss_Awesomeness", "parent_id": "t1_dg90mup", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My dad went to my school and talked to my school counselor, she made an appointment to see me. It was wonderful. She made me feel a thousand times better. I felt much more confidence about therapists after that. Or maybe try a child psychologist and attend with daughter until she feels comfortable alone, like family therapy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dad went to my school and talked to my school counselor, she made an appointment to see me. It was wonderful. She made me feel a thousand times better. I felt much more confidence about therapists after that. Or maybe try a child psychologist and attend with daughter until she feels comfortable alone, like family therapy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg93hip", "score_hidden": false, "stickied": false, "created": 1492203653.0, "created_utc": 1492174853.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg90mup", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg8z0rz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Yeah, I agree, but how? She says she won't see a different therapist (that was something her current therapist suggested when she stopped going), and she won't come to the doctor to be assessed for a different medication.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I agree, but how? She says she won&amp;#39;t see a different therapist (that was something her current therapist suggested when she stopped going), and she won&amp;#39;t come to the doctor to be assessed for a different medication.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg90mup", "score_hidden": false, "stickied": false, "created": 1492197476.0, "created_utc": 1492168676.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8z0rz", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "funyunsgood", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She needs regular talk therapy (maybe twice a week) and a combo of medication that works. Some anxiety meds cause worse depression in teens (I know from experience) so keep switching until she finds one that works. Same with the therapist, keep trying ppl until she finds one she clicks with. \n\nYou are the parent, she's still under 18 don't give up and push her and help her to figure this out.\n\nThings will be so much harder for her in 2 years when everyone is moving onto the next stage in life and she's still paralyzed at home with no high school degree.\n\nDo not stop trying new therapists and new meds. Drive her, make her go. It's so important not to give up.   ", "edited": 1492163901.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She needs regular talk therapy (maybe twice a week) and a combo of medication that works. Some anxiety meds cause worse depression in teens (I know from experience) so keep switching until she finds one that works. Same with the therapist, keep trying ppl until she finds one she clicks with. &lt;/p&gt;\n\n&lt;p&gt;You are the parent, she&amp;#39;s still under 18 don&amp;#39;t give up and push her and help her to figure this out.&lt;/p&gt;\n\n&lt;p&gt;Things will be so much harder for her in 2 years when everyone is moving onto the next stage in life and she&amp;#39;s still paralyzed at home with no high school degree.&lt;/p&gt;\n\n&lt;p&gt;Do not stop trying new therapists and new meds. Drive her, make her go. It&amp;#39;s so important not to give up.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg8z0rz", "score_hidden": false, "stickied": false, "created": 1492192478.0, "created_utc": 1492163678.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9qk2b", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "random989898", "parent_id": "t1_dg94yb1", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There isn't a needle or pill that a doc can give that is going to fix the problem. Physically dragging a 16 year old around could land you in legal trouble.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There isn&amp;#39;t a needle or pill that a doc can give that is going to fix the problem. Physically dragging a 16 year old around could land you in legal trouble.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9qk2b", "score_hidden": false, "stickied": false, "created": 1492232059.0, "created_utc": 1492203259.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dgacmst", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg98txr", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thanks for trying to help, but really, I don't think beating someone with depression up is the way to help them and could probably make it worse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for trying to help, but really, I don&amp;#39;t think beating someone with depression up is the way to help them and could probably make it worse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgacmst", "score_hidden": false, "stickied": false, "created": 1492264003.0, "created_utc": 1492235203.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98txr", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Irixian", "parent_id": "t1_dg98mny", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If it's that or suicide, I choose the former. Give me a different option that has the potential to save the girl's life that's not having her picked up by an asylum.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If it&amp;#39;s that or suicide, I choose the former. Give me a different option that has the potential to save the girl&amp;#39;s life that&amp;#39;s not having her picked up by an asylum.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg98txr", "score_hidden": false, "stickied": false, "created": 1492211240.0, "created_utc": 1492182440.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98mny", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg94yb1", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "I don't see any way to drag somebody to a therapist without one of you getting injured. And then what, I handcuff her to a chair there? That's not going to be a very productive therapy session.", "edited": 1492235516.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see any way to drag somebody to a therapist without one of you getting injured. And then what, I handcuff her to a chair there? That&amp;#39;s not going to be a very productive therapy session.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg98mny", "score_hidden": false, "stickied": false, "created": 1492210989.0, "created_utc": 1492182189.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg94yb1", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Irixian", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You're her guardian and she's a minor. You force her. If you have to physically drag her to the doctor, you do it.\n \nNot all love is kind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re her guardian and she&amp;#39;s a minor. You force her. If you have to physically drag her to the doctor, you do it.&lt;/p&gt;\n\n&lt;p&gt;Not all love is kind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg94yb1", "score_hidden": false, "stickied": false, "created": 1492206024.0, "created_utc": 1492177224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9l3i1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "babyrabies777", "parent_id": "t1_dg92iau", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I was going to say this too.  It sounds like things have gotten pretty bad, and she is refusing help.  You may have to make her do some type of inpatient program, so that she can learn some coping skills for the panic attacks.\n\nI have very high anxiety also, with PTSD and panic attacks.  I have found meditation helps, also reducing stressful situations.  It may also help to role play situations with her that she finds stressful.  But none of these techniques will work if she refuses to try.  Putting her inpatient for a while might be what she needs to get some structure and coping skills.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was going to say this too.  It sounds like things have gotten pretty bad, and she is refusing help.  You may have to make her do some type of inpatient program, so that she can learn some coping skills for the panic attacks.&lt;/p&gt;\n\n&lt;p&gt;I have very high anxiety also, with PTSD and panic attacks.  I have found meditation helps, also reducing stressful situations.  It may also help to role play situations with her that she finds stressful.  But none of these techniques will work if she refuses to try.  Putting her inpatient for a while might be what she needs to get some structure and coping skills.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9l3i1", "score_hidden": false, "stickied": false, "created": 1492225477.0, "created_utc": 1492196677.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9gbhx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "reviliver", "parent_id": "t1_dg98jv9", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I would do research on local psych facilities in your area, especially ones that are experienced with teens. A short hospital stay could get her regulated enough that she will be willing to go to outpatient therapy. \n\nI would also stress to her that you guys are a team, and you are going to find the RIGHT help for her. Not every therapist is right for everyone; and it might help to assure her that you will help find someone that works for her. Depression is a terrible illness, but it is one that responds to treatment, and she has a whole life in front of her that could be very different from her current life.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would do research on local psych facilities in your area, especially ones that are experienced with teens. A short hospital stay could get her regulated enough that she will be willing to go to outpatient therapy. &lt;/p&gt;\n\n&lt;p&gt;I would also stress to her that you guys are a team, and you are going to find the RIGHT help for her. Not every therapist is right for everyone; and it might help to assure her that you will help find someone that works for her. Depression is a terrible illness, but it is one that responds to treatment, and she has a whole life in front of her that could be very different from her current life.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9gbhx", "score_hidden": false, "stickied": false, "created": 1492219817.0, "created_utc": 1492191017.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9lsn9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "chickpea_fille", "parent_id": "t1_dg98jv9", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Call the police and tell them she is actively suicidal, that she cannot keep herself safe, and you are unable to get her to go to the hospital. Go with her in the police car to the hospital and tell the doctor everything so they know how serious it is. Hopefully she is admitted to inpatient care.\n\nGet her back into regular therapy after she's out of the hospital, and always call the police when she says she is suicidal. Also, take away any implements that she has been using to harm herself. Lock up knives or other weapons.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call the police and tell them she is actively suicidal, that she cannot keep herself safe, and you are unable to get her to go to the hospital. Go with her in the police car to the hospital and tell the doctor everything so they know how serious it is. Hopefully she is admitted to inpatient care.&lt;/p&gt;\n\n&lt;p&gt;Get her back into regular therapy after she&amp;#39;s out of the hospital, and always call the police when she says she is suicidal. Also, take away any implements that she has been using to harm herself. Lock up knives or other weapons.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9lsn9", "score_hidden": false, "stickied": false, "created": 1492226324.0, "created_utc": 1492197524.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dgacjy9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg9ynty", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Yeah, cahms is the therapist she's seeing right now. I do feel like it isn't being taken as seriously as it should, but it's felt like they're the professionals, so they should know what they're doing. I think she's fine to wait over the weekend, and I'll talk to them more about it next week.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, cahms is the therapist she&amp;#39;s seeing right now. I do feel like it isn&amp;#39;t being taken as seriously as it should, but it&amp;#39;s felt like they&amp;#39;re the professionals, so they should know what they&amp;#39;re doing. I think she&amp;#39;s fine to wait over the weekend, and I&amp;#39;ll talk to them more about it next week.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgacjy9", "score_hidden": false, "stickied": false, "created": 1492263835.0, "created_utc": 1492235035.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ynty", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aurelie_v", "parent_id": "t1_dg98jv9", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You can start with your GP, with CAMHS, or even go straight to A&amp;E if things seem to be getting worse. Mental health crisis counts as an emergency. The only problem with the GP is they are likely closed until Tuesday, and if you call the out of hours doctor, it will probably be a stranger. If she seems stable enough to wait over the Easter weekend and you trust the GP, then that is a good option. Getting her sectioned (if she is likely to refuse a voluntary admission) isn't an easy process, though, and it may be the doctors feel she will do better at home with more intensive treatment. But it is *a really good idea* to bring up sectioning. It will help underline for the GP and CAMHS how serious things have become. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can start with your GP, with CAMHS, or even go straight to A&amp;amp;E if things seem to be getting worse. Mental health crisis counts as an emergency. The only problem with the GP is they are likely closed until Tuesday, and if you call the out of hours doctor, it will probably be a stranger. If she seems stable enough to wait over the Easter weekend and you trust the GP, then that is a good option. Getting her sectioned (if she is likely to refuse a voluntary admission) isn&amp;#39;t an easy process, though, and it may be the doctors feel she will do better at home with more intensive treatment. But it is &lt;em&gt;a really good idea&lt;/em&gt; to bring up sectioning. It will help underline for the GP and CAMHS how serious things have become. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9ynty", "score_hidden": false, "stickied": false, "created": 1492242665.0, "created_utc": 1492213865.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98jv9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg92iau", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That's the only thing I can see as an option right now. I don't know if the authorities will go for it, though. I guess, do I start by asking our GP about it? When she tried to kill herself, a mental health counselor talked to her and they decided she wasn't a further risk. But just today she's again been talking about killing herself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the only thing I can see as an option right now. I don&amp;#39;t know if the authorities will go for it, though. I guess, do I start by asking our GP about it? When she tried to kill herself, a mental health counselor talked to her and they decided she wasn&amp;#39;t a further risk. But just today she&amp;#39;s again been talking about killing herself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg98jv9", "score_hidden": false, "stickied": false, "created": 1492210893.0, "created_utc": 1492182093.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92iau", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "reviliver", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You are her guardian. She may need to be involuntarily committed to a psychiatric facility if she is actively suicidal. I know you feel helpless and don't want to push her, but her life could depend on you not giving up. Even if she hates you for it, at least she'll be alive to hate you (and eventually forgive you).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are her guardian. She may need to be involuntarily committed to a psychiatric facility if she is actively suicidal. I know you feel helpless and don&amp;#39;t want to push her, but her life could depend on you not giving up. Even if she hates you for it, at least she&amp;#39;ll be alive to hate you (and eventually forgive you).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg92iau", "score_hidden": false, "stickied": false, "created": 1492201821.0, "created_utc": 1492173021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dgacw0l", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg9xu2c", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Do you know if there are any voluntary inpatient mental health facilities in the UK? Like, if she said she wanted that. Sometimes in the past she's said she'd like to live in a mental hospital because of all the routines, no unexpected things to arouse your anxiety, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you know if there are any voluntary inpatient mental health facilities in the UK? Like, if she said she wanted that. Sometimes in the past she&amp;#39;s said she&amp;#39;d like to live in a mental hospital because of all the routines, no unexpected things to arouse your anxiety, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgacw0l", "score_hidden": false, "stickied": false, "created": 1492264569.0, "created_utc": 1492235769.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xu2c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aurelie_v", "parent_id": "t1_dg92r6m", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The process for involuntary psych holds in the UK is called sectioning, and it's quite difficult to get someone held against their will for any extended period. (Also, even minors have the right to appeal their section.) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The process for involuntary psych holds in the UK is called sectioning, and it&amp;#39;s quite difficult to get someone held against their will for any extended period. (Also, even minors have the right to appeal their section.) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9xu2c", "score_hidden": false, "stickied": false, "created": 1492241573.0, "created_utc": 1492212773.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg92r6m", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Babywhale", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If she had pneumonia would you let her refuse treatment? She needs help.\n\nSounds like she's in serious trouble. Is there an in patient treatment facility she could be admitted to? You have been trying and it hasn't been working her or your way, time for professional help. Also re-evaluate the entire family and home environment. This isn't a problem with just her, this is a family issue, something isn't working. Family therapy is also necessary. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she had pneumonia would you let her refuse treatment? She needs help.&lt;/p&gt;\n\n&lt;p&gt;Sounds like she&amp;#39;s in serious trouble. Is there an in patient treatment facility she could be admitted to? You have been trying and it hasn&amp;#39;t been working her or your way, time for professional help. Also re-evaluate the entire family and home environment. This isn&amp;#39;t a problem with just her, this is a family issue, something isn&amp;#39;t working. Family therapy is also necessary. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg92r6m", "score_hidden": false, "stickied": false, "created": 1492202304.0, "created_utc": 1492173504.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9jzza", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MAXIMUM_FARTING", "parent_id": "t1_dg9ajda", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Yeah, my parents never allowed my more anxious traits get to the point of \"sleeping all day\". They had clear expectations and made life unendingly miserable if we tried to get out of school.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, my parents never allowed my more anxious traits get to the point of &amp;quot;sleeping all day&amp;quot;. They had clear expectations and made life unendingly miserable if we tried to get out of school.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9jzza", "score_hidden": false, "stickied": false, "created": 1492224159.0, "created_utc": 1492195359.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dgbqwqr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dgaq00d", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Maybe that would work. I really don't think it would, but maybe. I can't do it, though. I've screamed at my kids once in all these years. And punching a hole in the wall around them? I'd sooner punch myself. I'm not going to make my daughter terrified of me. It's good that it worked for you, and I appreciate your advice, but I'll have to do different things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe that would work. I really don&amp;#39;t think it would, but maybe. I can&amp;#39;t do it, though. I&amp;#39;ve screamed at my kids once in all these years. And punching a hole in the wall around them? I&amp;#39;d sooner punch myself. I&amp;#39;m not going to make my daughter terrified of me. It&amp;#39;s good that it worked for you, and I appreciate your advice, but I&amp;#39;ll have to do different things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbqwqr", "score_hidden": false, "stickied": false, "created": 1492350222.0, "created_utc": 1492321422.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaq00d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "athaliah", "parent_id": "t1_dgacfit", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Those were the only things I remember at the top of my head. My parents made my life miserable if I didn't do what they said. If I tried to even \"talk back\", i'd get in trouble. They didn't drop it. They hounded me over things constantly (which is why I said my mom yelled a lot). Not listening to them was more miserable than listening to them, that is how they made me do things. Staying home from school in exchange of a punishment would not have been an option. I would have been punished and STILL forced to go to school. I would have been physically removed or screamed out of my room. My bedroom door would have been locked to keep me out of it. This would happen all the way to the front door, to the car door.  I remember my dad punching a hole in my door because I refused to leave once, scared me because i'd never seen him so mad before, and whatever it was I was doing, I didn't do it again.\n\nI'm not saying do all those things. But you're just making excuse after excuse for your daughter and it's obviously not helping her. ", "edited": 1492268105.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Those were the only things I remember at the top of my head. My parents made my life miserable if I didn&amp;#39;t do what they said. If I tried to even &amp;quot;talk back&amp;quot;, i&amp;#39;d get in trouble. They didn&amp;#39;t drop it. They hounded me over things constantly (which is why I said my mom yelled a lot). Not listening to them was more miserable than listening to them, that is how they made me do things. Staying home from school in exchange of a punishment would not have been an option. I would have been punished and STILL forced to go to school. I would have been physically removed or screamed out of my room. My bedroom door would have been locked to keep me out of it. This would happen all the way to the front door, to the car door.  I remember my dad punching a hole in my door because I refused to leave once, scared me because i&amp;#39;d never seen him so mad before, and whatever it was I was doing, I didn&amp;#39;t do it again.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying do all those things. But you&amp;#39;re just making excuse after excuse for your daughter and it&amp;#39;s obviously not helping her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgaq00d", "score_hidden": false, "stickied": false, "created": 1492296672.0, "created_utc": 1492267872.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgacfit", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg9ajda", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It doesn't sound like they made you do anything. You went along with their system. Now imagine that you hadn't gone along, how could they have *made* you? We've had a longstanding policy that our kids can't miss a day of school without permission. If they do, they lose various privileges (e.g. videogames, phone, going out). So, when she started missing school, she received the standard punishment. For a few weeks it seemed to sort of be working. She would miss a day, lose the things, but then want them back so she'd go the next day. It was never two days in a row - until it was. Until eventually she was going a whole week with nothing. Then she was in bed 20 hours a day 7 days a week, and feeling worse because most of the things she enjoyed were gone. During this latter period most of her out-of-bed time was spent laying on the floor, and with the whole time her constantly asking why we were punishing her for something she couldn't control.\n\nSo, with advice from her therapist, we stopped the punishments.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t sound like they made you do anything. You went along with their system. Now imagine that you hadn&amp;#39;t gone along, how could they have &lt;em&gt;made&lt;/em&gt; you? We&amp;#39;ve had a longstanding policy that our kids can&amp;#39;t miss a day of school without permission. If they do, they lose various privileges (e.g. videogames, phone, going out). So, when she started missing school, she received the standard punishment. For a few weeks it seemed to sort of be working. She would miss a day, lose the things, but then want them back so she&amp;#39;d go the next day. It was never two days in a row - until it was. Until eventually she was going a whole week with nothing. Then she was in bed 20 hours a day 7 days a week, and feeling worse because most of the things she enjoyed were gone. During this latter period most of her out-of-bed time was spent laying on the floor, and with the whole time her constantly asking why we were punishing her for something she couldn&amp;#39;t control.&lt;/p&gt;\n\n&lt;p&gt;So, with advice from her therapist, we stopped the punishments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgacfit", "score_hidden": false, "stickied": false, "created": 1492263577.0, "created_utc": 1492234777.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ajda", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "athaliah", "parent_id": "t1_dg98h8l", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Well for one my mom yelled a lot. But their punishments also included grounding me from doing fun things, taking away my computer/phone, shutting off cable/internet, withholding allowance, refusing to budge even a tiny bit on anything...like missing school? I would NEVER have been able to say \"I just can't do it today\", no I had to be contagious with a high fever in order for them to let me stay home. Like I said, it sucked and I hated my parents for it, but because they did all that, I didn't throw my life away when I very well could have. \n\nYou could also try bribing her, getting a relative to strong arm her into the car, lying to her about where ya'll are going and take her to the doctor, those are all questionable ideas but they're ideas. Oh, and I don't know if it would have worked on me when I was 16, but I actually didn't get on medication until I was in my 20's, and I only agreed to it because of what my psychiatrist told me. She explained how anxiety (and your daughter's case depression) is often a chemical imbalance in your brain. If you had low iron, you'd take a vitamin to bring it up to a normal level, right? Taking medication for mental illness is the same thing. Not only that, but it's not like it has to be anything permanent. She said \"Give it two weeks, if you don't like them at the end of those two weeks, you can flush em down the toilet. Just try it. Just for two weeks. What do you have to lose, you know?\" and I was like fine....I will stick this out for two weeks. And what do you know  those pills worked miracles and she was totally right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well for one my mom yelled a lot. But their punishments also included grounding me from doing fun things, taking away my computer/phone, shutting off cable/internet, withholding allowance, refusing to budge even a tiny bit on anything...like missing school? I would NEVER have been able to say &amp;quot;I just can&amp;#39;t do it today&amp;quot;, no I had to be contagious with a high fever in order for them to let me stay home. Like I said, it sucked and I hated my parents for it, but because they did all that, I didn&amp;#39;t throw my life away when I very well could have. &lt;/p&gt;\n\n&lt;p&gt;You could also try bribing her, getting a relative to strong arm her into the car, lying to her about where ya&amp;#39;ll are going and take her to the doctor, those are all questionable ideas but they&amp;#39;re ideas. Oh, and I don&amp;#39;t know if it would have worked on me when I was 16, but I actually didn&amp;#39;t get on medication until I was in my 20&amp;#39;s, and I only agreed to it because of what my psychiatrist told me. She explained how anxiety (and your daughter&amp;#39;s case depression) is often a chemical imbalance in your brain. If you had low iron, you&amp;#39;d take a vitamin to bring it up to a normal level, right? Taking medication for mental illness is the same thing. Not only that, but it&amp;#39;s not like it has to be anything permanent. She said &amp;quot;Give it two weeks, if you don&amp;#39;t like them at the end of those two weeks, you can flush em down the toilet. Just try it. Just for two weeks. What do you have to lose, you know?&amp;quot; and I was like fine....I will stick this out for two weeks. And what do you know  those pills worked miracles and she was totally right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9ajda", "score_hidden": false, "stickied": false, "created": 1492213282.0, "created_utc": 1492184482.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9y3gd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "aurelie_v", "parent_id": "t1_dg98h8l", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It seems like you are falling into the difficult late adolescent phase when CAMHS doesn't do much because they know they will soon be able to pass the child on to adult services, but it's not yet time for that transfer to take effect. As step one, I would call your GP as soon as they re-open and ask for an emergency appointment *for you* if she won't go with you. Talk freely about your concerns and say you need the GP's support in accessing more help from CAMHS. Phone CAMHS and ask to speak to the duty doctor urgently (same day); outline your concerns about her self harm and suicidality. Specifically say that you feel her level of risk is not being taken seriously. Have you been given the number of the crisis team? Most CAMHS will do home visits, and it sounds like your daughter could benefit from this. You may need to push them a bit. \n\nIf her condition worsens and you are immediately worried for her safety, or she stops eating and drinking, take her to A&amp;E and insist on an assessment. (In the meantime, lock up sharps and medications, and household chemicals, so she can't easily access anything lethal.) \n\nThese are just some basics. I really hope things improve for you all soon. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It seems like you are falling into the difficult late adolescent phase when CAMHS doesn&amp;#39;t do much because they know they will soon be able to pass the child on to adult services, but it&amp;#39;s not yet time for that transfer to take effect. As step one, I would call your GP as soon as they re-open and ask for an emergency appointment &lt;em&gt;for you&lt;/em&gt; if she won&amp;#39;t go with you. Talk freely about your concerns and say you need the GP&amp;#39;s support in accessing more help from CAMHS. Phone CAMHS and ask to speak to the duty doctor urgently (same day); outline your concerns about her self harm and suicidality. Specifically say that you feel her level of risk is not being taken seriously. Have you been given the number of the crisis team? Most CAMHS will do home visits, and it sounds like your daughter could benefit from this. You may need to push them a bit. &lt;/p&gt;\n\n&lt;p&gt;If her condition worsens and you are immediately worried for her safety, or she stops eating and drinking, take her to A&amp;amp;E and insist on an assessment. (In the meantime, lock up sharps and medications, and household chemicals, so she can&amp;#39;t easily access anything lethal.) &lt;/p&gt;\n\n&lt;p&gt;These are just some basics. I really hope things improve for you all soon. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9y3gd", "score_hidden": false, "stickied": false, "created": 1492241911.0, "created_utc": 1492213111.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98h8l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg93qrd", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "How can I make her do these things? How did your parents make you?", "edited": 1492182439.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How can I make her do these things? How did your parents make you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg98h8l", "score_hidden": false, "stickied": false, "created": 1492210800.0, "created_utc": 1492182000.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg93qrd", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "athaliah", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You need to something now while she's still a minor and you have a legal obligation and legal rights to get her help. Once she's 18, you won't be able to force her to do anything and you'll be SOL without her cooperation.\n\nWhat kind of anti-anxiety medication was she taking? Stops the symptoms but not the anxiety? That sounds completely useless. Was she just seeing a general practitioner for the meds? Have her see a psychiatrist instead. They'll help her find meds that work. If you can't convince her to go nicely, make her go. Do whatever you need to do. You're enabling her waaay too much. I had the same issues when I was her age but the difference was my parents would never have let me use it as an excuse (and I HATED them for it, but looking back, i'm glad they did it). They made me go to school. Made me use the phone. Made me visit my grandparents. Made me go to sleep at a decent time.\n\nI have a cousin who went through the same thing too, only her mom was like you, and now she's 20 and still lives at home with no driver's license, no high school degree, no ambitions, smokes pot all day (which she pays for with a part time job her mom drives her to)...her mom tiptoes around her issues and is afraid to do anything about them. Don't let your daughter end up like that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to something now while she&amp;#39;s still a minor and you have a legal obligation and legal rights to get her help. Once she&amp;#39;s 18, you won&amp;#39;t be able to force her to do anything and you&amp;#39;ll be SOL without her cooperation.&lt;/p&gt;\n\n&lt;p&gt;What kind of anti-anxiety medication was she taking? Stops the symptoms but not the anxiety? That sounds completely useless. Was she just seeing a general practitioner for the meds? Have her see a psychiatrist instead. They&amp;#39;ll help her find meds that work. If you can&amp;#39;t convince her to go nicely, make her go. Do whatever you need to do. You&amp;#39;re enabling her waaay too much. I had the same issues when I was her age but the difference was my parents would never have let me use it as an excuse (and I HATED them for it, but looking back, i&amp;#39;m glad they did it). They made me go to school. Made me use the phone. Made me visit my grandparents. Made me go to sleep at a decent time.&lt;/p&gt;\n\n&lt;p&gt;I have a cousin who went through the same thing too, only her mom was like you, and now she&amp;#39;s 20 and still lives at home with no driver&amp;#39;s license, no high school degree, no ambitions, smokes pot all day (which she pays for with a part time job her mom drives her to)...her mom tiptoes around her issues and is afraid to do anything about them. Don&amp;#39;t let your daughter end up like that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg93qrd", "score_hidden": false, "stickied": false, "created": 1492204100.0, "created_utc": 1492175300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dga97qg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "shygermany", "parent_id": "t1_dg9qfxc", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This 1000%. I'm appalled at some of these answers. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This 1000%. I&amp;#39;m appalled at some of these answers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dga97qg", "score_hidden": false, "stickied": false, "created": 1492257727.0, "created_utc": 1492228927.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9qfxc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "random989898", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "OP you are getting a lot of well meaning advice that just isn't going to work. Telling her that she just needs to do everything she is supposed to do or else there will be consequences isn't going to work. Punishing her for how she thinks and feels will not work. Nor is showing up at a therapist office, dragged there by physical force. Few therapist will work with someone who isn't there voluntarily and fewer still would advocate for a parents using physical force.  She isn't just being lazy or difficult. Her brain in the combination of being 16, depressed and anxious is telling her all kinds of distorted truths, she is filled with angst along with illness. She believes all kinds of things about herself and others that her brain keeps reinforcing and her reality is skewed. Avoidance has further reinforced relief of not doing things and created habits and patterns that will take time to change. In addition she is a teen and dealing with all the identity and meaning of life stuff that comes with adolescence. \n\nAt this point, you likely need an intensive service - in house support, hospitalization or a residential treatment option. Some places have day programs but that means you have to get her there every day. I also worked in a program that had outreach counselors where if the teen didn't show up for the daily program, a counselor went to their house and tried to get them to come to program with them. While one of the criteria for hospital is high suicide risk, inability to function is also something that can lead to more residential treatment. \n\nTalk to your doctor and your local mental health organization. Maybe Young Minds? https://youngminds.org.uk/find-help/for-parents/parents-helpline/ and see what direct help they can offer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP you are getting a lot of well meaning advice that just isn&amp;#39;t going to work. Telling her that she just needs to do everything she is supposed to do or else there will be consequences isn&amp;#39;t going to work. Punishing her for how she thinks and feels will not work. Nor is showing up at a therapist office, dragged there by physical force. Few therapist will work with someone who isn&amp;#39;t there voluntarily and fewer still would advocate for a parents using physical force.  She isn&amp;#39;t just being lazy or difficult. Her brain in the combination of being 16, depressed and anxious is telling her all kinds of distorted truths, she is filled with angst along with illness. She believes all kinds of things about herself and others that her brain keeps reinforcing and her reality is skewed. Avoidance has further reinforced relief of not doing things and created habits and patterns that will take time to change. In addition she is a teen and dealing with all the identity and meaning of life stuff that comes with adolescence. &lt;/p&gt;\n\n&lt;p&gt;At this point, you likely need an intensive service - in house support, hospitalization or a residential treatment option. Some places have day programs but that means you have to get her there every day. I also worked in a program that had outreach counselors where if the teen didn&amp;#39;t show up for the daily program, a counselor went to their house and tried to get them to come to program with them. While one of the criteria for hospital is high suicide risk, inability to function is also something that can lead to more residential treatment. &lt;/p&gt;\n\n&lt;p&gt;Talk to your doctor and your local mental health organization. Maybe Young Minds? &lt;a href=\"https://youngminds.org.uk/find-help/for-parents/parents-helpline/\"&gt;https://youngminds.org.uk/find-help/for-parents/parents-helpline/&lt;/a&gt; and see what direct help they can offer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9qfxc", "score_hidden": false, "stickied": false, "created": 1492231919.0, "created_utc": 1492203119.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9yaw6", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "aurelie_v", "parent_id": "t1_dg97r6h", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Parents don't usually have the option to hospitalise a child in the UK. Psych hospitalisations are run primarily through the NHS and prioritised according to need – it can be hard to get a bed. OP's daughter might qualify, but the local CAMHS team may wish to try intensive outpatient treatment first. Because the treatment is free, it is largely up to the professionals who gets what. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Parents don&amp;#39;t usually have the option to hospitalise a child in the UK. Psych hospitalisations are run primarily through the NHS and prioritised according to need – it can be hard to get a bed. OP&amp;#39;s daughter might qualify, but the local CAMHS team may wish to try intensive outpatient treatment first. Because the treatment is free, it is largely up to the professionals who gets what. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9yaw6", "score_hidden": false, "stickied": false, "created": 1492242180.0, "created_utc": 1492213380.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97r6h", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "annafirtree", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Consider having her [hospitalized](http://www.webmd.com/depression/hospitalization-needed#1). That way they can keep an eye on her while trying out new medications and hopefully get her to a more stable state.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider having her &lt;a href=\"http://www.webmd.com/depression/hospitalization-needed#1\"&gt;hospitalized&lt;/a&gt;. That way they can keep an eye on her while trying out new medications and hopefully get her to a more stable state.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg97r6h", "score_hidden": false, "stickied": false, "created": 1492209882.0, "created_utc": 1492181082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9ipsz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "yourfaceissexual", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Im the legal guardian of my nephew. He was doing similar behaviors as your daughter. Skipping school and classes due to anxiety, depression, and anxiety attacks. Not taking all of his medicine. Abnormal sleep patterns. Lying to his therapist. Saying he didnt like his therapist each time we got a new one. Ignoring punishments. He even threatened to harm my daughter, himself, and me. After that I asked a friend to help me bring him to an ER. I lied and said we going to pickup takeout and he wasnt allowed to be alone after threatening suicide again. When we got there I told him I lied and that I was having him committed. He said he would lie to get out of having to go. When we saw the doctor he lied about everything he had done. So i interjected and told the doctor he had threatened to assault my daughter and me, that he was suicidal, and that he was planning to kill himself with an ovedose. They instantly committed him. I honestly didn't think anyone was going to help us, but the doctor looked at my nephew and said that he was in the custody of the facility instead of me until an inpatient clinic could come and take him away and that he would stay there as long as necessary. He was put in a room that had security doors, and he was escorted wherever he went which wasn't far because the bathroom was in his room. Had he left he would have been caught by the security gaurds on the hospital campus.\n\nDo whatever you have to do to get her committed. Lie. Call 911. Man handle her, throw her in the car, and pull her into an emergency room kicking and screaming.  Dont let her just sit there and lie. Call her out. The doctors will believe you over her, and they'll have her committed to a place that has enough people to hold her down and force her to take medicine if they have to. I know what I said is harsh, and it truly feels terrible to do this to your child. But it's either give them to someone who is unbiased and strong enough to force her into a healthy state of mind or let her kill herself. This is a decision that you need to make today, and ERs are always open. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im the legal guardian of my nephew. He was doing similar behaviors as your daughter. Skipping school and classes due to anxiety, depression, and anxiety attacks. Not taking all of his medicine. Abnormal sleep patterns. Lying to his therapist. Saying he didnt like his therapist each time we got a new one. Ignoring punishments. He even threatened to harm my daughter, himself, and me. After that I asked a friend to help me bring him to an ER. I lied and said we going to pickup takeout and he wasnt allowed to be alone after threatening suicide again. When we got there I told him I lied and that I was having him committed. He said he would lie to get out of having to go. When we saw the doctor he lied about everything he had done. So i interjected and told the doctor he had threatened to assault my daughter and me, that he was suicidal, and that he was planning to kill himself with an ovedose. They instantly committed him. I honestly didn&amp;#39;t think anyone was going to help us, but the doctor looked at my nephew and said that he was in the custody of the facility instead of me until an inpatient clinic could come and take him away and that he would stay there as long as necessary. He was put in a room that had security doors, and he was escorted wherever he went which wasn&amp;#39;t far because the bathroom was in his room. Had he left he would have been caught by the security gaurds on the hospital campus.&lt;/p&gt;\n\n&lt;p&gt;Do whatever you have to do to get her committed. Lie. Call 911. Man handle her, throw her in the car, and pull her into an emergency room kicking and screaming.  Dont let her just sit there and lie. Call her out. The doctors will believe you over her, and they&amp;#39;ll have her committed to a place that has enough people to hold her down and force her to take medicine if they have to. I know what I said is harsh, and it truly feels terrible to do this to your child. But it&amp;#39;s either give them to someone who is unbiased and strong enough to force her into a healthy state of mind or let her kill herself. This is a decision that you need to make today, and ERs are always open. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9ipsz", "score_hidden": false, "stickied": false, "created": 1492222623.0, "created_utc": 1492193823.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dga7v56", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MAXIMUM_FARTING", "parent_id": "t1_dg9i2rd", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt;This is why you have to stop incentivizing her mental issues - stop letting her use 'anxiety' as some sort of magical *get out of life free* card\n\nSo much this.  I'm all for being understanding and considerate of people living with mental health disorders, but there's a difference between 'understanding' and 'enabling'.\n\nAllowing your and their life to be dictated by their illness doesn't help them, you, or anyone else living in that environment.  It creates resentment on all sides and will destroy their lives and relationships if she isn't cajoled, bribed or forced into treatment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;This is why you have to stop incentivizing her mental issues - stop letting her use &amp;#39;anxiety&amp;#39; as some sort of magical &lt;em&gt;get out of life free&lt;/em&gt; card&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So much this.  I&amp;#39;m all for being understanding and considerate of people living with mental health disorders, but there&amp;#39;s a difference between &amp;#39;understanding&amp;#39; and &amp;#39;enabling&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Allowing your and their life to be dictated by their illness doesn&amp;#39;t help them, you, or anyone else living in that environment.  It creates resentment on all sides and will destroy their lives and relationships if she isn&amp;#39;t cajoled, bribed or forced into treatment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dga7v56", "score_hidden": false, "stickied": false, "created": 1492255542.0, "created_utc": 1492226742.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9i2rd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ImpotentJunta", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She's old enough to be talked to like an adult. I would just sit down with her and have a conversation. Tell her you see three options, but she's welcome to suggest alternatives.\n\n1.) She sees a doctor about her mental health issues, and then she returns to school and attends every day. Her dropping out was a result of everyone being okay with her skipping, so mandate attendance.\n\n2.) She sees a doctor about her mental health issues, and then secures and apprenticeship. When she turns 18 she begins to pay rent and function in life as an adult.\n\n3.) She sees a doctor about her mental health issues, and then pursues another path in life.\n\nMake it abundantly clear that you love her, are concerned for her, but that you cannot accept her decision to drop out of life. If she pushes you on this, push back. Turn off the internet. Take the television cords. Do not allow her to sit at home and be entertained 24/7 while real life passes her by. Make her go get groceries, run errands. Have her in an inpatient facility if she's talking about suicide.\n\n&gt;She was hopeful about it before we started, although also worried and said she was anxious that if she got better she would have to do things.\n\nThis is telling. Getting better means having to do things, which she doesn't want. So she doesn't get better. This is why you have to stop incentivizing her mental issues - stop letting her use 'anxiety' as some sort of magical *get out of life free* card. If she's anxious about pulling clothes off the rack at the store, she can either treat that anxiety and do it, or do it anyway. There should be no option for *my parents jump in and save me*.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s old enough to be talked to like an adult. I would just sit down with her and have a conversation. Tell her you see three options, but she&amp;#39;s welcome to suggest alternatives.&lt;/p&gt;\n\n&lt;p&gt;1.) She sees a doctor about her mental health issues, and then she returns to school and attends every day. Her dropping out was a result of everyone being okay with her skipping, so mandate attendance.&lt;/p&gt;\n\n&lt;p&gt;2.) She sees a doctor about her mental health issues, and then secures and apprenticeship. When she turns 18 she begins to pay rent and function in life as an adult.&lt;/p&gt;\n\n&lt;p&gt;3.) She sees a doctor about her mental health issues, and then pursues another path in life.&lt;/p&gt;\n\n&lt;p&gt;Make it abundantly clear that you love her, are concerned for her, but that you cannot accept her decision to drop out of life. If she pushes you on this, push back. Turn off the internet. Take the television cords. Do not allow her to sit at home and be entertained 24/7 while real life passes her by. Make her go get groceries, run errands. Have her in an inpatient facility if she&amp;#39;s talking about suicide.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She was hopeful about it before we started, although also worried and said she was anxious that if she got better she would have to do things.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is telling. Getting better means having to do things, which she doesn&amp;#39;t want. So she doesn&amp;#39;t get better. This is why you have to stop incentivizing her mental issues - stop letting her use &amp;#39;anxiety&amp;#39; as some sort of magical &lt;em&gt;get out of life free&lt;/em&gt; card. If she&amp;#39;s anxious about pulling clothes off the rack at the store, she can either treat that anxiety and do it, or do it anyway. There should be no option for &lt;em&gt;my parents jump in and save me&lt;/em&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9i2rd", "score_hidden": false, "stickied": false, "created": 1492221861.0, "created_utc": 1492193061.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9nz20", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "watermelonsteven", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't think I can give better advice than anyone else, I just want to pull up a few points.\n\n1) re: sleeping, I'd just like to flag up that anxiety is a mental illness with physical effects, and being so keyed up 24/7 will tire a body out. Do give her an hour or two more to rest than you might give others, but the in-bed-all-day stuff does need to stop. \n\n2) I really feel for you OP because essentially this is a very difficult round the clock job! And on top of that, I know you likely feel you don't have any bargaining power, because she's already so miserable that there's not a lot you can do in terms of punishment to make her lot worse (and I know I'd irrationally feel guilty about it). \n\n\nIt seems to me that all this stems from paralysing fears about her future. I have two recommendations for this.\n\n\nShort term: pick some things she can and should do everyday. Talk these through with her and get her agreement​. My depression goals are to get out of bed for 2+ hours, write 1 journal entry and shower every day. That's it. Non negotiable. It'll be a good start, and once managed it a few days in a row, she'll feel like she's making some small progress.\n\n\nLong term: therapy. She can't possibly argue that she doesn't need it. I don't have any advice in the interim though, I'm afraid.\n\nMedication: she ought to be trying new combos, but it is very difficult side effects wise. If you aren't already, you need to be in the room with her in appointments.  \n\nMotivation: she's so scared of the future that she's stalled. If she has any ideas of what she'd like to do, try to build on that in any way: How to Get a Job in X Field books, documentaries, etc. Memoirs are good because it'll show her that people live through this. If she likes food, she might like a YouTube series called 'Backburner', which is about Rosianna Rojas cooking her way through a cookbook whilst struggling with depression and body image issues. The Young Women's Trust coaching service might be helpful for her at a slightly later stage ( http://www.youngwomenstrust.org/workitoutservice )\n\nI really hope you guys pull through this, OP. Good luck.", "edited": 1492200686.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think I can give better advice than anyone else, I just want to pull up a few points.&lt;/p&gt;\n\n&lt;p&gt;1) re: sleeping, I&amp;#39;d just like to flag up that anxiety is a mental illness with physical effects, and being so keyed up 24/7 will tire a body out. Do give her an hour or two more to rest than you might give others, but the in-bed-all-day stuff does need to stop. &lt;/p&gt;\n\n&lt;p&gt;2) I really feel for you OP because essentially this is a very difficult round the clock job! And on top of that, I know you likely feel you don&amp;#39;t have any bargaining power, because she&amp;#39;s already so miserable that there&amp;#39;s not a lot you can do in terms of punishment to make her lot worse (and I know I&amp;#39;d irrationally feel guilty about it). &lt;/p&gt;\n\n&lt;p&gt;It seems to me that all this stems from paralysing fears about her future. I have two recommendations for this.&lt;/p&gt;\n\n&lt;p&gt;Short term: pick some things she can and should do everyday. Talk these through with her and get her agreement​. My depression goals are to get out of bed for 2+ hours, write 1 journal entry and shower every day. That&amp;#39;s it. Non negotiable. It&amp;#39;ll be a good start, and once managed it a few days in a row, she&amp;#39;ll feel like she&amp;#39;s making some small progress.&lt;/p&gt;\n\n&lt;p&gt;Long term: therapy. She can&amp;#39;t possibly argue that she doesn&amp;#39;t need it. I don&amp;#39;t have any advice in the interim though, I&amp;#39;m afraid.&lt;/p&gt;\n\n&lt;p&gt;Medication: she ought to be trying new combos, but it is very difficult side effects wise. If you aren&amp;#39;t already, you need to be in the room with her in appointments.  &lt;/p&gt;\n\n&lt;p&gt;Motivation: she&amp;#39;s so scared of the future that she&amp;#39;s stalled. If she has any ideas of what she&amp;#39;d like to do, try to build on that in any way: How to Get a Job in X Field books, documentaries, etc. Memoirs are good because it&amp;#39;ll show her that people live through this. If she likes food, she might like a YouTube series called &amp;#39;Backburner&amp;#39;, which is about Rosianna Rojas cooking her way through a cookbook whilst struggling with depression and body image issues. The Young Women&amp;#39;s Trust coaching service might be helpful for her at a slightly later stage ( &lt;a href=\"http://www.youngwomenstrust.org/workitoutservice\"&gt;http://www.youngwomenstrust.org/workitoutservice&lt;/a&gt; )&lt;/p&gt;\n\n&lt;p&gt;I really hope you guys pull through this, OP. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9nz20", "score_hidden": false, "stickied": false, "created": 1492228940.0, "created_utc": 1492200140.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dgach6z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SimpleMcflea", "parent_id": "t1_dg9xqk5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you, I will check it out. And yeah, I don't know a lot about the medical system here (I'm from America), so it's hard to figure out which advice is would work here or not.", "edited": 1492235327.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, I will check it out. And yeah, I don&amp;#39;t know a lot about the medical system here (I&amp;#39;m from America), so it&amp;#39;s hard to figure out which advice is would work here or not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgach6z", "score_hidden": false, "stickied": false, "created": 1492263673.0, "created_utc": 1492234873.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9xqk5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aurelie_v", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Many of these comments, though extremely kind and well-meaning, are from Americans who don't understand how mental health care works in the UK. I would strongly advise googling the \"around the dinner table\" forum - although it's primarily for parents and carers of children/young adults with eating disorders, many of the parents are *very* experienced at coping with severe comorbids like anxiety and depression (some have children in inpatient psych units), and there are many, many people there who have immense experience in navigating the UK care system. You will get more specific and personalised advice on how to help your child, and since she is having some problems around food as well, it would be a good idea to get on top of those as soon as you can, before it turns into a full-blown ED. \n\n(I'm a UK-based adult with anorexia and other serious mental health issues; I lurk at \"Around the Dinner Table\" to learn more about recovery, and here to educate myself more about parenting in case I might choose to have a child one day. So: not a fellow parent, but very experienced with the type of issues you mention.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many of these comments, though extremely kind and well-meaning, are from Americans who don&amp;#39;t understand how mental health care works in the UK. I would strongly advise googling the &amp;quot;around the dinner table&amp;quot; forum - although it&amp;#39;s primarily for parents and carers of children/young adults with eating disorders, many of the parents are &lt;em&gt;very&lt;/em&gt; experienced at coping with severe comorbids like anxiety and depression (some have children in inpatient psych units), and there are many, many people there who have immense experience in navigating the UK care system. You will get more specific and personalised advice on how to help your child, and since she is having some problems around food as well, it would be a good idea to get on top of those as soon as you can, before it turns into a full-blown ED. &lt;/p&gt;\n\n&lt;p&gt;(I&amp;#39;m a UK-based adult with anorexia and other serious mental health issues; I lurk at &amp;quot;Around the Dinner Table&amp;quot; to learn more about recovery, and here to educate myself more about parenting in case I might choose to have a child one day. So: not a fellow parent, but very experienced with the type of issues you mention.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9xqk5", "score_hidden": false, "stickied": false, "created": 1492241448.0, "created_utc": 1492212648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9lq7b", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "IsItMyTurnYeti", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Can you have her involuntary admitted to a psych ward at a hospital? My husband did it to me when I attempted suicide and it literally saved my life", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you have her involuntary admitted to a psych ward at a hospital? My husband did it to me when I attempted suicide and it literally saved my life&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9lq7b", "score_hidden": false, "stickied": false, "created": 1492226242.0, "created_utc": 1492197442.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9rsvi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "funchy", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Have you considered having her admitted to an inpatient psych hospital for a little while the next time she hurts herself or threatens to?   It will remove all external variables.   She wont have tv/computer/internet much if at all, so it'll be hard for her to stay awake.   She will have a very structured day with fixed mealtimes and lights out times.   She will get daily therapy sessions - group or solo.   They can adjust her meds until they find whats working best.\n\nBy taking you out of the equation, if she's intentionally refusing or sabotaging treatments to get attention from you or prove you wrong or whatever that incentive is gone.  (Who knows why shes self sabotaging)\n\nIf her behavior in the near future isnt severe enough for an emergency admission to an inpatient program, she needs to be in regular counseling at least weekly - more if insurance allows.   Emphasize to the therapist her history of increasing selfharm.   If she wants to lie or refuse to speak, she goes anyway.   Maybe she needs to see that youll keep taking her even after she's uncooperative, and she'll see youre serious.\n\nSame goes for trying other therapy such as the light.  If she wants to mess it up on day 3, that's fine.   Just start all over from day 1.  It might take a few tries for her to understand that you are serious and it's not going to get her anywhere to sabotage.\n\nI have a friend whose daughter's behavior was having serious issues around that age (self destructive, social problems, diagnosed bipolar and anxiety).  Her mom drove her every week to therapy whether she talked or not.  When she turned 18 she was given the choice of moving out or cooperating with treatment, and she chose treatment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you considered having her admitted to an inpatient psych hospital for a little while the next time she hurts herself or threatens to?   It will remove all external variables.   She wont have tv/computer/internet much if at all, so it&amp;#39;ll be hard for her to stay awake.   She will have a very structured day with fixed mealtimes and lights out times.   She will get daily therapy sessions - group or solo.   They can adjust her meds until they find whats working best.&lt;/p&gt;\n\n&lt;p&gt;By taking you out of the equation, if she&amp;#39;s intentionally refusing or sabotaging treatments to get attention from you or prove you wrong or whatever that incentive is gone.  (Who knows why shes self sabotaging)&lt;/p&gt;\n\n&lt;p&gt;If her behavior in the near future isnt severe enough for an emergency admission to an inpatient program, she needs to be in regular counseling at least weekly - more if insurance allows.   Emphasize to the therapist her history of increasing selfharm.   If she wants to lie or refuse to speak, she goes anyway.   Maybe she needs to see that youll keep taking her even after she&amp;#39;s uncooperative, and she&amp;#39;ll see youre serious.&lt;/p&gt;\n\n&lt;p&gt;Same goes for trying other therapy such as the light.  If she wants to mess it up on day 3, that&amp;#39;s fine.   Just start all over from day 1.  It might take a few tries for her to understand that you are serious and it&amp;#39;s not going to get her anywhere to sabotage.&lt;/p&gt;\n\n&lt;p&gt;I have a friend whose daughter&amp;#39;s behavior was having serious issues around that age (self destructive, social problems, diagnosed bipolar and anxiety).  Her mom drove her every week to therapy whether she talked or not.  When she turned 18 she was given the choice of moving out or cooperating with treatment, and she chose treatment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9rsvi", "score_hidden": false, "stickied": false, "created": 1492233621.0, "created_utc": 1492204821.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg985g8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "LadyGrizabella", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "::hugs::\n\nAs an adult who's suffered from severe anxiety and depression since the age of 10, I feel for her. There are days when I can't even pull myself out of bed because it's just too scary out there in the world. \n\nIf she has a reddit account, have her PM me if she wants. I've been there, done that. I tried suicide twice as a teen--once by overdosing on Nyquil and Tylenol and the second time I swallowed about 30 aspirin and planned to slit my wrists but chickened out when it got to the wrist slitting bit.\n\nI am not a therapist. I'm just someone who's been there and is willing to listen.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;::hugs::&lt;/p&gt;\n\n&lt;p&gt;As an adult who&amp;#39;s suffered from severe anxiety and depression since the age of 10, I feel for her. There are days when I can&amp;#39;t even pull myself out of bed because it&amp;#39;s just too scary out there in the world. &lt;/p&gt;\n\n&lt;p&gt;If she has a reddit account, have her PM me if she wants. I&amp;#39;ve been there, done that. I tried suicide twice as a teen--once by overdosing on Nyquil and Tylenol and the second time I swallowed about 30 aspirin and planned to slit my wrists but chickened out when it got to the wrist slitting bit.&lt;/p&gt;\n\n&lt;p&gt;I am not a therapist. I&amp;#39;m just someone who&amp;#39;s been there and is willing to listen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg985g8", "score_hidden": false, "stickied": false, "created": 1492210391.0, "created_utc": 1492181591.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9inus", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MAXIMUM_FARTING", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Her anxiety is not her fault, but it is her responsibility.\n\nTell her it's her life, but you won't be supporting or enabling it. Set some expectations and make her life incredibly boring and downright uncomfortable until she gets with the program. Point out that she will be an adult soon, and you have no interest supporting her in perpetuity.\n\nShe doesn't want therapy? Fine, but she needs to be getting up and leaving the house every day, whether that be for school or whatever. She won't get up? You're coming in there with the saucepan and spoon and giving her a one-person percussion act until she can't stand it anymore.\n\nShe suddenly decides therapy is the way to go? Great! She's signed up. She doesn't want to go when the appointment rolls around? Plan for the contingency, and outright tell her if she doesn't get in the car you've hired/convinced two people who will make her, and either she can embarrass herself by throwing a fit, or she can go quietly.\n\nShe's at home during the day? No internet, no phone. No books, no TV. She can either get out of the house and go to school, or gets a job, or help at a shelter, but you're not going to make staying put in any way comfortable or easy for her. She can stay home and do chores or stare at a wall. Make sleep not an option, either - every time you catch her sleeping during the day, wake her up. Sleeping is for nighttime, if shes tired, she needs to go to bed at a reasonable hour. \n\nLook, I know this all sounds horrible, but a large part of getting her out of this is making all her comfortable, safe options incredibly tedious and unappealing until she finds a new (hopefully healthier) path of least resistance. \n\nMake it clear - her behaviour is unacceptable, and you've been understanding and gently-gently long enough. Either she seeks treatment or doesn't, but she is the manager of her anxiety, not you, you can't make things better for her but sleeping her life away is not an option because you won't always be there. \n\nAlso, every time she does the Debbie Downer act while helping you or her sister, respond with things like \"I'd rather you try and it all go wrong than you not try at all\" or \"practice is how people get better\". Don't feed into her vortex of low self-worth, redirect it to the positive (trying).\n\nEdit: Or have her committed. She might hate you for a little bit, but she'll probably get over it. And even if she doesn't, which would you prefer - a fully functioning adult daughter who hates you but has a chance of being happy, or this shell of a girl stuck in a spiral of misery? It might be easier for your family to have her in a full time inpatient clinic.", "edited": 1492194420.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Her anxiety is not her fault, but it is her responsibility.&lt;/p&gt;\n\n&lt;p&gt;Tell her it&amp;#39;s her life, but you won&amp;#39;t be supporting or enabling it. Set some expectations and make her life incredibly boring and downright uncomfortable until she gets with the program. Point out that she will be an adult soon, and you have no interest supporting her in perpetuity.&lt;/p&gt;\n\n&lt;p&gt;She doesn&amp;#39;t want therapy? Fine, but she needs to be getting up and leaving the house every day, whether that be for school or whatever. She won&amp;#39;t get up? You&amp;#39;re coming in there with the saucepan and spoon and giving her a one-person percussion act until she can&amp;#39;t stand it anymore.&lt;/p&gt;\n\n&lt;p&gt;She suddenly decides therapy is the way to go? Great! She&amp;#39;s signed up. She doesn&amp;#39;t want to go when the appointment rolls around? Plan for the contingency, and outright tell her if she doesn&amp;#39;t get in the car you&amp;#39;ve hired/convinced two people who will make her, and either she can embarrass herself by throwing a fit, or she can go quietly.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s at home during the day? No internet, no phone. No books, no TV. She can either get out of the house and go to school, or gets a job, or help at a shelter, but you&amp;#39;re not going to make staying put in any way comfortable or easy for her. She can stay home and do chores or stare at a wall. Make sleep not an option, either - every time you catch her sleeping during the day, wake her up. Sleeping is for nighttime, if shes tired, she needs to go to bed at a reasonable hour. &lt;/p&gt;\n\n&lt;p&gt;Look, I know this all sounds horrible, but a large part of getting her out of this is making all her comfortable, safe options incredibly tedious and unappealing until she finds a new (hopefully healthier) path of least resistance. &lt;/p&gt;\n\n&lt;p&gt;Make it clear - her behaviour is unacceptable, and you&amp;#39;ve been understanding and gently-gently long enough. Either she seeks treatment or doesn&amp;#39;t, but she is the manager of her anxiety, not you, you can&amp;#39;t make things better for her but sleeping her life away is not an option because you won&amp;#39;t always be there. &lt;/p&gt;\n\n&lt;p&gt;Also, every time she does the Debbie Downer act while helping you or her sister, respond with things like &amp;quot;I&amp;#39;d rather you try and it all go wrong than you not try at all&amp;quot; or &amp;quot;practice is how people get better&amp;quot;. Don&amp;#39;t feed into her vortex of low self-worth, redirect it to the positive (trying).&lt;/p&gt;\n\n&lt;p&gt;Edit: Or have her committed. She might hate you for a little bit, but she&amp;#39;ll probably get over it. And even if she doesn&amp;#39;t, which would you prefer - a fully functioning adult daughter who hates you but has a chance of being happy, or this shell of a girl stuck in a spiral of misery? It might be easier for your family to have her in a full time inpatient clinic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9inus", "score_hidden": false, "stickied": false, "created": 1492222559.0, "created_utc": 1492193759.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dg9neg5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CH2016", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think you may have to get her sectioned for help could be the best thing you ever did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you may have to get her sectioned for help could be the best thing you ever did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9neg5", "score_hidden": false, "stickied": false, "created": 1492228257.0, "created_utc": 1492199457.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dgb8gih", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Mickey_the_cat", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You can't force therapy on someone. It simply doesn't work that way. Therapy isn't treatment done to someone, it is a two way process, therapist and client working together. It's not like administering medication. \nThe stick isn't going to work. A carrot might. \n\nI would start looking around for resources to help you bring this kid round. Poor girl is obviously deeply troubled. Have you tried seeking advice on some other forums ( UK based) as you see the US advice of inpatient treatment just doesn't apply. \nYour GP will be able to give further help. MIND might be a starting point, Young Minds is the kids' offshoot. \nSounds like she's on betablockers - it may be that the GP and your daughter can have a chat about some more effective meds. \n\nI wish you and her well.  What a hard time for you all. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can&amp;#39;t force therapy on someone. It simply doesn&amp;#39;t work that way. Therapy isn&amp;#39;t treatment done to someone, it is a two way process, therapist and client working together. It&amp;#39;s not like administering medication. \nThe stick isn&amp;#39;t going to work. A carrot might. &lt;/p&gt;\n\n&lt;p&gt;I would start looking around for resources to help you bring this kid round. Poor girl is obviously deeply troubled. Have you tried seeking advice on some other forums ( UK based) as you see the US advice of inpatient treatment just doesn&amp;#39;t apply. \nYour GP will be able to give further help. MIND might be a starting point, Young Minds is the kids&amp;#39; offshoot. \nSounds like she&amp;#39;s on betablockers - it may be that the GP and your daughter can have a chat about some more effective meds. &lt;/p&gt;\n\n&lt;p&gt;I wish you and her well.  What a hard time for you all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb8gih", "score_hidden": false, "stickied": false, "created": 1492322106.0, "created_utc": 1492293306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65biju", "likes": null, "replies": "", "user_reports": [], "id": "dgci236", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Aurelia72", "parent_id": "t3_65biju", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Forcing someone to go to a meeting with a person which is only beneficial when both parties are open and willing to work with one another -- sounds like a brilliant idea. Do you people suggesting such a method not realize how amazingly destructive it would be, never mind useless? Therapy does not start when you pull someone through the office door -- it is when the person chooses to get help themselves, you cannot force a person into such a mindset. \n\nAs someone who was just like your daughter, most of the advice you've gotten here is absolutely terrible. If someone physically threw me into the car and forced me into a therapists's office, I would be completely alienated against both you and any resources you'd attempt to provide. This sounds like a great way to break your daughter's trust and show her that there's absolutely nobody there for her who is truly listening.  \n\n\nDo alternative/therapeutic schools exist near you? You could try speaking to a therapist yourself, telling them what you have here, and see what resources they can direct you towards.   \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Forcing someone to go to a meeting with a person which is only beneficial when both parties are open and willing to work with one another -- sounds like a brilliant idea. Do you people suggesting such a method not realize how amazingly destructive it would be, never mind useless? Therapy does not start when you pull someone through the office door -- it is when the person chooses to get help themselves, you cannot force a person into such a mindset. &lt;/p&gt;\n\n&lt;p&gt;As someone who was just like your daughter, most of the advice you&amp;#39;ve gotten here is absolutely terrible. If someone physically threw me into the car and forced me into a therapists&amp;#39;s office, I would be completely alienated against both you and any resources you&amp;#39;d attempt to provide. This sounds like a great way to break your daughter&amp;#39;s trust and show her that there&amp;#39;s absolutely nobody there for her who is truly listening.  &lt;/p&gt;\n\n&lt;p&gt;Do alternative/therapeutic schools exist near you? You could try speaking to a therapist yourself, telling them what you have here, and see what resources they can direct you towards.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgci236", "score_hidden": false, "stickied": false, "created": 1492402097.0, "created_utc": 1492373297.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]