[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After the birth of our second child (now 2), our oldest daughter&amp;#39;s behavior started to change. We expected some behavioral issues, but her actions seem to be getting worse. &lt;/p&gt;\n\n&lt;p&gt;Our oldest has been hitting herself in face, stating that we hate her, and how she&amp;#39;s such a bad kid. &lt;/p&gt;\n\n&lt;p&gt;For the record, we don&amp;#39;t spank, nor make such comments. Her actions tend to escalate if we correct her, or she feels we&amp;#39;re paying too much attention to her sister. We&amp;#39;ve tried to explain that her sister needs more help at this time in her life, just as she did when she was her age. That said, she doesn&amp;#39;t seem to have the capacity to comprehend this. We&amp;#39;ve also tried to reiterate that we love her, try to spend time with her alone, etc. Currently, we&amp;#39;re trying to ignore her when she says/does these things. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re on a wait list to speak with a counselor, whose earliest appointment is in August. So I thought I&amp;#39;d see if anyone had a similar experience or suggestions. Thanks. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "After the birth of our second child (now 2), our oldest daughter's behavior started to change. We expected some behavioral issues, but her actions seem to be getting worse. \n\nOur oldest has been hitting herself in face, stating that we hate her, and how she's such a bad kid. \n\nFor the record, we don't spank, nor make such comments. Her actions tend to escalate if we correct her, or she feels we're paying too much attention to her sister. We've tried to explain that her sister needs more help at this time in her life, just as she did when she was her age. That said, she doesn't seem to have the capacity to comprehend this. We've also tried to reiterate that we love her, try to spend time with her alone, etc. Currently, we're trying to ignore her when she says/does these things. \n\nWe're on a wait list to speak with a counselor, whose earliest appointment is in August. So I thought I'd see if anyone had a similar experience or suggestions. Thanks. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Behaviour", "id": "65d6nm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "zekielariah", "saved": false, "mod_reports": [], "name": "t3_65d6nm", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "behaviour", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65d6nm/serious_6_year_old_daughters_been_acting_out/", "num_reports": null, "locked": false, "stickied": false, "created": 1492212669.0, "url": "https://www.reddit.com/r/Parenting/comments/65d6nm/serious_6_year_old_daughters_been_acting_out/", "author_flair_text": null, "quarantine": false, "title": "(Serious) 6 year old daughter's been acting out. Anyone have advice?", "created_utc": 1492183869.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": "", "user_reports": [], "id": "dga4ns7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zekielariah", "parent_id": "t1_dg9ewel", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for the insight from your inner child's perspective. I too believe that her behavior is mostly attention seeking. The issue that my wife and I face is trying to find the most productive way to handle it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the insight from your inner child&amp;#39;s perspective. I too believe that her behavior is mostly attention seeking. The issue that my wife and I face is trying to find the most productive way to handle it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dga4ns7", "score_hidden": false, "stickied": false, "created": 1492250819.0, "created_utc": 1492222019.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9ewel", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "master0jack", "parent_id": "t3_65d6nm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She's looking for attention and reassurance. She likely feels that she has done something 'bad' to get less parental attention as compared to her sister. Little kids cant really comprehend the needs of a baby in the same way as adults and olddr children. To her she might feel left out or ignored, so when she says these things she is looking for you to disprove it as well as for your attention. I remember being around her age and my mother rocking my little sister to sleep and singing to her. She would try to keep me out of the room (presumably so that I didn't wake my sister up or disrupt her going to sleep) but of course all it looked like to me was that I desperately wanted to be held and rocked to sleep too or even sang to, and instead I was kicked out (unwanted) and my sister got what I really wanted instead. I remember feeling hurt by this.  \n\nIm not sure how to remedy the situation that you havent already tried, but im just trying to give you some perspective.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s looking for attention and reassurance. She likely feels that she has done something &amp;#39;bad&amp;#39; to get less parental attention as compared to her sister. Little kids cant really comprehend the needs of a baby in the same way as adults and olddr children. To her she might feel left out or ignored, so when she says these things she is looking for you to disprove it as well as for your attention. I remember being around her age and my mother rocking my little sister to sleep and singing to her. She would try to keep me out of the room (presumably so that I didn&amp;#39;t wake my sister up or disrupt her going to sleep) but of course all it looked like to me was that I desperately wanted to be held and rocked to sleep too or even sang to, and instead I was kicked out (unwanted) and my sister got what I really wanted instead. I remember feeling hurt by this.  &lt;/p&gt;\n\n&lt;p&gt;Im not sure how to remedy the situation that you havent already tried, but im just trying to give you some perspective.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9ewel", "score_hidden": false, "stickied": false, "created": 1492218181.0, "created_utc": 1492189381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": "", "user_reports": [], "id": "dga5lag", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zekielariah", "parent_id": "t1_dg9f1mp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Yes, her actions are self directed, both verbally and physically. Also, I agree about the idea of her being older has been a factor regarding her actions. Initially, I thought that that her being older at the time of her sister's birth would be beneficial . Now, I've come to think that since she remembers a time without her sibling, it has actually been harder for her to adjust. Lastly, we have been working on positive reinforcement charts/systems and special events/tasks. However, they do not seem to maintain her interest longer than a few weeks. That said, thank you for you time and input!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, her actions are self directed, both verbally and physically. Also, I agree about the idea of her being older has been a factor regarding her actions. Initially, I thought that that her being older at the time of her sister&amp;#39;s birth would be beneficial . Now, I&amp;#39;ve come to think that since she remembers a time without her sibling, it has actually been harder for her to adjust. Lastly, we have been working on positive reinforcement charts/systems and special events/tasks. However, they do not seem to maintain her interest longer than a few weeks. That said, thank you for you time and input!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dga5lag", "score_hidden": false, "stickied": false, "created": 1492252184.0, "created_utc": 1492223384.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9f1mp", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Giant_Asian_Slackoff", "parent_id": "t3_65d6nm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Just to be clear, are her only problems that she's acting out on *herself?* Hitting herself, saying you hate her, blah blah? Or is she also back talking, not listening to you, etc beyond which is normal for her age?\n\nI've never raised more than a single kid, and even then only from the age of five and up, so I don't know if this is actually true...but from what I understand, it's pretty typical for older kids to start acting out more once they have a younger sibling that takes the focus off them. They feel more ignored since more attention is on the care of the younger child. She was an only child for her whole, short life where your attention was focused solely on her. Now that the attention has been turned all a suddenly on her younger sibling, she might just be feeling ignored. It's nothing you did wrong; it's expected that you give more attention to your youngest at this point in their life and it's hard to be balanced enough for both but lopsided enough to give the youngest the extra attention they need! But it doesn't make her feelings less valid, so try not to dismiss them or anything. Be empathetic.\n\nI have a sneaking suspicion that she's acting out just to get you to pay her some mind. In this circumstance, negative attention &gt; lack of attention to her. The fact that she's saying that you hate her speaks to this, and it's not all that surprising that she might say that she's a bad kid. She's rationalizing that, hey, my parents aren't spending nearly as much time with me as they used to, must be because I'm a bad kid.\n\nIf my suspicions are correct, I'm not sure she necessarily needs counseling. It can't hurt, I suppose, but this seems like something that may pass with time, as both she and her sibling mature. In the meanwhile, I'm afraid I don't have much advice for you besides the patently obvious and the stuff you've already tried - keep reassuring her that you love her, spend some one on one time with her as much as possible - maybe lay out a specific time every day where one plays with her alone at the park or something and the other stays back to watch the little one, and just keep trying to hammer it in that this isn't forever; only until her sibling grows up.\n\nIf she's acting out to *you* i.e. back-talking and whatnot, remember that positive, rewards based reinforcement and problem-solving based discipline (asking her what exactly is bothering her, why she feels the need to misbehave, coming up with solutions in general) tend to work better than punitive measures. And punitive measures only really work well when it's immediate. Come up with a rewards system for when she behaves. Whenever my kid was well behaved, I'd always reward him with *something*. Not so often that he expects it or is spoiled, but enough that he never felt like it was fruitless. Even going out of your way verbally acknowledging a good day and saying how proud you are of them helps. The specifics are up to you, but obviously make sure it's a strong enough incentive to behave but not so strong that that it's disproportionate.", "edited": 1492232542.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just to be clear, are her only problems that she&amp;#39;s acting out on &lt;em&gt;herself?&lt;/em&gt; Hitting herself, saying you hate her, blah blah? Or is she also back talking, not listening to you, etc beyond which is normal for her age?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never raised more than a single kid, and even then only from the age of five and up, so I don&amp;#39;t know if this is actually true...but from what I understand, it&amp;#39;s pretty typical for older kids to start acting out more once they have a younger sibling that takes the focus off them. They feel more ignored since more attention is on the care of the younger child. She was an only child for her whole, short life where your attention was focused solely on her. Now that the attention has been turned all a suddenly on her younger sibling, she might just be feeling ignored. It&amp;#39;s nothing you did wrong; it&amp;#39;s expected that you give more attention to your youngest at this point in their life and it&amp;#39;s hard to be balanced enough for both but lopsided enough to give the youngest the extra attention they need! But it doesn&amp;#39;t make her feelings less valid, so try not to dismiss them or anything. Be empathetic.&lt;/p&gt;\n\n&lt;p&gt;I have a sneaking suspicion that she&amp;#39;s acting out just to get you to pay her some mind. In this circumstance, negative attention &amp;gt; lack of attention to her. The fact that she&amp;#39;s saying that you hate her speaks to this, and it&amp;#39;s not all that surprising that she might say that she&amp;#39;s a bad kid. She&amp;#39;s rationalizing that, hey, my parents aren&amp;#39;t spending nearly as much time with me as they used to, must be because I&amp;#39;m a bad kid.&lt;/p&gt;\n\n&lt;p&gt;If my suspicions are correct, I&amp;#39;m not sure she necessarily needs counseling. It can&amp;#39;t hurt, I suppose, but this seems like something that may pass with time, as both she and her sibling mature. In the meanwhile, I&amp;#39;m afraid I don&amp;#39;t have much advice for you besides the patently obvious and the stuff you&amp;#39;ve already tried - keep reassuring her that you love her, spend some one on one time with her as much as possible - maybe lay out a specific time every day where one plays with her alone at the park or something and the other stays back to watch the little one, and just keep trying to hammer it in that this isn&amp;#39;t forever; only until her sibling grows up.&lt;/p&gt;\n\n&lt;p&gt;If she&amp;#39;s acting out to &lt;em&gt;you&lt;/em&gt; i.e. back-talking and whatnot, remember that positive, rewards based reinforcement and problem-solving based discipline (asking her what exactly is bothering her, why she feels the need to misbehave, coming up with solutions in general) tend to work better than punitive measures. And punitive measures only really work well when it&amp;#39;s immediate. Come up with a rewards system for when she behaves. Whenever my kid was well behaved, I&amp;#39;d always reward him with &lt;em&gt;something&lt;/em&gt;. Not so often that he expects it or is spoiled, but enough that he never felt like it was fruitless. Even going out of your way verbally acknowledging a good day and saying how proud you are of them helps. The specifics are up to you, but obviously make sure it&amp;#39;s a strong enough incentive to behave but not so strong that that it&amp;#39;s disproportionate.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9f1mp", "score_hidden": false, "stickied": false, "created": 1492218347.0, "created_utc": 1492189547.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": "", "user_reports": [], "id": "dgaljq7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cellists_wet_dream", "parent_id": "t1_dga6ykf", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I know it's hard. I give you this advice because it's exactly what my son's therapist has taught me. She also taught me this: kids will only hit themselves hard enough to get attention, not hurt. Even though it may look like your daughter is hurting herself, I can guarantee she's only hitting herself so hard. And like I said, if you're going to ignore, you have to commit to ignoring all the way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it&amp;#39;s hard. I give you this advice because it&amp;#39;s exactly what my son&amp;#39;s therapist has taught me. She also taught me this: kids will only hit themselves hard enough to get attention, not hurt. Even though it may look like your daughter is hurting herself, I can guarantee she&amp;#39;s only hitting herself so hard. And like I said, if you&amp;#39;re going to ignore, you have to commit to ignoring all the way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgaljq7", "score_hidden": false, "stickied": false, "created": 1492288579.0, "created_utc": 1492259779.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dga6ykf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zekielariah", "parent_id": "t1_dg9o7im", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Ignoring her behavior has been my suggested tactic with my wife. That said, it's been hard and awkward to watch my daughter emulate Ed Norton's scene in Fight Club when he punches himself in the face in his supervisor's office, while at the dinner table. We do our best to give positive affirmations regarding her behavior and actions, however we are unable to give as much as she wants. That said, thank you for your thoughts and insight.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ignoring her behavior has been my suggested tactic with my wife. That said, it&amp;#39;s been hard and awkward to watch my daughter emulate Ed Norton&amp;#39;s scene in Fight Club when he punches himself in the face in his supervisor&amp;#39;s office, while at the dinner table. We do our best to give positive affirmations regarding her behavior and actions, however we are unable to give as much as she wants. That said, thank you for your thoughts and insight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dga6ykf", "score_hidden": false, "stickied": false, "created": 1492254140.0, "created_utc": 1492225340.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9o7im", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "cellists_wet_dream", "parent_id": "t3_65d6nm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If you start ignoring a behavior, you have to go all in. That means ignoring it every time, for the whole time.  \n  \nAnd then when it stops, you need to give her lots of labeled praise. That means saying things like, \"I love how calm your body is right now\" or \"I love how gentle you're being with yourself.\" The ignoring is only effective if you follow it up with praise for the exact opposite behavior.  \n  \nThe reason for this is that kids want and need attention. And they deserve it too, for good behavior. If they're being good, even little things like using their walking feet, using their inside voice, asking nicely, eating quietly, sharing toys...whatever-all of those things deserve praise. Yes, every time, whenever you notice them.  \n  \n**You will not spoil a child for praising good behavior and ignoring the bad**. The ignoring is absolutely a punishment. You're withholding exactly what they want from you. And the positive reinforcement is a game changer.  \n  \n  \nFinally, if your daughter is looking for attention, she needs some one-on-one time with you and/or your husband every day if she isn't getting it. Even just five minutes of time where you play alongside her can mean a lot to her. Engaging her in little tasks that help you out and then giving lots of thanks for doing them can also help her feel like she's not an outlier. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you start ignoring a behavior, you have to go all in. That means ignoring it every time, for the whole time.  &lt;/p&gt;\n\n&lt;p&gt;And then when it stops, you need to give her lots of labeled praise. That means saying things like, &amp;quot;I love how calm your body is right now&amp;quot; or &amp;quot;I love how gentle you&amp;#39;re being with yourself.&amp;quot; The ignoring is only effective if you follow it up with praise for the exact opposite behavior.  &lt;/p&gt;\n\n&lt;p&gt;The reason for this is that kids want and need attention. And they deserve it too, for good behavior. If they&amp;#39;re being good, even little things like using their walking feet, using their inside voice, asking nicely, eating quietly, sharing toys...whatever-all of those things deserve praise. Yes, every time, whenever you notice them.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You will not spoil a child for praising good behavior and ignoring the bad&lt;/strong&gt;. The ignoring is absolutely a punishment. You&amp;#39;re withholding exactly what they want from you. And the positive reinforcement is a game changer.  &lt;/p&gt;\n\n&lt;p&gt;Finally, if your daughter is looking for attention, she needs some one-on-one time with you and/or your husband every day if she isn&amp;#39;t getting it. Even just five minutes of time where you play alongside her can mean a lot to her. Engaging her in little tasks that help you out and then giving lots of thanks for doing them can also help her feel like she&amp;#39;s not an outlier. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dg9o7im", "score_hidden": false, "stickied": false, "created": 1492229228.0, "created_utc": 1492200428.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": "", "user_reports": [], "id": "dgarwoy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "istara", "parent_id": "t3_65d6nm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If there are two of you, then only one needs to be paying attention to her sister. The other parent should be paying attention to the older child.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If there are two of you, then only one needs to be paying attention to her sister. The other parent should be paying attention to the older child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgarwoy", "score_hidden": false, "stickied": false, "created": 1492299435.0, "created_utc": 1492270635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65d6nm", "likes": null, "replies": "", "user_reports": [], "id": "dgbvs0a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "irmaleopold", "parent_id": "t3_65d6nm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You might find this article on 'lovebombing' children useful to deal with this type of issue. I agree with the previous poster, she is seeking attention and reassurances that she is still as important to you as her sister. \n\nhttps://www.google.com.au/amp/s/amp.theguardian.com/lifeandstyle/2012/sep/22/oliver-james-love-bombing-children", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might find this article on &amp;#39;lovebombing&amp;#39; children useful to deal with this type of issue. I agree with the previous poster, she is seeking attention and reassurances that she is still as important to you as her sister. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.google.com.au/amp/s/amp.theguardian.com/lifeandstyle/2012/sep/22/oliver-james-love-bombing-children\"&gt;https://www.google.com.au/amp/s/amp.theguardian.com/lifeandstyle/2012/sep/22/oliver-james-love-bombing-children&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbvs0a", "score_hidden": false, "stickied": false, "created": 1492363871.0, "created_utc": 1492335071.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]