[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My daughter has always been difficult. From her first day in this world. She had colic as a baby and is now a &amp;quot;spirited&amp;quot; toddler.&lt;/p&gt;\n\n&lt;p&gt;This girl can throw a fit. She has multiple tantrums a day. For the most part she gets over them pretty fast. But it&amp;#39;s exhausting. This alone doesn&amp;#39;t make me think she is autistic. But she is also speech delayed.&lt;/p&gt;\n\n&lt;p&gt;She does have words, but I would say she is a few months behind. Definitely no stringing words together, won&amp;#39;t repeat after us, she doesn&amp;#39;t even really say &amp;quot;mama&amp;quot; :( she is super stubborn about the words she says. She has maybe 30 words, a lot of them being animal sounds and little things like &amp;quot;yay!&amp;quot; Or &amp;quot;wow&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She does really well at communicating non verbally. She points and makes sounds. She babbles all day long. She takes us by the hand to show us what she wants. She plays with us and includes us heavily in her play. She can be the sweetest thing when she wants to be.&lt;/p&gt;\n\n&lt;p&gt;I go back and forth all the time between thinking she is just a spirited, slightly speech delayed toddler to thinking she MUST have autism. I can&amp;#39;t tell if it&amp;#39;s a gut feeling or just my anxiety running wild.&lt;/p&gt;\n\n&lt;p&gt;Before it is mentioned a million times, I have signed her up for speech therapy. The lady we saw won&amp;#39;t see us until she is 2.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just so worried. Either she needs lots of help or I do. Because I don&amp;#39;t know if it&amp;#39;s her or me that has a problem at this point :(&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My daughter has always been difficult. From her first day in this world. She had colic as a baby and is now a \"spirited\" toddler.\n\nThis girl can throw a fit. She has multiple tantrums a day. For the most part she gets over them pretty fast. But it's exhausting. This alone doesn't make me think she is autistic. But she is also speech delayed.\n\nShe does have words, but I would say she is a few months behind. Definitely no stringing words together, won't repeat after us, she doesn't even really say \"mama\" :( she is super stubborn about the words she says. She has maybe 30 words, a lot of them being animal sounds and little things like \"yay!\" Or \"wow\"\n\nShe does really well at communicating non verbally. She points and makes sounds. She babbles all day long. She takes us by the hand to show us what she wants. She plays with us and includes us heavily in her play. She can be the sweetest thing when she wants to be.\n\nI go back and forth all the time between thinking she is just a spirited, slightly speech delayed toddler to thinking she MUST have autism. I can't tell if it's a gut feeling or just my anxiety running wild.\n\nBefore it is mentioned a million times, I have signed her up for speech therapy. The lady we saw won't see us until she is 2.\n\nI'm just so worried. Either she needs lots of help or I do. Because I don't know if it's her or me that has a problem at this point :(", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Toddler", "id": "65kssq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 21, "report_reasons": null, "author": "babythroz", "saved": false, "mod_reports": [], "name": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "toddler", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65kssq/im_worried_my_22_month_old_daughter_is_autistic/", "num_reports": null, "locked": false, "stickied": false, "created": 1492311816.0, "url": "https://www.reddit.com/r/Parenting/comments/65kssq/im_worried_my_22_month_old_daughter_is_autistic/", "author_flair_text": null, "quarantine": false, "title": "I'm worried my 22 month old daughter is autistic, and it is consuming my life.", "created_utc": 1492283016.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 38, "visited": false, "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb5os3", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "foople", "parent_id": "t1_dgb2ind", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Your brain changes through pregnancy, which increases the bond you have with your baby, and also amps your worry response through the roof.  It's completely normal to worry constantly about pretty much everything relating to your baby.\n     \nThe good news is you don't have to worry today about autism.  Think how much time you'll have now to worry about everything else!\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your brain changes through pregnancy, which increases the bond you have with your baby, and also amps your worry response through the roof.  It&amp;#39;s completely normal to worry constantly about pretty much everything relating to your baby.&lt;/p&gt;\n\n&lt;p&gt;The good news is you don&amp;#39;t have to worry today about autism.  Think how much time you&amp;#39;ll have now to worry about everything else!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb5os3", "score_hidden": false, "stickied": false, "created": 1492318272.0, "created_utc": 1492289472.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbp5fm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SisterRobot", "parent_id": "t1_dgb2ind", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My LO is 2.5\nI felt the same way as you almost identical things I would have said\nIt's now looking like ADHD not autism. Speech delay for sure.\nI'm sick with worry waiting for the full Pediatrician assessment\nI'm also going to go get a psychological assent done on myself because it's hereditary. I don't mean to worry you further but my guts knew something was \"off\" and I wish I'd got the ball rolling sooner. I hate myself for not acting sooner. Waiting lists are long. It feels awful. If something doesn't seem right to you consider new angles. Or maybe you are able to just relax? I sure wish I could ;-)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My LO is 2.5\nI felt the same way as you almost identical things I would have said\nIt&amp;#39;s now looking like ADHD not autism. Speech delay for sure.\nI&amp;#39;m sick with worry waiting for the full Pediatrician assessment\nI&amp;#39;m also going to go get a psychological assent done on myself because it&amp;#39;s hereditary. I don&amp;#39;t mean to worry you further but my guts knew something was &amp;quot;off&amp;quot; and I wish I&amp;#39;d got the ball rolling sooner. I hate myself for not acting sooner. Waiting lists are long. It feels awful. If something doesn&amp;#39;t seem right to you consider new angles. Or maybe you are able to just relax? I sure wish I could ;-)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbp5fm", "score_hidden": false, "stickied": false, "created": 1492346879.0, "created_utc": 1492318079.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2ind", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "babythroz", "parent_id": "t1_dgb1qyg", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Ya, i look at this site every month or two it seems, and she really doesn't fit the description at all. I know it's mostly my anxiety at this point. Man, I thought my anxiety was bad BEFORE kids..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ya, i look at this site every month or two it seems, and she really doesn&amp;#39;t fit the description at all. I know it&amp;#39;s mostly my anxiety at this point. Man, I thought my anxiety was bad BEFORE kids..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb2ind", "score_hidden": false, "stickied": false, "created": 1492313950.0, "created_utc": 1492285150.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1qyg", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "foople", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She sounds like a perfectly happy and healthy toddler. Go through the [autism signs](https://www.autismspeaks.org/what-autism/learn-signs) and from your description she doesn't match even one.  In fact she sounds exactly like my daughter at that age, right down to the animal sounds, word stubbornness and finger leash.\n     \nWe also took her to a speech therapist, because we're just as worried and paranoid as you are (which is normal and healthy behavior for parents!  Or so we think), and it turned out to be completely unnecessary, and somewhat a waste of time, but I'm still happy we did it. Better to do something pointless than skip something necessary. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She sounds like a perfectly happy and healthy toddler. Go through the &lt;a href=\"https://www.autismspeaks.org/what-autism/learn-signs\"&gt;autism signs&lt;/a&gt; and from your description she doesn&amp;#39;t match even one.  In fact she sounds exactly like my daughter at that age, right down to the animal sounds, word stubbornness and finger leash.&lt;/p&gt;\n\n&lt;p&gt;We also took her to a speech therapist, because we&amp;#39;re just as worried and paranoid as you are (which is normal and healthy behavior for parents!  Or so we think), and it turned out to be completely unnecessary, and somewhat a waste of time, but I&amp;#39;m still happy we did it. Better to do something pointless than skip something necessary. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb1qyg", "score_hidden": false, "stickied": false, "created": 1492312923.0, "created_utc": 1492284123.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbc3h4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "babythroz", "parent_id": "t1_dgb99zm", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm actually in Canada, but ya definitely I agree. I am on medication for my anxiety but I know it's time to adjust it. I will look into counselling as well. I know my anxiety is interfering with my parenting and my child doesn't deserve that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m actually in Canada, but ya definitely I agree. I am on medication for my anxiety but I know it&amp;#39;s time to adjust it. I will look into counselling as well. I know my anxiety is interfering with my parenting and my child doesn&amp;#39;t deserve that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbc3h4", "score_hidden": false, "stickied": false, "created": 1492327369.0, "created_utc": 1492298569.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb99zm", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ching_chong_peruna", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt;Either she needs lots of help or I do. Because I don't know if it's her or me that has a problem at this point :(\n\nDoesn't sound like she has a problem to me at all, sounds like a normal toddler. Your paranoia and anxiety, on the other hand, makes me uncomfortable and just reading the way you're describing things makes me kinda sad for some reason. There's something about the culture in the US that makes people super paranoid about their young kids and autism in a way you don't see in other cultures. \n\nYou said you're taking meds and being treated for your anxiety? Do you feel it's sufficient and that the treatment is helpful? Is talk therapy part of treatment? From my experience CBT does wonders - any sort of counseling does, imo. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Either she needs lots of help or I do. Because I don&amp;#39;t know if it&amp;#39;s her or me that has a problem at this point :(&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Doesn&amp;#39;t sound like she has a problem to me at all, sounds like a normal toddler. Your paranoia and anxiety, on the other hand, makes me uncomfortable and just reading the way you&amp;#39;re describing things makes me kinda sad for some reason. There&amp;#39;s something about the culture in the US that makes people super paranoid about their young kids and autism in a way you don&amp;#39;t see in other cultures. &lt;/p&gt;\n\n&lt;p&gt;You said you&amp;#39;re taking meds and being treated for your anxiety? Do you feel it&amp;#39;s sufficient and that the treatment is helpful? Is talk therapy part of treatment? From my experience CBT does wonders - any sort of counseling does, imo. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb99zm", "score_hidden": false, "stickied": false, "created": 1492323253.0, "created_utc": 1492294453.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb19k7", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "genevaduke", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I have no personal experience with autism but speech delay and tantrums alone doesn't equal autism in my mind. She sounds very interactive which my understanding of autism is not the case. What does your peditrician say? I would think speech delay could just be a separate issue on to itself. Tantrums could be a side effect of speech delay because she is having issues communicating too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have no personal experience with autism but speech delay and tantrums alone doesn&amp;#39;t equal autism in my mind. She sounds very interactive which my understanding of autism is not the case. What does your peditrician say? I would think speech delay could just be a separate issue on to itself. Tantrums could be a side effect of speech delay because she is having issues communicating too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb19k7", "score_hidden": false, "stickied": false, "created": 1492312286.0, "created_utc": 1492283486.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb4acu", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "athaliah", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Nothing about this sounds like autism, she sounds like a toddler. As for the speech thing, my daughter didn't speak until she was almost 2. At 22 months she couldnt talk. By her 2 year checkup she was finally mirroring words and within a few weeks speaking full sentences. Thats how fast a kid's ability to speak can change. So just bc she's not speaking well right now doesn't mean she won't and there's something wrong. If your doctor said it's fine to wait, it is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing about this sounds like autism, she sounds like a toddler. As for the speech thing, my daughter didn&amp;#39;t speak until she was almost 2. At 22 months she couldnt talk. By her 2 year checkup she was finally mirroring words and within a few weeks speaking full sentences. Thats how fast a kid&amp;#39;s ability to speak can change. So just bc she&amp;#39;s not speaking well right now doesn&amp;#39;t mean she won&amp;#39;t and there&amp;#39;s something wrong. If your doctor said it&amp;#39;s fine to wait, it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb4acu", "score_hidden": false, "stickied": false, "created": 1492316373.0, "created_utc": 1492287573.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgblt94", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "georgia2017", "parent_id": "t1_dgb2ahp", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Your therapist was trying to figure out your daughters receptive language abilities. You should be able to get a formal written report for the evaluation, even if you don't pursue any form of speech therapy. Honestly it sounds like your daughter is fine but you might need to see a therapist. I sympathize, I went through the same thing until my kid started talking. My doctors brushed us off as well and now that I'm looking back on it, I'm kicking myself for not getting help for my unchecked anxiety and not being able to relax and just enjoy my son (who is totally fine by the way, despite my endless hours of googling). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your therapist was trying to figure out your daughters receptive language abilities. You should be able to get a formal written report for the evaluation, even if you don&amp;#39;t pursue any form of speech therapy. Honestly it sounds like your daughter is fine but you might need to see a therapist. I sympathize, I went through the same thing until my kid started talking. My doctors brushed us off as well and now that I&amp;#39;m looking back on it, I&amp;#39;m kicking myself for not getting help for my unchecked anxiety and not being able to relax and just enjoy my son (who is totally fine by the way, despite my endless hours of googling). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgblt94", "score_hidden": false, "stickied": false, "created": 1492341390.0, "created_utc": 1492312590.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2ahp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "babythroz", "parent_id": "t1_dgb1q6t", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Ya, this speech therapist was a total dud. She did nothing but tell me she will contact me after she turns 2. She also kept trying to make her pick out toy vegetables by name when all she wanted to do was play with the dinosaur toys. I have mentioned it to her doctor and they all just kind of brush me off. I do plan on self referring to a private speech therapist and hopefully we can get in soon.\n\nIs the MCCHAT the test on the autism website? I have taken that and it said she has one or two markers, which basically meant she is most likely fine.\n\nI do have anxiety and I am on medication. I know I need to talk to my doctor more about my concerns about my daughter and myself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ya, this speech therapist was a total dud. She did nothing but tell me she will contact me after she turns 2. She also kept trying to make her pick out toy vegetables by name when all she wanted to do was play with the dinosaur toys. I have mentioned it to her doctor and they all just kind of brush me off. I do plan on self referring to a private speech therapist and hopefully we can get in soon.&lt;/p&gt;\n\n&lt;p&gt;Is the MCCHAT the test on the autism website? I have taken that and it said she has one or two markers, which basically meant she is most likely fine.&lt;/p&gt;\n\n&lt;p&gt;I do have anxiety and I am on medication. I know I need to talk to my doctor more about my concerns about my daughter and myself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb2ahp", "score_hidden": false, "stickied": false, "created": 1492313648.0, "created_utc": 1492284848.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1q6t", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "georgia2017", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "First of all, what were the results of her speech assessment? There's an index that the therapist uses to tell you where your child is at. If your therapist didn't do an assessment, you need to find a new one or have your pediatrician refer you. There is no reputable therapist that won't work with you only after 2 if there actually is an issue. \nSecond, does your pediatrician screen for autism? There's usually a big checkup at 18 months and a test called the MCHAT. You can even take the test at home and bring the results with you to discuss with your doctor.\nThird, you might have anxiety. Dealing with spirited kids is really really hard. It doesn't mean there's anything wrong with them but they don't generally respond to regular methods of parenting, you've got the figure out your own methods. You're also entering the terrible twos and that's not helping. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First of all, what were the results of her speech assessment? There&amp;#39;s an index that the therapist uses to tell you where your child is at. If your therapist didn&amp;#39;t do an assessment, you need to find a new one or have your pediatrician refer you. There is no reputable therapist that won&amp;#39;t work with you only after 2 if there actually is an issue. \nSecond, does your pediatrician screen for autism? There&amp;#39;s usually a big checkup at 18 months and a test called the MCHAT. You can even take the test at home and bring the results with you to discuss with your doctor.\nThird, you might have anxiety. Dealing with spirited kids is really really hard. It doesn&amp;#39;t mean there&amp;#39;s anything wrong with them but they don&amp;#39;t generally respond to regular methods of parenting, you&amp;#39;ve got the figure out your own methods. You&amp;#39;re also entering the terrible twos and that&amp;#39;s not helping. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb1q6t", "score_hidden": false, "stickied": false, "created": 1492312893.0, "created_utc": 1492284093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb4171", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "esmereldas", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Call early intervention of you live in the US.  An evaluation is free as is an autism test at least in my state.   I am almost positive my son is autistic and we have an appointment autism test soon.  He is  very calm, sweet, loving, and fun.  He doesnt talk besides mama and dada and rarely responds to his name, although he has good eye contact and is very responsive to play. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call early intervention of you live in the US.  An evaluation is free as is an autism test at least in my state.   I am almost positive my son is autistic and we have an appointment autism test soon.  He is  very calm, sweet, loving, and fun.  He doesnt talk besides mama and dada and rarely responds to his name, although he has good eye contact and is very responsive to play. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb4171", "score_hidden": false, "stickied": false, "created": 1492316029.0, "created_utc": 1492287229.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb61sq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "lysskin", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Your daughter sounds just like my son at that age, except she has a few more words. My son didn't say Mama until a few weeks after he turned two.\n\nI'm not sure about your location, but our area had an early intervention program that was facilitated by the school district. He started speech at 11 months because he hadn't started babbling yet. It was just one person coming to our house and working with him for an hour once a week. I'm not sure it did much good until he turned 2 and was able to start in a small group of kids. They did lots of routine and turn taking and songs plus a small craft and snack. \n\nAround 2 and a half his speech just seemed to explode. As his vocabulary took off and he could communicate his needs more the tantrums lessened by a lot. He still has outbursts, but they are less frequent which allows me to have a bit more patience for him. \n\nHe is getting close to his third birthday now and he is still somewhat behind. At 3 he will transition to the public school speech program.\n\nTake care of yourself. It's a lot easier to deal with tantrums when you can get a break. Look into your public school and see if they have anything to offer for evaluations. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your daughter sounds just like my son at that age, except she has a few more words. My son didn&amp;#39;t say Mama until a few weeks after he turned two.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure about your location, but our area had an early intervention program that was facilitated by the school district. He started speech at 11 months because he hadn&amp;#39;t started babbling yet. It was just one person coming to our house and working with him for an hour once a week. I&amp;#39;m not sure it did much good until he turned 2 and was able to start in a small group of kids. They did lots of routine and turn taking and songs plus a small craft and snack. &lt;/p&gt;\n\n&lt;p&gt;Around 2 and a half his speech just seemed to explode. As his vocabulary took off and he could communicate his needs more the tantrums lessened by a lot. He still has outbursts, but they are less frequent which allows me to have a bit more patience for him. &lt;/p&gt;\n\n&lt;p&gt;He is getting close to his third birthday now and he is still somewhat behind. At 3 he will transition to the public school speech program.&lt;/p&gt;\n\n&lt;p&gt;Take care of yourself. It&amp;#39;s a lot easier to deal with tantrums when you can get a break. Look into your public school and see if they have anything to offer for evaluations. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb61sq", "score_hidden": false, "stickied": false, "created": 1492318772.0, "created_utc": 1492289972.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbatuh", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stev0supreemo", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm just going to continue repeating what everyone else has said, this does not sound like autism.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m just going to continue repeating what everyone else has said, this does not sound like autism.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbatuh", "score_hidden": false, "stickied": false, "created": 1492325518.0, "created_utc": 1492296718.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbf6c3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "failmom", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I will also chime in and say it doesnt sound like autism. My oldest has ASD and he was completely non responsive to language. A speech therapist was willing to work with him at 18 months but he didnt talk till three and even then it was just repeating numbers. \n\nBut, even if it is autism its not always as extreme as you initially think. My son was severe. Now at nearly 7 he isnt behind at all. Still a bit socially awkward but you'd never guess he was the boy with autism in a class. So, just keep your eye on it. If you are still concerned after some time has passed get another opinion ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I will also chime in and say it doesnt sound like autism. My oldest has ASD and he was completely non responsive to language. A speech therapist was willing to work with him at 18 months but he didnt talk till three and even then it was just repeating numbers. &lt;/p&gt;\n\n&lt;p&gt;But, even if it is autism its not always as extreme as you initially think. My son was severe. Now at nearly 7 he isnt behind at all. Still a bit socially awkward but you&amp;#39;d never guess he was the boy with autism in a class. So, just keep your eye on it. If you are still concerned after some time has passed get another opinion &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbf6c3", "score_hidden": false, "stickied": false, "created": 1492331733.0, "created_utc": 1492302933.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb48v6", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "r131313", "parent_id": "t1_dgb2p9d", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; I have brought it up to her doctor a couple times. He is very quick to brush things off, which is why I self referred to a speech therapist. \n\n\n&gt; this speech therapist was a total dud. She did nothing but tell me she will contact me after she turns 2. She also kept trying to make her pick out toy vegetables by name when all she wanted to do was play with the dinosaur toys.\n\nPlease don't take this as a slight... but you may want to consider the fact that these doctors brushed you off because there isn't any real problem to address. None of us were in the room with you, obviously, so we can't know what was said or how. I admit, it's entirely possible that they were terrible doctors and truly gave you the brush off... but I'm willing to bet they told you you had little to worry about at this point, and to just keep doing what you are doing. \n\nThese doctors, after all, are professionals, and experts in their fields. They've trained extensively to identify and treat the very issues you are concerned about. There is no one better equipped or qualified to diagnose autism or speech delay. While I fully admit that not all doctors are \"good doctors,\" and there are, inevitably, some truly terrible doctors, most are, at the very least competent... or at least competent enough to diagnose an obvious case. \n\nAlso consider that you saw two different doctors, and neither seemed concerned. What are the chances that both of these doctors were actual \"bad doctors\"? Not all that likely, I'd imagine. One? Sure. Two? The odds of that seem very low.\n\nAgain, I'm not trying to attack you, or even necessarily saying you are wrong. As someone with self admitted anxiety, though, I'm just trying to show you an alternative possible viewpoint. \n\nRaising kids is tough, and even gives those of us with no history of it anxiety. Are you currently in any kind of treatment for your anxiety? I'm not saying you need it (I wouldn't know, I don't know you, obviously)... but a consult with a therapist never hurt anyone. They might be a good, objective third party to bounce this off of, and get a fresh perspective. \n\nIn the end, you might be right on the money in regard to your child... but it's possible it's just the anxiety talking... All kids are different, and it's possible she is just very stubborn. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have brought it up to her doctor a couple times. He is very quick to brush things off, which is why I self referred to a speech therapist. &lt;/p&gt;\n\n&lt;p&gt;this speech therapist was a total dud. She did nothing but tell me she will contact me after she turns 2. She also kept trying to make her pick out toy vegetables by name when all she wanted to do was play with the dinosaur toys.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Please don&amp;#39;t take this as a slight... but you may want to consider the fact that these doctors brushed you off because there isn&amp;#39;t any real problem to address. None of us were in the room with you, obviously, so we can&amp;#39;t know what was said or how. I admit, it&amp;#39;s entirely possible that they were terrible doctors and truly gave you the brush off... but I&amp;#39;m willing to bet they told you you had little to worry about at this point, and to just keep doing what you are doing. &lt;/p&gt;\n\n&lt;p&gt;These doctors, after all, are professionals, and experts in their fields. They&amp;#39;ve trained extensively to identify and treat the very issues you are concerned about. There is no one better equipped or qualified to diagnose autism or speech delay. While I fully admit that not all doctors are &amp;quot;good doctors,&amp;quot; and there are, inevitably, some truly terrible doctors, most are, at the very least competent... or at least competent enough to diagnose an obvious case. &lt;/p&gt;\n\n&lt;p&gt;Also consider that you saw two different doctors, and neither seemed concerned. What are the chances that both of these doctors were actual &amp;quot;bad doctors&amp;quot;? Not all that likely, I&amp;#39;d imagine. One? Sure. Two? The odds of that seem very low.&lt;/p&gt;\n\n&lt;p&gt;Again, I&amp;#39;m not trying to attack you, or even necessarily saying you are wrong. As someone with self admitted anxiety, though, I&amp;#39;m just trying to show you an alternative possible viewpoint. &lt;/p&gt;\n\n&lt;p&gt;Raising kids is tough, and even gives those of us with no history of it anxiety. Are you currently in any kind of treatment for your anxiety? I&amp;#39;m not saying you need it (I wouldn&amp;#39;t know, I don&amp;#39;t know you, obviously)... but a consult with a therapist never hurt anyone. They might be a good, objective third party to bounce this off of, and get a fresh perspective. &lt;/p&gt;\n\n&lt;p&gt;In the end, you might be right on the money in regard to your child... but it&amp;#39;s possible it&amp;#39;s just the anxiety talking... All kids are different, and it&amp;#39;s possible she is just very stubborn. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb48v6", "score_hidden": false, "stickied": false, "created": 1492316316.0, "created_utc": 1492287516.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbaah2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "annafirtree", "parent_id": "t1_dgb3ft1", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My daughter also was delayed in her speech when she was 1. I tried to have her evaluated, and like in your case, the therapist said they couldn't even properly evaluate her until after she was two. It was frustrating at the time—but just a few months later, when my daughter turned two, she was starting to say a few real words consistently and expand her vocabulary. I think she was still a bit behind for a little while, but by then it was clear she was catching up quickly and soon she was normal for her age.\n\nSo there's good reasons both the doc and speech therapist wait until 2 to deal with speech things. Relax on the anxiety about it as much as you can.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My daughter also was delayed in her speech when she was 1. I tried to have her evaluated, and like in your case, the therapist said they couldn&amp;#39;t even properly evaluate her until after she was two. It was frustrating at the time—but just a few months later, when my daughter turned two, she was starting to say a few real words consistently and expand her vocabulary. I think she was still a bit behind for a little while, but by then it was clear she was catching up quickly and soon she was normal for her age.&lt;/p&gt;\n\n&lt;p&gt;So there&amp;#39;s good reasons both the doc and speech therapist wait until 2 to deal with speech things. Relax on the anxiety about it as much as you can.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbaah2", "score_hidden": false, "stickied": false, "created": 1492324726.0, "created_utc": 1492295926.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb3ft1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "babythroz", "parent_id": "t1_dgb33bt", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Very very true. I think my anxiety is definitely a big part of this and something I know I need help with to get under control.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very very true. I think my anxiety is definitely a big part of this and something I know I need help with to get under control.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb3ft1", "score_hidden": false, "stickied": false, "created": 1492315198.0, "created_utc": 1492286398.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb33bt", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "waterbuffalo750", "parent_id": "t1_dgb2p9d", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Yeah, I get that it's frustrating, but the internet is a big place, you can read whatever you want to read. When her doctor and speech therapist are on exactly the same page, I'd definitely defer to them over anything you read on the internet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I get that it&amp;#39;s frustrating, but the internet is a big place, you can read whatever you want to read. When her doctor and speech therapist are on exactly the same page, I&amp;#39;d definitely defer to them over anything you read on the internet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb33bt", "score_hidden": false, "stickied": false, "created": 1492314721.0, "created_utc": 1492285921.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2p9d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "babythroz", "parent_id": "t1_dgb20f9", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We do discipline her, she has seriously been this way since she was tiny. What works for other kids doesn't really work for her. She wears her emotions on her sleeve and everyone knows exactly how she feels.\n\nI have brought it up to her doctor a couple times. He is very quick to brush things off, which is why I self referred to a speech therapist. Her doctor said the same thing, they wait until 2 to deal with speech things. But from everything I've read it says the earlier the better, so it's a little frustrating.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We do discipline her, she has seriously been this way since she was tiny. What works for other kids doesn&amp;#39;t really work for her. She wears her emotions on her sleeve and everyone knows exactly how she feels.&lt;/p&gt;\n\n&lt;p&gt;I have brought it up to her doctor a couple times. He is very quick to brush things off, which is why I self referred to a speech therapist. Her doctor said the same thing, they wait until 2 to deal with speech things. But from everything I&amp;#39;ve read it says the earlier the better, so it&amp;#39;s a little frustrating.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb2p9d", "score_hidden": false, "stickied": false, "created": 1492314200.0, "created_utc": 1492285400.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb20f9", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "waterbuffalo750", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I wouldn't worry just yet. To be honest, on this sub \"spirited\" is usually a fun way to say \"undisciplined.\"  Is there any truth to that in your case?  Also, the trained professional speech therapist doesn't want to see her until she's 2? I'd assume that means that the therapist can't even tell if there's a problem before then. There's nothing to fix. Also, did you bring these concerns up to your child's pediatrician?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t worry just yet. To be honest, on this sub &amp;quot;spirited&amp;quot; is usually a fun way to say &amp;quot;undisciplined.&amp;quot;  Is there any truth to that in your case?  Also, the trained professional speech therapist doesn&amp;#39;t want to see her until she&amp;#39;s 2? I&amp;#39;d assume that means that the therapist can&amp;#39;t even tell if there&amp;#39;s a problem before then. There&amp;#39;s nothing to fix. Also, did you bring these concerns up to your child&amp;#39;s pediatrician?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb20f9", "score_hidden": false, "stickied": false, "created": 1492313276.0, "created_utc": 1492284476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb9d6k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ZenMommy", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The frustration and tantrums are a perfectly normal response to a speech delay. It's very frustrating having all these thoughts in your head and not being able to communicate them! \n\nHang in there until speech therapy. Until then, do lots of reading and singing, dancing, clapping, and just getting lots of practice making sounds, speaking in rythym, and exposure to music. Neurologically, music is of course very supportive of speech. Try basic sign language for things like food, tired, feeling words, etc to see if it helps with the frustration. \n\nNo one will diagnose a child, unless it's very obvious, until around 5 years old, because pretty much every 2 year old is an autistic, sociopathic, adorable monster, at least some of the times. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The frustration and tantrums are a perfectly normal response to a speech delay. It&amp;#39;s very frustrating having all these thoughts in your head and not being able to communicate them! &lt;/p&gt;\n\n&lt;p&gt;Hang in there until speech therapy. Until then, do lots of reading and singing, dancing, clapping, and just getting lots of practice making sounds, speaking in rythym, and exposure to music. Neurologically, music is of course very supportive of speech. Try basic sign language for things like food, tired, feeling words, etc to see if it helps with the frustration. &lt;/p&gt;\n\n&lt;p&gt;No one will diagnose a child, unless it&amp;#39;s very obvious, until around 5 years old, because pretty much every 2 year old is an autistic, sociopathic, adorable monster, at least some of the times. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb9d6k", "score_hidden": false, "stickied": false, "created": 1492323377.0, "created_utc": 1492294577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb9s1e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PyramidHeadOnAStick", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "First.... Breath. Ok, now, do it again. Big breath. Good!   \n\nYour kid is ok. Mine didn't want to talk or repeat anything till she was 2 and a half. She is now 3 and talks all the time. Words are not pronounced correctly but she is using them. When she wants to, her terms, not mine. That is ok. My kid is high energy and works in logic. I avoid 95%of her tantrums if I tell her what's going to happen. For example: ok baby, we are going to eat a snack, then watch an episode of paw patrol, then bed for nap time, ok?  I ask for confirmation at the end and I might get it or not, this is also ok. After snack:ok baby, one episode of paw patrol, then bed for nap time, ok?. Before the episode ends: after this episode, nap time. After the episode everything gets turn off and to bed. I have a high success rate and she sometimes cry because nap time is not fun but gets over it quickly. Maybe narrating your babies day might work for you. Also, try to do an out door thing with your kid a day. They get cabin fever a lot quicker than we do and affects their mood.   \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First.... Breath. Ok, now, do it again. Big breath. Good!   &lt;/p&gt;\n\n&lt;p&gt;Your kid is ok. Mine didn&amp;#39;t want to talk or repeat anything till she was 2 and a half. She is now 3 and talks all the time. Words are not pronounced correctly but she is using them. When she wants to, her terms, not mine. That is ok. My kid is high energy and works in logic. I avoid 95%of her tantrums if I tell her what&amp;#39;s going to happen. For example: ok baby, we are going to eat a snack, then watch an episode of paw patrol, then bed for nap time, ok?  I ask for confirmation at the end and I might get it or not, this is also ok. After snack:ok baby, one episode of paw patrol, then bed for nap time, ok?. Before the episode ends: after this episode, nap time. After the episode everything gets turn off and to bed. I have a high success rate and she sometimes cry because nap time is not fun but gets over it quickly. Maybe narrating your babies day might work for you. Also, try to do an out door thing with your kid a day. They get cabin fever a lot quicker than we do and affects their mood.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb9s1e", "score_hidden": false, "stickied": false, "created": 1492323972.0, "created_utc": 1492295172.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbgdxl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "littleln", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If you are worried take her to a developmental pediatrician or child psychologist. My daughter is autistic and was more obviously so at that age and honestly she's really doing ok. It's not necessarily some huge dire problem. Really don't worry so much, instead focus on getting a diagnosis and in the meantime enjoy your kid. They're only young once.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you are worried take her to a developmental pediatrician or child psychologist. My daughter is autistic and was more obviously so at that age and honestly she&amp;#39;s really doing ok. It&amp;#39;s not necessarily some huge dire problem. Really don&amp;#39;t worry so much, instead focus on getting a diagnosis and in the meantime enjoy your kid. They&amp;#39;re only young once.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbgdxl", "score_hidden": false, "stickied": false, "created": 1492333435.0, "created_utc": 1492304635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgblorl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "britt5689", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She's not autistic. My son was speech delayed due to unknown hearing issues.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s not autistic. My son was speech delayed due to unknown hearing issues.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgblorl", "score_hidden": false, "stickied": false, "created": 1492341200.0, "created_utc": 1492312400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbmlw5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LadyGrizabella", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; Either she needs lots of help or I do. Because I don't know if it's her or me that has a problem at this point :(\n\nCould be either one of you, could be both. It couldn't hurt to get yourself into counseling and get her into speech therapy.\n\nAs the mother of a child with \"high special needs\" (including autism), let me say this.\n\n\nAutism is not a dirty word.\n\nAutism is not a death sentence.\n\nAutism is not something you did to your child on purpose with vaccines, nonorganic food or anything else. It is (at least in my belief) probably 95% genetic and maybe 5% environmental.\n\nAutism is just a word. It is a word that lets people know your daughter needs help in a special way. It is not bad or good. It's just a word. A word that does not have the power to hurt you unless you let it.\n\nIf you suspect she's autistic, then have her tested although they may not be able to give you a definite diagnosis at this age. Since you're going to need to get her tested for autism anyway (to ease your mind if nothing else), have them throw every test in the book at her to see what sticks. That way you know exactly what you're dealing with so you can educate yourself and be better able to help her deal with whatever it she's got going on.\n\nIs raising a special needs child hard? Oh hell yes. Is it also rewarding and sometimes fun? Absofuckinglutely.\n\nPM if you need to. Been there, done that, got the scars.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Either she needs lots of help or I do. Because I don&amp;#39;t know if it&amp;#39;s her or me that has a problem at this point :(&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Could be either one of you, could be both. It couldn&amp;#39;t hurt to get yourself into counseling and get her into speech therapy.&lt;/p&gt;\n\n&lt;p&gt;As the mother of a child with &amp;quot;high special needs&amp;quot; (including autism), let me say this.&lt;/p&gt;\n\n&lt;p&gt;Autism is not a dirty word.&lt;/p&gt;\n\n&lt;p&gt;Autism is not a death sentence.&lt;/p&gt;\n\n&lt;p&gt;Autism is not something you did to your child on purpose with vaccines, nonorganic food or anything else. It is (at least in my belief) probably 95% genetic and maybe 5% environmental.&lt;/p&gt;\n\n&lt;p&gt;Autism is just a word. It is a word that lets people know your daughter needs help in a special way. It is not bad or good. It&amp;#39;s just a word. A word that does not have the power to hurt you unless you let it.&lt;/p&gt;\n\n&lt;p&gt;If you suspect she&amp;#39;s autistic, then have her tested although they may not be able to give you a definite diagnosis at this age. Since you&amp;#39;re going to need to get her tested for autism anyway (to ease your mind if nothing else), have them throw every test in the book at her to see what sticks. That way you know exactly what you&amp;#39;re dealing with so you can educate yourself and be better able to help her deal with whatever it she&amp;#39;s got going on.&lt;/p&gt;\n\n&lt;p&gt;Is raising a special needs child hard? Oh hell yes. Is it also rewarding and sometimes fun? Absofuckinglutely.&lt;/p&gt;\n\n&lt;p&gt;PM if you need to. Been there, done that, got the scars.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbmlw5", "score_hidden": false, "stickied": false, "created": 1492342621.0, "created_utc": 1492313821.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbnwh2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Junipermuse", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm an early intervention therapist. I work with kids with speech delays, autism, and other developmental delays. Honestly, 30 words before two years old probably wouldn't even qualify for speech through early intervention. As far as autism goes, do you know the red flags to look for? Does she make eye contact? Does she have any odd repetitive behaviors or gestures? Does she play in a variety of ways or does she get stuck in one particular activity or action? Does she have any extreme sensory needs or sensitivities? Does she greets people with out prompting? Does she notice changes in the environment?  Tantrums are pretty typical for kiddos that don't have a lot of words yet. She sounds like a pretty typical kiddo to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an early intervention therapist. I work with kids with speech delays, autism, and other developmental delays. Honestly, 30 words before two years old probably wouldn&amp;#39;t even qualify for speech through early intervention. As far as autism goes, do you know the red flags to look for? Does she make eye contact? Does she have any odd repetitive behaviors or gestures? Does she play in a variety of ways or does she get stuck in one particular activity or action? Does she have any extreme sensory needs or sensitivities? Does she greets people with out prompting? Does she notice changes in the environment?  Tantrums are pretty typical for kiddos that don&amp;#39;t have a lot of words yet. She sounds like a pretty typical kiddo to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbnwh2", "score_hidden": false, "stickied": false, "created": 1492344703.0, "created_utc": 1492315903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbp3me", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cordial_carbonara", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If you want anecdotes, you are 100% describing my second child. She was a horribly miserable, colicky baby. As a toddler, she was very hot/cold. She was either very happy or throwing a fit. Her speech was nonexistent at that age, beyond a handful of words, but she was always very clear about her needs through some excellent body language.  \n\nShe will turn 4 in July, and she is an awesome kid. She is not autistic, she is still a bit high strung but otherwise extremely well behaved. She's such a gentle and sweet soul. Her speech is very slightly delayed, but not enough to warrant therapy yet. She'll start pre-k in August, and the plan is that at the halfway point through the school year we'll reevaluate and see where she is with her speech and if she should start therapy. She's happy and healthy and her smile lights up a room, and I am a seriously proud mama.  \n\nYou need to take a breath. A good, long, deep breath, at least three times a day from now on. And talk to someone about getting your anxiety treated. Your daughter sounds like a perfectly normal toddler, as all the health professionals you've talked to have told you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you want anecdotes, you are 100% describing my second child. She was a horribly miserable, colicky baby. As a toddler, she was very hot/cold. She was either very happy or throwing a fit. Her speech was nonexistent at that age, beyond a handful of words, but she was always very clear about her needs through some excellent body language.  &lt;/p&gt;\n\n&lt;p&gt;She will turn 4 in July, and she is an awesome kid. She is not autistic, she is still a bit high strung but otherwise extremely well behaved. She&amp;#39;s such a gentle and sweet soul. Her speech is very slightly delayed, but not enough to warrant therapy yet. She&amp;#39;ll start pre-k in August, and the plan is that at the halfway point through the school year we&amp;#39;ll reevaluate and see where she is with her speech and if she should start therapy. She&amp;#39;s happy and healthy and her smile lights up a room, and I am a seriously proud mama.  &lt;/p&gt;\n\n&lt;p&gt;You need to take a breath. A good, long, deep breath, at least three times a day from now on. And talk to someone about getting your anxiety treated. Your daughter sounds like a perfectly normal toddler, as all the health professionals you&amp;#39;ve talked to have told you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbp3me", "score_hidden": false, "stickied": false, "created": 1492346786.0, "created_utc": 1492317986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbpnku", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "animalpack", "parent_id": "t1_dgbpkae", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Also, my ped has said my kid is ADHD. They don't diagnose at 3 but shes very, very on the go all the time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, my ped has said my kid is ADHD. They don&amp;#39;t diagnose at 3 but shes very, very on the go all the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbpnku", "score_hidden": false, "stickied": false, "created": 1492347804.0, "created_utc": 1492319004.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbpkae", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "animalpack", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm right with you. My speech-delayed, \"spirited\" 3 year old is EXHAUSTING. She never slept as a baby after about a year old and that was my clue. Even though she was high needs as an infant.I thought she was autistic but has been diagnosed as globally delayed  (speech and concepts) and demonstrates sensory processing disorder, both under and over. \n\nYou need speech intervention stat. Also try a new pediatrician if you aren't having your concerns met. My ped did a quick in office exam and questionnaire for autism and my kid didn't fit that bill. But she needed speech and we started at 18 months.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m right with you. My speech-delayed, &amp;quot;spirited&amp;quot; 3 year old is EXHAUSTING. She never slept as a baby after about a year old and that was my clue. Even though she was high needs as an infant.I thought she was autistic but has been diagnosed as globally delayed  (speech and concepts) and demonstrates sensory processing disorder, both under and over. &lt;/p&gt;\n\n&lt;p&gt;You need speech intervention stat. Also try a new pediatrician if you aren&amp;#39;t having your concerns met. My ped did a quick in office exam and questionnaire for autism and my kid didn&amp;#39;t fit that bill. But she needed speech and we started at 18 months.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbpkae", "score_hidden": false, "stickied": false, "created": 1492347639.0, "created_utc": 1492318839.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgbsxgl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "8monthsthrowaway", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Go to a different speech pathologist. Early intervention is key and this one who won't see her yet is whacko. Is there a regional center in your area, like in my area it's Alta Regional? They can help with services for kids under three. \n\nHave you looked at a DVSM5 to see the diagnostic criteria for autism? Keep in mind, it's a spectrum, so the symptoms can vary. Have you talked to your pediatrician?  They usually say wait and see, at least that's what we were taught. Here are some links:  \n\nhttps://www.cdc.gov/ncbddd/autism/hcp-dsm.html\n\nhttps://www.google.com/amp/s/health.clevelandclinic.org/2012/08/what-is-and-is-not-autism/amp/\n\nI hope this helps. \n\nSource: am Speech Language Pathologist ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to a different speech pathologist. Early intervention is key and this one who won&amp;#39;t see her yet is whacko. Is there a regional center in your area, like in my area it&amp;#39;s Alta Regional? They can help with services for kids under three. &lt;/p&gt;\n\n&lt;p&gt;Have you looked at a DVSM5 to see the diagnostic criteria for autism? Keep in mind, it&amp;#39;s a spectrum, so the symptoms can vary. Have you talked to your pediatrician?  They usually say wait and see, at least that&amp;#39;s what we were taught. Here are some links:  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.cdc.gov/ncbddd/autism/hcp-dsm.html\"&gt;https://www.cdc.gov/ncbddd/autism/hcp-dsm.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.google.com/amp/s/health.clevelandclinic.org/2012/08/what-is-and-is-not-autism/amp/\"&gt;https://www.google.com/amp/s/health.clevelandclinic.org/2012/08/what-is-and-is-not-autism/amp/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I hope this helps. &lt;/p&gt;\n\n&lt;p&gt;Source: am Speech Language Pathologist &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbsxgl", "score_hidden": false, "stickied": false, "created": 1492355067.0, "created_utc": 1492326267.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgcp33g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PMMEPICSOFURDOGGO", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Your daughter sounds like my son! He is slightly speech delayed and hasn't really spoken in 2 words sentences like he's supposed to at the age of 2 years and 4 months old. He does lead me by the hand to tell me what he wants, and he mimics me sometimes. He also has been starting to have massive meltdowns when something doesn't go right. I enrolled him in speech therapy a couple of weeks ago, and he has been making so much progress! Point is, I don't think your daughter has autism. Every baby is different and it took me a really long time to stop comparing my child to other kids his age developmentally. She will learn at her own pace, and before you know it, she'll be talking up a storm! \n\nA related question. What state do you live in? Some states have a birth to 3 program who will work with your toddler with speech and motor skills as well. My son is in this and it helps him so much. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your daughter sounds like my son! He is slightly speech delayed and hasn&amp;#39;t really spoken in 2 words sentences like he&amp;#39;s supposed to at the age of 2 years and 4 months old. He does lead me by the hand to tell me what he wants, and he mimics me sometimes. He also has been starting to have massive meltdowns when something doesn&amp;#39;t go right. I enrolled him in speech therapy a couple of weeks ago, and he has been making so much progress! Point is, I don&amp;#39;t think your daughter has autism. Every baby is different and it took me a really long time to stop comparing my child to other kids his age developmentally. She will learn at her own pace, and before you know it, she&amp;#39;ll be talking up a storm! &lt;/p&gt;\n\n&lt;p&gt;A related question. What state do you live in? Some states have a birth to 3 program who will work with your toddler with speech and motor skills as well. My son is in this and it helps him so much. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcp33g", "score_hidden": false, "stickied": false, "created": 1492411346.0, "created_utc": 1492382546.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgdvp28", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "bpadair31", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "As the parent of an autistic child, this does not sound like autism to me. This all sounds like a completely normal not quite two year old.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As the parent of an autistic child, this does not sound like autism to me. This all sounds like a completely normal not quite two year old.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdvp28", "score_hidden": false, "stickied": false, "created": 1492482105.0, "created_utc": 1492453305.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dge6hhf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Jambajuice2828", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Go to your pediatrician and ask if that's normal for your child. If it's not, your pediatrician could help you get in sooner to the speech pathologist. I had a speech delayed daughter but she had really bad ear infections and so much fluid in her ears she couldn't hear. When she got tubes at 18 months, the ENT surgeon gave her a referral to the hospital's speech department. She got evaluated by a speech pathologist who said she was definitely behind from not being able to hear. By 20 months old, she was going to a weekly speech class. By 3 years, she's totally caught up.  \n\nAnyways, get into the pediatrician and into speech therapy if needed. Early intervention is everything. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to your pediatrician and ask if that&amp;#39;s normal for your child. If it&amp;#39;s not, your pediatrician could help you get in sooner to the speech pathologist. I had a speech delayed daughter but she had really bad ear infections and so much fluid in her ears she couldn&amp;#39;t hear. When she got tubes at 18 months, the ENT surgeon gave her a referral to the hospital&amp;#39;s speech department. She got evaluated by a speech pathologist who said she was definitely behind from not being able to hear. By 20 months old, she was going to a weekly speech class. By 3 years, she&amp;#39;s totally caught up.  &lt;/p&gt;\n\n&lt;p&gt;Anyways, get into the pediatrician and into speech therapy if needed. Early intervention is everything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge6hhf", "score_hidden": false, "stickied": false, "created": 1492494446.0, "created_utc": 1492465646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65kssq", "likes": null, "replies": "", "user_reports": [], "id": "dgb33ba", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "nowetbread", "parent_id": "t1_dgb2464", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Agreed.  The thing is you can't change it.  From your description and what you do for work, you are probably worrying about nothing at all.  Stressing is only going to drive you crazy and not change the outcome.  \n\n\nI have a kid with autism.  Stressing out about it didn't change anything.  The actual diagnosis didn't change anything either.  She is who she is.  We take the challenges one at a time.  We work to give her the best future we can.  Pretty much the same thing we do for our other child, but different issues.   ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed.  The thing is you can&amp;#39;t change it.  From your description and what you do for work, you are probably worrying about nothing at all.  Stressing is only going to drive you crazy and not change the outcome.  &lt;/p&gt;\n\n&lt;p&gt;I have a kid with autism.  Stressing out about it didn&amp;#39;t change anything.  The actual diagnosis didn&amp;#39;t change anything either.  She is who she is.  We take the challenges one at a time.  We work to give her the best future we can.  Pretty much the same thing we do for our other child, but different issues.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb33ba", "score_hidden": false, "stickied": false, "created": 1492314721.0, "created_utc": 1492285921.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb2464", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "babythroz", "parent_id": "t1_dgb1nas", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I actually work as a support worker for people with special needs, particularly autism. Some of the most intelligent, amazing people I have ever met have been on the spectrum. I try to remind myself of that. I know I wouldn't love her any less and it wouldn't change her. I guess I have also seen the challenges people on the spectrum have to face on a regular basis and I just don't want that for her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually work as a support worker for people with special needs, particularly autism. Some of the most intelligent, amazing people I have ever met have been on the spectrum. I try to remind myself of that. I know I wouldn&amp;#39;t love her any less and it wouldn&amp;#39;t change her. I guess I have also seen the challenges people on the spectrum have to face on a regular basis and I just don&amp;#39;t want that for her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb2464", "score_hidden": false, "stickied": false, "created": 1492313413.0, "created_utc": 1492284613.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb1nas", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "nowetbread", "parent_id": "t3_65kssq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 1, "body": "What does it matter if she does?  It doesn't change who she is nor would it define her.  If she has autism or not, she will be the same kid.  I really wouldn't let it stress you out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What does it matter if she does?  It doesn&amp;#39;t change who she is nor would it define her.  If she has autism or not, she will be the same kid.  I really wouldn&amp;#39;t let it stress you out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb1nas", "score_hidden": false, "stickied": false, "created": 1492312790.0, "created_utc": 1492283990.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}]