[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just reflecting today on how well (knock on wood, lol) my 12 yr old is doing since we started him on ADHD medication at age 9.5. If anyone is debating whether it&amp;#39;s okay to give kids ADHD medication, they probably don&amp;#39;t have children throwing tantrums for hours and hours on end, kicking in walls when you ask them to brush their teeth, refusing to do even basics, making everyone&amp;#39;s life a living nightmare anytime parents follow through with a threat/consequence ... and then, eventually, getting knives out of the kitchen drawer when you refuse to buy them a video game, insist they get off their video game and eat dinner with the family, etc.&lt;/p&gt;\n\n&lt;p&gt;If you think good parenting can fix the issues I just described, think again. I&amp;#39;m a stay at home mom with a masters in social work who has worked with children on an outpatient basis. All I can say is that after having had our son, I am infinitely more understanding of the parents who took my evidence-based parenting advice and reported back that it doesn&amp;#39;t work. Kids need a base of emotional stability and impulse control in order for good parenting to work. You should see my library of parenting books. Believe me, his family life has always been loving and stable, and we are educated parents who searched for solutions for years. After one day of Ritalin, our lives got 100% better immediately. So, I&amp;#39;m not here to defend our choice to medicate or debate it.&lt;/p&gt;\n\n&lt;p&gt;I am here to share our story in case it helps any other parents dealing with extremely difficult children get diagnosed and treated sooner than ours did, saving you a lot of unnecessary suffering. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m talking about the parents who read parenting books and go, &amp;quot;Okay, time out for one minute for every year of age for hitting their sister...but how do I get him to stay there? Okay, timeout starts over when they get up, but how do I get him to sit there, because that doesn&amp;#39;t work either. Hold him there? Okay, but how to I get him to not try to head butt me and turn it into a wrestling match?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Or&lt;/p&gt;\n\n&lt;p&gt;The toddler who refuses to let you change his diaper because he&amp;#39;s busy and then, when you&amp;#39;re worried about diaper rash an hour later, you carry him to his room, where he resists like you&amp;#39;re trying to kill him.\nOr&lt;/p&gt;\n\n&lt;p&gt;Who had their 3.5 yr old refusing to get into his car seat and screaming because you said he couldn&amp;#39;t have a THIRD toy out of the gumball machine you just saw.&lt;/p&gt;\n\n&lt;p&gt;Or, at later ages,&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Oh, okay, I&amp;#39;ll reinforce positive behaviors and we&amp;#39;ll come up with an agreed upon consequence for really awful ones when he&amp;#39;s calm--which he will throw a fit about when implemented and then follow me around for hours and pester me endlessly about why he can&amp;#39;t have/do X.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;If your kid is &lt;em&gt;not&lt;/em&gt; like this, stop reading. If yours is, this post is for you.&lt;/p&gt;\n\n&lt;p&gt;Before having an ADHD child who isn&amp;#39;t hyperactive in the least, I knew there was ADHD inattentive type, but I really thought it showed up more in a school type setting, and my son was advanced in pre-K, K, 1st, 2nd ... In third, he was starting to struggle but only because he was refusing to attend school. Plus, my son could spend hours on advanced Lego sets and other things that interested him, so lack of focus and attention never entered our minds. &lt;/p&gt;\n\n&lt;p&gt;My husband is a family doc who treats ADHD, and he didn&amp;#39;t think of the diagnosis, nor did I, the clinical social worker. My son didn&amp;#39;t seem ADHD. We didn&amp;#39;t know of any family history either.&lt;/p&gt;\n\n&lt;p&gt;In fairness to us, it was a tough diagnosis. It didn&amp;#39;t enter our child psychiatrist&amp;#39;s minds either. At age 8.5, we brought our son to a psychiatrist because his rages were out of control, and his threats when upset were escalating to waiving kitchen knives around and holding them at his own throat. &lt;/p&gt;\n\n&lt;p&gt;So, the psychiatrist treated him for mood disorder, NOS. We wondered about bipolar but that didn&amp;#39;t quite fit. Medications weren&amp;#39;t helping much. He was even hospitalized for 10 days because he made a serious suicidal gesture after I said he couldn&amp;#39;t have a Minecraft download he&amp;#39;d just discovered the hour prior. (I said he could do chores to earn some money for it, but he was spending too much time on those game anyhow and I didn&amp;#39;t want to buy him more reason to use them...Getting him off Minecraft was like trying to take any other kind of addict away from their substance of choice, which is to say hellish..)  The child psychiatrists at this hospital did not diagnose him with ADHD either. Again, the diagnosis was mood disorder.&lt;/p&gt;\n\n&lt;p&gt;I finally asked about ADHD as a possibility after reading how many comorbid conditions go with ADHD. Most children with ADHD have another diagnosis too, and many children with mood disorders have ADHD. I think the child psychiatrist was as confounded at that point as we were, so he was willing to try an ADHD medication. The day my son started was a great day! He had some sleep problems, but once we figured out the right dose and drug, we have had a much much much happier life with him for the ensuing years.&lt;/p&gt;\n\n&lt;p&gt;ADHD is NOT just the kids my son was friends with who&amp;#39;d be jumping off the walls and breaking things on play dates. It&amp;#39;s not just about the kid who can&amp;#39;t focus on math. What these have in common is &amp;quot;executive dysfunction,&amp;quot; which is means the executive in your head that tells you what to do is doing a subpar job for ADHD people.&lt;/p&gt;\n\n&lt;p&gt;My son who would spend an hour screaming and destroying the house because I finally put my foot down and said he can&amp;#39;t have his friend over until he picks up his books while I pick up his other toys covering his bedroom floor? That sad kid is gone. So is the one who could not tolerate shifting focus to run a necessary errand and would try to unlock the car door and jump out -- even though you tried every parenting intervention known to man to make that transition easy.&lt;/p&gt;\n\n&lt;p&gt;My son has almost straight As for 5th and 6th grades, and he is very easy to work with now when there&amp;#39;s a problem. All the &amp;quot;let&amp;#39;s collaborate on a solution&amp;quot; stuff works now. (And if any parents are wondering, for a stint, out of sheer desperation, we did try corporal punishment - but our son would just fall down screaming and still refuse to do basic activities we really needed him to do -- all those necessary activities other kids could shrug, pout and get other with, but he couldn&amp;#39;t).&lt;/p&gt;\n\n&lt;p&gt;This week, my son played at a friend&amp;#39;s house, did Little League, did his homework, and is building something with his dad in the garage as I type this. He&amp;#39;s not &amp;quot;doped up,&amp;quot; but engaged and feels like he&amp;#39;s in control of himself. I cannot tell you what a difference ADHD medication has made to our lives. My son wants his medicine, because HE feels better on it. Even though my old school parents used to keep calling our son manipulative and &amp;quot;just getting his way,&amp;quot; the truth is what the best experts say: Kids want to please their parents, and they will do so when they can. &lt;/p&gt;\n\n&lt;p&gt;I thought my kids were &amp;quot;spirited.&amp;quot; Well, maybe they are, but they&amp;#39;re also really ADHD. Turns out that once our son was diagnosed and treated, we noticed the signs in his sister, who also has always been a very hard child to parent. The kind of little kid who screams for 45 min on the way home because, 30 min down the road from the gift shop, she decides she made the wrong toy selection and wants you to turn around and go back. Yeah, everyone called her a spoiled brat. What she was was a little girl who couldn&amp;#39;t shift focus and control her impulses, making everyone--including herself--miserable.&lt;/p&gt;\n\n&lt;p&gt;So, if any of you are dealing with kids whose behavior is off the charts and not addressed in the normal parenting books -- books of vignettes where reasonable and consistent interventions and strategies actually work -- then please consider an ADHD diagnosis even if your child doesn&amp;#39;t seem ADHD in any other way. Read up about executive functioning -- and executive dysfunction -- and see if this makes sense. And don&amp;#39;t be afraid to try ADHD medication, because the first-line treatments are short-acting, and you will know pretty fast whether they make a big difference. &lt;/p&gt;\n\n&lt;p&gt;For most difficult children, ADHD diagnosis is not the answer. But for some, it is the answer, and if it&amp;#39;s the answer for your family, I hope sharing our experience helps you get relief and success years sooner than we did. &lt;/p&gt;\n\n&lt;p&gt;**I apologize for bad writing, but I just wanted to get these thoughts out there while I had a moment. Hope it helps someone!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just reflecting today on how well (knock on wood, lol) my 12 yr old is doing since we started him on ADHD medication at age 9.5. If anyone is debating whether it's okay to give kids ADHD medication, they probably don't have children throwing tantrums for hours and hours on end, kicking in walls when you ask them to brush their teeth, refusing to do even basics, making everyone's life a living nightmare anytime parents follow through with a threat/consequence ... and then, eventually, getting knives out of the kitchen drawer when you refuse to buy them a video game, insist they get off their video game and eat dinner with the family, etc.\n\nIf you think good parenting can fix the issues I just described, think again. I'm a stay at home mom with a masters in social work who has worked with children on an outpatient basis. All I can say is that after having had our son, I am infinitely more understanding of the parents who took my evidence-based parenting advice and reported back that it doesn't work. Kids need a base of emotional stability and impulse control in order for good parenting to work. You should see my library of parenting books. Believe me, his family life has always been loving and stable, and we are educated parents who searched for solutions for years. After one day of Ritalin, our lives got 100% better immediately. So, I'm not here to defend our choice to medicate or debate it.\n\nI am here to share our story in case it helps any other parents dealing with extremely difficult children get diagnosed and treated sooner than ours did, saving you a lot of unnecessary suffering. \n\nI'm talking about the parents who read parenting books and go, \"Okay, time out for one minute for every year of age for hitting their sister...but how do I get him to stay there? Okay, timeout starts over when they get up, but how do I get him to sit there, because that doesn't work either. Hold him there? Okay, but how to I get him to not try to head butt me and turn it into a wrestling match?\"\n\nOr\n\nThe toddler who refuses to let you change his diaper because he's busy and then, when you're worried about diaper rash an hour later, you carry him to his room, where he resists like you're trying to kill him.\nOr\n\nWho had their 3.5 yr old refusing to get into his car seat and screaming because you said he couldn't have a THIRD toy out of the gumball machine you just saw.\n\nOr, at later ages,\n\n\"Oh, okay, I'll reinforce positive behaviors and we'll come up with an agreed upon consequence for really awful ones when he's calm--which he will throw a fit about when implemented and then follow me around for hours and pester me endlessly about why he can't have/do X.\" \n\nIf your kid is *not* like this, stop reading. If yours is, this post is for you.\n\nBefore having an ADHD child who isn't hyperactive in the least, I knew there was ADHD inattentive type, but I really thought it showed up more in a school type setting, and my son was advanced in pre-K, K, 1st, 2nd ... In third, he was starting to struggle but only because he was refusing to attend school. Plus, my son could spend hours on advanced Lego sets and other things that interested him, so lack of focus and attention never entered our minds. \n\nMy husband is a family doc who treats ADHD, and he didn't think of the diagnosis, nor did I, the clinical social worker. My son didn't seem ADHD. We didn't know of any family history either.\n\nIn fairness to us, it was a tough diagnosis. It didn't enter our child psychiatrist's minds either. At age 8.5, we brought our son to a psychiatrist because his rages were out of control, and his threats when upset were escalating to waiving kitchen knives around and holding them at his own throat. \n\nSo, the psychiatrist treated him for mood disorder, NOS. We wondered about bipolar but that didn't quite fit. Medications weren't helping much. He was even hospitalized for 10 days because he made a serious suicidal gesture after I said he couldn't have a Minecraft download he'd just discovered the hour prior. (I said he could do chores to earn some money for it, but he was spending too much time on those game anyhow and I didn't want to buy him more reason to use them...Getting him off Minecraft was like trying to take any other kind of addict away from their substance of choice, which is to say hellish..)  The child psychiatrists at this hospital did not diagnose him with ADHD either. Again, the diagnosis was mood disorder.\n\nI finally asked about ADHD as a possibility after reading how many comorbid conditions go with ADHD. Most children with ADHD have another diagnosis too, and many children with mood disorders have ADHD. I think the child psychiatrist was as confounded at that point as we were, so he was willing to try an ADHD medication. The day my son started was a great day! He had some sleep problems, but once we figured out the right dose and drug, we have had a much much much happier life with him for the ensuing years.\n\nADHD is NOT just the kids my son was friends with who'd be jumping off the walls and breaking things on play dates. It's not just about the kid who can't focus on math. What these have in common is \"executive dysfunction,\" which is means the executive in your head that tells you what to do is doing a subpar job for ADHD people.\n\nMy son who would spend an hour screaming and destroying the house because I finally put my foot down and said he can't have his friend over until he picks up his books while I pick up his other toys covering his bedroom floor? That sad kid is gone. So is the one who could not tolerate shifting focus to run a necessary errand and would try to unlock the car door and jump out -- even though you tried every parenting intervention known to man to make that transition easy.\n\nMy son has almost straight As for 5th and 6th grades, and he is very easy to work with now when there's a problem. All the \"let's collaborate on a solution\" stuff works now. (And if any parents are wondering, for a stint, out of sheer desperation, we did try corporal punishment - but our son would just fall down screaming and still refuse to do basic activities we really needed him to do -- all those necessary activities other kids could shrug, pout and get other with, but he couldn't).\n\nThis week, my son played at a friend's house, did Little League, did his homework, and is building something with his dad in the garage as I type this. He's not \"doped up,\" but engaged and feels like he's in control of himself. I cannot tell you what a difference ADHD medication has made to our lives. My son wants his medicine, because HE feels better on it. Even though my old school parents used to keep calling our son manipulative and \"just getting his way,\" the truth is what the best experts say: Kids want to please their parents, and they will do so when they can. \n\nI thought my kids were \"spirited.\" Well, maybe they are, but they're also really ADHD. Turns out that once our son was diagnosed and treated, we noticed the signs in his sister, who also has always been a very hard child to parent. The kind of little kid who screams for 45 min on the way home because, 30 min down the road from the gift shop, she decides she made the wrong toy selection and wants you to turn around and go back. Yeah, everyone called her a spoiled brat. What she was was a little girl who couldn't shift focus and control her impulses, making everyone--including herself--miserable.\n\nSo, if any of you are dealing with kids whose behavior is off the charts and not addressed in the normal parenting books -- books of vignettes where reasonable and consistent interventions and strategies actually work -- then please consider an ADHD diagnosis even if your child doesn't seem ADHD in any other way. Read up about executive functioning -- and executive dysfunction -- and see if this makes sense. And don't be afraid to try ADHD medication, because the first-line treatments are short-acting, and you will know pretty fast whether they make a big difference. \n\nFor most difficult children, ADHD diagnosis is not the answer. But for some, it is the answer, and if it's the answer for your family, I hope sharing our experience helps you get relief and success years sooner than we did. \n\n**I apologize for bad writing, but I just wanted to get these thoughts out there while I had a moment. Hope it helps someone!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Behaviour", "id": "65lfk0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 11, "report_reasons": null, "author": "fatdog1111", "saved": false, "mod_reports": [], "name": "t3_65lfk0", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": 1492290774.0, "link_flair_css_class": "behaviour", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65lfk0/psa_extremely_difficult_child_could_be_adhd_even/", "num_reports": null, "locked": false, "stickied": false, "created": 1492319135.0, "url": "https://www.reddit.com/r/Parenting/comments/65lfk0/psa_extremely_difficult_child_could_be_adhd_even/", "author_flair_text": null, "quarantine": false, "title": "PSA: Extremely difficult child? Could be ADHD even if your child has no hyperactivity or other symptoms.", "created_utc": 1492290335.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 8, "visited": false, "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65lfk0", "likes": null, "replies": "", "user_reports": [], "id": "dgb7s3j", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Metsgal", "parent_id": "t3_65lfk0", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "As an adult woman with ADHD (inattentive) who wasn't formally diagnosed until I was 16, I second this. Medication works, and should be considered along with CBT. It took me a long time to forgive my mom for not getting me checked out earlier. After I was medicated at 17, I THRIVED. Amazing grades, very organized, just so much happier. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As an adult woman with ADHD (inattentive) who wasn&amp;#39;t formally diagnosed until I was 16, I second this. Medication works, and should be considered along with CBT. It took me a long time to forgive my mom for not getting me checked out earlier. After I was medicated at 17, I THRIVED. Amazing grades, very organized, just so much happier. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb7s3j", "score_hidden": false, "stickied": false, "created": 1492321166.0, "created_utc": 1492292366.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65lfk0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65lfk0", "likes": null, "replies": "", "user_reports": [], "id": "dgbcbeh", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dgb9h9i", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I too have it and use meds when I need to, and I second this. It does sound like it is the right choice for OP's son at this time. But stimulants are never without tradeoffs, and not benign. I assume that is also true for the non stimulant class though I cannot speak from experience; tinkering with brain chemistry is a tricky business and nobody really knows how neurologically active meds work, so we don't really know what we are doing, but these are not small targeted changes. Stimulants do make us more functional, and sometimes it's worth taking them, but they don't make us \"normal\" (whatever that is). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I too have it and use meds when I need to, and I second this. It does sound like it is the right choice for OP&amp;#39;s son at this time. But stimulants are never without tradeoffs, and not benign. I assume that is also true for the non stimulant class though I cannot speak from experience; tinkering with brain chemistry is a tricky business and nobody really knows how neurologically active meds work, so we don&amp;#39;t really know what we are doing, but these are not small targeted changes. Stimulants do make us more functional, and sometimes it&amp;#39;s worth taking them, but they don&amp;#39;t make us &amp;quot;normal&amp;quot; (whatever that is). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbcbeh", "score_hidden": false, "stickied": false, "created": 1492327690.0, "created_utc": 1492298890.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgb9h9i", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "georgia2017", "parent_id": "t3_65lfk0", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm an adult with ADHD and I would recommend medication ONLY if it is really causing serious issues. Yes, lots of people thrive on medication but it is serious stuff, especially when given to young kids. I was medicated relatively young and in my early 20s started to see the side effects- heart murmur, eye twitch, chronic appetite issues, migraines. This isn't a \"don't medicate\" post but just weigh the pros and cons carefully before choosing to go down this route. And medication is most successful when combined with other techniques- mainly stable routines, CBT, organization techniques, and even meditation. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an adult with ADHD and I would recommend medication ONLY if it is really causing serious issues. Yes, lots of people thrive on medication but it is serious stuff, especially when given to young kids. I was medicated relatively young and in my early 20s started to see the side effects- heart murmur, eye twitch, chronic appetite issues, migraines. This isn&amp;#39;t a &amp;quot;don&amp;#39;t medicate&amp;quot; post but just weigh the pros and cons carefully before choosing to go down this route. And medication is most successful when combined with other techniques- mainly stable routines, CBT, organization techniques, and even meditation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgb9h9i", "score_hidden": false, "stickied": false, "created": 1492323544.0, "created_utc": 1492294744.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65lfk0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65lfk0", "likes": null, "replies": "", "user_reports": [], "id": "dgecsja", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fatdog1111", "parent_id": "t1_dgbknbc", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Wow, your son sounds exhausting and you sound like a great parent! I have no idea if this is how ADHD manifests in your child, or if it's something else,* but I can totally empathize with the knowledge that something is different and all the parenting books aren't working.\n\n*I had a friend with a very, very needy and difficult little kid, and everyone said he needed more discipline--by which many meant spanking. I suggested she get him tested for giftedness, and he was off the charts. Last I saw him, he was in Kindergarten and reading genus and species at the aquarium like an old scientist! \n\nI know there's some really debilitating and \"no bright side\" disorders in the world, but I also have learned enough by now to see there's many more strengths than I ever realized to disorders like ADHD, depression, high-functioing autism, etc. Whatever it is that makes your child such a pain in the rear will probably make him an exceptional adult in some really great ways. In the meantime, best of luck on your journey. Just because the parenting books aren't working doesn't mean you're not doing something right. Some kids are just a lot more for us to handle and love. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, your son sounds exhausting and you sound like a great parent! I have no idea if this is how ADHD manifests in your child, or if it&amp;#39;s something else,* but I can totally empathize with the knowledge that something is different and all the parenting books aren&amp;#39;t working.&lt;/p&gt;\n\n&lt;p&gt;*I had a friend with a very, very needy and difficult little kid, and everyone said he needed more discipline--by which many meant spanking. I suggested she get him tested for giftedness, and he was off the charts. Last I saw him, he was in Kindergarten and reading genus and species at the aquarium like an old scientist! &lt;/p&gt;\n\n&lt;p&gt;I know there&amp;#39;s some really debilitating and &amp;quot;no bright side&amp;quot; disorders in the world, but I also have learned enough by now to see there&amp;#39;s many more strengths than I ever realized to disorders like ADHD, depression, high-functioing autism, etc. Whatever it is that makes your child such a pain in the rear will probably make him an exceptional adult in some really great ways. In the meantime, best of luck on your journey. Just because the parenting books aren&amp;#39;t working doesn&amp;#39;t mean you&amp;#39;re not doing something right. Some kids are just a lot more for us to handle and love. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgecsja", "score_hidden": false, "stickied": false, "created": 1492502567.0, "created_utc": 1492473767.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbknbc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "iheartnjdevils", "parent_id": "t3_65lfk0", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for posting this. I feel like the media, family, friends and everyone who is always saying we over diagnose or over medicate normal child behavior makes parents with serious concerns hesitant.\n\nI've been reading parenting book after parenting book and can't seem to find anything that works for my almost 5 year old son. He was a great baby, never really fussed, no issues sleeping or eating but that all changed when he turned 3. Terrible threes I figured. We'd have short periods where things would go well but the tough periods aren't getting longer and worse. My son is very clingy and will follow me everywhere and talk from the time I pick him up from preschool and even call for me after bed. I've always made time to play with him but I can't remember the last time even this went without a meltdown. If I can't read his mind and do what he expects me to do, he gets angry and will refuse to play. If I give up and try to walk away, he'll cry and beg me not to. If I give in, he will resort to being mad at me. If I don't give in, he'll follow me crying. He won't play any game that he might use or is unsure he can do. When he's talking to me, he will pick things up, spill them, drop them on the floor whatever and it's like he doesn't even notice. He repeats himself constantly and even if I acknowledge it, he will still say it. I've been writing down my concerns so this is a recent example. \n\nHim: Those are the same people that waived to me before!\nMe: Cool! \nHim: They are the same people! \nMe: They waived to you before, what a small world.\nHim: The same people! \n\nHe asks nonsensical questions and will demand an answer if I try to explain to him there is no answer to why 1+1 equals 10 because it doesn't. He will insist he's right if he misheard something, like the worlds of a song. I know that they can sound alike but try to explain that and he just won't listen. He always interrupts me or any conversations, even if to repeat something he had just told me. He will ask, \"I'm the only one who can do this/has this/am the fastest at/best at\" and so on. He's scared of most things, loud noises, heights, the water and more recently has been talking about \"bad guys\" coming to get him while he sleeps. \n\nThe list goes on and on. I know so many of these sound like he's starving for attention but trust me when I say no amount of it ever seems satiable. I thought to myself, \"this kid always seems angry at something\". At this point I don't know if I just haven't found the right methods, or if it's something more like a mood or behavior issue. So I appreciate your post, especially about trusting your instinct even if it wasn't directly said! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting this. I feel like the media, family, friends and everyone who is always saying we over diagnose or over medicate normal child behavior makes parents with serious concerns hesitant.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been reading parenting book after parenting book and can&amp;#39;t seem to find anything that works for my almost 5 year old son. He was a great baby, never really fussed, no issues sleeping or eating but that all changed when he turned 3. Terrible threes I figured. We&amp;#39;d have short periods where things would go well but the tough periods aren&amp;#39;t getting longer and worse. My son is very clingy and will follow me everywhere and talk from the time I pick him up from preschool and even call for me after bed. I&amp;#39;ve always made time to play with him but I can&amp;#39;t remember the last time even this went without a meltdown. If I can&amp;#39;t read his mind and do what he expects me to do, he gets angry and will refuse to play. If I give up and try to walk away, he&amp;#39;ll cry and beg me not to. If I give in, he will resort to being mad at me. If I don&amp;#39;t give in, he&amp;#39;ll follow me crying. He won&amp;#39;t play any game that he might use or is unsure he can do. When he&amp;#39;s talking to me, he will pick things up, spill them, drop them on the floor whatever and it&amp;#39;s like he doesn&amp;#39;t even notice. He repeats himself constantly and even if I acknowledge it, he will still say it. I&amp;#39;ve been writing down my concerns so this is a recent example. &lt;/p&gt;\n\n&lt;p&gt;Him: Those are the same people that waived to me before!\nMe: Cool! \nHim: They are the same people! \nMe: They waived to you before, what a small world.\nHim: The same people! &lt;/p&gt;\n\n&lt;p&gt;He asks nonsensical questions and will demand an answer if I try to explain to him there is no answer to why 1+1 equals 10 because it doesn&amp;#39;t. He will insist he&amp;#39;s right if he misheard something, like the worlds of a song. I know that they can sound alike but try to explain that and he just won&amp;#39;t listen. He always interrupts me or any conversations, even if to repeat something he had just told me. He will ask, &amp;quot;I&amp;#39;m the only one who can do this/has this/am the fastest at/best at&amp;quot; and so on. He&amp;#39;s scared of most things, loud noises, heights, the water and more recently has been talking about &amp;quot;bad guys&amp;quot; coming to get him while he sleeps. &lt;/p&gt;\n\n&lt;p&gt;The list goes on and on. I know so many of these sound like he&amp;#39;s starving for attention but trust me when I say no amount of it ever seems satiable. I thought to myself, &amp;quot;this kid always seems angry at something&amp;quot;. At this point I don&amp;#39;t know if I just haven&amp;#39;t found the right methods, or if it&amp;#39;s something more like a mood or behavior issue. So I appreciate your post, especially about trusting your instinct even if it wasn&amp;#39;t directly said! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbknbc", "score_hidden": false, "stickied": false, "created": 1492339669.0, "created_utc": 1492310869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65lfk0", "likes": null, "replies": "", "user_reports": [], "id": "dgbn2aw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "estrogyn", "parent_id": "t3_65lfk0", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for posting this. I didn't realize my son had ADHD until he was in 7th grade; I just thought he was a handful and kept his life extremely regimented and structured -- which helped until middle school where he was given more freedom and couldn't handle it. Like your son, my kid has no issues with inattention, so I thought it couldn't be ADHD.\n\nI think the wording has got to change at some point. The term encompasses too many different diagnoses and too many pre-judgments. Nevertheless, I'm glad both our kids got diagnosed, and I'm glad they're doing better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for posting this. I didn&amp;#39;t realize my son had ADHD until he was in 7th grade; I just thought he was a handful and kept his life extremely regimented and structured -- which helped until middle school where he was given more freedom and couldn&amp;#39;t handle it. Like your son, my kid has no issues with inattention, so I thought it couldn&amp;#39;t be ADHD.&lt;/p&gt;\n\n&lt;p&gt;I think the wording has got to change at some point. The term encompasses too many different diagnoses and too many pre-judgments. Nevertheless, I&amp;#39;m glad both our kids got diagnosed, and I&amp;#39;m glad they&amp;#39;re doing better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbn2aw", "score_hidden": false, "stickied": false, "created": 1492343318.0, "created_utc": 1492314518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65lfk0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65lfk0", "likes": null, "replies": "", "user_reports": [], "id": "dgeho77", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fatdog1111", "parent_id": "t1_dgcpo1o", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Different details and degrees, but I can see a lot of my daughter and some of my son as a younger child in what you're describing. People would say my kids are throwing fits because they get their way--even in situations where, months and even years on end, they never ever did! \n\nOh, and like when people suggested I distract my baby? Mine were like yours. I'm like: Are you freaking kidding me?! My kids had minds like steel traps! \n\nPicking on younger sibling? Liking drama? Check, check. Yeah, a lot rings true. People crave a certain level of stimulation, and if their dopamine system isn't firing enough to give it to them, then it makes sense they look for ways to stimulate themselves. They say that's why ADHD people can be so energetic, entertaining and charming. But they also are like a fast car without breaks, right? So without impulse control, so much can go wrong. Emotions are intense, to put it mildly.\n\nI think I read that ADHD is as heritable as height (like .7 or .8), so it's powerful genetic stuff! If you have it, it's a strong possibility it's at the root of her struggles. Poor girl. Life should not be so difficult. Poor you too. It's so hard! Here's the diagnostic criteria, if you don't know them already: http://images.pearsonclinical.com/images/assets/basc-3/basc3resources/DSM5_DiagnosticCriteria_ADHD.pdf\n\nThere's risks in treating, but the way I cope as a parent with giving my kids drugs is to also think of the risks of not treating. There's some statistic that ADHD kids hear negative messages about themselves from parents, teachers and peers X number time a day -- a lot! Plus, all that stress, tantrums and melting down can't be good for the developing nervous system, so if we know the only thing that works to make it a lot better is a medication, then we as parents have to treat. We had tried everything else. If it's ADHD for your daughter, you may save her some hardwired predispositions down the road. A therapist once told me that neurons that fire together wire together. \n\nI definitely think it's worth a try (or two or three) to see if a psychiatrist would evaluate her. It's so underdiagnosed in girls, which is why I'd suggest another consult if the first doesn't diagnose her. In this journey, I learned that most child psychiatrists are not that well-trained in ADHD! I listened to a podcast by an ADHD specialty psychiatrist and learned things our child psychiatrist did not know - meaningful stuff. Plus, a lot of psychiatrists are pretty odd people, so it can be hard to find a good one. I hope you look into getting her evaluated. If the psychiatrist is iffy about whether she has it, they can order a neuropsychological battery of exams with a child neuropsychologist, which can uncover am ADHD diagnosis that way. Those tests are varied and clever in how they uncover an ADHD pattern of responses. I was impressed.\n\nI sure hope, one way or another, you get relief. Just based on what you've described since birth and how her unusualness tracks with some of my kids' ways of being unusual, I'd bet an ADHD diagnosis and the right treatment is not too far in your daughter's future. If so, I hope the relief is as lasting and dramatic for you as it has been for us. Oh, we still have moments, but they are only moments, and we manage with our son. Our daughter could drive anyone insane, but I hear that's a lot of teenage girls and not just an ADHD thing! LOL The social stuff is bad enough, but the academic pressures for high school for \"smart kids\" nowadays is ridiculous. I don't know why we do this to our children, but that's a different subject. I am SO glad she has medication to help her. \n\nBest of luck to you and your family. ", "edited": 1492480051.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Different details and degrees, but I can see a lot of my daughter and some of my son as a younger child in what you&amp;#39;re describing. People would say my kids are throwing fits because they get their way--even in situations where, months and even years on end, they never ever did! &lt;/p&gt;\n\n&lt;p&gt;Oh, and like when people suggested I distract my baby? Mine were like yours. I&amp;#39;m like: Are you freaking kidding me?! My kids had minds like steel traps! &lt;/p&gt;\n\n&lt;p&gt;Picking on younger sibling? Liking drama? Check, check. Yeah, a lot rings true. People crave a certain level of stimulation, and if their dopamine system isn&amp;#39;t firing enough to give it to them, then it makes sense they look for ways to stimulate themselves. They say that&amp;#39;s why ADHD people can be so energetic, entertaining and charming. But they also are like a fast car without breaks, right? So without impulse control, so much can go wrong. Emotions are intense, to put it mildly.&lt;/p&gt;\n\n&lt;p&gt;I think I read that ADHD is as heritable as height (like .7 or .8), so it&amp;#39;s powerful genetic stuff! If you have it, it&amp;#39;s a strong possibility it&amp;#39;s at the root of her struggles. Poor girl. Life should not be so difficult. Poor you too. It&amp;#39;s so hard! Here&amp;#39;s the diagnostic criteria, if you don&amp;#39;t know them already: &lt;a href=\"http://images.pearsonclinical.com/images/assets/basc-3/basc3resources/DSM5_DiagnosticCriteria_ADHD.pdf\"&gt;http://images.pearsonclinical.com/images/assets/basc-3/basc3resources/DSM5_DiagnosticCriteria_ADHD.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s risks in treating, but the way I cope as a parent with giving my kids drugs is to also think of the risks of not treating. There&amp;#39;s some statistic that ADHD kids hear negative messages about themselves from parents, teachers and peers X number time a day -- a lot! Plus, all that stress, tantrums and melting down can&amp;#39;t be good for the developing nervous system, so if we know the only thing that works to make it a lot better is a medication, then we as parents have to treat. We had tried everything else. If it&amp;#39;s ADHD for your daughter, you may save her some hardwired predispositions down the road. A therapist once told me that neurons that fire together wire together. &lt;/p&gt;\n\n&lt;p&gt;I definitely think it&amp;#39;s worth a try (or two or three) to see if a psychiatrist would evaluate her. It&amp;#39;s so underdiagnosed in girls, which is why I&amp;#39;d suggest another consult if the first doesn&amp;#39;t diagnose her. In this journey, I learned that most child psychiatrists are not that well-trained in ADHD! I listened to a podcast by an ADHD specialty psychiatrist and learned things our child psychiatrist did not know - meaningful stuff. Plus, a lot of psychiatrists are pretty odd people, so it can be hard to find a good one. I hope you look into getting her evaluated. If the psychiatrist is iffy about whether she has it, they can order a neuropsychological battery of exams with a child neuropsychologist, which can uncover am ADHD diagnosis that way. Those tests are varied and clever in how they uncover an ADHD pattern of responses. I was impressed.&lt;/p&gt;\n\n&lt;p&gt;I sure hope, one way or another, you get relief. Just based on what you&amp;#39;ve described since birth and how her unusualness tracks with some of my kids&amp;#39; ways of being unusual, I&amp;#39;d bet an ADHD diagnosis and the right treatment is not too far in your daughter&amp;#39;s future. If so, I hope the relief is as lasting and dramatic for you as it has been for us. Oh, we still have moments, but they are only moments, and we manage with our son. Our daughter could drive anyone insane, but I hear that&amp;#39;s a lot of teenage girls and not just an ADHD thing! LOL The social stuff is bad enough, but the academic pressures for high school for &amp;quot;smart kids&amp;quot; nowadays is ridiculous. I don&amp;#39;t know why we do this to our children, but that&amp;#39;s a different subject. I am SO glad she has medication to help her. &lt;/p&gt;\n\n&lt;p&gt;Best of luck to you and your family. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgeho77", "score_hidden": false, "stickied": false, "created": 1492508658.0, "created_utc": 1492479858.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpo1o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Junipermuse", "parent_id": "t3_65lfk0", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Wow I'm so glad you posted this. This really rings some bells for me and my child. I have ADHD myself and when my daughter was little we couldn't figure her out. She was definitely what you might call \"spirited\". We took her to a developmental pediatrician and she didn't receive a diagnosis at all, but they said she might later qualify for an ADHD diagnosis. But she isn't inattentive now and she only sometimes seems \"hyper\". But she absolutely seems to have issues with executive function. She definitely hyperfocuses. She can't deal with transitions and she can't stop fighting when she doesn't get her way. When she was a toddler, she once cried for 45 minutes because we left an open house without letting her touch an attractive toy in the child's bedroom. She fell asleep crying and when she woke up an hour later she immediately started crying again about the toy and begging to go back to the house. When her brother was born and I wanted to get back into shape after having a baby, I wanted to establish a routine where we walked every morning for 30 minutes. She fought this change in routine for the next 6 months. She never really adjusted to it, I think after 6 months I gave up trying. Or just started walking in the afternoon when she was at preschool. She's ten now and she tantrums most days of the week. She doesn't do this at school anymore (not since kindergarten when she was sent home from school multiple times that year due to tantrums) and she does very well academically because she is very smart. But she really struggles with time management. She throws tantrums about changes in schedule because she thinks she won't have time to do her homework. She has lots of anxiety about doing her homework and so she starts it early but then can't focus on completing it or waits until the last minute and then has a major panic attack. One day she got a last minute assignment to write a rough draft of a paper for class the next day and she was thrown for such a loop that it turned into hours of tantruming. Consequences never work because in the moment nothing matters as much as the thing she's hyperfocusing on. And she's ready to fight to the death about it. Establishing routines with her is next to impossible. She loves starting arguments (and I've long wondered if she's seeking that adrenaline rush that can quiet the brain), so if I refuse to argue or if I tell her something is a great idea, she falls apart or ramps up because she really wanted to fight and argue. She picks fights with her younger brother almost constantly. She seems to find a certain kind of peace from throwing everyone else's world into chaos. She has always loved playing tricks on people. She routinely would hide from people (mostly me) because she enjoyed the panic I experienced when I thought she was lost. Similarly she would pretend she was lost (this was when she was 2 1/2 or 3) while shopping with me in a store. She'd be two yards from me and knew where I was and she would pretend she was lost, calling out \"mommy, mommy\" until someone ran up to help her. I would just be standing there waving my arm at her saying \"I'm right here\". Usually when I caught the attention of the person who tried to help her, that person would look really confused that my daughter had acted lost, since I had been standing so close. I just figured she liked the feeling she got when other people got worked up. \n\nAnyway I'm worried that I won't be able to get a doctor to consider an ADHD diagnosis for her, even though I've wondered if stimulant mess could be helpful. I don't even know where to start because she is exhausting and I feel like we've tried so much already.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow I&amp;#39;m so glad you posted this. This really rings some bells for me and my child. I have ADHD myself and when my daughter was little we couldn&amp;#39;t figure her out. She was definitely what you might call &amp;quot;spirited&amp;quot;. We took her to a developmental pediatrician and she didn&amp;#39;t receive a diagnosis at all, but they said she might later qualify for an ADHD diagnosis. But she isn&amp;#39;t inattentive now and she only sometimes seems &amp;quot;hyper&amp;quot;. But she absolutely seems to have issues with executive function. She definitely hyperfocuses. She can&amp;#39;t deal with transitions and she can&amp;#39;t stop fighting when she doesn&amp;#39;t get her way. When she was a toddler, she once cried for 45 minutes because we left an open house without letting her touch an attractive toy in the child&amp;#39;s bedroom. She fell asleep crying and when she woke up an hour later she immediately started crying again about the toy and begging to go back to the house. When her brother was born and I wanted to get back into shape after having a baby, I wanted to establish a routine where we walked every morning for 30 minutes. She fought this change in routine for the next 6 months. She never really adjusted to it, I think after 6 months I gave up trying. Or just started walking in the afternoon when she was at preschool. She&amp;#39;s ten now and she tantrums most days of the week. She doesn&amp;#39;t do this at school anymore (not since kindergarten when she was sent home from school multiple times that year due to tantrums) and she does very well academically because she is very smart. But she really struggles with time management. She throws tantrums about changes in schedule because she thinks she won&amp;#39;t have time to do her homework. She has lots of anxiety about doing her homework and so she starts it early but then can&amp;#39;t focus on completing it or waits until the last minute and then has a major panic attack. One day she got a last minute assignment to write a rough draft of a paper for class the next day and she was thrown for such a loop that it turned into hours of tantruming. Consequences never work because in the moment nothing matters as much as the thing she&amp;#39;s hyperfocusing on. And she&amp;#39;s ready to fight to the death about it. Establishing routines with her is next to impossible. She loves starting arguments (and I&amp;#39;ve long wondered if she&amp;#39;s seeking that adrenaline rush that can quiet the brain), so if I refuse to argue or if I tell her something is a great idea, she falls apart or ramps up because she really wanted to fight and argue. She picks fights with her younger brother almost constantly. She seems to find a certain kind of peace from throwing everyone else&amp;#39;s world into chaos. She has always loved playing tricks on people. She routinely would hide from people (mostly me) because she enjoyed the panic I experienced when I thought she was lost. Similarly she would pretend she was lost (this was when she was 2 1/2 or 3) while shopping with me in a store. She&amp;#39;d be two yards from me and knew where I was and she would pretend she was lost, calling out &amp;quot;mommy, mommy&amp;quot; until someone ran up to help her. I would just be standing there waving my arm at her saying &amp;quot;I&amp;#39;m right here&amp;quot;. Usually when I caught the attention of the person who tried to help her, that person would look really confused that my daughter had acted lost, since I had been standing so close. I just figured she liked the feeling she got when other people got worked up. &lt;/p&gt;\n\n&lt;p&gt;Anyway I&amp;#39;m worried that I won&amp;#39;t be able to get a doctor to consider an ADHD diagnosis for her, even though I&amp;#39;ve wondered if stimulant mess could be helpful. I don&amp;#39;t even know where to start because she is exhausting and I feel like we&amp;#39;ve tried so much already.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcpo1o", "score_hidden": false, "stickied": false, "created": 1492412143.0, "created_utc": 1492383343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]