[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure what I&amp;#39;m looking for, maybe some words of encouragement from other parents with kids who have type 1 diabetes. I just feel horrible for her having to now get poked and have shots everyday. She is behaving normal (reason we found out was because I took her to the doctor as I found the amount of drinking and going potty to be too abnormal) and a few minutes after each shot she is great. She just wants to go home (this will be our second night at the hospital, hoping to go home tomorrow after seeing the dietician).&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just a lot to handle all of a sudden. She is the most important thing in my life and now she has this to deal with. I just want to hold her forever.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m the Dad by the way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm not sure what I'm looking for, maybe some words of encouragement from other parents with kids who have type 1 diabetes. I just feel horrible for her having to now get poked and have shots everyday. She is behaving normal (reason we found out was because I took her to the doctor as I found the amount of drinking and going potty to be too abnormal) and a few minutes after each shot she is great. She just wants to go home (this will be our second night at the hospital, hoping to go home tomorrow after seeing the dietician).\n\nIt's just a lot to handle all of a sudden. She is the most important thing in my life and now she has this to deal with. I just want to hold her forever.\n\nI'm the Dad by the way.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Support", "id": "65n66g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 81, "report_reasons": null, "author": "SweetToothKane", "saved": false, "mod_reports": [], "name": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "support", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65n66g/my_daughter_4f_was_diagnosed_with_type_1_diabetes/", "num_reports": null, "locked": false, "stickied": false, "created": 1492341762.0, "url": "https://www.reddit.com/r/Parenting/comments/65n66g/my_daughter_4f_was_diagnosed_with_type_1_diabetes/", "author_flair_text": null, "quarantine": false, "title": "My daughter [4F] was diagnosed with type 1 diabetes and I'm a wreck.", "created_utc": 1492312962.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 38, "visited": false, "subreddit_type": "public", "ups": 81}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgbpclu", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgbnvvn", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Our nurse we just talked to, who was diagnosed at 3 more than 30 years ago, definitely thought looking into a pump would be good. She said she has seen kids as small as 2 on them. It's definitely something we'll consider as we want all options (syringe, pen, pump) available to see what works best for her comfort. Thank you for the rest of the insight into your life, it definitely helps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Our nurse we just talked to, who was diagnosed at 3 more than 30 years ago, definitely thought looking into a pump would be good. She said she has seen kids as small as 2 on them. It&amp;#39;s definitely something we&amp;#39;ll consider as we want all options (syringe, pen, pump) available to see what works best for her comfort. Thank you for the rest of the insight into your life, it definitely helps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbpclu", "score_hidden": false, "stickied": false, "created": 1492347247.0, "created_utc": 1492318447.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgc20wu", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Wdc331", "parent_id": "t1_dgbnvvn", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There are a number of parents of kids with type 1 over on /r/diabetes and /r/diabates_t1. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a number of parents of kids with type 1 over on &lt;a href=\"/r/diabetes\"&gt;/r/diabetes&lt;/a&gt; and &lt;a href=\"/r/diabates_t1\"&gt;/r/diabates_t1&lt;/a&gt;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc20wu", "score_hidden": false, "stickied": false, "created": 1492380198.0, "created_utc": 1492351398.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnvvn", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "GanoBlivia", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My 7 year old son has type 1. I don't really talk about it with people because diabetes is pretty misunderstood. I can't tell you how many people have said, \"But he looks so healthy. Are you sure he has diabetes?\" or something along those lines. \n\nIt sucks. Plain and simple. My son knows it sucks. He knows it's okay to be upset about it, but he also knows that we don't dwell on it. Everyone has something. Even if you can't see it, every single person is dealing with something. We talk about the issues his siblings deal with and this issues we deal with. It's not always a disability or a disorder, but everyone has something going on. \n\nMy son is a normal 7 year old boy. He plays football and baseball. He just started wrestling this year. He's good too. Not \"good because I am his mom\" good either. I have other kids. My 7 year old is by far the best athlete. He's also very smart and incredibly sweet. There are plenty of famous people with type 1. Athletes like Jay Cutler. Musicians like Nick Jonas. Diabetes doesn't stop them. It won't stop my son. It won't stop your daughter either. \n\nWe have dealt with plenty of hospital visits. We still do shots, but have you looked into the pump? I have met other parents who use it and my son's doctor has mentioned it as a possibility. Might be something to look into. \n\nIt's a lot to handle and it's hard to find people who can relate. I wish there was a sub for parents who have kids with medical issues. Being able to talk about it anonymously would be nice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My 7 year old son has type 1. I don&amp;#39;t really talk about it with people because diabetes is pretty misunderstood. I can&amp;#39;t tell you how many people have said, &amp;quot;But he looks so healthy. Are you sure he has diabetes?&amp;quot; or something along those lines. &lt;/p&gt;\n\n&lt;p&gt;It sucks. Plain and simple. My son knows it sucks. He knows it&amp;#39;s okay to be upset about it, but he also knows that we don&amp;#39;t dwell on it. Everyone has something. Even if you can&amp;#39;t see it, every single person is dealing with something. We talk about the issues his siblings deal with and this issues we deal with. It&amp;#39;s not always a disability or a disorder, but everyone has something going on. &lt;/p&gt;\n\n&lt;p&gt;My son is a normal 7 year old boy. He plays football and baseball. He just started wrestling this year. He&amp;#39;s good too. Not &amp;quot;good because I am his mom&amp;quot; good either. I have other kids. My 7 year old is by far the best athlete. He&amp;#39;s also very smart and incredibly sweet. There are plenty of famous people with type 1. Athletes like Jay Cutler. Musicians like Nick Jonas. Diabetes doesn&amp;#39;t stop them. It won&amp;#39;t stop my son. It won&amp;#39;t stop your daughter either. &lt;/p&gt;\n\n&lt;p&gt;We have dealt with plenty of hospital visits. We still do shots, but have you looked into the pump? I have met other parents who use it and my son&amp;#39;s doctor has mentioned it as a possibility. Might be something to look into. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a lot to handle and it&amp;#39;s hard to find people who can relate. I wish there was a sub for parents who have kids with medical issues. Being able to talk about it anonymously would be nice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbnvvn", "score_hidden": false, "stickied": false, "created": 1492344673.0, "created_utc": 1492315873.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgbyddh", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Wdc331", "parent_id": "t1_dgbptz1", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I've bee a type 1 for about 35 years now. The Dexcom is, hands down, the most amazing thing I've seen during this time. It has changed my life and probably saved it a few times. Dexcom FTW!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve bee a type 1 for about 35 years now. The Dexcom is, hands down, the most amazing thing I&amp;#39;ve seen during this time. It has changed my life and probably saved it a few times. Dexcom FTW!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbyddh", "score_hidden": false, "stickied": false, "created": 1492372368.0, "created_utc": 1492343568.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgc6kk8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgbptz1", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The thought of other people having to dose her is definitely a concern as well. I don't want her to grow up but at this point I'm already looking forward to a point where she can handle anything herself as I know it'll give her more freedom.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thought of other people having to dose her is definitely a concern as well. I don&amp;#39;t want her to grow up but at this point I&amp;#39;m already looking forward to a point where she can handle anything herself as I know it&amp;#39;ll give her more freedom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc6kk8", "score_hidden": false, "stickied": false, "created": 1492386915.0, "created_utc": 1492358115.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbptz1", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "watersramblewild", "parent_id": "t1_dgbpfg1", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "He does use the Dexcom. It's been life changing for us. We went the first few months without it and I'd never want to go without it again. He uses the Omnipod pump....I have mixed feelings about that pump in particular but it's been a good thing overall. Lots of great pump options out there. Some endocrinologist clinics have different kinds you can try out. \n\nThe pump is great because it's easy to teach other people to use it. His preschool teachers are able to dose him for snack, for example. Also babysitters, extended family, etc are less intimidated by pushing buttons into a pump than using a needle on a kid (understandably)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He does use the Dexcom. It&amp;#39;s been life changing for us. We went the first few months without it and I&amp;#39;d never want to go without it again. He uses the Omnipod pump....I have mixed feelings about that pump in particular but it&amp;#39;s been a good thing overall. Lots of great pump options out there. Some endocrinologist clinics have different kinds you can try out. &lt;/p&gt;\n\n&lt;p&gt;The pump is great because it&amp;#39;s easy to teach other people to use it. His preschool teachers are able to dose him for snack, for example. Also babysitters, extended family, etc are less intimidated by pushing buttons into a pump than using a needle on a kid (understandably)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbptz1", "score_hidden": false, "stickied": false, "created": 1492348142.0, "created_utc": 1492319342.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbpfg1", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgbomgs", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Does your son use the dexcom? How does he get his insulin (syringe, pen, pump)? Thank you for the info about how you handled it. We're certainly in a new boat and not sure where to steer yet.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does your son use the dexcom? How does he get his insulin (syringe, pen, pump)? Thank you for the info about how you handled it. We&amp;#39;re certainly in a new boat and not sure where to steer yet.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbpfg1", "score_hidden": false, "stickied": false, "created": 1492347391.0, "created_utc": 1492318591.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbomgs", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "watersramblewild", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My son is 5 and he was diagnosed at 2.5 years old. The first few weeks are SO overwhelming. It's a very scary disease, I know, and there's so much to learn and you feel like, how on Earth can I be trusted to keep.my kid alive all by myself on a daily basis?\n\nTake it day by day for right now. What we did is put up a big whiteboard in the dining room with insulin to carb ratios and wrote down his blood sugars, carbs eaten etc throughout the day. That made it less daunting than trying to write it all down in a notebook or something.\n\nAllow yourself time to grieve. You're going to grieve the way things were. Her freedom to eat whatever and not think about it. To not wake up in the middle of the night to check blood sugars and adjust, etc. To not fear for your child's life on a regular basis. Your life will never be the same and neither will hers....But you guys will find your new normal. \n\nDon't coddle her. Let her take on the responsibilities slowly but steadily. She's going to feel more confident when she has all the information and is directly involved with her care.\n\nI don't participate in them much anymore, but when my kid first got diagnosed, FB groups for parents of T1D kids were invaluable to me. The veteran moms and dads know a lot of the tricks for all the bumps you'll run into. Managing T1D is as much an art as a science (things can change hour by hour, day by day, etc depending on weather, growth hormones, etc) so asking experienced people is a huge help.\n\nAnd look into a Dexcom CGM when life settles down a bit.\n\nThis is a tough row to hoe, but you'll get there. I'm so sorry.\n\nETA: he's still the same funny, bright, cheerful kid he always was. He still has a wonderful, full life and lots of friends. Especially these days with the medical technology at our disposal, it doesn't have to slow a kid down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My son is 5 and he was diagnosed at 2.5 years old. The first few weeks are SO overwhelming. It&amp;#39;s a very scary disease, I know, and there&amp;#39;s so much to learn and you feel like, how on Earth can I be trusted to keep.my kid alive all by myself on a daily basis?&lt;/p&gt;\n\n&lt;p&gt;Take it day by day for right now. What we did is put up a big whiteboard in the dining room with insulin to carb ratios and wrote down his blood sugars, carbs eaten etc throughout the day. That made it less daunting than trying to write it all down in a notebook or something.&lt;/p&gt;\n\n&lt;p&gt;Allow yourself time to grieve. You&amp;#39;re going to grieve the way things were. Her freedom to eat whatever and not think about it. To not wake up in the middle of the night to check blood sugars and adjust, etc. To not fear for your child&amp;#39;s life on a regular basis. Your life will never be the same and neither will hers....But you guys will find your new normal. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t coddle her. Let her take on the responsibilities slowly but steadily. She&amp;#39;s going to feel more confident when she has all the information and is directly involved with her care.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t participate in them much anymore, but when my kid first got diagnosed, FB groups for parents of T1D kids were invaluable to me. The veteran moms and dads know a lot of the tricks for all the bumps you&amp;#39;ll run into. Managing T1D is as much an art as a science (things can change hour by hour, day by day, etc depending on weather, growth hormones, etc) so asking experienced people is a huge help.&lt;/p&gt;\n\n&lt;p&gt;And look into a Dexcom CGM when life settles down a bit.&lt;/p&gt;\n\n&lt;p&gt;This is a tough row to hoe, but you&amp;#39;ll get there. I&amp;#39;m so sorry.&lt;/p&gt;\n\n&lt;p&gt;ETA: he&amp;#39;s still the same funny, bright, cheerful kid he always was. He still has a wonderful, full life and lots of friends. Especially these days with the medical technology at our disposal, it doesn&amp;#39;t have to slow a kid down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbomgs", "score_hidden": false, "stickied": false, "created": 1492345943.0, "created_utc": 1492317143.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgc7mfw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wdc331", "parent_id": "t1_dgc6mzq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Glad it helped. I'm here anytime you have questions!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad it helped. I&amp;#39;m here anytime you have questions!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc7mfw", "score_hidden": false, "stickied": false, "created": 1492388339.0, "created_utc": 1492359539.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6mzq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgby8w8", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This is extremely informative, thank you! I've saved it and might end up PMing you at some point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is extremely informative, thank you! I&amp;#39;ve saved it and might end up PMing you at some point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc6mzq", "score_hidden": false, "stickied": false, "created": 1492387005.0, "created_utc": 1492358205.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgby8w8", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Wdc331", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Hey there! I'm a type 1, diagnosed at about the same age as your daughter more than 30 years ago. I know it all seems overwhelming and scary right now, but I assure you it all becomes normal and much easier. Also, technology has come such a long way; when I was your daughter's age, my diagnosis came with my parents being told I probably wouldn't live past 30 and would absolutely have severe complications by my 20s. Thanks to some amazing improvements, I'm well into my 30s and completely healthy (other than this lazy pancreas). I've run marathons, had a baby, backpacked, etc. Your daughter is diagnosed at a time when T1D is no longer expected to have a significant impact on life expectancy and complications are rare thanks to much better tools. \n\nYou'll probably figure out quickly that the shots really aren't a big deal. The frustrating part is the managing of blood sugar levels. First, get a Dexcom if you can. They are amazing tools and can help much figuring out how to time insulin, food, activity, etc. Of all the improvements I've seen over my lifetime, the Dex is by far the most amazing and life-changing. The G5 model works with iPhones (so you will need to get your daughter an iPhone) but this will allow you to see her blood sugar all the time. I cannot emphasize enough how amazing this tool is. \n\nA pump is also a really good option, especially for a small child who is insulin sensitive. Talk to your endo and be aggressive. They may want you to wait a bit before moving to a pump and that's fine, but there's no reason to wait on the Dex. \n\nCheck out The Juicebox Podcast. Scott is a father of a T1 girl and he's done an amazing job at managing her diabetes. \n\nIf you're able to get a Dexcom, I would also get the book sugar surfing. It's a book about using the Dex to manage T1 in a more dynamic fashion. This is the approach I use and it's really helped me, both in achieving a better a1c and living more \"normally.\" \n\nKeep in mind that her numbers are going to be crazy for awhile. It will take some time to figure out how to use insulin, plus there's the honeymoon period, etc. \n\nThere are TONS of people online who are ready and able to help you at any time. The \"Diabetes Online Community\" (DOC) is huge and wonderful. There are forums, Facebook groups, /r/diabetes, etc. Use these resources. \n\nYou'll encounter a lot of idiocy around diabetes in general, especially type 1. Get used to educating people. \n\nWhen you get scared, remember that people like me grew up in the diabetes dark ages (rarely checking blood sugar, old insulins, not knowing carb counting, etc) and most of us are still alive and pretty healthy. And your daughter is going to have way better care than we did! \n\nTake care of yourself. Seriously. Caregiver burnout is a thing but also remember that T1D does have a genetic component (along with some sort of environmental trigger). The genetic component is believed to be paternally associated so make sure to watch out for your own health. I know two fathers now who were diagnosed with T1D right around the time their children were diagnosed. T1D can develop in adults! One of the dads became severely ill when his diabetes was misdiagnosed as T2. \n\nI realize you're probably spinning right now but please don't lose sight that while T1D is a serious chronic medical issue, it's completely manageable. And it comes with a really cool community of people!! \n\nDon't hesitate to PM me if you have any questions. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey there! I&amp;#39;m a type 1, diagnosed at about the same age as your daughter more than 30 years ago. I know it all seems overwhelming and scary right now, but I assure you it all becomes normal and much easier. Also, technology has come such a long way; when I was your daughter&amp;#39;s age, my diagnosis came with my parents being told I probably wouldn&amp;#39;t live past 30 and would absolutely have severe complications by my 20s. Thanks to some amazing improvements, I&amp;#39;m well into my 30s and completely healthy (other than this lazy pancreas). I&amp;#39;ve run marathons, had a baby, backpacked, etc. Your daughter is diagnosed at a time when T1D is no longer expected to have a significant impact on life expectancy and complications are rare thanks to much better tools. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll probably figure out quickly that the shots really aren&amp;#39;t a big deal. The frustrating part is the managing of blood sugar levels. First, get a Dexcom if you can. They are amazing tools and can help much figuring out how to time insulin, food, activity, etc. Of all the improvements I&amp;#39;ve seen over my lifetime, the Dex is by far the most amazing and life-changing. The G5 model works with iPhones (so you will need to get your daughter an iPhone) but this will allow you to see her blood sugar all the time. I cannot emphasize enough how amazing this tool is. &lt;/p&gt;\n\n&lt;p&gt;A pump is also a really good option, especially for a small child who is insulin sensitive. Talk to your endo and be aggressive. They may want you to wait a bit before moving to a pump and that&amp;#39;s fine, but there&amp;#39;s no reason to wait on the Dex. &lt;/p&gt;\n\n&lt;p&gt;Check out The Juicebox Podcast. Scott is a father of a T1 girl and he&amp;#39;s done an amazing job at managing her diabetes. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re able to get a Dexcom, I would also get the book sugar surfing. It&amp;#39;s a book about using the Dex to manage T1 in a more dynamic fashion. This is the approach I use and it&amp;#39;s really helped me, both in achieving a better a1c and living more &amp;quot;normally.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Keep in mind that her numbers are going to be crazy for awhile. It will take some time to figure out how to use insulin, plus there&amp;#39;s the honeymoon period, etc. &lt;/p&gt;\n\n&lt;p&gt;There are TONS of people online who are ready and able to help you at any time. The &amp;quot;Diabetes Online Community&amp;quot; (DOC) is huge and wonderful. There are forums, Facebook groups, &lt;a href=\"/r/diabetes\"&gt;/r/diabetes&lt;/a&gt;, etc. Use these resources. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll encounter a lot of idiocy around diabetes in general, especially type 1. Get used to educating people. &lt;/p&gt;\n\n&lt;p&gt;When you get scared, remember that people like me grew up in the diabetes dark ages (rarely checking blood sugar, old insulins, not knowing carb counting, etc) and most of us are still alive and pretty healthy. And your daughter is going to have way better care than we did! &lt;/p&gt;\n\n&lt;p&gt;Take care of yourself. Seriously. Caregiver burnout is a thing but also remember that T1D does have a genetic component (along with some sort of environmental trigger). The genetic component is believed to be paternally associated so make sure to watch out for your own health. I know two fathers now who were diagnosed with T1D right around the time their children were diagnosed. T1D can develop in adults! One of the dads became severely ill when his diabetes was misdiagnosed as T2. &lt;/p&gt;\n\n&lt;p&gt;I realize you&amp;#39;re probably spinning right now but please don&amp;#39;t lose sight that while T1D is a serious chronic medical issue, it&amp;#39;s completely manageable. And it comes with a really cool community of people!! &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t hesitate to PM me if you have any questions. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgby8w8", "score_hidden": false, "stickied": false, "created": 1492372025.0, "created_utc": 1492343225.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgc6gln", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgbqhrb", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for this. It's great hearing about people who didn't let it affect them ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. It&amp;#39;s great hearing about people who didn&amp;#39;t let it affect them &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc6gln", "score_hidden": false, "stickied": false, "created": 1492386767.0, "created_utc": 1492357967.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbqhrb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "likeateatrayinthesky", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't have a kid with it, but my friend has had type 1 since she was little. She got the pump in highschool(when it came out), played highschool sports, and now is married and has a toddler. It never stopped her from her goals.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t have a kid with it, but my friend has had type 1 since she was little. She got the pump in highschool(when it came out), played highschool sports, and now is married and has a toddler. It never stopped her from her goals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbqhrb", "score_hidden": false, "stickied": false, "created": 1492349364.0, "created_utc": 1492320564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgc8ole", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "GanoBlivia", "parent_id": "t1_dgbrz2c", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This must be very dependent on the hospital staff. \n\nThey were very nice, but my son (6 at the time of diagnosis) felt like they were treating him like a baby. Maybe it's how they spoke to him, but the visit with the social worker made him feel significantly worse. The Teddy did not last long in our house. \n\nJust wanted to point out that it's okay if OP's daughter doesn't have the same experience with child life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This must be very dependent on the hospital staff. &lt;/p&gt;\n\n&lt;p&gt;They were very nice, but my son (6 at the time of diagnosis) felt like they were treating him like a baby. Maybe it&amp;#39;s how they spoke to him, but the visit with the social worker made him feel significantly worse. The Teddy did not last long in our house. &lt;/p&gt;\n\n&lt;p&gt;Just wanted to point out that it&amp;#39;s okay if OP&amp;#39;s daughter doesn&amp;#39;t have the same experience with child life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc8ole", "score_hidden": false, "stickied": false, "created": 1492389740.0, "created_utc": 1492360940.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbrz2c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dgbp7kv", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Before you leave the hospital see if you can arrange a visit from child-life. They are amazing and they know how to talk to children about this sort of thing. Our child life social worker gave my 6 year old a teddy bear and taught him how to put in an IV using a real needle and cannula. Teddy came to the hospital with us for years, and now almost 10 years later that teddy bear still has pride of place in my teen's room; the cannula has fallen out but teddy's paw still has the original tape. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Before you leave the hospital see if you can arrange a visit from child-life. They are amazing and they know how to talk to children about this sort of thing. Our child life social worker gave my 6 year old a teddy bear and taught him how to put in an IV using a real needle and cannula. Teddy came to the hospital with us for years, and now almost 10 years later that teddy bear still has pride of place in my teen&amp;#39;s room; the cannula has fallen out but teddy&amp;#39;s paw still has the original tape. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbrz2c", "score_hidden": false, "stickied": false, "created": 1492352660.0, "created_utc": 1492323860.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgbw2g1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rumour58259", "parent_id": "t1_dgbp7kv", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There's a bear you can get from JDRF called Rufus that is a diabetic bear. You can also get story books and other things with him to help the kids understand more, and to feel like they have a friend that's the same as them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a bear you can get from JDRF called Rufus that is a diabetic bear. You can also get story books and other things with him to help the kids understand more, and to feel like they have a friend that&amp;#39;s the same as them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbw2g1", "score_hidden": false, "stickied": false, "created": 1492364897.0, "created_utc": 1492336097.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbp7kv", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgbn8if", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We actually just met our night nurse who was diagnosed when she was 3 years old. She answered so many of our questions it made me feel a bit better about things we can do in the future to make our child's life easier. I also really liked your idea about a bear with diabetes. Maybe we'll decide one of her billion stuffed animals has been diagnosed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We actually just met our night nurse who was diagnosed when she was 3 years old. She answered so many of our questions it made me feel a bit better about things we can do in the future to make our child&amp;#39;s life easier. I also really liked your idea about a bear with diabetes. Maybe we&amp;#39;ll decide one of her billion stuffed animals has been diagnosed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbp7kv", "score_hidden": false, "stickied": false, "created": 1492346986.0, "created_utc": 1492318186.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbn8if", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Malleekarri", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Oh I'm so sorry. Poor little girl. Poor you. :( \n\nI think it might help both you and your kiddo to learn about ways to deal with anger and frustration arising from this, because diabetes is shitty. It changes the way you live and it's really not fair. Maybe you could get her a bear or something that also has diabetes? Letting the bear get mad about it and throw over-the-top tantrums and try to run away from its diabetes might help her to see how diabetes makes her feel. \n\n I'm sure the hospital and other more knowledgeable parents will have some better advice... I'm sorry, though. I wish you all the best and big internet hugs for all of you. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I&amp;#39;m so sorry. Poor little girl. Poor you. :( &lt;/p&gt;\n\n&lt;p&gt;I think it might help both you and your kiddo to learn about ways to deal with anger and frustration arising from this, because diabetes is shitty. It changes the way you live and it&amp;#39;s really not fair. Maybe you could get her a bear or something that also has diabetes? Letting the bear get mad about it and throw over-the-top tantrums and try to run away from its diabetes might help her to see how diabetes makes her feel. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure the hospital and other more knowledgeable parents will have some better advice... I&amp;#39;m sorry, though. I wish you all the best and big internet hugs for all of you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbn8if", "score_hidden": false, "stickied": false, "created": 1492343597.0, "created_utc": 1492314797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgbycev", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wdc331", "parent_id": "t1_dgbpa79", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You need to talk with the school and get a 504 plan in place (I'm assuming you're in the US). Scott Benner (Arden's Day, the Juicebox Podcast) has tons of resources about working with schools to deal with the management stuff. As i noted in my other response, a Dexcom is key. Every parent of a T1 I know has one, and their kid carries an iPhone to school so that everyone can remotely monitor BGs throughout the day. \n\nFor insulin administration, yes, a nurse, nurse tech, or parent will need to be involved but this varies by school system. Pump therapy can be really helpful for school aged children because the pump is always on them. From parents I know of T1 kids, this seems to result in greater flexibility of who can do the dosing (for example, one parent I know with a T1 kindergartner was able to get the teacher trained to bolus before lunch. This way, the kid doesn't have to visit the nurse's office). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to talk with the school and get a 504 plan in place (I&amp;#39;m assuming you&amp;#39;re in the US). Scott Benner (Arden&amp;#39;s Day, the Juicebox Podcast) has tons of resources about working with schools to deal with the management stuff. As i noted in my other response, a Dexcom is key. Every parent of a T1 I know has one, and their kid carries an iPhone to school so that everyone can remotely monitor BGs throughout the day. &lt;/p&gt;\n\n&lt;p&gt;For insulin administration, yes, a nurse, nurse tech, or parent will need to be involved but this varies by school system. Pump therapy can be really helpful for school aged children because the pump is always on them. From parents I know of T1 kids, this seems to result in greater flexibility of who can do the dosing (for example, one parent I know with a T1 kindergartner was able to get the teacher trained to bolus before lunch. This way, the kid doesn&amp;#39;t have to visit the nurse&amp;#39;s office). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbycev", "score_hidden": false, "stickied": false, "created": 1492372295.0, "created_utc": 1492343495.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgdrul0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dinosaur_boots", "parent_id": "t1_dgbpa79", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm not sure how things went in the beginning for my student, but now, in grade 6, she checks her own blood and takes her own insulin.  She does this under the supervision of a trained TA (teacher assistant).  All numbers are recorded in a notebook, and the TA also texts her mother her sugar number right away.  Also, there is a written medical emergency plan in place for my student (board policy) that was created during a meeting between the parents and the school.  \n\nFor reference, we live in a small town on the East Coast of Canada.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure how things went in the beginning for my student, but now, in grade 6, she checks her own blood and takes her own insulin.  She does this under the supervision of a trained TA (teacher assistant).  All numbers are recorded in a notebook, and the TA also texts her mother her sugar number right away.  Also, there is a written medical emergency plan in place for my student (board policy) that was created during a meeting between the parents and the school.  &lt;/p&gt;\n\n&lt;p&gt;For reference, we live in a small town on the East Coast of Canada.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdrul0", "score_hidden": false, "stickied": false, "created": 1492477848.0, "created_utc": 1492449048.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbpa79", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgbnbye", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you for the info. She starts school this fall and has been in daycare for years, so monitoring and if needed dosing at school is a concern for us. Does she do her own blood checks? What about if she needs insulin, does the nurse do that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the info. She starts school this fall and has been in daycare for years, so monitoring and if needed dosing at school is a concern for us. Does she do her own blood checks? What about if she needs insulin, does the nurse do that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbpa79", "score_hidden": false, "stickied": false, "created": 1492347124.0, "created_utc": 1492318324.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnbye", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dinosaur_boots", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Sorry to hear this, it's definitely​ tough. You can do it though! You'll learn a lot fast. And you'll keep learning. I'm an elementary school teacher and this year is the second time In teaching a student who is diabetic. This student was diagnosed at age 5, and she is 11 now. She's doing great! Her sugar is constantly checked, and adjustments are made as needed. I know it's not easy, but you'll adjust to your new normal. You can do it!!!  Learn what you can and ask lots of questions. Lots of love to you and your daughter! \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to hear this, it&amp;#39;s definitely​ tough. You can do it though! You&amp;#39;ll learn a lot fast. And you&amp;#39;ll keep learning. I&amp;#39;m an elementary school teacher and this year is the second time In teaching a student who is diabetic. This student was diagnosed at age 5, and she is 11 now. She&amp;#39;s doing great! Her sugar is constantly checked, and adjustments are made as needed. I know it&amp;#39;s not easy, but you&amp;#39;ll adjust to your new normal. You can do it!!!  Learn what you can and ask lots of questions. Lots of love to you and your daughter! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbnbye", "score_hidden": false, "stickied": false, "created": 1492343751.0, "created_utc": 1492314951.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgc5j0v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Farkerisme", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I was diagnosed at age 23 as a type 1 diabetic.  My mom definitely cried.  It's part of the process.\n\nThe huge saving grace is that things are so much better today for diabetics.  With your help, she is going to be just fine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was diagnosed at age 23 as a type 1 diabetic.  My mom definitely cried.  It&amp;#39;s part of the process.&lt;/p&gt;\n\n&lt;p&gt;The huge saving grace is that things are so much better today for diabetics.  With your help, she is going to be just fine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc5j0v", "score_hidden": false, "stickied": false, "created": 1492385493.0, "created_utc": 1492356693.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgca67i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "temp1324", "parent_id": "t1_dgc9xpt", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Don't feel bad. It is your job to be business as usual. Take that attitude that this is just what we have to do so we can go back to having fun / doing whatever we're doing. It's no different than any other bodily function. Sometimes we have to go to the bathroom, sometimes we have to eat, and sometimes we have to get our sugar checked and get a shot. If you don't make a big deal of it, she wont. Be understanding that it is uncomfortable but don't allow it to be a major issue.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t feel bad. It is your job to be business as usual. Take that attitude that this is just what we have to do so we can go back to having fun / doing whatever we&amp;#39;re doing. It&amp;#39;s no different than any other bodily function. Sometimes we have to go to the bathroom, sometimes we have to eat, and sometimes we have to get our sugar checked and get a shot. If you don&amp;#39;t make a big deal of it, she wont. Be understanding that it is uncomfortable but don&amp;#39;t allow it to be a major issue.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgca67i", "score_hidden": false, "stickied": false, "created": 1492391670.0, "created_utc": 1492362870.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9xpt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgc9n2d", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Good to hear. It does seem like technology with pumps and BG monitors have made living a normal life much easier. Hopefully these artificial pancreas products get even better and at some point (probably years away, but still) she won't have to do much of anything. Just so much to take in and handle, especially as we don't start on pumps and monitors immediately so we have to do finger pricks and shots. I feel horrible everytime and it's only been 36 hours.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good to hear. It does seem like technology with pumps and BG monitors have made living a normal life much easier. Hopefully these artificial pancreas products get even better and at some point (probably years away, but still) she won&amp;#39;t have to do much of anything. Just so much to take in and handle, especially as we don&amp;#39;t start on pumps and monitors immediately so we have to do finger pricks and shots. I feel horrible everytime and it&amp;#39;s only been 36 hours.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc9xpt", "score_hidden": false, "stickied": false, "created": 1492391354.0, "created_utc": 1492362554.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9n2d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "temp1324", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There's a 7 year old in the first grade classroom i work in that has type 1. Her diabetes is well managed and she is a very happy child. Kids don't know the difference. She genuinely plays the same as everyone else and participates in gym as well.\n\nLiterally, she'll be fine. It will take work and extra care to set her up and maintain her health but she will be just like every other child.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a 7 year old in the first grade classroom i work in that has type 1. Her diabetes is well managed and she is a very happy child. Kids don&amp;#39;t know the difference. She genuinely plays the same as everyone else and participates in gym as well.&lt;/p&gt;\n\n&lt;p&gt;Literally, she&amp;#39;ll be fine. It will take work and extra care to set her up and maintain her health but she will be just like every other child.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc9n2d", "score_hidden": false, "stickied": false, "created": 1492390963.0, "created_utc": 1492362163.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgcv6jr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "biglebowski55", "parent_id": "t1_dgc6d52", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She's 16 now, so technology can only be better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s 16 now, so technology can only be better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcv6jr", "score_hidden": false, "stickied": false, "created": 1492419627.0, "created_utc": 1492390827.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6d52", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgbxdzl", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Yeah there seems to be a ton of recommendations for the dexcom and pumps. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah there seems to be a ton of recommendations for the dexcom and pumps. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc6d52", "score_hidden": false, "stickied": false, "created": 1492386638.0, "created_utc": 1492357838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxdzl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "biglebowski55", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My baby niece was diagnosed just before she turned two. It was so hard at first, giving her so many injections and trying to force her to eat certain amounts. But it got so much easier. She grew up understanding how to take care of herself and read nutrition labels. She got a pump and can give herself insulin without injections. It's a very manageable disease. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My baby niece was diagnosed just before she turned two. It was so hard at first, giving her so many injections and trying to force her to eat certain amounts. But it got so much easier. She grew up understanding how to take care of herself and read nutrition labels. She got a pump and can give herself insulin without injections. It&amp;#39;s a very manageable disease. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbxdzl", "score_hidden": false, "stickied": false, "created": 1492369405.0, "created_utc": 1492340605.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgcwh09", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fuckface94", "parent_id": "t1_dgc6bx5", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Town of maybe a 1000 in east Texas. Ignorance ran deep", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Town of maybe a 1000 in east Texas. Ignorance ran deep&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcwh09", "score_hidden": false, "stickied": false, "created": 1492421277.0, "created_utc": 1492392477.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc6bx5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgbxlbf", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Wow... Let's hope her school admins don't end up like that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow... Let&amp;#39;s hope her school admins don&amp;#39;t end up like that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgc6bx5", "score_hidden": false, "stickied": false, "created": 1492386593.0, "created_utc": 1492357793.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgbxlbf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fuckface94", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My sisters friend was diagnosed in elementary school, teachers there were great about it. Jr high principal not so much, kid had discipline problems and the principal accused him of rubbing sugar on his skin to mess with his levels to get out of class. Yes an educator was that uninformed and is now our superintendent. Hopefully she never runs into ignorant people like he did.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My sisters friend was diagnosed in elementary school, teachers there were great about it. Jr high principal not so much, kid had discipline problems and the principal accused him of rubbing sugar on his skin to mess with his levels to get out of class. Yes an educator was that uninformed and is now our superintendent. Hopefully she never runs into ignorant people like he did.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgbxlbf", "score_hidden": false, "stickied": false, "created": 1492370057.0, "created_utc": 1492341257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgd5ya7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgcwl6v", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I went to the grocery store and have never felt so overwhelmed in my life. Trying to get things she likes while battling back against the carbs. I don't want her to feel like everything changed all of a sudden. Sure you need some shots but you can still eat these things you like! Even got her a low carb ice cream bar for a special treat tomorrow but told her have to eat it when we have lunch or dinner. Thanks for the food suggestions, carrots are misleading. They said it was a free food which seems completely wrong based on the packaging nutrition", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went to the grocery store and have never felt so overwhelmed in my life. Trying to get things she likes while battling back against the carbs. I don&amp;#39;t want her to feel like everything changed all of a sudden. Sure you need some shots but you can still eat these things you like! Even got her a low carb ice cream bar for a special treat tomorrow but told her have to eat it when we have lunch or dinner. Thanks for the food suggestions, carrots are misleading. They said it was a free food which seems completely wrong based on the packaging nutrition&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgd5ya7", "score_hidden": false, "stickied": false, "created": 1492436030.0, "created_utc": 1492407230.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwl6v", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "writerwhocantspell", "parent_id": "t1_dgcsbte", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The older one is still in the \"honeymoon phase\" (not sure if that's a technical term or if mom and dad made that up), so her body still spits out a little insulin here and there, which makes her sugar spike and drop fairly randomly. This usually only lasts a few months before the pancreas gives it up completely. After that, once her levels are more predictable, they'll get her on the pump too. And I can't wait for that to happen -- it's going to simplify everything. \n\nAgain, I'm sure you're overwhelmed with tips and suggestions right now, but for what it's worth: We try to keep snacking all low carb if at all possible (this is somewhat complicated by the fact that the little one seemingly has an endless stomach capacity), which means we can *usually* get away with only giving insulin at meals. \n\nSnack ideas under 15 carbs:\n- Lunch meat (turkey, ham, bologna): 1 slice = less than 1 carb\n- Salami: 1 slice = less than 0.5 carbs\n- Almonds: 1/2 cup = 15 carbs\n- Boiled eggs: 1 egg = 0.6 carbs\n- Gogurt: 1 tube = 13 carbs\n- Carrots: 1 baby carrot = approx. 1 carb\n- Broccoli: 1 cup = 6 carbs\n- Ranch dressing (for dipping veggies): 1 tablespoon = 1 carb\n- Hummus (for with veggies): 1 tablespoon = 2 carbs\n- String cheese: 1 stick = 1 carb\n- Edamame: 1 cup = 15 carbs\n\nI hope that helps give you a place to start :) I don't claim to be an expert, but I'm learning a little more every day. Feel free to PM me if you need a sounding board!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The older one is still in the &amp;quot;honeymoon phase&amp;quot; (not sure if that&amp;#39;s a technical term or if mom and dad made that up), so her body still spits out a little insulin here and there, which makes her sugar spike and drop fairly randomly. This usually only lasts a few months before the pancreas gives it up completely. After that, once her levels are more predictable, they&amp;#39;ll get her on the pump too. And I can&amp;#39;t wait for that to happen -- it&amp;#39;s going to simplify everything. &lt;/p&gt;\n\n&lt;p&gt;Again, I&amp;#39;m sure you&amp;#39;re overwhelmed with tips and suggestions right now, but for what it&amp;#39;s worth: We try to keep snacking all low carb if at all possible (this is somewhat complicated by the fact that the little one seemingly has an endless stomach capacity), which means we can &lt;em&gt;usually&lt;/em&gt; get away with only giving insulin at meals. &lt;/p&gt;\n\n&lt;p&gt;Snack ideas under 15 carbs:\n- Lunch meat (turkey, ham, bologna): 1 slice = less than 1 carb\n- Salami: 1 slice = less than 0.5 carbs\n- Almonds: 1/2 cup = 15 carbs\n- Boiled eggs: 1 egg = 0.6 carbs\n- Gogurt: 1 tube = 13 carbs\n- Carrots: 1 baby carrot = approx. 1 carb\n- Broccoli: 1 cup = 6 carbs\n- Ranch dressing (for dipping veggies): 1 tablespoon = 1 carb\n- Hummus (for with veggies): 1 tablespoon = 2 carbs\n- String cheese: 1 stick = 1 carb\n- Edamame: 1 cup = 15 carbs&lt;/p&gt;\n\n&lt;p&gt;I hope that helps give you a place to start :) I don&amp;#39;t claim to be an expert, but I&amp;#39;m learning a little more every day. Feel free to PM me if you need a sounding board!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcwl6v", "score_hidden": false, "stickied": false, "created": 1492421422.0, "created_utc": 1492392622.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsbte", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgcowam", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thanks a lot for this! Interesting that the younger one is on the pump but the older one isn't. I think that at a cgm will help us feel more normal but in the end it'll be up to her. Already realizing how many carbs are in the things in our house as we just got home, so we need to hit up the store.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks a lot for this! Interesting that the younger one is on the pump but the older one isn&amp;#39;t. I think that at a cgm will help us feel more normal but in the end it&amp;#39;ll be up to her. Already realizing how many carbs are in the things in our house as we just got home, so we need to hit up the store.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcsbte", "score_hidden": false, "stickied": false, "created": 1492415769.0, "created_utc": 1492386969.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcowam", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "writerwhocantspell", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Nanny to two sisters, five and nine, who are both type one. The five-year-old was diagnosed at 16 months; the nine-year-old was diagnosed in December. I started watching them at the end of February.\n\nThe younger one is on the pump and it simplifies everything so, so much. For someone who had little exposure to diabetes before starting with them, it has been so easy to keep track of her carbs, blood glucose level, and such. The older girl is still getting shots for the time being and it just requires a lot more thinking, double checking, and second guessing.\n\nI'm sure you've had lots of advice, but I think the best thing to make sure she knows that she doesn't need to be excluded from anything because of this. Get her involved in cooking and teach her to understand carbs. My girls and I made cookies the other day and we talked about sugar substitutes and eating healthy and measuring food.\n\nThe other thing to keep in mind is that it seems like this is going to have a huge impact on her quality of life, but it doesn't have to. My girls don't see people as diabetic and not diabetic. It's not something they feel distances them from their peers. It's not something they are self conscious about. They're just little kids whose meal routine includes checking their sugar. They're happy and healthy and their lives are just as full as anyone else's.\n\nLike other commenters have said, take it one day at a time :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nanny to two sisters, five and nine, who are both type one. The five-year-old was diagnosed at 16 months; the nine-year-old was diagnosed in December. I started watching them at the end of February.&lt;/p&gt;\n\n&lt;p&gt;The younger one is on the pump and it simplifies everything so, so much. For someone who had little exposure to diabetes before starting with them, it has been so easy to keep track of her carbs, blood glucose level, and such. The older girl is still getting shots for the time being and it just requires a lot more thinking, double checking, and second guessing.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure you&amp;#39;ve had lots of advice, but I think the best thing to make sure she knows that she doesn&amp;#39;t need to be excluded from anything because of this. Get her involved in cooking and teach her to understand carbs. My girls and I made cookies the other day and we talked about sugar substitutes and eating healthy and measuring food.&lt;/p&gt;\n\n&lt;p&gt;The other thing to keep in mind is that it seems like this is going to have a huge impact on her quality of life, but it doesn&amp;#39;t have to. My girls don&amp;#39;t see people as diabetic and not diabetic. It&amp;#39;s not something they feel distances them from their peers. It&amp;#39;s not something they are self conscious about. They&amp;#39;re just little kids whose meal routine includes checking their sugar. They&amp;#39;re happy and healthy and their lives are just as full as anyone else&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;Like other commenters have said, take it one day at a time :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcowam", "score_hidden": false, "stickied": false, "created": 1492411083.0, "created_utc": 1492382283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65n66g", "likes": null, "replies": "", "user_reports": [], "id": "dgcs8b5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SweetToothKane", "parent_id": "t1_dgcs20m", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "All of the stories of normal lives are definitely reassuring. Thank you! We are home now and it's still a lot to take in (we need to go to the store because hardly anything in our house is low carb) but I'm sure we will deal. Sounds like for pumps though most of our nurses said that probably won't come for six to 12 months if we do decide to go that route. Guess we'll see where life takes us from here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All of the stories of normal lives are definitely reassuring. Thank you! We are home now and it&amp;#39;s still a lot to take in (we need to go to the store because hardly anything in our house is low carb) but I&amp;#39;m sure we will deal. Sounds like for pumps though most of our nurses said that probably won&amp;#39;t come for six to 12 months if we do decide to go that route. Guess we&amp;#39;ll see where life takes us from here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcs8b5", "score_hidden": false, "stickied": false, "created": 1492415637.0, "created_utc": 1492386837.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcs20m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "wellthatmusic", "parent_id": "t3_65n66g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "People have covered all the great pump options out there for kids today (do that - don't wait!) but I'm just here to chime in with warm fuzzies. My husband was diagnosed over 30 years ago and lives a 100% normal existence. We eat a very balanced diet and he checks his sugars, but he's very healthy, has a great career, we have one healthy kiddo and another healthy one on the way, lived abroad for years when he was younger by himself - he did whatever he wanted and was never any worse for the wear! Definitely look into getting a 504 plan for school just for your peace of mind. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People have covered all the great pump options out there for kids today (do that - don&amp;#39;t wait!) but I&amp;#39;m just here to chime in with warm fuzzies. My husband was diagnosed over 30 years ago and lives a 100% normal existence. We eat a very balanced diet and he checks his sugars, but he&amp;#39;s very healthy, has a great career, we have one healthy kiddo and another healthy one on the way, lived abroad for years when he was younger by himself - he did whatever he wanted and was never any worse for the wear! Definitely look into getting a 504 plan for school just for your peace of mind. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcs20m", "score_hidden": false, "stickied": false, "created": 1492415401.0, "created_utc": 1492386601.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]