[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just a bit of background: at my daughter&amp;#39;s middle school gym, French, computer class, and sometimes music are taught by specialized teachers. For all other courses, they have twin classes. Basically, one class will have a homeroom teacher who teaches math and science whereas their twin class will have a homeroom teacher that teaches English, geography, history, and drama and they switch depending on their schedule.&lt;/p&gt;\n\n&lt;p&gt;My daughter&amp;#39;s homeroom teacher has been great. My daughter loves science and he has been really good about accommodating her interest by giving her more information on topics that interest her. However, she&amp;#39;s been having repeated issues with her other teacher.&lt;/p&gt;\n\n&lt;p&gt;It started way back in September when they did literature circles. My daughter has a very high reading level miles ahead of her classmates. I don&amp;#39;t mean to brag but since she learnt to read it&amp;#39;s been consistently quite high. I understand the teacher has to work within the confines of the class but the book she was chosen to read was below normal 8th grade reading level. My daughter finished it early and got in trouble. I discussed it with the teacher and it was agreed that she wouldn&amp;#39;t bring her literature circle books home. She reads fast enough that she can complete assigned sections in class.&lt;/p&gt;\n\n&lt;p&gt;Then she started getting it trouble for not doing work in class when she has completed the class work. This has never been an issue before and usually teachers have let her read for fun. Apparently, this teacher finds that distracting. I told my daughter to doodle quietly while she waits for people to finish.&lt;/p&gt;\n\n&lt;p&gt;However, this incident takes the cake. Back in January, my daughter came home with a form signed by all her teachers indicating that she had been chosen to compete at an academic competition. The page wanted my permission and indicated that ALL her teachers had been made aware of classes she would miss and had authorized it. Perfect, I signed off.&lt;/p&gt;\n\n&lt;p&gt;A few weeks ago, they got a paired project in English class. They were assigned pairs. Since my daughter was missing a few of these classes she invited her partner to the house and they came up with a timeline and split the work. As far as I can tell, this boy did nothing. My daughter would come home and complete the portions he was supposed to be doing in class. She tried talking to her teacher and was dismissed.&lt;/p&gt;\n\n&lt;p&gt;Finally, my daughter was gone all day Wednesday for the competition. Project was due on Thursday. We don&amp;#39;t have a colour printer so the other kid said he would print it. He didn&amp;#39;t show up Thursday. They had English right after homeroom. The teacher yelled at my daughter, blamed everything on her, then told her that if she couldn&amp;#39;t hand in the project by lunch she would fail. Apparently, she told my daughter that she had been overly controlling, refused to let the boy do any of the work, couldn&amp;#39;t handle it herself and was blaming him so she could get an extra 4 days to finish it with the Easter weekend. &lt;/p&gt;\n\n&lt;p&gt;My daughter left the class sobbing and called me from the office. I told her to go to the librarian and print it. I would come pick her up and pay the cost (colour printing is like $1/page at their school). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m livid. I have emails documenting my daughter&amp;#39;s attempts to get this boy to do his share of the work. I have the teacher who signed off on my daughter missing class. Yet, somehow she was the one who got all the blame. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m usually a big fan of getting my daughter to stand up for herself since she&amp;#39;s kind of shy but clearly this has reached a point where I need to be involved. There&amp;#39;s 2.5 months left in the year so it&amp;#39;s not even like I can tell her to just deal.&lt;/p&gt;\n\n&lt;p&gt;I will say that in hindsight, I should have just taken my daughter somewhere to print the damn project. I was annoyed the kid wasn&amp;#39;t doing anything and figured he could at least take on the cost of printing since he claimed to have a colour printer. &lt;/p&gt;\n\n&lt;p&gt;What would you do?&lt;/p&gt;\n\n&lt;p&gt;TL/DR: My 13 year old daughter has had repeated issues with her English teacher which came to a head when she made my daughter cry about an assignment. Not sure how to handle it. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just a bit of background: at my daughter's middle school gym, French, computer class, and sometimes music are taught by specialized teachers. For all other courses, they have twin classes. Basically, one class will have a homeroom teacher who teaches math and science whereas their twin class will have a homeroom teacher that teaches English, geography, history, and drama and they switch depending on their schedule.\n\nMy daughter's homeroom teacher has been great. My daughter loves science and he has been really good about accommodating her interest by giving her more information on topics that interest her. However, she's been having repeated issues with her other teacher.\n\nIt started way back in September when they did literature circles. My daughter has a very high reading level miles ahead of her classmates. I don't mean to brag but since she learnt to read it's been consistently quite high. I understand the teacher has to work within the confines of the class but the book she was chosen to read was below normal 8th grade reading level. My daughter finished it early and got in trouble. I discussed it with the teacher and it was agreed that she wouldn't bring her literature circle books home. She reads fast enough that she can complete assigned sections in class.\n\nThen she started getting it trouble for not doing work in class when she has completed the class work. This has never been an issue before and usually teachers have let her read for fun. Apparently, this teacher finds that distracting. I told my daughter to doodle quietly while she waits for people to finish.\n\nHowever, this incident takes the cake. Back in January, my daughter came home with a form signed by all her teachers indicating that she had been chosen to compete at an academic competition. The page wanted my permission and indicated that ALL her teachers had been made aware of classes she would miss and had authorized it. Perfect, I signed off.\n\nA few weeks ago, they got a paired project in English class. They were assigned pairs. Since my daughter was missing a few of these classes she invited her partner to the house and they came up with a timeline and split the work. As far as I can tell, this boy did nothing. My daughter would come home and complete the portions he was supposed to be doing in class. She tried talking to her teacher and was dismissed.\n\nFinally, my daughter was gone all day Wednesday for the competition. Project was due on Thursday. We don't have a colour printer so the other kid said he would print it. He didn't show up Thursday. They had English right after homeroom. The teacher yelled at my daughter, blamed everything on her, then told her that if she couldn't hand in the project by lunch she would fail. Apparently, she told my daughter that she had been overly controlling, refused to let the boy do any of the work, couldn't handle it herself and was blaming him so she could get an extra 4 days to finish it with the Easter weekend. \n\nMy daughter left the class sobbing and called me from the office. I told her to go to the librarian and print it. I would come pick her up and pay the cost (colour printing is like $1/page at their school). \n\nI'm livid. I have emails documenting my daughter's attempts to get this boy to do his share of the work. I have the teacher who signed off on my daughter missing class. Yet, somehow she was the one who got all the blame. \n\nI'm usually a big fan of getting my daughter to stand up for herself since she's kind of shy but clearly this has reached a point where I need to be involved. There's 2.5 months left in the year so it's not even like I can tell her to just deal.\n\nI will say that in hindsight, I should have just taken my daughter somewhere to print the damn project. I was annoyed the kid wasn't doing anything and figured he could at least take on the cost of printing since he claimed to have a colour printer. \n\nWhat would you do?\n\nTL/DR: My 13 year old daughter has had repeated issues with her English teacher which came to a head when she made my daughter cry about an assignment. Not sure how to handle it. \n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "School", "id": "65q6aj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 122, "report_reasons": null, "author": "frustratedmom14", "saved": false, "mod_reports": [], "name": "t3_65q6aj", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "school", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65q6aj/repeated_issues_with_daughters_13_8th_grade/", "num_reports": null, "locked": false, "stickied": false, "created": 1492391509.0, "url": "https://www.reddit.com/r/Parenting/comments/65q6aj/repeated_issues_with_daughters_13_8th_grade/", "author_flair_text": null, "quarantine": false, "title": "Repeated issues with daughter's (13) 8th grade teacher", "created_utc": 1492362709.0, "distinguished": null, "media": null, "upvote_ratio": 0.97, "num_comments": 18, "visited": false, "subreddit_type": "public", "ups": 122}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": "", "user_reports": [], "id": "dgcckwt", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "kpawesome", "parent_id": "t1_dgccgz3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I totally agree.  It's easy as a teacher to get super defensive too.  You prepare for these situations like you're going to war but you have to be very diplomatic.  Please let us know how this turns out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I totally agree.  It&amp;#39;s easy as a teacher to get super defensive too.  You prepare for these situations like you&amp;#39;re going to war but you have to be very diplomatic.  Please let us know how this turns out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcckwt", "score_hidden": false, "stickied": false, "created": 1492394843.0, "created_utc": 1492366043.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dgccgz3", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "frustratedmom14", "parent_id": "t1_dgcc2mn", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Thank you. That's some great advice. It's way too easy to get defensive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. That&amp;#39;s some great advice. It&amp;#39;s way too easy to get defensive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgccgz3", "score_hidden": false, "stickied": false, "created": 1492394696.0, "created_utc": 1492365896.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": "", "user_reports": [], "id": "dgcw85f", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "Ivysub", "parent_id": "t1_dgcmvfg", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "What a lovely woman. I bet her life is full of joy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a lovely woman. I bet her life is full of joy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcw85f", "score_hidden": false, "stickied": false, "created": 1492420962.0, "created_utc": 1492392162.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmvfg", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "frustratedmom14", "parent_id": "t1_dgck1ya", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Yeah, it's mind-blowing that some teachers punish kids for finishing their work.\n\nHowever, I went to my sister's house after I posted this. My niece is a student teacher at the same school but she's teaching 7th grade. She told me this teacher isn't well-liked by the admin either so I'm definitely going to try and talk to someone. Apparently, her favourite hobby is to go to McDonalds for lunch everyday across the street so she can punish students who go there for lunch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, it&amp;#39;s mind-blowing that some teachers punish kids for finishing their work.&lt;/p&gt;\n\n&lt;p&gt;However, I went to my sister&amp;#39;s house after I posted this. My niece is a student teacher at the same school but she&amp;#39;s teaching 7th grade. She told me this teacher isn&amp;#39;t well-liked by the admin either so I&amp;#39;m definitely going to try and talk to someone. Apparently, her favourite hobby is to go to McDonalds for lunch everyday across the street so she can punish students who go there for lunch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcmvfg", "score_hidden": false, "stickied": false, "created": 1492408366.0, "created_utc": 1492379566.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": "", "user_reports": [], "id": "dgdgf8s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SlaughterhouseIce9", "parent_id": "t1_dgck1ya", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Stories like this make me a little happy I was homeschooled and self-paced. If I finished my work early *I got the rest of the day to myself*. My parents encouraged us to work quickly and correctly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stories like this make me a little happy I was homeschooled and self-paced. If I finished my work early &lt;em&gt;I got the rest of the day to myself&lt;/em&gt;. My parents encouraged us to work quickly and correctly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdgf8s", "score_hidden": false, "stickied": false, "created": 1492463439.0, "created_utc": 1492434639.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgck1ya", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Ivysub", "parent_id": "t1_dgcc2mn", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I had an English teacher like this. She was just waiting out her years until she could retire and just didn't care at all. We would get assigned a book, and ten questions a day about each chapter. We were supposed to read the book, and answer the questions in class.\n\nWell, the books were never exactly long, and of you'd read it the questions were very easy to answer. So I'd finish the end book in the first period, and be able to answer the questions in the first 15-20 of each subsequent period, which left me with 40-35 minutes of not a damn thing to do.\n\nSo I'd get in trouble. For being done early. Every period until I made her mark my work as it was done and she was forced to admit that I had done it to standard and wasn't rushing through it.\n\nThis woman was the ADVANCED English teacher. They figured we could handle ourselves and a shitty uninvolved teacher they couldn't get rid of was least likely to damage the kids who didn't need much help.\n\nShe never ever got better, she never changed her attitude, and she was always hateful towards me. I'd nip it in the bud now because I managed to end up with that woman for every single year of highschool English until I signed up for advanced English again in the last two years of highschool (which give you a sperate certification where I am) and ended up doing it in out of school hours and holidays with an amazing English teacher who volunteered his time to teach us.\n\nShe also took out her dislike of me on my sister who ended up in her classes once I was out of them. So it's worth fixing now, seriously.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had an English teacher like this. She was just waiting out her years until she could retire and just didn&amp;#39;t care at all. We would get assigned a book, and ten questions a day about each chapter. We were supposed to read the book, and answer the questions in class.&lt;/p&gt;\n\n&lt;p&gt;Well, the books were never exactly long, and of you&amp;#39;d read it the questions were very easy to answer. So I&amp;#39;d finish the end book in the first period, and be able to answer the questions in the first 15-20 of each subsequent period, which left me with 40-35 minutes of not a damn thing to do.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;d get in trouble. For being done early. Every period until I made her mark my work as it was done and she was forced to admit that I had done it to standard and wasn&amp;#39;t rushing through it.&lt;/p&gt;\n\n&lt;p&gt;This woman was the ADVANCED English teacher. They figured we could handle ourselves and a shitty uninvolved teacher they couldn&amp;#39;t get rid of was least likely to damage the kids who didn&amp;#39;t need much help.&lt;/p&gt;\n\n&lt;p&gt;She never ever got better, she never changed her attitude, and she was always hateful towards me. I&amp;#39;d nip it in the bud now because I managed to end up with that woman for every single year of highschool English until I signed up for advanced English again in the last two years of highschool (which give you a sperate certification where I am) and ended up doing it in out of school hours and holidays with an amazing English teacher who volunteered his time to teach us.&lt;/p&gt;\n\n&lt;p&gt;She also took out her dislike of me on my sister who ended up in her classes once I was out of them. So it&amp;#39;s worth fixing now, seriously.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgck1ya", "score_hidden": false, "stickied": false, "created": 1492404664.0, "created_utc": 1492375864.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcc2mn", "gilded": 0, "archived": false, "score": 163, "report_reasons": null, "author": "kpawesome", "parent_id": "t3_65q6aj", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm not familiar with middle school but in high school if you can't get anywhere talking to the teacher you should go to administration.  I would even encourage you to set up a parent/teacher conference and have an administrator and a counselor there.  Bring screen shots of all emails and records of any phone calls you may have had.  If administration can't help all parties come to an amicable solution, I would file a complaint with the school board.  This isn't going to end with the project being turned in.  Also, kill them with kindness.  Don't make accusation, no matter how true they may be.  I would approach it as, \"I'm a little confused as to why my daughter is having difficulty with this project/class.  Is there something she isn't telling me...I know a teacher would never support one student doing all of the work on a project...\"\n\nI teach high school.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not familiar with middle school but in high school if you can&amp;#39;t get anywhere talking to the teacher you should go to administration.  I would even encourage you to set up a parent/teacher conference and have an administrator and a counselor there.  Bring screen shots of all emails and records of any phone calls you may have had.  If administration can&amp;#39;t help all parties come to an amicable solution, I would file a complaint with the school board.  This isn&amp;#39;t going to end with the project being turned in.  Also, kill them with kindness.  Don&amp;#39;t make accusation, no matter how true they may be.  I would approach it as, &amp;quot;I&amp;#39;m a little confused as to why my daughter is having difficulty with this project/class.  Is there something she isn&amp;#39;t telling me...I know a teacher would never support one student doing all of the work on a project...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I teach high school.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcc2mn", "score_hidden": false, "stickied": false, "created": 1492394169.0, "created_utc": 1492365369.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 163}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": "", "user_reports": [], "id": "dgcbdcz", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "friklfrakl", "parent_id": "t1_dgcanp9", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This exactly. Speak with a principal/vice-principal. I used to work in specialized foster care homes and we worked closely with teachers. Unfortunately, good teachers are few and far between, while the majority of them are just benignly mediocre. It sounds like you landed yourself a real fucking winner in this one. In my experience, a good administrator can make up for any number of poor teachers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This exactly. Speak with a principal/vice-principal. I used to work in specialized foster care homes and we worked closely with teachers. Unfortunately, good teachers are few and far between, while the majority of them are just benignly mediocre. It sounds like you landed yourself a real fucking winner in this one. In my experience, a good administrator can make up for any number of poor teachers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcbdcz", "score_hidden": false, "stickied": false, "created": 1492393252.0, "created_utc": 1492364452.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcanp9", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "synapseheart", "parent_id": "t3_65q6aj", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm so sorry your daughter is going through this— reminds me of some of my middle school experiences :/ I really don't think the teacher is being reasonable here. Maybe the principal should get involved, if having a frank conversation with her goes nowhere? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry your daughter is going through this— reminds me of some of my middle school experiences :/ I really don&amp;#39;t think the teacher is being reasonable here. Maybe the principal should get involved, if having a frank conversation with her goes nowhere? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcanp9", "score_hidden": false, "stickied": false, "created": 1492392306.0, "created_utc": 1492363506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": "", "user_reports": [], "id": "dgcqf74", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "frustratedmom14", "parent_id": "t1_dgco3n9", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My daughter's home room teacher has been great about providing her supplemental texts she loves it. All her teachers before this year have been great about it too which is why I was so confused this year. \n\nI'm a big fan of her working out issues with classmates herself too since she's always been so shy but it was the accusation. Also, the fact that she realized there was a problem and didn't address it at any point in the 3 weeks they had to do the assignment. If she thought my daughter was being controlling she could have called me or spoken to her or any another mature course of action. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My daughter&amp;#39;s home room teacher has been great about providing her supplemental texts she loves it. All her teachers before this year have been great about it too which is why I was so confused this year. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a big fan of her working out issues with classmates herself too since she&amp;#39;s always been so shy but it was the accusation. Also, the fact that she realized there was a problem and didn&amp;#39;t address it at any point in the 3 weeks they had to do the assignment. If she thought my daughter was being controlling she could have called me or spoken to her or any another mature course of action. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcqf74", "score_hidden": false, "stickied": false, "created": 1492413199.0, "created_utc": 1492384399.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, "user_reports": [], "id": "dgco3n9", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "MadameLeotasHead", "parent_id": "t3_65q6aj", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She does have to consider the whole class, but differentiated instruction is a fairly basic responsibility. Many apply it to help students who are struggling, but it's just as important to differentiate for students who are advanced. If she is finishing work before other students she should, at minimum, absolutely be able to read silently. The teacher could also provide her with partnered texts or supplemental work as enrichment (not punishment). She is actively discouraging your child's development in this area. The partner thing is another issue, but I believe it's best to let students work out those issues between themselves and learn lessons about cooperation, responsibility, but the fact that she accused your daughter of trying to game for more time is unprofessional and troublesome. I would request a meeting - if you want to do it the \"nice\" way - meet with the teacher first. You can also request a counselor be present. If you want to be more aggressive request a meeting with the principal. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She does have to consider the whole class, but differentiated instruction is a fairly basic responsibility. Many apply it to help students who are struggling, but it&amp;#39;s just as important to differentiate for students who are advanced. If she is finishing work before other students she should, at minimum, absolutely be able to read silently. The teacher could also provide her with partnered texts or supplemental work as enrichment (not punishment). She is actively discouraging your child&amp;#39;s development in this area. The partner thing is another issue, but I believe it&amp;#39;s best to let students work out those issues between themselves and learn lessons about cooperation, responsibility, but the fact that she accused your daughter of trying to game for more time is unprofessional and troublesome. I would request a meeting - if you want to do it the &amp;quot;nice&amp;quot; way - meet with the teacher first. You can also request a counselor be present. If you want to be more aggressive request a meeting with the principal. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgco3n9", "score_hidden": false, "stickied": false, "created": 1492409989.0, "created_utc": 1492381189.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": "", "user_reports": [], "id": "dgcdyc2", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "jerseyojo", "parent_id": "t3_65q6aj", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": " Some teachers can be pure jackasses.  I would have told my daughter to only put her name on project. In this situation there's nothing you can do about the though.  Lazy class bro got lucky with his partner, daughter didn't.  I would  unfortunately go with the deal with it approach. Do your work and when finished, do it again and obnoxiously say you thought that you had to do lazy class bros work for the rest of the year like you did with the project. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some teachers can be pure jackasses.  I would have told my daughter to only put her name on project. In this situation there&amp;#39;s nothing you can do about the though.  Lazy class bro got lucky with his partner, daughter didn&amp;#39;t.  I would  unfortunately go with the deal with it approach. Do your work and when finished, do it again and obnoxiously say you thought that you had to do lazy class bros work for the rest of the year like you did with the project. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcdyc2", "score_hidden": false, "stickied": false, "created": 1492396694.0, "created_utc": 1492367894.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": "", "user_reports": [], "id": "dgcv3p4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "bandoflizards", "parent_id": "t3_65q6aj", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Talk to the administration.  But also be aware that it will almost certainly do nothing.  And be ok with that because there's not much else you'll be able to do.  And then, consider this a learning opportunity for her.  Thankfully, being that it's 8th grade and not high school, there aren't really any long term consequesnses as far as her grades go.  And in life, she is going to come across pains in the ass like this teacher.  She'll have crappy bosses, lazy coworkers, you name it, and she's going to need to know how to survive.  She is going to have to learn how to play their game.  So this teacher is unreasonable about working in class.  Pretend to still be reading because that's what she has to do.  She fails this assignment?  Well, it's stupid, but the teacher has final say.  Next time, print it herself.  It's an unfortunate lesson about not depending on people who aren't dependable.  It sucks and it's not fair.  That's life unfortunately.  So this is a perfect time for her to learn how to handle it anyway.  Get through it.  Play the game for the rest of the year.  And next year, move on to better teacher.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to the administration.  But also be aware that it will almost certainly do nothing.  And be ok with that because there&amp;#39;s not much else you&amp;#39;ll be able to do.  And then, consider this a learning opportunity for her.  Thankfully, being that it&amp;#39;s 8th grade and not high school, there aren&amp;#39;t really any long term consequesnses as far as her grades go.  And in life, she is going to come across pains in the ass like this teacher.  She&amp;#39;ll have crappy bosses, lazy coworkers, you name it, and she&amp;#39;s going to need to know how to survive.  She is going to have to learn how to play their game.  So this teacher is unreasonable about working in class.  Pretend to still be reading because that&amp;#39;s what she has to do.  She fails this assignment?  Well, it&amp;#39;s stupid, but the teacher has final say.  Next time, print it herself.  It&amp;#39;s an unfortunate lesson about not depending on people who aren&amp;#39;t dependable.  It sucks and it&amp;#39;s not fair.  That&amp;#39;s life unfortunately.  So this is a perfect time for her to learn how to handle it anyway.  Get through it.  Play the game for the rest of the year.  And next year, move on to better teacher.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcv3p4", "score_hidden": false, "stickied": false, "created": 1492419523.0, "created_utc": 1492390723.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65q6aj", "likes": null, "replies": "", "user_reports": [], "id": "dgd37x8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "therealdeviant", "parent_id": "t1_dgd2cio", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I knew I'd have to explain to my child that I don't want him doing what I did, but this is a second grader being targeted by a grown adult. Many parents had made complaints, and this teacher remained at the school for about four or five years. When my son got to second grade, there were parents that told me, \"God, she's a horrible teacher.\" I'm not really sure why the school did nothing, but I had about enough. Maybe they couldn't do anything - I don't know the procedure for how a teacher gets fired. After that incident, my kid had zero problems.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I knew I&amp;#39;d have to explain to my child that I don&amp;#39;t want him doing what I did, but this is a second grader being targeted by a grown adult. Many parents had made complaints, and this teacher remained at the school for about four or five years. When my son got to second grade, there were parents that told me, &amp;quot;God, she&amp;#39;s a horrible teacher.&amp;quot; I&amp;#39;m not really sure why the school did nothing, but I had about enough. Maybe they couldn&amp;#39;t do anything - I don&amp;#39;t know the procedure for how a teacher gets fired. After that incident, my kid had zero problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgd37x8", "score_hidden": false, "stickied": false, "created": 1492430966.0, "created_utc": 1492402166.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2cio", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Ev_3", "parent_id": "t1_dgcwy48", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "In my whole childhood I only ever saw my mum 'snap' once. She was, and still is, the least confrontational person in the world...almost to a fault. The situation which led to her going off involved a long term stand in teacher that was, for want of a better word, bullying me.\n\nI didn't even tell my mum what was happening, probably because I was too young to know an adult could 'be in the wrong' (I was about 7/8 years old). She only found out because a few of my classmates were telling their parents how horrible she was being to me for no reason. \n\nMy mum followed the same route as you, more or less. She had a word with the teacher in question and was told it was me overreacting to being moderately told off. Obviously this didn't sit right so she went to the head teacher who assured her there was no reason to be concerned because 'children are very sensitive at this age and I was probably acting out because I was missing my regular teacher'.\n\nFast forward a few weeks and nothing had improved, in fact I had got to the point were I was begging to stay home from school. Several back and forths more with the headteacher to no avail, my mum decided to come in to school unannounced and waited outside my class. In 10 minutes she'd seen and heard enough and stormed in to have it out with this teacher. She didn't threaten her or make her cry, but she did read her the riot act in front of all my friends and left her stuttering a half arsed explanation. \n\nI never in a million years came out of that situation believing the way to deal with things was to aggressively confront someone. I only remember how crazy it was seeing my mum do that...for me. I felt relieved and protected. \n\nAdults can be bullies and it goes without saying that those bullies can occupy positions of trust where they're able to get away with it because 'children overeact' or whatever. If you're a parent and can handle seeing the most precious thing in the world to you being targeted in any way shape or form and endure standing by with a cool head watching the proper procedures fail resolve things - congrats. You're a better person than most of us!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my whole childhood I only ever saw my mum &amp;#39;snap&amp;#39; once. She was, and still is, the least confrontational person in the world...almost to a fault. The situation which led to her going off involved a long term stand in teacher that was, for want of a better word, bullying me.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t even tell my mum what was happening, probably because I was too young to know an adult could &amp;#39;be in the wrong&amp;#39; (I was about 7/8 years old). She only found out because a few of my classmates were telling their parents how horrible she was being to me for no reason. &lt;/p&gt;\n\n&lt;p&gt;My mum followed the same route as you, more or less. She had a word with the teacher in question and was told it was me overreacting to being moderately told off. Obviously this didn&amp;#39;t sit right so she went to the head teacher who assured her there was no reason to be concerned because &amp;#39;children are very sensitive at this age and I was probably acting out because I was missing my regular teacher&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Fast forward a few weeks and nothing had improved, in fact I had got to the point were I was begging to stay home from school. Several back and forths more with the headteacher to no avail, my mum decided to come in to school unannounced and waited outside my class. In 10 minutes she&amp;#39;d seen and heard enough and stormed in to have it out with this teacher. She didn&amp;#39;t threaten her or make her cry, but she did read her the riot act in front of all my friends and left her stuttering a half arsed explanation. &lt;/p&gt;\n\n&lt;p&gt;I never in a million years came out of that situation believing the way to deal with things was to aggressively confront someone. I only remember how crazy it was seeing my mum do that...for me. I felt relieved and protected. &lt;/p&gt;\n\n&lt;p&gt;Adults can be bullies and it goes without saying that those bullies can occupy positions of trust where they&amp;#39;re able to get away with it because &amp;#39;children overeact&amp;#39; or whatever. If you&amp;#39;re a parent and can handle seeing the most precious thing in the world to you being targeted in any way shape or form and endure standing by with a cool head watching the proper procedures fail resolve things - congrats. You&amp;#39;re a better person than most of us!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgd2cio", "score_hidden": false, "stickied": false, "created": 1492429559.0, "created_utc": 1492400759.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwy48", "gilded": 0, "archived": false, "score": -7, "report_reasons": null, "author": "therealdeviant", "parent_id": "t1_dgcwsgh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I never said it was the correct answer. Nobody is perfect and I have lessons that I need to learn as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I never said it was the correct answer. Nobody is perfect and I have lessons that I need to learn as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcwy48", "score_hidden": false, "stickied": false, "created": 1492421904.0, "created_utc": 1492393104.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -7}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwsgh", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "Queen_Red", "parent_id": "t1_dgcnym3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "So teaching your son that making  threats and getting into someone's face until you make them cry was the correct answer?\n\nWay to handle it like an adult. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So teaching your son that making  threats and getting into someone&amp;#39;s face until you make them cry was the correct answer?&lt;/p&gt;\n\n&lt;p&gt;Way to handle it like an adult. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcwsgh", "score_hidden": false, "stickied": false, "created": 1492421693.0, "created_utc": 1492392893.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcnym3", "gilded": 0, "archived": false, "score": -20, "report_reasons": null, "author": "therealdeviant", "parent_id": "t3_65q6aj", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm not here to provide some kind of mature answer. My son is currently 9. Back when he was in second grade, he had a complete moron for a teacher. This woman would email me and tell me that I was not allowed to enter through the cafeteria entrance, in the morning, when dropping off my son. I forwarded it to the principal and he replied back to her, stating that was not against policy. This is the same teacher that stated that my son was not allowed to eat an apple for recess, because it got juice everywhere. Again, the principal had to speak with her, explaining that the rules stated that a healthy snack was to be eaten, which included apples.\n\nNeedless to say, I had already had enough of this imbecile; not sure why she wasn't fired, by this point, considering all the complaints by other parents. So anyway, she yelled at my son because he handed scissors to his classmate with the pointy end toward her. She yelled at my son and told him he could not participate in the project, which resulted in him crying. Again, he was in second grade. \n\nSo, after he told me this. I dropped my son off, waited until school started, to ensure that the teacher was in the classroom and then I walked in there and screamed into her face until she started crying. And then I kindly explained to her that if she ever yells at my son over some insignificant shit, I will turn her into a historical event. She has never yelled at my son again, I had a meeting with the principal, and this moron of a teacher eventually quit last year.\n\nI'm not saying you should do that, but when you try to handle shit properly and nothing is getting done, at some point, one has to realize that a different message has to be sent. In my case, it involved me devolving into a feces-slinging chimp.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not here to provide some kind of mature answer. My son is currently 9. Back when he was in second grade, he had a complete moron for a teacher. This woman would email me and tell me that I was not allowed to enter through the cafeteria entrance, in the morning, when dropping off my son. I forwarded it to the principal and he replied back to her, stating that was not against policy. This is the same teacher that stated that my son was not allowed to eat an apple for recess, because it got juice everywhere. Again, the principal had to speak with her, explaining that the rules stated that a healthy snack was to be eaten, which included apples.&lt;/p&gt;\n\n&lt;p&gt;Needless to say, I had already had enough of this imbecile; not sure why she wasn&amp;#39;t fired, by this point, considering all the complaints by other parents. So anyway, she yelled at my son because he handed scissors to his classmate with the pointy end toward her. She yelled at my son and told him he could not participate in the project, which resulted in him crying. Again, he was in second grade. &lt;/p&gt;\n\n&lt;p&gt;So, after he told me this. I dropped my son off, waited until school started, to ensure that the teacher was in the classroom and then I walked in there and screamed into her face until she started crying. And then I kindly explained to her that if she ever yells at my son over some insignificant shit, I will turn her into a historical event. She has never yelled at my son again, I had a meeting with the principal, and this moron of a teacher eventually quit last year.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying you should do that, but when you try to handle shit properly and nothing is getting done, at some point, one has to realize that a different message has to be sent. In my case, it involved me devolving into a feces-slinging chimp.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgcnym3", "score_hidden": false, "stickied": false, "created": 1492409801.0, "created_utc": 1492381001.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -20}}], "after": null, "before": null}}]