[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I would ignore them, but the kids hear. I used to ignore his remarks, but one day, I realized the kids were taking his remarks to heart. &lt;/p&gt;\n\n&lt;p&gt;My husband had bipolar disorder. It is very mild compared to many, but he does get in to these moods where he is just cranky and it can be hard to deal with.&lt;/p&gt;\n\n&lt;p&gt;Today, for example, we were supposed to have company over. Husband got upset over this. He HATES company coming over. In fact, he started working from home a few years ago and this has been death to my social life. He really gets upset and is just sure nothing is good enough from our cooking to our home. This company happened to be a relative (son-in-law). Later, however, I was talking about something I had read where the person was referenced as being controlling. It was not referencing him, it was just making conversation and me telling him about a story I read online. So he comes back with &amp;quot;well, you are controlling. If you were not, I would have more friends.&amp;quot; I was floored! He is always telling me how he does not need friends. On the occasion we do anything, I have drug him to it. I often have encouraged him to do something with someone, anyone. I will mention old coworkers that he used to have lunch with. He just is not interested.&lt;/p&gt;\n\n&lt;p&gt;Then later, we were cooking dinner. Change that, I was cooking dinner. I thought we were making it together, turned out, I was doing it alone. Then came a point when it was time to serve dinner where I needed a serving plate from a high shelf that I could not reach. I called for him to please come down and reach it for me. He got angry with me and said I only wanted his help because I was controlling him!&lt;/p&gt;\n\n&lt;p&gt;In the past, I would let these bad moods slide off my back. But now, I have had my own children repeat back things he has said. It really bothers me. For example, in the past, my husband did very little around the house until he worked from home. And even then, it took a while for him to get to where he helped much. It used to be that I did everything. And then my husband would maybe load the dishwasher and then go around singing his praises of what a wonderful husband he is. He even started calling himself &amp;quot;the kitchen b!tch.&amp;quot; I used to laugh that off. Until one day, one of my teens commented how dad does so much and why get married when you get stuck with all the work. I said umm..I do the laundry, the cleaning, the vaccuming, the school stuff, feeding everyone, I mean..cleaning the entire house, maintaining the cars, taxes, bills, etc etc etc. He had never even taken a child to a doctor, or fed a child really. Now days, maybe once a week he will make a meal for the children when I am not around. He does not even change diapers. He did change one today. But that is ONE. Out of the entire weekend, he changed one diaper. &lt;/p&gt;\n\n&lt;p&gt;In recent years, he has taken on the chore of waking the one child up for school and getting him on the bus. The reason he got this chore is because he likes to stay up all night and is often just heading to bed at 6am. He would get off work and go to bed. And then get up after 10pm. So I would do everything by myself with our children, including driving them everywhere, feeding them, reading, home work, getting them to bed, etc. Once all that is done, he will get up and sign on to the computer and play all night long. In the course of our marriage, he has never once done the taxes, or even looked over what I have done-he just signs it. He has no idea what is even in our bank account. &lt;/p&gt;\n\n&lt;p&gt;I feel like all my years of brushing off his bad moods has gotten my a bad reputation with my children. I do not want to have big fights, but I hate these remarks. He has always been like this and we have been married over 20 years. AND, he does have bipolar disorder and these remarks are a part of the swings he goes through, even though these are not severe issues, it still really bothers me. &lt;/p&gt;\n\n&lt;p&gt;So do not want advice on my marriage but rather how to approach this with the kids without reducing their dad in their eyes. They have the right to love and respect their dad, but they also have the right to love and respect their mom (me) and his remarks are tearing that down.&lt;/p&gt;\n\n&lt;p&gt;Edited to add: the bipolar disorder does matter because he gets psychosis with it. But not the kind of psychosis like you see in the movies. It is stuff like imagining he is being attacked and smelling things. I know that sounds so weird, but he thinks he smells things. I have had to deal with where he is going through an episode and he starts throwing away a bunch of stuff, one time, it was out couch. But usually it is stuff like all our shampoos and soaps and cleaning supplies. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I would ignore them, but the kids hear. I used to ignore his remarks, but one day, I realized the kids were taking his remarks to heart. \n\nMy husband had bipolar disorder. It is very mild compared to many, but he does get in to these moods where he is just cranky and it can be hard to deal with.\n\nToday, for example, we were supposed to have company over. Husband got upset over this. He HATES company coming over. In fact, he started working from home a few years ago and this has been death to my social life. He really gets upset and is just sure nothing is good enough from our cooking to our home. This company happened to be a relative (son-in-law). Later, however, I was talking about something I had read where the person was referenced as being controlling. It was not referencing him, it was just making conversation and me telling him about a story I read online. So he comes back with \"well, you are controlling. If you were not, I would have more friends.\" I was floored! He is always telling me how he does not need friends. On the occasion we do anything, I have drug him to it. I often have encouraged him to do something with someone, anyone. I will mention old coworkers that he used to have lunch with. He just is not interested.\n\nThen later, we were cooking dinner. Change that, I was cooking dinner. I thought we were making it together, turned out, I was doing it alone. Then came a point when it was time to serve dinner where I needed a serving plate from a high shelf that I could not reach. I called for him to please come down and reach it for me. He got angry with me and said I only wanted his help because I was controlling him!\n\nIn the past, I would let these bad moods slide off my back. But now, I have had my own children repeat back things he has said. It really bothers me. For example, in the past, my husband did very little around the house until he worked from home. And even then, it took a while for him to get to where he helped much. It used to be that I did everything. And then my husband would maybe load the dishwasher and then go around singing his praises of what a wonderful husband he is. He even started calling himself \"the kitchen b!tch.\" I used to laugh that off. Until one day, one of my teens commented how dad does so much and why get married when you get stuck with all the work. I said umm..I do the laundry, the cleaning, the vaccuming, the school stuff, feeding everyone, I mean..cleaning the entire house, maintaining the cars, taxes, bills, etc etc etc. He had never even taken a child to a doctor, or fed a child really. Now days, maybe once a week he will make a meal for the children when I am not around. He does not even change diapers. He did change one today. But that is ONE. Out of the entire weekend, he changed one diaper. \n\nIn recent years, he has taken on the chore of waking the one child up for school and getting him on the bus. The reason he got this chore is because he likes to stay up all night and is often just heading to bed at 6am. He would get off work and go to bed. And then get up after 10pm. So I would do everything by myself with our children, including driving them everywhere, feeding them, reading, home work, getting them to bed, etc. Once all that is done, he will get up and sign on to the computer and play all night long. In the course of our marriage, he has never once done the taxes, or even looked over what I have done-he just signs it. He has no idea what is even in our bank account. \n\nI feel like all my years of brushing off his bad moods has gotten my a bad reputation with my children. I do not want to have big fights, but I hate these remarks. He has always been like this and we have been married over 20 years. AND, he does have bipolar disorder and these remarks are a part of the swings he goes through, even though these are not severe issues, it still really bothers me. \n\nSo do not want advice on my marriage but rather how to approach this with the kids without reducing their dad in their eyes. They have the right to love and respect their dad, but they also have the right to love and respect their mom (me) and his remarks are tearing that down.\n\nEdited to add: the bipolar disorder does matter because he gets psychosis with it. But not the kind of psychosis like you see in the movies. It is stuff like imagining he is being attacked and smelling things. I know that sounds so weird, but he thinks he smells things. I have had to deal with where he is going through an episode and he starts throwing away a bunch of stuff, one time, it was out couch. But usually it is stuff like all our shampoos and soaps and cleaning supplies. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Family Life", "id": "65sziw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 22, "report_reasons": null, "author": "Iluvmychildren", "saved": false, "mod_reports": [], "name": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": 1492477993.0, "link_flair_css_class": "family-life", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65sziw/dh_makes_untrue_accusations_affects_the_kids/", "num_reports": null, "locked": false, "stickied": false, "created": 1492424703.0, "url": "https://www.reddit.com/r/Parenting/comments/65sziw/dh_makes_untrue_accusations_affects_the_kids/", "author_flair_text": null, "quarantine": false, "title": "DH makes untrue accusations, affects the kids", "created_utc": 1492395903.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 22}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgczwn2", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "TheHatOnTheCat", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Your husband is entitled, puts all of the work on you, and bad mouths you in front of/to your children. He does not treat you as an equal or with respect. Of course this will impact your children. If you don't want to change your marriage then I'm not sure how much you can do. \n\nWhy should your teenagers treat you with respect when their own father teaches them you aren't worth respect? That you are a lazy controlling nag ect? Likewise, your children are going to grow up thinking that this is how loving relationships work. They are going to insult belittle and not help their partners. Or maybe they (especially any daughters) will grow up thinking it is their place as a woman do all of the household work and just let themselves be verbally abused.\n\nWhy are you okay with this? You can be bipolar and not act this way. I have two close family friends who are bipolar and they do not behave so poorly. One now married man I have known my entire life and while he has struggled with depression issues that have impacted his life he always treated his wife with respect and helped her with household work. Your social life should also not be dead. He does withdraw during some periods but she still gets to have a social life. \n\nI guess you can argue logically back against him to lessen his ability to poison your children's view of you. So at least you can model not being a doormat. But I doubt this will go well and he will suddenly respect you. Maybe you could go to marriage counseling with him and he could attend personal therapy. But fundamentally he has to want to change and why should he after 20 cushy years of having a wife who does everything for him while she lets him get away with treating her like crap? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your husband is entitled, puts all of the work on you, and bad mouths you in front of/to your children. He does not treat you as an equal or with respect. Of course this will impact your children. If you don&amp;#39;t want to change your marriage then I&amp;#39;m not sure how much you can do. &lt;/p&gt;\n\n&lt;p&gt;Why should your teenagers treat you with respect when their own father teaches them you aren&amp;#39;t worth respect? That you are a lazy controlling nag ect? Likewise, your children are going to grow up thinking that this is how loving relationships work. They are going to insult belittle and not help their partners. Or maybe they (especially any daughters) will grow up thinking it is their place as a woman do all of the household work and just let themselves be verbally abused.&lt;/p&gt;\n\n&lt;p&gt;Why are you okay with this? You can be bipolar and not act this way. I have two close family friends who are bipolar and they do not behave so poorly. One now married man I have known my entire life and while he has struggled with depression issues that have impacted his life he always treated his wife with respect and helped her with household work. Your social life should also not be dead. He does withdraw during some periods but she still gets to have a social life. &lt;/p&gt;\n\n&lt;p&gt;I guess you can argue logically back against him to lessen his ability to poison your children&amp;#39;s view of you. So at least you can model not being a doormat. But I doubt this will go well and he will suddenly respect you. Maybe you could go to marriage counseling with him and he could attend personal therapy. But fundamentally he has to want to change and why should he after 20 cushy years of having a wife who does everything for him while she lets him get away with treating her like crap? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgczwn2", "score_hidden": false, "stickied": false, "created": 1492426024.0, "created_utc": 1492397224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 56}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgd7ttq", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "Woodendeer", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "So what you've basically asked is: how do I control what my children think about what they see at home, without actually changing what they see? \n\nIt doesn't work like that (for us non-politicians!). It's where the saying to 'lead by example' comes from, as that's the best way to teach the right way to do things. You can say you deserve respect because of the amazing job you're doing (and you do, it sounds like you've worked really hard), but if they and your husband can get away with not showing respect, then your words are meaningless.\n\nWhy have you let someone treat you this way for so long? Did your parents model this behaviour? \n\n\nBipolar an excuse for shitty behaviour like this. Seriously, you can be a good person to those you love, even when you're spiralling down, and if you're not then you need help. I understand you probably thought you were being supportive and understanding, but you've managed to put everyone else's wants in front of even your basic needs, and are now wondering why those close to you don't see you as having needs that they need to meet. You are allowed to say you need thanks and acknowledgments for the work you do. You're allowed to have a social life because it's part of the larger picture of what makes you happy. His social anxieties don't automatically cancel out your needs. If he's struggling, he needs to get help. The answer isn't that he gets what he needs and you just... don't.\n\nAlso, when he says you're being controlling, he's projecting. He clearly feels bad about something and is taking it out on you. In my experience, people who project their own shortcomings and are unable to self-reflect aren't great people to be around. They can be cruel just to make them feel good, and your job is to either let them do it, or feel their wrath. I have a feeling he needs a rude awakening before he'll be able to accept any responsibility for what is going on.\n\nRelationships, good ones, are balanced. The biggest thing you can do for your kids right now is to learn for yourself how good relationships work, so you can model that behaviour for them to see. I'm sorry, as I expect these responses aren't what you were hoping for. You sound like a really nice person, but the reality is that you've lost parts of you along the way. You forgot to make accommodations for those you love, whilst holding up your needs as equal and demanding that they're met too. \n\nI hope you can figure it out, and I'm sorry you're in this position.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So what you&amp;#39;ve basically asked is: how do I control what my children think about what they see at home, without actually changing what they see? &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t work like that (for us non-politicians!). It&amp;#39;s where the saying to &amp;#39;lead by example&amp;#39; comes from, as that&amp;#39;s the best way to teach the right way to do things. You can say you deserve respect because of the amazing job you&amp;#39;re doing (and you do, it sounds like you&amp;#39;ve worked really hard), but if they and your husband can get away with not showing respect, then your words are meaningless.&lt;/p&gt;\n\n&lt;p&gt;Why have you let someone treat you this way for so long? Did your parents model this behaviour? &lt;/p&gt;\n\n&lt;p&gt;Bipolar an excuse for shitty behaviour like this. Seriously, you can be a good person to those you love, even when you&amp;#39;re spiralling down, and if you&amp;#39;re not then you need help. I understand you probably thought you were being supportive and understanding, but you&amp;#39;ve managed to put everyone else&amp;#39;s wants in front of even your basic needs, and are now wondering why those close to you don&amp;#39;t see you as having needs that they need to meet. You are allowed to say you need thanks and acknowledgments for the work you do. You&amp;#39;re allowed to have a social life because it&amp;#39;s part of the larger picture of what makes you happy. His social anxieties don&amp;#39;t automatically cancel out your needs. If he&amp;#39;s struggling, he needs to get help. The answer isn&amp;#39;t that he gets what he needs and you just... don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;Also, when he says you&amp;#39;re being controlling, he&amp;#39;s projecting. He clearly feels bad about something and is taking it out on you. In my experience, people who project their own shortcomings and are unable to self-reflect aren&amp;#39;t great people to be around. They can be cruel just to make them feel good, and your job is to either let them do it, or feel their wrath. I have a feeling he needs a rude awakening before he&amp;#39;ll be able to accept any responsibility for what is going on.&lt;/p&gt;\n\n&lt;p&gt;Relationships, good ones, are balanced. The biggest thing you can do for your kids right now is to learn for yourself how good relationships work, so you can model that behaviour for them to see. I&amp;#39;m sorry, as I expect these responses aren&amp;#39;t what you were hoping for. You sound like a really nice person, but the reality is that you&amp;#39;ve lost parts of you along the way. You forgot to make accommodations for those you love, whilst holding up your needs as equal and demanding that they&amp;#39;re met too. &lt;/p&gt;\n\n&lt;p&gt;I hope you can figure it out, and I&amp;#39;m sorry you&amp;#39;re in this position.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgd7ttq", "score_hidden": false, "stickied": false, "created": 1492440116.0, "created_utc": 1492411316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgd5zbi", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Rebelo86", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I remember this episode of criminal minds where they were talking to a woman who had murdered her husband. Twenty years of mental abuse and she was broken. So she killed him, cleaned up the mess because \"she knew company was coming\" and waited for the police. Even her kids would say the same things to her that their father would. \n\nI bring this up because your kids don't respect you. And don't respect what you do for them. You've rug-swept all of this for years and it's finally come to a head. It's counseling for the entire family, and for you and your husband, together and separately, or you leave and take the kids. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I remember this episode of criminal minds where they were talking to a woman who had murdered her husband. Twenty years of mental abuse and she was broken. So she killed him, cleaned up the mess because &amp;quot;she knew company was coming&amp;quot; and waited for the police. Even her kids would say the same things to her that their father would. &lt;/p&gt;\n\n&lt;p&gt;I bring this up because your kids don&amp;#39;t respect you. And don&amp;#39;t respect what you do for them. You&amp;#39;ve rug-swept all of this for years and it&amp;#39;s finally come to a head. It&amp;#39;s counseling for the entire family, and for you and your husband, together and separately, or you leave and take the kids. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgd5zbi", "score_hidden": false, "stickied": false, "created": 1492436090.0, "created_utc": 1492407290.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgdjrm2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Iluvmychildren", "parent_id": "t1_dgdewt4", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The reason I brought up the bipolar is that he won't do this sort of thing for a long time and be a model husband, and then suddenly, he starts to do this and it will last a period of time. I knew this was coming because for the last week, he has not slept. And then, Saturday night/Sunday morning, he slept a lot and heavily. And I had to wake him because it was Easter. \n\nEven though someone can be decent even though having bipolar disorder, in his case, when he slips in to the depressed side of things, he is like this. His parents are nasty, evil, abusive people. I feel like he mostly has stepped away from their bad behavior, but then, when he gets very depressed again, he slips in to this bad behavior.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The reason I brought up the bipolar is that he won&amp;#39;t do this sort of thing for a long time and be a model husband, and then suddenly, he starts to do this and it will last a period of time. I knew this was coming because for the last week, he has not slept. And then, Saturday night/Sunday morning, he slept a lot and heavily. And I had to wake him because it was Easter. &lt;/p&gt;\n\n&lt;p&gt;Even though someone can be decent even though having bipolar disorder, in his case, when he slips in to the depressed side of things, he is like this. His parents are nasty, evil, abusive people. I feel like he mostly has stepped away from their bad behavior, but then, when he gets very depressed again, he slips in to this bad behavior.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdjrm2", "score_hidden": false, "stickied": false, "created": 1492468427.0, "created_utc": 1492439627.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdewt4", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "ZenMommy", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm utterly confused as to what having bipolar has to do with it being okay to be an abusive and disrespectful asshole. \n\nI know a number of people with bipolar. All of them are kind and respectful partners. \n\nI'm sorry, but you've been lying to yourself. It's not the bipolar, it's *him*. And you're teaching your boys to become just like him, and your girls that it's okay to be in an abusive relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m utterly confused as to what having bipolar has to do with it being okay to be an abusive and disrespectful asshole. &lt;/p&gt;\n\n&lt;p&gt;I know a number of people with bipolar. All of them are kind and respectful partners. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry, but you&amp;#39;ve been lying to yourself. It&amp;#39;s not the bipolar, it&amp;#39;s &lt;em&gt;him&lt;/em&gt;. And you&amp;#39;re teaching your boys to become just like him, and your girls that it&amp;#39;s okay to be in an abusive relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdewt4", "score_hidden": false, "stickied": false, "created": 1492460631.0, "created_utc": 1492431831.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgd4bfh", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "TheSentientOne", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Honestly, it sounds like you enabled him to believe he is entitled to having you do everything? I stopped reading after reading he doesn't change diapers. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, it sounds like you enabled him to believe he is entitled to having you do everything? I stopped reading after reading he doesn&amp;#39;t change diapers. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgd4bfh", "score_hidden": false, "stickied": false, "created": 1492432837.0, "created_utc": 1492404037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgd6a3a", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "converseshoe", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You really can't change your children's perception without changing/ditching your husband. Children are products of their environment and are going to learn his behavior or worse if you have a girl she may seek out a partner that treats her the same way. This is no quick fix this is a lifestyle overhaul. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You really can&amp;#39;t change your children&amp;#39;s perception without changing/ditching your husband. Children are products of their environment and are going to learn his behavior or worse if you have a girl she may seek out a partner that treats her the same way. This is no quick fix this is a lifestyle overhaul. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgd6a3a", "score_hidden": false, "stickied": false, "created": 1492436713.0, "created_utc": 1492407913.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgdx7ua", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ImpotentJunta", "parent_id": "t1_dgduqt3", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Unfortunate, but not unexpected.\n\nHas he tried to go down the medication route before? I'm thinking he needs to go in to see a doctor ASAP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunate, but not unexpected.&lt;/p&gt;\n\n&lt;p&gt;Has he tried to go down the medication route before? I&amp;#39;m thinking he needs to go in to see a doctor ASAP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdx7ua", "score_hidden": false, "stickied": false, "created": 1492483825.0, "created_utc": 1492455025.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgduqt3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Iluvmychildren", "parent_id": "t1_dgducap", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You are right. And after reading everyone's responses, I went and spoke to my husband about how his behavior is affecting everyone else. He got angry with me, but at least he is not speaking to me now. Yay..bonus in my life is that my husband is not speaking to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are right. And after reading everyone&amp;#39;s responses, I went and spoke to my husband about how his behavior is affecting everyone else. He got angry with me, but at least he is not speaking to me now. Yay..bonus in my life is that my husband is not speaking to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgduqt3", "score_hidden": false, "stickied": false, "created": 1492481038.0, "created_utc": 1492452238.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgducap", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "ImpotentJunta", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt;The reason he got this chore is because he likes to stay up all night and is often just heading to bed at 6am.\n\nHe likes to stay up all night - or he's manic?\n\nI was exposed to someone who was bipolar (and refused to treat it) when I was a child because \"family\". One of my biggest wishes is that my parents had actually protected me from him, instead of just hand-waving it away as \"the way he is\" and \"family\".\n\n&gt;So do not want advice on my marriage but rather how to approach this with the kids without reducing their dad in their eyes. They have the right to love and respect their dad, but they also have the right to love and respect their mom (me) and his remarks are tearing that down.\n\nThe issue is not your children, it's the family dynamic in general. And your marriage is a huge part of that. You cannot just isolate your children from his behaviour by simply sitting down and having a conversation and basically telling them to ignore it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The reason he got this chore is because he likes to stay up all night and is often just heading to bed at 6am.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He likes to stay up all night - or he&amp;#39;s manic?&lt;/p&gt;\n\n&lt;p&gt;I was exposed to someone who was bipolar (and refused to treat it) when I was a child because &amp;quot;family&amp;quot;. One of my biggest wishes is that my parents had actually protected me from him, instead of just hand-waving it away as &amp;quot;the way he is&amp;quot; and &amp;quot;family&amp;quot;.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So do not want advice on my marriage but rather how to approach this with the kids without reducing their dad in their eyes. They have the right to love and respect their dad, but they also have the right to love and respect their mom (me) and his remarks are tearing that down.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The issue is not your children, it&amp;#39;s the family dynamic in general. And your marriage is a huge part of that. You cannot just isolate your children from his behaviour by simply sitting down and having a conversation and basically telling them to ignore it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgducap", "score_hidden": false, "stickied": false, "created": 1492480597.0, "created_utc": 1492451797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgdz96y", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ApatheticAnarchy", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "So you are describing a clearly shitty relationship and family dynamic here, shitty husband, shitty parent, and asking how to dress it up to not look like shit. So as your children get older and start having relationships of their own, they don't see any red flags, because they see them as whatever color you had those flags painted, to avoid calling a spade a spade. To save the reputation of someone who has created their own bad reputation.\n\nYou aren't going to be able to. What you will have instead are children who grow up thinking their dad is an asshole, and their mother is an enabler. They are neither blind nor stupid, and they will remember it if you try to treat them as such.\n\nCheck out their future over at r/raisedbynarcissists ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you are describing a clearly shitty relationship and family dynamic here, shitty husband, shitty parent, and asking how to dress it up to not look like shit. So as your children get older and start having relationships of their own, they don&amp;#39;t see any red flags, because they see them as whatever color you had those flags painted, to avoid calling a spade a spade. To save the reputation of someone who has created their own bad reputation.&lt;/p&gt;\n\n&lt;p&gt;You aren&amp;#39;t going to be able to. What you will have instead are children who grow up thinking their dad is an asshole, and their mother is an enabler. They are neither blind nor stupid, and they will remember it if you try to treat them as such.&lt;/p&gt;\n\n&lt;p&gt;Check out their future over at &lt;a href=\"/r/raisedbynarcissists\"&gt;r/raisedbynarcissists&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdz96y", "score_hidden": false, "stickied": false, "created": 1492486143.0, "created_utc": 1492457343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65sziw", "likes": null, "replies": "", "user_reports": [], "id": "dgdm7z2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Iluvmychildren", "parent_id": "t1_dgdlkps", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "DH means dear husband. Sorry. Old timey acronym.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;DH means dear husband. Sorry. Old timey acronym.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdm7z2", "score_hidden": false, "stickied": false, "created": 1492471493.0, "created_utc": 1492442693.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdlkps", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "fu_king", "parent_id": "t3_65sziw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I see that you're referring to your husband - but what does DH stand for?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see that you&amp;#39;re referring to your husband - but what does DH stand for?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdlkps", "score_hidden": false, "stickied": false, "created": 1492470724.0, "created_utc": 1492441924.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]