[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve known my son (J) since just after he was 2 and he will be 4 in a few days. As far as he&amp;#39;s concerned I&amp;#39;m his Dad and it&amp;#39;s never been different. &lt;/p&gt;\n\n&lt;p&gt;We now have another boy on the way, due in September and it&amp;#39;s got me thinking.&lt;/p&gt;\n\n&lt;p&gt;Now his biological Dad (BD) as it stands doesn&amp;#39;t want anything to do with his son. He&amp;#39;s an alcoholic and hasn&amp;#39;t seen him since his 2nd birthday. In fact after J threw a tantrum (as 2 year olds tend to do) he threw and smashed a glass in his direction and walked off muttering that his son was nutcase and a fucking loser. Shortly after BD spat in his own mother&amp;#39;s face and was essentially sent away and hasn&amp;#39;t seen anyone in his family since. I tell you this because I want to make it clear that J has a very low chance of being able to have a relationship with his dad or even for his dad to be alive much longer. My partner, his mother has described several hospital visits for alcohol poisoning one of which ended with his arrest and subsequent hospitalisation in a mental health facility (checked himself out after a day). She also tells me that he started to talk about hearing voices toward the end. He really isn&amp;#39;t likely to be back.&lt;/p&gt;\n\n&lt;p&gt;So... Yeah when do we tell him? On the one hand we can&amp;#39;t wait forever because he might feel betrayed. But with a new son on the way I don&amp;#39;t want him to grow up feeling like he&amp;#39;s less of my son. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re really happy as things are. I don&amp;#39;t see it doing any good in the short term. The only positive I see for telling him is that it&amp;#39;s not right to hide the truth from him. Maybe one day he&amp;#39;s much older he&amp;#39;ll want to visit BD for himself, get some answers? &lt;/p&gt;\n\n&lt;p&gt;Any thoughts? Similar situations?&lt;/p&gt;\n\n&lt;p&gt;Edit: thank you all for your wonderful advice. We&amp;#39;re a bit shaken that we&amp;#39;ve had done the wrong thing not already telling him and my partner has been a little tearful. However having had almost unanimous agreement from reddit we are going to find ways to skip the information to him right away. There are some great ideas in here and feel free to keep the anecdotes coming. It a helps.&lt;/p&gt;\n\n&lt;p&gt;Thank you very much.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've known my son (J) since just after he was 2 and he will be 4 in a few days. As far as he's concerned I'm his Dad and it's never been different. \n\nWe now have another boy on the way, due in September and it's got me thinking.\n\nNow his biological Dad (BD) as it stands doesn't want anything to do with his son. He's an alcoholic and hasn't seen him since his 2nd birthday. In fact after J threw a tantrum (as 2 year olds tend to do) he threw and smashed a glass in his direction and walked off muttering that his son was nutcase and a fucking loser. Shortly after BD spat in his own mother's face and was essentially sent away and hasn't seen anyone in his family since. I tell you this because I want to make it clear that J has a very low chance of being able to have a relationship with his dad or even for his dad to be alive much longer. My partner, his mother has described several hospital visits for alcohol poisoning one of which ended with his arrest and subsequent hospitalisation in a mental health facility (checked himself out after a day). She also tells me that he started to talk about hearing voices toward the end. He really isn't likely to be back.\n\nSo... Yeah when do we tell him? On the one hand we can't wait forever because he might feel betrayed. But with a new son on the way I don't want him to grow up feeling like he's less of my son. \n\nWe're really happy as things are. I don't see it doing any good in the short term. The only positive I see for telling him is that it's not right to hide the truth from him. Maybe one day he's much older he'll want to visit BD for himself, get some answers? \n\nAny thoughts? Similar situations?\n\nEdit: thank you all for your wonderful advice. We're a bit shaken that we've had done the wrong thing not already telling him and my partner has been a little tearful. However having had almost unanimous agreement from reddit we are going to find ways to skip the information to him right away. There are some great ideas in here and feel free to keep the anecdotes coming. It a helps.\n\nThank you very much.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65w302", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 134, "report_reasons": null, "author": "gotbannedfornothing", "saved": false, "mod_reports": [], "name": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": 1492446924.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65w302/when_do_we_tell_our_son_that_im_not_his/", "num_reports": null, "locked": false, "stickied": false, "created": 1492470345.0, "url": "https://www.reddit.com/r/Parenting/comments/65w302/when_do_we_tell_our_son_that_im_not_his/", "author_flair_text": null, "quarantine": false, "title": "When do we tell our son that I'm not his biological father?", "created_utc": 1492441545.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 74, "visited": false, "subreddit_type": "public", "ups": 134}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdojw5", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "vipipi", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Not a parent yet, but I'm a teacher. I think the best thing you can do is to talk to him now. Just let him know that there are biological parents who give the \"seed\" to create a person and \"heart\" parents who raise and love you. If he has any questions he will ask them or he will just say \"ok\" and leave. Don't make a fuss about it, just let him know that his \"seed\" father it's not you. It's better for him to grow up with this information, so he naturalizes it. Telling him when he is older will make him feel betrayed and he will have a hard time trusting you. \nAs a teacher I've dealt with both cases and kids who learn this information when they are older always get angry/sad/etc or they already know and they don't tell you so they don't hurt your feelings (I never understand how they know, but some of them just do).\nI hope you find this useful!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not a parent yet, but I&amp;#39;m a teacher. I think the best thing you can do is to talk to him now. Just let him know that there are biological parents who give the &amp;quot;seed&amp;quot; to create a person and &amp;quot;heart&amp;quot; parents who raise and love you. If he has any questions he will ask them or he will just say &amp;quot;ok&amp;quot; and leave. Don&amp;#39;t make a fuss about it, just let him know that his &amp;quot;seed&amp;quot; father it&amp;#39;s not you. It&amp;#39;s better for him to grow up with this information, so he naturalizes it. Telling him when he is older will make him feel betrayed and he will have a hard time trusting you. \nAs a teacher I&amp;#39;ve dealt with both cases and kids who learn this information when they are older always get angry/sad/etc or they already know and they don&amp;#39;t tell you so they don&amp;#39;t hurt your feelings (I never understand how they know, but some of them just do).\nI hope you find this useful!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdojw5", "score_hidden": false, "stickied": false, "created": 1492474175.0, "created_utc": 1492445375.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdrj49", "gilded": 0, "archived": false, "score": 82, "report_reasons": null, "author": "Porzingod_6", "parent_id": "t1_dgdm5bd", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; If you tell him now, it'll just be part of his life as he grows up. For us, it's no different than the fact that our son has tan skin or curly hair or brown eyes or whatever else. It's just a fact of life. \n\nI can't say this enough. I just posted this story in an entirely different thread, but thought it fit here. \n\nMy son had to get a physical before basketball season and they were checking his height. He has always been short and is still pretty short. He asked me if he was always going to be short and I said, \"Well daddy says he was pretty short until high school. He grew 11 inches between Freshman and Senior year.\" My kid thought about it for a second before giving me a blank stare and said, \"Mom, you do know that I am adopted, right?\" I informed him that I was there and do remember his adoption. I just meant that some people have later growth spurts and end up being much taller than they thought they would be. He laughed at my explanation and said, \"Just making sure you aren't losing it yet.\" \n\nYou treat it as normal and the kid will see it that way. No different than any other fact about him. ", "edited": 1492460401.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you tell him now, it&amp;#39;ll just be part of his life as he grows up. For us, it&amp;#39;s no different than the fact that our son has tan skin or curly hair or brown eyes or whatever else. It&amp;#39;s just a fact of life. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can&amp;#39;t say this enough. I just posted this story in an entirely different thread, but thought it fit here. &lt;/p&gt;\n\n&lt;p&gt;My son had to get a physical before basketball season and they were checking his height. He has always been short and is still pretty short. He asked me if he was always going to be short and I said, &amp;quot;Well daddy says he was pretty short until high school. He grew 11 inches between Freshman and Senior year.&amp;quot; My kid thought about it for a second before giving me a blank stare and said, &amp;quot;Mom, you do know that I am adopted, right?&amp;quot; I informed him that I was there and do remember his adoption. I just meant that some people have later growth spurts and end up being much taller than they thought they would be. He laughed at my explanation and said, &amp;quot;Just making sure you aren&amp;#39;t losing it yet.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;You treat it as normal and the kid will see it that way. No different than any other fact about him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdrj49", "score_hidden": false, "stickied": false, "created": 1492477489.0, "created_utc": 1492448689.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 82}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdtjzt", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "SSChicken", "parent_id": "t1_dgdm5bd", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; If you tell him now, it'll just be part of his life as he grows up. For us, it's no different than the fact that our son has tan skin or curly hair or brown eyes or whatever else. It's just a fact of life.\n\nI agree. We've got four at the moment, two bio, one adopted, one fostering (Who we may adopt, may not, we'll see how that plays out). We tell kids that there's a multitude of ways to become a family, and to them it's no different. Some kids are born to their parents, some kids are adopted by their parents, some kids are born to a mom and their dad comes along a bit later. They do so good with it, and just accept it as a fact of life because it is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you tell him now, it&amp;#39;ll just be part of his life as he grows up. For us, it&amp;#39;s no different than the fact that our son has tan skin or curly hair or brown eyes or whatever else. It&amp;#39;s just a fact of life.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree. We&amp;#39;ve got four at the moment, two bio, one adopted, one fostering (Who we may adopt, may not, we&amp;#39;ll see how that plays out). We tell kids that there&amp;#39;s a multitude of ways to become a family, and to them it&amp;#39;s no different. Some kids are born to their parents, some kids are adopted by their parents, some kids are born to a mom and their dad comes along a bit later. They do so good with it, and just accept it as a fact of life because it is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdtjzt", "score_hidden": false, "stickied": false, "created": 1492479736.0, "created_utc": 1492450936.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdz85o", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Izwe", "parent_id": "t1_dgdm5bd", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I did the same thing as OP at the exact same age and your advice is spot on.\n\nOP, you should say things like \"when I met you and your Mom in 2015\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did the same thing as OP at the exact same age and your advice is spot on.&lt;/p&gt;\n\n&lt;p&gt;OP, you should say things like &amp;quot;when I met you and your Mom in 2015&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdz85o", "score_hidden": false, "stickied": false, "created": 1492486110.0, "created_utc": 1492457310.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdowjv", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "mischiffmaker", "parent_id": "t1_dgdneqt", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; you are giving them some power to speak and be heard about it, and a ...foundation of honesty and respect\n\nThis is very wise and bears repeating. Well-said.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;you are giving them some power to speak and be heard about it, and a ...foundation of honesty and respect&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is very wise and bears repeating. Well-said.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdowjv", "score_hidden": false, "stickied": false, "created": 1492474572.0, "created_utc": 1492445772.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdrgnt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "bug_bite", "parent_id": "t1_dgdneqt", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "i second the \"vocabulary\" part of this especially.  its a hard concept for a kid to get so each time they ask, you have to answer their questions honestly.  i wouldn't recommend having a sit down conversation with him about this.  next time he asks, start being honest.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i second the &amp;quot;vocabulary&amp;quot; part of this especially.  its a hard concept for a kid to get so each time they ask, you have to answer their questions honestly.  i wouldn&amp;#39;t recommend having a sit down conversation with him about this.  next time he asks, start being honest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdrgnt", "score_hidden": false, "stickied": false, "created": 1492477413.0, "created_utc": 1492448613.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdneqt", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "lovelight_shine", "parent_id": "t1_dgdmpzz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It's not that they understand it at age 2, rather instead at that age you are setting a foundation of honesty.  Your age-appropriate discussions are giving them a vocabulary to talk about it when they have questions later.  You are introducing the topic, so that you are giving them some power to speak and be heard about it, and a ... well really, as I said above.  A foundation of honesty and respect so that you aren't allowing them to deeply form one view of their place in the world, but then later shaking up that view by making a big announcement.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not that they understand it at age 2, rather instead at that age you are setting a foundation of honesty.  Your age-appropriate discussions are giving them a vocabulary to talk about it when they have questions later.  You are introducing the topic, so that you are giving them some power to speak and be heard about it, and a ... well really, as I said above.  A foundation of honesty and respect so that you aren&amp;#39;t allowing them to deeply form one view of their place in the world, but then later shaking up that view by making a big announcement.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdneqt", "score_hidden": false, "stickied": false, "created": 1492472869.0, "created_utc": 1492444069.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdy41j", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "krysterra", "parent_id": "t1_dgdr9ch", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I like this idea. Congratulations, son, you have a father AND a daddy! And daddy gets the privilege of getting to take you to the park and getting to buy you ice cream. That's why I'm so happy I get to be your daddy, even though there's someone else who is your father.  \n\nHe may not understand entirely the implications of all of it, but he'll understand that you're happy about him and getting to be in his life, and then it can just be a natural part of his history. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like this idea. Congratulations, son, you have a father AND a daddy! And daddy gets the privilege of getting to take you to the park and getting to buy you ice cream. That&amp;#39;s why I&amp;#39;m so happy I get to be your daddy, even though there&amp;#39;s someone else who is your father.  &lt;/p&gt;\n\n&lt;p&gt;He may not understand entirely the implications of all of it, but he&amp;#39;ll understand that you&amp;#39;re happy about him and getting to be in his life, and then it can just be a natural part of his history. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdy41j", "score_hidden": false, "stickied": false, "created": 1492484839.0, "created_utc": 1492456039.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdr9ch", "gilded": 0, "archived": false, "score": 41, "report_reasons": null, "author": "albatrosslacross", "parent_id": "t1_dgdne7w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "If you do this, make it a party; you can sit your son down and explain to him with your partner and let him ask questions.\n\nYou can give him the certificate framed and wrapped up as a gift after, just to let him know that though you aren't the BD, you're his father no matter what. \n\nHaving cake or going to the park or movies after will make it celebratory and just reinforce the normalcy of your family dynamic. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you do this, make it a party; you can sit your son down and explain to him with your partner and let him ask questions.&lt;/p&gt;\n\n&lt;p&gt;You can give him the certificate framed and wrapped up as a gift after, just to let him know that though you aren&amp;#39;t the BD, you&amp;#39;re his father no matter what. &lt;/p&gt;\n\n&lt;p&gt;Having cake or going to the park or movies after will make it celebratory and just reinforce the normalcy of your family dynamic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdr9ch", "score_hidden": false, "stickied": false, "created": 1492477188.0, "created_utc": 1492448388.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 41}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdnoxl", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "drhagbard_celine", "parent_id": "t1_dgdne7w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think that's a good idea, especially since the birth father can offer no legal obstacles.  Might be something to consider doing before your new child's birth if it's at all possible.  Best of luck to you and your growing family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s a good idea, especially since the birth father can offer no legal obstacles.  Might be something to consider doing before your new child&amp;#39;s birth if it&amp;#39;s at all possible.  Best of luck to you and your growing family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdnoxl", "score_hidden": false, "stickied": false, "created": 1492473192.0, "created_utc": 1492444392.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdv6kp", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "d0k74_j0n35", "parent_id": "t1_dgdne7w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It's also a good way to secure your legal rights.  For example, let's say something unpredictable happens and you wind up having a falling out with his mom.  It sounds like it would be important to you to continue having a relationship with him.  In most places if you haven't adopted him, you wouldn't have any right to demand that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s also a good way to secure your legal rights.  For example, let&amp;#39;s say something unpredictable happens and you wind up having a falling out with his mom.  It sounds like it would be important to you to continue having a relationship with him.  In most places if you haven&amp;#39;t adopted him, you wouldn&amp;#39;t have any right to demand that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdv6kp", "score_hidden": false, "stickied": false, "created": 1492481528.0, "created_utc": 1492452728.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge0a60", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "D8E0E633", "parent_id": "t1_dgdne7w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It looks like you don't live in the US from your spelling, so this may not apply to you, but adoption is a fairly involved legal procedure.  You should seek the advice of a professional, either a lawyer or a social worker knowledgeable about adoption.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like you don&amp;#39;t live in the US from your spelling, so this may not apply to you, but adoption is a fairly involved legal procedure.  You should seek the advice of a professional, either a lawyer or a social worker knowledgeable about adoption.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge0a60", "score_hidden": false, "stickied": false, "created": 1492487299.0, "created_utc": 1492458499.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdt726", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NoOnesAnonymous", "parent_id": "t1_dgdne7w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think this is a great approach", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is a great approach&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdt726", "score_hidden": false, "stickied": false, "created": 1492479345.0, "created_utc": 1492450545.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge5ku1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "0MY", "parent_id": "t1_dgdne7w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It's a great idea but I would almost wait to tell him about that step until after baby is born so he can have a special moment all his own. It may help in case he is jealous of baby brother's attention. He'll also be a little older and understand it more.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a great idea but I would almost wait to tell him about that step until after baby is born so he can have a special moment all his own. It may help in case he is jealous of baby brother&amp;#39;s attention. He&amp;#39;ll also be a little older and understand it more.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge5ku1", "score_hidden": false, "stickied": false, "created": 1492493334.0, "created_utc": 1492464534.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge3ua6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mszulan", "parent_id": "t1_dgdne7w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "In my opinion, he has another progenitor.  You are his dad in every way that matters.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my opinion, he has another progenitor.  You are his dad in every way that matters.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge3ua6", "score_hidden": false, "stickied": false, "created": 1492491277.0, "created_utc": 1492462477.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgegu5g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "liseux", "parent_id": "t1_dgdne7w", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I would do this because you don't want your child growing up thinking that he doesn't have a dad since his \"real\" one doesn't care for him. Instead, you tell him that he IS your legally adopted son, essentially YOU are his \"real\" dad, but that a different man is his biological father. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would do this because you don&amp;#39;t want your child growing up thinking that he doesn&amp;#39;t have a dad since his &amp;quot;real&amp;quot; one doesn&amp;#39;t care for him. Instead, you tell him that he IS your legally adopted son, essentially YOU are his &amp;quot;real&amp;quot; dad, but that a different man is his biological father. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgegu5g", "score_hidden": false, "stickied": false, "created": 1492507634.0, "created_utc": 1492478834.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdne7w", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "gotbannedfornothing", "parent_id": "t1_dgdn403", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "His father has no parental rights. He is not on the birth certificate. \n\nThere is nothing stopping us going to down the civic centre and getting me declared as his Dad.\n\nIt's something we've been thinking of doing actually. Like having that sorted and showing him a certificate that I'm his Dad and then having the conversation that he has another Dad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;His father has no parental rights. He is not on the birth certificate. &lt;/p&gt;\n\n&lt;p&gt;There is nothing stopping us going to down the civic centre and getting me declared as his Dad.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s something we&amp;#39;ve been thinking of doing actually. Like having that sorted and showing him a certificate that I&amp;#39;m his Dad and then having the conversation that he has another Dad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdne7w", "score_hidden": false, "stickied": false, "created": 1492472852.0, "created_utc": 1492444052.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 39}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdn403", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "drhagbard_celine", "parent_id": "t1_dgdmpzz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; If you tell him now, it'll just be part of his life as he grows up.\n\nYes, this. 100%. Because it is just a part of his life. It's nothing to feel ashamed about.\n\n Further, seeing that his biological father seems to be a crappy parent at best and completely disinterested at worst, is there any way that you can get him to relinquish parental rights and adopt your son officially?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If you tell him now, it&amp;#39;ll just be part of his life as he grows up.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, this. 100%. Because it is just a part of his life. It&amp;#39;s nothing to feel ashamed about.&lt;/p&gt;\n\n&lt;p&gt;Further, seeing that his biological father seems to be a crappy parent at best and completely disinterested at worst, is there any way that you can get him to relinquish parental rights and adopt your son officially?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdn403", "score_hidden": false, "stickied": false, "created": 1492472526.0, "created_utc": 1492443726.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge5ury", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "purplenat", "parent_id": "t1_dgdon1k", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Along with the comments about vocabulary \n  \n&gt; giving them a vocabulary to talk about it when they have questions later  \n  \nI think \"bio dad\" or \"biological father\" are good terms to use to describe him. OP is \"dad\" and \"father\" and \"real daddy\" or whatever. Bio dad is \"biological father.\" ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Along with the comments about vocabulary &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;giving them a vocabulary to talk about it when they have questions later  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think &amp;quot;bio dad&amp;quot; or &amp;quot;biological father&amp;quot; are good terms to use to describe him. OP is &amp;quot;dad&amp;quot; and &amp;quot;father&amp;quot; and &amp;quot;real daddy&amp;quot; or whatever. Bio dad is &amp;quot;biological father.&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge5ury", "score_hidden": false, "stickied": false, "created": 1492493668.0, "created_utc": 1492464868.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdon1k", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "mudslideme", "parent_id": "t1_dgdmpzz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My (step) dad entered my life when I was 4. I both understood that he was not my bio dad AND that he was my father. Avoid saying anything like bio dad is his \"real dad.\" YOU ARE HIS FATHER. I, personally, don't understand the strong tie people feel to sperm/egg donors. The people who care for you on a daily basis, who smile for you, cry for you, protect you, these people are your real parents.\n\nSay something along the lines of not being there when he was born, but being so happy about being a family now. Also, reassure him that he never has to explain that he has/had a different dad also. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My (step) dad entered my life when I was 4. I both understood that he was not my bio dad AND that he was my father. Avoid saying anything like bio dad is his &amp;quot;real dad.&amp;quot; YOU ARE HIS FATHER. I, personally, don&amp;#39;t understand the strong tie people feel to sperm/egg donors. The people who care for you on a daily basis, who smile for you, cry for you, protect you, these people are your real parents.&lt;/p&gt;\n\n&lt;p&gt;Say something along the lines of not being there when he was born, but being so happy about being a family now. Also, reassure him that he never has to explain that he has/had a different dad also. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdon1k", "score_hidden": false, "stickied": false, "created": 1492474272.0, "created_utc": 1492445472.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge1ik7", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Zeeeke", "parent_id": "t1_dgdzq5i", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I agree. I just think that's one you have to be careful with. I think the exact words \"he was never really your dad\" is a step farther than what I would be comfortable saying. \n\nOur situation may be different since my husband and I are a same- sex couple, so my son using \"mom\" to refer to his birth mother doesn't step on anyone's toes. If someone ask him who his parents are, he leaves his birth mother out. He's 10 now and will tell someone that his birth mom is his mom but she isn't his parent. \n\nIt's a complex issue and OP needs to tread carefully, especially since this kid is 4 now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. I just think that&amp;#39;s one you have to be careful with. I think the exact words &amp;quot;he was never really your dad&amp;quot; is a step farther than what I would be comfortable saying. &lt;/p&gt;\n\n&lt;p&gt;Our situation may be different since my husband and I are a same- sex couple, so my son using &amp;quot;mom&amp;quot; to refer to his birth mother doesn&amp;#39;t step on anyone&amp;#39;s toes. If someone ask him who his parents are, he leaves his birth mother out. He&amp;#39;s 10 now and will tell someone that his birth mom is his mom but she isn&amp;#39;t his parent. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a complex issue and OP needs to tread carefully, especially since this kid is 4 now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge1ik7", "score_hidden": false, "stickied": false, "created": 1492488688.0, "created_utc": 1492459888.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzq5i", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dgdu5vh", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "They do have the right to their own terminology. One of my kids called his birthmother his \"real mom\" for many years. I was just mom, no qualifier necessary. However I do think the distinction between fathering and parenting is useful for introducing the topic, since the child has no idea he has two real fathers. The child can subsequently make his own decision. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They do have the right to their own terminology. One of my kids called his birthmother his &amp;quot;real mom&amp;quot; for many years. I was just mom, no qualifier necessary. However I do think the distinction between fathering and parenting is useful for introducing the topic, since the child has no idea he has two real fathers. The child can subsequently make his own decision. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdzq5i", "score_hidden": false, "stickied": false, "created": 1492486680.0, "created_utc": 1492457880.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdu5vh", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Zeeeke", "parent_id": "t1_dgdoqfz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; you don't remember him because it was a long time ago and he was never your dad.\"\n\nI'd be careful with that one. My 3 are all adopted and have different circumstances surrounding their adoptions. One of them is very confident and secure in his role in our family, but he also views his birth mom as his mom and refers to her as such. He doesn't remember her and hasn't seen her since infancy, but that's who she is in his mind. I would never want to take that away from him regardless of how I feel about what she did. Whether or not she was ever his mom is not for me to decide. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;you don&amp;#39;t remember him because it was a long time ago and he was never your dad.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;d be careful with that one. My 3 are all adopted and have different circumstances surrounding their adoptions. One of them is very confident and secure in his role in our family, but he also views his birth mom as his mom and refers to her as such. He doesn&amp;#39;t remember her and hasn&amp;#39;t seen her since infancy, but that&amp;#39;s who she is in his mind. I would never want to take that away from him regardless of how I feel about what she did. Whether or not she was ever his mom is not for me to decide. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdu5vh", "score_hidden": false, "stickied": false, "created": 1492480406.0, "created_utc": 1492451606.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdoqfz", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "groundhogcakeday", "parent_id": "t1_dgdmpzz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This is one the adoption community figured out long ago - the best time to begin telling them is in the cradle. Not because they'll understand, but so you'll get into the habit of talking comfortably about it. By the time they begin to understand it will be something they've always known - no secrets, no drama, no big reveal. Their understanding of the implications will continue to mature as they grow up, but your first goal is to create a secure base. You are trying to avoid shaking their sense of self and family. \n\nObviously that ship has sailed for you. But the second best time to start the discussion is ASAP. (The worst time? Puberty. Wait that long and you might as well throw a hand grenade at the kid.)\n\nI would recommend that you approach it as mildly interesting but not particularly important information, because you don't want him to think this changes anything - your attitude and emotions will be where he gets his cues. Maybe even look for an opening to drop it casually into conversation - \"you got your hair from your birth father, not me or mom. Why yes, you have a birth father - you don't remember him because it was a long time ago and he was never your dad.\" Let the child ask the questions and answer them honestly but stop when he stops. He'll probably reopen the questioning when he's ready, as things cross his mind. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is one the adoption community figured out long ago - the best time to begin telling them is in the cradle. Not because they&amp;#39;ll understand, but so you&amp;#39;ll get into the habit of talking comfortably about it. By the time they begin to understand it will be something they&amp;#39;ve always known - no secrets, no drama, no big reveal. Their understanding of the implications will continue to mature as they grow up, but your first goal is to create a secure base. You are trying to avoid shaking their sense of self and family. &lt;/p&gt;\n\n&lt;p&gt;Obviously that ship has sailed for you. But the second best time to start the discussion is ASAP. (The worst time? Puberty. Wait that long and you might as well throw a hand grenade at the kid.)&lt;/p&gt;\n\n&lt;p&gt;I would recommend that you approach it as mildly interesting but not particularly important information, because you don&amp;#39;t want him to think this changes anything - your attitude and emotions will be where he gets his cues. Maybe even look for an opening to drop it casually into conversation - &amp;quot;you got your hair from your birth father, not me or mom. Why yes, you have a birth father - you don&amp;#39;t remember him because it was a long time ago and he was never your dad.&amp;quot; Let the child ask the questions and answer them honestly but stop when he stops. He&amp;#39;ll probably reopen the questioning when he&amp;#39;s ready, as things cross his mind. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdoqfz", "score_hidden": false, "stickied": false, "created": 1492474381.0, "created_utc": 1492445581.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdxy76", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "ddd222eee333", "parent_id": "t1_dgdmpzz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "He won't comprehend it at 2, but he will know that this is something that's OK to talk about and that it's a positive and happy thing.  As he grows, he'll understand more and more.\n\nI'm a lesbian mom, and I occasionally tell my barely-verbal toddler about the nice man who gave us some \"baby seeds\" so that we could make her, and how she grew in Mommy's tummy, and how her other Mommy was so happy to meet her when she was out of Mommy's tummy, and so on and so forth.  Yeah, she doesn't understand much at all at this age, but when she's old enough to understand, it will still be a familiar and positive story to her.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He won&amp;#39;t comprehend it at 2, but he will know that this is something that&amp;#39;s OK to talk about and that it&amp;#39;s a positive and happy thing.  As he grows, he&amp;#39;ll understand more and more.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a lesbian mom, and I occasionally tell my barely-verbal toddler about the nice man who gave us some &amp;quot;baby seeds&amp;quot; so that we could make her, and how she grew in Mommy&amp;#39;s tummy, and how her other Mommy was so happy to meet her when she was out of Mommy&amp;#39;s tummy, and so on and so forth.  Yeah, she doesn&amp;#39;t understand much at all at this age, but when she&amp;#39;s old enough to understand, it will still be a familiar and positive story to her.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdxy76", "score_hidden": false, "stickied": false, "created": 1492484650.0, "created_utc": 1492455850.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdsaty", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Cereal_Lurker", "parent_id": "t1_dgdmpzz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "It's not about a 2yo understanding, it's about it being a fact for his entire life until he understands it. That way it isn't a shock, or a betrayal in his eyes.\nOldest 2 are mine and the younger 2 are adopted, and that worked great for me. It was always known to my kids, but the older ones left it until the younger (2nd youngest only as youngest is still only 3) one asked questions themselves. Then we happily told her all we could.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not about a 2yo understanding, it&amp;#39;s about it being a fact for his entire life until he understands it. That way it isn&amp;#39;t a shock, or a betrayal in his eyes.\nOldest 2 are mine and the younger 2 are adopted, and that worked great for me. It was always known to my kids, but the older ones left it until the younger (2nd youngest only as youngest is still only 3) one asked questions themselves. Then we happily told her all we could.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdsaty", "score_hidden": false, "stickied": false, "created": 1492478348.0, "created_utc": 1492449548.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdz7cc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "jordanlund", "parent_id": "t1_dgdmpzz", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Don't confuse comprehension with the ability to communicate. The internal workings are brewing for a lot longer before they're able to talk.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t confuse comprehension with the ability to communicate. The internal workings are brewing for a lot longer before they&amp;#39;re able to talk.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdz7cc", "score_hidden": false, "stickied": false, "created": 1492486084.0, "created_utc": 1492457284.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdmpzz", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "gotbannedfornothing", "parent_id": "t1_dgdm5bd", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Right, the now, sounds like interesting advice. I'm going to be asking a lot of people before we make the decision.\n\nI really don't understand how it is possible that a 2 year old can comprehend such a thing. Some of them can't even talk much at 2 let alone hold and understand a conversation about a biological Dads. In fact my friends son is almost two and can say Mum and Dad at that's it. Perhaps I should take this time to try and explain relativity to him?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right, the now, sounds like interesting advice. I&amp;#39;m going to be asking a lot of people before we make the decision.&lt;/p&gt;\n\n&lt;p&gt;I really don&amp;#39;t understand how it is possible that a 2 year old can comprehend such a thing. Some of them can&amp;#39;t even talk much at 2 let alone hold and understand a conversation about a biological Dads. In fact my friends son is almost two and can say Mum and Dad at that&amp;#39;s it. Perhaps I should take this time to try and explain relativity to him?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdmpzz", "score_hidden": false, "stickied": false, "created": 1492472076.0, "created_utc": 1492443276.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdm5bd", "gilded": 0, "archived": false, "score": 158, "report_reasons": null, "author": "Shostakovich22", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "ASAP. The best time was 2 years ago. The next best time is now. \n\nMy older two sons are biological and my youngest was adopted. My youngest was adopted as an infant, so he has never known any different. He's 2 now and is very aware of the fact that he was adopted. We couldn't hide it even if we wanted to, but we wouldn't want to anyway. \n\nIf you tell him now, it'll just be part of his life as he grows up. For us, it's no different than the fact that our son has tan skin or curly hair or brown eyes or whatever else. It's just a fact of life. \n\nIf you wait to tell him, then you have lied to him for his whole life up to that point. That can be traumatic. Don't do that to your son. \n\nEdit: Just wanted to add that I see no difference between my biological sons and my adopted son. The fact that two share my DNA and one doesn't has made absolutely no difference. They are all close and play together all the time. It has caused no issues in our household or with our extended family. They are all my boys and nothing will ever change that. ", "edited": 1492460013.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ASAP. The best time was 2 years ago. The next best time is now. &lt;/p&gt;\n\n&lt;p&gt;My older two sons are biological and my youngest was adopted. My youngest was adopted as an infant, so he has never known any different. He&amp;#39;s 2 now and is very aware of the fact that he was adopted. We couldn&amp;#39;t hide it even if we wanted to, but we wouldn&amp;#39;t want to anyway. &lt;/p&gt;\n\n&lt;p&gt;If you tell him now, it&amp;#39;ll just be part of his life as he grows up. For us, it&amp;#39;s no different than the fact that our son has tan skin or curly hair or brown eyes or whatever else. It&amp;#39;s just a fact of life. &lt;/p&gt;\n\n&lt;p&gt;If you wait to tell him, then you have lied to him for his whole life up to that point. That can be traumatic. Don&amp;#39;t do that to your son. &lt;/p&gt;\n\n&lt;p&gt;Edit: Just wanted to add that I see no difference between my biological sons and my adopted son. The fact that two share my DNA and one doesn&amp;#39;t has made absolutely no difference. They are all close and play together all the time. It has caused no issues in our household or with our extended family. They are all my boys and nothing will ever change that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdm5bd", "score_hidden": false, "stickied": false, "created": 1492471408.0, "created_utc": 1492442608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 158}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdwuzw", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "jre103087", "parent_id": "t1_dgdpfaw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "When it comes to the part about bio dad say something along the lines of \"your birth dad knew that he wouldn't be able to take care of you as well as mommy and daddy can.\" A kid shouldn't be saddled with the complications of mental health problems, substance abuse and abandonment. \n\nWhen he gets older give age appropriate answers to questions about bio dad and as he gets closer to adulthood, and better understands mental health and substance abuse, your family can give him more of that info including contact info if you have it and he wants it. \n\nNot the same situation but my friend has an adopted niece who was the product of rape. The family has always been very straight forward that she was adopted, celebrating both her birthday and her \"gotcha day\" (day adoption was finalized), but the parents have chosen to not give her all the details surrounding the circumstances. They tell her that her birth mom loves her so much that she knew that mommy and daddy could take care of her better.  Officially, all the details will never be told to her but she's only 7yo now and I would imagine as she gets older more details might come out than originally planned. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When it comes to the part about bio dad say something along the lines of &amp;quot;your birth dad knew that he wouldn&amp;#39;t be able to take care of you as well as mommy and daddy can.&amp;quot; A kid shouldn&amp;#39;t be saddled with the complications of mental health problems, substance abuse and abandonment. &lt;/p&gt;\n\n&lt;p&gt;When he gets older give age appropriate answers to questions about bio dad and as he gets closer to adulthood, and better understands mental health and substance abuse, your family can give him more of that info including contact info if you have it and he wants it. &lt;/p&gt;\n\n&lt;p&gt;Not the same situation but my friend has an adopted niece who was the product of rape. The family has always been very straight forward that she was adopted, celebrating both her birthday and her &amp;quot;gotcha day&amp;quot; (day adoption was finalized), but the parents have chosen to not give her all the details surrounding the circumstances. They tell her that her birth mom loves her so much that she knew that mommy and daddy could take care of her better.  Officially, all the details will never be told to her but she&amp;#39;s only 7yo now and I would imagine as she gets older more details might come out than originally planned. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdwuzw", "score_hidden": false, "stickied": false, "created": 1492483419.0, "created_utc": 1492454619.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdroa8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "nikkorizz", "parent_id": "t1_dgdpfaw", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "You can also get children's books on the topic of adoption, step-families or blended families. Amazon sells a bunch, and some of them are really good to read to little kids. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can also get children&amp;#39;s books on the topic of adoption, step-families or blended families. Amazon sells a bunch, and some of them are really good to read to little kids. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdroa8", "score_hidden": false, "stickied": false, "created": 1492477650.0, "created_utc": 1492448850.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdpfaw", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "nmmb", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Maybe someone already mentioned this but my friend was in a similar situation and the therapist at their pediatricians office recommend making a \"story of you\" book (I think this is something also recommended for adopted kids). Basically the book tells the story of his life in an easy to understand way. You might include pics of mom pregnant or his birth with his bio dad and then pics of your family now. Include just one or two sentences about how bio dad can no longer care for him (my friend did a really awesome job at this but I can't remember now what she said). Put it in simple terms for your son so he understands that both you and your wife love him very much and are a family and then read the book with him multiple times. [Here] (https://www.adoptivefamilies.com/talking-about-adoption/creating-an-adoption-story-book/) is a nice article about making the book for adoptees but you can probably get something out of it. \n\nEdit: I just want to add that by telling him now at 4 - he will always know. He will probably never remember not knowing. My friend had a neighbor who's husband was not the daughter's bio dad. The neighbor had not told the daughter and one day the daughter was playing outside when she was 8 and up drives bio dad's mom and says \"Hi honey - I am your grandma!\". The daughter was super confused and very very upset no one told her.", "edited": 1492446534.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe someone already mentioned this but my friend was in a similar situation and the therapist at their pediatricians office recommend making a &amp;quot;story of you&amp;quot; book (I think this is something also recommended for adopted kids). Basically the book tells the story of his life in an easy to understand way. You might include pics of mom pregnant or his birth with his bio dad and then pics of your family now. Include just one or two sentences about how bio dad can no longer care for him (my friend did a really awesome job at this but I can&amp;#39;t remember now what she said). Put it in simple terms for your son so he understands that both you and your wife love him very much and are a family and then read the book with him multiple times. &lt;a href=\"https://www.adoptivefamilies.com/talking-about-adoption/creating-an-adoption-story-book/\"&gt;Here&lt;/a&gt; is a nice article about making the book for adoptees but you can probably get something out of it. &lt;/p&gt;\n\n&lt;p&gt;Edit: I just want to add that by telling him now at 4 - he will always know. He will probably never remember not knowing. My friend had a neighbor who&amp;#39;s husband was not the daughter&amp;#39;s bio dad. The neighbor had not told the daughter and one day the daughter was playing outside when she was 8 and up drives bio dad&amp;#39;s mom and says &amp;quot;Hi honey - I am your grandma!&amp;quot;. The daughter was super confused and very very upset no one told her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdpfaw", "score_hidden": false, "stickied": false, "created": 1492475154.0, "created_utc": 1492446354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge11rt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "diggexpat", "parent_id": "t1_dgdxs1s", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "&gt; I hadn't seen him in 15 years.\n\nLike, not even a Facebook message? I'd feel a little insulted, honestly.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I hadn&amp;#39;t seen him in 15 years.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Like, not even a Facebook message? I&amp;#39;d feel a little insulted, honestly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge11rt", "score_hidden": false, "stickied": false, "created": 1492488162.0, "created_utc": 1492459362.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxs1s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "chicken_potpie", "parent_id": "t1_dgduuk0", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I tried but he moved across the country and we slowly lost contact. My older brother has been in touch with him the last year or so, though, and my stepdad surprised him on Christmas. I was able to visit with him for a bit before he hit the road. I hadn't seen him in 15 years. Tears were definitely shed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I tried but he moved across the country and we slowly lost contact. My older brother has been in touch with him the last year or so, though, and my stepdad surprised him on Christmas. I was able to visit with him for a bit before he hit the road. I hadn&amp;#39;t seen him in 15 years. Tears were definitely shed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdxs1s", "score_hidden": false, "stickied": false, "created": 1492484460.0, "created_utc": 1492455660.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgduuk0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "RuhWalde", "parent_id": "t1_dgdrwr7", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Wow, that sucks.  Did you get to continue having a relationship with your stepdad after the split?  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, that sucks.  Did you get to continue having a relationship with your stepdad after the split?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgduuk0", "score_hidden": false, "stickied": false, "created": 1492481154.0, "created_utc": 1492452354.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdrwr7", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "chicken_potpie", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My mom waited until I was 12 to tell me my stepdad was not my biological father. Pretty shitty timing too, because they split a year later. Quite the headfuck for an adolescent. Tell him now. Best of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mom waited until I was 12 to tell me my stepdad was not my biological father. Pretty shitty timing too, because they split a year later. Quite the headfuck for an adolescent. Tell him now. Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdrwr7", "score_hidden": false, "stickied": false, "created": 1492477915.0, "created_utc": 1492449115.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdqb83", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "baalroo", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "There's no shame in being a step-father. It doesn't make you second best. It doesn't mean you love him less. It doesn't mean he will love you less.\n\nIt does mean you've *chosen* to love him, and he *chooses* to love you. You have *chosen* to be his father. That's pretty powerful man, don't ever think of it as something to be ashamed of, or that needs to be hidden.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no shame in being a step-father. It doesn&amp;#39;t make you second best. It doesn&amp;#39;t mean you love him less. It doesn&amp;#39;t mean he will love you less.&lt;/p&gt;\n\n&lt;p&gt;It does mean you&amp;#39;ve &lt;em&gt;chosen&lt;/em&gt; to love him, and he &lt;em&gt;chooses&lt;/em&gt; to love you. You have &lt;em&gt;chosen&lt;/em&gt; to be his father. That&amp;#39;s pretty powerful man, don&amp;#39;t ever think of it as something to be ashamed of, or that needs to be hidden.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdqb83", "score_hidden": false, "stickied": false, "created": 1492476141.0, "created_utc": 1492447341.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdnrbu", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "SEND_MORE_PIZZA", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm seconding the now. I don't have kids yet but I was adopted. It was just part of life. They were my mom and dad. I knew that other people \"made\" me, but the people that loved me and raised me? Those are my parents. If you just treat it as a normal part of life, he'll treat it as a normal part of life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m seconding the now. I don&amp;#39;t have kids yet but I was adopted. It was just part of life. They were my mom and dad. I knew that other people &amp;quot;made&amp;quot; me, but the people that loved me and raised me? Those are my parents. If you just treat it as a normal part of life, he&amp;#39;ll treat it as a normal part of life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdnrbu", "score_hidden": false, "stickied": false, "created": 1492473266.0, "created_utc": 1492444466.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdwzsq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Ishouldbeasleepnow", "parent_id": "t1_dgdohrf", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "The new baby is actually a good Segway. My oldest had lots of questions about babies &amp; families when we had our second. We talked a simplified version of genetics &amp; families &amp; everything. I think it's all about how you spin it. If you don't put the negative spin on it neither will he. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The new baby is actually a good Segway. My oldest had lots of questions about babies &amp;amp; families when we had our second. We talked a simplified version of genetics &amp;amp; families &amp;amp; everything. I think it&amp;#39;s all about how you spin it. If you don&amp;#39;t put the negative spin on it neither will he. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdwzsq", "score_hidden": false, "stickied": false, "created": 1492483568.0, "created_utc": 1492454768.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdohrf", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "gotbannedfornothing", "parent_id": "t1_dgdnt2g", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Actually BD, has 2 brothers and sisters and J has 9 cousins. We actually have an excellent​ relationship​ with BD's family who are kind and lovely people. His Grandma (A) dotes on him and takes him out for days out regularly.  \n\nThey have accepted me as one of their own. It's only a matter of time before he works it out.\n\nI think this thread is convincing us to tell him within the week.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually BD, has 2 brothers and sisters and J has 9 cousins. We actually have an excellent​ relationship​ with BD&amp;#39;s family who are kind and lovely people. His Grandma (A) dotes on him and takes him out for days out regularly.  &lt;/p&gt;\n\n&lt;p&gt;They have accepted me as one of their own. It&amp;#39;s only a matter of time before he works it out.&lt;/p&gt;\n\n&lt;p&gt;I think this thread is convincing us to tell him within the week.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdohrf", "score_hidden": false, "stickied": false, "created": 1492474108.0, "created_utc": 1492445308.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdnt2g", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Wishyouamerry", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Are there any relatives on BD's side that your son knows or knows of? If so, then it would be (relatively) simple to mention about how he has 3 grandmoms, for instance. Mommy's mommy, your mommy, and his other dad's mommy. Or talk about aunts - mommy's sister, your sister, and his other dad's sister.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are there any relatives on BD&amp;#39;s side that your son knows or knows of? If so, then it would be (relatively) simple to mention about how he has 3 grandmoms, for instance. Mommy&amp;#39;s mommy, your mommy, and his other dad&amp;#39;s mommy. Or talk about aunts - mommy&amp;#39;s sister, your sister, and his other dad&amp;#39;s sister.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdnt2g", "score_hidden": false, "stickied": false, "created": 1492473321.0, "created_utc": 1492444521.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdzo06", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Junipermuse", "parent_id": "t1_dgdtg1n", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "What's great about this explanation is that it also helps with the birds and the bees talk, which at 4 yo, OP's son is ready to learn about. Unlike with adoption conversations, which usually revolve around developing in another woman's belly, having a different bio dad is harder for kids to understand. I think if they had tried explaining it at two it would have sounded more like the OP didn't want to be the daddy. At four a kid can understand better how it takes two people to make a baby, but even though another person made him, the guy raising him is still his daddy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s great about this explanation is that it also helps with the birds and the bees talk, which at 4 yo, OP&amp;#39;s son is ready to learn about. Unlike with adoption conversations, which usually revolve around developing in another woman&amp;#39;s belly, having a different bio dad is harder for kids to understand. I think if they had tried explaining it at two it would have sounded more like the OP didn&amp;#39;t want to be the daddy. At four a kid can understand better how it takes two people to make a baby, but even though another person made him, the guy raising him is still his daddy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdzo06", "score_hidden": false, "stickied": false, "created": 1492486611.0, "created_utc": 1492457811.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdtg1n", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "kidsrcuterthancats", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Ask him if he knows how babies are made.  Listen to what he says and give him some version of it takes a male and a female to make a baby.  Explain that bio dad's name was the person who made him with mom and you are the person who made his sibling with his mom.  Explain that you are so happy that you get to be the dad for both him and sibling and you are looking forward to having more people to love in your family and that you hope the new baby is as great as he is.  Tell him some stories from when he was a baby and how fun it will be to be a big brother.  Tell him he is very special because he was the first person to make you a father.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ask him if he knows how babies are made.  Listen to what he says and give him some version of it takes a male and a female to make a baby.  Explain that bio dad&amp;#39;s name was the person who made him with mom and you are the person who made his sibling with his mom.  Explain that you are so happy that you get to be the dad for both him and sibling and you are looking forward to having more people to love in your family and that you hope the new baby is as great as he is.  Tell him some stories from when he was a baby and how fun it will be to be a big brother.  Tell him he is very special because he was the first person to make you a father.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdtg1n", "score_hidden": false, "stickied": false, "created": 1492479616.0, "created_utc": 1492450816.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdswpc", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "cmcg1227", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I think others can give good advice on HOW to tell him, but re: your edit - I don't think you've done your son any giant disservice by not telling him up until this point. I do agree that you should tell him soon. He may not comprehend what exactly all of this means right now, but I think long term having essentially \"always known\" will be better than finding out when he's nearing his teens. He will be able to fully understand it at that point, but he will also understand that you \"hid\" it from him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think others can give good advice on HOW to tell him, but re: your edit - I don&amp;#39;t think you&amp;#39;ve done your son any giant disservice by not telling him up until this point. I do agree that you should tell him soon. He may not comprehend what exactly all of this means right now, but I think long term having essentially &amp;quot;always known&amp;quot; will be better than finding out when he&amp;#39;s nearing his teens. He will be able to fully understand it at that point, but he will also understand that you &amp;quot;hid&amp;quot; it from him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdswpc", "score_hidden": false, "stickied": false, "created": 1492479027.0, "created_utc": 1492450227.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdv6dd", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "867452", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This is a different response than many here, but I grew up in a similar situation to your son. My parents didn't tell me until I was 11, and I'm happy they waited. I grew up thinking I was a part of the family, and I was never treated in any other way. I, of course had questions when I found out, and my parents and sisters (both of whom are biologically my dad's daughters, I am not) were very supportive and helpful. Now, I'm not saying this is the best choice for your family, as it's different for everyone. \n\nI can tell you two things. Your kid will feel okay with whatever decision you make, as long as you are sure it's the best thing for them. This is what I've told to anyone who asks about my family situation. If my parents had told me when I was younger, I would be just as fine today, because they made a decision for my well being and they were (or at least end acted) sure of it. So whatever decision you make, stick to it!\n\nI also want to say that I was curious for a long time about who my bio-dad was, and I chose to meet him when I was 16. I'm sure my dad was sad/upset/worried about my choice to meet bio-dad, but he was supportive and saw me through it. This is the most important part. At the end of that curious period, I confirmed what I already knew: My real dad was the one who had been by my side my whole life, and my bio-dad was just a sad, sick man who wasn't ready to be a parent, and maybe never can be. It sounds like you're a lot like my dad, so you should do great in this area, but I felt compelled to say it anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a different response than many here, but I grew up in a similar situation to your son. My parents didn&amp;#39;t tell me until I was 11, and I&amp;#39;m happy they waited. I grew up thinking I was a part of the family, and I was never treated in any other way. I, of course had questions when I found out, and my parents and sisters (both of whom are biologically my dad&amp;#39;s daughters, I am not) were very supportive and helpful. Now, I&amp;#39;m not saying this is the best choice for your family, as it&amp;#39;s different for everyone. &lt;/p&gt;\n\n&lt;p&gt;I can tell you two things. Your kid will feel okay with whatever decision you make, as long as you are sure it&amp;#39;s the best thing for them. This is what I&amp;#39;ve told to anyone who asks about my family situation. If my parents had told me when I was younger, I would be just as fine today, because they made a decision for my well being and they were (or at least end acted) sure of it. So whatever decision you make, stick to it!&lt;/p&gt;\n\n&lt;p&gt;I also want to say that I was curious for a long time about who my bio-dad was, and I chose to meet him when I was 16. I&amp;#39;m sure my dad was sad/upset/worried about my choice to meet bio-dad, but he was supportive and saw me through it. This is the most important part. At the end of that curious period, I confirmed what I already knew: My real dad was the one who had been by my side my whole life, and my bio-dad was just a sad, sick man who wasn&amp;#39;t ready to be a parent, and maybe never can be. It sounds like you&amp;#39;re a lot like my dad, so you should do great in this area, but I felt compelled to say it anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdv6dd", "score_hidden": false, "stickied": false, "created": 1492481522.0, "created_utc": 1492452722.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdyxpj", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "jordanlund", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "ASAP. My mom had shacked up with some dude and divorced him when I was three. For the longest time I remembered the abuse he heaped on us and thought he was my biodad. Turns out, he wasn't.\n\nThey didn't tell me until I was 12 because they thought \"Oh, kids that age will never remember...\"\n\nThen I told her \"When we lived with that guy in that one town we lived on the 2nd floor of a brick building. The lady next door was older and always gave me lemon drops or butterscotch candies, I liked the butterscotch better.\"\n\nHer face f-ing dropped. \"You were two, we lived there for 10 days...\"\n\nYeah, funny what kids remember.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ASAP. My mom had shacked up with some dude and divorced him when I was three. For the longest time I remembered the abuse he heaped on us and thought he was my biodad. Turns out, he wasn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;They didn&amp;#39;t tell me until I was 12 because they thought &amp;quot;Oh, kids that age will never remember...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Then I told her &amp;quot;When we lived with that guy in that one town we lived on the 2nd floor of a brick building. The lady next door was older and always gave me lemon drops or butterscotch candies, I liked the butterscotch better.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Her face f-ing dropped. &amp;quot;You were two, we lived there for 10 days...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Yeah, funny what kids remember.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdyxpj", "score_hidden": false, "stickied": false, "created": 1492485777.0, "created_utc": 1492456977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgeazs5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "culb77", "parent_id": "t1_dge2quq", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Upvoted for the best way I've ever heard of explaining this to a kid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Upvoted for the best way I&amp;#39;ve ever heard of explaining this to a kid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgeazs5", "score_hidden": false, "stickied": false, "created": 1492500266.0, "created_utc": 1492471466.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge2quq", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "babyrabiesfatty", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "So, like everyone has said, tell him asap. I once babysat a little girl and she asked me to read her, \"The book about me.\" I shrugged, said sure, and that she'd have to find it because I didn't know where it was. \n\nIt was a book, bound like a real book, on her bookshelf along with her other books that had pictures and a few sentences per page that explained that she was adopted. \n\nThere were pictures of her mom and dad saying that they really wanted a baby; pictures of her biological mother and her as a newborn saying that she came from her bio mom's tummy; pictures of her bio mom and her mom and dad holding her as a baby saying that bio mom gave her to them because she knew they would be great parents for her. Then pictures of mom, dad, and baby together saying that they were a family. \n\nIt was so sweet to read as an adult, and she *loved* that she had a book just about her. It was simplified, truthful, and its main message was that   there are different kinds of family, and that's cool. \n\nYou could still tell him verbally whenever you want but having a storybook could be awesome. Something like \"Mommy and bio dad used to love each other very much and had a baby; you. Then daddy got sick in a way that made him not very good at being a daddy so he went away. Mommy and gotbannedfornothing/Daddy met when you were a baby and decided to be a family. Now Mommy and Daddy are going to have a new baby and we're going to be a bigger family.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, like everyone has said, tell him asap. I once babysat a little girl and she asked me to read her, &amp;quot;The book about me.&amp;quot; I shrugged, said sure, and that she&amp;#39;d have to find it because I didn&amp;#39;t know where it was. &lt;/p&gt;\n\n&lt;p&gt;It was a book, bound like a real book, on her bookshelf along with her other books that had pictures and a few sentences per page that explained that she was adopted. &lt;/p&gt;\n\n&lt;p&gt;There were pictures of her mom and dad saying that they really wanted a baby; pictures of her biological mother and her as a newborn saying that she came from her bio mom&amp;#39;s tummy; pictures of her bio mom and her mom and dad holding her as a baby saying that bio mom gave her to them because she knew they would be great parents for her. Then pictures of mom, dad, and baby together saying that they were a family. &lt;/p&gt;\n\n&lt;p&gt;It was so sweet to read as an adult, and she &lt;em&gt;loved&lt;/em&gt; that she had a book just about her. It was simplified, truthful, and its main message was that   there are different kinds of family, and that&amp;#39;s cool. &lt;/p&gt;\n\n&lt;p&gt;You could still tell him verbally whenever you want but having a storybook could be awesome. Something like &amp;quot;Mommy and bio dad used to love each other very much and had a baby; you. Then daddy got sick in a way that made him not very good at being a daddy so he went away. Mommy and gotbannedfornothing/Daddy met when you were a baby and decided to be a family. Now Mommy and Daddy are going to have a new baby and we&amp;#39;re going to be a bigger family.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge2quq", "score_hidden": false, "stickied": false, "created": 1492490052.0, "created_utc": 1492461252.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdzx2u", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Bookgeekjess", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This will probably be buried but telling him doesn't need sad time. He is four so you can take him to his favorite park and open the conversation as \" Mommy and Dad wanted to tell you something\" and end with \"I loved you so much, I had to become your daddy.\" Make him feel special don't focus in being abandoned instead focus in how good he was that you wanted him. Focus on that and how can he be upset?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This will probably be buried but telling him doesn&amp;#39;t need sad time. He is four so you can take him to his favorite park and open the conversation as &amp;quot; Mommy and Dad wanted to tell you something&amp;quot; and end with &amp;quot;I loved you so much, I had to become your daddy.&amp;quot; Make him feel special don&amp;#39;t focus in being abandoned instead focus in how good he was that you wanted him. Focus on that and how can he be upset?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdzx2u", "score_hidden": false, "stickied": false, "created": 1492486893.0, "created_utc": 1492458093.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdy04s", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "unbiological", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I was told when I was 22. The difference for me, though, was that I was conceived via IVF, from a \"pool\" of sperm, keeping my biological dad anonymous. My dad that I grew up with since I was born has always been in the picture, so on the outside, were just like any other family. \n\nIt was a little strange finding out so late in life, but it didn't come as a complete shock. We didn't look much alike at all, so growing up, in the back of my mind, I knew something was amiss. Also, I can safely say that it didn't feel like they lied to me or that any trust was broken. My immediate thought after I found out was \"Well he's my dad and he's always been my dad. Biology doesn't change that.\" It just became a new piece of information for me to live with and ponder from time to time. \n\nMy parents' reasons for doing this were complicated and still kind of murky for me, but they did tell me why they waited. They didn't want any situations to arise where I could use it as ammunition against them.  E.g. if I ever had a fight with my dad, they could envision me yelling \"You're not my real father, you can't tell me what to do!\" or something like that, which seems really strange to me, but I suppose that could have been a possibility.\n\nAnd I think that ties into another benefit I had personally from being told at that age, which was that it felt earned. I allowed my dad to be my Dad, because it was all I knew. He was given the total benefit of the doubt, and to his credit didn't treat me any differently, or even give any inkling that I didn't come from him. I feel like if I were told this information as an adolescent, I might have been more inclined to be a little distant. Because now that I knew there wasn't that connection between us, I would be worried that he wasn't \"in it\" like other dads were, and that he would have to prove himself. Whereas, in reality, that was completely avoided by keeping me in the dark.  But this is all hypothetical, so take from it what you will.\n\nSo TL;DR: For me, this was info I could take at 22, and since my dad spent all those years earning his fatherhood, I didn't feel betrayed by the truth, and I have always and will continue to love my dad.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was told when I was 22. The difference for me, though, was that I was conceived via IVF, from a &amp;quot;pool&amp;quot; of sperm, keeping my biological dad anonymous. My dad that I grew up with since I was born has always been in the picture, so on the outside, were just like any other family. &lt;/p&gt;\n\n&lt;p&gt;It was a little strange finding out so late in life, but it didn&amp;#39;t come as a complete shock. We didn&amp;#39;t look much alike at all, so growing up, in the back of my mind, I knew something was amiss. Also, I can safely say that it didn&amp;#39;t feel like they lied to me or that any trust was broken. My immediate thought after I found out was &amp;quot;Well he&amp;#39;s my dad and he&amp;#39;s always been my dad. Biology doesn&amp;#39;t change that.&amp;quot; It just became a new piece of information for me to live with and ponder from time to time. &lt;/p&gt;\n\n&lt;p&gt;My parents&amp;#39; reasons for doing this were complicated and still kind of murky for me, but they did tell me why they waited. They didn&amp;#39;t want any situations to arise where I could use it as ammunition against them.  E.g. if I ever had a fight with my dad, they could envision me yelling &amp;quot;You&amp;#39;re not my real father, you can&amp;#39;t tell me what to do!&amp;quot; or something like that, which seems really strange to me, but I suppose that could have been a possibility.&lt;/p&gt;\n\n&lt;p&gt;And I think that ties into another benefit I had personally from being told at that age, which was that it felt earned. I allowed my dad to be my Dad, because it was all I knew. He was given the total benefit of the doubt, and to his credit didn&amp;#39;t treat me any differently, or even give any inkling that I didn&amp;#39;t come from him. I feel like if I were told this information as an adolescent, I might have been more inclined to be a little distant. Because now that I knew there wasn&amp;#39;t that connection between us, I would be worried that he wasn&amp;#39;t &amp;quot;in it&amp;quot; like other dads were, and that he would have to prove himself. Whereas, in reality, that was completely avoided by keeping me in the dark.  But this is all hypothetical, so take from it what you will.&lt;/p&gt;\n\n&lt;p&gt;So TL;DR: For me, this was info I could take at 22, and since my dad spent all those years earning his fatherhood, I didn&amp;#39;t feel betrayed by the truth, and I have always and will continue to love my dad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdy04s", "score_hidden": false, "stickied": false, "created": 1492484714.0, "created_utc": 1492455914.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdru23", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "PrintError", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We're wondering this ourselves. My son is six, my wife had been his \"mother\" since he was 18 months old and I threw out my ex wife. He has no idea she's adopted him. We're working with a school counselor to come up with a solution. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;re wondering this ourselves. My son is six, my wife had been his &amp;quot;mother&amp;quot; since he was 18 months old and I threw out my ex wife. He has no idea she&amp;#39;s adopted him. We&amp;#39;re working with a school counselor to come up with a solution. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdru23", "score_hidden": false, "stickied": false, "created": 1492477833.0, "created_utc": 1492449033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdwze1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tenorsaxman11", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I have advice from going through the exact same thing. I've been the stepdad and only father figure since he was about 10 months old, now's almost 7 years old. I just mention offhandedly now and again (when the context brings the topic up naturally) that he came from his Mom's tummy and that I met him when he was 8 months old and became his father. He has always been fine with that, it's just not a big deal to him. \n\nLater he'll have more nuanced questions, and when he's ready to ask them they will be from a place of full disclosure rather than him being mislead. \n\nI think it would be a huge mistake to sit him down and have some sort of \"serious discussion\".  We just keep it light and \"no big deal\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have advice from going through the exact same thing. I&amp;#39;ve been the stepdad and only father figure since he was about 10 months old, now&amp;#39;s almost 7 years old. I just mention offhandedly now and again (when the context brings the topic up naturally) that he came from his Mom&amp;#39;s tummy and that I met him when he was 8 months old and became his father. He has always been fine with that, it&amp;#39;s just not a big deal to him. &lt;/p&gt;\n\n&lt;p&gt;Later he&amp;#39;ll have more nuanced questions, and when he&amp;#39;s ready to ask them they will be from a place of full disclosure rather than him being mislead. &lt;/p&gt;\n\n&lt;p&gt;I think it would be a huge mistake to sit him down and have some sort of &amp;quot;serious discussion&amp;quot;.  We just keep it light and &amp;quot;no big deal&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdwze1", "score_hidden": false, "stickied": false, "created": 1492483555.0, "created_utc": 1492454755.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdw6b9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pcdvco", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Agree - tell him yearly and it's just part of 'normal'. I had known my step-son since he was 4 mos old, adopted at 5yo, didn't tell him until much later. It was a VERY bad choice and 100% would not repeat.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agree - tell him yearly and it&amp;#39;s just part of &amp;#39;normal&amp;#39;. I had known my step-son since he was 4 mos old, adopted at 5yo, didn&amp;#39;t tell him until much later. It was a VERY bad choice and 100% would not repeat.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdw6b9", "score_hidden": false, "stickied": false, "created": 1492482643.0, "created_utc": 1492453843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdzywx", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rxBootySlayer", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This is a talk I'm also going to have with my son, well I'm his biological mother but my long time boyfriend who is his sister's biological dad treats him like he's his own. \n\nMy son's bio dad wants nothing to do with him or myself. Quite frankly I'm happy with that because that guy is a horrible person... He told me to go kill myself after he was born. \n\nI'm almost to the point where I don't want to tell him unless he asks honestly. Also I don't want to say anything negative to the poor kid because I don't think his biological father will ever want​ anything to do with him and I don't want my son to hurt, I don't want him to be heartbroken, but if he ever wants to know.. the boy has every right. I just don't know if it's okay to tell him sooner or later. I'm pretty lost myself about this. \n\nI'm curious to read what others have to say about this situation though. \n\nI wish you luck OP!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a talk I&amp;#39;m also going to have with my son, well I&amp;#39;m his biological mother but my long time boyfriend who is his sister&amp;#39;s biological dad treats him like he&amp;#39;s his own. &lt;/p&gt;\n\n&lt;p&gt;My son&amp;#39;s bio dad wants nothing to do with him or myself. Quite frankly I&amp;#39;m happy with that because that guy is a horrible person... He told me to go kill myself after he was born. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m almost to the point where I don&amp;#39;t want to tell him unless he asks honestly. Also I don&amp;#39;t want to say anything negative to the poor kid because I don&amp;#39;t think his biological father will ever want​ anything to do with him and I don&amp;#39;t want my son to hurt, I don&amp;#39;t want him to be heartbroken, but if he ever wants to know.. the boy has every right. I just don&amp;#39;t know if it&amp;#39;s okay to tell him sooner or later. I&amp;#39;m pretty lost myself about this. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m curious to read what others have to say about this situation though. &lt;/p&gt;\n\n&lt;p&gt;I wish you luck OP!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdzywx", "score_hidden": false, "stickied": false, "created": 1492486950.0, "created_utc": 1492458150.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdum5q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "d0k74_j0n35", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "We adopted my little sister when she was almost 2.  We never had a \"sit down and tell her\" moment.  It was just a fact of life in our household.  She's adopted.  She is not biologically related to any of our family.  We've never pretended otherwise or hid that fact from her.  She's grown up extremely well-adjusted (she's in her late 20's now) and as far as I can tell has never had any hangups whatsoever stemming from her adoption.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We adopted my little sister when she was almost 2.  We never had a &amp;quot;sit down and tell her&amp;quot; moment.  It was just a fact of life in our household.  She&amp;#39;s adopted.  She is not biologically related to any of our family.  We&amp;#39;ve never pretended otherwise or hid that fact from her.  She&amp;#39;s grown up extremely well-adjusted (she&amp;#39;s in her late 20&amp;#39;s now) and as far as I can tell has never had any hangups whatsoever stemming from her adoption.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdum5q", "score_hidden": false, "stickied": false, "created": 1492480897.0, "created_utc": 1492452097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdvt8f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wdc331", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "IMO you should NEVER hide the truth (intentionally or just through not mentioning it) from kids when it comes to something like this. It should just always be a matter-of-fact conversation that is never hidden and always acknowledged and discussed. My daughter was conceived via sperm donation and the fact that she was conceived via sperm donation is just part of her life story. We've been very firm that we will never hide that fact from her, nor will we make it seem like a shameful thing. Everyone has their own unique story of where they come from and that's hers. I never want her feeling like who she is and where she came from is something shameful. It will never be a secret  \n\nI do recommend that if you're struggling with this issue to seek out some help from a child psychologist or family counselor who is adept at dealing with these kinds of things and addressing them in an age appropriate fashion. We sought out some guidance on how to deal with this and it was really helpful. Don't be afraid to reach out for help! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;IMO you should NEVER hide the truth (intentionally or just through not mentioning it) from kids when it comes to something like this. It should just always be a matter-of-fact conversation that is never hidden and always acknowledged and discussed. My daughter was conceived via sperm donation and the fact that she was conceived via sperm donation is just part of her life story. We&amp;#39;ve been very firm that we will never hide that fact from her, nor will we make it seem like a shameful thing. Everyone has their own unique story of where they come from and that&amp;#39;s hers. I never want her feeling like who she is and where she came from is something shameful. It will never be a secret  &lt;/p&gt;\n\n&lt;p&gt;I do recommend that if you&amp;#39;re struggling with this issue to seek out some help from a child psychologist or family counselor who is adept at dealing with these kinds of things and addressing them in an age appropriate fashion. We sought out some guidance on how to deal with this and it was really helpful. Don&amp;#39;t be afraid to reach out for help! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdvt8f", "score_hidden": false, "stickied": false, "created": 1492482232.0, "created_utc": 1492453432.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdy8pk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AberrantRambler", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "As someone who has never known his bio-dad, and known his step dad since ~3 years old and officially \"adopted\" by my step-dad at around ~10 years-old:\n\nTell him right away.\n\nYou should also make sure you're officially his father legally.  You can handle this one of two ways: either bring it up \"hey I'm not actually officially your dad - should we make it official?\" and then do it or do it and then have a celebration \"today's the day I'm officially your dad\".\n\nIt will be particularly helpful if his last name isn't the same as yours if you change it now.  I HATED changing my last name partway through the school year and having to \"relearn my name\" and definitely made me actually feel like less a part of the family for a while (which is ironic because now as an adult I can totally realize it 'should' have made me feel more like part of the family).  Over 20 years later and I don't really feel like it's my \"real\" name for some reason.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone who has never known his bio-dad, and known his step dad since ~3 years old and officially &amp;quot;adopted&amp;quot; by my step-dad at around ~10 years-old:&lt;/p&gt;\n\n&lt;p&gt;Tell him right away.&lt;/p&gt;\n\n&lt;p&gt;You should also make sure you&amp;#39;re officially his father legally.  You can handle this one of two ways: either bring it up &amp;quot;hey I&amp;#39;m not actually officially your dad - should we make it official?&amp;quot; and then do it or do it and then have a celebration &amp;quot;today&amp;#39;s the day I&amp;#39;m officially your dad&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;It will be particularly helpful if his last name isn&amp;#39;t the same as yours if you change it now.  I HATED changing my last name partway through the school year and having to &amp;quot;relearn my name&amp;quot; and definitely made me actually feel like less a part of the family for a while (which is ironic because now as an adult I can totally realize it &amp;#39;should&amp;#39; have made me feel more like part of the family).  Over 20 years later and I don&amp;#39;t really feel like it&amp;#39;s my &amp;quot;real&amp;quot; name for some reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdy8pk", "score_hidden": false, "stickied": false, "created": 1492484986.0, "created_utc": 1492456186.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge09cy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "alwayshuntress", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I just saw that you've already decided to talk to your son in steps. That's awesome. :)\n\nIn the meantime, make sure you talk about blended families, read books about them, explain that blood isn't what makes a family a family and so on. Lay the foundation so that when he's old enough to understand, your son knows that not sharing your blood, doesn't change a thing. Also...my personal feeling is to nip the half-sibling crap in the bud real fast, because many people want to draw that line. It's not helpful for family unity.\n\nI didn't tell my daughter that the dad who raised her wasn't her biological father until she bluntly asked. I hadn't ever lied about it and I even told my kids two very different stories about how I met their dad. I figured one of them would ask at some point. I'm going to go on record now and say that was a bad plan and I wish I had handled it differently.  Hindsight and all.\n\n\n", "edited": 1492459078.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just saw that you&amp;#39;ve already decided to talk to your son in steps. That&amp;#39;s awesome. :)&lt;/p&gt;\n\n&lt;p&gt;In the meantime, make sure you talk about blended families, read books about them, explain that blood isn&amp;#39;t what makes a family a family and so on. Lay the foundation so that when he&amp;#39;s old enough to understand, your son knows that not sharing your blood, doesn&amp;#39;t change a thing. Also...my personal feeling is to nip the half-sibling crap in the bud real fast, because many people want to draw that line. It&amp;#39;s not helpful for family unity.&lt;/p&gt;\n\n&lt;p&gt;I didn&amp;#39;t tell my daughter that the dad who raised her wasn&amp;#39;t her biological father until she bluntly asked. I hadn&amp;#39;t ever lied about it and I even told my kids two very different stories about how I met their dad. I figured one of them would ask at some point. I&amp;#39;m going to go on record now and say that was a bad plan and I wish I had handled it differently.  Hindsight and all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge09cy", "score_hidden": false, "stickied": false, "created": 1492487274.0, "created_utc": 1492458474.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdxq2x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "backwardsdipthong", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I was personally raised in the same situation as your son, though it was my birth mother and stepmother instead. \n\nI think my parents did right... they told me right away that I had two mothers, one that gave birth to me who couldn't take care of me ( she was an alcoholic). When she wrote cards, etc that was fine.  \n\nI will let you know, though, that my father did not allow her back into my life once she was healthy. Her side of the family was looking for me and unable to get in touch for years.  \n\nI resented my father for years for that, I missed out on the birth of my nephews etc etc because he did not keep in contact with her \n\nLet him know about his birth father and protect him from his birth father but remember it is also your responsibility to allow him back into your son's life as soon as he is healthy and able. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was personally raised in the same situation as your son, though it was my birth mother and stepmother instead. &lt;/p&gt;\n\n&lt;p&gt;I think my parents did right... they told me right away that I had two mothers, one that gave birth to me who couldn&amp;#39;t take care of me ( she was an alcoholic). When she wrote cards, etc that was fine.  &lt;/p&gt;\n\n&lt;p&gt;I will let you know, though, that my father did not allow her back into my life once she was healthy. Her side of the family was looking for me and unable to get in touch for years.  &lt;/p&gt;\n\n&lt;p&gt;I resented my father for years for that, I missed out on the birth of my nephews etc etc because he did not keep in contact with her &lt;/p&gt;\n\n&lt;p&gt;Let him know about his birth father and protect him from his birth father but remember it is also your responsibility to allow him back into your son&amp;#39;s life as soon as he is healthy and able. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdxq2x", "score_hidden": false, "stickied": false, "created": 1492484398.0, "created_utc": 1492455598.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge5y9q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "0MY", "parent_id": "t1_dgdy726", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "That's terrible :( Hopefully you can be there to help him through it when the time comes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s terrible :( Hopefully you can be there to help him through it when the time comes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge5y9q", "score_hidden": false, "stickied": false, "created": 1492493788.0, "created_utc": 1492464988.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdy726", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdy726", "score_hidden": false, "stickied": false, "created": 1492484933.0, "created_utc": 1492456133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdyw3d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "moe-hong", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Tell him the minute he is capable of understanding you. I suggest books on adoption from a very young age. Our kids knew it from a year old or less, and understood it a bit past there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell him the minute he is capable of understanding you. I suggest books on adoption from a very young age. Our kids knew it from a year old or less, and understood it a bit past there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdyw3d", "score_hidden": false, "stickied": false, "created": 1492485725.0, "created_utc": 1492456925.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge3lmj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "scrooch", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "This seems important and I'd try to get advice from a professional.  Many on here recommend full disclosure and cite their young children's acceptance as evidence.  I believe young children would have no problem with this.  My concern is about their teen years. How is that information suppose to help them?  How does it possibly make their life better or easier?  I lean towards just calling yourself dad (not a lie assuming you've adopted him) and tell them about BD when they are an adult (16-18) and can actually do something meaningful with that info.  Growing up is hard, why complicate it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This seems important and I&amp;#39;d try to get advice from a professional.  Many on here recommend full disclosure and cite their young children&amp;#39;s acceptance as evidence.  I believe young children would have no problem with this.  My concern is about their teen years. How is that information suppose to help them?  How does it possibly make their life better or easier?  I lean towards just calling yourself dad (not a lie assuming you&amp;#39;ve adopted him) and tell them about BD when they are an adult (16-18) and can actually do something meaningful with that info.  Growing up is hard, why complicate it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge3lmj", "score_hidden": false, "stickied": false, "created": 1492491010.0, "created_utc": 1492462210.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge3p6t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mszulan", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My parents never lied, but they also never directly told my sister that she had another progenitor until she came out and asked \nmy mom when she was 18.  IMO they waited a little too long.  But on the other hand, my father was \"our\" father in every way that mattered and because they waited to tell her, she really knew deep down that dad was her dad, too.  This other person was only relevant genetically.  \n\nYour son is only 4 right now.  He has a 4 year old's view of the world that is very centered on him.  It seems to me that that may be an opportunity for misunderstanding and self-blame, among other possible outcomes.  I'd listen to your own and your partner's feelings in the matter.  You know your child and yourselves best.   You'll know the right time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My parents never lied, but they also never directly told my sister that she had another progenitor until she came out and asked \nmy mom when she was 18.  IMO they waited a little too long.  But on the other hand, my father was &amp;quot;our&amp;quot; father in every way that mattered and because they waited to tell her, she really knew deep down that dad was her dad, too.  This other person was only relevant genetically.  &lt;/p&gt;\n\n&lt;p&gt;Your son is only 4 right now.  He has a 4 year old&amp;#39;s view of the world that is very centered on him.  It seems to me that that may be an opportunity for misunderstanding and self-blame, among other possible outcomes.  I&amp;#39;d listen to your own and your partner&amp;#39;s feelings in the matter.  You know your child and yourselves best.   You&amp;#39;ll know the right time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge3p6t", "score_hidden": false, "stickied": false, "created": 1492491120.0, "created_utc": 1492462320.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge5aaz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jentheoctopus", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Someone may have brought up this point, but his biological Father may get clean. He may want to have a relationship with his son at some point. What if you never told him? \nI agree with everyone else. Tell him NOW. Leave out excuses. His bio Dad can answer those questions if he ever comes back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Someone may have brought up this point, but his biological Father may get clean. He may want to have a relationship with his son at some point. What if you never told him? \nI agree with everyone else. Tell him NOW. Leave out excuses. His bio Dad can answer those questions if he ever comes back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge5aaz", "score_hidden": false, "stickied": false, "created": 1492492980.0, "created_utc": 1492464180.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge5hcw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SonneLore", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I'm in a similar situation; my eldest is not my partners biological son but has never known another father. We made the decision to tell him when he was mentally capable of understanding, and when he was 8, just before number 2 was born, we discussed our plans for my partner to adopt him. He understood quite well, and was proud of his dad for choosing him, and has been excited to finally share his dads last name (when we can actually afford it). I think the key is just being honest early, but when they're able to absorb it and understand properly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in a similar situation; my eldest is not my partners biological son but has never known another father. We made the decision to tell him when he was mentally capable of understanding, and when he was 8, just before number 2 was born, we discussed our plans for my partner to adopt him. He understood quite well, and was proud of his dad for choosing him, and has been excited to finally share his dads last name (when we can actually afford it). I think the key is just being honest early, but when they&amp;#39;re able to absorb it and understand properly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge5hcw", "score_hidden": false, "stickied": false, "created": 1492493218.0, "created_utc": 1492464418.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge5srf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Misses__Jones", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Another adopted person here. I've known my whole life. It would've made things really weird had it happened later on. Super lucky to have my adoptive parents. Best of luck to you guys xx", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another adopted person here. I&amp;#39;ve known my whole life. It would&amp;#39;ve made things really weird had it happened later on. Super lucky to have my adoptive parents. Best of luck to you guys xx&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge5srf", "score_hidden": false, "stickied": false, "created": 1492493600.0, "created_utc": 1492464800.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge6ov9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tameasp", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I don't think you should be upset at not having told him yet,  but the best time is indeed now.  Good luck.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you should be upset at not having told him yet,  but the best time is indeed now.  Good luck.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge6ov9", "score_hidden": false, "stickied": false, "created": 1492494703.0, "created_utc": 1492465903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge6uqb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ABookishSort", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "My cousin was in the same position as your son. His Mom married my uncle and he was told about age 5 that my uncle wasn't his birthfather. I guess the topic wasn't brought up again and he forgot about it. He found out again when he was 15 and went off the deep end. If you tell him make sure it's discussed occasionally so he doesn't forget. \n\nWhen we adopted our son I told my husband as soon as he can understand we will tell him. I also planned to bring the subject up periodically so he wouldn't forget. The topic came up when my sister in law was pregnant and my son realized that babies grow in tummy's (not literally but you know what I mean). My son was about 3 1/2 and he said, \"Mommy, I was in your tummy.\" That was my cue to tell him that he'd been in another Mommy's tummy and that she couldn't take care of him so she chose us to be his parents. He got sad and to my surprise he was the one that brought it up again. I didn't have too. He would ask questions and I would give him age appropriate information. A piece of advice given to me by another adoptive Mom I know was to tell my son how happy we were to have him in our lives and to not focus on the why's and wherefore's of birthmom's reasons. So we started doing that it seemed to help a bit when we would talk, more so when he was younger. Now that he's older (10 years old) he's dealing with some emotions over his adoption but I know we did the right thing in telling him young. To tell him today at age 10 would be devastating to him.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My cousin was in the same position as your son. His Mom married my uncle and he was told about age 5 that my uncle wasn&amp;#39;t his birthfather. I guess the topic wasn&amp;#39;t brought up again and he forgot about it. He found out again when he was 15 and went off the deep end. If you tell him make sure it&amp;#39;s discussed occasionally so he doesn&amp;#39;t forget. &lt;/p&gt;\n\n&lt;p&gt;When we adopted our son I told my husband as soon as he can understand we will tell him. I also planned to bring the subject up periodically so he wouldn&amp;#39;t forget. The topic came up when my sister in law was pregnant and my son realized that babies grow in tummy&amp;#39;s (not literally but you know what I mean). My son was about 3 1/2 and he said, &amp;quot;Mommy, I was in your tummy.&amp;quot; That was my cue to tell him that he&amp;#39;d been in another Mommy&amp;#39;s tummy and that she couldn&amp;#39;t take care of him so she chose us to be his parents. He got sad and to my surprise he was the one that brought it up again. I didn&amp;#39;t have too. He would ask questions and I would give him age appropriate information. A piece of advice given to me by another adoptive Mom I know was to tell my son how happy we were to have him in our lives and to not focus on the why&amp;#39;s and wherefore&amp;#39;s of birthmom&amp;#39;s reasons. So we started doing that it seemed to help a bit when we would talk, more so when he was younger. Now that he&amp;#39;s older (10 years old) he&amp;#39;s dealing with some emotions over his adoption but I know we did the right thing in telling him young. To tell him today at age 10 would be devastating to him.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge6uqb", "score_hidden": false, "stickied": false, "created": 1492494910.0, "created_utc": 1492466110.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge7jef", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Anivair", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Always and asap. It's not shameful or weird. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Always and asap. It&amp;#39;s not shameful or weird. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge7jef", "score_hidden": false, "stickied": false, "created": 1492495759.0, "created_utc": 1492466959.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dge7ob6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "libedon", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Tell him now. My biological father divorced my mom when I was two months old and I was raised by my stepdad, who legally adopted me when I was four. He's my dad, no questions asked. \n\nBut the relationship I had with my bio father was really confusing, and I would ask why he didn't love me, and he would pop in and out of my life, and he was not great for me as a stable figure in my life. He was severely depressed. Eventually my mom asked him to not contact me anymore, and he didn't for 15 years. \n\nShe didn't tell me that she told him to not contact me. \n\nI questioned why my mom did that initially, but now as a mother myself I realize that she did it to protect me from a volatile person who would not have been a positive role model in my life, as an adult or as a father. \n\nTell him, tell him gently, tell him it doesn't change anything, that you love him just the same, that it doesn't mean that his biological father doesn't love him, but that he isn't able to be there because he has some problems. Tell him that he is your world, make sure that he feels safe and secure in your love, hug him tightly, love him deeply. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell him now. My biological father divorced my mom when I was two months old and I was raised by my stepdad, who legally adopted me when I was four. He&amp;#39;s my dad, no questions asked. &lt;/p&gt;\n\n&lt;p&gt;But the relationship I had with my bio father was really confusing, and I would ask why he didn&amp;#39;t love me, and he would pop in and out of my life, and he was not great for me as a stable figure in my life. He was severely depressed. Eventually my mom asked him to not contact me anymore, and he didn&amp;#39;t for 15 years. &lt;/p&gt;\n\n&lt;p&gt;She didn&amp;#39;t tell me that she told him to not contact me. &lt;/p&gt;\n\n&lt;p&gt;I questioned why my mom did that initially, but now as a mother myself I realize that she did it to protect me from a volatile person who would not have been a positive role model in my life, as an adult or as a father. &lt;/p&gt;\n\n&lt;p&gt;Tell him, tell him gently, tell him it doesn&amp;#39;t change anything, that you love him just the same, that it doesn&amp;#39;t mean that his biological father doesn&amp;#39;t love him, but that he isn&amp;#39;t able to be there because he has some problems. Tell him that he is your world, make sure that he feels safe and secure in your love, hug him tightly, love him deeply. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge7ob6", "score_hidden": false, "stickied": false, "created": 1492495934.0, "created_utc": 1492467134.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgeejh6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nthrawnm", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I grew up in a imitar situation but instead of my Dad being alcohol he died 5 days before I was born from cancer. My Step Dad, I've always called him Dad, has been around since I was 2 years old and as far back as I can remember I have always known he wasn't my real Dad. That never changed my opinion of him or his role in my life. I personally think that being honest with your step son is the best policy. He will grow up knowing he has a different Dad than his siblings but it will be better that way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I grew up in a imitar situation but instead of my Dad being alcohol he died 5 days before I was born from cancer. My Step Dad, I&amp;#39;ve always called him Dad, has been around since I was 2 years old and as far back as I can remember I have always known he wasn&amp;#39;t my real Dad. That never changed my opinion of him or his role in my life. I personally think that being honest with your step son is the best policy. He will grow up knowing he has a different Dad than his siblings but it will be better that way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgeejh6", "score_hidden": false, "stickied": false, "created": 1492504777.0, "created_utc": 1492475977.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgeetmk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "counttheshadows", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Like others have said, sooner than later. \n\nOur boys are adopted (3 and 18mo) and we've told them since they we got them, and talk about how we got them, and that we picked them. There are tons of children's books about this stuff. It doesn't change anything as far as the kids are concerned. You can do it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Like others have said, sooner than later. &lt;/p&gt;\n\n&lt;p&gt;Our boys are adopted (3 and 18mo) and we&amp;#39;ve told them since they we got them, and talk about how we got them, and that we picked them. There are tons of children&amp;#39;s books about this stuff. It doesn&amp;#39;t change anything as far as the kids are concerned. You can do it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgeetmk", "score_hidden": false, "stickied": false, "created": 1492505131.0, "created_utc": 1492476331.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65w302", "likes": null, "replies": "", "user_reports": [], "id": "dgdrwjp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aiandi", "parent_id": "t3_65w302", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Let everything be in the open so he knows there is nothing to be ashamed about and that you are a family who doesn't keep secrets from one another.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Let everything be in the open so he knows there is nothing to be ashamed about and that you are a family who doesn&amp;#39;t keep secrets from one another.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdrwjp", "score_hidden": false, "stickied": false, "created": 1492477908.0, "created_utc": 1492449108.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]