[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Parenting", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, I want to make clear that I adore her boyfriend. Our entire family does from my mother down to my 6 year old.&lt;/p&gt;\n\n&lt;p&gt;The reason I feel conflicted about this is because my daughter was raped a few short months ago while off at school and this boyfriend was with her through all of the scary steps of calling the police and going to the hospital and even calling her father and I. &lt;/p&gt;\n\n&lt;p&gt;To make a very long story short, she didn&amp;#39;t want to be without him and he spent the holiday break at our home with our family. We didnt think anything of this. To us it made sense that shed want him here and over the course of this break the whole family fell in love with him. &lt;/p&gt;\n\n&lt;p&gt;I think under normal circumstances I&amp;#39;d give him a ringing endorsement but given that my daughter is dealing with the fallout of her assault emotionally and legally and he&amp;#39;s the guy always there for her, I think she may just be using him for a sense of safety. I think it&amp;#39;s extremely unhealthy for her to need him around so much and I&amp;#39;m not sure how to address it with her without making her feel attacked. &lt;/p&gt;\n\n&lt;p&gt;He has to be with her everywhere she goes. I only just found this out through my 17 year old daughter who was speaking to her on the phone. My daughter refuses to leave her apartment or any class unless he goes to escort her to where she needs to go. Apparently, according to her sister, she has panic attacks whenever he can&amp;#39;t make it or is running late. &lt;/p&gt;\n\n&lt;p&gt;How would you approach this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First of all, I want to make clear that I adore her boyfriend. Our entire family does from my mother down to my 6 year old.\n\nThe reason I feel conflicted about this is because my daughter was raped a few short months ago while off at school and this boyfriend was with her through all of the scary steps of calling the police and going to the hospital and even calling her father and I. \n\nTo make a very long story short, she didn't want to be without him and he spent the holiday break at our home with our family. We didnt think anything of this. To us it made sense that shed want him here and over the course of this break the whole family fell in love with him. \n\nI think under normal circumstances I'd give him a ringing endorsement but given that my daughter is dealing with the fallout of her assault emotionally and legally and he's the guy always there for her, I think she may just be using him for a sense of safety. I think it's extremely unhealthy for her to need him around so much and I'm not sure how to address it with her without making her feel attacked. \n\nHe has to be with her everywhere she goes. I only just found this out through my 17 year old daughter who was speaking to her on the phone. My daughter refuses to leave her apartment or any class unless he goes to escort her to where she needs to go. Apparently, according to her sister, she has panic attacks whenever he can't make it or is running late. \n\nHow would you approach this?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Teenager", "id": "65woam", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 14, "report_reasons": null, "author": "Sarah-SGP", "saved": false, "mod_reports": [], "name": "t3_65woam", "subreddit_name_prefixed": "r/Parenting", "approved_by": null, "over_18": false, "domain": "self.Parenting", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn3", "edited": false, "link_flair_css_class": "teenager", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Parenting/comments/65woam/my_daughter_keeps_treating_her_boyfriend_like_a/", "num_reports": null, "locked": false, "stickied": false, "created": 1492476026.0, "url": "https://www.reddit.com/r/Parenting/comments/65woam/my_daughter_keeps_treating_her_boyfriend_like_a/", "author_flair_text": null, "quarantine": false, "title": "My daughter keeps treating her boyfriend like a security blanket she can't be without. I'm posting here to get a few different perspectives on how to approach this.", "created_utc": 1492447226.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65woam", "likes": null, "replies": "", "user_reports": [], "id": "dgdr44q", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "warlocktx", "parent_id": "t3_65woam", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Has she had any sort of psych counseling or therapy?  This seems like something she should bring up with her therapist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Has she had any sort of psych counseling or therapy?  This seems like something she should bring up with her therapist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdr44q", "score_hidden": false, "stickied": false, "created": 1492477027.0, "created_utc": 1492448227.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65woam", "likes": null, "replies": "", "user_reports": [], "id": "dgds94h", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "margeink", "parent_id": "t3_65woam", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "Is she in therapy? She needs therapy. \n\nHow awful, though. Best wishes for your daughter. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is she in therapy? She needs therapy. &lt;/p&gt;\n\n&lt;p&gt;How awful, though. Best wishes for your daughter. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgds94h", "score_hidden": false, "stickied": false, "created": 1492478294.0, "created_utc": 1492449494.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65woam", "likes": null, "replies": "", "user_reports": [], "id": "dge0ewx", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "jells_bells", "parent_id": "t3_65woam", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "I had a similar unfortunate experience to your daughter when I was in college. My boyfriend (now husband) and I had been dating for several years at that point. I had an *incredibly* hard time going anywhere alone after the assault, particularly after I lost the court case and knew he was free about town. I had been so violated in such a familiar place (work) that I really didn't feel safe or comfortable anywhere for a long time. It also was healing for my boyfriend to be able to be a comfort to me, as he had a lot of guilt from being unable to \"protect\" me from my assaulter even though he was nowhere near. So this arrangement may be mutually beneficial for both your daughter and her boyfriend. Eventually I realized that he had his own classes and meetings and stuff to get to, so I would do stuff with my roommates or other friends when I felt I needed company to leave the house. \n\nI know \"a few months\" seems like a while to you, but right now she is probably still very fearful, raw, and emotional- even if she doesn't show it. I wouldn't say anything about her need to have him close at this point. It goes so much deeper than just needing him as a \"safety blanket.\" \n\nThis must be a hard situation for your whole family. I hope your daughter is seeing a counselor- if not, please look into that asap. I'd also encourage you and your spouse to see one as well (separately from hers). You seem like a really great, helpful, and supportive parent, but seeing a therapist can really give you some tools to better understand and support your daughter through this trauma. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a similar unfortunate experience to your daughter when I was in college. My boyfriend (now husband) and I had been dating for several years at that point. I had an &lt;em&gt;incredibly&lt;/em&gt; hard time going anywhere alone after the assault, particularly after I lost the court case and knew he was free about town. I had been so violated in such a familiar place (work) that I really didn&amp;#39;t feel safe or comfortable anywhere for a long time. It also was healing for my boyfriend to be able to be a comfort to me, as he had a lot of guilt from being unable to &amp;quot;protect&amp;quot; me from my assaulter even though he was nowhere near. So this arrangement may be mutually beneficial for both your daughter and her boyfriend. Eventually I realized that he had his own classes and meetings and stuff to get to, so I would do stuff with my roommates or other friends when I felt I needed company to leave the house. &lt;/p&gt;\n\n&lt;p&gt;I know &amp;quot;a few months&amp;quot; seems like a while to you, but right now she is probably still very fearful, raw, and emotional- even if she doesn&amp;#39;t show it. I wouldn&amp;#39;t say anything about her need to have him close at this point. It goes so much deeper than just needing him as a &amp;quot;safety blanket.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;This must be a hard situation for your whole family. I hope your daughter is seeing a counselor- if not, please look into that asap. I&amp;#39;d also encourage you and your spouse to see one as well (separately from hers). You seem like a really great, helpful, and supportive parent, but seeing a therapist can really give you some tools to better understand and support your daughter through this trauma. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dge0ewx", "score_hidden": false, "stickied": false, "created": 1492487446.0, "created_utc": 1492458646.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn3", "removal_reason": null, "link_id": "t3_65woam", "likes": null, "replies": "", "user_reports": [], "id": "dgdu0ps", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "oohcarrots", "parent_id": "t3_65woam", "subreddit_name_prefixed": "r/Parenting", "controversiality": 0, "body": "She went through something horrible a few short months ago. He was, and is there for her. Even if she was already in therapy with someone who was a great fit BEFORE this happened, she is not going to ok for a long time. If I were you I would not interfere with this in any way. Even if it's technically not the most healthy attachment, it's probably pretty low on the list of things that aren't going to be right for quite a while. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She went through something horrible a few short months ago. He was, and is there for her. Even if she was already in therapy with someone who was a great fit BEFORE this happened, she is not going to ok for a long time. If I were you I would not interfere with this in any way. Even if it&amp;#39;s technically not the most healthy attachment, it&amp;#39;s probably pretty low on the list of things that aren&amp;#39;t going to be right for quite a while. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Parenting", "name": "t1_dgdu0ps", "score_hidden": false, "stickied": false, "created": 1492480250.0, "created_utc": 1492451450.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}]