[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "EmpireDidNothingWrong", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Emperor Palpatine is one of the most controversial figures of the last few thousand years. He singlehandedly overthrew the corrupt Repbulic and instituted our glorious Empire. He became arguably the most powerful human to have ever lived, and he didn&amp;#39;t need to flee the galaxy and hide in the Unknown Regions to do it (unlike a certain previous &amp;quot;Emperor&amp;quot;...) Is it not inevitable that controversy would arise? Well, I&amp;#39;m here to dispel it. &lt;/p&gt;\n\n&lt;p&gt;Now of course, some would say &amp;quot;But Argonian, he doesn&amp;#39;t need to explain himself! He&amp;#39;s an Emperor! You&amp;#39;re just a traitor!&amp;quot;. I disagree. Many join the Rebellion because of ignorance. If they understood, perhaps they would change their mind. Conversion at gunpoint never works. You have to back your statements up. That&amp;#39;s what I intend to do here. &lt;/p&gt;\n\n&lt;p&gt;I. Dark does not mean &amp;quot;Evil&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Many people automatically associate darkness with evil. We&amp;#39;ve done it since the dawn of civilization. Yet, is not light capable of evil as well? Look at the example of the Jedi Order over 3000 years ago. They declared their intent to commit genocide on the Sith species! How is that compatible with &amp;quot;keepers of peace and justice?!&amp;quot; It&amp;#39;s not. For a counter, look at Revan. He saw the threat posed by the Sith Empire, and he took action by trying to reform the Republic into a body prepared for war. Or look at Vectivus, a Sith Lord who did the terrible deed of... running a mining business. &amp;quot;Dark&amp;quot; is just a label in the same vein of &amp;quot;Light.&amp;quot; They exist only to oversimplify far more complex concepts. &lt;/p&gt;\n\n&lt;p&gt;II. Order 66&lt;/p&gt;\n\n&lt;p&gt;Arguable the most controversial of Palpatine&amp;#39;s decisions, the order to destroy a specific group for their beliefs... at face value. Yet think about what that group was becoming. They had a private army in the form of the Temple Guard. They had nigh-exlusive control of the GAR. They even tried to directly assualt the then Chancellor and take over the Republic! Of course Palpatine would issue Order 66. He had a group of psychotic murderers out for his head! It was only a natural conclusion. The Jedi had grown too powerful and too greedy. Who knows what would have happened if they succeeded?&lt;/p&gt;\n\n&lt;p&gt;III. Republic vs Empire&lt;/p&gt;\n\n&lt;p&gt;Why would he re-organize the Republic at all? Look at the context. The Republic was old, tired. It&amp;#39;s bureaucracy had grown rampant. It had no military. It was letting a group of wackos on Coruscant run the galaxy. Change was desperately needed. He brought that change. His reforms have given us an era of actual peace. They have revitalized the economy. They have repaired the damage of the Clone Wars. Why do away with the Senate? Because with his new system of regional governers, not only is the Senate outdated, but planets can be ruled by people actually from those planets. No more cases of one Senator representing five different worlds, or species in even worse cases. Why beef up the military? In order to prepare us in the unlikely event we face an extra-galactic invasion. Why make the Inqusitorius? To have a group of Force users that are controllable. So on and so forth.&lt;/p&gt;\n\n&lt;p&gt;IV. The Clone Wars&lt;/p&gt;\n\n&lt;p&gt;I suppose I should give time to the theory that Palpatine secretly engineered the Clone Wars to make all of this happen. While the Emperor is obviously a Sith Lord, I highly doubt he was this &amp;quot;Darth Sidious&amp;quot; that certain people insist led the Seperatists. First, the office of Chancellor requires constant exposure to the limelight. He simply wouldn&amp;#39;t have the time to lead both CIS and Republic at the same time! Second, if he was already leader of the Republic, why would he want take over the galaxy from himself? Such a plan is highly impractical. Third, he can&amp;#39;t be in two places at once. No one can. Fourth, Where did this rumor even come from? Rebel propaganda. It totally sounds like something they would say, doesn&amp;#39;t it? &lt;/p&gt;\n\n&lt;p&gt;V. Conclusion&lt;/p&gt;\n\n&lt;p&gt;I hope I&amp;#39;ve adequatley done the job I set out to do. As I said in another post, sometimes the best weapon is the one that doesn&amp;#39;t fire a shot. With reason, we can take the Rebellion&amp;#39;s best advantage, propaganda, and throw it out the window.&lt;/p&gt;\n\n&lt;p&gt;Under Moon and Star&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Emperor Palpatine is one of the most controversial figures of the last few thousand years. He singlehandedly overthrew the corrupt Repbulic and instituted our glorious Empire. He became arguably the most powerful human to have ever lived, and he didn't need to flee the galaxy and hide in the Unknown Regions to do it (unlike a certain previous \"Emperor\"...) Is it not inevitable that controversy would arise? Well, I'm here to dispel it. \n\nNow of course, some would say \"But Argonian, he doesn't need to explain himself! He's an Emperor! You're just a traitor!\". I disagree. Many join the Rebellion because of ignorance. If they understood, perhaps they would change their mind. Conversion at gunpoint never works. You have to back your statements up. That's what I intend to do here. \n\nI. Dark does not mean \"Evil\"\n\nMany people automatically associate darkness with evil. We've done it since the dawn of civilization. Yet, is not light capable of evil as well? Look at the example of the Jedi Order over 3000 years ago. They declared their intent to commit genocide on the Sith species! How is that compatible with \"keepers of peace and justice?!\" It's not. For a counter, look at Revan. He saw the threat posed by the Sith Empire, and he took action by trying to reform the Republic into a body prepared for war. Or look at Vectivus, a Sith Lord who did the terrible deed of... running a mining business. \"Dark\" is just a label in the same vein of \"Light.\" They exist only to oversimplify far more complex concepts. \n\nII. Order 66\n\nArguable the most controversial of Palpatine's decisions, the order to destroy a specific group for their beliefs... at face value. Yet think about what that group was becoming. They had a private army in the form of the Temple Guard. They had nigh-exlusive control of the GAR. They even tried to directly assualt the then Chancellor and take over the Republic! Of course Palpatine would issue Order 66. He had a group of psychotic murderers out for his head! It was only a natural conclusion. The Jedi had grown too powerful and too greedy. Who knows what would have happened if they succeeded?\n\nIII. Republic vs Empire\n\nWhy would he re-organize the Republic at all? Look at the context. The Republic was old, tired. It's bureaucracy had grown rampant. It had no military. It was letting a group of wackos on Coruscant run the galaxy. Change was desperately needed. He brought that change. His reforms have given us an era of actual peace. They have revitalized the economy. They have repaired the damage of the Clone Wars. Why do away with the Senate? Because with his new system of regional governers, not only is the Senate outdated, but planets can be ruled by people actually from those planets. No more cases of one Senator representing five different worlds, or species in even worse cases. Why beef up the military? In order to prepare us in the unlikely event we face an extra-galactic invasion. Why make the Inqusitorius? To have a group of Force users that are controllable. So on and so forth.\n\nIV. The Clone Wars\n\nI suppose I should give time to the theory that Palpatine secretly engineered the Clone Wars to make all of this happen. While the Emperor is obviously a Sith Lord, I highly doubt he was this \"Darth Sidious\" that certain people insist led the Seperatists. First, the office of Chancellor requires constant exposure to the limelight. He simply wouldn't have the time to lead both CIS and Republic at the same time! Second, if he was already leader of the Republic, why would he want take over the galaxy from himself? Such a plan is highly impractical. Third, he can't be in two places at once. No one can. Fourth, Where did this rumor even come from? Rebel propaganda. It totally sounds like something they would say, doesn't it? \n\nV. Conclusion\n\nI hope I've adequatley done the job I set out to do. As I said in another post, sometimes the best weapon is the one that doesn't fire a shot. With reason, we can take the Rebellion's best advantage, propaganda, and throw it out the window.\n\nUnder Moon and Star", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Discussion", "id": "64xv4g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "argoniannerevarine", "saved": false, "mod_reports": [], "name": "t3_64xv4g", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "approved_by": null, "over_18": false, "domain": "self.EmpireDidNothingWrong", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_397yx", "edited": false, "link_flair_css_class": "info", "author_flair_css_class": "", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/EmpireDidNothingWrong/comments/64xv4g/one_for_the_emperor_a_defense_of_palpatine/", "num_reports": null, "locked": false, "stickied": false, "created": 1492029345.0, "url": "https://www.reddit.com/r/EmpireDidNothingWrong/comments/64xv4g/one_for_the_emperor_a_defense_of_palpatine/", "author_flair_text": "Imperial Commando, Brg. General, ISD Firestorm", "quarantine": false, "title": "One for the Emperor: A Defense of Palpatine", "created_utc": 1492000545.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": "", "user_reports": [], "id": "dg5v5li", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "cordless-31", "parent_id": "t3_64xv4g", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Nice. This should be a required reading in high school for all students in an area of high rebel activity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice. This should be a required reading in high school for all students in an area of high rebel activity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg5v5li", "score_hidden": false, "stickied": false, "created": 1492033057.0, "created_utc": 1492004257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": "", "user_reports": [], "id": "dg5x2qy", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "HeraldWasington", "parent_id": "t3_64xv4g", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Avenge our Emperor!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Avenge our Emperor!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg5x2qy", "score_hidden": false, "stickied": false, "created": 1492035534.0, "created_utc": 1492006734.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": "", "user_reports": [], "id": "dg6l4oo", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Erazai", "parent_id": "t3_64xv4g", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "I cannot stress your first point enough. Dark doesn't mean we don't want hugs, either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I cannot stress your first point enough. Dark doesn&amp;#39;t mean we don&amp;#39;t want hugs, either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg6l4oo", "score_hidden": false, "stickied": false, "created": 1492060983.0, "created_utc": 1492032183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": "", "user_reports": [], "id": "dg7hxqn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RealDarthPlagueis", "parent_id": "t3_64xv4g", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Darth Sidious is a total clown. Has zero credibility!\n\n#MakeTheEmpireGreatAgain", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Darth Sidious is a total clown. Has zero credibility!&lt;/p&gt;\n\n&lt;h1&gt;MakeTheEmpireGreatAgain&lt;/h1&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg7hxqn", "score_hidden": false, "stickied": false, "created": 1492116862.0, "created_utc": 1492088062.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": "", "user_reports": [], "id": "dg7xf0n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "argoniannerevarine", "parent_id": "t1_dg7xduu", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "What kind of N'wah heresy is that?!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What kind of N&amp;#39;wah heresy is that?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg7xf0n", "score_hidden": false, "stickied": false, "created": 1492134626.0, "created_utc": 1492105826.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7xduu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ALABAMA_LEPRECHAUN_", "parent_id": "t3_64xv4g", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "You know /u/argoniannerevarine, I think Dagoth Ur would make a great successor to Palpatine.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know &lt;a href=\"/u/argoniannerevarine\"&gt;/u/argoniannerevarine&lt;/a&gt;, I think Dagoth Ur would make a great successor to Palpatine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg7xduu", "score_hidden": false, "stickied": false, "created": 1492134590.0, "created_utc": 1492105790.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": "", "user_reports": [], "id": "dga0nec", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "otness_e", "parent_id": "t3_64xv4g", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "I. Agreed there regarding Dark =/= Evil. In fact, one of the biggest heroes on my home planet, Batman, was known as The Dark Knight. And for that matter, Light =/= Good, either, as Lucifer can attest to.\n\nII. Yeah, and let's not forget that the Jedi orchestrated for Anakin Skywalker to spy on then-Supreme Chancellor Palpatine specifically to sabotage their friendship in order to ensure they retained control of the \"chosen one\", which essentially meant they underwent treason for extremely selfish reasons.\n\nIII. Yeah, and quite frankly, the Republic having four different branches (not even divisions, but actual separate government entities) for Intelligence gathering seems to be too much. And leaving absolutely no military was stupid as well. Thank goodness the Emperor at least left a military for protecting the Empire. Besides, one of the Rebels' agents, a propagandist named George Lucas who is occupying my nation-state of America on my home planet, implied that the Old Republic was comparable to, among others, the First French Republic, which is actually even more of a reason to support the Empire replacing the Republic (let me put it this way: To say the First French Republic was merely broken is [a massive understatement](http://www.culturewars.com/CultureWars/Archives/Fidelity_archives/parricide.html), and what's even MORE sad is that it actually lasted a very short time due to mismanagement and especially people going nuts. What's worse is that some people actually want to re-enact that nightmare). Besides, from what I could gather of the Empire, it certainly didn't result in the Galaxy turning out like [The Pride Lands](https://vignette1.wikia.nocookie.net/disney/images/f/f1/The_Lion_King_-_Act_III_-_Pride_Rock_-_2.jpg/revision/latest?cb=20170121183945) or [the World](https://www.youtube.com/watch?v=5oywecZc0kY) [of](https://vignette3.wikia.nocookie.net/finalfantasy/images/6/6a/Final_Fantasy_VI_World_of_Ruin_%28thumb%29.png/revision/latest?cb=20081102065717) [Balance](https://www.youtube.com/watch?v=I-cdwDnryY0) did when [actual](http://disney.wikia.com/wiki/Scar) [demented dictators](http://finalfantasy.wikia.com/wiki/Kefka_Palazzo) took over (long story short, in the former example, a lion by the name of Scar [named so by a gash on his left eye due to an accident involving Water Buffalos], via hyenas, proceeded to kill his brother, the former king known as Mufasa, in order to take control of the throne, then tried to have his own nephew assassinated via the Hyenas after leading the latter to believe that Mufasa's death had been his fault due to a stampede of Wildebeest he seemingly accidentally caused. He then united the pride of lions with the Hyenas to create a \"glorious future\" for Pride Rock. What you see of the Pride Lands there, was the direct result of such policies, where most of the wildlife is either dead from overhunting (mostly due to the Hyenas forcing the Lionesses to overhunt), or otherwise fled the area to avoid further attacks, and it also happened during a drought, meaning there was no food OR water to go around. It got bad enough that even the Hyenas, who hated Mufasa and wanted him dead beforehand, were forced to admit they preferred his rule under their breath [as Scar outlawed even mentioning Mufasa at all, especially not in a favorable light compared to him], and when Sarabi, Mufasa's widow, tried to state that they leave Pride Rock due to the circumstances, Scar refused, clearly not even caring if he sentenced the Pride Lands to death due to thinking as King, he could do whatever he pleased. Needless to say, Simba returned, eventually learned Scar is the reason Mufasa's dead, and avenged him with some help from the Hyenas due to Scar trying to pin the blame on the latter for Mufasa's death when cornered. As far as the latter, well, long story short, Kefka usurped Emperor Gestahl's command to unleash the Warring Triad, and as you can see in the videos and the map, that had disastrous consequences, and worse, while Scar in the former example could care less if everyone was starving or dying, Kefka clearly reveled in the world being destroyed and people being killed. Think of him as being similar to Onimi of the Yuuzhan Vong.), that's got to count for something. And anyways, I think the fact that the Emperor allowed the Corporate Sector Authority to run with little interference beyond a tribute tax is fair enough. At least he didn't take over the means of production or try to regulate things beyond what's necessary. I even heard that's also the reason the economy in the Empire is as good as it is.\n\nIV. Well, maybe he's Darth Sidious, but that doesn't necessarily mean that Sidious was responsible for the Clone Wars, since you did indicate earlier that Tyrannus probably tried to pin the blame to save his own skin before dying, like Scar in a sense.\n\nV. Hope you're right about undoing the Rebel's propaganda. Really, I do, speaking as someone who's entire home planet had groups utilized \"reason\" as an excuse to slaughter many of us, even taking over universities to propagate crap.", "edited": 1492216818.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I. Agreed there regarding Dark =/= Evil. In fact, one of the biggest heroes on my home planet, Batman, was known as The Dark Knight. And for that matter, Light =/= Good, either, as Lucifer can attest to.&lt;/p&gt;\n\n&lt;p&gt;II. Yeah, and let&amp;#39;s not forget that the Jedi orchestrated for Anakin Skywalker to spy on then-Supreme Chancellor Palpatine specifically to sabotage their friendship in order to ensure they retained control of the &amp;quot;chosen one&amp;quot;, which essentially meant they underwent treason for extremely selfish reasons.&lt;/p&gt;\n\n&lt;p&gt;III. Yeah, and quite frankly, the Republic having four different branches (not even divisions, but actual separate government entities) for Intelligence gathering seems to be too much. And leaving absolutely no military was stupid as well. Thank goodness the Emperor at least left a military for protecting the Empire. Besides, one of the Rebels&amp;#39; agents, a propagandist named George Lucas who is occupying my nation-state of America on my home planet, implied that the Old Republic was comparable to, among others, the First French Republic, which is actually even more of a reason to support the Empire replacing the Republic (let me put it this way: To say the First French Republic was merely broken is &lt;a href=\"http://www.culturewars.com/CultureWars/Archives/Fidelity_archives/parricide.html\"&gt;a massive understatement&lt;/a&gt;, and what&amp;#39;s even MORE sad is that it actually lasted a very short time due to mismanagement and especially people going nuts. What&amp;#39;s worse is that some people actually want to re-enact that nightmare). Besides, from what I could gather of the Empire, it certainly didn&amp;#39;t result in the Galaxy turning out like &lt;a href=\"https://vignette1.wikia.nocookie.net/disney/images/f/f1/The_Lion_King_-_Act_III_-_Pride_Rock_-_2.jpg/revision/latest?cb=20170121183945\"&gt;The Pride Lands&lt;/a&gt; or &lt;a href=\"https://www.youtube.com/watch?v=5oywecZc0kY\"&gt;the World&lt;/a&gt; &lt;a href=\"https://vignette3.wikia.nocookie.net/finalfantasy/images/6/6a/Final_Fantasy_VI_World_of_Ruin_%28thumb%29.png/revision/latest?cb=20081102065717\"&gt;of&lt;/a&gt; &lt;a href=\"https://www.youtube.com/watch?v=I-cdwDnryY0\"&gt;Balance&lt;/a&gt; did when &lt;a href=\"http://disney.wikia.com/wiki/Scar\"&gt;actual&lt;/a&gt; &lt;a href=\"http://finalfantasy.wikia.com/wiki/Kefka_Palazzo\"&gt;demented dictators&lt;/a&gt; took over (long story short, in the former example, a lion by the name of Scar [named so by a gash on his left eye due to an accident involving Water Buffalos], via hyenas, proceeded to kill his brother, the former king known as Mufasa, in order to take control of the throne, then tried to have his own nephew assassinated via the Hyenas after leading the latter to believe that Mufasa&amp;#39;s death had been his fault due to a stampede of Wildebeest he seemingly accidentally caused. He then united the pride of lions with the Hyenas to create a &amp;quot;glorious future&amp;quot; for Pride Rock. What you see of the Pride Lands there, was the direct result of such policies, where most of the wildlife is either dead from overhunting (mostly due to the Hyenas forcing the Lionesses to overhunt), or otherwise fled the area to avoid further attacks, and it also happened during a drought, meaning there was no food OR water to go around. It got bad enough that even the Hyenas, who hated Mufasa and wanted him dead beforehand, were forced to admit they preferred his rule under their breath [as Scar outlawed even mentioning Mufasa at all, especially not in a favorable light compared to him], and when Sarabi, Mufasa&amp;#39;s widow, tried to state that they leave Pride Rock due to the circumstances, Scar refused, clearly not even caring if he sentenced the Pride Lands to death due to thinking as King, he could do whatever he pleased. Needless to say, Simba returned, eventually learned Scar is the reason Mufasa&amp;#39;s dead, and avenged him with some help from the Hyenas due to Scar trying to pin the blame on the latter for Mufasa&amp;#39;s death when cornered. As far as the latter, well, long story short, Kefka usurped Emperor Gestahl&amp;#39;s command to unleash the Warring Triad, and as you can see in the videos and the map, that had disastrous consequences, and worse, while Scar in the former example could care less if everyone was starving or dying, Kefka clearly reveled in the world being destroyed and people being killed. Think of him as being similar to Onimi of the Yuuzhan Vong.), that&amp;#39;s got to count for something. And anyways, I think the fact that the Emperor allowed the Corporate Sector Authority to run with little interference beyond a tribute tax is fair enough. At least he didn&amp;#39;t take over the means of production or try to regulate things beyond what&amp;#39;s necessary. I even heard that&amp;#39;s also the reason the economy in the Empire is as good as it is.&lt;/p&gt;\n\n&lt;p&gt;IV. Well, maybe he&amp;#39;s Darth Sidious, but that doesn&amp;#39;t necessarily mean that Sidious was responsible for the Clone Wars, since you did indicate earlier that Tyrannus probably tried to pin the blame to save his own skin before dying, like Scar in a sense.&lt;/p&gt;\n\n&lt;p&gt;V. Hope you&amp;#39;re right about undoing the Rebel&amp;#39;s propaganda. Really, I do, speaking as someone who&amp;#39;s entire home planet had groups utilized &amp;quot;reason&amp;quot; as an excuse to slaughter many of us, even taking over universities to propagate crap.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dga0nec", "score_hidden": false, "stickied": false, "created": 1492245319.0, "created_utc": 1492216519.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": "", "user_reports": [], "id": "dg8ph5d", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ktjwalker", "parent_id": "t1_dg8f8aw", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Y'all act like the Empire is perfect, but at its base it is simply power- hungry, emotionless things who can kill without flinching. The exceptions are those who defect to the Rebellion or get re-educated. This is why it will quickly lose popularity. Just as fast as your Death Star fell to a silly farmboy, actually!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Y&amp;#39;all act like the Empire is perfect, but at its base it is simply power- hungry, emotionless things who can kill without flinching. The exceptions are those who defect to the Rebellion or get re-educated. This is why it will quickly lose popularity. Just as fast as your Death Star fell to a silly farmboy, actually!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg8ph5d", "score_hidden": false, "stickied": false, "created": 1492169930.0, "created_utc": 1492141130.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8f8aw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LonelyMachines", "parent_id": "t1_dg73jkc", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Not my job.  If you want touchy feely, talk to Alderaan...oh, right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not my job.  If you want touchy feely, talk to Alderaan...oh, right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg8f8aw", "score_hidden": false, "stickied": false, "created": 1492155445.0, "created_utc": 1492126645.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg73jkc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ktjwalker", "parent_id": "t1_dg6zpgq", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Well aren't you the humanitarian? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well aren&amp;#39;t you the humanitarian? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg73jkc", "score_hidden": false, "stickied": false, "created": 1492084059.0, "created_utc": 1492055259.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6zpgq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "LonelyMachines", "parent_id": "t1_dg6wo2k", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Now, let's not be hasty.  Our merciful Emperor supports the right to free speech and individual expression, and... \n\nOh, who am I kidding?  I just installed a rectal probe on the interrogation droid and I've been dying to try it out.  Hold him down, boys. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Now, let&amp;#39;s not be hasty.  Our merciful Emperor supports the right to free speech and individual expression, and... &lt;/p&gt;\n\n&lt;p&gt;Oh, who am I kidding?  I just installed a rectal probe on the interrogation droid and I&amp;#39;ve been dying to try it out.  Hold him down, boys. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg6zpgq", "score_hidden": false, "stickied": false, "created": 1492078879.0, "created_utc": 1492050079.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6wo2k", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DrJavelin", "parent_id": "t1_dg6nse3", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Openly supporting the Rebellion?\n\nYou're going down, Rebel scum. Keep such treasonous lies away from us.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Openly supporting the Rebellion?&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re going down, Rebel scum. Keep such treasonous lies away from us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg6wo2k", "score_hidden": false, "stickied": false, "created": 1492075102.0, "created_utc": 1492046302.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_64xv4g", "likes": null, "replies": "", "user_reports": [], "id": "dg83nv6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ktjwalker", "parent_id": "t1_dg80qqq", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Yes! Number one will surprise you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes! Number one will surprise you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg83nv6", "score_hidden": false, "stickied": false, "created": 1492141335.0, "created_utc": 1492112535.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg80qqq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GandalfTheGreen03", "parent_id": "t1_dg6nse3", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Is that rebel propoganda I hear?    \nREEEEEEEEEEEE", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is that rebel propoganda I hear?&lt;br/&gt;\nREEEEEEEEEEEE&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg80qqq", "score_hidden": false, "stickied": false, "created": 1492138166.0, "created_utc": 1492109366.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nse3", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "ktjwalker", "parent_id": "t3_64xv4g", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "1. True\n\n2. He stole sentient beings' free will and forced them to murder their friends. And it was a small group of not even a billion, maybe even million members. What would it have done besides lead the Republic against the CIS and put Palpatine for trial?\n\n3. The Republic was very far from perfect, but that does not mean go from a republic to dictatorship. It means reform and create new laws to make it better. He did rebuild and revitalize, but at the cost of the individual man's freedom and voice and many people's pursuit of happiness and lives. See: Raada, Jedha. \n\n4. It's not impossible that he could orchestrate the Clone Wars, just implausible. There are usually two sith, and perhaps his apprentice was controlling the CIS while he played the part of the Republic? Surely he had quite a few connections to help him. It is quite the elaborate plan, but perfect at eliminating the Jedi and assuming control of the galaxy. \n\n5. You have reasonable points, but so does the Rebellion. Not everything we say is propaganda. You have good intentions, but in the wrong direction. \n\nMay the Force be with us", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;True&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;He stole sentient beings&amp;#39; free will and forced them to murder their friends. And it was a small group of not even a billion, maybe even million members. What would it have done besides lead the Republic against the CIS and put Palpatine for trial?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The Republic was very far from perfect, but that does not mean go from a republic to dictatorship. It means reform and create new laws to make it better. He did rebuild and revitalize, but at the cost of the individual man&amp;#39;s freedom and voice and many people&amp;#39;s pursuit of happiness and lives. See: Raada, Jedha. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It&amp;#39;s not impossible that he could orchestrate the Clone Wars, just implausible. There are usually two sith, and perhaps his apprentice was controlling the CIS while he played the part of the Republic? Surely he had quite a few connections to help him. It is quite the elaborate plan, but perfect at eliminating the Jedi and assuming control of the galaxy. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You have reasonable points, but so does the Rebellion. Not everything we say is propaganda. You have good intentions, but in the wrong direction. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;May the Force be with us&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dg6nse3", "score_hidden": false, "stickied": false, "created": 1492064205.0, "created_utc": 1492035405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]