[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "EmpireDidNothingWrong", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let me start by saying the developers of Battlefront II&amp;#39;s campaign are people after our own hearts.&lt;/p&gt;\n\n&lt;p&gt;Star Wars, at its core, is also about the hero&amp;#39;s journey.&lt;/p&gt;\n\n&lt;p&gt;All of the movies, all eight of them, from episode 1-8, and the spin-off and the series named Rebels, are about the Republic, the Jedi, the Rebellion/Resistance as the protagonists. And that&amp;#39;s great, for those who enjoy it which I know is a wide range of people. The Empire is portrayed as being &amp;quot;White Male Supremacists who are enslaving the entire galaxy and laying waste to entire worlds as they rape them of their natural resources.&amp;quot; That&amp;#39;s what the frame and narrative the movies have set them out to be, and its largely based on the point of view of the people who are fighting against them.&lt;/p&gt;\n\n&lt;p&gt;The main story of Rebels itself is a group of heroes joining together as a crew to fight against the &amp;quot;tyrannical and evil&amp;quot; Empire to help save the galaxy. The original trilogy is just the same with heroes like Luke, Leia, Han and company. &lt;/p&gt;\n\n&lt;p&gt;One thing comes to mind though, and that&amp;#39;s Obi-Wan&amp;#39;s quotes: &amp;quot;The truths we cling to depend greatly on our point of view.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The opening crawl from Revenge of the Sith states: &amp;quot;There are heroes on both sides.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know about you guys but I am absolutely stoked for the fresh narrative for Battlefront II and Inferno Squad does honor the Star Wars legacy of a hero&amp;#39;s journey, but the frame is set through the lens of an Imperial soldier. And that appeals to many people. Because at the end of the day one man&amp;#39;s hero is another man&amp;#39;s villain. I&amp;#39;m certain many of the Japenese citizens felt the United States were the villains when they launched a nuclear bomb on Hiroshima and Nagasaki, claiming countless lives much like the Rebels believe the Empire are evil for destroying Aldeeran. And I&amp;#39;ll stop right there as to not get into a political discussion, but again the Empire has its heroes, the Sith has its heroes. A hero can be defined by a person who, well, does heroic things.&lt;/p&gt;\n\n&lt;p&gt;The developers of the game basically set us in a path of a young woman born and raised in an Imperial world, schooled in knowledge of an Imperial utopia: order, security, peace. These ideals, deeply rooted into someone, is very difficult to destroy. So you have the perspective of those soldiers who whole-heartedly believe that the galaxy was saved by an Emperor, and a gang of evil fanatics/mages known as the Jedi where destroyed and the Clone Wars came to an end along with the seperatists. Then we have a group of people suddenly rise up to threaten what they perceive is good and just, and plan to throw a galaxy back into chaos and to restore a failed government that was ripe with corruption. The stormtroopers, in their eyes, believe the Rebels are terrorists and extremists, and they themselves to be the heroes to uphold law and order and are the hopes of a safer, more secure galaxy.&lt;/p&gt;\n\n&lt;p&gt;The Story of Battlefront II, in a way, is &amp;quot;good vs evil&amp;quot;, only because we are playing as the hero of one side. The Rebellion has heroes like Hera, Ezra, Sabine, Kanan Jarrus, Zeb, Jyn Erso, Luke and Leia Skywalker, etc and those are awesome stories to follow because they appeal to those who follow.&lt;/p&gt;\n\n&lt;p&gt;But the Empire has their heroes have different shifts in perspectives when we step into the shoes of the antagonists. But one of the makers of the game said:&lt;/p&gt;\n\n&lt;p&gt;QUOTE\n“If you are growing up in the Empire, Iden is exactly [a role model]. She is exactly that type of hero that you would look up to and that you would aspire to be, right? Because if you are a member of an Imperial academy, and you were trained into that and that’s what you believe in, that’s what you’ve been raised to sort of to become, she epitomises that. “She is still heroic on that level, just from a total different perspective. In a new point of view that we haven’t gone quite so deep in in Star Wars before.&lt;/p&gt;\n\n&lt;p&gt;Here are great quotes that gives us hope for a new Star Wars narrative:&lt;/p&gt;\n\n&lt;p&gt;Mark Thompson, game director at EA’s Motive, said the Battlefront 2 team wanted to go beyond the heroic stories of the Rebellion to explore a new frontline of war.&lt;/p&gt;\n\n&lt;p&gt;“We wanted to give the Empire heroes in that same way,” Thompson said during a preview event at Star Wars Celebration 2017. “Who are the elite soldiers on the battlefield who strike fear into the rebels? Who are the elite pilots that kids growing up look up to and aspire to be?&lt;/p&gt;\n\n&lt;p&gt;“We settled on this idea of telling a story from the Imperial perspective. The idea of special forces soldiers gave us this chance to become a new hero.”&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The main character Iden Versio — who is voiced by actress Janina Gavankar (True Blood, Sleepy Hollow) — was born and bred on Vardos, an entirely new planet in the Star Wars universe. Vardos, a sleek, sterile looking world, represents the utopian vision of Imperial rule. To Iden and the citizens of Vardos, the Empire symbolizes structure, peace and order. The Rebellion represents chaos, a terrorist organization that threatens the safety of the galaxy.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;“We never describe the Empire as the bad guys [in Battlefront 2],” Thompson said. “We never say Iden is a villain. We present the other side of the conflict.”&lt;/p&gt;\n\n&lt;p&gt;The developers basically asked: &amp;quot;What did members of the Galactic Empire do when the Death Star blew up? How did the Imperial soldiers on Endor feel as they watched their dreams of a stable galaxy burst into flames, right in front of their eyes? What did they think as they watched their friends die?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This is the Star Wars universe as seen from a new perspective, where the Galactic Empire is &amp;quot;good,&amp;quot; and the Rebel Alliance is a violent and misguided effort.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We&amp;#39;ve heard a lot about the heroes of the Rebellion in the Galactic Civil War, and we wanted to give the Empire heroes, We began from the question of, what does it mean when you take off that helmet? And in a very different way than Finn in The Force Awakens,&amp;quot; Lucasfilm Creative Executive Steve Blank says. &amp;quot;He takes his helmet off specifically to defect. But what does it mean for the day-to-day stormtrooper who believes in this, who is a part of this, what happens when they take off that helmet?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Thompson jumps in: &amp;quot;You take off the helmet in disbelief when you see the Death Star explode, and then you put it back on with a renewed determination. That becomes a powerful, character-defining moment.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Iden&amp;#39;s father is an admiral for the Empire, while her mother designs recruitment material for the same faction. She grows up on Vardos, an Imperial planet and society that she adores. Iden is a picturesque Imperial soldier who truly believes in the cause.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;She is so committed, she is so invested, that she puts all of her energy into being the best within the Empire,&amp;quot; Blank says. &amp;quot;So she ultimately gets to that top spot and becomes a special operative. She also carries with her all that it means to be a special operative: she is collected, she is focused, she is powerful and she is a commander. They vow revenge on the Rebels, who are seen as terrorists who threaten peace and order in the galaxy.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;“It was the idea of the explosion [that] the Death Star II is seen as a victory,” Thompson said of the story’s genesis. “That’s how it’s framed: a celebration.” But Motive Studios wanted to “turn that victory into a loss” for its main characters, to strengthen and reinforce their imperialistic beliefs and make them think “I want to avenge my emperor.”&lt;/p&gt;\n\n&lt;p&gt;tldr; Star Wars remains a great battle between good versus evil, and yet one man&amp;#39;s evil is another man&amp;#39;s good. I dare not quote Darth Vader about his point of view of the Jedi at the climax of Revenge of the Sith. The majority of fans sees the Empire as evil. Plenty of folks out there would be inclined to think otherwise, and that the rebellion are anarchists bent on upsetting the established order. The heroes are who we make them out to be.&lt;/p&gt;\n\n&lt;p&gt;I. Am. So. Stoked!!! Please tell me you guys are just as excited as I am?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Let me start by saying the developers of Battlefront II's campaign are people after our own hearts.\n\n\nStar Wars, at its core, is also about the hero's journey.\n\nAll of the movies, all eight of them, from episode 1-8, and the spin-off and the series named Rebels, are about the Republic, the Jedi, the Rebellion/Resistance as the protagonists. And that's great, for those who enjoy it which I know is a wide range of people. The Empire is portrayed as being \"White Male Supremacists who are enslaving the entire galaxy and laying waste to entire worlds as they rape them of their natural resources.\" That's what the frame and narrative the movies have set them out to be, and its largely based on the point of view of the people who are fighting against them.\n\nThe main story of Rebels itself is a group of heroes joining together as a crew to fight against the \"tyrannical and evil\" Empire to help save the galaxy. The original trilogy is just the same with heroes like Luke, Leia, Han and company. \n\nOne thing comes to mind though, and that's Obi-Wan's quotes: \"The truths we cling to depend greatly on our point of view.\"\n\nThe opening crawl from Revenge of the Sith states: \"There are heroes on both sides.\"\n\nI don't know about you guys but I am absolutely stoked for the fresh narrative for Battlefront II and Inferno Squad does honor the Star Wars legacy of a hero's journey, but the frame is set through the lens of an Imperial soldier. And that appeals to many people. Because at the end of the day one man's hero is another man's villain. I'm certain many of the Japenese citizens felt the United States were the villains when they launched a nuclear bomb on Hiroshima and Nagasaki, claiming countless lives much like the Rebels believe the Empire are evil for destroying Aldeeran. And I'll stop right there as to not get into a political discussion, but again the Empire has its heroes, the Sith has its heroes. A hero can be defined by a person who, well, does heroic things.\n\nThe developers of the game basically set us in a path of a young woman born and raised in an Imperial world, schooled in knowledge of an Imperial utopia: order, security, peace. These ideals, deeply rooted into someone, is very difficult to destroy. So you have the perspective of those soldiers who whole-heartedly believe that the galaxy was saved by an Emperor, and a gang of evil fanatics/mages known as the Jedi where destroyed and the Clone Wars came to an end along with the seperatists. Then we have a group of people suddenly rise up to threaten what they perceive is good and just, and plan to throw a galaxy back into chaos and to restore a failed government that was ripe with corruption. The stormtroopers, in their eyes, believe the Rebels are terrorists and extremists, and they themselves to be the heroes to uphold law and order and are the hopes of a safer, more secure galaxy.\n\nThe Story of Battlefront II, in a way, is \"good vs evil\", only because we are playing as the hero of one side. The Rebellion has heroes like Hera, Ezra, Sabine, Kanan Jarrus, Zeb, Jyn Erso, Luke and Leia Skywalker, etc and those are awesome stories to follow because they appeal to those who follow.\n\nBut the Empire has their heroes have different shifts in perspectives when we step into the shoes of the antagonists. But one of the makers of the game said:\n\nQUOTE\n“If you are growing up in the Empire, Iden is exactly [a role model]. She is exactly that type of hero that you would look up to and that you would aspire to be, right? Because if you are a member of an Imperial academy, and you were trained into that and that’s what you believe in, that’s what you’ve been raised to sort of to become, she epitomises that. “She is still heroic on that level, just from a total different perspective. In a new point of view that we haven’t gone quite so deep in in Star Wars before.\n\nHere are great quotes that gives us hope for a new Star Wars narrative:\n\n\nMark Thompson, game director at EA’s Motive, said the Battlefront 2 team wanted to go beyond the heroic stories of the Rebellion to explore a new frontline of war.\n\n“We wanted to give the Empire heroes in that same way,” Thompson said during a preview event at Star Wars Celebration 2017. “Who are the elite soldiers on the battlefield who strike fear into the rebels? Who are the elite pilots that kids growing up look up to and aspire to be?\n\n“We settled on this idea of telling a story from the Imperial perspective. The idea of special forces soldiers gave us this chance to become a new hero.”\n\n\"The main character Iden Versio — who is voiced by actress Janina Gavankar (True Blood, Sleepy Hollow) — was born and bred on Vardos, an entirely new planet in the Star Wars universe. Vardos, a sleek, sterile looking world, represents the utopian vision of Imperial rule. To Iden and the citizens of Vardos, the Empire symbolizes structure, peace and order. The Rebellion represents chaos, a terrorist organization that threatens the safety of the galaxy.\"\n\n“We never describe the Empire as the bad guys [in Battlefront 2],” Thompson said. “We never say Iden is a villain. We present the other side of the conflict.”\n\nThe developers basically asked: \"What did members of the Galactic Empire do when the Death Star blew up? How did the Imperial soldiers on Endor feel as they watched their dreams of a stable galaxy burst into flames, right in front of their eyes? What did they think as they watched their friends die?\"\n\n\"This is the Star Wars universe as seen from a new perspective, where the Galactic Empire is \"good,\" and the Rebel Alliance is a violent and misguided effort.\n\n\"We've heard a lot about the heroes of the Rebellion in the Galactic Civil War, and we wanted to give the Empire heroes, We began from the question of, what does it mean when you take off that helmet? And in a very different way than Finn in The Force Awakens,\" Lucasfilm Creative Executive Steve Blank says. \"He takes his helmet off specifically to defect. But what does it mean for the day-to-day stormtrooper who believes in this, who is a part of this, what happens when they take off that helmet?\"\n\nThompson jumps in: \"You take off the helmet in disbelief when you see the Death Star explode, and then you put it back on with a renewed determination. That becomes a powerful, character-defining moment.\"\n\n\"Iden's father is an admiral for the Empire, while her mother designs recruitment material for the same faction. She grows up on Vardos, an Imperial planet and society that she adores. Iden is a picturesque Imperial soldier who truly believes in the cause.\"\n\n\"She is so committed, she is so invested, that she puts all of her energy into being the best within the Empire,\" Blank says. \"So she ultimately gets to that top spot and becomes a special operative. She also carries with her all that it means to be a special operative: she is collected, she is focused, she is powerful and she is a commander. They vow revenge on the Rebels, who are seen as terrorists who threaten peace and order in the galaxy.\"\n\n“It was the idea of the explosion [that] the Death Star II is seen as a victory,” Thompson said of the story’s genesis. “That’s how it’s framed: a celebration.” But Motive Studios wanted to “turn that victory into a loss” for its main characters, to strengthen and reinforce their imperialistic beliefs and make them think “I want to avenge my emperor.”\n\ntldr; Star Wars remains a great battle between good versus evil, and yet one man's evil is another man's good. I dare not quote Darth Vader about his point of view of the Jedi at the climax of Revenge of the Sith. The majority of fans sees the Empire as evil. Plenty of folks out there would be inclined to think otherwise, and that the rebellion are anarchists bent on upsetting the established order. The heroes are who we make them out to be.\n\nI. Am. So. Stoked!!! Please tell me you guys are just as excited as I am?\n\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Informative", "id": "65xbg9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 18, "report_reasons": null, "author": "LifeByTheSword", "saved": false, "mod_reports": [], "name": "t3_65xbg9", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "approved_by": null, "over_18": false, "domain": "self.EmpireDidNothingWrong", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_397yx", "edited": false, "link_flair_css_class": "info", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/EmpireDidNothingWrong/comments/65xbg9/battlefront_ii_imperial_pov_but_star_warsgood_vs/", "num_reports": null, "locked": false, "stickied": false, "created": 1492482032.0, "url": "https://www.reddit.com/r/EmpireDidNothingWrong/comments/65xbg9/battlefront_ii_imperial_pov_but_star_warsgood_vs/", "author_flair_text": null, "quarantine": false, "title": "Battlefront II: Imperial POV. But Star Wars=Good vs Evil.", "created_utc": 1492453232.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 4, "visited": false, "subreddit_type": "public", "ups": 18}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_65xbg9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_65xbg9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_65xbg9", "likes": null, "replies": "", "user_reports": [], "id": "dgdyz85", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "giphy", "parent_id": "t1_dgdyz4x", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "[applause](http://giphy.com/gifs/thisisgiphy-reaction-audience-l4HodBpDmoMA5p9bG?utm_source=giphy-reddit-bot&amp;utm_medium=bot&amp;utm_campaign=Reddit%20Bot&amp;utm_term=applause)\r\n\r\n_Blippity blop bop! I'm the official GIPHY Bot for reddit. For more info, respond with /giphy #help_", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://giphy.com/gifs/thisisgiphy-reaction-audience-l4HodBpDmoMA5p9bG?utm_source=giphy-reddit-bot&amp;amp;utm_medium=bot&amp;amp;utm_campaign=Reddit%20Bot&amp;amp;utm_term=applause\"&gt;applause&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Blippity blop bop! I&amp;#39;m the official GIPHY Bot for reddit. For more info, respond with /giphy #help&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dgdyz85", "score_hidden": false, "stickied": false, "created": 1492485826.0, "created_utc": 1492457026.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdyz4x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "pescennius", "parent_id": "t1_dgdw4ua", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "/giphy applause", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;/giphy applause&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dgdyz4x", "score_hidden": false, "stickied": false, "created": 1492485822.0, "created_utc": 1492457022.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdw4ua", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Ser_Blue", "parent_id": "t3_65xbg9", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "I'm ready to my do my duty, and if that involves showing some rebel scum the business end of my E-11, well, all the better.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m ready to my do my duty, and if that involves showing some rebel scum the business end of my E-11, well, all the better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dgdw4ua", "score_hidden": false, "stickied": false, "created": 1492482597.0, "created_utc": 1492453797.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_397yx", "removal_reason": null, "link_id": "t3_65xbg9", "likes": null, "replies": "", "user_reports": [], "id": "dge7sah", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sid_Scorpio", "parent_id": "t3_65xbg9", "subreddit_name_prefixed": "r/EmpireDidNothingWrong", "controversiality": 0, "body": "Finally, we are striking a major blow against the Rebel propaganda machine. A fleet of horribly beweaponed warships is fine in a battle, but what good are they when the terrorists control the media and have poisoned the minds of the entire galaxy against us?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Finally, we are striking a major blow against the Rebel propaganda machine. A fleet of horribly beweaponed warships is fine in a battle, but what good are they when the terrorists control the media and have poisoned the minds of the entire galaxy against us?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "EmpireDidNothingWrong", "name": "t1_dge7sah", "score_hidden": false, "stickied": false, "created": 1492496075.0, "created_utc": 1492467275.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]