[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "GTAV", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know how it is for you guys, but on PC the hacking/modding has gotten &lt;em&gt;wildly&lt;/em&gt; out of control. I usually start my &amp;quot;day&amp;quot; in GTA by loading into a session... with a modder. Then I&amp;#39;ll switch sessions, to find another modder. Repeat this 3-4 times and I will eventually find a quiet session without a modder.&lt;/p&gt;\n\n&lt;p&gt;For about twenty minutes.&lt;/p&gt;\n\n&lt;p&gt;Then, as is wont to happen, more people join and leave the server and sooner rather than later, a modder shows up and I have to start the whole process again.&lt;/p&gt;\n\n&lt;p&gt;GTA Online is &lt;em&gt;such&lt;/em&gt; a good game, but the experience for PC players is being &lt;em&gt;seriously affected&lt;/em&gt; by the hacking. Hell, it seems the chat box on PC can just get completely renamed to the &amp;quot;ask for money&amp;quot; box (exaggerating for effect, but not a whole lot!) at this point.&lt;/p&gt;\n\n&lt;p&gt;Do we have any communication from Rockstar on steps being taken to tighten the game up? They still seem to be making enough money from Online to keep it going, so there should be &lt;em&gt;no reason&lt;/em&gt; that they can&amp;#39;t put some of that toward a patch.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sick of reading about people getting banned, some legitimately, some apparently illegitimately (none of us can confirm or deny if these were legitimate or not, because Rockstar doesn&amp;#39;t communicate any information about bans) because Rockstar can&amp;#39;t get its shit together in this regard.&lt;/p&gt;\n\n&lt;p&gt;The latest thing--as I understand it--is hackers being able to &lt;em&gt;drain&lt;/em&gt; money from you as well as give it to you. In a game where Rockstar wants to &lt;em&gt;sell&lt;/em&gt; you money hacks (that&amp;#39;s what Shark Cards are, kids!), they &lt;em&gt;can&amp;#39;t&lt;/em&gt; just sit by and not react when unscrupulous players are taking digital currency from others that Rockstar was &lt;em&gt;paid for.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;To some extent, hacking is a fact of life for PC gaming--I understand that. But Rockstar is big enough, rich enough and experienced enough to make GTA Online a &lt;em&gt;hell&lt;/em&gt; of a lot tighter than it is. Why aren&amp;#39;t they talking about this shit? If they are and I just couldn&amp;#39;t find it, please feel free to direct me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't know how it is for you guys, but on PC the hacking/modding has gotten *wildly* out of control. I usually start my \"day\" in GTA by loading into a session... with a modder. Then I'll switch sessions, to find another modder. Repeat this 3-4 times and I will eventually find a quiet session without a modder.\n\nFor about twenty minutes.\n\nThen, as is wont to happen, more people join and leave the server and sooner rather than later, a modder shows up and I have to start the whole process again.\n\nGTA Online is *such* a good game, but the experience for PC players is being *seriously affected* by the hacking. Hell, it seems the chat box on PC can just get completely renamed to the \"ask for money\" box (exaggerating for effect, but not a whole lot!) at this point.\n\nDo we have any communication from Rockstar on steps being taken to tighten the game up? They still seem to be making enough money from Online to keep it going, so there should be *no reason* that they can't put some of that toward a patch.\n\nI'm sick of reading about people getting banned, some legitimately, some apparently illegitimately (none of us can confirm or deny if these were legitimate or not, because Rockstar doesn't communicate any information about bans) because Rockstar can't get its shit together in this regard.\n\nThe latest thing--as I understand it--is hackers being able to *drain* money from you as well as give it to you. In a game where Rockstar wants to *sell* you money hacks (that's what Shark Cards are, kids!), they *can't* just sit by and not react when unscrupulous players are taking digital currency from others that Rockstar was *paid for.*\n\nTo some extent, hacking is a fact of life for PC gaming--I understand that. But Rockstar is big enough, rich enough and experienced enough to make GTA Online a *hell* of a lot tighter than it is. Why aren't they talking about this shit? If they are and I just couldn't find it, please feel free to direct me.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65qdy1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "TheRagingDead", "saved": false, "mod_reports": [], "name": "t3_65qdy1", "subreddit_name_prefixed": "r/GTAV", "approved_by": null, "over_18": false, "domain": "self.GTAV", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2rjys", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/GTAV/comments/65qdy1/any_communication_from_rockstar_about/", "num_reports": null, "locked": false, "stickied": false, "created": 1492393898.0, "url": "https://www.reddit.com/r/GTAV/comments/65qdy1/any_communication_from_rockstar_about/", "author_flair_text": null, "quarantine": false, "title": "Any Communication from Rockstar About Preventative Hacking Measures?", "created_utc": 1492365098.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjys", "removal_reason": null, "link_id": "t3_65qdy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjys", "removal_reason": null, "link_id": "t3_65qdy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2rjys", "removal_reason": null, "link_id": "t3_65qdy1", "likes": null, "replies": "", "user_reports": [], "id": "dgd5bjt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Basemastuh_J", "parent_id": "t1_dgd3yhr", "subreddit_name_prefixed": "r/GTAV", "controversiality": 0, "body": "They never planned on gta being this big or getting more players almost 4 years later. It was supposed to be basically a little upgrade from gta 4 now its a barebones mmorpg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They never planned on gta being this big or getting more players almost 4 years later. It was supposed to be basically a little upgrade from gta 4 now its a barebones mmorpg&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GTAV", "name": "t1_dgd5bjt", "score_hidden": false, "stickied": false, "created": 1492434756.0, "created_utc": 1492405956.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3yhr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheRagingDead", "parent_id": "t1_dgcsx2i", "subreddit_name_prefixed": "r/GTAV", "controversiality": 0, "body": "Jeez. The very least they could do if they can't fix the game is not harass people who make private servers to alleviate the problem.\n\nAlso, how--*HOW*--in this day and age are developers *still using peer-to-peer hosting?* It is always, *always* a bad idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Jeez. The very least they could do if they can&amp;#39;t fix the game is not harass people who make private servers to alleviate the problem.&lt;/p&gt;\n\n&lt;p&gt;Also, how--&lt;em&gt;HOW&lt;/em&gt;--in this day and age are developers &lt;em&gt;still using peer-to-peer hosting?&lt;/em&gt; It is always, &lt;em&gt;always&lt;/em&gt; a bad idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GTAV", "name": "t1_dgd3yhr", "score_hidden": false, "stickied": false, "created": 1492432199.0, "created_utc": 1492403399.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsx2i", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Basemastuh_J", "parent_id": "t3_65qdy1", "subreddit_name_prefixed": "r/GTAV", "controversiality": 0, "body": "  I don't think its possible for them to stop it since the game is one, peer to peer, and people have made custom servers somehow once again. The first time the custom servers were made Rockstar had to send a lawyer with a cease and desist to the creators house I guess because they had no way of banning it. Now someone has created a new one (Roleplay). They are in fact the top streams of GTA 5 lately almost 24/7. I saw how much work they put into the rpg scripting and it actually looked more fun sometimes than vanilla gta lol. Kinda sad when people can use your servers against you and make private rooms and you can't do anything about it. Must be some shitty netcode. So no I don't think they can stop it. \n\n  I have also been hearing reports of Modders finding a way to mod the house/apartment/mechanic bills that come in regularly to charge all players in a session 100's of millions of dollars to completely wipe people's banks. Not sure if this is true and if Rockstar is giving it back if so but I remember things with negative amount bounties happening back on ps3 so it could be possible. Kinda scared to play in pub lobbies now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think its possible for them to stop it since the game is one, peer to peer, and people have made custom servers somehow once again. The first time the custom servers were made Rockstar had to send a lawyer with a cease and desist to the creators house I guess because they had no way of banning it. Now someone has created a new one (Roleplay). They are in fact the top streams of GTA 5 lately almost 24/7. I saw how much work they put into the rpg scripting and it actually looked more fun sometimes than vanilla gta lol. Kinda sad when people can use your servers against you and make private rooms and you can&amp;#39;t do anything about it. Must be some shitty netcode. So no I don&amp;#39;t think they can stop it. &lt;/p&gt;\n\n&lt;p&gt;I have also been hearing reports of Modders finding a way to mod the house/apartment/mechanic bills that come in regularly to charge all players in a session 100&amp;#39;s of millions of dollars to completely wipe people&amp;#39;s banks. Not sure if this is true and if Rockstar is giving it back if so but I remember things with negative amount bounties happening back on ps3 so it could be possible. Kinda scared to play in pub lobbies now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GTAV", "name": "t1_dgcsx2i", "score_hidden": false, "stickied": false, "created": 1492416588.0, "created_utc": 1492387788.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]