[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AntiJokes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It was a particularly stormy day.  &lt;/p&gt;\n\n&lt;p&gt;He starts the car and backs out of the driveway forgetting to buckle his seat-belt; an odd action seeing that it&amp;#39;s always second nature for him.  &lt;/p&gt;\n\n&lt;p&gt;While halfway down the street he starts fumbling with the radio attempting to find a suitable station to match the weather outside and his mood: frustration that he had to abandon his WoW Guild&amp;#39;s raid of the Hellfire Citadel and lack of comfort due to the steamy rain-soaked attire he acquired while running from the front door to the car.  &lt;/p&gt;\n\n&lt;p&gt;He pauses his search when he comes across Classic 95.5 that happens to be playing the hit 80s song &lt;em&gt;Africa&lt;/em&gt; by Toto. &lt;/p&gt;\n\n&lt;p&gt;He attempts to sing along but the warm breath that exits his mouth starts to fog his glasses. He temporarily lacks the ability to see while he slows his vehicle down in an attempt to multitask the handling of his 2 ton vehicle in hazardous conditions and clearing of the condensation of his glasses using his slippery shirt.   &lt;/p&gt;\n\n&lt;p&gt;By the time he sees the car break lights in front of him it&amp;#39;s too late to come to a safe and complete stop. His computer-centered mind quickly assesses his options within milliseconds as he swerves into the right shoulder, losing control of the vehicle, and begins to spiral in the grassy space between the highway and access road.  &lt;/p&gt;\n\n&lt;p&gt;What seems like eternity lasts just four seconds. He comes to a stop unsure of his mortality.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Is this the end?&amp;quot; he murmurs as he pinches his left arm with his right index finger and thumb.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Thank God&amp;quot; he says as he makes a deep exhale knowing that he wasn&amp;#39;t particularly religious but thankful to be alive.  &lt;/p&gt;\n\n&lt;p&gt;After a brief exchange with the selfless drivers that came to his aide after witnessing the events and declination of medical services he decides to finish the mission he set forth on just 15 minutes prior.  &lt;/p&gt;\n\n&lt;p&gt;He buckles up, puts both hands on the wheel, turns up the A/C to dry the air, turns the radio off, and heads towards the supermarket.  &lt;/p&gt;\n\n&lt;p&gt;On top of the groceries he buys, he picks up a bouquet of flowers,  a box of chocolate, and a vintage 2012 chardonnay. He didn&amp;#39;t inform his wife of the incident over-the-phone fearing she may attempt to come to his aide and thus potentially putting herself in the same precarious situation.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Long day?&amp;quot; the cashier asks noticing his disheveled look.  &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You have no idea...&amp;quot; he exclaims as he recounts the tale of the events leading up to this moment.  &lt;/p&gt;\n\n&lt;p&gt;Just as he finishes his story and exchanges a smile with the first person that gratefully listened to his experience - a man wearing all black, including a balaclava over his head, storms into the super market brandishing a Colt .45 revolver and fires at the woman behind the programmer.  &lt;/p&gt;\n\n&lt;p&gt;The assailant&amp;#39;s aim was off as he was shaken from the information he received moments ago from the private investigator he hired that confirmed his suspensions of his wife&amp;#39;s infidelity. The bullet&amp;#39;s mark was a tad left, striking the programmer in the neck. &lt;/p&gt;\n\n&lt;p&gt;As he was bleeding out the assailant realized the insanity in his motivations. He turned the gun on himself. &lt;/p&gt;\n\n&lt;p&gt;By the time the programmer&amp;#39;s wife arrived a white sheet was draped over her beloved. &lt;/p&gt;\n\n&lt;p&gt;On the 3 month mark of her deceased husband&amp;#39;s death the doorbell rang. It was the cashier.  &lt;/p&gt;\n\n&lt;p&gt;Over a hot cup of tea the cashier repeated the story the programmer had told her. Before she could finish the programmer&amp;#39;s estranged wife was sobbing into her left shoulder. The cashier took her right arm and wrapped it around the wife and whispered &amp;quot;I wish there was more I could have done.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It was a particularly stormy day.  \n\nHe starts the car and backs out of the driveway forgetting to buckle his seat-belt; an odd action seeing that it's always second nature for him.  \n\nWhile halfway down the street he starts fumbling with the radio attempting to find a suitable station to match the weather outside and his mood: frustration that he had to abandon his WoW Guild's raid of the Hellfire Citadel and lack of comfort due to the steamy rain-soaked attire he acquired while running from the front door to the car.  \n\nHe pauses his search when he comes across Classic 95.5 that happens to be playing the hit 80s song *Africa* by Toto. \n\nHe attempts to sing along but the warm breath that exits his mouth starts to fog his glasses. He temporarily lacks the ability to see while he slows his vehicle down in an attempt to multitask the handling of his 2 ton vehicle in hazardous conditions and clearing of the condensation of his glasses using his slippery shirt.   \n\nBy the time he sees the car break lights in front of him it's too late to come to a safe and complete stop. His computer-centered mind quickly assesses his options within milliseconds as he swerves into the right shoulder, losing control of the vehicle, and begins to spiral in the grassy space between the highway and access road.  \n\nWhat seems like eternity lasts just four seconds. He comes to a stop unsure of his mortality.  \n\n\"Is this the end?\" he murmurs as he pinches his left arm with his right index finger and thumb.  \n\n\"Thank God\" he says as he makes a deep exhale knowing that he wasn't particularly religious but thankful to be alive.  \n\nAfter a brief exchange with the selfless drivers that came to his aide after witnessing the events and declination of medical services he decides to finish the mission he set forth on just 15 minutes prior.  \n\nHe buckles up, puts both hands on the wheel, turns up the A/C to dry the air, turns the radio off, and heads towards the supermarket.  \n\nOn top of the groceries he buys, he picks up a bouquet of flowers,  a box of chocolate, and a vintage 2012 chardonnay. He didn't inform his wife of the incident over-the-phone fearing she may attempt to come to his aide and thus potentially putting herself in the same precarious situation.  \n\n\"Long day?\" the cashier asks noticing his disheveled look.  \n\n\"You have no idea...\" he exclaims as he recounts the tale of the events leading up to this moment.  \n\nJust as he finishes his story and exchanges a smile with the first person that gratefully listened to his experience - a man wearing all black, including a balaclava over his head, storms into the super market brandishing a Colt .45 revolver and fires at the woman behind the programmer.  \n\nThe assailant's aim was off as he was shaken from the information he received moments ago from the private investigator he hired that confirmed his suspensions of his wife's infidelity. The bullet's mark was a tad left, striking the programmer in the neck. \n\nAs he was bleeding out the assailant realized the insanity in his motivations. He turned the gun on himself. \n\nBy the time the programmer's wife arrived a white sheet was draped over her beloved. \n\nOn the 3 month mark of her deceased husband's death the doorbell rang. It was the cashier.  \n\nOver a hot cup of tea the cashier repeated the story the programmer had told her. Before she could finish the programmer's estranged wife was sobbing into her left shoulder. The cashier took her right arm and wrapped it around the wife and whispered \"I wish there was more I could have done.\"", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6516dk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "TheMegaBenson", "saved": false, "mod_reports": [], "name": "t3_6516dk", "subreddit_name_prefixed": "r/AntiJokes", "approved_by": null, "over_18": false, "domain": "self.AntiJokes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r37g", "edited": 1492033312.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AntiJokes/comments/6516dk/a_wife_asks_her_programmer_husband_to_go_to_the/", "num_reports": null, "locked": false, "stickied": false, "created": 1492061581.0, "url": "https://www.reddit.com/r/AntiJokes/comments/6516dk/a_wife_asks_her_programmer_husband_to_go_to_the/", "author_flair_text": null, "quarantine": false, "title": "A wife asks her programmer husband to go to the store...", "created_utc": 1492032781.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]