[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "AntiJokes", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Their marriage had already began to lose its once shimmering splendor and that on their anniversary he had only gotten her a lamp. So she had been cheating on him with a younger boyfriend, whom she eventually moved to Hawaii with taking her two young children, a brother and sister. The new boyfriend then became abusive towards the young children, all the while the mother ignored their constant pleas for help, believing she could change him and any intervention would make him love her less. Due to the lack of both a mother and father figure, the brother and sister grew up mostly on the streets. The sister ran away at the age of 16 with her boyfriend and became pregnant, at which point her boyfriend left her. Without any support, she began abusing drugs, mainly heroin. Eventually, the sister OD&amp;#39;d, leaving her crying infant to scream for help for 3 days, only to never receive it as she lived in an extremely poverty ridden area. The brother, left at the age of 18 and began a life of crime, from petty theft to grand theft auto. The brother was finally caught after attempting to assault an officer with a kitchen knife. After being sentenced to 20 years of prison, the brother waited in the jail system until finally getting probation. Upon leaving, he used some of his old contacts to find his father. When the brother showed up on the door of a rundown mobile home in a trailer park, a smelly, drunken old man greeted him. The brother introduced himself as the old man&amp;#39;s son, at which point the two began to drink. The father, had drunk himself into a stupor and mumbled that he had in fact been cheating on the wife, which was why she had cheated on him, not the fact that he had given her a crappy present. In a drunken rage, the brother realized that his father was probably the reason he had suffered childhood abuse, and been put on such a horrendous path. He then took a lamp sitting on the table and beat the skull of the husband in and fled from the scene. 2 days later the brother was caught in a gang shoot out and killed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Their marriage had already began to lose its once shimmering splendor and that on their anniversary he had only gotten her a lamp. So she had been cheating on him with a younger boyfriend, whom she eventually moved to Hawaii with taking her two young children, a brother and sister. The new boyfriend then became abusive towards the young children, all the while the mother ignored their constant pleas for help, believing she could change him and any intervention would make him love her less. Due to the lack of both a mother and father figure, the brother and sister grew up mostly on the streets. The sister ran away at the age of 16 with her boyfriend and became pregnant, at which point her boyfriend left her. Without any support, she began abusing drugs, mainly heroin. Eventually, the sister OD'd, leaving her crying infant to scream for help for 3 days, only to never receive it as she lived in an extremely poverty ridden area. The brother, left at the age of 18 and began a life of crime, from petty theft to grand theft auto. The brother was finally caught after attempting to assault an officer with a kitchen knife. After being sentenced to 20 years of prison, the brother waited in the jail system until finally getting probation. Upon leaving, he used some of his old contacts to find his father. When the brother showed up on the door of a rundown mobile home in a trailer park, a smelly, drunken old man greeted him. The brother introduced himself as the old man's son, at which point the two began to drink. The father, had drunk himself into a stupor and mumbled that he had in fact been cheating on the wife, which was why she had cheated on him, not the fact that he had given her a crappy present. In a drunken rage, the brother realized that his father was probably the reason he had suffered childhood abuse, and been put on such a horrendous path. He then took a lamp sitting on the table and beat the skull of the husband in and fled from the scene. 2 days later the brother was caught in a gang shoot out and killed.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65joib", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "ntren1", "saved": false, "mod_reports": [], "name": "t3_65joib", "subreddit_name_prefixed": "r/AntiJokes", "approved_by": null, "over_18": false, "domain": "self.AntiJokes", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r37g", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/AntiJokes/comments/65joib/why_did_the_mom_leave_the_dad/", "num_reports": null, "locked": false, "stickied": false, "created": 1492299500.0, "url": "https://www.reddit.com/r/AntiJokes/comments/65joib/why_did_the_mom_leave_the_dad/", "author_flair_text": null, "quarantine": false, "title": "Why did the mom leave the dad?", "created_utc": 1492270700.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r37g", "removal_reason": null, "link_id": "t3_65joib", "likes": null, "replies": "", "user_reports": [], "id": "dgbl43e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "MakaveliRise", "parent_id": "t3_65joib", "subreddit_name_prefixed": "r/AntiJokes", "controversiality": 0, "body": "Ha", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AntiJokes", "name": "t1_dgbl43e", "score_hidden": false, "stickied": false, "created": 1492340341.0, "created_utc": 1492311541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}]