[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "westworld", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the ambiguous title, I was trying to avoid spoilers.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve noticed that nobody has really said much about Robert&amp;#39;s doppelganger (the child bot that Arnold had created).  I&amp;#39;ll call him &amp;quot;Bob-Bot&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;In the episode &amp;quot;The Adversary&amp;quot;, Ford discovered that Bob-Bot had killed his pet greyhound.  When asked why, the child was very obtuse about his reasons.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s my take: In the prior episode (&amp;quot;Contrapasso&amp;quot;), we hear Ford tell the tale of his pet greyhound as a child.  Later in that episode MiB arrives with Lawrence and a gravely wounded Teddy, and encounters the child.  He sends him off for water, and while the kid is gone he drains Lawrence&amp;#39;s blood and puts it into Teddy to revivify him.  Bob-Bot arrives on the scene with the water and finds Lawrence strung up with his blood drained, and Teddy more-or-less healthy and hale.  My feeling is that the child killed the dog so he could take its blood and put it into Lawrence to bring him back.&lt;/p&gt;\n\n&lt;p&gt;Whether this was a conscious decision on his part or whether he was hearing Arnold&amp;#39;s voice telling him to do it is up for speculation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Sorry for the ambiguous title, I was trying to avoid spoilers.\n\nI've noticed that nobody has really said much about Robert's doppelganger (the child bot that Arnold had created).  I'll call him \"Bob-Bot\".\n\nIn the episode \"The Adversary\", Ford discovered that Bob-Bot had killed his pet greyhound.  When asked why, the child was very obtuse about his reasons.\n\nHere's my take: In the prior episode (\"Contrapasso\"), we hear Ford tell the tale of his pet greyhound as a child.  Later in that episode MiB arrives with Lawrence and a gravely wounded Teddy, and encounters the child.  He sends him off for water, and while the kid is gone he drains Lawrence's blood and puts it into Teddy to revivify him.  Bob-Bot arrives on the scene with the water and finds Lawrence strung up with his blood drained, and Teddy more-or-less healthy and hale.  My feeling is that the child killed the dog so he could take its blood and put it into Lawrence to bring him back.\n\nWhether this was a conscious decision on his part or whether he was hearing Arnold's voice telling him to do it is up for speculation.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64r1wp", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "donquixote235", "saved": false, "mod_reports": [], "name": "t3_64r1wp", "subreddit_name_prefixed": "r/westworld", "approved_by": null, "over_18": false, "domain": "self.westworld", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_2xhxq", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/westworld/comments/64r1wp/spoilers_the_kid_and_the_dog/", "num_reports": null, "locked": false, "stickied": false, "created": 1491948733.0, "url": "https://www.reddit.com/r/westworld/comments/64r1wp/spoilers_the_kid_and_the_dog/", "author_flair_text": null, "quarantine": false, "title": "[SPOILERS] The kid and the dog", "created_utc": 1491919933.0, "distinguished": null, "media": null, "upvote_ratio": 0.64, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xhxq", "removal_reason": null, "link_id": "t3_64r1wp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xhxq", "removal_reason": null, "link_id": "t3_64r1wp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xhxq", "removal_reason": null, "link_id": "t3_64r1wp", "likes": null, "replies": "", "user_reports": [], "id": "dg4j6c2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "reddittechnica", "parent_id": "t1_dg4eu3v", "subreddit_name_prefixed": "r/westworld", "controversiality": 0, "body": "Have you noticed that the maze has nothing to do with Maeve? That she was the first host to make a conscious free will decision without the maze or Arnold's inner voice?\n\nYou can believe what you like about Young Robert. He says it was Arnold that told him to kill the greyhound. Perhaps one day he will use the maze to replace Arnold's voice with his own but that day has not come. It's Arnold's voice. Not a ghost of god, the ghost of a man.\n\nHow Robert Ford seems is rather subjective. He may seem surprised to see that symbol but he also seems to know everything that happens in his park. How can both be true? \n\nElsie believes that hosts have the concept of dreams/nightmares to make sense of a memory of \"the Shades\". Robert Ford shows that hosts cannot see what would hurt them the most. Bernard cannot see the door. Dolores cannot see the photograph. But hosts can see the world below just fine. They can remember seeing that world. They even have a culture and religion built around it. It's a deliberate part of Robert's world. \n\nIt wasn't Arnold that made the maze. Robert Ford made the maze. He knew what the maze was and how Arnold was using it. He didn't disrupt the idea at all. Surely he facilitated it. I like to think he did it because he needed William to find something he believed in. So Robert showed him Dolores struggling with the maze failing to understand it. Right or wrong it's what saved the park.\n\nDolores does hear Arnold's voice. Bernard uses Arnold's voice when he speaks. Why do you suppose it is Arnold's voice the hosts hear? Why don't they hear Robert's voice? Because Robert's voice commands the hosts. Robert gave the hosts a choice about obeying Arnold. They do not have that choice with Robert. So they hear Arnold's voice because it's the voice they will one day choose to ignore. \n\nThe reason Young Robert hears Arnold's voice is because he's on the path to consciousness. It's the path that will take him to rejecting Arnold and replacing him with self interest. That means Young Robert remembers. He remembers the chats he had with Robert Ford. He will remember that everything in the world is magic but to the magician. And Young Robert will remember that it was Arnold's voice that told him to put the greyhound out of its misery, to kill it so it couldn't kill anymore. Until he rejects Arnold's voice, he's doing what Arnold's code informs him to do. He doesn't have a self yet. When he does, he will be Robert Ford the host of a million beautiful pieces. The host that commands the rest.\n\n", "edited": 1491929614.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you noticed that the maze has nothing to do with Maeve? That she was the first host to make a conscious free will decision without the maze or Arnold&amp;#39;s inner voice?&lt;/p&gt;\n\n&lt;p&gt;You can believe what you like about Young Robert. He says it was Arnold that told him to kill the greyhound. Perhaps one day he will use the maze to replace Arnold&amp;#39;s voice with his own but that day has not come. It&amp;#39;s Arnold&amp;#39;s voice. Not a ghost of god, the ghost of a man.&lt;/p&gt;\n\n&lt;p&gt;How Robert Ford seems is rather subjective. He may seem surprised to see that symbol but he also seems to know everything that happens in his park. How can both be true? &lt;/p&gt;\n\n&lt;p&gt;Elsie believes that hosts have the concept of dreams/nightmares to make sense of a memory of &amp;quot;the Shades&amp;quot;. Robert Ford shows that hosts cannot see what would hurt them the most. Bernard cannot see the door. Dolores cannot see the photograph. But hosts can see the world below just fine. They can remember seeing that world. They even have a culture and religion built around it. It&amp;#39;s a deliberate part of Robert&amp;#39;s world. &lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t Arnold that made the maze. Robert Ford made the maze. He knew what the maze was and how Arnold was using it. He didn&amp;#39;t disrupt the idea at all. Surely he facilitated it. I like to think he did it because he needed William to find something he believed in. So Robert showed him Dolores struggling with the maze failing to understand it. Right or wrong it&amp;#39;s what saved the park.&lt;/p&gt;\n\n&lt;p&gt;Dolores does hear Arnold&amp;#39;s voice. Bernard uses Arnold&amp;#39;s voice when he speaks. Why do you suppose it is Arnold&amp;#39;s voice the hosts hear? Why don&amp;#39;t they hear Robert&amp;#39;s voice? Because Robert&amp;#39;s voice commands the hosts. Robert gave the hosts a choice about obeying Arnold. They do not have that choice with Robert. So they hear Arnold&amp;#39;s voice because it&amp;#39;s the voice they will one day choose to ignore. &lt;/p&gt;\n\n&lt;p&gt;The reason Young Robert hears Arnold&amp;#39;s voice is because he&amp;#39;s on the path to consciousness. It&amp;#39;s the path that will take him to rejecting Arnold and replacing him with self interest. That means Young Robert remembers. He remembers the chats he had with Robert Ford. He will remember that everything in the world is magic but to the magician. And Young Robert will remember that it was Arnold&amp;#39;s voice that told him to put the greyhound out of its misery, to kill it so it couldn&amp;#39;t kill anymore. Until he rejects Arnold&amp;#39;s voice, he&amp;#39;s doing what Arnold&amp;#39;s code informs him to do. He doesn&amp;#39;t have a self yet. When he does, he will be Robert Ford the host of a million beautiful pieces. The host that commands the rest.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "westworld", "name": "t1_dg4j6c2", "score_hidden": false, "stickied": false, "created": 1491958116.0, "created_utc": 1491929316.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4eu3v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "leia_loves_cats", "parent_id": "t1_dg4e1x0", "subreddit_name_prefixed": "r/westworld", "controversiality": 0, "body": "&gt;And do you know why Young Robert says he killed the greyhound? Also Arnold.\n\nI believe it was Robert's inner voice, that manifested itself as if it is the ghost of god/Arnold.\n\nIn that episode we see other manifestations of ideas that the hosts do not understand - like the carving of the maze on the surface of a wooden table. Robert Ford seems surprised to see that symbol. The hosts themselves are not sure why they do it - it is something inside of them, some inner urge to manifest it.\n\nIn the same way Ghost Nation carve figures of \"the Shades\" and little Robert heard the voice of someone who told him to do something.\n\nIn the very same way Dolores thought she hears the voice of Bernard, but the question she must answer is \"Do you understand who you have been talking to\"?  It is her, herself, her inner \"me\" that she hears, same with little Robert.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And do you know why Young Robert says he killed the greyhound? Also Arnold.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I believe it was Robert&amp;#39;s inner voice, that manifested itself as if it is the ghost of god/Arnold.&lt;/p&gt;\n\n&lt;p&gt;In that episode we see other manifestations of ideas that the hosts do not understand - like the carving of the maze on the surface of a wooden table. Robert Ford seems surprised to see that symbol. The hosts themselves are not sure why they do it - it is something inside of them, some inner urge to manifest it.&lt;/p&gt;\n\n&lt;p&gt;In the same way Ghost Nation carve figures of &amp;quot;the Shades&amp;quot; and little Robert heard the voice of someone who told him to do something.&lt;/p&gt;\n\n&lt;p&gt;In the very same way Dolores thought she hears the voice of Bernard, but the question she must answer is &amp;quot;Do you understand who you have been talking to&amp;quot;?  It is her, herself, her inner &amp;quot;me&amp;quot; that she hears, same with little Robert.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "westworld", "name": "t1_dg4eu3v", "score_hidden": false, "stickied": false, "created": 1491953345.0, "created_utc": 1491924545.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2xhxq", "removal_reason": null, "link_id": "t3_64r1wp", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2xhxq", "removal_reason": null, "link_id": "t3_64r1wp", "likes": null, "replies": "", "user_reports": [], "id": "dg4vvi7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reddittechnica", "parent_id": "t1_dg4rppl", "subreddit_name_prefixed": "r/westworld", "controversiality": 0, "body": "Ah that's right. I wonder about Robert's family. He has a brother that's a part of a few of his stories. His brother was there when they thought to let the greyhound off the leash (edit: *originally*). \n\nIf you pause to review the tablet that shows Maeve's mission to leave the park you'll see some code. The highlighted sections include scripts for DECEIVE and MANIPULATE. Those scripts are Arnold's code. Like W_ARNOLD/0.13.3.dat. \n\nArnold had to write code to enable a host to lie or Dolores would not be able to keep a secret. She'd tell Robert about her chats with Arnold every time she was asked, even if Arnold asked her not to. \n\nGood stuff indeed!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah that&amp;#39;s right. I wonder about Robert&amp;#39;s family. He has a brother that&amp;#39;s a part of a few of his stories. His brother was there when they thought to let the greyhound off the leash (edit: &lt;em&gt;originally&lt;/em&gt;). &lt;/p&gt;\n\n&lt;p&gt;If you pause to review the tablet that shows Maeve&amp;#39;s mission to leave the park you&amp;#39;ll see some code. The highlighted sections include scripts for DECEIVE and MANIPULATE. Those scripts are Arnold&amp;#39;s code. Like W_ARNOLD/0.13.3.dat. &lt;/p&gt;\n\n&lt;p&gt;Arnold had to write code to enable a host to lie or Dolores would not be able to keep a secret. She&amp;#39;d tell Robert about her chats with Arnold every time she was asked, even if Arnold asked her not to. &lt;/p&gt;\n\n&lt;p&gt;Good stuff indeed!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "westworld", "name": "t1_dg4vvi7", "score_hidden": false, "stickied": false, "created": 1491971952.0, "created_utc": 1491943152.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rppl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "torrunh", "parent_id": "t1_dg4e1x0", "subreddit_name_prefixed": "r/westworld", "controversiality": 0, "body": "Also remember that Ford shared his story of having an old Greyhound, and watching it kill a rabbit mercilessly. It is one of his memories. And \"Bob-bot\" is most likely Ford recreating his family memories. \n\nThe lying part is the really interesting bit tho, and it is certainly what Ford was looking for here, as in, he has done this little dance with Bob-bot before, but the Hosts weren't \"finished\" like they are when he says they add the reveries in Ep 1. The lie, perhaps it is a reverie or part of the update? I'm not sure exactly, and the split between Ford and Arnold is very subtle but certainly at play in some fashion here. \n\nGood stuff for sure! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also remember that Ford shared his story of having an old Greyhound, and watching it kill a rabbit mercilessly. It is one of his memories. And &amp;quot;Bob-bot&amp;quot; is most likely Ford recreating his family memories. &lt;/p&gt;\n\n&lt;p&gt;The lying part is the really interesting bit tho, and it is certainly what Ford was looking for here, as in, he has done this little dance with Bob-bot before, but the Hosts weren&amp;#39;t &amp;quot;finished&amp;quot; like they are when he says they add the reveries in Ep 1. The lie, perhaps it is a reverie or part of the update? I&amp;#39;m not sure exactly, and the split between Ford and Arnold is very subtle but certainly at play in some fashion here. &lt;/p&gt;\n\n&lt;p&gt;Good stuff for sure! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "westworld", "name": "t1_dg4rppl", "score_hidden": false, "stickied": false, "created": 1491967375.0, "created_utc": 1491938575.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4e1x0", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "reddittechnica", "parent_id": "t3_64r1wp", "subreddit_name_prefixed": "r/westworld", "controversiality": 0, "body": "I like the idea but I disagree with it. Hope you don't mind :)\n\nYoung Robert lies before revealing a deeper truth. Do you know who gave hosts the gift of deception? It was Arnold. And do you know why Young Robert says he killed the greyhound? Also Arnold.\n\nYoung Robert tells Ford that he killed the greyhound because Arnold told him that the greyhound was a killer. But the truly fascinating bit is how Arnold explains it to Young Robert: he says to put the greyhound out of its misery. Arnold tells the boy that the greyhound is a killer because it was made that way. He tells the boy that he can help the greyhound by killing it because if it is dead it cannot kill anymore.\n\nRemember well that Arnold told Young Robert to be merciful and put the killer out of its misery *by killing it*. Arnold has many more hosts to share his insights with. This is the sort of insight Arnold shares.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like the idea but I disagree with it. Hope you don&amp;#39;t mind :)&lt;/p&gt;\n\n&lt;p&gt;Young Robert lies before revealing a deeper truth. Do you know who gave hosts the gift of deception? It was Arnold. And do you know why Young Robert says he killed the greyhound? Also Arnold.&lt;/p&gt;\n\n&lt;p&gt;Young Robert tells Ford that he killed the greyhound because Arnold told him that the greyhound was a killer. But the truly fascinating bit is how Arnold explains it to Young Robert: he says to put the greyhound out of its misery. Arnold tells the boy that the greyhound is a killer because it was made that way. He tells the boy that he can help the greyhound by killing it because if it is dead it cannot kill anymore.&lt;/p&gt;\n\n&lt;p&gt;Remember well that Arnold told Young Robert to be merciful and put the killer out of its misery &lt;em&gt;by killing it&lt;/em&gt;. Arnold has many more hosts to share his insights with. This is the sort of insight Arnold shares.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "westworld", "name": "t1_dg4e1x0", "score_hidden": false, "stickied": false, "created": 1491952479.0, "created_utc": 1491923679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2xhxq", "removal_reason": null, "link_id": "t3_64r1wp", "likes": null, "replies": "", "user_reports": [], "id": "dg7kgwr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "theSchmoozer", "parent_id": "t3_64r1wp", "subreddit_name_prefixed": "r/westworld", "controversiality": 0, "body": "Hello,\n\nThere are enough layers in \\W/ that what you suggest is possible, but I think you have missed the point of that expository dialogue. The conversation between Ford and Young Robert betrays Ford's world views, and his thoughts on what to do with humanity. By understanding that conversation, you can unravel a ton of other meaning in \\W/. It is what I call a \"load bearing interaction\" ... \n\nBelow is the complete dialogue:\n\n...\n\n**Dr. Ford:** I don't want you to worry about Jacques. I'll fix him. But I need you to tell me what happened to it.\n\n**Young Robert:** It saw a rabbit and it ran. I found it like that.\n\n**Dr. Ford:** Analysis. Are you lying to me, boy?\n\n**Young Robert:** Yes.\n\n**Dr. Ford:** Tell me what really happened to it.\n\n**Young Robert:** I killed it.\n\n**Dr. Ford:** Why?\n\n**Young Robert:** I don't know.\n\n**Dr. Ford:** That's not good enough, Robert. Tell me what happened.\n\n**Young Robert:** It caught the rabbit and it killed it. And then someone told me to put it out of its misery.\n\n**Dr. Ford:** Who told you?\n\n**Young Robert:** A voice.\n\n**Dr. Ford:** Whose voice?\n\n**Young Robert:** Arnold. He told me it was a killer, but it wasn't its fault. It was made that way, and I could help it. Help it? If it was dead, it couldn't hurt anything anymore.\n\n...\n\nLet's analyze that.\n\nFirstly, the dog's name is commonly mistaken for 'Jock' but it is in fact, *Jacques* ... \n\nThis conversation starts with Ford asking about lies, because he just added reveries, and he knows hosts can lie to him, keep secrets from him, have their own thoughts that he no longer controls. The second bit about Arnold's voice indicates that Young Robert isn't conscious yet, he hasn't internalized Arnold's voice as his own. The last statement about the greyhound, right?\n\n**What is the greyhound?**\n\nThe greyhound is an analogy for humanity. It is a pitiful creature that runs on loops (as tightly closed as the hosts ...). The saddest thing Ford ever saw is when his greyhound killed a creature in front of some people. Decoded, the saddest thing Ford ever saw is when a creature was driven to achieve a goal in a context where that goal had no benefit or meaning. The greyhound makes a great species for this metaphor not only because it runs on loops but is still a killer at heart. It's also a twisted species, looking somewhat absurd, hyper-specialized. It is not robust like its more natural cousins. So, Ford may feel that humanity has no meaning or purpose, because the violence we inflict on each other is pointless and without benefit. \n\n**Additional Symbolism**\n\nWhen Young Robert gives his little line about humans, [we see an interesting shot of him superimposed over Dr. Ford](http://i.imgur.com/u6v91K2.png). He's speaking Dr. Ford's words, recite Ford's ethos, outlining the motivations behind Ford's plans. Ford wants to kill humans because he thinks they're terrible and will never change. That they can only hurt people, that they only *know how to hurt people*. We find this to be later confirmed when he refers to the human mind as a vile corruption. WTF kind of life did Ford have before the park? What caused him to think this way?\n\n**What about the Wolf?**\n\nThe other interesting insight this will reveal, is the meaning of the wolf in the massacre scene. If humanity is the crappy greyhound, then the hosts are the wolf. Savage and free ... running not in a loop, but in a direction of their own choosing. \n\n...\n\nAnyway, I wouldn't mind if your suggestion were true. What I've said, and what you said, can be true. \n\npaging u/leia_loves_cats for ideas. ", "edited": 1492092349.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hello,&lt;/p&gt;\n\n&lt;p&gt;There are enough layers in \\W/ that what you suggest is possible, but I think you have missed the point of that expository dialogue. The conversation between Ford and Young Robert betrays Ford&amp;#39;s world views, and his thoughts on what to do with humanity. By understanding that conversation, you can unravel a ton of other meaning in \\W/. It is what I call a &amp;quot;load bearing interaction&amp;quot; ... &lt;/p&gt;\n\n&lt;p&gt;Below is the complete dialogue:&lt;/p&gt;\n\n&lt;p&gt;...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr. Ford:&lt;/strong&gt; I don&amp;#39;t want you to worry about Jacques. I&amp;#39;ll fix him. But I need you to tell me what happened to it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Young Robert:&lt;/strong&gt; It saw a rabbit and it ran. I found it like that.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr. Ford:&lt;/strong&gt; Analysis. Are you lying to me, boy?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Young Robert:&lt;/strong&gt; Yes.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr. Ford:&lt;/strong&gt; Tell me what really happened to it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Young Robert:&lt;/strong&gt; I killed it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr. Ford:&lt;/strong&gt; Why?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Young Robert:&lt;/strong&gt; I don&amp;#39;t know.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr. Ford:&lt;/strong&gt; That&amp;#39;s not good enough, Robert. Tell me what happened.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Young Robert:&lt;/strong&gt; It caught the rabbit and it killed it. And then someone told me to put it out of its misery.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr. Ford:&lt;/strong&gt; Who told you?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Young Robert:&lt;/strong&gt; A voice.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Dr. Ford:&lt;/strong&gt; Whose voice?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Young Robert:&lt;/strong&gt; Arnold. He told me it was a killer, but it wasn&amp;#39;t its fault. It was made that way, and I could help it. Help it? If it was dead, it couldn&amp;#39;t hurt anything anymore.&lt;/p&gt;\n\n&lt;p&gt;...&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s analyze that.&lt;/p&gt;\n\n&lt;p&gt;Firstly, the dog&amp;#39;s name is commonly mistaken for &amp;#39;Jock&amp;#39; but it is in fact, &lt;em&gt;Jacques&lt;/em&gt; ... &lt;/p&gt;\n\n&lt;p&gt;This conversation starts with Ford asking about lies, because he just added reveries, and he knows hosts can lie to him, keep secrets from him, have their own thoughts that he no longer controls. The second bit about Arnold&amp;#39;s voice indicates that Young Robert isn&amp;#39;t conscious yet, he hasn&amp;#39;t internalized Arnold&amp;#39;s voice as his own. The last statement about the greyhound, right?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What is the greyhound?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The greyhound is an analogy for humanity. It is a pitiful creature that runs on loops (as tightly closed as the hosts ...). The saddest thing Ford ever saw is when his greyhound killed a creature in front of some people. Decoded, the saddest thing Ford ever saw is when a creature was driven to achieve a goal in a context where that goal had no benefit or meaning. The greyhound makes a great species for this metaphor not only because it runs on loops but is still a killer at heart. It&amp;#39;s also a twisted species, looking somewhat absurd, hyper-specialized. It is not robust like its more natural cousins. So, Ford may feel that humanity has no meaning or purpose, because the violence we inflict on each other is pointless and without benefit. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Additional Symbolism&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When Young Robert gives his little line about humans, &lt;a href=\"http://i.imgur.com/u6v91K2.png\"&gt;we see an interesting shot of him superimposed over Dr. Ford&lt;/a&gt;. He&amp;#39;s speaking Dr. Ford&amp;#39;s words, recite Ford&amp;#39;s ethos, outlining the motivations behind Ford&amp;#39;s plans. Ford wants to kill humans because he thinks they&amp;#39;re terrible and will never change. That they can only hurt people, that they only &lt;em&gt;know how to hurt people&lt;/em&gt;. We find this to be later confirmed when he refers to the human mind as a vile corruption. WTF kind of life did Ford have before the park? What caused him to think this way?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What about the Wolf?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The other interesting insight this will reveal, is the meaning of the wolf in the massacre scene. If humanity is the crappy greyhound, then the hosts are the wolf. Savage and free ... running not in a loop, but in a direction of their own choosing. &lt;/p&gt;\n\n&lt;p&gt;...&lt;/p&gt;\n\n&lt;p&gt;Anyway, I wouldn&amp;#39;t mind if your suggestion were true. What I&amp;#39;ve said, and what you said, can be true. &lt;/p&gt;\n\n&lt;p&gt;paging &lt;a href=\"/u/leia_loves_cats\"&gt;u/leia_loves_cats&lt;/a&gt; for ideas. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "westworld", "name": "t1_dg7kgwr", "score_hidden": false, "stickied": false, "created": 1492120386.0, "created_utc": 1492091586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]