[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {"content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/_dmPchuXIXQ?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 459, "scrolling": false, "height": 344}, "subreddit": "conspiracy", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Zeitgeist - The Movie: Federal Reserve (Part 1 of 5)", "thumbnail_width": 480, "height": 344, "width": 459, "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/_dmPchuXIXQ?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "NullClothing", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/_dmPchuXIXQ/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/user/NullClothing"}, "type": "youtube.com"}, "link_flair_text": null, "id": "65on9c", "gilded": 0, "secure_media_embed": {"content": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/_dmPchuXIXQ?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "width": 459, "scrolling": false, "height": 344}, "clicked": false, "score": 299, "report_reasons": null, "author": "mountaingoat7", "saved": false, "mod_reports": [], "name": "t3_65on9c", "subreddit_name_prefixed": "r/conspiracy", "approved_by": null, "over_18": false, "domain": "youtube.com", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/82LWuR5mJsDBsISXNdLBRV-fxxbG-hJWB6AYG2PCRWw.jpg?s=9aef681d3dd766db55b6c7fc8c25d9e4", "width": 480, "height": 360}, "resolutions": [{"url": "https://i.redditmedia.com/82LWuR5mJsDBsISXNdLBRV-fxxbG-hJWB6AYG2PCRWw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=939a97d6132d2dcd6beb6ee4e5bfe2e0", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/82LWuR5mJsDBsISXNdLBRV-fxxbG-hJWB6AYG2PCRWw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=b9cb5db7a69b1cd0bf7b192265cb5f4b", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/82LWuR5mJsDBsISXNdLBRV-fxxbG-hJWB6AYG2PCRWw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=21f32b49d1649e968a928d29285ba12f", "width": 320, "height": 240}], "variants": {}, "id": "PFlkBN2K0saIQMtTo0OkJU1kJEZEIOGKVuGU-cL96K0"}], "enabled": false}, "thumbnail": "https://b.thumbs.redditmedia.com/IwjzV6BrxhRlixDwHkkck-qGiX_1JK-1p1tr8hQtcWw.jpg", "subreddit_id": "t5_2qh4r", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "post_hint": "rich:video", "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/conspiracy/comments/65on9c/zeitgeist_the_debt_enslaving_federal_reserve/", "num_reports": null, "locked": false, "stickied": false, "created": 1492370274.0, "url": "https://www.youtube.com/watch?v=_dmPchuXIXQ", "author_flair_text": null, "quarantine": false, "title": "Zeitgeist - the debt enslaving Federal Reserve system has reigned supreme over all citizens of the USA since 1913.", "created_utc": 1492341474.0, "distinguished": null, "media": {"oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Zeitgeist - The Movie: Federal Reserve (Part 1 of 5)", "thumbnail_width": 480, "height": 344, "width": 459, "html": "&lt;iframe width=\"459\" height=\"344\" src=\"https://www.youtube.com/embed/_dmPchuXIXQ?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "author_name": "NullClothing", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/_dmPchuXIXQ/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/user/NullClothing"}, "type": "youtube.com"}, "upvote_ratio": 0.91, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 299}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgc8923", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Prgjdsaewweoidsm", "parent_id": "t1_dgc0bi9", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "&gt;For example Banks don't actually make anything but they make money through interest, derivatives, stocks, and bonds etc. By not producing any tangible products but still creating money bankers are able to loot the planet through through the unseen hand of monetary malfeasance.\n\nThis is the main problem. Fractional reserve banking with fiat currency means only the privileged can engage in usury (earning money without working or assuming risk).\n\nYou can have fiat currency if it serves as a medium of exchange only, and its value is kept constant. But you cannot have a fiat currency that lets the powerful print money and enslave the population with usury.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;For example Banks don&amp;#39;t actually make anything but they make money through interest, derivatives, stocks, and bonds etc. By not producing any tangible products but still creating money bankers are able to loot the planet through through the unseen hand of monetary malfeasance.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is the main problem. Fractional reserve banking with fiat currency means only the privileged can engage in usury (earning money without working or assuming risk).&lt;/p&gt;\n\n&lt;p&gt;You can have fiat currency if it serves as a medium of exchange only, and its value is kept constant. But you cannot have a fiat currency that lets the powerful print money and enslave the population with usury.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgc8923", "score_hidden": false, "stickied": false, "created": 1492389175.0, "created_utc": 1492360375.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgc2921", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "boxingnun", "parent_id": "t1_dgc0bi9", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "&gt;It is just a stand in for real goods.\n\nOr to put it another way; money is only a *metric* of wealth, not the actual wealth itself. Saying there is no money to get whatever done is like saying a house can't be built for lack of inches. Society has been duped. ;)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It is just a stand in for real goods.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Or to put it another way; money is only a &lt;em&gt;metric&lt;/em&gt; of wealth, not the actual wealth itself. Saying there is no money to get whatever done is like saying a house can&amp;#39;t be built for lack of inches. Society has been duped. ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgc2921", "score_hidden": false, "stickied": false, "created": 1492380577.0, "created_utc": 1492351777.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgca2wf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CurrentRiver", "parent_id": "t1_dgc0bi9", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "Great read.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Great read.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgca2wf", "score_hidden": false, "stickied": false, "created": 1492391547.0, "created_utc": 1492362747.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc0bi9", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "timoppenheimer", "parent_id": "t3_65on9c", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "copy pasta from elsewhere\n\nThe first topic will be on the nature of money, artificial scarcity, and the Federal Reserve private banking scams. This post is a longer essay on artificial scarcity that I mentioned in brief in the Bill Still thread.\n\nThe secret to money it that it actually has no value. It is just a stand in for real goods. Problems arise when society forgets that money is just a stand in. In our society people are perversely incentivized to just to make money with out producing a tangible products. For example Banks don't actually make anything but they make money through interest, derivatives, stocks, and bonds etc. By not producing any tangible products but still creating money bankers are able to loot the planet through through the unseen hand of monetary malfeasance.\n\nLet me tell you about the meme of artificial scarcity.\n\nWe have lots of idle factories that could be producing stuff but are shut down.\n\nWe have plenty of demand for the products made in those factories but still they do not operate.\n\nWe have millions of unemployed workers who want to work in those factories but are not allowed.\n\nWe have millions of empty homes and millions of homeless people. Why is that?\n\nWe live in a time of phenomenal abundance but there is poverty everywhere.\n\nFood is left to rot in the field while people starve.\n\nReal abundance is being destroyed. WHY?\n\nBoth Capitalists and Socialists are complicit in this fraud called artificial scarcity. Look at this picture for a few minutes and take it all in.\n\n \n\nThose are not sand bags. What you are seeing is millions and millions of tonns of grain that was purposely destroyed so that meme of artificial scarcity could be maintained. Every bag represents a life ruined. Every bag represents a malnourished child that had to go to bed hungry. This is a real life holocaust.\n\nDo you really think people would work these lousy wage slave jobs if there was not the ever present threat of death by starvation hanging over people's heads. That is how the modern day slave system works. It is about controlling people either through their jobs or through government socialism. Either way you are a slave to the system. It is system that destroys the natural abundance of human production so that those at the bottom of society are held captive to the whims of the people whole rule at the top of the social pyramid. They want us all competing against each other in Hobbsian struggle for survival. The Hunger Games is an apt analogy for how the world really exists behind the scenes. If there was no hunger than there would be NO games. I don't know about you but I grow tired of these hunger games and am here to bust this system by exposing it.\n\n\nDon't you dare call me a socialist for saying such things. What I advocate is not socialism. Socialism is just another failed ideology. The socialist survives on the same meme of artificial scarcity. Those who do not do what the socialist tells them to do shall not eat and is left to starve. That is how Stalin cemented his control over the USSR. He engineered the Holodomor artificial famine and cut off the people's food supply. Those who did not swear complete allegiance to him were not fed and thus died of starvation. The socialist mind has not really changed much since then. The whole scarcity meme was artificially engineered then and it is being artificially engineered right now through socialist policies in the United States.\n\nArtificial scarcity is the biggest lie ever told. The idea that everything is scarce is a huge lie. There is no poverty. It is all fake, all lies. Poverty is manufactured via a system of debt, wage slavery, and government socialism. We live in a world of phenomenal abundance where nobody ever has to starve. Grain can flow like sand in a desert if people can learn to see through the lies. There does not have to be a hunger games style competition between the world's people if they can see the bigger picture. People do not have to fight to the death over the lie of limited resources.\n\nWhat I advocate is called a resource based economy where work creates its own intrinsic value.\n\nFactories have intrinsic value\n\nFields of grain have intrinsic value\n\nWorkers earning an honest wage have intrinsic value\n\nWhat has no intrinsic value is money, banks, and stock markets and yet these worthless things are the most highly prized in our society.\n\nThe defenders of the current limited paradigm will argue there is not enough money to pay for all the jobs, homes, and food for everyone. But they forget money is NOT the be all end all of wealth. Money is merely an abstraction that exists to facilitate trade. However, money in the modern corporate capitalist sense does NOT facilitate trade. It does the opposite, it restricts trade because it is all hoarded by a super elite group of rich people and there is no money for the average person. When the average person has no money then trade for all practical purposes grinds to a halt. This is why the factories stopped running and why food rots in the field. There is no trade so everything goes to waste.\n\nIn a resource based economy money is created that is backed by resources. In stead of letting food rot money would be created that is backed by the grain stores so it can be traded to hungry people who want to eat the food. Money in a resource based economy represents things with intrinsic value. Money exists for its original purpose to facilitate trade. That is what is needed to end the current malaise.\n\nDo you have any idea how much the Earth is worth? It is worth Quadrillions. (see link)\n\nWhat stands in the way of true progress is the banks and particularly central banks such as the Federal reserve system.\n \n\nThe Federal Reserve is not a branch of the government. The FED is a privately owned for profit bank. It is controlled by a conglomeration of Wall Street crooks and con artists from the City of London. Part of it is even owned by the Chinese communist government. It is a corporation that has allegiance to no country but lives off the backs of the people like a parasite.\n\nWe let a private bank print up and loan the people's currency at interest. It is one of the greatest scams of all time and it has been going on for 100 years. It has resulted in the complete looting of the country. The dollar has lost 99% of its value since the FED was created. Even just 35 years ago the cost of college education was just a couple hundred dollars. Children today have to take out a 30 year mortgage just to go to school. Then they enter the work place where people fight over lousy $10 /hr jobs. It is SLAVERY and you are a slave under this system. \n\n\nThe total US debt is actually $0 because this is all a con game. Put an end to the Federal Reserve and the debt simply goes away. It is all unconstitutional anyway because only the US government and NOT a private bank is allowed to issue the currency. The debt is NULL and VOID because it is unconstitutional. The debt can simply be erased by ending the FED. The plan to zero out the debt is the only moral thing to do that can country from the Kraken. This plan will never happen because our leaders or too corrupt and bribed to ever change the deal. The American government is the most corrupt regime on Earth because of what they have done here. People aught to revolt but they never will because they are too stupid to realize they even are slaves to this beast.\n\n \nIn 1964 the minimum wage was 5 silver quarters. In 2016 those 5 silver quarters have a melt value of $15.55.\n\nWe don't need to raise the minimum wage. We need to fix the money.\n\nWorkers should demand to be paid in real money, not valueless numbers in a computer. Don't accept an IOU for your wage. They are not paying you. People are being conned.------\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;copy pasta from elsewhere&lt;/p&gt;\n\n&lt;p&gt;The first topic will be on the nature of money, artificial scarcity, and the Federal Reserve private banking scams. This post is a longer essay on artificial scarcity that I mentioned in brief in the Bill Still thread.&lt;/p&gt;\n\n&lt;p&gt;The secret to money it that it actually has no value. It is just a stand in for real goods. Problems arise when society forgets that money is just a stand in. In our society people are perversely incentivized to just to make money with out producing a tangible products. For example Banks don&amp;#39;t actually make anything but they make money through interest, derivatives, stocks, and bonds etc. By not producing any tangible products but still creating money bankers are able to loot the planet through through the unseen hand of monetary malfeasance.&lt;/p&gt;\n\n&lt;p&gt;Let me tell you about the meme of artificial scarcity.&lt;/p&gt;\n\n&lt;p&gt;We have lots of idle factories that could be producing stuff but are shut down.&lt;/p&gt;\n\n&lt;p&gt;We have plenty of demand for the products made in those factories but still they do not operate.&lt;/p&gt;\n\n&lt;p&gt;We have millions of unemployed workers who want to work in those factories but are not allowed.&lt;/p&gt;\n\n&lt;p&gt;We have millions of empty homes and millions of homeless people. Why is that?&lt;/p&gt;\n\n&lt;p&gt;We live in a time of phenomenal abundance but there is poverty everywhere.&lt;/p&gt;\n\n&lt;p&gt;Food is left to rot in the field while people starve.&lt;/p&gt;\n\n&lt;p&gt;Real abundance is being destroyed. WHY?&lt;/p&gt;\n\n&lt;p&gt;Both Capitalists and Socialists are complicit in this fraud called artificial scarcity. Look at this picture for a few minutes and take it all in.&lt;/p&gt;\n\n&lt;p&gt;Those are not sand bags. What you are seeing is millions and millions of tonns of grain that was purposely destroyed so that meme of artificial scarcity could be maintained. Every bag represents a life ruined. Every bag represents a malnourished child that had to go to bed hungry. This is a real life holocaust.&lt;/p&gt;\n\n&lt;p&gt;Do you really think people would work these lousy wage slave jobs if there was not the ever present threat of death by starvation hanging over people&amp;#39;s heads. That is how the modern day slave system works. It is about controlling people either through their jobs or through government socialism. Either way you are a slave to the system. It is system that destroys the natural abundance of human production so that those at the bottom of society are held captive to the whims of the people whole rule at the top of the social pyramid. They want us all competing against each other in Hobbsian struggle for survival. The Hunger Games is an apt analogy for how the world really exists behind the scenes. If there was no hunger than there would be NO games. I don&amp;#39;t know about you but I grow tired of these hunger games and am here to bust this system by exposing it.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t you dare call me a socialist for saying such things. What I advocate is not socialism. Socialism is just another failed ideology. The socialist survives on the same meme of artificial scarcity. Those who do not do what the socialist tells them to do shall not eat and is left to starve. That is how Stalin cemented his control over the USSR. He engineered the Holodomor artificial famine and cut off the people&amp;#39;s food supply. Those who did not swear complete allegiance to him were not fed and thus died of starvation. The socialist mind has not really changed much since then. The whole scarcity meme was artificially engineered then and it is being artificially engineered right now through socialist policies in the United States.&lt;/p&gt;\n\n&lt;p&gt;Artificial scarcity is the biggest lie ever told. The idea that everything is scarce is a huge lie. There is no poverty. It is all fake, all lies. Poverty is manufactured via a system of debt, wage slavery, and government socialism. We live in a world of phenomenal abundance where nobody ever has to starve. Grain can flow like sand in a desert if people can learn to see through the lies. There does not have to be a hunger games style competition between the world&amp;#39;s people if they can see the bigger picture. People do not have to fight to the death over the lie of limited resources.&lt;/p&gt;\n\n&lt;p&gt;What I advocate is called a resource based economy where work creates its own intrinsic value.&lt;/p&gt;\n\n&lt;p&gt;Factories have intrinsic value&lt;/p&gt;\n\n&lt;p&gt;Fields of grain have intrinsic value&lt;/p&gt;\n\n&lt;p&gt;Workers earning an honest wage have intrinsic value&lt;/p&gt;\n\n&lt;p&gt;What has no intrinsic value is money, banks, and stock markets and yet these worthless things are the most highly prized in our society.&lt;/p&gt;\n\n&lt;p&gt;The defenders of the current limited paradigm will argue there is not enough money to pay for all the jobs, homes, and food for everyone. But they forget money is NOT the be all end all of wealth. Money is merely an abstraction that exists to facilitate trade. However, money in the modern corporate capitalist sense does NOT facilitate trade. It does the opposite, it restricts trade because it is all hoarded by a super elite group of rich people and there is no money for the average person. When the average person has no money then trade for all practical purposes grinds to a halt. This is why the factories stopped running and why food rots in the field. There is no trade so everything goes to waste.&lt;/p&gt;\n\n&lt;p&gt;In a resource based economy money is created that is backed by resources. In stead of letting food rot money would be created that is backed by the grain stores so it can be traded to hungry people who want to eat the food. Money in a resource based economy represents things with intrinsic value. Money exists for its original purpose to facilitate trade. That is what is needed to end the current malaise.&lt;/p&gt;\n\n&lt;p&gt;Do you have any idea how much the Earth is worth? It is worth Quadrillions. (see link)&lt;/p&gt;\n\n&lt;p&gt;What stands in the way of true progress is the banks and particularly central banks such as the Federal reserve system.&lt;/p&gt;\n\n&lt;p&gt;The Federal Reserve is not a branch of the government. The FED is a privately owned for profit bank. It is controlled by a conglomeration of Wall Street crooks and con artists from the City of London. Part of it is even owned by the Chinese communist government. It is a corporation that has allegiance to no country but lives off the backs of the people like a parasite.&lt;/p&gt;\n\n&lt;p&gt;We let a private bank print up and loan the people&amp;#39;s currency at interest. It is one of the greatest scams of all time and it has been going on for 100 years. It has resulted in the complete looting of the country. The dollar has lost 99% of its value since the FED was created. Even just 35 years ago the cost of college education was just a couple hundred dollars. Children today have to take out a 30 year mortgage just to go to school. Then they enter the work place where people fight over lousy $10 /hr jobs. It is SLAVERY and you are a slave under this system. &lt;/p&gt;\n\n&lt;p&gt;The total US debt is actually $0 because this is all a con game. Put an end to the Federal Reserve and the debt simply goes away. It is all unconstitutional anyway because only the US government and NOT a private bank is allowed to issue the currency. The debt is NULL and VOID because it is unconstitutional. The debt can simply be erased by ending the FED. The plan to zero out the debt is the only moral thing to do that can country from the Kraken. This plan will never happen because our leaders or too corrupt and bribed to ever change the deal. The American government is the most corrupt regime on Earth because of what they have done here. People aught to revolt but they never will because they are too stupid to realize they even are slaves to this beast.&lt;/p&gt;\n\n&lt;p&gt;In 1964 the minimum wage was 5 silver quarters. In 2016 those 5 silver quarters have a melt value of $15.55.&lt;/p&gt;\n\n&lt;p&gt;We don&amp;#39;t need to raise the minimum wage. We need to fix the money.&lt;/p&gt;\n\n&lt;p&gt;Workers should demand to be paid in real money, not valueless numbers in a computer. Don&amp;#39;t accept an IOU for your wage. They are not paying you. People are being conned.------&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgc0bi9", "score_hidden": false, "stickied": false, "created": 1492377030.0, "created_utc": 1492348230.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgc84y3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Prgjdsaewweoidsm", "parent_id": "t3_65on9c", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "Time to abandon the Fed and their usury, and go back to the Development Bank concept that our Founders endorsed. The central bank should benefit all of the people, not wealthy bankers.\n\nhttps://en.wikipedia.org/wiki/First_Bank_of_the_United_States\n\nhttps://en.wikipedia.org/wiki/Second_Bank_of_the_United_States\n\n\n\"However, unlike the Bank of England, the primary function of the bank would be credit issued to government and private interests, for internal improvements and other economic development, per Hamilton's system of Public Credit.\"\n\nr/New_American_System", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Time to abandon the Fed and their usury, and go back to the Development Bank concept that our Founders endorsed. The central bank should benefit all of the people, not wealthy bankers.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/First_Bank_of_the_United_States\"&gt;https://en.wikipedia.org/wiki/First_Bank_of_the_United_States&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Second_Bank_of_the_United_States\"&gt;https://en.wikipedia.org/wiki/Second_Bank_of_the_United_States&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;However, unlike the Bank of England, the primary function of the bank would be credit issued to government and private interests, for internal improvements and other economic development, per Hamilton&amp;#39;s system of Public Credit.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"/r/New_American_System\"&gt;r/New_American_System&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgc84y3", "score_hidden": false, "stickied": false, "created": 1492389024.0, "created_utc": 1492360224.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgdjp3a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Prgjdsaewweoidsm", "parent_id": "t1_dgdheck", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "Would you rather that private bankers control the whole government, as they already do? Do you realize how many people are in our cabinet, right now, from one single bank, Goldman Sachs?\n\nYour objection is based on some fairy-tale land where we have a free market. In reality we have a banking cabal that has eaten up the whole government.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would you rather that private bankers control the whole government, as they already do? Do you realize how many people are in our cabinet, right now, from one single bank, Goldman Sachs?&lt;/p&gt;\n\n&lt;p&gt;Your objection is based on some fairy-tale land where we have a free market. In reality we have a banking cabal that has eaten up the whole government.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgdjp3a", "score_hidden": false, "stickied": false, "created": 1492468336.0, "created_utc": 1492439536.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdheck", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "TheMothFaery", "parent_id": "t1_dgc89ya", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "This is terrible. it gives way too much power to the banks \"to reign in risky local banks\". \"High tariffs paid to the government.\" \"High prices on land\" this is in the opposite direction of going away from the banks we don't really need.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is terrible. it gives way too much power to the banks &amp;quot;to reign in risky local banks&amp;quot;. &amp;quot;High tariffs paid to the government.&amp;quot; &amp;quot;High prices on land&amp;quot; this is in the opposite direction of going away from the banks we don&amp;#39;t really need.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgdheck", "score_hidden": false, "stickied": false, "created": 1492465021.0, "created_utc": 1492436221.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc89ya", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Prgjdsaewweoidsm", "parent_id": "t1_dgc60q4", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "&gt; So are we gonna keep bitching behind their backs like little school girls or stand up and do something?\n\nThe revolution is already in progress. r/New_American_System", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So are we gonna keep bitching behind their backs like little school girls or stand up and do something?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The revolution is already in progress. &lt;a href=\"/r/New_American_System\"&gt;r/New_American_System&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgc89ya", "score_hidden": false, "stickied": false, "created": 1492389209.0, "created_utc": 1492360409.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgdrers", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ls2323", "parent_id": "t1_dgc60q4", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "Bitcoins.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoins.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgdrers", "score_hidden": false, "stickied": false, "created": 1492477354.0, "created_utc": 1492448554.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc60q4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TheMothFaery", "parent_id": "t3_65on9c", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "I see posts about banks and the Fed here nearly every day. Nearly all of our world problems can be traced back to money. Forget the lizard overlords. The Cabal. The reality is money. So are we gonna keep bitching behind their backs like little school girls or stand up and do something?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see posts about banks and the Fed here nearly every day. Nearly all of our world problems can be traced back to money. Forget the lizard overlords. The Cabal. The reality is money. So are we gonna keep bitching behind their backs like little school girls or stand up and do something?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgc60q4", "score_hidden": false, "stickied": false, "created": 1492386168.0, "created_utc": 1492357368.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgcboyd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mjasmjas", "parent_id": "t3_65on9c", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "https://www.youtube.com/watch?v=eWuAH3P9s1k", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=eWuAH3P9s1k\"&gt;https://www.youtube.com/watch?v=eWuAH3P9s1k&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgcboyd", "score_hidden": false, "stickied": false, "created": 1492393674.0, "created_utc": 1492364874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgcbomr", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "mjasmjas", "parent_id": "t1_dgc9g97", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "A random comment with no source or rational thoughts, I'm convinced.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A random comment with no source or rational thoughts, I&amp;#39;m convinced.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgcbomr", "score_hidden": false, "stickied": false, "created": 1492393663.0, "created_utc": 1492364863.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgcbw1m", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "justaddbooze", "parent_id": "t1_dgc9g97", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "Wtf I love the Fed now !", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wtf I love the Fed now !&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgcbw1m", "score_hidden": false, "stickied": false, "created": 1492393928.0, "created_utc": 1492365128.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc9g97", "gilded": 0, "archived": false, "score": -8, "report_reasons": null, "author": "6Dollarcoffee", "parent_id": "t3_65on9c", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "this is a famously flawed documentary. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this is a famously flawed documentary. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgc9g97", "score_hidden": false, "stickied": false, "created": 1492390723.0, "created_utc": 1492361923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh4r", "removal_reason": null, "link_id": "t3_65on9c", "likes": null, "replies": "", "user_reports": [], "id": "dgccspi", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "ISpankdAMonkeyOnce", "parent_id": "t3_65on9c", "subreddit_name_prefixed": "r/conspiracy", "controversiality": 0, "body": "Nice try communists.. Doesn't work on people who educate themselves.. No wonder you rely on peasants.. ", "edited": 1492369618.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice try communists.. Doesn&amp;#39;t work on people who educate themselves.. No wonder you rely on peasants.. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "conspiracy", "name": "t1_dgccspi", "score_hidden": false, "stickied": false, "created": 1492395133.0, "created_utc": 1492366333.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}]