[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "shortscarystories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a really paranoid person. I&amp;#39;ll hear some little bump or creak and immediately jump to serial killer or rabid dog or really, &lt;em&gt;really&lt;/em&gt; big spider.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why I can&amp;#39;t wear headphones or take showers. The noise is too loud, and it drowns out everything.  That&amp;#39;s why I always have the music on really low.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why I notice little sounds, ordinary stuff. Like just right now, actually, I heard a car outside. Just sitting there with the engine running.  At first I didn&amp;#39;t think about it, but then I wondered, who would leave their car running that long? Why don&amp;#39;t they park, or drive away? I sat there listening, imagining what kind of horrors I might see if I pulled back the curtain, until my curiosity overpowered my fear.&lt;/p&gt;\n\n&lt;p&gt;So I went to the window and looked. There was a white truck parked on the curb opposite my house.  I think I saw someone in there too. I watched him for a while.  After about ten minutes, he drove away.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s how you spend the whole day ignoring everything around you, and then when you get into a high anxiety situation every single sound is the closest most terrifying thing you&amp;#39;ve ever heard.  Like when I heard the dogs barking, after I had gone back to my desk.  I hear them barking almost every night (annoying little shits.)  But tonight it was different, I thought, because they were &lt;em&gt;all&lt;/em&gt; barking, and it was so loud, and of course the car had already freaked me out so I had to go and take a look. &lt;/p&gt;\n\n&lt;p&gt;The car was back! It was actually parked this time, with nobody in there. As soon as I saw it my mind raced with dozens of ridiculous, improbable scenarios, like what if the guy had killed my neighbor&amp;#39;s dog, or maybe he &lt;em&gt;was&lt;/em&gt; a dog or something, a werewolf...&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s when I heard the gunshot.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s actually not unusual; I hear gunshots all the time.  I live near a police training academy, and I guess that sound really carries because it&amp;#39;s about a mile away but I always hear it clear as crystal.&lt;/p&gt;\n\n&lt;p&gt;But when you&amp;#39;re in a state of heightened anxiety sounds have a way of getting distorted, and that gun that I &lt;em&gt;know&lt;/em&gt; is from the police academy sounds like it could be from the house across the street.  And even though I &lt;em&gt;know&lt;/em&gt; it isn&amp;#39;t true it never fails to quicken my pulse.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve learned to control myself. To sit down, and close the curtain and go back to reddit, and tell myself that absolutely nothing happened.&lt;/p&gt;\n\n&lt;p&gt;But I can&amp;#39;t force myself to ignore the sounds outside. And I can&amp;#39;t get rid of those anxious feelings that are telling me that the creaks in my house mean it could topple any minute, and that my pulse means I have a heart condition, and that the police siren outside sounds like it&amp;#39;s in my neighborhood and coming toward my house.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm a really paranoid person. I'll hear some little bump or creak and immediately jump to serial killer or rabid dog or really, *really* big spider.\n\nThat's why I can't wear headphones or take showers. The noise is too loud, and it drowns out everything.  That's why I always have the music on really low.\n\nThat's why I notice little sounds, ordinary stuff. Like just right now, actually, I heard a car outside. Just sitting there with the engine running.  At first I didn't think about it, but then I wondered, who would leave their car running that long? Why don't they park, or drive away? I sat there listening, imagining what kind of horrors I might see if I pulled back the curtain, until my curiosity overpowered my fear.\n\nSo I went to the window and looked. There was a white truck parked on the curb opposite my house.  I think I saw someone in there too. I watched him for a while.  After about ten minutes, he drove away.\n\nIt's how you spend the whole day ignoring everything around you, and then when you get into a high anxiety situation every single sound is the closest most terrifying thing you've ever heard.  Like when I heard the dogs barking, after I had gone back to my desk.  I hear them barking almost every night (annoying little shits.)  But tonight it was different, I thought, because they were *all* barking, and it was so loud, and of course the car had already freaked me out so I had to go and take a look. \n\nThe car was back! It was actually parked this time, with nobody in there. As soon as I saw it my mind raced with dozens of ridiculous, improbable scenarios, like what if the guy had killed my neighbor's dog, or maybe he *was* a dog or something, a werewolf...\n\nThat's when I heard the gunshot.\n\nThat's actually not unusual; I hear gunshots all the time.  I live near a police training academy, and I guess that sound really carries because it's about a mile away but I always hear it clear as crystal.\n\nBut when you're in a state of heightened anxiety sounds have a way of getting distorted, and that gun that I *know* is from the police academy sounds like it could be from the house across the street.  And even though I *know* it isn't true it never fails to quicken my pulse.\n\nI've learned to control myself. To sit down, and close the curtain and go back to reddit, and tell myself that absolutely nothing happened.\n\nBut I can't force myself to ignore the sounds outside. And I can't get rid of those anxious feelings that are telling me that the creaks in my house mean it could topple any minute, and that my pulse means I have a heart condition, and that the police siren outside sounds like it's in my neighborhood and coming toward my house.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "653smo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 20, "report_reasons": null, "author": "KYRIEELEISON_", "saved": false, "mod_reports": [], "name": "t3_653smo", "subreddit_name_prefixed": "r/shortscarystories", "approved_by": null, "over_18": false, "domain": "self.shortscarystories", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t6kz", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/shortscarystories/comments/653smo/im_a_really_paranoid_person/", "num_reports": null, "locked": false, "stickied": false, "created": 1492092929.0, "url": "https://www.reddit.com/r/shortscarystories/comments/653smo/im_a_really_paranoid_person/", "author_flair_text": null, "quarantine": false, "title": "I'm a really paranoid person", "created_utc": 1492064129.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t6kz", "removal_reason": null, "link_id": "t3_653smo", "likes": null, "replies": "", "user_reports": [], "id": "dg7fgm0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LordOfTheFatBabies", "parent_id": "t3_653smo", "subreddit_name_prefixed": "r/shortscarystories", "controversiality": 0, "body": "Awesome story, would love to see more!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome story, would love to see more!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "shortscarystories", "name": "t1_dg7fgm0", "score_hidden": false, "stickied": false, "created": 1492112384.0, "created_utc": 1492083584.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t6kz", "removal_reason": null, "link_id": "t3_653smo", "likes": null, "replies": "", "user_reports": [], "id": "dg7geid", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Owleyes_n_moles", "parent_id": "t3_653smo", "subreddit_name_prefixed": "r/shortscarystories", "controversiality": 0, "body": "It's different. \nI like it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s different. \nI like it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "shortscarystories", "name": "t1_dg7geid", "score_hidden": false, "stickied": false, "created": 1492114290.0, "created_utc": 1492085490.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t6kz", "removal_reason": null, "link_id": "t3_653smo", "likes": null, "replies": "", "user_reports": [], "id": "dg8jje5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ElPresidentePiinky", "parent_id": "t3_653smo", "subreddit_name_prefixed": "r/shortscarystories", "controversiality": 0, "body": "Definitely need a part 2! 🙂", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely need a part 2! 🙂&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "shortscarystories", "name": "t1_dg8jje5", "score_hidden": false, "stickied": false, "created": 1492161348.0, "created_utc": 1492132548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]