[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "shortscarystories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We tried to piece together what happened to our small town of Vanstoon, but no official report was ever released; naturally conspiracies ensued, but one thing was clear, 229 out of 231 people were eventually found slaughtered; many skinned, maimed, and charred. The town was cleansed, and in a way worse than the camps we soon learned about after the War in Germany.&lt;/p&gt;\n\n&lt;p&gt;My little brother, Harold and I sat near a large oak by the roadside. That morning was particularly warm, but windy; the moss swayed on the branches and the barbed wire below. I loved taking Harold to our little spot so we could watch cars blaze by on the road, kicking up clouds of dust as they trailed by. It was such a &lt;em&gt;rush.&lt;/em&gt; But that morning was quiet, no cars.&lt;/p&gt;\n\n&lt;p&gt;I distinctively remember Harold looking up at me, as if I knew as to why the traffic was non-existent. But I could only shrug my shoulders as we sat in the tall, swaying grass. It didn&amp;#39;t take long, however, for something to appear on the horizon. Only there was no car or truck, or even a tractor which would occasionally roll by. No this was a man, or so we thought at first.&lt;/p&gt;\n\n&lt;p&gt;I remember us standing up as I squinted my eyes at the person. It trudged in the middle of the road toward us, and grew bigger and bigger as it drew closer. We clenched each others&amp;#39; hands and beads of sweat dripped down my neck.&lt;/p&gt;\n\n&lt;p&gt;As it approached us by the tree, it turned it&amp;#39;s long pale neck, then stopped, looking down at us as ants. Its entire body was grey under the sun, and was marred with deep red cuts. It must&amp;#39;ve been near 10&amp;#39; in stature. It had a long face that resembled a man&amp;#39;s, but its eyes were wide and void of pupils. It had no mouth but to this day, I vividly recall it attempting to speak. Then with long claw-like hands, it rent its chest open, and we stared inside of it: a large red, wet substance pulsated inside of him, and dozens of unrecognizable faces protruded and descended from it, as well as violent screams causing me to shiver. Then it slammed his chest shut and let out a moaning guttural-scream, and Harold and I fell down before it prostrating. And even under the heat of the sun, I suddenly felt as if I were in an oven, then it rapidly grew cooler.&lt;/p&gt;\n\n&lt;p&gt;And after what felt like hours later, but probably minutes, we both looked up and &lt;em&gt;it&lt;/em&gt; was gone. But where it stood, the gravel road was black.&lt;/p&gt;\n\n&lt;p&gt;Over the years, we tried sharing this story to any outlet possible, but we&amp;#39;ve always been quickly dismissed. We lost everyone in Vanstoon, and I &lt;em&gt;know&lt;/em&gt; we got real close to the killer. I don&amp;#39;t know why it didn&amp;#39;t harm us, but it seemed like it had somewhere else to be, with suffering souls inside its body.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We tried to piece together what happened to our small town of Vanstoon, but no official report was ever released; naturally conspiracies ensued, but one thing was clear, 229 out of 231 people were eventually found slaughtered; many skinned, maimed, and charred. The town was cleansed, and in a way worse than the camps we soon learned about after the War in Germany.\n\nMy little brother, Harold and I sat near a large oak by the roadside. That morning was particularly warm, but windy; the moss swayed on the branches and the barbed wire below. I loved taking Harold to our little spot so we could watch cars blaze by on the road, kicking up clouds of dust as they trailed by. It was such a *rush.* But that morning was quiet, no cars.\n\nI distinctively remember Harold looking up at me, as if I knew as to why the traffic was non-existent. But I could only shrug my shoulders as we sat in the tall, swaying grass. It didn't take long, however, for something to appear on the horizon. Only there was no car or truck, or even a tractor which would occasionally roll by. No this was a man, or so we thought at first.\n\nI remember us standing up as I squinted my eyes at the person. It trudged in the middle of the road toward us, and grew bigger and bigger as it drew closer. We clenched each others' hands and beads of sweat dripped down my neck.\n\nAs it approached us by the tree, it turned it's long pale neck, then stopped, looking down at us as ants. Its entire body was grey under the sun, and was marred with deep red cuts. It must've been near 10' in stature. It had a long face that resembled a man's, but its eyes were wide and void of pupils. It had no mouth but to this day, I vividly recall it attempting to speak. Then with long claw-like hands, it rent its chest open, and we stared inside of it: a large red, wet substance pulsated inside of him, and dozens of unrecognizable faces protruded and descended from it, as well as violent screams causing me to shiver. Then it slammed his chest shut and let out a moaning guttural-scream, and Harold and I fell down before it prostrating. And even under the heat of the sun, I suddenly felt as if I were in an oven, then it rapidly grew cooler.\n\nAnd after what felt like hours later, but probably minutes, we both looked up and *it* was gone. But where it stood, the gravel road was black.\n\nOver the years, we tried sharing this story to any outlet possible, but we've always been quickly dismissed. We lost everyone in Vanstoon, and I *know* we got real close to the killer. I don't know why it didn't harm us, but it seemed like it had somewhere else to be, with suffering souls inside its body.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65k098", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 8, "report_reasons": null, "author": "EricMoralevitz", "saved": false, "mod_reports": [], "name": "t3_65k098", "subreddit_name_prefixed": "r/shortscarystories", "approved_by": null, "over_18": false, "domain": "self.shortscarystories", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t6kz", "edited": 1492276916.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/shortscarystories/comments/65k098/vanstoon/", "num_reports": null, "locked": false, "stickied": false, "created": 1492303174.0, "url": "https://www.reddit.com/r/shortscarystories/comments/65k098/vanstoon/", "author_flair_text": null, "quarantine": false, "title": "Vanstoon", "created_utc": 1492274374.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t6kz", "removal_reason": null, "link_id": "t3_65k098", "likes": null, "replies": "", "user_reports": [], "id": "dgauxan", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "furry-fun", "parent_id": "t3_65k098", "subreddit_name_prefixed": "r/shortscarystories", "controversiality": 0, "body": "Mmm delicious suffering soul sundae", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Mmm delicious suffering soul sundae&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "shortscarystories", "name": "t1_dgauxan", "score_hidden": false, "stickied": false, "created": 1492303668.0, "created_utc": 1492274868.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t6kz", "removal_reason": null, "link_id": "t3_65k098", "likes": null, "replies": "", "user_reports": [], "id": "dgdmauk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Human_Gravy", "parent_id": "t3_65k098", "subreddit_name_prefixed": "r/shortscarystories", "controversiality": 0, "body": "Wow, this was pretty intense. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, this was pretty intense. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "shortscarystories", "name": "t1_dgdmauk", "score_hidden": false, "stickied": false, "created": 1492471586.0, "created_utc": 1492442786.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]