[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "shortscarystories", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d never cooked a foot before.  &lt;/p&gt;\n\n&lt;p&gt;So there was that.&lt;/p&gt;\n\n&lt;p&gt;In principle it shouldn&amp;#39;t have been all that different from a spiral ham or a pot roast, and it wasn&amp;#39;t - not in how you cook it at least.  Stick it in the oven, pump up the heat and wait.  The oven was gas  and I&amp;#39;d used it sparingly over the past two weeks, mainly to heat the cabin when the cold crept under the door and past the boards.  Shivers ran up and down my spine but the cabin felt warm.  &amp;quot;The hunger then,&amp;quot; I reminded myself, knowing the tank had enough juice to cook my meal through and then some. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Hate to get sick from some raw meat,&amp;quot; I mumbled, turning over the foot to char the heel.  A sudden cackle took me by surprise as I realized I made a joke.  It popped out of my lips like a champagne cork and I saw the shadows move across the floor more vigorously than before.  &lt;/p&gt;\n\n&lt;p&gt;I bit my mouth closed and leaned back in my chair.  Well it wasn&amp;#39;t my chair.  &amp;quot;Not my cabin either,&amp;quot; I snarled, watching the toenails snap off in the heat.  &lt;/p&gt;\n\n&lt;p&gt;The cabin continued to shake and I heard their moans.  I pushed the wisps of cotton further into my ears, but they were still heard. \n They were still there.  &lt;/p&gt;\n\n&lt;p&gt;As the oven began to smoke I stumbled over to the fireplace and opened the flue.  I looked up the chimney anxiously but nothing fell down this time, no bat no cat no rat.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A la carte then,&amp;quot; I thought, keeping my eye on the oven.  The walls shook harder but I just pushed the cotton in deeper.  &lt;/p&gt;\n\n&lt;p&gt;I ambled back over to my dinner, eyeing the four walls, the six windows, and the thirty-nine boards nailed to them.  I grouped them together tightly, but the shadows snuck through - lurching and hungry.  I opened the oven door and breathed deeply.  &amp;quot;Delicious,&amp;quot; I muttered, saliva running streaks down my filthy chin.  &lt;/p&gt;\n\n&lt;p&gt;They moaned outside.  My flesh crawled while the flesh of the foot blistered and popped.  The scent was intoxicating, and as they beat against the cabin walls I knew they smelled it too.&lt;/p&gt;\n\n&lt;p&gt;As my body warmed so did my fury.  With a feral roar I pulled the foot out with my bare hands and limped over to the closest window.  &amp;quot;You want some!&amp;quot; I screamed as I tore into the molten flesh.  &amp;quot;You hungry?!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;They moaned louder and I grinned.  I ate the whole foot in one sitting, sucking the juices off my fingers with relish as they pulled at the boards.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a week later now and for the past seven days I&amp;#39;ve been cursing myself.  I should have made it last.  I should have rationed it.&lt;/p&gt;\n\n&lt;p&gt;I scratched the stump where my foot used to be.&lt;/p&gt;\n\n&lt;p&gt;I looked at my remaining foot and shivered.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'd never cooked a foot before.  \n\nSo there was that.\n\nIn principle it shouldn't have been all that different from a spiral ham or a pot roast, and it wasn't - not in how you cook it at least.  Stick it in the oven, pump up the heat and wait.  The oven was gas  and I'd used it sparingly over the past two weeks, mainly to heat the cabin when the cold crept under the door and past the boards.  Shivers ran up and down my spine but the cabin felt warm.  \"The hunger then,\" I reminded myself, knowing the tank had enough juice to cook my meal through and then some. \n\n\"Hate to get sick from some raw meat,\" I mumbled, turning over the foot to char the heel.  A sudden cackle took me by surprise as I realized I made a joke.  It popped out of my lips like a champagne cork and I saw the shadows move across the floor more vigorously than before.  \n\nI bit my mouth closed and leaned back in my chair.  Well it wasn't my chair.  \"Not my cabin either,\" I snarled, watching the toenails snap off in the heat.  \n\nThe cabin continued to shake and I heard their moans.  I pushed the wisps of cotton further into my ears, but they were still heard. \n They were still there.  \n\nAs the oven began to smoke I stumbled over to the fireplace and opened the flue.  I looked up the chimney anxiously but nothing fell down this time, no bat no cat no rat.\n\n\"A la carte then,\" I thought, keeping my eye on the oven.  The walls shook harder but I just pushed the cotton in deeper.  \n\nI ambled back over to my dinner, eyeing the four walls, the six windows, and the thirty-nine boards nailed to them.  I grouped them together tightly, but the shadows snuck through - lurching and hungry.  I opened the oven door and breathed deeply.  \"Delicious,\" I muttered, saliva running streaks down my filthy chin.  \n\nThey moaned outside.  My flesh crawled while the flesh of the foot blistered and popped.  The scent was intoxicating, and as they beat against the cabin walls I knew they smelled it too.\n\nAs my body warmed so did my fury.  With a feral roar I pulled the foot out with my bare hands and limped over to the closest window.  \"You want some!\" I screamed as I tore into the molten flesh.  \"You hungry?!\"\n\nThey moaned louder and I grinned.  I ate the whole foot in one sitting, sucking the juices off my fingers with relish as they pulled at the boards.\n\nIt's a week later now and for the past seven days I've been cursing myself.  I should have made it last.  I should have rationed it.\n\nI scratched the stump where my foot used to be.\n\nI looked at my remaining foot and shivered.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65zzci", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "orsamus", "saved": false, "mod_reports": [], "name": "t3_65zzci", "subreddit_name_prefixed": "r/shortscarystories", "approved_by": null, "over_18": false, "domain": "self.shortscarystories", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2t6kz", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/shortscarystories/comments/65zzci/dinner_time/", "num_reports": null, "locked": false, "stickied": false, "created": 1492509434.0, "url": "https://www.reddit.com/r/shortscarystories/comments/65zzci/dinner_time/", "author_flair_text": null, "quarantine": false, "title": "Dinner Time", "created_utc": 1492480634.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t6kz", "removal_reason": null, "link_id": "t3_65zzci", "likes": null, "replies": "", "user_reports": [], "id": "dgeob1m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "someoneslowwrotethis", "parent_id": "t3_65zzci", "subreddit_name_prefixed": "r/shortscarystories", "controversiality": 0, "body": "I love this! Very creepy!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love this! Very creepy!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "shortscarystories", "name": "t1_dgeob1m", "score_hidden": true, "stickied": false, "created": 1492517177.0, "created_utc": 1492488377.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]