[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "biology", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys. I have read some stuff on the sidebar to help get a general idea on how to shift into bioinformatic research, but I want to get some opinions from people in the field or people still learning the field. So here is some background and maybe you can help me feel confident in how I want to approach my future:\nI graduated in 2014 with a BSc in Developmental and Cell Biology. During my studies I took pretty much exclusively basic science classes. I loved the program and developmental biology as a whole. I even participated in undergraduate research for about a year and a half where I studied limb regeneration in Axolotls; I mostly performed immunohistochemistry experiments and didn&amp;#39;t get published or anything. After my undergraduate studies I took a year off to just decompress and not be a responsible adult for a bit.\nFast forward to a year later, where I got a job as a Research Assistant in a Developmental Neuroscience lab. Again, I was mostly doing immunohistochemistry and some image analysis in mouse models with a tiny bit of behavioral work. I quickly got bored of that place and needed a new experience, something more translational -- hoping to get into some sequencing and more bioinformatic approaches.\nSo I took a new job in a cancer research lab, specifically studying circulating tumor cells. I have only been here for about 4 months now and the main gist of the lab is doing single cell work with live/fixed cells from human patient samples. So far my job has been collecting and processing the samples but really no actual data collection yet. The lab sends out samples to external companies who help us out with some genetic screening and data analysis but I have yet to physically see any of the information. I am hoping we can get into some actual sequencing and RNA analysis in single cells but the pipeline seems to be slowed down by collaborations with many other institutions. I do enjoy the work though and I know that there is some big promise with the studies we are doing so I will definitely stick around for 1-2 years. However, I really want to get into bioinformatics and looking into the huge data sets that exist to help guide our research and provide some really interesting interactions and predictions to the field of personalized medicine.\nSo here I am... turning 25 this year, have yet to make any serious career advancement moves and now I have the itch to learn a whole new subject of biology and information science. I was planning on getting my PhD at some point but I just haven&amp;#39;t felt ready to take on that challenge yet. So I feel like I need to make some decisions fast.\nI have very little knowledge of programming - I have taken the absolute most basic online courses in Python and R - and even then I wouldn&amp;#39;t say I really have any practical grasp of the concepts that are available yet. I really just want to be a part of the sequencing process and have the ability to analyze the output so that it can have any actual meaning to scientists.\nSo where should I go from here? Should I just spend hours every day after work learning the basics of programming? Should I just finish this job and do a Masters in bioinformatics to get the training required to move on? Should I just not pursue this itch and continue doing science driven research and maybe learn some bioinformatics on the way? What are my options? What is reasonable and what is impossible? Any information would help. And I am currently working at an institution where I can pretty much take one course per semester for free which opens up some opportunities. Thanks. And I am looking forward to some responses.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys. I have read some stuff on the sidebar to help get a general idea on how to shift into bioinformatic research, but I want to get some opinions from people in the field or people still learning the field. So here is some background and maybe you can help me feel confident in how I want to approach my future:\nI graduated in 2014 with a BSc in Developmental and Cell Biology. During my studies I took pretty much exclusively basic science classes. I loved the program and developmental biology as a whole. I even participated in undergraduate research for about a year and a half where I studied limb regeneration in Axolotls; I mostly performed immunohistochemistry experiments and didn't get published or anything. After my undergraduate studies I took a year off to just decompress and not be a responsible adult for a bit.\nFast forward to a year later, where I got a job as a Research Assistant in a Developmental Neuroscience lab. Again, I was mostly doing immunohistochemistry and some image analysis in mouse models with a tiny bit of behavioral work. I quickly got bored of that place and needed a new experience, something more translational -- hoping to get into some sequencing and more bioinformatic approaches.\nSo I took a new job in a cancer research lab, specifically studying circulating tumor cells. I have only been here for about 4 months now and the main gist of the lab is doing single cell work with live/fixed cells from human patient samples. So far my job has been collecting and processing the samples but really no actual data collection yet. The lab sends out samples to external companies who help us out with some genetic screening and data analysis but I have yet to physically see any of the information. I am hoping we can get into some actual sequencing and RNA analysis in single cells but the pipeline seems to be slowed down by collaborations with many other institutions. I do enjoy the work though and I know that there is some big promise with the studies we are doing so I will definitely stick around for 1-2 years. However, I really want to get into bioinformatics and looking into the huge data sets that exist to help guide our research and provide some really interesting interactions and predictions to the field of personalized medicine.\nSo here I am... turning 25 this year, have yet to make any serious career advancement moves and now I have the itch to learn a whole new subject of biology and information science. I was planning on getting my PhD at some point but I just haven't felt ready to take on that challenge yet. So I feel like I need to make some decisions fast.\nI have very little knowledge of programming - I have taken the absolute most basic online courses in Python and R - and even then I wouldn't say I really have any practical grasp of the concepts that are available yet. I really just want to be a part of the sequencing process and have the ability to analyze the output so that it can have any actual meaning to scientists.\nSo where should I go from here? Should I just spend hours every day after work learning the basics of programming? Should I just finish this job and do a Masters in bioinformatics to get the training required to move on? Should I just not pursue this itch and continue doing science driven research and maybe learn some bioinformatics on the way? What are my options? What is reasonable and what is impossible? Any information would help. And I am currently working at an institution where I can pretty much take one course per semester for free which opens up some opportunities. Thanks. And I am looking forward to some responses.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "discussion", "id": "650h9s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Cunhabear", "saved": false, "mod_reports": [], "name": "t3_650h9s", "subreddit_name_prefixed": "r/biology", "approved_by": null, "over_18": false, "domain": "self.biology", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn7", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": "developmentalbiology", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/biology/comments/650h9s/i_want_to_move_into_the_field_of_bioinformatics/", "num_reports": null, "locked": false, "stickied": false, "created": 1492054960.0, "url": "https://www.reddit.com/r/biology/comments/650h9s/i_want_to_move_into_the_field_of_bioinformatics/", "author_flair_text": "developmental biology", "quarantine": false, "title": "I want to move into the field of bioinformatics but I don't know how... [xposted from /r/bioinformatics]", "created_utc": 1492026160.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_650h9s", "likes": null, "replies": "", "user_reports": [], "id": "dg6wmb5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ap524", "parent_id": "t3_650h9s", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "To be honest, similar to computer science, bioinformatics is mainly just time you dump into coding programs. I'd say keep chucking away at some programs, learn the UNIX environment, and solidify your experience in python. The masters and phd options are there for you as well, but once you can say you can use most basic bioinformatics programs, doors will open. Perhaps not as many since you don't have formal training but having those skills on your resume will help if you don't want to make that big of a commitment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To be honest, similar to computer science, bioinformatics is mainly just time you dump into coding programs. I&amp;#39;d say keep chucking away at some programs, learn the UNIX environment, and solidify your experience in python. The masters and phd options are there for you as well, but once you can say you can use most basic bioinformatics programs, doors will open. Perhaps not as many since you don&amp;#39;t have formal training but having those skills on your resume will help if you don&amp;#39;t want to make that big of a commitment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dg6wmb5", "score_hidden": false, "stickied": false, "created": 1492075041.0, "created_utc": 1492046241.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]