[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "biology", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always loved biology as a class and subject. I got an A in biology last year, and I&amp;#39;m keeping a steady A in chemistry right now. I&amp;#39;m so interested in Biology, particularly evolution, genetics, and ecology. I would love to do research across the world, or maybe be a biology teacher. Are there a lot of career options for a major in Biology? I&amp;#39;m not quite an AP student, does that mean I&amp;#39;ll struggle in college? What can I be doing right now as a junior in high school? Thanks :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've always loved biology as a class and subject. I got an A in biology last year, and I'm keeping a steady A in chemistry right now. I'm so interested in Biology, particularly evolution, genetics, and ecology. I would love to do research across the world, or maybe be a biology teacher. Are there a lot of career options for a major in Biology? I'm not quite an AP student, does that mean I'll struggle in college? What can I be doing right now as a junior in high school? Thanks :)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "question", "id": "654ste", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 0, "report_reasons": null, "author": "WhatAMess45", "saved": false, "mod_reports": [], "name": "t3_654ste", "subreddit_name_prefixed": "r/biology", "approved_by": null, "over_18": false, "domain": "self.biology", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn7", "edited": false, "link_flair_css_class": "question", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/biology/comments/654ste/question_should_i_major_in_biology/", "num_reports": null, "locked": false, "stickied": false, "created": 1492110518.0, "url": "https://www.reddit.com/r/biology/comments/654ste/question_should_i_major_in_biology/", "author_flair_text": null, "quarantine": false, "title": "[Question] Should I major in Biology?", "created_utc": 1492081718.0, "distinguished": null, "media": null, "upvote_ratio": 0.5, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_654ste", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_654ste", "likes": null, "replies": "", "user_reports": [], "id": "dg8a3kk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "micromonas", "parent_id": "t1_dg7f6ps", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "&gt;  I don't know much about private sector, outside of biotech\n\nmany people with biology degrees go on to do all sorts of stuff that don't seem directly related to biology, like teaching or accounting ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t know much about private sector, outside of biotech&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;many people with biology degrees go on to do all sorts of stuff that don&amp;#39;t seem directly related to biology, like teaching or accounting &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dg8a3kk", "score_hidden": false, "stickied": false, "created": 1492148728.0, "created_utc": 1492119928.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7f6ps", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rasellers0", "parent_id": "t3_654ste", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "if you're passionate about it, go for it. especially at the state level, there are frequently tons of jobs for biologists. I don't know much about private sector, outside of biotech, which, as competitive as it is, doesn't actually pay that well. you will do better in this field if you are looking toward post-grad and possibly doctoral degrees. (source: girlfriend was a biology undergrad)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;if you&amp;#39;re passionate about it, go for it. especially at the state level, there are frequently tons of jobs for biologists. I don&amp;#39;t know much about private sector, outside of biotech, which, as competitive as it is, doesn&amp;#39;t actually pay that well. you will do better in this field if you are looking toward post-grad and possibly doctoral degrees. (source: girlfriend was a biology undergrad)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dg7f6ps", "score_hidden": false, "stickied": false, "created": 1492111769.0, "created_utc": 1492082969.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_654ste", "likes": null, "replies": "", "user_reports": [], "id": "dg7ggpd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "CDev33", "parent_id": "t3_654ste", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "This is highly dependent on what you want to be doing. There's a lot of money to be made doing research in industry, but with just a bachelors you'd be earning more by climbing the corporate ladder and it would be more focused on the molecular/genetics side. This research is not really focused so much on world travel or field work at all. It's a lot of technical and protocol based lab work. \nIf you want to do world travel you're looking more at ecology, which doesn't pay as well but has much more flexibility than lab work. It's also a lot harder to find jobs because while the lab based work in genetics is tied to medicine which brings in a lot of money (both for industry and grant wise), ecology doesn't have that. It's mostly funded by the EPA and some NIH funding depending on what you're doing which is subject to government oversight. This 'oversight' can be hazardous for your job if you want to hold a job. \nA lot of schools also don't have great ecology programs so you have to do a bit more digging into them to assess the programs if that's the route you want to go. Don't worry about the AP classes unless you want to get into top tier schools. The only one that would be helpful is if you wanted to take AP Bio as it makes the intro bio classes you have to take way easier (if you did well, like a 5 on the AP test, don't use it to get out of the intro classes -- has them to boost your GPA in college). \nIf you want to be a teacher you're probably going to want to get at least a minor in education if you want to do middle/high school biology. If you want to teach in colleges you'll need a PhD. The best thing you can do is screen schools for what options they have and choose based on those. For example, George Washington University (DC) has a large well funded ecology department; but smaller colleges like Emmanuel College (Boston) have a small department with a lot of kids graduating with research experience (though mostly in Lab based research). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is highly dependent on what you want to be doing. There&amp;#39;s a lot of money to be made doing research in industry, but with just a bachelors you&amp;#39;d be earning more by climbing the corporate ladder and it would be more focused on the molecular/genetics side. This research is not really focused so much on world travel or field work at all. It&amp;#39;s a lot of technical and protocol based lab work. \nIf you want to do world travel you&amp;#39;re looking more at ecology, which doesn&amp;#39;t pay as well but has much more flexibility than lab work. It&amp;#39;s also a lot harder to find jobs because while the lab based work in genetics is tied to medicine which brings in a lot of money (both for industry and grant wise), ecology doesn&amp;#39;t have that. It&amp;#39;s mostly funded by the EPA and some NIH funding depending on what you&amp;#39;re doing which is subject to government oversight. This &amp;#39;oversight&amp;#39; can be hazardous for your job if you want to hold a job. \nA lot of schools also don&amp;#39;t have great ecology programs so you have to do a bit more digging into them to assess the programs if that&amp;#39;s the route you want to go. Don&amp;#39;t worry about the AP classes unless you want to get into top tier schools. The only one that would be helpful is if you wanted to take AP Bio as it makes the intro bio classes you have to take way easier (if you did well, like a 5 on the AP test, don&amp;#39;t use it to get out of the intro classes -- has them to boost your GPA in college). \nIf you want to be a teacher you&amp;#39;re probably going to want to get at least a minor in education if you want to do middle/high school biology. If you want to teach in colleges you&amp;#39;ll need a PhD. The best thing you can do is screen schools for what options they have and choose based on those. For example, George Washington University (DC) has a large well funded ecology department; but smaller colleges like Emmanuel College (Boston) have a small department with a lot of kids graduating with research experience (though mostly in Lab based research). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dg7ggpd", "score_hidden": false, "stickied": false, "created": 1492114403.0, "created_utc": 1492085603.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_654ste", "likes": null, "replies": "", "user_reports": [], "id": "dg7jseo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "landsharkxx", "parent_id": "t3_654ste", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "If you want to major in Biology, I'd highly suggest that you at least get a masters degree. I'm planning on getting a PhD but I'm still in undergrad right now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you want to major in Biology, I&amp;#39;d highly suggest that you at least get a masters degree. I&amp;#39;m planning on getting a PhD but I&amp;#39;m still in undergrad right now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dg7jseo", "score_hidden": false, "stickied": false, "created": 1492119500.0, "created_utc": 1492090700.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_654ste", "likes": null, "replies": "", "user_reports": [], "id": "dg8js2j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Zooloretti", "parent_id": "t3_654ste", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Investigate industries tangentially related as well, like aquaculture, agriculture, etc. Tons more jobs in plant science than in botany, for example. More in clinical micro than academic micro. Integrated pest management is more marketable than entomology.\n\nBe very very sensible in your choice of college. If you want to go into academia you need to be a rockstar with a perfect pedigree at the very least.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Investigate industries tangentially related as well, like aquaculture, agriculture, etc. Tons more jobs in plant science than in botany, for example. More in clinical micro than academic micro. Integrated pest management is more marketable than entomology.&lt;/p&gt;\n\n&lt;p&gt;Be very very sensible in your choice of college. If you want to go into academia you need to be a rockstar with a perfect pedigree at the very least.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dg8js2j", "score_hidden": false, "stickied": false, "created": 1492161687.0, "created_utc": 1492132887.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]