[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "biology", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title suggests I am about to be a college graduate looking to enter the workforce of the biotechnology industry. I have over a years worth of wet lab experience working with cell culture and immune cell seperation from human blood samples as well as human tissue sample processing and cryopreservation. I am not sure what career path I want to pursue in the future so I want to gain experience and work off some of my student loans. It seems most seamless and appropriate for me to look for research associate positions or lab tech jobs with biopharma and biomedical companies. I do not know where this will lead in the future but seems likes a good place to gain technical experience and a grasp for the operations of biotechnology companies.&lt;/p&gt;\n\n&lt;p&gt;I am current working on sending out applications to individual companies myself through LinkedIn and Company websites. I am also working with two recruiters from Kelly services and Atrix technologies. Any one use these recruiting services and have anything to say about them? I am a little apprehensive to use them.&lt;/p&gt;\n\n&lt;p&gt;I have researched online and know that for career advancement I will need to get an advanced degree of some kind in a few years. I am looking for advice from those in the biotech field on good entry-level positions I should seek other than what I am already pursuing, what is a good advance degree to pursue for career options after I complete it, and anything else you would like to tell a young 22 year old on how to have a successful career.&lt;/p&gt;\n\n&lt;p&gt;Thanks for any advice!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "As the title suggests I am about to be a college graduate looking to enter the workforce of the biotechnology industry. I have over a years worth of wet lab experience working with cell culture and immune cell seperation from human blood samples as well as human tissue sample processing and cryopreservation. I am not sure what career path I want to pursue in the future so I want to gain experience and work off some of my student loans. It seems most seamless and appropriate for me to look for research associate positions or lab tech jobs with biopharma and biomedical companies. I do not know where this will lead in the future but seems likes a good place to gain technical experience and a grasp for the operations of biotechnology companies.\n\nI am current working on sending out applications to individual companies myself through LinkedIn and Company websites. I am also working with two recruiters from Kelly services and Atrix technologies. Any one use these recruiting services and have anything to say about them? I am a little apprehensive to use them.\n\nI have researched online and know that for career advancement I will need to get an advanced degree of some kind in a few years. I am looking for advice from those in the biotech field on good entry-level positions I should seek other than what I am already pursuing, what is a good advance degree to pursue for career options after I complete it, and anything else you would like to tell a young 22 year old on how to have a successful career.\n\nThanks for any advice!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "discussion", "id": "65oazs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 27, "report_reasons": null, "author": "BROMELO_BIO", "saved": false, "mod_reports": [], "name": "t3_65oazs", "subreddit_name_prefixed": "r/biology", "approved_by": null, "over_18": false, "domain": "self.biology", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn7", "edited": false, "link_flair_css_class": "discussion", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/biology/comments/65oazs/i_am_a_soontobe_college_graduate_with_a_bs_in/", "num_reports": null, "locked": false, "stickied": false, "created": 1492362936.0, "url": "https://www.reddit.com/r/biology/comments/65oazs/i_am_a_soontobe_college_graduate_with_a_bs_in/", "author_flair_text": null, "quarantine": false, "title": "I am a soon-to-be college graduate with a BS in biology with a minor in biochemistry looking for early career advice in the biotechnology industry or any promising industry with potential for a longterm career.", "created_utc": 1492334136.0, "distinguished": null, "media": null, "upvote_ratio": 0.8, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 27}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": "", "user_reports": [], "id": "dgcg0td", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "heybingbong", "parent_id": "t1_dgcd2x0", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Sorry to bust your chops on this but do you have any examples of those positions?\n\nAlso, I think it's an idealized notion that companies will pay for your continued education in this field. There is not a shortage of PhDs looking for jobs in biotech, so it wouldn't make a lot of sense for a company to have you go to school on their dime when they could just hire someone at a competetive wage. They may pay for you to get an MBA while you're working, but certainly not an academic focused degree.\n\nAgain, that's just my experience, take it as you will.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry to bust your chops on this but do you have any examples of those positions?&lt;/p&gt;\n\n&lt;p&gt;Also, I think it&amp;#39;s an idealized notion that companies will pay for your continued education in this field. There is not a shortage of PhDs looking for jobs in biotech, so it wouldn&amp;#39;t make a lot of sense for a company to have you go to school on their dime when they could just hire someone at a competetive wage. They may pay for you to get an MBA while you&amp;#39;re working, but certainly not an academic focused degree.&lt;/p&gt;\n\n&lt;p&gt;Again, that&amp;#39;s just my experience, take it as you will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgcg0td", "score_hidden": false, "stickied": false, "created": 1492399448.0, "created_utc": 1492370648.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcd2x0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CaptaindeNewt", "parent_id": "t1_dgcbm8q", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I think it depends on the company, entry level positions I've seen have been called scientists jobs and only require a bachelors.  But certainly advanced degrees are required for most positions other than those of the lowest level. The company will probably pay for those degrees later if OP is lucky and wants to move up the company ladder.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it depends on the company, entry level positions I&amp;#39;ve seen have been called scientists jobs and only require a bachelors.  But certainly advanced degrees are required for most positions other than those of the lowest level. The company will probably pay for those degrees later if OP is lucky and wants to move up the company ladder.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgcd2x0", "score_hidden": false, "stickied": false, "created": 1492395512.0, "created_utc": 1492366712.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcbm8q", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "heybingbong", "parent_id": "t1_dgc1r2g", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I don't think this is true , generally Scientist positions require a Master's or PhD with an appropriate amount of experience in what the position entails.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think this is true , generally Scientist positions require a Master&amp;#39;s or PhD with an appropriate amount of experience in what the position entails.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgcbm8q", "score_hidden": false, "stickied": false, "created": 1492393576.0, "created_utc": 1492364776.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc1r2g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "CaptaindeNewt", "parent_id": "t3_65oazs", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "It looks like big pharma is going to be your friend here, you should be able to get a Scientist 1 type job at places like you mentioned. I would also consider relocation, unsure where you are but a lot of big biotech is in the Boston/New England area. You could also check out contractor possitions at those biopharma and biotech places, it's a shorter commitment and they'll usually offer you a full time position at the end. That way you can feel it out and see how you like it before making more of a commitment. Good luck in all this though!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It looks like big pharma is going to be your friend here, you should be able to get a Scientist 1 type job at places like you mentioned. I would also consider relocation, unsure where you are but a lot of big biotech is in the Boston/New England area. You could also check out contractor possitions at those biopharma and biotech places, it&amp;#39;s a shorter commitment and they&amp;#39;ll usually offer you a full time position at the end. That way you can feel it out and see how you like it before making more of a commitment. Good luck in all this though!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgc1r2g", "score_hidden": false, "stickied": false, "created": 1492379723.0, "created_utc": 1492350923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": "", "user_reports": [], "id": "dgc4wp6", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Airekpublius", "parent_id": "t3_65oazs", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "In my experience, the ceiling with a BS will become fairly evident early on in your career.  That is not to say you can't have a successful career and even advance in certain companies or career fields with a BS and a considerable amount of experience.  I would suggest looking at least at a MS. A PhD sounds good, but can sometimes inhibit job prospects plus the opportunity cost of giving up 4 years of potential earning should also be considered.  Whatever field you end up in, computer science and bioinformatics is going to be driving growth, in terms of labor needs.  Companies can always find a pool of labor for people that can do straightforward wet lab work, but someone with computer/coding skills and biology knowledge will be able to command a premium.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In my experience, the ceiling with a BS will become fairly evident early on in your career.  That is not to say you can&amp;#39;t have a successful career and even advance in certain companies or career fields with a BS and a considerable amount of experience.  I would suggest looking at least at a MS. A PhD sounds good, but can sometimes inhibit job prospects plus the opportunity cost of giving up 4 years of potential earning should also be considered.  Whatever field you end up in, computer science and bioinformatics is going to be driving growth, in terms of labor needs.  Companies can always find a pool of labor for people that can do straightforward wet lab work, but someone with computer/coding skills and biology knowledge will be able to command a premium.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgc4wp6", "score_hidden": false, "stickied": false, "created": 1492384634.0, "created_utc": 1492355834.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": "", "user_reports": [], "id": "dgcdii3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "heybingbong", "parent_id": "t3_65oazs", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I think in biotech you should be looking for Research Associate or Lab Tech positions. Right now it's more important to just get your foot in the door, gain a few bullet points on your resume, and meet some people. People hop around in this industry and it's important to make yourself known as a hard worker who is willing to learn new things.\n\nPersonally, I think a RA position will give you a wider range of experience and better access to someone who could write you a letter of rec for when you apply for a master's or phd. However, the pay may cap off at a certain point and you will need to go back to school to surpass that. I would recommend getting some programming and data analysis skills under your belt as that will set you apart from the other wet lab folk.\n\nIf you're just looking to pay off some debt over the next few years then a tech job may pay better (not by much), but you're most likely going to be stuck doing the same thing every day with little room for advancement unless you decide to jump in line with all of the other people who are hoping to bump up to a management position. I do not recommend this unless you happen to be at a small company because there are generations of people with wider networks than you who are desperately trying to do the same thing.\n\nThis sounds pessimistic but I think it's a hard lesson I've learned: remember that it's easy to get stuck chasing the corporate carrot. Taking home an incrementally higher paycheck once a year will not feel as good as achieving a goal you set for yourself. Think 5-10 years ahead and try to figure out what you want to achieve with your career and position yourself to get there.\n\nAlso, wherever you end up try to gain knowledge about the industry itself, not just the tasks you're performing. Anyone can transfer tiny bits of liquid from one tube to the next, but not everyone can tell you why. Learn what the company is trying to achieve and what the challenges are, whether it's clinical demand, logistics, regulation, etc. Learn who your competetors are and how their product differs from yours. It's easy to be separated from these things in an entry level position but seeking out this information will make you more valuable to the company.\n\nI'm kind of just spouting stuff out now, but that's what I've learned so far in my tiny part of this industry. Hope that helps!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think in biotech you should be looking for Research Associate or Lab Tech positions. Right now it&amp;#39;s more important to just get your foot in the door, gain a few bullet points on your resume, and meet some people. People hop around in this industry and it&amp;#39;s important to make yourself known as a hard worker who is willing to learn new things.&lt;/p&gt;\n\n&lt;p&gt;Personally, I think a RA position will give you a wider range of experience and better access to someone who could write you a letter of rec for when you apply for a master&amp;#39;s or phd. However, the pay may cap off at a certain point and you will need to go back to school to surpass that. I would recommend getting some programming and data analysis skills under your belt as that will set you apart from the other wet lab folk.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re just looking to pay off some debt over the next few years then a tech job may pay better (not by much), but you&amp;#39;re most likely going to be stuck doing the same thing every day with little room for advancement unless you decide to jump in line with all of the other people who are hoping to bump up to a management position. I do not recommend this unless you happen to be at a small company because there are generations of people with wider networks than you who are desperately trying to do the same thing.&lt;/p&gt;\n\n&lt;p&gt;This sounds pessimistic but I think it&amp;#39;s a hard lesson I&amp;#39;ve learned: remember that it&amp;#39;s easy to get stuck chasing the corporate carrot. Taking home an incrementally higher paycheck once a year will not feel as good as achieving a goal you set for yourself. Think 5-10 years ahead and try to figure out what you want to achieve with your career and position yourself to get there.&lt;/p&gt;\n\n&lt;p&gt;Also, wherever you end up try to gain knowledge about the industry itself, not just the tasks you&amp;#39;re performing. Anyone can transfer tiny bits of liquid from one tube to the next, but not everyone can tell you why. Learn what the company is trying to achieve and what the challenges are, whether it&amp;#39;s clinical demand, logistics, regulation, etc. Learn who your competetors are and how their product differs from yours. It&amp;#39;s easy to be separated from these things in an entry level position but seeking out this information will make you more valuable to the company.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m kind of just spouting stuff out now, but that&amp;#39;s what I&amp;#39;ve learned so far in my tiny part of this industry. Hope that helps!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgcdii3", "score_hidden": false, "stickied": false, "created": 1492396091.0, "created_utc": 1492367291.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": "", "user_reports": [], "id": "dgcw7aw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ksndjsosmwmtixnsn3", "parent_id": "t1_dgcjes2", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I was told the exact same thing. That a masters in biology is near useless, basically just equivalent to like 2 yrs of experience. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was told the exact same thing. That a masters in biology is near useless, basically just equivalent to like 2 yrs of experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgcw7aw", "score_hidden": false, "stickied": false, "created": 1492420933.0, "created_utc": 1492392133.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjes2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Reaverax", "parent_id": "t1_dgc2i0w", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I disagree with this based solely on the fact that after working at a small company for a few months (after graduating with my BS), I had an intern under me that had her masters (in a relevant field.)\n\nShe eventually was hired full time, but was paid the same amount I was being paid.\n\nWhen I was an undergrad, I also remember my advisor (who had a phd in cell bio) telling me that getting a masters in biology was useless. I now understand why. If you want to commit to doing a ton of work for not a lot of money but with the chance of getting more in the future, go for your phd. If you want to start making money in the field, skip the masters and just start working, you will be doing the same work whether you have the masters or not.\n\nMy advice to the OP is to just get out there and make friends in the field, by getting a low level job or otherwise. People always told me networking was the easiest way to get a job and I didn't realize how true it was until my boss started asking me to get my friends to apply to our company.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree with this based solely on the fact that after working at a small company for a few months (after graduating with my BS), I had an intern under me that had her masters (in a relevant field.)&lt;/p&gt;\n\n&lt;p&gt;She eventually was hired full time, but was paid the same amount I was being paid.&lt;/p&gt;\n\n&lt;p&gt;When I was an undergrad, I also remember my advisor (who had a phd in cell bio) telling me that getting a masters in biology was useless. I now understand why. If you want to commit to doing a ton of work for not a lot of money but with the chance of getting more in the future, go for your phd. If you want to start making money in the field, skip the masters and just start working, you will be doing the same work whether you have the masters or not.&lt;/p&gt;\n\n&lt;p&gt;My advice to the OP is to just get out there and make friends in the field, by getting a low level job or otherwise. People always told me networking was the easiest way to get a job and I didn&amp;#39;t realize how true it was until my boss started asking me to get my friends to apply to our company.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgcjes2", "score_hidden": false, "stickied": false, "created": 1492403837.0, "created_utc": 1492375037.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgc2i0w", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "landsharkxx", "parent_id": "t3_65oazs", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I'd highly suggest that you go to grad school. Maybe for just a masters. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d highly suggest that you go to grad school. Maybe for just a masters. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgc2i0w", "score_hidden": false, "stickied": false, "created": 1492380986.0, "created_utc": 1492352186.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": "", "user_reports": [], "id": "dgc2c1i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "derdody", "parent_id": "t3_65oazs", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I have the same degree as you but I did not use it until three years ago (I'm 53).  What I did was to volunteer at the place wanted to work (DNA sequencing). They took me in and in two week offered me a full time job.  In short, try volunteering at different places to get an idea of what you want to do. Most biolabs have plenty of routine work that a volunteer can start on and your offer to volunteer should be attractive to them = Win, win for both parties.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have the same degree as you but I did not use it until three years ago (I&amp;#39;m 53).  What I did was to volunteer at the place wanted to work (DNA sequencing). They took me in and in two week offered me a full time job.  In short, try volunteering at different places to get an idea of what you want to do. Most biolabs have plenty of routine work that a volunteer can start on and your offer to volunteer should be attractive to them = Win, win for both parties.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgc2c1i", "score_hidden": false, "stickied": false, "created": 1492380717.0, "created_utc": 1492351917.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65oazs", "likes": null, "replies": "", "user_reports": [], "id": "dgcadps", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Artfrost", "parent_id": "t3_65oazs", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Use recruiting services! Try aerotek. It really depends on the area and who your recruiter is but it does give you an edge. These companies have relationships with the companies you want to work for. They essentially sell you to these companies. I know aerotek has a scientific division, I recommend searching for one in your area and giving them a call. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Use recruiting services! Try aerotek. It really depends on the area and who your recruiter is but it does give you an edge. These companies have relationships with the companies you want to work for. They essentially sell you to these companies. I know aerotek has a scientific division, I recommend searching for one in your area and giving them a call. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgcadps", "score_hidden": false, "stickied": false, "created": 1492391944.0, "created_utc": 1492363144.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]