[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "biology", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I&amp;#39;m an academic bioengineer and plant scientist. I&amp;#39;ve started a new subreddit &lt;a href=\"https://www.reddit.com/r/FutureBio/\"&gt;r/FutureBio&lt;/a&gt; to bring together whoever&amp;#39;s interested to discuss the future culture and working practices of Biology. This could include breaking down the barriers between professional and non-professional, new participatory research practices and open-access culture. Or maybe that&amp;#39;s a terrible idea. What do you think?&lt;/p&gt;\n\n&lt;p&gt;I hope this doesn&amp;#39;t count as spamming. I thought it might be of particular interest to members of this community, and I&amp;#39;m happy to answer any questions. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, I'm an academic bioengineer and plant scientist. I've started a new subreddit [r/FutureBio] (https://www.reddit.com/r/FutureBio/) to bring together whoever's interested to discuss the future culture and working practices of Biology. This could include breaking down the barriers between professional and non-professional, new participatory research practices and open-access culture. Or maybe that's a terrible idea. What do you think?\n\nI hope this doesn't count as spamming. I thought it might be of particular interest to members of this community, and I'm happy to answer any questions. ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "question", "id": "65r2fv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "bavarian_blunders", "saved": false, "mod_reports": [], "name": "t3_65r2fv", "subreddit_name_prefixed": "r/biology", "approved_by": null, "over_18": false, "domain": "self.biology", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn7", "edited": false, "link_flair_css_class": "question", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/biology/comments/65r2fv/what_will_biology_look_like_in_the_future/", "num_reports": null, "locked": false, "stickied": false, "created": 1492401566.0, "url": "https://www.reddit.com/r/biology/comments/65r2fv/what_will_biology_look_like_in_the_future/", "author_flair_text": null, "quarantine": false, "title": "What will Biology look like in the Future?", "created_utc": 1492372766.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65r2fv", "likes": null, "replies": "", "user_reports": [], "id": "dgco968", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "laziestindian", "parent_id": "t3_65r2fv", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I do believe and hope science in general becomes more digestible and understandable to the public and it's part of why there has been a strong push to publish in open-access journals and things like Ted talks. This comes with both good and bad things, the media loves to oversimplify and overhype. Education would also need to change a lot, at least in the US it seems that prior to college (and sometimes even at college) critical thought is not taught or encouraged. Critical thought and analysis are at the basis of all science and necessary to properly understand it.\n\nWhat I don't believe will happen is \"participatory research\". Scientists play it close to the chest with unpublished data for good reason, getting \"scooped\" does not feel great and can have other consequences in terms of funding and a career. These people looking at \"biohacking\" seem more likely to accidentally become bioterrorists than discover something meaningful. An untrained person in a lab is pretty much a walking hazard.\n\nAnother change I hope to see is less toxic lab environments, there are few if any scientists who haven't been in one and it's very detrimental even if the lab published good papers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do believe and hope science in general becomes more digestible and understandable to the public and it&amp;#39;s part of why there has been a strong push to publish in open-access journals and things like Ted talks. This comes with both good and bad things, the media loves to oversimplify and overhype. Education would also need to change a lot, at least in the US it seems that prior to college (and sometimes even at college) critical thought is not taught or encouraged. Critical thought and analysis are at the basis of all science and necessary to properly understand it.&lt;/p&gt;\n\n&lt;p&gt;What I don&amp;#39;t believe will happen is &amp;quot;participatory research&amp;quot;. Scientists play it close to the chest with unpublished data for good reason, getting &amp;quot;scooped&amp;quot; does not feel great and can have other consequences in terms of funding and a career. These people looking at &amp;quot;biohacking&amp;quot; seem more likely to accidentally become bioterrorists than discover something meaningful. An untrained person in a lab is pretty much a walking hazard.&lt;/p&gt;\n\n&lt;p&gt;Another change I hope to see is less toxic lab environments, there are few if any scientists who haven&amp;#39;t been in one and it&amp;#39;s very detrimental even if the lab published good papers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgco968", "score_hidden": false, "stickied": false, "created": 1492410194.0, "created_utc": 1492381394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}]