[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "biology", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been working at a genetics/molecular biology lab for about a year now and over the last couple of months I have come to the realization that the lab is just not for me. I enjoy the theory behind much of the science and I definitely view the work as important, but the actual lab work itself I just cannot find any enthusiasm for. This is the second lab I&amp;#39;ve worked for where I&amp;#39;ve begun to feel this way, so I&amp;#39;m fairly certain that the issue is not where I am working but the work itself. &lt;/p&gt;\n\n&lt;p&gt;I am beginning to strongly feel that I need to move away from the lab and into a new career, but I am not even sure where to begin. I know I want to stay in a science related field, but I know I don&amp;#39;t want to be a pipette-jockey anymore. Problem is, I feel like this is the only thing that my education really prepared me for (I have a B.S. in Biochemistry), and now that it is not working out I feel a little lost. I was originally planning to work in this lab for a while while I figured out my grad school plans, but given my burnout in the lab I&amp;#39;m not so sure that&amp;#39;s a good idea anymore.&lt;/p&gt;\n\n&lt;p&gt;I was wondering if any of you have found yourself in a similar position and if anyone has any advice to offer.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: Love science but hate the lab. What now?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have been working at a genetics/molecular biology lab for about a year now and over the last couple of months I have come to the realization that the lab is just not for me. I enjoy the theory behind much of the science and I definitely view the work as important, but the actual lab work itself I just cannot find any enthusiasm for. This is the second lab I've worked for where I've begun to feel this way, so I'm fairly certain that the issue is not where I am working but the work itself. \n\nI am beginning to strongly feel that I need to move away from the lab and into a new career, but I am not even sure where to begin. I know I want to stay in a science related field, but I know I don't want to be a pipette-jockey anymore. Problem is, I feel like this is the only thing that my education really prepared me for (I have a B.S. in Biochemistry), and now that it is not working out I feel a little lost. I was originally planning to work in this lab for a while while I figured out my grad school plans, but given my burnout in the lab I'm not so sure that's a good idea anymore.\n\nI was wondering if any of you have found yourself in a similar position and if anyone has any advice to offer.\n\ntl;dr: Love science but hate the lab. What now?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "question", "id": "65xe0k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 7, "report_reasons": null, "author": "DegenerateChemist", "saved": false, "mod_reports": [], "name": "t3_65xe0k", "subreddit_name_prefixed": "r/biology", "approved_by": null, "over_18": false, "domain": "self.biology", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qhn7", "edited": false, "link_flair_css_class": "question", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/biology/comments/65xe0k/science_careers_outside_of_the_lab/", "num_reports": null, "locked": false, "stickied": false, "created": 1492482694.0, "url": "https://www.reddit.com/r/biology/comments/65xe0k/science_careers_outside_of_the_lab/", "author_flair_text": null, "quarantine": false, "title": "Science Careers Outside of the Lab?", "created_utc": 1492453894.0, "distinguished": null, "media": null, "upvote_ratio": 0.64, "num_comments": 9, "visited": false, "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": "", "user_reports": [], "id": "dgdzl03", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "comeupoutthewahta", "parent_id": "t1_dgdxeha", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Try r/bioinformatics. They're far more knowledgeable about comp bio than I am, and some of them may have made a similar switch already. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try &lt;a href=\"/r/bioinformatics\"&gt;r/bioinformatics&lt;/a&gt;. They&amp;#39;re far more knowledgeable about comp bio than I am, and some of them may have made a similar switch already. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgdzl03", "score_hidden": false, "stickied": false, "created": 1492486516.0, "created_utc": 1492457716.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdxeha", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DegenerateChemist", "parent_id": "t1_dgdx7rd", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "I definitely still enjoy bio (though I prefer chemistry/biochemistry a bit more). Any idea where I might be able to find some resources on making the transition?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I definitely still enjoy bio (though I prefer chemistry/biochemistry a bit more). Any idea where I might be able to find some resources on making the transition?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgdxeha", "score_hidden": false, "stickied": false, "created": 1492484035.0, "created_utc": 1492455235.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdx7rd", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "comeupoutthewahta", "parent_id": "t3_65xe0k", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Consider computational biology. You work in an office pretty much all day, you'll still be working on topics relating to what you studied (I assume you still enjoy biology), and you'll be far more productive since computational work allows you to publish more often. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consider computational biology. You work in an office pretty much all day, you&amp;#39;ll still be working on topics relating to what you studied (I assume you still enjoy biology), and you&amp;#39;ll be far more productive since computational work allows you to publish more often. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgdx7rd", "score_hidden": false, "stickied": false, "created": 1492483822.0, "created_utc": 1492455022.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": "", "user_reports": [], "id": "dge9311", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "egotepedicabo", "parent_id": "t3_65xe0k", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "You could consider genetic counseling, if you want a job with more social interaction and less lab work. Not my area but I know a genetic counselor and she loves her job. There's a variety of specialties: cancer, teratogens, etc. You'd have to get a master's in it, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could consider genetic counseling, if you want a job with more social interaction and less lab work. Not my area but I know a genetic counselor and she loves her job. There&amp;#39;s a variety of specialties: cancer, teratogens, etc. You&amp;#39;d have to get a master&amp;#39;s in it, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dge9311", "score_hidden": false, "stickied": false, "created": 1492497753.0, "created_utc": 1492468953.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": "", "user_reports": [], "id": "dged5vf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Agwtis27", "parent_id": "t3_65xe0k", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Hi! So some people have mentioned other positions that still get you behind a desk or computer.  If you would like to broaden your position get away from the bench but also still include biochem, I suggest searching for positions in an ecology or agriculture lab.  During field seasons, you are out with a crew collecting samples, but you bring those samples back to the lab to analyze during the off season. Biochemistry is a vital component of these fields, but often many of the researchers don't have the expertise to design and run these experiments. Off the top of my head, I can think of one lab that is trying to track antibiotic uptake by plants from livestock manure, another lab looking at chemical resistance to herbivorous insects in forest ecosystems, and even another lab trying to understand nutritional content in staple crops as a factor of soil quality. You are still using your degree, but much of the work and data collection is away from an actual lab setting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! So some people have mentioned other positions that still get you behind a desk or computer.  If you would like to broaden your position get away from the bench but also still include biochem, I suggest searching for positions in an ecology or agriculture lab.  During field seasons, you are out with a crew collecting samples, but you bring those samples back to the lab to analyze during the off season. Biochemistry is a vital component of these fields, but often many of the researchers don&amp;#39;t have the expertise to design and run these experiments. Off the top of my head, I can think of one lab that is trying to track antibiotic uptake by plants from livestock manure, another lab looking at chemical resistance to herbivorous insects in forest ecosystems, and even another lab trying to understand nutritional content in staple crops as a factor of soil quality. You are still using your degree, but much of the work and data collection is away from an actual lab setting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dged5vf", "score_hidden": false, "stickied": false, "created": 1492503045.0, "created_utc": 1492474245.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": "", "user_reports": [], "id": "dgefgea", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ypres", "parent_id": "t3_65xe0k", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "You could try patent law (assuming you want some science still) if you're willing to go back to school.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could try patent law (assuming you want some science still) if you&amp;#39;re willing to go back to school.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgefgea", "score_hidden": false, "stickied": false, "created": 1492505903.0, "created_utc": 1492477103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": "", "user_reports": [], "id": "dgeh72d", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "adrift_in_the_bay", "parent_id": "t3_65xe0k", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Have you interacted with any of the non-lab functions (business development, sourcing, project mgmt, legal, etc) at your jobs?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you interacted with any of the non-lab functions (business development, sourcing, project mgmt, legal, etc) at your jobs?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgeh72d", "score_hidden": false, "stickied": false, "created": 1492508086.0, "created_utc": 1492479286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": "", "user_reports": [], "id": "dgekohp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "masonclark9393", "parent_id": "t3_65xe0k", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Hi friend!\n\nYou are not the only person in this boat! I graduated with a B.S. In Environmental Biology in autumn of 2016 with some, but overall limited experience working in a lab. Most of my research experience had been field based and rarely included wet lab work. However, when I did get my hands on a pipette in school and was doing anything genetics, I was so excited to do more of this is graduate school.\n\nThis past August I found myself somehow hired as a research assistant and lab manager in a fungal genetics and molecular biology lab. I explained to the PI that I had little experience, which he liked, and really wanted to get more familiar with genetics and molecular biology techniques.\n\nIn short, I loved the science and the challenge. The lab was a human pathogenic microbiology lab, which I couldn't have had any less experience in, especially because I am a plant-fungal ecologist, so there was a big learning curve for me. I was able to help build the lab to an activity level that supported 2 (soon to be 3) graduate students and 2 undergraduates.\n\nHowever, between the ordering, working with vendors, catching up with the literature and basic molecular biology (which, if you ask me, isn't very basic), presenting, etc., I burned out fast. I was overall pleased with how far I actually got in the lab, and became more attached to the science, but it was too exhausting. Because I was both lab manager and a researcher, I would at first be in lab sometimes 8-12 hours/day because half of my day was lab duty stuff and the other half actually doing the research. \n\nI realized within a few months of working in the lab that this kind of molecular biology isn't for me, and coincidentally, two weeks ago was my last day in the lab. I have been pretty discouraged and feeling lost, too, because when starting in the lab and since then, I was like yes, this is what I want to do. Here in this lab I will find myself as a scientist, become a great geneticist and publish a lot, and feel like all of my hard work as an undergraduate has paid off. This has been faced with great difficulty.\n\nTo date, I know I want to go to graduate school and still want to incorporate genetics and molecular biology in my research. But in the meantime, I am, too, on the hunt for out-of-lab science careers.\n\nIt would be helpful to know what your experiences are in, and generally what are some different types of science you're interested in pursuing as a career. I would like to share with you what types of jobs I have come across and have applied for, but only if they're relevant to your general interests.\n\nYou should PM if you want to commiserate with me our love-hate for the lab and job searching. I could use a friend to talk to in the same position, anyway, just for some feedback and support!\n\nAlso, I think when it comes to working in a lab, it's overall hard to get enthusiastic about the lab work and the science if you're not all with it. On the one hand, I am discouraged by how quickly I burned out on the lab stuff, but on the other hand, had I been in lab where I was really invested in the research, I may have had a better chance sticking it through until grad. school.\n\nSorry this was so long, but I just wanted to share with you the similar situation that I am in. In the lab and in the department, it always felt like everyone around me had their shit together except me. So, to hear your story is a relief that I'm not the only person in this type of science that hates the lab work.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi friend!&lt;/p&gt;\n\n&lt;p&gt;You are not the only person in this boat! I graduated with a B.S. In Environmental Biology in autumn of 2016 with some, but overall limited experience working in a lab. Most of my research experience had been field based and rarely included wet lab work. However, when I did get my hands on a pipette in school and was doing anything genetics, I was so excited to do more of this is graduate school.&lt;/p&gt;\n\n&lt;p&gt;This past August I found myself somehow hired as a research assistant and lab manager in a fungal genetics and molecular biology lab. I explained to the PI that I had little experience, which he liked, and really wanted to get more familiar with genetics and molecular biology techniques.&lt;/p&gt;\n\n&lt;p&gt;In short, I loved the science and the challenge. The lab was a human pathogenic microbiology lab, which I couldn&amp;#39;t have had any less experience in, especially because I am a plant-fungal ecologist, so there was a big learning curve for me. I was able to help build the lab to an activity level that supported 2 (soon to be 3) graduate students and 2 undergraduates.&lt;/p&gt;\n\n&lt;p&gt;However, between the ordering, working with vendors, catching up with the literature and basic molecular biology (which, if you ask me, isn&amp;#39;t very basic), presenting, etc., I burned out fast. I was overall pleased with how far I actually got in the lab, and became more attached to the science, but it was too exhausting. Because I was both lab manager and a researcher, I would at first be in lab sometimes 8-12 hours/day because half of my day was lab duty stuff and the other half actually doing the research. &lt;/p&gt;\n\n&lt;p&gt;I realized within a few months of working in the lab that this kind of molecular biology isn&amp;#39;t for me, and coincidentally, two weeks ago was my last day in the lab. I have been pretty discouraged and feeling lost, too, because when starting in the lab and since then, I was like yes, this is what I want to do. Here in this lab I will find myself as a scientist, become a great geneticist and publish a lot, and feel like all of my hard work as an undergraduate has paid off. This has been faced with great difficulty.&lt;/p&gt;\n\n&lt;p&gt;To date, I know I want to go to graduate school and still want to incorporate genetics and molecular biology in my research. But in the meantime, I am, too, on the hunt for out-of-lab science careers.&lt;/p&gt;\n\n&lt;p&gt;It would be helpful to know what your experiences are in, and generally what are some different types of science you&amp;#39;re interested in pursuing as a career. I would like to share with you what types of jobs I have come across and have applied for, but only if they&amp;#39;re relevant to your general interests.&lt;/p&gt;\n\n&lt;p&gt;You should PM if you want to commiserate with me our love-hate for the lab and job searching. I could use a friend to talk to in the same position, anyway, just for some feedback and support!&lt;/p&gt;\n\n&lt;p&gt;Also, I think when it comes to working in a lab, it&amp;#39;s overall hard to get enthusiastic about the lab work and the science if you&amp;#39;re not all with it. On the one hand, I am discouraged by how quickly I burned out on the lab stuff, but on the other hand, had I been in lab where I was really invested in the research, I may have had a better chance sticking it through until grad. school.&lt;/p&gt;\n\n&lt;p&gt;Sorry this was so long, but I just wanted to share with you the similar situation that I am in. In the lab and in the department, it always felt like everyone around me had their shit together except me. So, to hear your story is a relief that I&amp;#39;m not the only person in this type of science that hates the lab work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgekohp", "score_hidden": false, "stickied": false, "created": 1492512236.0, "created_utc": 1492483436.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhn7", "removal_reason": null, "link_id": "t3_65xe0k", "likes": null, "replies": "", "user_reports": [], "id": "dgejhy9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "HoboZoo", "parent_id": "t3_65xe0k", "subreddit_name_prefixed": "r/biology", "controversiality": 0, "body": "Teaching, recruiting, editing, side-track into healthcare, etc. You gotta put some work into figuring out what you like.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Teaching, recruiting, editing, side-track into healthcare, etc. You gotta put some work into figuring out what you like.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "biology", "name": "t1_dgejhy9", "score_hidden": false, "stickied": false, "created": 1492510804.0, "created_utc": 1492482004.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]