[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Astronomy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all, I&amp;#39;m applying for a $10,000 grant for my high school astronomy course. As the class is brand new, we have NO equipment. Here&amp;#39;s a list of things I&amp;#39;m putting on our budget sheet for the grant. Let me know what I should add - this is my first year teaching the subject. (I&amp;#39;ve taught literature for two years prior.)&lt;/p&gt;\n\n&lt;p&gt;Universe textbook, 10th edition\n• Solar glasses (50x) to safely view the 2017 total solar eclipse\n• Telescope with tracking\n• Green laser pointer for stargazing\n• Solar filter for telescope to safely observe the Sun\n• Fire syringe\n• Various glass lenses\n• Universe Sandbox V2 \n• Spore\n• Starry Night&lt;/p&gt;\n\n&lt;p&gt;The sky&amp;#39;s the limit with the price (lol). Add on anything and everything. Thanks all!&lt;/p&gt;\n\n&lt;p&gt;ALSO! I remember in college when we studied blackbodies, the professor had us use a device with different &amp;quot;mystery&amp;quot; gasses in the tube. When energized, they lit up, and we used a second device which showed us the blackbody emissions, and we had to determine what element was in the tube. What in the world am I thinking of?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi all, I'm applying for a $10,000 grant for my high school astronomy course. As the class is brand new, we have NO equipment. Here's a list of things I'm putting on our budget sheet for the grant. Let me know what I should add - this is my first year teaching the subject. (I've taught literature for two years prior.)\n\nUniverse textbook, 10th edition\n•\tSolar glasses (50x) to safely view the 2017 total solar eclipse\n•\tTelescope with tracking\n•\tGreen laser pointer for stargazing\n•\tSolar filter for telescope to safely observe the Sun\n•\tFire syringe\n•\tVarious glass lenses\n•\tUniverse Sandbox V2 \n•\tSpore\n•\tStarry Night\n\nThe sky's the limit with the price (lol). Add on anything and everything. Thanks all!\n\nALSO! I remember in college when we studied blackbodies, the professor had us use a device with different \"mystery\" gasses in the tube. When energized, they lit up, and we used a second device which showed us the blackbody emissions, and we had to determine what element was in the tube. What in the world am I thinking of?\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "6504zs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 20, "report_reasons": null, "author": "miatapasta", "saved": false, "mod_reports": [], "name": "t3_6504zs", "subreddit_name_prefixed": "r/Astronomy", "approved_by": null, "over_18": false, "domain": "self.Astronomy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhor", "edited": 1492023239.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Astronomy/comments/6504zs/astronomy_teacher_looking_for_classroom_supplies/", "num_reports": null, "locked": false, "stickied": false, "created": 1492051720.0, "url": "https://www.reddit.com/r/Astronomy/comments/6504zs/astronomy_teacher_looking_for_classroom_supplies/", "author_flair_text": null, "quarantine": false, "title": "Astronomy teacher looking for classroom supplies", "created_utc": 1492022920.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 13, "visited": false, "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": "", "user_reports": [], "id": "dg6lxrw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Bwananabwanana", "parent_id": "t1_dg6fhiv", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Stellarium is an excellent resource", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stellarium is an excellent resource&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg6lxrw", "score_hidden": false, "stickied": false, "created": 1492061939.0, "created_utc": 1492033139.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": "", "user_reports": [], "id": "dg6pdje", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "VXeonix", "parent_id": "t1_dg6fhiv", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Second stellarium! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Second stellarium! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg6pdje", "score_hidden": false, "stickied": false, "created": 1492066163.0, "created_utc": 1492037363.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": "", "user_reports": [], "id": "dg7q328", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MildlyMediocre_", "parent_id": "t1_dg6fhiv", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "I definitely prefer Stellarium over Starry Night. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I definitely prefer Stellarium over Starry Night. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg7q328", "score_hidden": false, "stickied": false, "created": 1492126823.0, "created_utc": 1492098023.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fhiv", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "bobchin_c", "parent_id": "t3_6504zs", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Contact NASA's Night Sky Network. They have lots of kits for teaching astronomy. \n\nDownload Stellarium (free planetarium program for multiple platforms) Stellarium.org", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Contact NASA&amp;#39;s Night Sky Network. They have lots of kits for teaching astronomy. &lt;/p&gt;\n\n&lt;p&gt;Download Stellarium (free planetarium program for multiple platforms) Stellarium.org&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg6fhiv", "score_hidden": false, "stickied": false, "created": 1492054991.0, "created_utc": 1492026191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": "", "user_reports": [], "id": "dg7q16o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ryans1286", "parent_id": "t1_dg7fz0g", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "I've got photos of the observatory on hard drive at home, I'll post them here when I find some good ones. Building the observatory was fun, but it was a major undertaking! The location didn't have existing electricity, so we did it all with hand tools and only occasionally had access to a generator. We built a 12'x12' building with a roll-off roof. The pier holding the imaging telescope is about 1200lbs of concrete, it's about 3'x3'x3' pedestal in the ground with a 6\" cylinder rising up about 6' from the ground. We built the floor around the pier so that the two never touch, thereby eliminating all vibrations. It's pretty solid!\n\nFor power, I'd the the DC adapter for your scope so that you go DC to DC, rather than using an inverter. The scope should run on DC normally, so avoid going from DC (car) to AC (inverter) to DC (telescope). You'll lose less power that way and you'll have less risk of draining your car battery. \n\nBinoculars are great. I emphasize them heavily as a great tool for astronomy.\n\nIf you want to make observation nights part of the class for a grade, I've had the most success by mandating they attend a certain number each semester and just offering one every other week. I've had trouble getting attendance when they're optional, unfortunately. I also do an astronomy club separate from the class that attends the observation nights on their own volition. Together I get a pretty good attendance of about 10-15 students each time I go out.\n\nWhen I first started showing kids the night sky, it definitely helped to make a plan of what you're going to look at. Have alternates in case of a few clouds, trees, light pollution, or lack of interest in that object. Kids love the Moon, any of the planets, Orion Nebula, Andromeda, bright stars, and double stars like Alberio and Mizar. I've had limited success with star clusters and really faint, fuzzy Messier objects (my favorites...). I also spend a good amount of time pointing out constellations and challenging the kids to identify them. Most kids love hearing about the mythology behind constellations, so I memorized a few stories around major constellations each season. I basically try to mimic a good planetarium show, except I use the real sky instead of projected stars. \n\nOne last thing that's working well for me in class is related to reading assignments. I started an online forum for my class where they must ask several good quality questions for each reading assignment and they must provide quality answers to others questions with sources (page numbers, websites, etc.). I've found they do a much better job reading and thinking critically about the text when compared to giving quizzes or discussing in class. As a literature teacher, you may have better ideas on how to get students to read critically, but this has worked well for me\n\nGood luck! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve got photos of the observatory on hard drive at home, I&amp;#39;ll post them here when I find some good ones. Building the observatory was fun, but it was a major undertaking! The location didn&amp;#39;t have existing electricity, so we did it all with hand tools and only occasionally had access to a generator. We built a 12&amp;#39;x12&amp;#39; building with a roll-off roof. The pier holding the imaging telescope is about 1200lbs of concrete, it&amp;#39;s about 3&amp;#39;x3&amp;#39;x3&amp;#39; pedestal in the ground with a 6&amp;quot; cylinder rising up about 6&amp;#39; from the ground. We built the floor around the pier so that the two never touch, thereby eliminating all vibrations. It&amp;#39;s pretty solid!&lt;/p&gt;\n\n&lt;p&gt;For power, I&amp;#39;d the the DC adapter for your scope so that you go DC to DC, rather than using an inverter. The scope should run on DC normally, so avoid going from DC (car) to AC (inverter) to DC (telescope). You&amp;#39;ll lose less power that way and you&amp;#39;ll have less risk of draining your car battery. &lt;/p&gt;\n\n&lt;p&gt;Binoculars are great. I emphasize them heavily as a great tool for astronomy.&lt;/p&gt;\n\n&lt;p&gt;If you want to make observation nights part of the class for a grade, I&amp;#39;ve had the most success by mandating they attend a certain number each semester and just offering one every other week. I&amp;#39;ve had trouble getting attendance when they&amp;#39;re optional, unfortunately. I also do an astronomy club separate from the class that attends the observation nights on their own volition. Together I get a pretty good attendance of about 10-15 students each time I go out.&lt;/p&gt;\n\n&lt;p&gt;When I first started showing kids the night sky, it definitely helped to make a plan of what you&amp;#39;re going to look at. Have alternates in case of a few clouds, trees, light pollution, or lack of interest in that object. Kids love the Moon, any of the planets, Orion Nebula, Andromeda, bright stars, and double stars like Alberio and Mizar. I&amp;#39;ve had limited success with star clusters and really faint, fuzzy Messier objects (my favorites...). I also spend a good amount of time pointing out constellations and challenging the kids to identify them. Most kids love hearing about the mythology behind constellations, so I memorized a few stories around major constellations each season. I basically try to mimic a good planetarium show, except I use the real sky instead of projected stars. &lt;/p&gt;\n\n&lt;p&gt;One last thing that&amp;#39;s working well for me in class is related to reading assignments. I started an online forum for my class where they must ask several good quality questions for each reading assignment and they must provide quality answers to others questions with sources (page numbers, websites, etc.). I&amp;#39;ve found they do a much better job reading and thinking critically about the text when compared to giving quizzes or discussing in class. As a literature teacher, you may have better ideas on how to get students to read critically, but this has worked well for me&lt;/p&gt;\n\n&lt;p&gt;Good luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg7q16o", "score_hidden": false, "stickied": false, "created": 1492126769.0, "created_utc": 1492097969.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7fz0g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "miatapasta", "parent_id": "t1_dg75oiw", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Thank you so much for the detailed response! I will read through this likely again and again. I love the idea of a permanent observatory. I'm a handyman by hobby and this is right up my alley. Do you have any photos of the structure? \n\nAs for a power source, I have a pretty rugged off road Subaru that I'll be using with a DC/AC power inverter hooked up.\n\nGood call on the binoculars, too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for the detailed response! I will read through this likely again and again. I love the idea of a permanent observatory. I&amp;#39;m a handyman by hobby and this is right up my alley. Do you have any photos of the structure? &lt;/p&gt;\n\n&lt;p&gt;As for a power source, I have a pretty rugged off road Subaru that I&amp;#39;ll be using with a DC/AC power inverter hooked up.&lt;/p&gt;\n\n&lt;p&gt;Good call on the binoculars, too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg7fz0g", "score_hidden": false, "stickied": false, "created": 1492113459.0, "created_utc": 1492084659.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg75oiw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ryans1286", "parent_id": "t3_6504zs", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "The mystery tubes you're looking for are called \"spectrum tubes\" and are available from many sources, mine are from Flinn Scientific. You'll want some diffraction gratings to look at the spectra, there are some cheap spectrometers  you can buy that work okay and can tell you the specific wavelengths for each emission line. BTW, you're looking at the substances emission spectrum, not blackbody radiation (that's the predicted emission from a substance of a certain temperature; the two ideas are tangentially related). In astronomy, blackbody radiation is more useful for determining the temperature of stars based on their color.\n\nYou can easily spend many thousands of dollars on a telescope and eyepieces. As other's have said, don't skimp on crappy eyepieces; you'll just be disappointed. A small catadioptric scope is probably what you want, something in the 4\"-8\" aperture range. I like a fork mount for the scope, not those one sided things, but that's just me. As for filters, a neutral density is good for the Moon. Kids love the colored filters for looking at the Moon too but they're less useful in my opinion.\n\nYou'll probably also need a power source. I recommend building your own from a marine deep cycle battery. You'll get much more power time out of it for less money. You're call though. You can find instructions for building one by searching online. It's easy enough.\n\nMy solar filters came from Thousand Oaks Optical, they're very nice and I highly recommend the company. \n\nI think a few pairs of binoculars would be nice to have. While some kids are looking through your telescope, the others can look through binoculars. My students enjoy \"discovering\" Messier objects while scanning the night sky. \n\nI'd get a field map of the Moon and a night sky handbook to help you out. There are many available. I like Sky Guide. I've had it since I was a kid and still use it regularly. There are also some books out there that give lists of good objects to view each season, which can be helpful.\n\nI bought some of those cell phone holders so kids could take pictures of the Moon through my telescopes. They don't work as well as I'd hoped. Each phone has the camera in a slightly different location and requires you to re-align the holder. It's tedious to do in the dark. I've had better success with one person holding the camera and the other person tapping the screen to take the photo. Builds teamwork too!\n\nI think an incredibly valuable use of your time/money would be to go to a few local Astronomy club meetings and star parties. You'll start to get a feel for what works and what doesn't when letting people look through telescopes, especially if you're new to leading that sort of thing. Learning the constellations each season is also a valuable skill that you should start now (if you can't do this already). \n\nI recommend that you look into different virtual labs and simulations that you can do with the kids. They get tired and overloaded quickly if you lecture too much. I know from experience. There's lots of good stuff out there from various universities that you can use at the high school level. Some I like, some I don't, most are free. Search using queries like \"galaxy classification lab\" or \"binary star lab\" will get you in the right direction. I usually write my own directions, lab handouts, and questions for these because most of the time the ones that come with it are more college-level than my kids can handle. \n\nAbout me: I teach astronomy and physics in high school. I built a permanent observatory at my school where we do astrophotography and I regularly take kids out to do observations at night. Previously, I worked at an astronomy camp for 3 years where 3-5 nights a week I was showing kids stuff through telescopes and doing hands on physics and astronomy labs. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The mystery tubes you&amp;#39;re looking for are called &amp;quot;spectrum tubes&amp;quot; and are available from many sources, mine are from Flinn Scientific. You&amp;#39;ll want some diffraction gratings to look at the spectra, there are some cheap spectrometers  you can buy that work okay and can tell you the specific wavelengths for each emission line. BTW, you&amp;#39;re looking at the substances emission spectrum, not blackbody radiation (that&amp;#39;s the predicted emission from a substance of a certain temperature; the two ideas are tangentially related). In astronomy, blackbody radiation is more useful for determining the temperature of stars based on their color.&lt;/p&gt;\n\n&lt;p&gt;You can easily spend many thousands of dollars on a telescope and eyepieces. As other&amp;#39;s have said, don&amp;#39;t skimp on crappy eyepieces; you&amp;#39;ll just be disappointed. A small catadioptric scope is probably what you want, something in the 4&amp;quot;-8&amp;quot; aperture range. I like a fork mount for the scope, not those one sided things, but that&amp;#39;s just me. As for filters, a neutral density is good for the Moon. Kids love the colored filters for looking at the Moon too but they&amp;#39;re less useful in my opinion.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll probably also need a power source. I recommend building your own from a marine deep cycle battery. You&amp;#39;ll get much more power time out of it for less money. You&amp;#39;re call though. You can find instructions for building one by searching online. It&amp;#39;s easy enough.&lt;/p&gt;\n\n&lt;p&gt;My solar filters came from Thousand Oaks Optical, they&amp;#39;re very nice and I highly recommend the company. &lt;/p&gt;\n\n&lt;p&gt;I think a few pairs of binoculars would be nice to have. While some kids are looking through your telescope, the others can look through binoculars. My students enjoy &amp;quot;discovering&amp;quot; Messier objects while scanning the night sky. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d get a field map of the Moon and a night sky handbook to help you out. There are many available. I like Sky Guide. I&amp;#39;ve had it since I was a kid and still use it regularly. There are also some books out there that give lists of good objects to view each season, which can be helpful.&lt;/p&gt;\n\n&lt;p&gt;I bought some of those cell phone holders so kids could take pictures of the Moon through my telescopes. They don&amp;#39;t work as well as I&amp;#39;d hoped. Each phone has the camera in a slightly different location and requires you to re-align the holder. It&amp;#39;s tedious to do in the dark. I&amp;#39;ve had better success with one person holding the camera and the other person tapping the screen to take the photo. Builds teamwork too!&lt;/p&gt;\n\n&lt;p&gt;I think an incredibly valuable use of your time/money would be to go to a few local Astronomy club meetings and star parties. You&amp;#39;ll start to get a feel for what works and what doesn&amp;#39;t when letting people look through telescopes, especially if you&amp;#39;re new to leading that sort of thing. Learning the constellations each season is also a valuable skill that you should start now (if you can&amp;#39;t do this already). &lt;/p&gt;\n\n&lt;p&gt;I recommend that you look into different virtual labs and simulations that you can do with the kids. They get tired and overloaded quickly if you lecture too much. I know from experience. There&amp;#39;s lots of good stuff out there from various universities that you can use at the high school level. Some I like, some I don&amp;#39;t, most are free. Search using queries like &amp;quot;galaxy classification lab&amp;quot; or &amp;quot;binary star lab&amp;quot; will get you in the right direction. I usually write my own directions, lab handouts, and questions for these because most of the time the ones that come with it are more college-level than my kids can handle. &lt;/p&gt;\n\n&lt;p&gt;About me: I teach astronomy and physics in high school. I built a permanent observatory at my school where we do astrophotography and I regularly take kids out to do observations at night. Previously, I worked at an astronomy camp for 3 years where 3-5 nights a week I was showing kids stuff through telescopes and doing hands on physics and astronomy labs. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg75oiw", "score_hidden": false, "stickied": false, "created": 1492087386.0, "created_utc": 1492058586.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": "", "user_reports": [], "id": "dg6hf1t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ramyzgheib", "parent_id": "t3_6504zs", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "I think you also need the telescope's accessories, like various eyepieces, barlows, etc. maybe a phone adaptor too so the students can take their own photos, otherwise a nice camera would do the trick.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you also need the telescope&amp;#39;s accessories, like various eyepieces, barlows, etc. maybe a phone adaptor too so the students can take their own photos, otherwise a nice camera would do the trick.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg6hf1t", "score_hidden": false, "stickied": false, "created": 1492056969.0, "created_utc": 1492028169.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": "", "user_reports": [], "id": "dg7m49i", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "comicidiot", "parent_id": "t1_dg7frhd", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Oooh, I hadn't even thought of Astrobiology in an Astronomy class but that sounds really cool, even if you're just touching on it. Now I want to play it again. You could also look a Kerbal Space Program if you plan to talk about orbits, energy required to break gravity and get to the moon (or Mun), and other stuff. It'll also probably be more \"modern\" for the students. I played Spore when I was in HS 8 years ago, but by no means does it discredit the concept of the game. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oooh, I hadn&amp;#39;t even thought of Astrobiology in an Astronomy class but that sounds really cool, even if you&amp;#39;re just touching on it. Now I want to play it again. You could also look a Kerbal Space Program if you plan to talk about orbits, energy required to break gravity and get to the moon (or Mun), and other stuff. It&amp;#39;ll also probably be more &amp;quot;modern&amp;quot; for the students. I played Spore when I was in HS 8 years ago, but by no means does it discredit the concept of the game. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg7m49i", "score_hidden": false, "stickied": false, "created": 1492122414.0, "created_utc": 1492093614.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7frhd", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "miatapasta", "parent_id": "t1_dg6rq2s", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Haven't come up with any lessons for the eclipse yet - will probably be piggybacking it on the stages of the moon, why every new moon doesn't bring an eclipse, some geometry, etc. \n\nAs for Spore, well, the class is an elective so we are free from the Common Core Standards and state mandated testing. As such, we have much more freedom. Aside from being a really cool concept, I could blend it into the end of the year when things are winding down and we're talking about astrobiology.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haven&amp;#39;t come up with any lessons for the eclipse yet - will probably be piggybacking it on the stages of the moon, why every new moon doesn&amp;#39;t bring an eclipse, some geometry, etc. &lt;/p&gt;\n\n&lt;p&gt;As for Spore, well, the class is an elective so we are free from the Common Core Standards and state mandated testing. As such, we have much more freedom. Aside from being a really cool concept, I could blend it into the end of the year when things are winding down and we&amp;#39;re talking about astrobiology.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg7frhd", "score_hidden": false, "stickied": false, "created": 1492113029.0, "created_utc": 1492084229.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rq2s", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "comicidiot", "parent_id": "t3_6504zs", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "I'm interested as to why you want to get Spore for your class. How do you plan to incorporate that into the curriculum?\n\nI'm also interested in what you'll be teaching for the Solar Eclipse. I'll be viewing it as well and perhaps I can take some of your material with me :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m interested as to why you want to get Spore for your class. How do you plan to incorporate that into the curriculum?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also interested in what you&amp;#39;ll be teaching for the Solar Eclipse. I&amp;#39;ll be viewing it as well and perhaps I can take some of your material with me :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg6rq2s", "score_hidden": false, "stickied": false, "created": 1492069075.0, "created_utc": 1492040275.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_6504zs", "likes": null, "replies": "", "user_reports": [], "id": "dg7g0az", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "miatapasta", "parent_id": "t1_dg6v9fv", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Ah, great to hear from a rep. I'l be in touch. I noticed on your site that it is $300 - is that for a license that I can put on all of our school's computers? Or is that per computer?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ah, great to hear from a rep. I&amp;#39;l be in touch. I noticed on your site that it is $300 - is that for a license that I can put on all of our school&amp;#39;s computers? Or is that per computer?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg7g0az", "score_hidden": false, "stickied": false, "created": 1492113528.0, "created_utc": 1492084728.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6v9fv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Starrynightoffice", "parent_id": "t3_6504zs", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Stellarium is an okay and yes, free program that lacks features and functions, particularly when it involves academia! The only program that you, an educator should consider is Starry Night High School. It has built in standards based lessons exercises and simulations. It is available for use on any device, even a Chromebook. It is also a complete astronomy program with all of the goodies. It's built on the companie's top selling Starry Night Pro.  Call us and we will help you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stellarium is an okay and yes, free program that lacks features and functions, particularly when it involves academia! The only program that you, an educator should consider is Starry Night High School. It has built in standards based lessons exercises and simulations. It is available for use on any device, even a Chromebook. It is also a complete astronomy program with all of the goodies. It&amp;#39;s built on the companie&amp;#39;s top selling Starry Night Pro.  Call us and we will help you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg6v9fv", "score_hidden": false, "stickied": false, "created": 1492073378.0, "created_utc": 1492044578.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]