[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Astronomy", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m a junior in high school and idk about other schools but my school puts so much pressure on knowing what to do with your life but so I&amp;#39;ve always been fascinated with space and so I&amp;#39;m thinking about doing something space related. I found out planetary geology was a thing and that seems really interesting to me but I have a few questions.&lt;/p&gt;\n\n&lt;p&gt;What kind of job could I expect to find doing something like this?&lt;/p&gt;\n\n&lt;p&gt;Where could I find a job, like what kind of institutions?&lt;/p&gt;\n\n&lt;p&gt;What would I be doing on a daily basis?&lt;/p&gt;\n\n&lt;p&gt;And kind of just other things about doing it if anyone knows stuff about it just general information would be nice. Thank you for anyone that answers.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I'm a junior in high school and idk about other schools but my school puts so much pressure on knowing what to do with your life but so I've always been fascinated with space and so I'm thinking about doing something space related. I found out planetary geology was a thing and that seems really interesting to me but I have a few questions.\n\nWhat kind of job could I expect to find doing something like this?\n\nWhere could I find a job, like what kind of institutions?\n\nWhat would I be doing on a daily basis?\n\nAnd kind of just other things about doing it if anyone knows stuff about it just general information would be nice. Thank you for anyone that answers.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65c8l0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "ManBearPig_IsReal", "saved": false, "mod_reports": [], "name": "t3_65c8l0", "subreddit_name_prefixed": "r/Astronomy", "approved_by": null, "over_18": false, "domain": "self.Astronomy", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhor", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Astronomy/comments/65c8l0/im_trying_to_figure_out_what_to_do_with_my_life/", "num_reports": null, "locked": false, "stickied": false, "created": 1492201831.0, "url": "https://www.reddit.com/r/Astronomy/comments/65c8l0/im_trying_to_figure_out_what_to_do_with_my_life/", "author_flair_text": null, "quarantine": false, "title": "I'm trying to figure out what to do with my life and I have a few questions", "created_utc": 1492173031.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_65c8l0", "likes": null, "replies": "", "user_reports": [], "id": "dg947dx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "The_Dead_See", "parent_id": "t3_65c8l0", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "As far as I understand the job of an astrogeologist (and disclaimer, I am not one nor do I know any), it largely involves photographic, spectroscopic and sample analysis to gain either understanding of specific planetary bodies or to create broader models. As with any astronomy based job there's going to be a lot of math involved along with the geology and chemistry. I'd suggest talking to a career counselor about the appropriate entry routes, but I'm betting it's something along the lines of a PhD in geophysics with a sub focus on astrophysics. \n\nI don't know how competitive the field is, but if it's anything like standard career astronomy, you'll need to be the absolute best you can be to stand a chance of getting a job.\n\nThe good thing is, even if you couldn't find a job in astrogeology after your education, you would still be nicely prepped for a job in terrestrial geology, teaching, engineering... things like that, so your education would not have gone to waste.\n ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As far as I understand the job of an astrogeologist (and disclaimer, I am not one nor do I know any), it largely involves photographic, spectroscopic and sample analysis to gain either understanding of specific planetary bodies or to create broader models. As with any astronomy based job there&amp;#39;s going to be a lot of math involved along with the geology and chemistry. I&amp;#39;d suggest talking to a career counselor about the appropriate entry routes, but I&amp;#39;m betting it&amp;#39;s something along the lines of a PhD in geophysics with a sub focus on astrophysics. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how competitive the field is, but if it&amp;#39;s anything like standard career astronomy, you&amp;#39;ll need to be the absolute best you can be to stand a chance of getting a job.&lt;/p&gt;\n\n&lt;p&gt;The good thing is, even if you couldn&amp;#39;t find a job in astrogeology after your education, you would still be nicely prepped for a job in terrestrial geology, teaching, engineering... things like that, so your education would not have gone to waste.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg947dx", "score_hidden": false, "stickied": false, "created": 1492204867.0, "created_utc": 1492176067.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_65c8l0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhor", "removal_reason": null, "link_id": "t3_65c8l0", "likes": null, "replies": "", "user_reports": [], "id": "dg9yizi", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ManBearPig_IsReal", "parent_id": "t1_dg9yf8h", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "Thanks that's actually a pretty good answer and I will check it out later definitely. Thanks", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks that&amp;#39;s actually a pretty good answer and I will check it out later definitely. Thanks&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg9yizi", "score_hidden": false, "stickied": false, "created": 1492242482.0, "created_utc": 1492213682.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9yf8h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ComeHailOrHighWind", "parent_id": "t3_65c8l0", "subreddit_name_prefixed": "r/Astronomy", "controversiality": 0, "body": "This might be a cheap response, but look into Purdue University. They have an amazing program there that includes this field of study. I know some folks getting graduate degrees in their Earth, Atmospheric, Planetary Science (EAPS) program, and they absolutely love it. And they're pretty competitive academically, so if you can handle the challenge, you'd come out of the program well off. \n\nGoogle them, and contact a professor there. Let them know you're interested in the field. The glory of peofessors is that they're not like a business and try to sweet talk students into joining them just to add to their numbers. They will help to guide you in the right direction even if their program is not for you. But talk to a *professor*, not an academic counselor - in my experience, they don't know as much about specific fields of study, especially one as specific as the one you're looking into, as one who will actually be in the field of study.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This might be a cheap response, but look into Purdue University. They have an amazing program there that includes this field of study. I know some folks getting graduate degrees in their Earth, Atmospheric, Planetary Science (EAPS) program, and they absolutely love it. And they&amp;#39;re pretty competitive academically, so if you can handle the challenge, you&amp;#39;d come out of the program well off. &lt;/p&gt;\n\n&lt;p&gt;Google them, and contact a professor there. Let them know you&amp;#39;re interested in the field. The glory of peofessors is that they&amp;#39;re not like a business and try to sweet talk students into joining them just to add to their numbers. They will help to guide you in the right direction even if their program is not for you. But talk to a &lt;em&gt;professor&lt;/em&gt;, not an academic counselor - in my experience, they don&amp;#39;t know as much about specific fields of study, especially one as specific as the one you&amp;#39;re looking into, as one who will actually be in the field of study.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Astronomy", "name": "t1_dg9yf8h", "score_hidden": false, "stickied": false, "created": 1492242341.0, "created_utc": 1492213541.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]