[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Guildwars2", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Part 1 : &lt;a href=\"https://www.reddit.com/r/Guildwars2/comments/64h35x/spoilers_the_tale_of_forgotten_and_lesser_known/\"&gt;https://www.reddit.com/r/Guildwars2/comments/64h35x/spoilers_the_tale_of_forgotten_and_lesser_known/&lt;/a&gt;\nPart 2: &lt;a href=\"https://www.reddit.com/r/Guildwars2/comments/64v52o/spoilers_the_tale_of_forgotten_and_lesser_known/\"&gt;https://www.reddit.com/r/Guildwars2/comments/64v52o/spoilers_the_tale_of_forgotten_and_lesser_known/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Warning: Spoilers and Wall of text incoming. Reminder: This isn&amp;#39;t about our beloved snake people named the Forgotten. It&amp;#39;s the Personal Story experienced by 15 different heroes. Since only one of them became the Commander, I just tell you the tale of these potential heroes who could have existed at the same time and who all had the chance to become the hero we all know. (And this post isn&amp;#39;t a question.)&lt;/p&gt;\n\n&lt;p&gt;Still reading? If yes, I’m sure that you aren’t the regular Norn warrior who would prefer to expand his legend instead of discovering new ones. It’s time for the Shiverpeaks since I already wrote the word Norn once above. Where do I start with the Norn… they’re the tallest of the five major races that’s for sure. They once lived in the Far Shiverpeaks before Jormag took them. They tried to fight him without success, the only exception being Asgeir Dragonrender who took one of Jormag’s teeth, but couldn’t kill the Elder Dragon. Asgeir and the four remaining major Spirits of the Wild, Bear, Raven, Wolf, and Snow Leopard led the Norn south to the Northern Shiverpeaks. Together they founded Hoelbrak. Otherwise the Norn are born hunters who are always trying to increase their legacy. They also love to sing and celebrate their heroes, often with enough alcohol involved. Some Norn, think that the Spirits of the Wild are weak and not worthy enough, they’re the Sons of Svanir. A cult build around the Elder Dragon Jormag, the origin of their name being Svanir, Jora’s brother who was corrupted by Jormag’s Champion Drakkar. Jora is also the reason there aren’t any Norn women present this cult.&lt;/p&gt;\n\n&lt;p&gt;Once every year the Norn are celebrating the Great Hunt, an event where the greatest hunters are fighting for glory. Our three Norn heroes also participated willing to win. First, they had to hunt one of the beasts in the area, having the choice between a Boar, a Minotaur and an Owl Griffon. The hero with the greatest trophy got the honor to fight against the giant Ice Wurm Issormir alongside Eir Stegalkin. After his victory, he earned the title Slayer of Issormir. &lt;/p&gt;\n\n&lt;p&gt;Following the Great Hunt our heroes’ ways would be divided. Since they’re Norn they didn’t belong to legions, social classes or even colleges which could have led their futures.&lt;/p&gt;\n\n&lt;p&gt;One of them received word from his friend the Wolf Shaman Gamli. He needs the hero’s help to heal Valda, who was found in a death-like sleep. Valda’s illness came from the Mists. Meaning that the hero needed someone who could enter the Mists, so he paid the Snow Leopard Havroun Svena a visit. Havrouns are specific Norn shamans which can explore the Mists, being also called the Spirit World. They found out that Sons of Svanir invaded the Mists. Svena on her own isn’t strong enough to keep the connection with the Mists and to fight the Sons of Svanir at the same time, so the hero recruited a second Havroun to help them complete the task. With both Havrouns, Eir Stegalkin and our hero they rescued Valda’s Spirit. Now they had to eliminate the source of the invasion, the Son of Svanir Styrr Frostblade who imprisoned the Wolf Havroun Solvi. They succeeded in closing the corrupted Portal and in killing Styrr. Solvi was too exhausted to survive and made Valda the next Havroun of the Wolf before he passed away. &lt;/p&gt;\n\n&lt;p&gt;The eminent blacksmith Beigarth wants to see our second hero, he needs help to retrieve Deldrimor Steel hidden in a Jotun Cave. However, the hero found out that the Jotuns were worshipping Jormag, which isn’t very usual for most races that aren’t Grawl. Further investigations showed that the Jotun had a new giant-king named Korag, who wants to make the Jotun great again with Jormag’s power. Our hero travels to Korag’s camp, but to even meet Korag he first must touch the Jotun’s Worship Stone. After touching the stone the hero met Elder Thruln, they dueled and Thruln is convinced that the hero is worthy. Thruln told him the history of the Jotun’s downfall, their self-overestimation caused a fatal civil war. With this knowledge, the Norn tries to convince Korag and gives him a last chance to renounce Jormag. Korag ignores the warning and got slayed by the hero and his allies. Bergris, another Jotun, informs the hero that the Jotun would regain their old strength without Jormag.&lt;/p&gt;\n\n&lt;p&gt;Ferghen the Tracker contacts our third hero, it seemed like one of the Spirits of the Wild was on a rampage. Meaning that Ferghen’s dolyaks needed protection, they got attacked by minotaurs and so Ferghen concludes that it’s the Spirit of the Minotaur who was acting strangely. The hero than tracks down the trail of the minotaurs living in the area to find out what’s wrong. He finds a group of Sons of Svanir, one of them called Hafdan the Black who knew something. The hero defeated them and discovered that they sacrificed these minotaurs to feed one of Jormag’s Champions. Following this information, the hero and Eir defended the Spirit of the Minotaur himself against the cultists. The two heroes than saved the remaining captive minotaurs and could finally launch the assault against the Son of Svanir Vidkun and the Dragon Beast. Together with the Spirit of the Minotaur they were victorious. &lt;/p&gt;\n\n&lt;p&gt;Here ends our heroes first trouble with Jormag’s servants. All three made certain mistakes which led them into their next adventures. One of them drank too much, the other fought too much and the last played dices against a cheater. &lt;/p&gt;\n\n&lt;p&gt;The fighter lost against his rival Mikkel Toivosson the last time they fought. Eir proposes the hero to participate in the Big Brawl to get his revanche and claim the title, the hero accepts without hesitation. He passes the entrance test and had to fought against another opponent to get to round two. The hero brought his trophy to Balteus Bloodletter and had to defeat the other three semifinalists, the Centaur Gulthor Cruelhoof, the Sylvari Caheris and the Charr Spatha Greatblade. Before getting into the final round, the hero took a moment to spar with Eir to be well prepared. Mikkel Toivosson was not ready to fight this hero full of conviction, so he lost and the hero celebrated his victory.&lt;/p&gt;\n\n&lt;p&gt;The Norn who lost at rolling dices, gets called by Fastulf Jotharsson who had a vision about the hero and Eir in the middle of a fight at Krennak&amp;#39;s Homestead. The hero and Eir travelled there to see if Fastulf was right. Krennak the Short has some trouble with a Son of Svanir named Varg, our hero recognizes Varg as the cheater who took his horn, an heirloom of the hero&amp;#39;s family, after “winning”. Varg summoned Ice Imps and Elementals with the horn, before this instant the hero didn’t knew that the horn is magical. Since his ancestor, Captain Romke got the horn from the Kodan, the hero decides to ask them directly. First the hero must prove himself by killing the Overminer, a member of the Dredge, and retrieve his weapon as trophy. The Kodan called -Followed by Night- than tells the hero about an imbalance she feels that could be the horn. They follow this feeling and find Varg. The Son of Svanir summons as much as he can against the two Norn and the Kodan, but it wasn’t enough, to stop them. Tragically the horn got corrupted by Jormag and had to be cleansed, leading to it’s destruction. Eir seemed to be more touched about the loss that the hero himself. It might have reminded her once again her own loss, Snaff.&lt;/p&gt;\n\n&lt;p&gt;The Norn who drank too much has the story with the most joy in it ironically. To begin he got called by Eir, arrived at her homestead the hero remarked that there were Charr all over the place. Ballista Geargrind already waited inside, informing the hero that he was so drunk that he and Mangonel Gearstrip lost the warband&amp;#39;s chugger. Now the hero was forcefully recruited by Ballista to pay his guilt. He helped to defend the Warband twice. Saegris the Norn trader tells the company after one of these battles who got the chugger now, the Dredge. The company arrived in the Diessa Plateau and took the chugger back from the Dredge. Who knows what Dredge could have done with such a vehicle… Eventually the hero payed his guilt and was free to go, however Ballista proposed the hero to help them out a last time. He gladly accepted since their task was easy: Defeating Count Cargiss and his Ascalonian ghosts. Centurion Gnaeus Quickfang was impressed by the Norn’s fighing skills and was also satisfied seeing the Warband succeed. What do we learn from this story? Never leave drunken soldiers alone with a tank. &lt;/p&gt;\n\n&lt;p&gt;The slayer of Issormir got called by Eir afters these events to her homestead. What the other two Norn did after cleaning their mistakes is unknown. &lt;/p&gt;\n\n&lt;p&gt;Once again, I wish you a pleasant day traveler.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Part 1 : https://www.reddit.com/r/Guildwars2/comments/64h35x/spoilers_the_tale_of_forgotten_and_lesser_known/\nPart 2: https://www.reddit.com/r/Guildwars2/comments/64v52o/spoilers_the_tale_of_forgotten_and_lesser_known/\n\nWarning: Spoilers and Wall of text incoming. Reminder: This isn't about our beloved snake people named the Forgotten. It's the Personal Story experienced by 15 different heroes. Since only one of them became the Commander, I just tell you the tale of these potential heroes who could have existed at the same time and who all had the chance to become the hero we all know. (And this post isn't a question.)\n\nStill reading? If yes, I’m sure that you aren’t the regular Norn warrior who would prefer to expand his legend instead of discovering new ones. It’s time for the Shiverpeaks since I already wrote the word Norn once above. Where do I start with the Norn… they’re the tallest of the five major races that’s for sure. They once lived in the Far Shiverpeaks before Jormag took them. They tried to fight him without success, the only exception being Asgeir Dragonrender who took one of Jormag’s teeth, but couldn’t kill the Elder Dragon. Asgeir and the four remaining major Spirits of the Wild, Bear, Raven, Wolf, and Snow Leopard led the Norn south to the Northern Shiverpeaks. Together they founded Hoelbrak. Otherwise the Norn are born hunters who are always trying to increase their legacy. They also love to sing and celebrate their heroes, often with enough alcohol involved. Some Norn, think that the Spirits of the Wild are weak and not worthy enough, they’re the Sons of Svanir. A cult build around the Elder Dragon Jormag, the origin of their name being Svanir, Jora’s brother who was corrupted by Jormag’s Champion Drakkar. Jora is also the reason there aren’t any Norn women present this cult.\n\nOnce every year the Norn are celebrating the Great Hunt, an event where the greatest hunters are fighting for glory. Our three Norn heroes also participated willing to win. First, they had to hunt one of the beasts in the area, having the choice between a Boar, a Minotaur and an Owl Griffon. The hero with the greatest trophy got the honor to fight against the giant Ice Wurm Issormir alongside Eir Stegalkin. After his victory, he earned the title Slayer of Issormir. \n\nFollowing the Great Hunt our heroes’ ways would be divided. Since they’re Norn they didn’t belong to legions, social classes or even colleges which could have led their futures.\n\nOne of them received word from his friend the Wolf Shaman Gamli. He needs the hero’s help to heal Valda, who was found in a death-like sleep. Valda’s illness came from the Mists. Meaning that the hero needed someone who could enter the Mists, so he paid the Snow Leopard Havroun Svena a visit. Havrouns are specific Norn shamans which can explore the Mists, being also called the Spirit World. They found out that Sons of Svanir invaded the Mists. Svena on her own isn’t strong enough to keep the connection with the Mists and to fight the Sons of Svanir at the same time, so the hero recruited a second Havroun to help them complete the task. With both Havrouns, Eir Stegalkin and our hero they rescued Valda’s Spirit. Now they had to eliminate the source of the invasion, the Son of Svanir Styrr Frostblade who imprisoned the Wolf Havroun Solvi. They succeeded in closing the corrupted Portal and in killing Styrr. Solvi was too exhausted to survive and made Valda the next Havroun of the Wolf before he passed away. \n\nThe eminent blacksmith Beigarth wants to see our second hero, he needs help to retrieve Deldrimor Steel hidden in a Jotun Cave. However, the hero found out that the Jotuns were worshipping Jormag, which isn’t very usual for most races that aren’t Grawl. Further investigations showed that the Jotun had a new giant-king named Korag, who wants to make the Jotun great again with Jormag’s power. Our hero travels to Korag’s camp, but to even meet Korag he first must touch the Jotun’s Worship Stone. After touching the stone the hero met Elder Thruln, they dueled and Thruln is convinced that the hero is worthy. Thruln told him the history of the Jotun’s downfall, their self-overestimation caused a fatal civil war. With this knowledge, the Norn tries to convince Korag and gives him a last chance to renounce Jormag. Korag ignores the warning and got slayed by the hero and his allies. Bergris, another Jotun, informs the hero that the Jotun would regain their old strength without Jormag.\n\nFerghen the Tracker contacts our third hero, it seemed like one of the Spirits of the Wild was on a rampage. Meaning that Ferghen’s dolyaks needed protection, they got attacked by minotaurs and so Ferghen concludes that it’s the Spirit of the Minotaur who was acting strangely. The hero than tracks down the trail of the minotaurs living in the area to find out what’s wrong. He finds a group of Sons of Svanir, one of them called Hafdan the Black who knew something. The hero defeated them and discovered that they sacrificed these minotaurs to feed one of Jormag’s Champions. Following this information, the hero and Eir defended the Spirit of the Minotaur himself against the cultists. The two heroes than saved the remaining captive minotaurs and could finally launch the assault against the Son of Svanir Vidkun and the Dragon Beast. Together with the Spirit of the Minotaur they were victorious. \n\nHere ends our heroes first trouble with Jormag’s servants. All three made certain mistakes which led them into their next adventures. One of them drank too much, the other fought too much and the last played dices against a cheater. \n\nThe fighter lost against his rival Mikkel Toivosson the last time they fought. Eir proposes the hero to participate in the Big Brawl to get his revanche and claim the title, the hero accepts without hesitation. He passes the entrance test and had to fought against another opponent to get to round two. The hero brought his trophy to Balteus Bloodletter and had to defeat the other three semifinalists, the Centaur Gulthor Cruelhoof, the Sylvari Caheris and the Charr Spatha Greatblade. Before getting into the final round, the hero took a moment to spar with Eir to be well prepared. Mikkel Toivosson was not ready to fight this hero full of conviction, so he lost and the hero celebrated his victory.\n\nThe Norn who lost at rolling dices, gets called by Fastulf Jotharsson who had a vision about the hero and Eir in the middle of a fight at Krennak's Homestead. The hero and Eir travelled there to see if Fastulf was right. Krennak the Short has some trouble with a Son of Svanir named Varg, our hero recognizes Varg as the cheater who took his horn, an heirloom of the hero's family, after “winning”. Varg summoned Ice Imps and Elementals with the horn, before this instant the hero didn’t knew that the horn is magical. Since his ancestor, Captain Romke got the horn from the Kodan, the hero decides to ask them directly. First the hero must prove himself by killing the Overminer, a member of the Dredge, and retrieve his weapon as trophy. The Kodan called -Followed by Night- than tells the hero about an imbalance she feels that could be the horn. They follow this feeling and find Varg. The Son of Svanir summons as much as he can against the two Norn and the Kodan, but it wasn’t enough, to stop them. Tragically the horn got corrupted by Jormag and had to be cleansed, leading to it’s destruction. Eir seemed to be more touched about the loss that the hero himself. It might have reminded her once again her own loss, Snaff.\n\nThe Norn who drank too much has the story with the most joy in it ironically. To begin he got called by Eir, arrived at her homestead the hero remarked that there were Charr all over the place. Ballista Geargrind already waited inside, informing the hero that he was so drunk that he and Mangonel Gearstrip lost the warband's chugger. Now the hero was forcefully recruited by Ballista to pay his guilt. He helped to defend the Warband twice. Saegris the Norn trader tells the company after one of these battles who got the chugger now, the Dredge. The company arrived in the Diessa Plateau and took the chugger back from the Dredge. Who knows what Dredge could have done with such a vehicle… Eventually the hero payed his guilt and was free to go, however Ballista proposed the hero to help them out a last time. He gladly accepted since their task was easy: Defeating Count Cargiss and his Ascalonian ghosts. Centurion Gnaeus Quickfang was impressed by the Norn’s fighing skills and was also satisfied seeing the Warband succeed. What do we learn from this story? Never leave drunken soldiers alone with a tank. \n\nThe slayer of Issormir got called by Eir afters these events to her homestead. What the other two Norn did after cleaning their mistakes is unknown. \n\nOnce again, I wish you a pleasant day traveler.\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "[Lore]", "id": "658mnv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 28, "report_reasons": null, "author": "E_M_A_N_R_E_S_U", "saved": false, "mod_reports": [], "name": "t3_658mnv", "subreddit_name_prefixed": "r/Guildwars2", "approved_by": null, "over_18": false, "domain": "self.Guildwars2", "hidden": false, "thumbnail": "spoiler", "subreddit_id": "t5_2r9po", "edited": false, "link_flair_css_class": "lor", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": true, "permalink": "/r/Guildwars2/comments/658mnv/spoilers_the_tale_of_forgotten_and_lesser_known/", "num_reports": null, "locked": false, "stickied": false, "created": 1492149655.0, "url": "https://www.reddit.com/r/Guildwars2/comments/658mnv/spoilers_the_tale_of_forgotten_and_lesser_known/", "author_flair_text": null, "quarantine": false, "title": "SPOILERS. The Tale of forgotten and lesser known heroes. Part 3", "created_utc": 1492120855.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 28}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9po", "removal_reason": null, "link_id": "t3_658mnv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r9po", "removal_reason": null, "link_id": "t3_658mnv", "likes": null, "replies": "", "user_reports": [], "id": "dg8flic", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "PalwaJoko", "parent_id": "t1_dg8duqm", "subreddit_name_prefixed": "r/Guildwars2", "controversiality": 0, "body": "I read a bit of it, and it appears to be short stories that branch off from the main story.\n\nI like it, always nice to see a new style of content in the sub. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read a bit of it, and it appears to be short stories that branch off from the main story.&lt;/p&gt;\n\n&lt;p&gt;I like it, always nice to see a new style of content in the sub. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Guildwars2", "name": "t1_dg8flic", "score_hidden": false, "stickied": false, "created": 1492155935.0, "created_utc": 1492127135.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8duqm", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "MrFatsas", "parent_id": "t3_658mnv", "subreddit_name_prefixed": "r/Guildwars2", "controversiality": 1, "body": "Wtf is this i cant read", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wtf is this i cant read&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Guildwars2", "name": "t1_dg8duqm", "score_hidden": false, "stickied": false, "created": 1492153625.0, "created_utc": 1492124825.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]