[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "GameDeals", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sxdf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 74, "report_reasons": null, "author": "Muffin2Pie", "saved": false, "mod_reports": [], "name": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "approved_by": null, "over_18": false, "domain": "store.steampowered.com", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/_2Qhc8QHAZQiIXOjiCgo9ZWJJP531HII_oCakoqutgw.jpg?s=5d1da7ee2382f2eca624b16e0d95b948", "width": 460, "height": 215}, "resolutions": [{"url": "https://i.redditmedia.com/_2Qhc8QHAZQiIXOjiCgo9ZWJJP531HII_oCakoqutgw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=5ad157c823b0033189736b79778a85c2", "width": 108, "height": 50}, {"url": "https://i.redditmedia.com/_2Qhc8QHAZQiIXOjiCgo9ZWJJP531HII_oCakoqutgw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=2c9cced31e84199b5e4407ad98ddf38f", "width": 216, "height": 100}, {"url": "https://i.redditmedia.com/_2Qhc8QHAZQiIXOjiCgo9ZWJJP531HII_oCakoqutgw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=ab9caa2bcf6af0dddd3f98e2da58d7db", "width": 320, "height": 149}], "variants": {}, "id": "lHB8vW9rpw5uoZ4uz17UEQiLehq0-e3e-HnEg2E3DrE"}], "enabled": false}, "thumbnail": "https://a.thumbs.redditmedia.com/_wJnYEdqHbDkIz80VKgN0OUTw0udQXFLOcItswmF3m4.jpg", "subreddit_id": "t5_2qwx3", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "link", "is_self": false, "hide_score": false, "spoiler": false, "permalink": "/r/GameDeals/comments/64sxdf/steam_elite_dangerous_horizons_new_update_sale/", "num_reports": null, "locked": false, "stickied": false, "created": 1491966131.0, "url": "http://store.steampowered.com/app/359320/", "author_flair_text": null, "quarantine": false, "title": "[Steam] Elite Dangerous &amp; Horizons new update sale (16,74€/33% each) until April 17th", "created_utc": 1491937331.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 36, "visited": false, "subreddit_type": "public", "ups": 74}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg4tlbw", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "Anoony_Moose", "parent_id": "t1_dg4qv8e", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "The answer to this is a huge \"depends\". Are you someone that enjoys game where you zone out, look at pretty things and listen to music? Elite, for the most part, is very similar to the Euro/American Truck Simulator games. You space truck stuff across the galaxy, take up bounties and basic missions for various factions/empires as your grind for cash and reputation. \n\nThe dog fighting is fairly fun and challenging depending on your ship layouts. Speaking of which, the ship customization is one of my favorite aspects of the game as you balance weight, power, firepower, speed, and utility; however this may not appeal to people that don't really enjoy the nitty gritty of game mechanics. \n\nI've only put maybe 80 hours into the game and while I enjoyed that time, I eventually realised that the progression system is absolutely awful. The story/progression of the game is practically nonexistent, as you spend countless hours grinding for cash and reputation. You practically are required to look up a guide on how reputation works in this game, and you still probably will only have half a grasp on how it works. Yes, planet landing is locked behind the Horizons \"season/expansion\".\n\nLike I said, the story/lore of the universe is so basic that your \"penchant for sci-fi\" won't really do much for you as the game is more interesting as a general \"space/space\" simulator than anything that resembles the \"fiction\" aspect of sci-fi. This is partly because the game presents itself through the view of the cockpit 100% of the time. You land on one of 4 different looking stations, buy/trade some goods, upgrade your ship, accept an uninspired mission and then take off for another similar looking station in another star system. Rinse and repeat as you slowly upgrade and replace your ships.  \n\nThat said, the graphics are absolutely stunning and the physics allow you to really \"feel\" the weight and inertia of the ships as the thrust around and corkscrew during dogfights. This is especially true if you play with a HOTAS, which I highly recommend (you can get them used on ebay for fairly cheap). In fact, I'd say a HOTAS is required if you plan to put a significant amount of time into the game, otherwise you will likely get bored far more quickly. If you do play the game with a mouse/keyboard, I highly recommend reading a beginner's guide which lists control changes to the yaws/rotation, as the default mouse controls are poor.\n\nDon't think of Elite as a game that you will eventually finish before you move on to  other games in your backlog. It's one of those never ending games where it either clicks and you play for 50-500 hours until you eventually get bored (which inevitably will happen), or you immediately get frustrated with its lack of real progression and quit after 5 hours. Regardless, if you enjoy any of the mechanics or game genres I've described, I think the base game is definitely worth checking out if you have the cash to spare.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The answer to this is a huge &amp;quot;depends&amp;quot;. Are you someone that enjoys game where you zone out, look at pretty things and listen to music? Elite, for the most part, is very similar to the Euro/American Truck Simulator games. You space truck stuff across the galaxy, take up bounties and basic missions for various factions/empires as your grind for cash and reputation. &lt;/p&gt;\n\n&lt;p&gt;The dog fighting is fairly fun and challenging depending on your ship layouts. Speaking of which, the ship customization is one of my favorite aspects of the game as you balance weight, power, firepower, speed, and utility; however this may not appeal to people that don&amp;#39;t really enjoy the nitty gritty of game mechanics. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve only put maybe 80 hours into the game and while I enjoyed that time, I eventually realised that the progression system is absolutely awful. The story/progression of the game is practically nonexistent, as you spend countless hours grinding for cash and reputation. You practically are required to look up a guide on how reputation works in this game, and you still probably will only have half a grasp on how it works. Yes, planet landing is locked behind the Horizons &amp;quot;season/expansion&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Like I said, the story/lore of the universe is so basic that your &amp;quot;penchant for sci-fi&amp;quot; won&amp;#39;t really do much for you as the game is more interesting as a general &amp;quot;space/space&amp;quot; simulator than anything that resembles the &amp;quot;fiction&amp;quot; aspect of sci-fi. This is partly because the game presents itself through the view of the cockpit 100% of the time. You land on one of 4 different looking stations, buy/trade some goods, upgrade your ship, accept an uninspired mission and then take off for another similar looking station in another star system. Rinse and repeat as you slowly upgrade and replace your ships.  &lt;/p&gt;\n\n&lt;p&gt;That said, the graphics are absolutely stunning and the physics allow you to really &amp;quot;feel&amp;quot; the weight and inertia of the ships as the thrust around and corkscrew during dogfights. This is especially true if you play with a HOTAS, which I highly recommend (you can get them used on ebay for fairly cheap). In fact, I&amp;#39;d say a HOTAS is required if you plan to put a significant amount of time into the game, otherwise you will likely get bored far more quickly. If you do play the game with a mouse/keyboard, I highly recommend reading a beginner&amp;#39;s guide which lists control changes to the yaws/rotation, as the default mouse controls are poor.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t think of Elite as a game that you will eventually finish before you move on to  other games in your backlog. It&amp;#39;s one of those never ending games where it either clicks and you play for 50-500 hours until you eventually get bored (which inevitably will happen), or you immediately get frustrated with its lack of real progression and quit after 5 hours. Regardless, if you enjoy any of the mechanics or game genres I&amp;#39;ve described, I think the base game is definitely worth checking out if you have the cash to spare.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4tlbw", "score_hidden": false, "stickied": false, "created": 1491969402.0, "created_utc": 1491940602.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg5v7n2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Herlock", "parent_id": "t1_dg4y1pw", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "Same feeling here, at 16 bucks he might get his money worth of \"omg fucking awesome space piloting immersion\", but the game mechanics are fucking shallow.\n\nThey spent too much time building that huge procedural thing, and forgot to create an actual game. The solo / PVP non decision they made place the game in an even more difficult spot as persistence essentially doesn't exists in this game...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same feeling here, at 16 bucks he might get his money worth of &amp;quot;omg fucking awesome space piloting immersion&amp;quot;, but the game mechanics are fucking shallow.&lt;/p&gt;\n\n&lt;p&gt;They spent too much time building that huge procedural thing, and forgot to create an actual game. The solo / PVP non decision they made place the game in an even more difficult spot as persistence essentially doesn&amp;#39;t exists in this game...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5v7n2", "score_hidden": false, "stickied": false, "created": 1492033136.0, "created_utc": 1492004336.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4y1pw", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "PlumbTheDerps", "parent_id": "t1_dg4qv8e", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "It's super fun for about 30 hours and not anything beyond that. The flight physics and mechanics are extremely well executed, but there just isn't any content whatsoever beyond procedurally generated fetch/trade/bounty missions. At all. That's literally the entire game. Exploring is cool for about 5 hours. I made it halfway to the center of the Galaxy and then uninstalled about six months ago.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s super fun for about 30 hours and not anything beyond that. The flight physics and mechanics are extremely well executed, but there just isn&amp;#39;t any content whatsoever beyond procedurally generated fetch/trade/bounty missions. At all. That&amp;#39;s literally the entire game. Exploring is cool for about 5 hours. I made it halfway to the center of the Galaxy and then uninstalled about six months ago.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4y1pw", "score_hidden": false, "stickied": false, "created": 1491974476.0, "created_utc": 1491945676.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg4yi8j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BiosElemental", "parent_id": "t1_dg4wokj", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "This part is perhaps accurate, but the bigger issue is, again, the game feels empty. No one would complain if the game had more actual content, but good god is content few and far between. And it probably hurts them even more BECAUSE people see how great what they have is. But the devs continue to not add actual gameplay to, ya know, a game...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This part is perhaps accurate, but the bigger issue is, again, the game feels empty. No one would complain if the game had more actual content, but good god is content few and far between. And it probably hurts them even more BECAUSE people see how great what they have is. But the devs continue to not add actual gameplay to, ya know, a game...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4yi8j", "score_hidden": false, "stickied": false, "created": 1491975029.0, "created_utc": 1491946229.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg55dxv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShastaMcLurky", "parent_id": "t1_dg4wokj", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "The way I remember reading it was a free expansion", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The way I remember reading it was a free expansion&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg55dxv", "score_hidden": false, "stickied": false, "created": 1491983953.0, "created_utc": 1491955153.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4wokj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "gigantism", "parent_id": "t1_dg4sjdy", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "&gt; Oh and yes, my final straw was them going against their planetary landing promise from the early adopters like myself and putting Horizons behind a \"Pay for the game again\" paywall. Horizons unlocks planetary landing in the same exact game you already have.\n\nI thought they explained that was an expansion feature in the KS?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Oh and yes, my final straw was them going against their planetary landing promise from the early adopters like myself and putting Horizons behind a &amp;quot;Pay for the game again&amp;quot; paywall. Horizons unlocks planetary landing in the same exact game you already have.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I thought they explained that was an expansion feature in the KS?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4wokj", "score_hidden": false, "stickied": false, "created": 1491972860.0, "created_utc": 1491944060.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4sjdy", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "ShastaMcLurky", "parent_id": "t1_dg4qv8e", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "I'm a huge space nerd and this game had me frothing. I bought it a while ago and tried playing with the ~$50 controller and found it lacking. I then invested in a HOTAS and after the very steep learning curve (to me) I started to have some fun with the game. I put about 80 hours into it which makes the purchase of the game well worth it, but it grew VERY stale for me. That expensive HOTAS I bought sits on my shelf collecting dust. \n\nIt's a very pretty game but it feels very empty. You basically blaze your own trail. If you're not a self starter that can make the fun for yourself, then this might be a problem for you. The game doesn't hold your hand at all. It literally throws you out in space and wishes you good luck. \n\nIt becomes very grindy trying to get the perfect ship to do what you want to do. You'll think you want to be an explorer and earn money finding new planets and systems without the threat of pirates, but you'll have to grind a ship that has maximum jump distance and after a while, each system begins to look pretty similar. Don't get me wrong, there are some absolutely gorgeous visuals, but it becomes very cut/paste after a while.\n\nThen you'll think you want to combat, but you have to grind up for the perfect fighter. You can get it done with a cheap cobra, but you won't be a pure bad ass. You'll want to grind for that big ass ship that can take out anyone, and that can become tedious. Then you have to grind for those insurance costs to get back all of your ship/gear when you mess up and get shot down, otherwise its back to the beginning.\n\nWant to just be a trader and make lots of cash? Sure... gotta grind that ship that has a big payload and can jump pretty far to maximize your time/cashflow ratio and then hope those pesky pirates don't shoot you down when you're carrying a huge load of several million credits... which they will at times.\n\nI will admit, bounty hunting is pretty fun but after a while that does get pretty stale too. Pirating can be fun as well, but then the bounty on your head becomes a pain in the ass. \n\nAll that said, it is a great game if you can handle the wide openness of it but it takes a lot of effort to stay invested. My 80 hours may seem like a decent amount of time, but honestly even at that time I still felt like I was learning the game. \n\nHOTAS is great, but not a must. A joystick with at least a hat switch on top is an absolute must though. There are people who play on KB/M but I have no idea how they do it. I once mapped an Xbox One controller and it wasn't horrible, but I was definitely at a disadvantage. It can be done though. \n\nOh and yes, my final straw was them going against their planetary landing promise from the early adopters like myself and putting Horizons behind a \"Pay for the game again\" paywall. Horizons unlocks planetary landing in the same exact game you already have. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a huge space nerd and this game had me frothing. I bought it a while ago and tried playing with the ~$50 controller and found it lacking. I then invested in a HOTAS and after the very steep learning curve (to me) I started to have some fun with the game. I put about 80 hours into it which makes the purchase of the game well worth it, but it grew VERY stale for me. That expensive HOTAS I bought sits on my shelf collecting dust. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a very pretty game but it feels very empty. You basically blaze your own trail. If you&amp;#39;re not a self starter that can make the fun for yourself, then this might be a problem for you. The game doesn&amp;#39;t hold your hand at all. It literally throws you out in space and wishes you good luck. &lt;/p&gt;\n\n&lt;p&gt;It becomes very grindy trying to get the perfect ship to do what you want to do. You&amp;#39;ll think you want to be an explorer and earn money finding new planets and systems without the threat of pirates, but you&amp;#39;ll have to grind a ship that has maximum jump distance and after a while, each system begins to look pretty similar. Don&amp;#39;t get me wrong, there are some absolutely gorgeous visuals, but it becomes very cut/paste after a while.&lt;/p&gt;\n\n&lt;p&gt;Then you&amp;#39;ll think you want to combat, but you have to grind up for the perfect fighter. You can get it done with a cheap cobra, but you won&amp;#39;t be a pure bad ass. You&amp;#39;ll want to grind for that big ass ship that can take out anyone, and that can become tedious. Then you have to grind for those insurance costs to get back all of your ship/gear when you mess up and get shot down, otherwise its back to the beginning.&lt;/p&gt;\n\n&lt;p&gt;Want to just be a trader and make lots of cash? Sure... gotta grind that ship that has a big payload and can jump pretty far to maximize your time/cashflow ratio and then hope those pesky pirates don&amp;#39;t shoot you down when you&amp;#39;re carrying a huge load of several million credits... which they will at times.&lt;/p&gt;\n\n&lt;p&gt;I will admit, bounty hunting is pretty fun but after a while that does get pretty stale too. Pirating can be fun as well, but then the bounty on your head becomes a pain in the ass. &lt;/p&gt;\n\n&lt;p&gt;All that said, it is a great game if you can handle the wide openness of it but it takes a lot of effort to stay invested. My 80 hours may seem like a decent amount of time, but honestly even at that time I still felt like I was learning the game. &lt;/p&gt;\n\n&lt;p&gt;HOTAS is great, but not a must. A joystick with at least a hat switch on top is an absolute must though. There are people who play on KB/M but I have no idea how they do it. I once mapped an Xbox One controller and it wasn&amp;#39;t horrible, but I was definitely at a disadvantage. It can be done though. &lt;/p&gt;\n\n&lt;p&gt;Oh and yes, my final straw was them going against their planetary landing promise from the early adopters like myself and putting Horizons behind a &amp;quot;Pay for the game again&amp;quot; paywall. Horizons unlocks planetary landing in the same exact game you already have. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4sjdy", "score_hidden": false, "stickied": false, "created": 1491968267.0, "created_utc": 1491939467.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg5ve2s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Herlock", "parent_id": "t1_dg5jf6v", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "&gt; E:D is a beautiful game, it's soundscapes are brilliantly designed and it has a great blend of realistic + gamey space combat mechanics. However, that blend doesn't extend to space flight in general, which is realistic in the sense that you feel like it takes forever to get from place to place. \n\nThis is very true, and you will be in awe for several hours.\n\nBeyond that, people will start to notice that the game is very shallow, and pointless.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;E:D is a beautiful game, it&amp;#39;s soundscapes are brilliantly designed and it has a great blend of realistic + gamey space combat mechanics. However, that blend doesn&amp;#39;t extend to space flight in general, which is realistic in the sense that you feel like it takes forever to get from place to place. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is very true, and you will be in awe for several hours.&lt;/p&gt;\n\n&lt;p&gt;Beyond that, people will start to notice that the game is very shallow, and pointless.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5ve2s", "score_hidden": false, "stickied": false, "created": 1492033377.0, "created_utc": 1492004577.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jf6v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Oneiricl", "parent_id": "t1_dg4qv8e", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "If you have a big backlog, I'd recommend waiting. If you're itching to get your hands on a fun space based game, I'd recommend either going for any tier of the current Humble Bundle - I loved the pants of GalCiv II, I've heard amazing stuff about Rebel Galaxy (which I have in my backlog but haven't got around to yet) and even the $15 tier seems to be widely recommended as totally worth it.\n\nE:D is a beautiful game, it's soundscapes are brilliantly designed and it has a great blend of realistic + gamey space combat mechanics. However, that blend doesn't extend to space flight in general, which is realistic in the sense that you feel like it takes forever to get from place to place. \n\nThis isn't a bad thing necessarily. In it's current form, I'd say if you're looking for a space-based equivalent to Flight Simulator or Euro Truck Simulator, this would be great for you. You can Netflix and chill with E:D. \n\nIf you had a VR headset and a HOTAS, I would, in a heartbeat, tell you this is the single best game for a VR experience at the moment. Nothing I've come across even comes close.\n\nIf, like me, you don't have VR or a HOTAS and you were looking for something more adventure filled (like a post-campaign Freelancer, if you will), you will be disappointed. I feel like in another 2 years or so E:D should have enough content that it'll be worth playing again (for me). In its current state, it's good for a few hours of oooh, pretty space flight, but that's about it.\n\nTo answer your question about the paywall, yes, to some extent, Horizons is locked behind a paywall, but on the other hand, it's comparatively cheap to buy it with the base game included. A lot of the bad blood about Horizons being behind a pay wall is that most people who bought in early got the base game for ~$60 and Horizons launched at the same price (with base game bundled) and a ~$15 discount for people who owned the base game. I think a bunch of the people who had been early adopters felt vaguely cheated, especially since there had been a lot of complaints about the emptiness of the universe which remained unresolved, and that caused bad blood (and a fracturing of the community).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you have a big backlog, I&amp;#39;d recommend waiting. If you&amp;#39;re itching to get your hands on a fun space based game, I&amp;#39;d recommend either going for any tier of the current Humble Bundle - I loved the pants of GalCiv II, I&amp;#39;ve heard amazing stuff about Rebel Galaxy (which I have in my backlog but haven&amp;#39;t got around to yet) and even the $15 tier seems to be widely recommended as totally worth it.&lt;/p&gt;\n\n&lt;p&gt;E:D is a beautiful game, it&amp;#39;s soundscapes are brilliantly designed and it has a great blend of realistic + gamey space combat mechanics. However, that blend doesn&amp;#39;t extend to space flight in general, which is realistic in the sense that you feel like it takes forever to get from place to place. &lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t a bad thing necessarily. In it&amp;#39;s current form, I&amp;#39;d say if you&amp;#39;re looking for a space-based equivalent to Flight Simulator or Euro Truck Simulator, this would be great for you. You can Netflix and chill with E:D. &lt;/p&gt;\n\n&lt;p&gt;If you had a VR headset and a HOTAS, I would, in a heartbeat, tell you this is the single best game for a VR experience at the moment. Nothing I&amp;#39;ve come across even comes close.&lt;/p&gt;\n\n&lt;p&gt;If, like me, you don&amp;#39;t have VR or a HOTAS and you were looking for something more adventure filled (like a post-campaign Freelancer, if you will), you will be disappointed. I feel like in another 2 years or so E:D should have enough content that it&amp;#39;ll be worth playing again (for me). In its current state, it&amp;#39;s good for a few hours of oooh, pretty space flight, but that&amp;#39;s about it.&lt;/p&gt;\n\n&lt;p&gt;To answer your question about the paywall, yes, to some extent, Horizons is locked behind a paywall, but on the other hand, it&amp;#39;s comparatively cheap to buy it with the base game included. A lot of the bad blood about Horizons being behind a pay wall is that most people who bought in early got the base game for ~$60 and Horizons launched at the same price (with base game bundled) and a ~$15 discount for people who owned the base game. I think a bunch of the people who had been early adopters felt vaguely cheated, especially since there had been a lot of complaints about the emptiness of the universe which remained unresolved, and that caused bad blood (and a fracturing of the community).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5jf6v", "score_hidden": false, "stickied": false, "created": 1492004930.0, "created_utc": 1491976130.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg4tp3x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "greymane98", "parent_id": "t1_dg4qv8e", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "Horizons was the first expansion and it added planetary landings on rocky type (no atmosphere) planets.  They are releasing additional content as a \"season\" which is basically a year or so of updates.  It looks as each new season comes out, the prior material gets included in the base game kinda like WOW did.  Personally I think Horizon's is very worth it, particularly with some of the latest content.\n\nAs to is it worth it, that is VERY subjective with this game.  I personally think it is very worth it, but I have 291 hours in the game.  I tend to play in binges.  It does have a steep-ish learning curve, but I am a KB&amp;M player.  Shasta talked about the grind and while it can be that way, if you are playing it to grind, you are doing it wrong...you should be playing to enjoy it....not to just get the perfect ship (in my opinion).  It all varies on what you want though.  In any event, this is not a buy and play a couple hour type of game.  Just getting the flight controls down and being comfortable will probably take that long.\n\nOne other thing...if you do get it, consider getting VoiceAttack....it makes the game INCREDIBLY immersive.  I can't play without it now.  :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Horizons was the first expansion and it added planetary landings on rocky type (no atmosphere) planets.  They are releasing additional content as a &amp;quot;season&amp;quot; which is basically a year or so of updates.  It looks as each new season comes out, the prior material gets included in the base game kinda like WOW did.  Personally I think Horizon&amp;#39;s is very worth it, particularly with some of the latest content.&lt;/p&gt;\n\n&lt;p&gt;As to is it worth it, that is VERY subjective with this game.  I personally think it is very worth it, but I have 291 hours in the game.  I tend to play in binges.  It does have a steep-ish learning curve, but I am a KB&amp;amp;M player.  Shasta talked about the grind and while it can be that way, if you are playing it to grind, you are doing it wrong...you should be playing to enjoy it....not to just get the perfect ship (in my opinion).  It all varies on what you want though.  In any event, this is not a buy and play a couple hour type of game.  Just getting the flight controls down and being comfortable will probably take that long.&lt;/p&gt;\n\n&lt;p&gt;One other thing...if you do get it, consider getting VoiceAttack....it makes the game INCREDIBLY immersive.  I can&amp;#39;t play without it now.  :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4tp3x", "score_hidden": false, "stickied": false, "created": 1491969513.0, "created_utc": 1491940713.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg5v3lz", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Herlock", "parent_id": "t1_dg4qv8e", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "&gt; Did they lock planet landing behind a paywall?\n\nyes...\n\nOverall at this price the game might be worth it. But it's still very shallow IMO. The immersion is fantastic (no doubt) but it's also VERY repetitive, and very not \"persistant\".\n\nTo me it feels that the game failed at chosing between solo and multiplayer and ended up in a weird spot where it's neither and bears the cons of both worlds :\n\n- not much content, unlike a X3 TC\n- no long term \"universe\" impact, unlike eve online\n\nI think it would have been better had they created something that could run on  self hosted servers with \"smallish\" communities as a coop / small scale PVP game.\n\nThe universe is huge, but just like NMS has taught us : procedural generation can create billions of planets, that doesn't make them interesting.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Did they lock planet landing behind a paywall?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;yes...&lt;/p&gt;\n\n&lt;p&gt;Overall at this price the game might be worth it. But it&amp;#39;s still very shallow IMO. The immersion is fantastic (no doubt) but it&amp;#39;s also VERY repetitive, and very not &amp;quot;persistant&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;To me it feels that the game failed at chosing between solo and multiplayer and ended up in a weird spot where it&amp;#39;s neither and bears the cons of both worlds :&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;not much content, unlike a X3 TC&lt;/li&gt;\n&lt;li&gt;no long term &amp;quot;universe&amp;quot; impact, unlike eve online&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I think it would have been better had they created something that could run on  self hosted servers with &amp;quot;smallish&amp;quot; communities as a coop / small scale PVP game.&lt;/p&gt;\n\n&lt;p&gt;The universe is huge, but just like NMS has taught us : procedural generation can create billions of planets, that doesn&amp;#39;t make them interesting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5v3lz", "score_hidden": false, "stickied": false, "created": 1492032981.0, "created_utc": 1492004181.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg4x5gt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Andere", "parent_id": "t1_dg4qv8e", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "It can be a lot of fun, but it's the sort of game where you have to find your own fun. There's no guidance so you can easily get bored if you don't have a lot of motivation. I generally recommend taking most commentary with a grain of salt. There are a lot of very bitter old fans. In the end, it's pretty good. Horizons adds a bunch of neat new features. You'll probably get your money's worth if you want to play Space Euro Truck Simulator.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It can be a lot of fun, but it&amp;#39;s the sort of game where you have to find your own fun. There&amp;#39;s no guidance so you can easily get bored if you don&amp;#39;t have a lot of motivation. I generally recommend taking most commentary with a grain of salt. There are a lot of very bitter old fans. In the end, it&amp;#39;s pretty good. Horizons adds a bunch of neat new features. You&amp;#39;ll probably get your money&amp;#39;s worth if you want to play Space Euro Truck Simulator.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4x5gt", "score_hidden": false, "stickied": false, "created": 1491973401.0, "created_utc": 1491944601.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg52osf", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Maht_Daymun", "parent_id": "t1_dg4qv8e", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 1, "body": "No. It's complete boring trash with tons of cash shop items, barely any gameplay and if you don't have a joystick, don't even bother\n\nwhenever I see this title I feel obliged to warn people of this game\n\nThis is 10 times worse and emptier than No Mam's Sky", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. It&amp;#39;s complete boring trash with tons of cash shop items, barely any gameplay and if you don&amp;#39;t have a joystick, don&amp;#39;t even bother&lt;/p&gt;\n\n&lt;p&gt;whenever I see this title I feel obliged to warn people of this game&lt;/p&gt;\n\n&lt;p&gt;This is 10 times worse and emptier than No Mam&amp;#39;s Sky&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg52osf", "score_hidden": false, "stickied": false, "created": 1491980288.0, "created_utc": 1491951488.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4qv8e", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "SavageOranges", "parent_id": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "Can anyone tell me, with a big backlog, no HOTAS, but a penchant for sci-fi: is this worth it? I've seen so many mixed reviews and opinions on this game, but the promise of just zipping around space doing whatever sounds fun to me. Also, what is Horizons. Did they lock planet landing behind a paywall?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can anyone tell me, with a big backlog, no HOTAS, but a penchant for sci-fi: is this worth it? I&amp;#39;ve seen so many mixed reviews and opinions on this game, but the promise of just zipping around space doing whatever sounds fun to me. Also, what is Horizons. Did they lock planet landing behind a paywall?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4qv8e", "score_hidden": false, "stickied": false, "created": 1491966477.0, "created_utc": 1491937677.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg6vmv0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EdTOWB", "parent_id": "t1_dg6rtbm", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "oh! neat! you're right\n\nif anyone else is looking, you can get em at https://www.frontierstore.net/frontier_partnerkeys/ (worked for game and season pass for me)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh! neat! you&amp;#39;re right&lt;/p&gt;\n\n&lt;p&gt;if anyone else is looking, you can get em at &lt;a href=\"https://www.frontierstore.net/frontier_partnerkeys/\"&gt;https://www.frontierstore.net/frontier_partnerkeys/&lt;/a&gt; (worked for game and season pass for me)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg6vmv0", "score_hidden": false, "stickied": false, "created": 1492073824.0, "created_utc": 1492045024.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6rtbm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "skwert99", "parent_id": "t1_dg6dcp4", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "There used to be a way to get a steam key for the base game.  Google around and you'll find it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There used to be a way to get a steam key for the base game.  Google around and you&amp;#39;ll find it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg6rtbm", "score_hidden": false, "stickied": false, "created": 1492069185.0, "created_utc": 1492040385.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dcp4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "EdTOWB", "parent_id": "t1_dg52ydz", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "thanks for the tip. its not a steam key this way, but was able to get the deluxe commanders whatever bundle for about 33bux\n\ni assume the steam version has to log into their services anyway so there's no difference here that i can really care about", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;thanks for the tip. its not a steam key this way, but was able to get the deluxe commanders whatever bundle for about 33bux&lt;/p&gt;\n\n&lt;p&gt;i assume the steam version has to log into their services anyway so there&amp;#39;s no difference here that i can really care about&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg6dcp4", "score_hidden": false, "stickied": false, "created": 1492052795.0, "created_utc": 1492023995.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52ydz", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "skwert99", "parent_id": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "Also, it can be had at Frontier's own web site for the same prices.  Then you can use Paypal's conversion rates for paying in other currencies and save a bit more.  For instance, in US, it's $20.09, but £13.39 which converts to back to $17.29.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, it can be had at Frontier&amp;#39;s own web site for the same prices.  Then you can use Paypal&amp;#39;s conversion rates for paying in other currencies and save a bit more.  For instance, in US, it&amp;#39;s $20.09, but £13.39 which converts to back to $17.29.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg52ydz", "score_hidden": false, "stickied": false, "created": 1491980646.0, "created_utc": 1491951846.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg4sria", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MisterLamb", "parent_id": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "Im SOOOOOOOOOOO glad I held out. I almost bought this yesterday!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Im SOOOOOOOOOOO glad I held out. I almost bought this yesterday!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4sria", "score_hidden": false, "stickied": false, "created": 1491968510.0, "created_utc": 1491939710.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg6akz5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PlumbTheDerps", "parent_id": "t1_dg66cxm", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "The gameplay itself isn't difficult- there's just a ton of stuff that they never explain that the community has been forced to create tools for, the most glaring example being trade.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The gameplay itself isn&amp;#39;t difficult- there&amp;#39;s just a ton of stuff that they never explain that the community has been forced to create tools for, the most glaring example being trade.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg6akz5", "score_hidden": false, "stickied": false, "created": 1492049949.0, "created_utc": 1492021149.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg66cxm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Herlock", "parent_id": "t1_dg64qmk", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "I don't think the learning curve is that steep, the GRIND to upgrade shit is steep, there is little to actual game mechanics to learn. Compared to eve or X3... elite is nothing.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think the learning curve is that steep, the GRIND to upgrade shit is steep, there is little to actual game mechanics to learn. Compared to eve or X3... elite is nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg66cxm", "score_hidden": false, "stickied": false, "created": 1492045666.0, "created_utc": 1492016866.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64qmk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PlumbTheDerps", "parent_id": "t1_dg5vh2n", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "This is the most perfect description of the game. I sank 180 hours into it- the learning curve is very steep, and most things take a decent amount of practice to get good at, so you spend time in \"blocks\" - getting better at mining to acquire better equipment to improve your ship, for instance – hoping that the game will become more fun as you upgrade once you've finished that block. But it never does. \n\nAnd the atmosphere and sense of vastness is absolutely unparalleled. It's easy to ignore its massive flaws and get sucked in by the aesthetics, but eventually you'll burn out, whether it's after 20 hours or 200.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the most perfect description of the game. I sank 180 hours into it- the learning curve is very steep, and most things take a decent amount of practice to get good at, so you spend time in &amp;quot;blocks&amp;quot; - getting better at mining to acquire better equipment to improve your ship, for instance – hoping that the game will become more fun as you upgrade once you&amp;#39;ve finished that block. But it never does. &lt;/p&gt;\n\n&lt;p&gt;And the atmosphere and sense of vastness is absolutely unparalleled. It&amp;#39;s easy to ignore its massive flaws and get sucked in by the aesthetics, but eventually you&amp;#39;ll burn out, whether it&amp;#39;s after 20 hours or 200.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg64qmk", "score_hidden": false, "stickied": false, "created": 1492043999.0, "created_utc": 1492015199.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vh2n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Herlock", "parent_id": "t1_dg5qrux", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "The game really gets you in it's atmosphere. For a long while you stand in awe at how beautifully crafted space is...\n\nThen you start thinking \"it's gonna start being fun\"... and eventually come to the conclusion that the game really isn't because it has no goal, and few supporting mechanics to qualify as an actual sandbox (like eve).\n\nEDIT : it's worth noting that a lot of people bought it fairly early, and where waiting for more content to be provided by frontier. So they played a lot of the game at first, having stupid fun at that gigantic universe they had, testing it's limits... despite their hopes, well content never came, which leads to this situation where players sunk a lot of time but have a poor opinion of the game.", "edited": 1492005100.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The game really gets you in it&amp;#39;s atmosphere. For a long while you stand in awe at how beautifully crafted space is...&lt;/p&gt;\n\n&lt;p&gt;Then you start thinking &amp;quot;it&amp;#39;s gonna start being fun&amp;quot;... and eventually come to the conclusion that the game really isn&amp;#39;t because it has no goal, and few supporting mechanics to qualify as an actual sandbox (like eve).&lt;/p&gt;\n\n&lt;p&gt;EDIT : it&amp;#39;s worth noting that a lot of people bought it fairly early, and where waiting for more content to be provided by frontier. So they played a lot of the game at first, having stupid fun at that gigantic universe they had, testing it&amp;#39;s limits... despite their hopes, well content never came, which leads to this situation where players sunk a lot of time but have a poor opinion of the game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5vh2n", "score_hidden": false, "stickied": false, "created": 1492033490.0, "created_utc": 1492004690.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg5wnbg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Oneiricl", "parent_id": "t1_dg5qrux", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "From my own perspective, I've been looking for a game to scratch the particular itch of Freelancer for close to a decade. It seemed like E:D would do that. I invested easily a few hundred hours into it, constantly thinking, yeah, this is in early development, in time they will have things sorted out. And then Horizons came out and it seemed quite clear that like Powerplay, the devs were interested only in marketing things that would sell as \"add ons\" without ever investing their time into the game I'd been patiently playing hoping it would fill out. The same thing is what people are arguing over in this latest expansion.\n\nTo talk about a game like E:D, where the plan from the start has been a game that will continue to grow over 10 years in terms of \"OH! You played 200 hours! You must have got your money's worth.\" is ridiculous and completely missing the point. A lot of people who are upset like that bought into the idea that the game would develop over 10 years, but after 2 already have lost patience with the fact that the devs do not seem to mind if gameplay remains shallow. At some point you give up saying \"Oh, the next update will make it enjoyable\". \n\nWhat people like you don't get is these players aren't thinking \"I got 200 hours of fun out of $60/$105\". They're thinking, \"I invested $60/$105 of my money and 200 hours of my time into what I thought would be a labour of love, but now feels more like I'm just a source of revenue - I'm out!\". \n\nAlso, let's face it, 10 hours out of those 200 would be learning to fly (which is enjoyable if painful), about 150 hours would be flying from place to place through dark emptiness and another 40 hours would be actual activity. \n\nIf you're happy with E:D being a space based Euro Truck Simulator, then those 140 hours flying would be fun, if not, they're just a drag on your limited free time that you invested in something hoping it would get good or least deeper... but it hasn't and at some point you just give up. \n\nFor someone like me, who loves the idea of what E:D was to be, that's just sad - because if they can't hook you and keep you coming back, they are slowly going to bleed customers. If more people say fuck it, these guys don't have the same priorities for development, I don't want to spend any more on them, the game will die far before its 10 year mark. At some point the developers need to focus on longterm world building and not these shallow gimmicks that will sell new expansions if they want the game to last half as long as they intend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From my own perspective, I&amp;#39;ve been looking for a game to scratch the particular itch of Freelancer for close to a decade. It seemed like E:D would do that. I invested easily a few hundred hours into it, constantly thinking, yeah, this is in early development, in time they will have things sorted out. And then Horizons came out and it seemed quite clear that like Powerplay, the devs were interested only in marketing things that would sell as &amp;quot;add ons&amp;quot; without ever investing their time into the game I&amp;#39;d been patiently playing hoping it would fill out. The same thing is what people are arguing over in this latest expansion.&lt;/p&gt;\n\n&lt;p&gt;To talk about a game like E:D, where the plan from the start has been a game that will continue to grow over 10 years in terms of &amp;quot;OH! You played 200 hours! You must have got your money&amp;#39;s worth.&amp;quot; is ridiculous and completely missing the point. A lot of people who are upset like that bought into the idea that the game would develop over 10 years, but after 2 already have lost patience with the fact that the devs do not seem to mind if gameplay remains shallow. At some point you give up saying &amp;quot;Oh, the next update will make it enjoyable&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;What people like you don&amp;#39;t get is these players aren&amp;#39;t thinking &amp;quot;I got 200 hours of fun out of $60/$105&amp;quot;. They&amp;#39;re thinking, &amp;quot;I invested $60/$105 of my money and 200 hours of my time into what I thought would be a labour of love, but now feels more like I&amp;#39;m just a source of revenue - I&amp;#39;m out!&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Also, let&amp;#39;s face it, 10 hours out of those 200 would be learning to fly (which is enjoyable if painful), about 150 hours would be flying from place to place through dark emptiness and another 40 hours would be actual activity. &lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re happy with E:D being a space based Euro Truck Simulator, then those 140 hours flying would be fun, if not, they&amp;#39;re just a drag on your limited free time that you invested in something hoping it would get good or least deeper... but it hasn&amp;#39;t and at some point you just give up. &lt;/p&gt;\n\n&lt;p&gt;For someone like me, who loves the idea of what E:D was to be, that&amp;#39;s just sad - because if they can&amp;#39;t hook you and keep you coming back, they are slowly going to bleed customers. If more people say fuck it, these guys don&amp;#39;t have the same priorities for development, I don&amp;#39;t want to spend any more on them, the game will die far before its 10 year mark. At some point the developers need to focus on longterm world building and not these shallow gimmicks that will sell new expansions if they want the game to last half as long as they intend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5wnbg", "score_hidden": false, "stickied": false, "created": 1492035009.0, "created_utc": 1492006209.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qrux", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "th4", "parent_id": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "Off topic but I'm baffled at steam reviews like \"I've got 200 hours in this game, don't recommend\". Dafuq man, if I don't like a game there's no way I'm putting 200 hours in it, do people really have that much time to waste?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Off topic but I&amp;#39;m baffled at steam reviews like &amp;quot;I&amp;#39;ve got 200 hours in this game, don&amp;#39;t recommend&amp;quot;. Dafuq man, if I don&amp;#39;t like a game there&amp;#39;s no way I&amp;#39;m putting 200 hours in it, do people really have that much time to waste?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5qrux", "score_hidden": false, "stickied": false, "created": 1492025488.0, "created_utc": 1491996688.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg64le0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Left4pillz", "parent_id": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "This is a brilliant game to play in VR with a HOTAS setup, would strongly recommend especially if you've got friends to play it with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a brilliant game to play in VR with a HOTAS setup, would strongly recommend especially if you&amp;#39;ve got friends to play it with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg64le0", "score_hidden": false, "stickied": false, "created": 1492043850.0, "created_utc": 1492015050.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg5tjof", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Dopp3lGang3r", "parent_id": "t1_dg5kn19", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "I played both and NMS is nowhere near comparable to Elite. If you like that genre, I almost guarantee that you will get at least 30+ hours of interesting gameplay in Elite, just by exploring and finding stuff in game. However, after about 50+hours or maybe more depending on what you do, the game becomes increasingly repetative. All in all, I would give this game 8/10 for the first 50 hours, and later 4/10 after about 100+ hours", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I played both and NMS is nowhere near comparable to Elite. If you like that genre, I almost guarantee that you will get at least 30+ hours of interesting gameplay in Elite, just by exploring and finding stuff in game. However, after about 50+hours or maybe more depending on what you do, the game becomes increasingly repetative. All in all, I would give this game 8/10 for the first 50 hours, and later 4/10 after about 100+ hours&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5tjof", "score_hidden": false, "stickied": false, "created": 1492030686.0, "created_utc": 1492001886.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg5vplk", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Herlock", "parent_id": "t1_dg5kn19", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "E:D seems way better than NMS from what I could see of NMS. Elite space flying is truely impressive. It FEELS like you are piloting an actual spaceship.\n\nThe universe is getting you true SCIFI vibes for the first hours. Eventually you might (like many) grow tired by the lack of content.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;E:D seems way better than NMS from what I could see of NMS. Elite space flying is truely impressive. It FEELS like you are piloting an actual spaceship.&lt;/p&gt;\n\n&lt;p&gt;The universe is getting you true SCIFI vibes for the first hours. Eventually you might (like many) grow tired by the lack of content.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5vplk", "score_hidden": false, "stickied": false, "created": 1492033805.0, "created_utc": 1492005005.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5kn19", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "zizou101", "parent_id": "t1_dg5jgby", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 1, "body": "Fair enough, sounds rubbish then. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fair enough, sounds rubbish then. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5kn19", "score_hidden": false, "stickied": false, "created": 1492007796.0, "created_utc": 1491978996.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jgby", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "Maht_Daymun", "parent_id": "t1_dg56qeh", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 1, "body": "yep., basically it's No Man's Sky with even less features. In Elite you can't get out of your space ship, or walk or shoot or talk to NPCs.\n\nalso there is no story and the planets all look the same (rocks), and there aren't any creatures or vegetation in the game.", "edited": 1491980117.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yep., basically it&amp;#39;s No Man&amp;#39;s Sky with even less features. In Elite you can&amp;#39;t get out of your space ship, or walk or shoot or talk to NPCs.&lt;/p&gt;\n\n&lt;p&gt;also there is no story and the planets all look the same (rocks), and there aren&amp;#39;t any creatures or vegetation in the game.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5jgby", "score_hidden": false, "stickied": false, "created": 1492004997.0, "created_utc": 1491976197.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg56qeh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "zizou101", "parent_id": "t1_dg52tb4", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 1, "body": "Is this game something along the same lines of no mans sky?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Is this game something along the same lines of no mans sky?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg56qeh", "score_hidden": false, "stickied": false, "created": 1491985730.0, "created_utc": 1491956930.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52tb4", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Maht_Daymun", "parent_id": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 1, "body": "awful game, no gameplay, no depth, just grind and do the same a million times over again\n\n2/10\n\nwouldn't recommend at 5$\n\ndead universe, no AI, no story, no action, no point", "edited": 1491951854.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;awful game, no gameplay, no depth, just grind and do the same a million times over again&lt;/p&gt;\n\n&lt;p&gt;2/10&lt;/p&gt;\n\n&lt;p&gt;wouldn&amp;#39;t recommend at 5$&lt;/p&gt;\n\n&lt;p&gt;dead universe, no AI, no story, no action, no point&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg52tb4", "score_hidden": false, "stickied": false, "created": 1491980453.0, "created_utc": 1491951653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg57gai", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MisterLamb", "parent_id": "t1_dg4vlhy", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "I think 15 was the lowest. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think 15 was the lowest. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg57gai", "score_hidden": false, "stickied": false, "created": 1491986678.0, "created_utc": 1491957878.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4vlhy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Gemi2", "parent_id": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "is this the lowest?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;is this the lowest?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg4vlhy", "score_hidden": false, "stickied": false, "created": 1491971644.0, "created_utc": 1491942844.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qwx3", "removal_reason": null, "link_id": "t3_64sxdf", "likes": null, "replies": "", "user_reports": [], "id": "dg5tk8y", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Geeksie", "parent_id": "t1_dg52qmn", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 0, "body": "The only planned expansion is Horizons, after that, no one knows for certain what will be done. But you don't pay full price for the game again. You pay for the expansion which is no way the full price of the game was originally.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only planned expansion is Horizons, after that, no one knows for certain what will be done. But you don&amp;#39;t pay full price for the game again. You pay for the expansion which is no way the full price of the game was originally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg5tk8y", "score_hidden": false, "stickied": false, "created": 1492030710.0, "created_utc": 1492001910.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg52qmn", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ariolander", "parent_id": "t3_64sxdf", "subreddit_name_prefixed": "r/GameDeals", "controversiality": 1, "body": "This game still on that annual 'expansion' aka pay full price for the game again every year business plan they announced with Horizons?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This game still on that annual &amp;#39;expansion&amp;#39; aka pay full price for the game again every year business plan they announced with Horizons?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "GameDeals", "name": "t1_dg52qmn", "score_hidden": false, "stickied": false, "created": 1491980354.0, "created_utc": 1491951554.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]