[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "bindingofisaac", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h2&gt;Hey everybody and welcome back to another Binding of Isaac Top 10 post!&lt;/h2&gt;\n\n&lt;p&gt;Today we’re doing things a little bit differently and looking at 10 really fun synergies in the game that I’ve found. It’s not really a Top 10… Just a.. 10. I guess. It should be noted that these are my.. wait that doesn’t really work here. There’s really no reasonable way for you to have an opinion on this. But if you do! Be sure to let me know in the comments down below or post some of your favorite synergies and a dope name for them and maybe you’ll see them showcased in a post and video in the future. It’s also notable to say that the majority of these synergies you will never get in the game. Some require very odd scenarios or just many items to make them work which without breaking the game, would be difficult to come by. This is more of a post to showcase some of the cool stuff you can do in Isaac. And finally if you&amp;#39;d like to see the synergies in action in video format, &lt;a href=\"https://www.youtube.com/watch?v=0yjAdR4wSX4\"&gt;you can click here as always.&lt;/a&gt; Without further ado, 10 really dope and fun synergies.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Pump Shotgun&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Tractor Beam&lt;/em&gt;, &lt;em&gt;20/20&lt;/em&gt;, &lt;em&gt;The Wiz&lt;/em&gt;, &lt;em&gt;Inner Eye&lt;/em&gt;, &lt;em&gt;Mutant Spider&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I’ve always liked the idea of having numerous tear number upgrades at one time. The dream is to get a diplopia pull with something like 20/20. However, when you realize you can take all of the tear number upgrade items and stack each tear on top of one another with tractor beam, the dream becomes completely different. Since every tear hits the enemy, many enemies will be one-shotted and bosses will go down with a few shots. With a high rate of fire this can be stupidly good. Whys it called a shotgun and not a sniper? I’ve played a total of one first person shooter fully in my life and that was Star Wars Battlefront for the PS2, do you really think I know the difference?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Windows 8.1&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Tech X&lt;/em&gt;, &lt;em&gt;Eve’s Mascara&lt;/em&gt;, &lt;em&gt;Spoon Bender&lt;/em&gt;, &lt;em&gt;Lazy Worm&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s no better operating system than Windows 8.1. Wait, you&amp;#39;re telling me it sucked and was really slow? Welp... on the bright side, this technology is really slow but it&amp;#39;s far from sucking. When you combine Tech X with a really low shot speed, the result is many more ticks of damage to every enemy. And since Windows 8.1 was at least a recent upgrade, we&amp;#39;ll give it more damage with homing tests. With no other upgrades this is still going to completely obliterate enemies and is incredibly fun to play with. Not that Tech X isn&amp;#39;t powerful by itself but this tops it.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;King of the Poop&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Midas Touch&lt;/em&gt;, &lt;em&gt;E. Coli&lt;/em&gt;, &lt;em&gt;Dull Razor&lt;/em&gt;, &lt;em&gt;The Battery&lt;/em&gt;, &lt;em&gt;The Habit&lt;/em&gt;, &lt;em&gt;Car Battery&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Alright I had to include it. I had to include the super incredible amazing synergy that you can find a link to down below. For those that don&amp;#39;t know, it essentially uses Dull Razor to create infinite invincibility and single handedly make you a God on a run. For this synergy I decided to combine it with another great one: E. Coli and Midas Touch. This makes you the king of the poops. Can we get that transformation in the game? You can slam into enemies without taking damage due to dull Razor and infinitely turn every enemy in the game (okay not all bosses) but every normal enemy into piles of golden poop. You&amp;#39;ll have infinite money forever and oh yeah, still invincible. It&amp;#39;s a win win.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Splitting Nucleus&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Monstro’s Lung&lt;/em&gt;, &lt;em&gt;Ludovico Technique&lt;/em&gt;, &lt;em&gt;Splitshot&lt;/em&gt;, &lt;em&gt;Cricket’s Body&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This is one of my favorite synergies in the game hands down because it checks out the three major categories. 1. Powerful 2. Actually possible to get in game and 3. Looks dope as hell. Having tears infinitely split over a conglomeration of tears is satisfying as hell to look at and insanely powerful in terms of damage. With a high rate of fire this will melt bosses and is just overall a great room clearer as well. Why is this called the Splitting Nucleus? I mean it kinda looks like an atom...&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Suicide Bomber&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Kamikaze&lt;/em&gt;, &lt;em&gt;Host Hat / Pyromaniac&lt;/em&gt;, &lt;em&gt;Libra&lt;/em&gt;, &lt;em&gt;Dr. Fetus&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This is a synergy that I think most people know about by now but I wanted to step it up to the next level. Kamikaze + Pyromaniac is equivalent to infinite HP as you can heal forever, not to mention that it can do decent damage as well. What I really want to show here is the beauty of Libra and Dr. Fetus. This makes the bombs come out at a much higher rate which combined with other bomb synergies can result in a lot of explosions and high damage. With bomb immunity this is an incredibly powerful synergy and overall a fun one. Okay fine the name is a bit insensitive. You&amp;#39;re playing a game where a child stabs his mom while exploring her uterus you&amp;#39;ll survive.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;American Sniper&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Strange Attractor&lt;/em&gt;, &lt;em&gt;Epic Fetus&lt;/em&gt;, &lt;em&gt;20/20&lt;/em&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Tyler Tyler you already had a gun related pun on this list why did you put another one – &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;shut up. This is a super fun synergy that I like because it revolves around an item that is widely considered as -clears throat- hot god damn garbage. When you initially fire your Epic Fetus crosshair, Strange Attractor will suck (ha) all enemies into it similar to how the Booster Pack 1 item Black Hole works. By adding double shot, you&amp;#39;re just getting another shot on the enemies which likely ensures it kills them. It&amp;#39;s not necessarily needed for the synergy but it does make it much better. The idea of taking bad items and finding a way to make them great is fun and I think it helps people think outside the box in their item selection. There&amp;#39;s another one further down this list that follows this same mentality. Except not the next one. The next one has nothing to do with hot garbage items.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;HP Monster&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Void&lt;/em&gt;, &lt;em&gt;Book of Revelations&lt;/em&gt;, &lt;em&gt;Satanic Bible&lt;/em&gt;, &lt;em&gt;The Nail&lt;/em&gt;, &lt;em&gt;Crystal Ball&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;| Optional: &lt;em&gt;Yum Heart&lt;/em&gt;, &lt;em&gt;Prayer Card&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This combination of items can give you the most HP in one singular situation out of any other item combination in the game for a repeatable amount of times. This synergy with the Void will give you a whopping 3 temporary hearts (black or spirit) with a 50/50 chance at one more from crystal ball. This essentially means that, without any battery charge drops, you can have full HP by clearing approximately 24 rooms which is really not very many in all retrospect. In combination with Yum Heart and Prayer Card, you can stack up an infinite amount of red hearts that can heal themselves which each Void play. Oh and combine this will Car Battery and the results as you may be able to tell are just absolutely stupid. Definitely near impossible to lose this run.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Sneezy&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Sinus Infection&lt;/em&gt;, &lt;em&gt;Monstro’s Lung&lt;/em&gt;, &lt;em&gt;Scorpio&lt;/em&gt;, &lt;em&gt;Nose Goblin&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This synergy while still good is mainly here for comedic value. Combining these items makes you sneeze out some high damage phlegm snot and otherwise disgusting mucus all over your enemies! Add Scorpio to the mix and it&amp;#39;ll make all of your tears have a greenish tint which just adds even more to the realism of this &amp;#39;sick&amp;#39; synergy. Get it? It&amp;#39;s a sick totally rad synergy but it&amp;#39;s also a synergy about you getting sick? Sigh..&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Galaxies Collide&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Infinite Luck&lt;/em&gt;, &lt;em&gt;Soy Milk&lt;/em&gt;, &lt;em&gt;Libra&lt;/em&gt;, &lt;em&gt;Loki’s Horns&lt;/em&gt;, &lt;em&gt;Continuum&lt;/em&gt;, &lt;em&gt;Holy Light&lt;/em&gt;, &lt;em&gt;Tiny Planet&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This synergy is one of those &amp;quot;Yeah I&amp;#39;m never getting this item combination unless Edmund as the Lord Incarnate gives me the Dice Room of a lifetime&amp;quot; kind of synergies. It&amp;#39;s mainly on here to showcase a cool use of luck in the game which is the ability for it to be applied to Loki&amp;#39;s Horns. With a high enough luck, Loki&amp;#39;s Horns will always activate and send tears in all directions. Combine this with Tiny Planet and you have a spinning Loki tears black hole galaxy from space. Basically Holy Light and Continuum are here just for colors but they do also make the synergy that much better. I like it, I think it looks cool. Shoot me.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Silent Assassin&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Camo Undies&lt;/em&gt;, &lt;em&gt;Marked&lt;/em&gt;, &lt;em&gt;Tiny Planet&lt;/em&gt;, &lt;em&gt;Death’s Touch&lt;/em&gt;, &lt;em&gt;some tears up&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This is actually a very interested synergy that not many people know about. When Marked is activated, the game does not recognize it as you firing tears if you don&amp;#39;t move the crosshair. Therefore, an item like Camo Undies will continue to activate and make Isaac invisible even if Marked tears are firing. Combine this with Tiny Planet and any good Tiny Planet synergies and you&amp;#39;re looking at The Binding of Isaac: Silent Assassin. Until the boss fights. Sadly Camo Undies doesn&amp;#39;t work for bosses but you should have enough HP and be powerful enough to fight them after breezing through regular rooms. Pretty unique interaction and definitely a fun synergy.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;Bozo’s Pinwheel of Torture&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Items: &lt;em&gt;Bozo&lt;/em&gt;, &lt;em&gt;Brimstone&lt;/em&gt;, &lt;em&gt;Sprinkler&lt;/em&gt;, &lt;em&gt;Loki’s Horns&lt;/em&gt;, &lt;em&gt;some tears up&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;That’s all. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;This was little bit different obviously but I hope you guys still enjoyed. We’ll get back to doing some more Top 10’s and weird synergy related stuff in the near future! Once again if you have any synergies you really like that people may not know about, put a comment down below talking about them!&lt;/p&gt;\n\n&lt;p&gt;Check out some of the other Top 10 Binding of Isaac: Afterbirth lists I’ve created on Reddit if you want to see where certain items fall on my list of greatness or want to see some cool Isaac shtuff.&lt;/p&gt;\n\n&lt;p&gt;Jesus this list is getting long, I should probably cut it down sometime.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/47dncl/top_10_devil_deal_items/\"&gt;Top 10 Devil Deals&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/4c32hg/top_10_angel_deal_items/\"&gt;Top 10 Angel Deals&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/4jwt8o/top_10_most_hated_bosses_in_the_binding_of_isaac/\"&gt;Top 10 Most Hated Bosses&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/4cu63s/binding_of_isaac_afterbirth_top_10_most_hated/\"&gt;Top 10 Most Hated Enemies&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/5do5sr/top_10_trinkets_in_binding_of_isaac_afterbirth/\"&gt;Top 10 Trinkets&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/5ik00j/25_more_facts_you_may_not_have_known_about_the/\"&gt;25 MORE Facts&lt;/a&gt;. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/5wjh4t/top_10_new_items_in_afterbirth/\"&gt;Top 10 New AB+ Items&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/60x197/top_10_soy_milk_synergies/\"&gt;Top 10 Soy Milk Synergies&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/61hcdd/how_to_be_invincible_best_synergy_in_the_game/\"&gt;Greatest Synergy in the Game&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/bindingofisaac/comments/62p37w/everything_you_need_to_know_about_booster_pack_1/\"&gt;Booster Pack 1 Knowledge!&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "##Hey everybody and welcome back to another Binding of Isaac Top 10 post!\n\nToday we’re doing things a little bit differently and looking at 10 really fun synergies in the game that I’ve found. It’s not really a Top 10… Just a.. 10. I guess. It should be noted that these are my.. wait that doesn’t really work here. There’s really no reasonable way for you to have an opinion on this. But if you do! Be sure to let me know in the comments down below or post some of your favorite synergies and a dope name for them and maybe you’ll see them showcased in a post and video in the future. It’s also notable to say that the majority of these synergies you will never get in the game. Some require very odd scenarios or just many items to make them work which without breaking the game, would be difficult to come by. This is more of a post to showcase some of the cool stuff you can do in Isaac. And finally if you'd like to see the synergies in action in video format, [you can click here as always.](https://www.youtube.com/watch?v=0yjAdR4wSX4) Without further ado, 10 really dope and fun synergies.\n\n---------------------------------------------------\n\n**Pump Shotgun** \n\nItems: *Tractor Beam*, *20/20*, *The Wiz*, *Inner Eye*, *Mutant Spider*\n\nI’ve always liked the idea of having numerous tear number upgrades at one time. The dream is to get a diplopia pull with something like 20/20. However, when you realize you can take all of the tear number upgrade items and stack each tear on top of one another with tractor beam, the dream becomes completely different. Since every tear hits the enemy, many enemies will be one-shotted and bosses will go down with a few shots. With a high rate of fire this can be stupidly good. Whys it called a shotgun and not a sniper? I’ve played a total of one first person shooter fully in my life and that was Star Wars Battlefront for the PS2, do you really think I know the difference?\n\n\n---------------------------------------------------\n\n**Windows 8.1**\n\nItems: *Tech X*, *Eve’s Mascara*, *Spoon Bender*, *Lazy Worm*\n\nThere's no better operating system than Windows 8.1. Wait, you're telling me it sucked and was really slow? Welp... on the bright side, this technology is really slow but it's far from sucking. When you combine Tech X with a really low shot speed, the result is many more ticks of damage to every enemy. And since Windows 8.1 was at least a recent upgrade, we'll give it more damage with homing tests. With no other upgrades this is still going to completely obliterate enemies and is incredibly fun to play with. Not that Tech X isn't powerful by itself but this tops it.\n\n---------------------------------------------------\n\n**King of the Poop**\n\nItems: *Midas Touch*, *E. Coli*, *Dull Razor*, *The Battery*, *The Habit*, *Car Battery*\n\nAlright I had to include it. I had to include the super incredible amazing synergy that you can find a link to down below. For those that don't know, it essentially uses Dull Razor to create infinite invincibility and single handedly make you a God on a run. For this synergy I decided to combine it with another great one: E. Coli and Midas Touch. This makes you the king of the poops. Can we get that transformation in the game? You can slam into enemies without taking damage due to dull Razor and infinitely turn every enemy in the game (okay not all bosses) but every normal enemy into piles of golden poop. You'll have infinite money forever and oh yeah, still invincible. It's a win win.\n\n---------------------------------------------------\n\n**Splitting Nucleus**\n\nItems: *Monstro’s Lung*, *Ludovico Technique*, *Splitshot*, *Cricket’s Body*\n\nThis is one of my favorite synergies in the game hands down because it checks out the three major categories. 1. Powerful 2. Actually possible to get in game and 3. Looks dope as hell. Having tears infinitely split over a conglomeration of tears is satisfying as hell to look at and insanely powerful in terms of damage. With a high rate of fire this will melt bosses and is just overall a great room clearer as well. Why is this called the Splitting Nucleus? I mean it kinda looks like an atom...\n\n---------------------------------------------------\n\n**Suicide Bomber**\n\nItems: *Kamikaze*, *Host Hat / Pyromaniac*, *Libra*, *Dr. Fetus*\n\nThis is a synergy that I think most people know about by now but I wanted to step it up to the next level. Kamikaze + Pyromaniac is equivalent to infinite HP as you can heal forever, not to mention that it can do decent damage as well. What I really want to show here is the beauty of Libra and Dr. Fetus. This makes the bombs come out at a much higher rate which combined with other bomb synergies can result in a lot of explosions and high damage. With bomb immunity this is an incredibly powerful synergy and overall a fun one. Okay fine the name is a bit insensitive. You're playing a game where a child stabs his mom while exploring her uterus you'll survive.\n\n---------------------------------------------------\n\n**American Sniper**\n\nItems: *Strange Attractor*, *Epic Fetus*, *20/20*\n\n&gt; Tyler Tyler you already had a gun related pun on this list why did you put another one – \n\nshut up. This is a super fun synergy that I like because it revolves around an item that is widely considered as -clears throat- hot god damn garbage. When you initially fire your Epic Fetus crosshair, Strange Attractor will suck (ha) all enemies into it similar to how the Booster Pack 1 item Black Hole works. By adding double shot, you're just getting another shot on the enemies which likely ensures it kills them. It's not necessarily needed for the synergy but it does make it much better. The idea of taking bad items and finding a way to make them great is fun and I think it helps people think outside the box in their item selection. There's another one further down this list that follows this same mentality. Except not the next one. The next one has nothing to do with hot garbage items.\n\n---------------------------------------------------\n\n**HP Monster**\n\nItems: *Void*, *Book of Revelations*, *Satanic Bible*, *The Nail*, *Crystal Ball*\n\n| Optional: *Yum Heart*, *Prayer Card*\n\nThis combination of items can give you the most HP in one singular situation out of any other item combination in the game for a repeatable amount of times. This synergy with the Void will give you a whopping 3 temporary hearts (black or spirit) with a 50/50 chance at one more from crystal ball. This essentially means that, without any battery charge drops, you can have full HP by clearing approximately 24 rooms which is really not very many in all retrospect. In combination with Yum Heart and Prayer Card, you can stack up an infinite amount of red hearts that can heal themselves which each Void play. Oh and combine this will Car Battery and the results as you may be able to tell are just absolutely stupid. Definitely near impossible to lose this run.\n\n---------------------------------------------------\n\n**Sneezy**\n\nItems: *Sinus Infection*, *Monstro’s Lung*, *Scorpio*, *Nose Goblin*\n\nThis synergy while still good is mainly here for comedic value. Combining these items makes you sneeze out some high damage phlegm snot and otherwise disgusting mucus all over your enemies! Add Scorpio to the mix and it'll make all of your tears have a greenish tint which just adds even more to the realism of this 'sick' synergy. Get it? It's a sick totally rad synergy but it's also a synergy about you getting sick? Sigh..\n\n---------------------------------------------------\n\n**Galaxies Collide**\n\nItems: *Infinite Luck*, *Soy Milk*, *Libra*, *Loki’s Horns*, *Continuum*, *Holy Light*, *Tiny Planet*\n\nThis synergy is one of those \"Yeah I'm never getting this item combination unless Edmund as the Lord Incarnate gives me the Dice Room of a lifetime\" kind of synergies. It's mainly on here to showcase a cool use of luck in the game which is the ability for it to be applied to Loki's Horns. With a high enough luck, Loki's Horns will always activate and send tears in all directions. Combine this with Tiny Planet and you have a spinning Loki tears black hole galaxy from space. Basically Holy Light and Continuum are here just for colors but they do also make the synergy that much better. I like it, I think it looks cool. Shoot me.\n\n---------------------------------------------------\n\n**Silent Assassin**\n\nItems: *Camo Undies*, *Marked*, *Tiny Planet*, *Death’s Touch*, *some tears up*\n\nThis is actually a very interested synergy that not many people know about. When Marked is activated, the game does not recognize it as you firing tears if you don't move the crosshair. Therefore, an item like Camo Undies will continue to activate and make Isaac invisible even if Marked tears are firing. Combine this with Tiny Planet and any good Tiny Planet synergies and you're looking at The Binding of Isaac: Silent Assassin. Until the boss fights. Sadly Camo Undies doesn't work for bosses but you should have enough HP and be powerful enough to fight them after breezing through regular rooms. Pretty unique interaction and definitely a fun synergy.\n\n---------------------------------------------------\n\n**Bozo’s Pinwheel of Torture**\n\nItems: *Bozo*, *Brimstone*, *Sprinkler*, *Loki’s Horns*, *some tears up*\n\nThat’s all. \n\n---------------------------------------------------\n\nThis was little bit different obviously but I hope you guys still enjoyed. We’ll get back to doing some more Top 10’s and weird synergy related stuff in the near future! Once again if you have any synergies you really like that people may not know about, put a comment down below talking about them!\n\nCheck out some of the other Top 10 Binding of Isaac: Afterbirth lists I’ve created on Reddit if you want to see where certain items fall on my list of greatness or want to see some cool Isaac shtuff.\n\nJesus this list is getting long, I should probably cut it down sometime.\n\n* [Top 10 Devil Deals](https://www.reddit.com/r/bindingofisaac/comments/47dncl/top_10_devil_deal_items/)\n\n* [Top 10 Angel Deals](https://www.reddit.com/r/bindingofisaac/comments/4c32hg/top_10_angel_deal_items/)\n\n* [Top 10 Most Hated Bosses](https://www.reddit.com/r/bindingofisaac/comments/4jwt8o/top_10_most_hated_bosses_in_the_binding_of_isaac/)\n\n* [Top 10 Most Hated Enemies](https://www.reddit.com/r/bindingofisaac/comments/4cu63s/binding_of_isaac_afterbirth_top_10_most_hated/)\n\n* [Top 10 Trinkets](https://www.reddit.com/r/bindingofisaac/comments/5do5sr/top_10_trinkets_in_binding_of_isaac_afterbirth/)\n\n* [25 MORE Facts](https://www.reddit.com/r/bindingofisaac/comments/5ik00j/25_more_facts_you_may_not_have_known_about_the/). \n\n* [Top 10 New AB+ Items]( https://www.reddit.com/r/bindingofisaac/comments/5wjh4t/top_10_new_items_in_afterbirth/)\n\n* [Top 10 Soy Milk Synergies]( https://www.reddit.com/r/bindingofisaac/comments/60x197/top_10_soy_milk_synergies/)\n\n* [Greatest Synergy in the Game](https://www.reddit.com/r/bindingofisaac/comments/61hcdd/how_to_be_invincible_best_synergy_in_the_game/)\n\n* [Booster Pack 1 Knowledge!]( https://www.reddit.com/r/bindingofisaac/comments/62p37w/everything_you_need_to_know_about_booster_pack_1/)\n", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65e5iv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 54, "report_reasons": null, "author": "OlexaKid64", "saved": false, "mod_reports": [], "name": "t3_65e5iv", "subreddit_name_prefixed": "r/bindingofisaac", "approved_by": null, "over_18": false, "domain": "self.bindingofisaac", "hidden": false, "preview": {"images": [{"source": {"url": "https://i.redditmedia.com/gGAfCOyrXuMdScwqq7-UvSzJ7ajs73geSCOimBjUWtk.jpg?s=62ccf631512ac87339a9cf59b21e6c03", "width": 480, "height": 360}, "resolutions": [{"url": "https://i.redditmedia.com/gGAfCOyrXuMdScwqq7-UvSzJ7ajs73geSCOimBjUWtk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=0aeb8ee9212df0af93c5dcc5fb44299f", "width": 108, "height": 81}, {"url": "https://i.redditmedia.com/gGAfCOyrXuMdScwqq7-UvSzJ7ajs73geSCOimBjUWtk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=a4f9079046fecbead048aba81f843027", "width": 216, "height": 162}, {"url": "https://i.redditmedia.com/gGAfCOyrXuMdScwqq7-UvSzJ7ajs73geSCOimBjUWtk.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=f1f8e61bd52bac111aa31f9373ca78e5", "width": 320, "height": 240}], "variants": {}, "id": "tP0bkHUncwNqIMwbWeHuZTIqbfpd6dhhE208vLz-wwU"}], "enabled": false}, "thumbnail": "self", "subreddit_id": "t5_2sxpk", "edited": false, "link_flair_css_class": null, "author_flair_css_class": "deathstouch", "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "post_hint": "self", "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/bindingofisaac/comments/65e5iv/10_awesome_isaac_synergies/", "num_reports": null, "locked": false, "stickied": false, "created": 1492222105.0, "url": "https://www.reddit.com/r/bindingofisaac/comments/65e5iv/10_awesome_isaac_synergies/", "author_flair_text": "", "quarantine": false, "title": "10 Awesome Isaac Synergies!", "created_utc": 1492193305.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 54}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sxpk", "removal_reason": null, "link_id": "t3_65e5iv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sxpk", "removal_reason": null, "link_id": "t3_65e5iv", "likes": null, "replies": "", "user_reports": [], "id": "dga8fqv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OlexaKid64", "parent_id": "t1_dg9wpyw", "subreddit_name_prefixed": "r/bindingofisaac", "controversiality": 0, "body": "Oooooooooooooooh. I like that a lot. I'm gathering up a bunch of nice synergies from you guys. I may have to showcase this in a future synergy video!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oooooooooooooooh. I like that a lot. I&amp;#39;m gathering up a bunch of nice synergies from you guys. I may have to showcase this in a future synergy video!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bindingofisaac", "name": "t1_dga8fqv", "score_hidden": false, "stickied": false, "created": 1492256448.0, "created_utc": 1492227648.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9wpyw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "minermb", "parent_id": "t3_65e5iv", "subreddit_name_prefixed": "r/bindingofisaac", "controversiality": 0, "body": "Eye of belial with the parasite, cricket's body or compound fracture is also pretty good. Every tear has the eye of belial effect, which is great.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eye of belial with the parasite, cricket&amp;#39;s body or compound fracture is also pretty good. Every tear has the eye of belial effect, which is great.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bindingofisaac", "name": "t1_dg9wpyw", "score_hidden": false, "stickied": false, "created": 1492240100.0, "created_utc": 1492211300.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sxpk", "removal_reason": null, "link_id": "t3_65e5iv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sxpk", "removal_reason": null, "link_id": "t3_65e5iv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sxpk", "removal_reason": null, "link_id": "t3_65e5iv", "likes": null, "replies": "", "user_reports": [], "id": "dgadlgj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tryharder6968", "parent_id": "t1_dgad4ek", "subreddit_name_prefixed": "r/bindingofisaac", "controversiality": 0, "body": "There was one mode where you played only as the Jedi and all the special characters, can't recall the name, but it had the absolute strangest, even for Star Wars, soundtrack I have ever heard.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There was one mode where you played only as the Jedi and all the special characters, can&amp;#39;t recall the name, but it had the absolute strangest, even for Star Wars, soundtrack I have ever heard.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bindingofisaac", "name": "t1_dgadlgj", "score_hidden": false, "stickied": false, "created": 1492266119.0, "created_utc": 1492237319.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgad4ek", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OlexaKid64", "parent_id": "t1_dgabhzd", "subreddit_name_prefixed": "r/bindingofisaac", "controversiality": 0, "body": "Hands down definitely a top 5 game I've ever played. Games the GOAT.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hands down definitely a top 5 game I&amp;#39;ve ever played. Games the GOAT.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bindingofisaac", "name": "t1_dgad4ek", "score_hidden": false, "stickied": false, "created": 1492265079.0, "created_utc": 1492236279.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgabhzd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "tryharder6968", "parent_id": "t3_65e5iv", "subreddit_name_prefixed": "r/bindingofisaac", "controversiality": 0, "body": "Upvotes the moment I saw starwars battlefront 2 for ps2 referenced. Still got that game, and, sue me, I play it every now and then.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Upvotes the moment I saw starwars battlefront 2 for ps2 referenced. Still got that game, and, sue me, I play it every now and then.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bindingofisaac", "name": "t1_dgabhzd", "score_hidden": false, "stickied": false, "created": 1492261727.0, "created_utc": 1492232927.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sxpk", "removal_reason": null, "link_id": "t3_65e5iv", "likes": null, "replies": "", "user_reports": [], "id": "dgaiabl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "banana_person", "parent_id": "t3_65e5iv", "subreddit_name_prefixed": "r/bindingofisaac", "controversiality": 0, "body": "Ipecac + Soy milk + Dr Fetus", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ipecac + Soy milk + Dr Fetus&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "bindingofisaac", "name": "t1_dgaiabl", "score_hidden": false, "stickied": false, "created": 1492279470.0, "created_utc": 1492250670.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]