[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "hacking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone. My apologies if this isn&amp;#39;t the proper place to post this (if there is a better place then please direct me!) \nI was wondering if it&amp;#39;s possible to get a location hit for a stolen phone using the IMEI? &lt;/p&gt;\n\n&lt;p&gt;I could care less about recovering the phone itself, but it was stolen from my bfs work truck after the guy tried to mow him down / run over his bosses car and have complete disregard for human life when driving on the sidewalk. &lt;/p&gt;\n\n&lt;p&gt;Before he ditched the stolen truck he took my bfs wallet cellphone and keys (our house and car) then a few days later used the address on the stolen ID to come to our house and steal our car with the key. Thankfully we got our car back after a week but this is a part of a bigger bullshit scumbag ring so I was hoping to get the last known location of the phone (find my iPhone is showing nothing but &amp;quot;offline&amp;quot;) to pass off to the detective. He won&amp;#39;t care how I got the general location, so no worries on that. &lt;/p&gt;\n\n&lt;p&gt;These people came to my home where I have a young (10) daughter. I&amp;#39;m scared shitless and want these people in jail. &lt;/p&gt;\n\n&lt;p&gt;Thanks ! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi everyone. My apologies if this isn't the proper place to post this (if there is a better place then please direct me!) \nI was wondering if it's possible to get a location hit for a stolen phone using the IMEI? \n\nI could care less about recovering the phone itself, but it was stolen from my bfs work truck after the guy tried to mow him down / run over his bosses car and have complete disregard for human life when driving on the sidewalk. \n\nBefore he ditched the stolen truck he took my bfs wallet cellphone and keys (our house and car) then a few days later used the address on the stolen ID to come to our house and steal our car with the key. Thankfully we got our car back after a week but this is a part of a bigger bullshit scumbag ring so I was hoping to get the last known location of the phone (find my iPhone is showing nothing but \"offline\") to pass off to the detective. He won't care how I got the general location, so no worries on that. \n\nThese people came to my home where I have a young (10) daughter. I'm scared shitless and want these people in jail. \n\nThanks ! ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64vfcb", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "Meggzwell", "saved": false, "mod_reports": [], "name": "t3_64vfcb", "subreddit_name_prefixed": "r/hacking", "approved_by": null, "over_18": false, "domain": "self.hacking", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhva", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/hacking/comments/64vfcb/imei_tracking/", "num_reports": null, "locked": false, "stickied": false, "created": 1491992102.0, "url": "https://www.reddit.com/r/hacking/comments/64vfcb/imei_tracking/", "author_flair_text": null, "quarantine": false, "title": "IMEI Tracking?", "created_utc": 1491963302.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhva", "removal_reason": null, "link_id": "t3_64vfcb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhva", "removal_reason": null, "link_id": "t3_64vfcb", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhva", "removal_reason": null, "link_id": "t3_64vfcb", "likes": null, "replies": "", "user_reports": [], "id": "dg5h3x4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "stayingprivateqa", "parent_id": "t1_dg5gmty", "subreddit_name_prefixed": "r/hacking", "controversiality": 0, "body": "Canada shouldn't have in difference in the TKStar / GPS options. Here's another potential \"trick\" you could try: http://www.toimii.com/gps/, but it seems pretty technology specific.\n\nActive sessions could give you some insight. Like Facebook, other web services like GMail will tell you all the devices your logged in on and their IPs. You could use this or some other service to track what WiFi hotspots the phone is connecting to. If you get the IPs and ran a Looking Glass traceroute to the IP address associated with the Wifi (Let's pretend the IP is 24.95.192.1, part of TWC's Autonomous System AS10796 - http://www.cidr-report.org/cgi-bin/as-report?as=AS10796&amp;view=2.0), you may see a hop preceding the IP to be something like \"bu-ether12.nycmny837aw-bcr00.tbone.rr.com\" - noting the \"nycmny83\" portion... Let's explain that code - there is a REAL Time Warner Cable router named \"bu-ether12.nycmny837aw-bcr00.tbone.rr.com\". nycmny83 is what's called a Common Language Location Identifier (CLLI) code carriers use to be able to tell eachother the names of specific facilities / buildings. CLLI is a database maintained by Telcordia - something for another discussion.\n\nAs the name implies, nycmny83 is located in NYC, NY - so we're getting close. Googling nycmny83, and digging through results tells us the facility is located at 111 8th Avenue in New York, NY; So, if proximity is any indicator, the guy may be around somewhere served by that location.\n\nNot sure if they've patched it, but if your BF had Telegram on his phone, you could look into this technique: https://www.thetechverse.com/hijacking-whatsapp-and-telegram-accounts-using-ss7-exploit/ have him re-gain access to the phone's telegram account, and have a similar Google Doc AppScript use Telegram's \"Change Account Profile\" picture. The thief would need to keep clicking on the text message, but the picture it takes to change the profile's picture should be of his surroundings.\n\nBest of luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Canada shouldn&amp;#39;t have in difference in the TKStar / GPS options. Here&amp;#39;s another potential &amp;quot;trick&amp;quot; you could try: &lt;a href=\"http://www.toimii.com/gps/\"&gt;http://www.toimii.com/gps/&lt;/a&gt;, but it seems pretty technology specific.&lt;/p&gt;\n\n&lt;p&gt;Active sessions could give you some insight. Like Facebook, other web services like GMail will tell you all the devices your logged in on and their IPs. You could use this or some other service to track what WiFi hotspots the phone is connecting to. If you get the IPs and ran a Looking Glass traceroute to the IP address associated with the Wifi (Let&amp;#39;s pretend the IP is 24.95.192.1, part of TWC&amp;#39;s Autonomous System AS10796 - &lt;a href=\"http://www.cidr-report.org/cgi-bin/as-report?as=AS10796&amp;amp;view=2.0\"&gt;http://www.cidr-report.org/cgi-bin/as-report?as=AS10796&amp;amp;view=2.0&lt;/a&gt;), you may see a hop preceding the IP to be something like &amp;quot;bu-ether12.nycmny837aw-bcr00.tbone.rr.com&amp;quot; - noting the &amp;quot;nycmny83&amp;quot; portion... Let&amp;#39;s explain that code - there is a REAL Time Warner Cable router named &amp;quot;bu-ether12.nycmny837aw-bcr00.tbone.rr.com&amp;quot;. nycmny83 is what&amp;#39;s called a Common Language Location Identifier (CLLI) code carriers use to be able to tell eachother the names of specific facilities / buildings. CLLI is a database maintained by Telcordia - something for another discussion.&lt;/p&gt;\n\n&lt;p&gt;As the name implies, nycmny83 is located in NYC, NY - so we&amp;#39;re getting close. Googling nycmny83, and digging through results tells us the facility is located at 111 8th Avenue in New York, NY; So, if proximity is any indicator, the guy may be around somewhere served by that location.&lt;/p&gt;\n\n&lt;p&gt;Not sure if they&amp;#39;ve patched it, but if your BF had Telegram on his phone, you could look into this technique: &lt;a href=\"https://www.thetechverse.com/hijacking-whatsapp-and-telegram-accounts-using-ss7-exploit/\"&gt;https://www.thetechverse.com/hijacking-whatsapp-and-telegram-accounts-using-ss7-exploit/&lt;/a&gt; have him re-gain access to the phone&amp;#39;s telegram account, and have a similar Google Doc AppScript use Telegram&amp;#39;s &amp;quot;Change Account Profile&amp;quot; picture. The thief would need to keep clicking on the text message, but the picture it takes to change the profile&amp;#39;s picture should be of his surroundings.&lt;/p&gt;\n\n&lt;p&gt;Best of luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "hacking", "name": "t1_dg5h3x4", "score_hidden": false, "stickied": false, "created": 1492000466.0, "created_utc": 1491971666.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5gmty", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meggzwell", "parent_id": "t1_dg5g2vb", "subreddit_name_prefixed": "r/hacking", "controversiality": 0, "body": "Thank you so much for your reply. I am located in Canada so I am not sure if that means anything regarding the apps. \nWhat if I signed on to his iCloud via my iPad to authenticate the SMS? \n\nThe phone was password protected so he shouldn't of been able to get in to us any apps although I did ask my bf to sign into his Facebook to see the active sessions and his messenger wasn't listed on there like it shows on my active sessions so that is troubling. \n\nI wish I didn't miss the 24 hour window for the last known location in find my iPhone (I am more savvy than he, plus I graduated from police foundation's and I am currently doing my post grad for forensics so I am more into the sleuthing than him as well) if the phone was pawned or wiped, the device wouldn't be listed in his devices on iCloud correct? \nThanks again. I do appreciate your help. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for your reply. I am located in Canada so I am not sure if that means anything regarding the apps. \nWhat if I signed on to his iCloud via my iPad to authenticate the SMS? &lt;/p&gt;\n\n&lt;p&gt;The phone was password protected so he shouldn&amp;#39;t of been able to get in to us any apps although I did ask my bf to sign into his Facebook to see the active sessions and his messenger wasn&amp;#39;t listed on there like it shows on my active sessions so that is troubling. &lt;/p&gt;\n\n&lt;p&gt;I wish I didn&amp;#39;t miss the 24 hour window for the last known location in find my iPhone (I am more savvy than he, plus I graduated from police foundation&amp;#39;s and I am currently doing my post grad for forensics so I am more into the sleuthing than him as well) if the phone was pawned or wiped, the device wouldn&amp;#39;t be listed in his devices on iCloud correct? \nThanks again. I do appreciate your help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "hacking", "name": "t1_dg5gmty", "score_hidden": false, "stickied": false, "created": 1491999632.0, "created_utc": 1491970832.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5g2vb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "stayingprivateqa", "parent_id": "t3_64vfcb", "subreddit_name_prefixed": "r/hacking", "controversiality": 0, "body": "Probably not what you're looking for, but this is a \"it depends\" situation. IMEI alone via ping proximity or triangulation is, indeed, facilitated by a warrant or other court order.\n\nHowever, you may have some options. If the device was GSM-based (largely international, but AT&amp;T and T-mobile in the United States), you may be able to \"trick\" some third-party apps into believing the device is part of their network. TKSTAR's GPS app comes to mind, and requires things like the IMEI and number of the device, But I believe it does initial authentication via SMS text message response; so maybe the thief is dumb enough to respond to the text? This would give you triangulated or proximity coordinates (depending on cell coverage) since the device doesn't have an authenticated GPS component compatible with TKSTAR.\n\nOther apps may offer insight as well - like location based social media if the guy is using the app. But if it's registering as \"off\", he likely turned it off and pawned it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Probably not what you&amp;#39;re looking for, but this is a &amp;quot;it depends&amp;quot; situation. IMEI alone via ping proximity or triangulation is, indeed, facilitated by a warrant or other court order.&lt;/p&gt;\n\n&lt;p&gt;However, you may have some options. If the device was GSM-based (largely international, but AT&amp;amp;T and T-mobile in the United States), you may be able to &amp;quot;trick&amp;quot; some third-party apps into believing the device is part of their network. TKSTAR&amp;#39;s GPS app comes to mind, and requires things like the IMEI and number of the device, But I believe it does initial authentication via SMS text message response; so maybe the thief is dumb enough to respond to the text? This would give you triangulated or proximity coordinates (depending on cell coverage) since the device doesn&amp;#39;t have an authenticated GPS component compatible with TKSTAR.&lt;/p&gt;\n\n&lt;p&gt;Other apps may offer insight as well - like location based social media if the guy is using the app. But if it&amp;#39;s registering as &amp;quot;off&amp;quot;, he likely turned it off and pawned it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "hacking", "name": "t1_dg5g2vb", "score_hidden": false, "stickied": false, "created": 1491998690.0, "created_utc": 1491969890.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qhva", "removal_reason": null, "link_id": "t3_64vfcb", "likes": null, "replies": "", "user_reports": [], "id": "dg5bza8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Meggzwell", "parent_id": "t3_64vfcb", "subreddit_name_prefixed": "r/hacking", "controversiality": 0, "body": "I would like to add that phone companies will not give the police ping info without warrant (and only then there has to be exigent circumstances like immediate threat to life to obtain that) and I do have dash cam footage from the initial theft of the work truck that was uploaded to YouTube to give credibility to my request. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would like to add that phone companies will not give the police ping info without warrant (and only then there has to be exigent circumstances like immediate threat to life to obtain that) and I do have dash cam footage from the initial theft of the work truck that was uploaded to YouTube to give credibility to my request. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "hacking", "name": "t1_dg5bza8", "score_hidden": false, "stickied": false, "created": 1491992632.0, "created_utc": 1491963832.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]