[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "hacking", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey, so I was running a scan today, using Hitman Pro, because I noticed that it&amp;#39;s been a long time since my last scan, and discovered that I had malware on my machine. The source was an application (a bot for sneakers) that I&amp;#39;ve had for almost a year. So, needless to say, I was surprised that this was the source of the alleged malware, since all the previous scans did not flag that program. It&amp;#39;s leading me to believe that it might be a module from an update that was pushed to the program, some time in the past few months. The malware was a Trojan, tagged as msilperseus. I did a quick Google search on it, couldn&amp;#39;t find much at all. Then, I uploaded the file to virustotal, and got a 9/61 detection rate. Scanned it with my other (permanent) software, it did not detect anything. I thought this was odd, so I decided to contact the admin of the bot. He said it was a false-positive, but did not sound really convincing, at all. My conclusion, at this point, is that the nature of the program (callbacks/web requests, unknown vendor) make some antiviruses think that it&amp;#39;s a Trojan, supporting the notion that it&amp;#39;s a false-positive. Do you guys agree? Is there any way to check if this is truly a Trojan (Wireshark, etc)? Thanks a lot&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey, so I was running a scan today, using Hitman Pro, because I noticed that it's been a long time since my last scan, and discovered that I had malware on my machine. The source was an application (a bot for sneakers) that I've had for almost a year. So, needless to say, I was surprised that this was the source of the alleged malware, since all the previous scans did not flag that program. It's leading me to believe that it might be a module from an update that was pushed to the program, some time in the past few months. The malware was a Trojan, tagged as msilperseus. I did a quick Google search on it, couldn't find much at all. Then, I uploaded the file to virustotal, and got a 9/61 detection rate. Scanned it with my other (permanent) software, it did not detect anything. I thought this was odd, so I decided to contact the admin of the bot. He said it was a false-positive, but did not sound really convincing, at all. My conclusion, at this point, is that the nature of the program (callbacks/web requests, unknown vendor) make some antiviruses think that it's a Trojan, supporting the notion that it's a false-positive. Do you guys agree? Is there any way to check if this is truly a Trojan (Wireshark, etc)? Thanks a lot", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64vkz6", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1, "report_reasons": null, "author": "yungboul", "saved": false, "mod_reports": [], "name": "t3_64vkz6", "subreddit_name_prefixed": "r/hacking", "approved_by": null, "over_18": false, "domain": "self.hacking", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qhva", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/hacking/comments/64vkz6/detecting_falsepositives/", "num_reports": null, "locked": false, "stickied": false, "created": 1491993990.0, "url": "https://www.reddit.com/r/hacking/comments/64vkz6/detecting_falsepositives/", "author_flair_text": null, "quarantine": false, "title": "Detecting False-positives", "created_utc": 1491965190.0, "distinguished": null, "media": null, "upvote_ratio": 0.67, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhva", "removal_reason": null, "link_id": "t3_64vkz6", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qhva", "removal_reason": null, "link_id": "t3_64vkz6", "likes": null, "replies": "", "user_reports": [], "id": "dg5t0rh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "yungboul", "parent_id": "t1_dg5mh7e", "subreddit_name_prefixed": "r/hacking", "controversiality": 0, "body": "Yeah, that was the path I was leaning toward taking, since I already quarantined the file. I also ran Wireshark, and didn't see any odd traffic, so now I'm less suspicious of any malware. But thank you for your help, appreciate it ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, that was the path I was leaning toward taking, since I already quarantined the file. I also ran Wireshark, and didn&amp;#39;t see any odd traffic, so now I&amp;#39;m less suspicious of any malware. But thank you for your help, appreciate it &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "hacking", "name": "t1_dg5t0rh", "score_hidden": false, "stickied": false, "created": 1492029842.0, "created_utc": 1492001042.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mh7e", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Yamitenshi", "parent_id": "t3_64vkz6", "subreddit_name_prefixed": "r/hacking", "controversiality": 0, "body": "If you know what it is and what it does, and other antivirus programs don't flag it, leave it - it probably is a false positive due to Hitman Pro flagging legitimate behaviour as harmful. \n\nOtherwise, quarantine it and see if anything breaks. If it doesn't, just delete it - better safe than sorry. \n\nIf you know what it is and where you got it, you could always err on the side of caution and reinstall after deleting the file Hitman says is infected. If it still says so after a reinstall, it's probably a false positive. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you know what it is and what it does, and other antivirus programs don&amp;#39;t flag it, leave it - it probably is a false positive due to Hitman Pro flagging legitimate behaviour as harmful. &lt;/p&gt;\n\n&lt;p&gt;Otherwise, quarantine it and see if anything breaks. If it doesn&amp;#39;t, just delete it - better safe than sorry. &lt;/p&gt;\n\n&lt;p&gt;If you know what it is and where you got it, you could always err on the side of caution and reinstall after deleting the file Hitman says is infected. If it still says so after a reinstall, it&amp;#39;s probably a false positive. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "hacking", "name": "t1_dg5mh7e", "score_hidden": false, "stickied": false, "created": 1492012821.0, "created_utc": 1491984021.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]