[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everything is in the thread name.\nI had my wild first lucid dream ever, which was also more or less my first lucid dream period since dild tends no to work or only for 5 seconds. \nFun fact regarding the story, I tried for hours and it didn&amp;#39;t work, and only worked when I decided that &amp;quot;screw that, I&amp;#39;m not that sleepy but I still have to sleep or I&amp;#39;ll be tired later, I&amp;#39;m going to sleep period, screw it&amp;quot; and bam, WILD. (I thought the &amp;quot;noise&amp;quot; would be more overwhelming than that from what I&amp;#39;ve read, by the way, it was VERY soft and the feeling during the transition was absolutely great).&lt;/p&gt;\n\n&lt;p&gt;While I had an hard time with controls (......for some reason everything I tried to create changed into kicklees; yes the pokemon, no, don&amp;#39;t ask me I have absolutely no idea and I don&amp;#39;t see any possible reason for it neither.) it worked, and  I think the only thing that was different was that I think I was NOT on the back  but rather on the side the whole time, which is... the opposite of pretty much everything I&amp;#39;ve ever read in any guide about LD, which tended to be &amp;quot;on the back with the arms on the sides&amp;quot; (a position I usualy sleep in but that always got me stuck at the SP phase at every LD attempts).&lt;/p&gt;\n\n&lt;p&gt;Can your position be an &amp;quot;important enough&amp;quot; factor to make it a work-doesn&amp;#39;t work deal by itself no matter everything else? I guess it could be important but it being seemingly SO important and being a deal breaker by itself seems strange.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Everything is in the thread name.\nI had my wild first lucid dream ever, which was also more or less my first lucid dream period since dild tends no to work or only for 5 seconds. \nFun fact regarding the story, I tried for hours and it didn't work, and only worked when I decided that \"screw that, I'm not that sleepy but I still have to sleep or I'll be tired later, I'm going to sleep period, screw it\" and bam, WILD. (I thought the \"noise\" would be more overwhelming than that from what I've read, by the way, it was VERY soft and the feeling during the transition was absolutely great).\n\nWhile I had an hard time with controls (......for some reason everything I tried to create changed into kicklees; yes the pokemon, no, don't ask me I have absolutely no idea and I don't see any possible reason for it neither.) it worked, and  I think the only thing that was different was that I think I was NOT on the back  but rather on the side the whole time, which is... the opposite of pretty much everything I've ever read in any guide about LD, which tended to be \"on the back with the arms on the sides\" (a position I usualy sleep in but that always got me stuck at the SP phase at every LD attempts).\n\n\nCan your position be an \"important enough\" factor to make it a work-doesn't work deal by itself no matter everything else? I guess it could be important but it being seemingly SO important and being a deal breaker by itself seems strange.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64r9zs", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "elkeryos", "saved": false, "mod_reports": [], "name": "t3_64r9zs", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/64r9zs/do_some_position_work_better_than_others_for_wild/", "num_reports": null, "locked": false, "stickied": false, "created": 1491950973.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/64r9zs/do_some_position_work_better_than_others_for_wild/", "author_flair_text": null, "quarantine": false, "title": "Do some position work better than others for WILD?", "created_utc": 1491922173.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]