[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This prompted me to retrieve my old account just to post this.&lt;/p&gt;\n\n&lt;p&gt;I finally had my first lucid dream last night; nothing fancy. I found myself back in a handball gym where I used to play 10 years ago, surrounded by handball balls and laying on the ground. I stood up, realized where I was and asked a teammate which year it was... when he replied it was 2007, I began to panic as the thought of &amp;quot;have I been hit on the head and dreamed ten years of my life?&amp;quot; started to set in. &lt;/p&gt;\n\n&lt;p&gt;After a few moments however, I started to think: &amp;quot;maybe this is actually a dream, not the other way around&amp;quot;. So, panicking as I was to try and prove this was a dream, I did what any sensible man would do... and start shooting laser beams out of my hands. The relief that this was just a dream immediately woke me up, but the brief sensation of &amp;quot;holy shit I&amp;#39;m dreaming and shooting lasers&amp;quot; was really darn fun.&lt;/p&gt;\n\n&lt;p&gt;Thing is, I&amp;#39;ve never kept any dream journals nor done any reality checks in my life, so this was purely accidental. Now I think I&amp;#39;m going to start doing them as I want to repeat this feeling.&lt;/p&gt;\n\n&lt;p&gt;Sorry if I&amp;#39;ve rambled a bit, I just really wanted to share this story with people who know about the subject, hopefully this is the right place; I have never posted in a reddit before.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This prompted me to retrieve my old account just to post this.\n\nI finally had my first lucid dream last night; nothing fancy. I found myself back in a handball gym where I used to play 10 years ago, surrounded by handball balls and laying on the ground. I stood up, realized where I was and asked a teammate which year it was... when he replied it was 2007, I began to panic as the thought of \"have I been hit on the head and dreamed ten years of my life?\" started to set in. \n\nAfter a few moments however, I started to think: \"maybe this is actually a dream, not the other way around\". So, panicking as I was to try and prove this was a dream, I did what any sensible man would do... and start shooting laser beams out of my hands. The relief that this was just a dream immediately woke me up, but the brief sensation of \"holy shit I'm dreaming and shooting lasers\" was really darn fun.\n\nThing is, I've never kept any dream journals nor done any reality checks in my life, so this was purely accidental. Now I think I'm going to start doing them as I want to repeat this feeling.\n\nSorry if I've rambled a bit, I just really wanted to share this story with people who know about the subject, hopefully this is the right place; I have never posted in a reddit before.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64wr5i", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 3, "report_reasons": null, "author": "Akrakorn", "saved": false, "mod_reports": [], "name": "t3_64wr5i", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/64wr5i/had_my_first_and_accidental_lucid_dreaming_last/", "num_reports": null, "locked": false, "stickied": false, "created": 1492011463.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/64wr5i/had_my_first_and_accidental_lucid_dreaming_last/", "author_flair_text": null, "quarantine": false, "title": "Had my first and accidental lucid dreaming last night", "created_utc": 1491982663.0, "distinguished": null, "media": null, "upvote_ratio": 0.72, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]