[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So yesterday I was hoping to get a Lucid dream, I&amp;#39;ve repeated a mantra to myself last couple of days. Some very strange things happened that I wanted to get my mind off, or look at differently. I&amp;#39;ve had two dreams last night, one of which I think may have been sort of a Lucid dream but I&amp;#39;m not sure.&lt;/p&gt;\n\n&lt;p&gt;Basically it was of what I wanted to try Lucid dream about, and I felt like I was in control of what I was doing, but I didn&amp;#39;t feel the realism that people say it is. I didn&amp;#39;t reality check, but in it I kept saying I was lucid dreaming. I can&amp;#39;t tell if this was some sort of half Lucid dream, where I was sort of aware of what was happening and had the illusion of control, or just a regular dream that got affected by yesterday&amp;#39;s thought process making me think that it was an actual Lucid dream.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t remember everything. But I do remember most (for example I remember being able to climb structures like some sort of parkour master, and being able to turn on and off lights at my will remotely) but it didn&amp;#39;t feel like what others said it felt like (full control, colours, actual physical feeling) and thinking back on it now, doesn&amp;#39;t make me feel in control even if in the dream I felt sort of in control.&lt;/p&gt;\n\n&lt;p&gt;So what did I have exactly, and how could I make it a full Lucid dream with less nightmares as possible? Thanks in advance :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So yesterday I was hoping to get a Lucid dream, I've repeated a mantra to myself last couple of days. Some very strange things happened that I wanted to get my mind off, or look at differently. I've had two dreams last night, one of which I think may have been sort of a Lucid dream but I'm not sure.\n\nBasically it was of what I wanted to try Lucid dream about, and I felt like I was in control of what I was doing, but I didn't feel the realism that people say it is. I didn't reality check, but in it I kept saying I was lucid dreaming. I can't tell if this was some sort of half Lucid dream, where I was sort of aware of what was happening and had the illusion of control, or just a regular dream that got affected by yesterday's thought process making me think that it was an actual Lucid dream.\n\nI don't remember everything. But I do remember most (for example I remember being able to climb structures like some sort of parkour master, and being able to turn on and off lights at my will remotely) but it didn't feel like what others said it felt like (full control, colours, actual physical feeling) and thinking back on it now, doesn't make me feel in control even if in the dream I felt sort of in control.\n\nSo what did I have exactly, and how could I make it a full Lucid dream with less nightmares as possible? Thanks in advance :)", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64wsy1", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 6, "report_reasons": null, "author": "Stelum", "saved": false, "mod_reports": [], "name": "t3_64wsy1", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/64wsy1/such_a_thing_as_a_semi_lucid_dream/", "num_reports": null, "locked": false, "stickied": false, "created": 1492012375.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/64wsy1/such_a_thing_as_a_semi_lucid_dream/", "author_flair_text": null, "quarantine": false, "title": "Such a thing as a semi Lucid dream?", "created_utc": 1491983575.0, "distinguished": null, "media": null, "upvote_ratio": 0.81, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg5n1jd", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stelum", "parent_id": "t1_dg5my56", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I suppose it makes sense. I've got another question. I was reading an article on WILD like 5 seconds ago because I didn't know what it meant, and when I knew what it was I realised I may have had a similar experience.\n\nThe other day I wanted to lie in bed and watch a ton of YouTube to calm me down, and I was getting sleepy during a Kerbal Space Program video. I closed my eyes but still listened to the video. At one point I just felt as if my ears were tensing (because they made that deep sound you hear like an airplane landing) and felt what were like waves of different feelings passing through my body. I still heard the video, and realised I kinda sorta couldn't move. But once I realised I just thought of moving for a couple of seconds and quickly opened my eyes, video however was over by this point, which didn't make any sense to me because last I checked it before sleep was at only a quarter of it, and my experience seemed to last me just about 5 mins (which would've made the video be at only half).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suppose it makes sense. I&amp;#39;ve got another question. I was reading an article on WILD like 5 seconds ago because I didn&amp;#39;t know what it meant, and when I knew what it was I realised I may have had a similar experience.&lt;/p&gt;\n\n&lt;p&gt;The other day I wanted to lie in bed and watch a ton of YouTube to calm me down, and I was getting sleepy during a Kerbal Space Program video. I closed my eyes but still listened to the video. At one point I just felt as if my ears were tensing (because they made that deep sound you hear like an airplane landing) and felt what were like waves of different feelings passing through my body. I still heard the video, and realised I kinda sorta couldn&amp;#39;t move. But once I realised I just thought of moving for a couple of seconds and quickly opened my eyes, video however was over by this point, which didn&amp;#39;t make any sense to me because last I checked it before sleep was at only a quarter of it, and my experience seemed to last me just about 5 mins (which would&amp;#39;ve made the video be at only half).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5n1jd", "score_hidden": false, "stickied": false, "created": 1492014548.0, "created_utc": 1491985748.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5my56", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "KenRaijin", "parent_id": "t1_dg5mmb3", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I've never really worried about sleep paralysis. And never even heard of lucid nightmares. \n\nI once had a demonic monkey attacking me when I realized I was in a dream. First thing I did was simply make it vanish. It had the saddest expression on its face. Imagine what face Lucifer would make when he knew god was about to smite him down to hell. That's basically the face the monkey made. \n\nWhen you have all the power all you have to do is use it. And besides, even if sleep paralysis happens who cares? I feel like it'd be more of a rush than anything else! Never had one, however.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never really worried about sleep paralysis. And never even heard of lucid nightmares. &lt;/p&gt;\n\n&lt;p&gt;I once had a demonic monkey attacking me when I realized I was in a dream. First thing I did was simply make it vanish. It had the saddest expression on its face. Imagine what face Lucifer would make when he knew god was about to smite him down to hell. That&amp;#39;s basically the face the monkey made. &lt;/p&gt;\n\n&lt;p&gt;When you have all the power all you have to do is use it. And besides, even if sleep paralysis happens who cares? I feel like it&amp;#39;d be more of a rush than anything else! Never had one, however.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5my56", "score_hidden": false, "stickied": false, "created": 1492014260.0, "created_utc": 1491985460.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg5nrat", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stelum", "parent_id": "t1_dg5npn0", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Thanks very much :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks very much :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5nrat", "score_hidden": false, "stickied": false, "created": 1492016815.0, "created_utc": 1491988015.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5npn0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "fjodpod", "parent_id": "t1_dg5mmb3", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I had similar experience with dreams which was \"semi lucid\", i had a lot of them after i started practicing. Later on i started practicing being more aware on my surroundings and some nights after that i had a clear LD, but it was short (got over excited). So i guess you're close but not completely there yet. Try to do more reality checks and read this http://www.dreamviews.com/wiki/Dream-Stabilization-and-Clarity-Tutorial it helped me a bit\n\nAlso about nightmares, when i was a child i started LDing because of nightmares and i didn't knew what LDing was, but i did it anyways. I made a safe zone at my school, if i got there everything was peaceful, i just had to get there. \n\nAbout SP, you shouldn't be scared. Things only appear if you think about them, if you think they'll hurt you they will, but if you think they'll hug you they will hug you. And if you can't stop think about them, think about something else, like potato rain or try to imagine a handsome guy/girl, how would that person look, what clothing, face shape and so on, go in depth with the details or try to imagine your dream house? Just try to think about something else. Also SP is a good way to start a LD, i had 2-3 LD's after forcing a SP the same night, they were all somehow connected. The woman in red i imagined was there the lawn with a sea was there and so on. \n\nFun story about me, when i had nightmares, where a scary person was in my room that i couldn't see. I started thinking about that person as a person who just needed some love or was alone, so because i was a straight guy i imagined the person as a girl and went over and hugged and/or kissed her. It's a dream so nothing can happen to you, just keep that in mind. I even started dating some of them in later dreams lol. I has some pros to date a ghost/Assassin that can defend you.\n\nI hope it helped", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had similar experience with dreams which was &amp;quot;semi lucid&amp;quot;, i had a lot of them after i started practicing. Later on i started practicing being more aware on my surroundings and some nights after that i had a clear LD, but it was short (got over excited). So i guess you&amp;#39;re close but not completely there yet. Try to do more reality checks and read this &lt;a href=\"http://www.dreamviews.com/wiki/Dream-Stabilization-and-Clarity-Tutorial\"&gt;http://www.dreamviews.com/wiki/Dream-Stabilization-and-Clarity-Tutorial&lt;/a&gt; it helped me a bit&lt;/p&gt;\n\n&lt;p&gt;Also about nightmares, when i was a child i started LDing because of nightmares and i didn&amp;#39;t knew what LDing was, but i did it anyways. I made a safe zone at my school, if i got there everything was peaceful, i just had to get there. &lt;/p&gt;\n\n&lt;p&gt;About SP, you shouldn&amp;#39;t be scared. Things only appear if you think about them, if you think they&amp;#39;ll hurt you they will, but if you think they&amp;#39;ll hug you they will hug you. And if you can&amp;#39;t stop think about them, think about something else, like potato rain or try to imagine a handsome guy/girl, how would that person look, what clothing, face shape and so on, go in depth with the details or try to imagine your dream house? Just try to think about something else. Also SP is a good way to start a LD, i had 2-3 LD&amp;#39;s after forcing a SP the same night, they were all somehow connected. The woman in red i imagined was there the lawn with a sea was there and so on. &lt;/p&gt;\n\n&lt;p&gt;Fun story about me, when i had nightmares, where a scary person was in my room that i couldn&amp;#39;t see. I started thinking about that person as a person who just needed some love or was alone, so because i was a straight guy i imagined the person as a girl and went over and hugged and/or kissed her. It&amp;#39;s a dream so nothing can happen to you, just keep that in mind. I even started dating some of them in later dreams lol. I has some pros to date a ghost/Assassin that can defend you.&lt;/p&gt;\n\n&lt;p&gt;I hope it helped&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5npn0", "score_hidden": false, "stickied": false, "created": 1492016660.0, "created_utc": 1491987860.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mmb3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Stelum", "parent_id": "t1_dg5mici", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "This is my first time getting what I feel is a LD the last couple of weeks, so I guess it's already a start. I used to be scared of doing it because of Lucid nightmares and sleep paralysis and all but I tried to overcome it recently because I've had some anxiety issues and stuff, and so wanted to live in a world where I could do anything to get my mind off it. Thanks for your reply :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is my first time getting what I feel is a LD the last couple of weeks, so I guess it&amp;#39;s already a start. I used to be scared of doing it because of Lucid nightmares and sleep paralysis and all but I tried to overcome it recently because I&amp;#39;ve had some anxiety issues and stuff, and so wanted to live in a world where I could do anything to get my mind off it. Thanks for your reply :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5mmb3", "score_hidden": false, "stickied": false, "created": 1492013241.0, "created_utc": 1491984441.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg5n0cu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dream_Hacker", "parent_id": "t1_dg5mici", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "&gt; I have some lucid dream bro science for you.\n\nHaha excellent: that's all we really have anyway!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have some lucid dream bro science for you.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Haha excellent: that&amp;#39;s all we really have anyway!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5n0cu", "score_hidden": false, "stickied": false, "created": 1492014449.0, "created_utc": 1491985649.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mici", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KenRaijin", "parent_id": "t3_64wsy1", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I'm no LD guru but I have some lucid dream bro science for you. \n\nI feel very similar to this when lucid dreaming. I've had very vivid LDs and incredibly muddy LDs. I feel that it is a thing that just takes a lot of practice before you get more control. It has taken me years because I'm not very consistent but I'm just now starting to get the hang of flying in dreams. And I say that because last lucid dream I had two weeks ago I flew very well. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m no LD guru but I have some lucid dream bro science for you. &lt;/p&gt;\n\n&lt;p&gt;I feel very similar to this when lucid dreaming. I&amp;#39;ve had very vivid LDs and incredibly muddy LDs. I feel that it is a thing that just takes a lot of practice before you get more control. It has taken me years because I&amp;#39;m not very consistent but I&amp;#39;m just now starting to get the hang of flying in dreams. And I say that because last lucid dream I had two weeks ago I flew very well. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5mici", "score_hidden": false, "stickied": false, "created": 1492012915.0, "created_utc": 1491984115.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg5nu0m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Stelum", "parent_id": "t1_dg5mzyg", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "That last paragraph defines my experience. I realised I was not in my world and therefore there would be no reaction to my action, and was in like a little play area where I could do whatever. I don't know if I thought it was a dream or not, as now that I know it was my memories are possibly very muddled.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That last paragraph defines my experience. I realised I was not in my world and therefore there would be no reaction to my action, and was in like a little play area where I could do whatever. I don&amp;#39;t know if I thought it was a dream or not, as now that I know it was my memories are possibly very muddled.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5nu0m", "score_hidden": false, "stickied": false, "created": 1492017060.0, "created_utc": 1491988260.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg6al2m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "darkh3lmet82", "parent_id": "t1_dg5mzyg", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I get this a lot, though it's usually in the form of a video game that I like, but I'm in it in first person.  I know that there is no real danger and that it's not real life, but I still feel like I'm really doing it and therefore don't realize it's a dream.  I've also had the same types of dreams and for whatever reason, remembered my constant urge to lucid dream and boom, I'm lucid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get this a lot, though it&amp;#39;s usually in the form of a video game that I like, but I&amp;#39;m in it in first person.  I know that there is no real danger and that it&amp;#39;s not real life, but I still feel like I&amp;#39;m really doing it and therefore don&amp;#39;t realize it&amp;#39;s a dream.  I&amp;#39;ve also had the same types of dreams and for whatever reason, remembered my constant urge to lucid dream and boom, I&amp;#39;m lucid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg6al2m", "score_hidden": false, "stickied": false, "created": 1492049951.0, "created_utc": 1492021151.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mzyg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dream_Hacker", "parent_id": "t3_64wsy1", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "If you were *aware* that you were lucid dreaming while dreaming then it was a lucid dream.   It is possible  to be repeating the words without realizing you're actually dreaming.    For example, saying \"Hey everyone, let's hold a lucid dreaming competition and do a bunch of reality checks!\" doesn't necessarily mean you're lucid dreaming unless you *realize in the dream that you're dreaming*.  That's the sole definition of a lucid dream: not vividness, not control, not anything else, just knowing in the dream that you're dreaming.\n\n\"lucid dream bro science\" haha @ /u/KenRaijin.   That's all of really have, anyway!\n\nI personally use the term \"semi-lucid\" to mean \"almost lucid\".   Usually in the context of a dream where I know that I am not in a typical reality, there are no consequences/things are different/I have powers, but I do not realize that I am in fact dreaming.   That's my \"bro science\" definition of semi-lucid.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you were &lt;em&gt;aware&lt;/em&gt; that you were lucid dreaming while dreaming then it was a lucid dream.   It is possible  to be repeating the words without realizing you&amp;#39;re actually dreaming.    For example, saying &amp;quot;Hey everyone, let&amp;#39;s hold a lucid dreaming competition and do a bunch of reality checks!&amp;quot; doesn&amp;#39;t necessarily mean you&amp;#39;re lucid dreaming unless you &lt;em&gt;realize in the dream that you&amp;#39;re dreaming&lt;/em&gt;.  That&amp;#39;s the sole definition of a lucid dream: not vividness, not control, not anything else, just knowing in the dream that you&amp;#39;re dreaming.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;lucid dream bro science&amp;quot; haha @ &lt;a href=\"/u/KenRaijin\"&gt;/u/KenRaijin&lt;/a&gt;.   That&amp;#39;s all of really have, anyway!&lt;/p&gt;\n\n&lt;p&gt;I personally use the term &amp;quot;semi-lucid&amp;quot; to mean &amp;quot;almost lucid&amp;quot;.   Usually in the context of a dream where I know that I am not in a typical reality, there are no consequences/things are different/I have powers, but I do not realize that I am in fact dreaming.   That&amp;#39;s my &amp;quot;bro science&amp;quot; definition of semi-lucid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5mzyg", "score_hidden": false, "stickied": false, "created": 1492014416.0, "created_utc": 1491985616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg5xkp0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cobblest0ne", "parent_id": "t3_64wsy1", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I think you mean \"Low Lucid Dream\"\n\nSemi-Lucid would be when you do an RC, e.g have 6 finger but still don't realise you are dreaming", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you mean &amp;quot;Low Lucid Dream&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Semi-Lucid would be when you do an RC, e.g have 6 finger but still don&amp;#39;t realise you are dreaming&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5xkp0", "score_hidden": false, "stickied": false, "created": 1492036126.0, "created_utc": 1492007326.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg6ey97", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BowlOfManZ", "parent_id": "t3_64wsy1", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I read that doing things like yelling \"clarity\", feeling objects in your dream, and reminding yourself that you are dreaming can help make your dream more vivid. I've had two lucid dreams so far, both kinda fuzzy, and I forgot to try this both times, so I can't really say from experience that it works, but I trust that the people writing posts like that know what they're talking about.\n\nI'll edit in a link to one the posts I read if I can find any.\nEdit: check this out https://www.reddit.com/r/LucidDreaming/comments/5vr5w4/dream_stabilization/?st=J1FDRHGG&amp;sh=5ad97434", "edited": 1492026046.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read that doing things like yelling &amp;quot;clarity&amp;quot;, feeling objects in your dream, and reminding yourself that you are dreaming can help make your dream more vivid. I&amp;#39;ve had two lucid dreams so far, both kinda fuzzy, and I forgot to try this both times, so I can&amp;#39;t really say from experience that it works, but I trust that the people writing posts like that know what they&amp;#39;re talking about.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll edit in a link to one the posts I read if I can find any.\nEdit: check this out &lt;a href=\"https://www.reddit.com/r/LucidDreaming/comments/5vr5w4/dream_stabilization/?st=J1FDRHGG&amp;amp;sh=5ad97434\"&gt;https://www.reddit.com/r/LucidDreaming/comments/5vr5w4/dream_stabilization/?st=J1FDRHGG&amp;amp;sh=5ad97434&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg6ey97", "score_hidden": false, "stickied": false, "created": 1492054440.0, "created_utc": 1492025640.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg6lwu3", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Arki_Idiosyncratic", "parent_id": "t1_dg5o1ds", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Yup. Thats why sometimes you have murky LD's, what I mean by this is you know it's a dream but you control and do things with little to no thoughts. Just natural things that you want like sex or basic wants and needs. If you get what I mean.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup. Thats why sometimes you have murky LD&amp;#39;s, what I mean by this is you know it&amp;#39;s a dream but you control and do things with little to no thoughts. Just natural things that you want like sex or basic wants and needs. If you get what I mean.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg6lwu3", "score_hidden": false, "stickied": false, "created": 1492061908.0, "created_utc": 1492033108.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5o1ds", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Stelum", "parent_id": "t1_dg5o0yj", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "So I could've been anywhere from not Lucid to slightly Lucid to full Lucid?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I could&amp;#39;ve been anywhere from not Lucid to slightly Lucid to full Lucid?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5o1ds", "score_hidden": false, "stickied": false, "created": 1492017712.0, "created_utc": 1491988912.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5o0yj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Arki_Idiosyncratic", "parent_id": "t3_64wsy1", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Lucidity is a spectrum. It's not a question of I'm lucid or I'm not lucid. That is, oversimplified how lucidity works.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lucidity is a spectrum. It&amp;#39;s not a question of I&amp;#39;m lucid or I&amp;#39;m not lucid. That is, oversimplified how lucidity works.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5o0yj", "score_hidden": false, "stickied": false, "created": 1492017676.0, "created_utc": 1491988876.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_64wsy1", "likes": null, "replies": "", "user_reports": [], "id": "dg5pgqh", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Keadan_Techard", "parent_id": "t3_64wsy1", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I just had my first semi-lucid dream. I was kind of controlling it like a writing prompt, but I still was able to interact with an unknown future...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just had my first semi-lucid dream. I was kind of controlling it like a writing prompt, but I still was able to interact with an unknown future...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg5pgqh", "score_hidden": false, "stickied": false, "created": 1492022099.0, "created_utc": 1491993299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]