[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello all! Completely new to Reddit so let me know if I&amp;#39;m doing something completely stupid. I will leave a TLDR at the end because I know this will take  a forever to explain. Anyways, my question. So earlier today I took a nap and I entered a dream where I was driving away from my home. As I was driving, in my dream, I began to go numb and felt dizzy. My sight went as well as my hearing and I began to go off the road (I think, as again, I lost my senses). I awoke from this extremely realistic seeming dream in my normal sleeping position in my room, however something was wrong. The sun was out when I went to sleep so it was bright in my room earlier, but then when I woke up, my room was dark, except for the light coming through the window which was no longer sun colored, but a very white color. Another thing, there was a quite loud ringing in my ears, as well as another popping sound in my right ear. I felt as if I was awake yet asleep at the same time. I tried to move.. nothing. Some kind of sleep paralysis? The fact that I somewhat struggled to breathe confirms my suspicion on this. After focusing extremely hard on moving my arm and trying to curl my body up into the fetal position (just to try to move), something else happened. It&amp;#39;s as if some sort of projection of my arm and body were able to &amp;quot;slip&amp;quot; out of my real body. I could see that my arm was still there right where it was, laying next to my head, but at the same time I was moving it. I know that&amp;#39;s probably hard to understand but it was as if I was in 2 positions at once. Could this have been only a dream and perhaps I was not actually awake? So after this happened I simply closed my eyes and was able to go back to sleep. I woke up later and everything was back to normal. It has been several hours since then and everything has been beginning to seem strange. I keep getting this head rush feeling like I did in my driving dream, and sometimes since then, I will see something that just doesn&amp;#39;t seem.. right. Like the things you notice in a dream that show you you&amp;#39;re in a dream.. so the question. Have any of you ever felt this way? I&amp;#39;m going to try to get some sleep for tonight and hope everything is back to normal in the morning, but just wanted to tell my quick story of today. This is my first sleep paralysis that I can remember and I can only recall 2 successful lucid dreams.&lt;/p&gt;\n\n&lt;p&gt;TLDR; Have any of you ever felt like you are in a dream, when you know for a fact you are awake? For example seeing something and thinking, &amp;quot;that&amp;#39;s not quite right&amp;quot;, like you would in a dream, or getting a headrush feeling.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello all! Completely new to Reddit so let me know if I'm doing something completely stupid. I will leave a TLDR at the end because I know this will take  a forever to explain. Anyways, my question. So earlier today I took a nap and I entered a dream where I was driving away from my home. As I was driving, in my dream, I began to go numb and felt dizzy. My sight went as well as my hearing and I began to go off the road (I think, as again, I lost my senses). I awoke from this extremely realistic seeming dream in my normal sleeping position in my room, however something was wrong. The sun was out when I went to sleep so it was bright in my room earlier, but then when I woke up, my room was dark, except for the light coming through the window which was no longer sun colored, but a very white color. Another thing, there was a quite loud ringing in my ears, as well as another popping sound in my right ear. I felt as if I was awake yet asleep at the same time. I tried to move.. nothing. Some kind of sleep paralysis? The fact that I somewhat struggled to breathe confirms my suspicion on this. After focusing extremely hard on moving my arm and trying to curl my body up into the fetal position (just to try to move), something else happened. It's as if some sort of projection of my arm and body were able to \"slip\" out of my real body. I could see that my arm was still there right where it was, laying next to my head, but at the same time I was moving it. I know that's probably hard to understand but it was as if I was in 2 positions at once. Could this have been only a dream and perhaps I was not actually awake? So after this happened I simply closed my eyes and was able to go back to sleep. I woke up later and everything was back to normal. It has been several hours since then and everything has been beginning to seem strange. I keep getting this head rush feeling like I did in my driving dream, and sometimes since then, I will see something that just doesn't seem.. right. Like the things you notice in a dream that show you you're in a dream.. so the question. Have any of you ever felt this way? I'm going to try to get some sleep for tonight and hope everything is back to normal in the morning, but just wanted to tell my quick story of today. This is my first sleep paralysis that I can remember and I can only recall 2 successful lucid dreams.\n\n\nTLDR; Have any of you ever felt like you are in a dream, when you know for a fact you are awake? For example seeing something and thinking, \"that's not quite right\", like you would in a dream, or getting a headrush feeling.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65agqf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "dawson128", "saved": false, "mod_reports": [], "name": "t3_65agqf", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/65agqf/lucid_feeling_irl/", "num_reports": null, "locked": false, "stickied": false, "created": 1492171745.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/65agqf/lucid_feeling_irl/", "author_flair_text": null, "quarantine": false, "title": "Lucid feeling IRL?", "created_utc": 1492142945.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65agqf", "likes": null, "replies": "", "user_reports": [], "id": "dg8s05h", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Saltyornaw", "parent_id": "t3_65agqf", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "All the time", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All the time&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg8s05h", "score_hidden": false, "stickied": false, "created": 1492174167.0, "created_utc": 1492145367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65agqf", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65agqf", "likes": null, "replies": "", "user_reports": [], "id": "dg9kfwo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dawson128", "parent_id": "t1_dg9karm", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Thanks for the tip on breaking lines. I'll start doing that! I'll have to read up on WILD. The feeling has sort of receded for today but I will see if I can bring that mindset back to stay to help me work on my lucid dreaming. Thanks for the help!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the tip on breaking lines. I&amp;#39;ll start doing that! I&amp;#39;ll have to read up on WILD. The feeling has sort of receded for today but I will see if I can bring that mindset back to stay to help me work on my lucid dreaming. Thanks for the help!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg9kfwo", "score_hidden": false, "stickied": false, "created": 1492224687.0, "created_utc": 1492195887.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9karm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Gmayor61", "parent_id": "t3_65agqf", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "For gods sake, break some lines. Walls of text are a terror attack on the eyes. Anyway\n\n&gt;It's as if some sort of projection of my arm and body were able to \"slip\" out of my real body. I could see that my arm was still there right where it was, laying next to my head, but at the same time I was moving it. I know that's probably hard to understand but it was as if I was in 2 positions at once.\n\nYou were lucid dreaming. You actually did a pretty standard WILD. \n\nSome people like to call this an out of body experience, sometimes this just sorta happens.\n\nAs for that feeling that something's wrong, you wouldn't be wrong to suspect things. These things can be extremely convincing but if you're aware enough you'll feel that somethings \"off\", much like natural lucid dreamers are or when you spontaneously get lucid. \n\nAfter waking up, part of you was looking for that strange sensation. When you woke up from that nap you didn't feel tired or anything, right? \n\nIn any case, if you're interested in lucid dreaming, you should actually use this feeling that something's \"off\". This has really great reality checking prowess, I think this is what most people look for when doing All Day Awareness actually.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For gods sake, break some lines. Walls of text are a terror attack on the eyes. Anyway&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s as if some sort of projection of my arm and body were able to &amp;quot;slip&amp;quot; out of my real body. I could see that my arm was still there right where it was, laying next to my head, but at the same time I was moving it. I know that&amp;#39;s probably hard to understand but it was as if I was in 2 positions at once.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You were lucid dreaming. You actually did a pretty standard WILD. &lt;/p&gt;\n\n&lt;p&gt;Some people like to call this an out of body experience, sometimes this just sorta happens.&lt;/p&gt;\n\n&lt;p&gt;As for that feeling that something&amp;#39;s wrong, you wouldn&amp;#39;t be wrong to suspect things. These things can be extremely convincing but if you&amp;#39;re aware enough you&amp;#39;ll feel that somethings &amp;quot;off&amp;quot;, much like natural lucid dreamers are or when you spontaneously get lucid. &lt;/p&gt;\n\n&lt;p&gt;After waking up, part of you was looking for that strange sensation. When you woke up from that nap you didn&amp;#39;t feel tired or anything, right? &lt;/p&gt;\n\n&lt;p&gt;In any case, if you&amp;#39;re interested in lucid dreaming, you should actually use this feeling that something&amp;#39;s &amp;quot;off&amp;quot;. This has really great reality checking prowess, I think this is what most people look for when doing All Day Awareness actually.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg9karm", "score_hidden": false, "stickied": false, "created": 1492224514.0, "created_utc": 1492195714.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65agqf", "likes": null, "replies": "", "user_reports": [], "id": "dg8zgmo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "leao_louro", "parent_id": "t3_65agqf", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Yup, this definitely happens to me!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup, this definitely happens to me!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg8zgmo", "score_hidden": false, "stickied": false, "created": 1492193947.0, "created_utc": 1492165147.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65agqf", "likes": null, "replies": "", "user_reports": [], "id": "dg98iw3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Awesomalex", "parent_id": "t3_65agqf", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Yup the more RCs I do the more I got this feeling, fortunately ADA helps a ton with this!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup the more RCs I do the more I got this feeling, fortunately ADA helps a ton with this!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg98iw3", "score_hidden": false, "stickied": false, "created": 1492210860.0, "created_utc": 1492182060.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]