[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I remember a while back that I was thinking about Lucid Dreaming. Everyone should know that in Lucid Dreams you can do anything that your mind could possibly want to happen while feeling very conscious at the same time. Then I thought, how could Lucid Dreaming help others in life? Well here&amp;#39;s a list that I thought. There are people who&amp;#39;d like to just escape reality into another place without stress or pain. Lucid dreaming would be the right choice for them! I mean, to be honest, who wouldn&amp;#39;t want to escape the real world to some awesome fantasy, even just for a minute? But there&amp;#39;s other things that lucid dreaming could also do. Let&amp;#39;s say you have depression and suicidal thoughts. You just want to get to your happy place, a.k.a a place where you don&amp;#39;t have to feel any sadness or pain, and a place where you get to control anything that happens. What if people with depression choose to lucid dream? Especially since you can control the time of a dream, you can stay there for as long as you&amp;#39;d like. Tell me what you think below. Next of all, imagine if you are a person with murder fantasies. You want decapitate people or something. But then again in reality, you would just get arrested and never do that to anyone ever again, and possibly even get a death sentence. Instead of going through that, you can just kill anyone in your lucid dreams! Yeah, it&amp;#39;s a bit dark, but it&amp;#39;d help people IMO. I thought there may be other ways people could be helped by lucid dreaming, and since lucid dreams are somewhat not as famous around the globe, maybe lucid dreams could be the escaping part for many people. I don&amp;#39;t really know, but tell me what you guys think.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I remember a while back that I was thinking about Lucid Dreaming. Everyone should know that in Lucid Dreams you can do anything that your mind could possibly want to happen while feeling very conscious at the same time. Then I thought, how could Lucid Dreaming help others in life? Well here's a list that I thought. There are people who'd like to just escape reality into another place without stress or pain. Lucid dreaming would be the right choice for them! I mean, to be honest, who wouldn't want to escape the real world to some awesome fantasy, even just for a minute? But there's other things that lucid dreaming could also do. Let's say you have depression and suicidal thoughts. You just want to get to your happy place, a.k.a a place where you don't have to feel any sadness or pain, and a place where you get to control anything that happens. What if people with depression choose to lucid dream? Especially since you can control the time of a dream, you can stay there for as long as you'd like. Tell me what you think below. Next of all, imagine if you are a person with murder fantasies. You want decapitate people or something. But then again in reality, you would just get arrested and never do that to anyone ever again, and possibly even get a death sentence. Instead of going through that, you can just kill anyone in your lucid dreams! Yeah, it's a bit dark, but it'd help people IMO. I thought there may be other ways people could be helped by lucid dreaming, and since lucid dreams are somewhat not as famous around the globe, maybe lucid dreams could be the escaping part for many people. I don't really know, but tell me what you guys think.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Question", "id": "65es0x", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "Nateruz", "saved": false, "mod_reports": [], "name": "t3_65es0x", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": "question", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/65es0x/how_could_lucid_dreams_actually_help_lives/", "num_reports": null, "locked": false, "stickied": false, "created": 1492228221.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/65es0x/how_could_lucid_dreams_actually_help_lives/", "author_flair_text": null, "quarantine": false, "title": "How could Lucid Dreams actually help lives?", "created_utc": 1492199421.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": "", "user_reports": [], "id": "dg9q1gw", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "smokinjoe65", "parent_id": "t3_65es0x", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Here are my thoughts: \n\n1. It's a good place to play. As adults, many of us have forgotten how to really play or how to use our imaginations in general. In our dreams we can do all of the things we'd like to do, kind of like how children pretend to do things, except turned up a notch. \n\n2. It's a place where we can be in control. Many feel that they're stuck in the grind of everyday life which makes it easy to feel like a slave to the machine. In our dreams we call the shots, or we can at least teach ourselves how. \n\n3. This one kind of rolls up the previous 2 and addresses your idea of the murder fantasies: it's a place where we can try things. Similar to how people like to fly in dreams, people may experiment with any fantasy that would otherwise be impossible or difficult. In flying, people are breaking the known laws of physics. With murder, people can forego the legalities associated with killing someone. Want to be a CEO? Try it out without going to business school. In doing this, we can either treat it as an outlet so we don't feel the need to do these things in the waking reality, or we can try it out to fortify our \"real world\" desires in order to drive us to attain new goals and rewards. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here are my thoughts: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;It&amp;#39;s a good place to play. As adults, many of us have forgotten how to really play or how to use our imaginations in general. In our dreams we can do all of the things we&amp;#39;d like to do, kind of like how children pretend to do things, except turned up a notch. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It&amp;#39;s a place where we can be in control. Many feel that they&amp;#39;re stuck in the grind of everyday life which makes it easy to feel like a slave to the machine. In our dreams we call the shots, or we can at least teach ourselves how. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;This one kind of rolls up the previous 2 and addresses your idea of the murder fantasies: it&amp;#39;s a place where we can try things. Similar to how people like to fly in dreams, people may experiment with any fantasy that would otherwise be impossible or difficult. In flying, people are breaking the known laws of physics. With murder, people can forego the legalities associated with killing someone. Want to be a CEO? Try it out without going to business school. In doing this, we can either treat it as an outlet so we don&amp;#39;t feel the need to do these things in the waking reality, or we can try it out to fortify our &amp;quot;real world&amp;quot; desires in order to drive us to attain new goals and rewards. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg9q1gw", "score_hidden": false, "stickied": false, "created": 1492231433.0, "created_utc": 1492202633.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": "", "user_reports": [], "id": "dg9tcga", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "pointless_circle", "parent_id": "t3_65es0x", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I don't think people just choose to be able to lucid dream do they? They either can, can with practice, or can't? Anyways I'm a natural lucid dreamer, have depression, ptsd, and chronic pain. \n\nI was in the hospital once and was in really bad shape but I still had a lucid dream. It was terrifying and amazing at the same time because I was aware of my situation while I was asleep. I knew when I woke up I would be blind and in pain and unable to even move. I was dreaming I was at a sports game, and I just sat there and ate food and relaxed, and watched the game with perfect dream vision. I hadn't eaten in two weeks and man that was one of my best dreams ever. I also wasn't really sure if it was gonna be my last or not. So that's why it was scary, too. For the long term mild-moderate chronic pain though, lucid dreaming can make it feel worse because while I'm dreaming I'm not in pain, so I notice the difference more when I wake up. \n\nSo this isn't really a murder fantasy, but it sort of fits with the idea a bit I guess. Had a dream that put me back in a classroom with a teacher bullying me. I was feeling angry, then got an idea that only dreamland could pull off. I mind controlled another person in the class to run over and kill the teacher, then while everyone was distracted by what the other person did, and the person who did the killing was so upset about being mind controlled, I turned on the invisibility, swiftly got out of there and shapeshifted and flew towards the mountains. It was a pretty badass escape, really. But I was feeling kind of happy/relieved even though the people in my dream were screaming in terror. And that felt really not great to think about. It might be contributing to some of this ptsd crap because I can so easily go explore those situations but I don't have anyone to help teach me how to use it to help the bad feelings.\n\nBeing awake while dreaming also has revealed to me I'm still depressed while I sleep, and that makes me more depressed sometimes. I had this dream I had a deadline to kill myself, like literally my brain telling me that's what my mission was, and then it was up to me to convince my brain my ability to dream is worth living for. Then I spent the dream flying over beautiful mountains and landscapes and cities my mind was creating as it went. I think it's an amazing thing to do. I did a painting of it and posted it on here a while ago and a lot of people liked it I think, it was nice to share, but then depression strikes again and I delete it. But that is probably the only thing I'd say lucid dreaming actually benefits in my life... art. I get so much artistic inspiration from my dreams and it's a really unique tool for it. So having that inspiration helps keep me busy sometimes, and that's a good thing. And I guess it maybe can help others too if you count making art as helping lives... but I'm not sure it counts.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think people just choose to be able to lucid dream do they? They either can, can with practice, or can&amp;#39;t? Anyways I&amp;#39;m a natural lucid dreamer, have depression, ptsd, and chronic pain. &lt;/p&gt;\n\n&lt;p&gt;I was in the hospital once and was in really bad shape but I still had a lucid dream. It was terrifying and amazing at the same time because I was aware of my situation while I was asleep. I knew when I woke up I would be blind and in pain and unable to even move. I was dreaming I was at a sports game, and I just sat there and ate food and relaxed, and watched the game with perfect dream vision. I hadn&amp;#39;t eaten in two weeks and man that was one of my best dreams ever. I also wasn&amp;#39;t really sure if it was gonna be my last or not. So that&amp;#39;s why it was scary, too. For the long term mild-moderate chronic pain though, lucid dreaming can make it feel worse because while I&amp;#39;m dreaming I&amp;#39;m not in pain, so I notice the difference more when I wake up. &lt;/p&gt;\n\n&lt;p&gt;So this isn&amp;#39;t really a murder fantasy, but it sort of fits with the idea a bit I guess. Had a dream that put me back in a classroom with a teacher bullying me. I was feeling angry, then got an idea that only dreamland could pull off. I mind controlled another person in the class to run over and kill the teacher, then while everyone was distracted by what the other person did, and the person who did the killing was so upset about being mind controlled, I turned on the invisibility, swiftly got out of there and shapeshifted and flew towards the mountains. It was a pretty badass escape, really. But I was feeling kind of happy/relieved even though the people in my dream were screaming in terror. And that felt really not great to think about. It might be contributing to some of this ptsd crap because I can so easily go explore those situations but I don&amp;#39;t have anyone to help teach me how to use it to help the bad feelings.&lt;/p&gt;\n\n&lt;p&gt;Being awake while dreaming also has revealed to me I&amp;#39;m still depressed while I sleep, and that makes me more depressed sometimes. I had this dream I had a deadline to kill myself, like literally my brain telling me that&amp;#39;s what my mission was, and then it was up to me to convince my brain my ability to dream is worth living for. Then I spent the dream flying over beautiful mountains and landscapes and cities my mind was creating as it went. I think it&amp;#39;s an amazing thing to do. I did a painting of it and posted it on here a while ago and a lot of people liked it I think, it was nice to share, but then depression strikes again and I delete it. But that is probably the only thing I&amp;#39;d say lucid dreaming actually benefits in my life... art. I get so much artistic inspiration from my dreams and it&amp;#39;s a really unique tool for it. So having that inspiration helps keep me busy sometimes, and that&amp;#39;s a good thing. And I guess it maybe can help others too if you count making art as helping lives... but I&amp;#39;m not sure it counts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg9tcga", "score_hidden": false, "stickied": false, "created": 1492235604.0, "created_utc": 1492206804.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": "", "user_reports": [], "id": "dgb4knb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ProdigalD", "parent_id": "t1_dgaubhk", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "\"Never associate non-lucid dreams with failure!\"\n\nThanks, coach. You are right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Never associate non-lucid dreams with failure!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Thanks, coach. You are right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgb4knb", "score_hidden": false, "stickied": false, "created": 1492316767.0, "created_utc": 1492287967.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaubhk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Dream_Hacker", "parent_id": "t1_dg9uua2", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I think a much better \"place\" to be mentally is to really enjoy to the fullest all your dreams, especially your non-lucid ones.   You get those every night \"for free!\" [*]. Work for lucidity, that's required to attain it on a regular basis, but in the meanwhile, enjoy nightly epic non-lucids!   Lucidity is icing on the cake.     Never associate non-lucid dreams with failure!\n\n[*] of course training memory and attention will bring vivid non-lucids on more quickly, so it does still take some effort.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a much better &amp;quot;place&amp;quot; to be mentally is to really enjoy to the fullest all your dreams, especially your non-lucid ones.   You get those every night &amp;quot;for free!&amp;quot; [*]. Work for lucidity, that&amp;#39;s required to attain it on a regular basis, but in the meanwhile, enjoy nightly epic non-lucids!   Lucidity is icing on the cake.     Never associate non-lucid dreams with failure!&lt;/p&gt;\n\n&lt;p&gt;[*] of course training memory and attention will bring vivid non-lucids on more quickly, so it does still take some effort.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgaubhk", "score_hidden": false, "stickied": false, "created": 1492302800.0, "created_utc": 1492274000.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9uua2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "ProdigalD", "parent_id": "t3_65es0x", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "The thing that gets me depressed is how hard I've been working to become a lucid dreamer, and how much I've been failing.\n\nWhat you describe is lovely for people who can lucid dream on such a high level, but not everyone shares your good fortune.  \n\nI would be worried about encouraging people to act out their dark, murderous impulses in their lucid dreams, assuming they can have them. Purely from a neuroplasticity standpoint. If someone murders a bunch of people in a lucid dream, and feels pleasure doing it, the connection of those two experiences will be reinforced in their neural pathways. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing that gets me depressed is how hard I&amp;#39;ve been working to become a lucid dreamer, and how much I&amp;#39;ve been failing.&lt;/p&gt;\n\n&lt;p&gt;What you describe is lovely for people who can lucid dream on such a high level, but not everyone shares your good fortune.  &lt;/p&gt;\n\n&lt;p&gt;I would be worried about encouraging people to act out their dark, murderous impulses in their lucid dreams, assuming they can have them. Purely from a neuroplasticity standpoint. If someone murders a bunch of people in a lucid dream, and feels pleasure doing it, the connection of those two experiences will be reinforced in their neural pathways. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg9uua2", "score_hidden": false, "stickied": false, "created": 1492237569.0, "created_utc": 1492208769.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": "", "user_reports": [], "id": "dg9ws08", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "PowerOfKawaiiness", "parent_id": "t3_65es0x", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Maxwell from Team Lucid Dream hears voices inside his head. He says lucid dreaming helped him a lot with controlling those voices and understanding them. He also believes lucid dreaming could be used for therapy for cases similar to his.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maxwell from Team Lucid Dream hears voices inside his head. He says lucid dreaming helped him a lot with controlling those voices and understanding them. He also believes lucid dreaming could be used for therapy for cases similar to his.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dg9ws08", "score_hidden": false, "stickied": false, "created": 1492240178.0, "created_utc": 1492211378.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": "", "user_reports": [], "id": "dgazn36", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nateruz", "parent_id": "t1_dgaxph5", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Thanks for your reply. Patience is what throws some people off the path to lucid dreaming. Good luck on becoming the professional artist of tommorow!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your reply. Patience is what throws some people off the path to lucid dreaming. Good luck on becoming the professional artist of tommorow!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgazn36", "score_hidden": false, "stickied": false, "created": 1492310106.0, "created_utc": 1492281306.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxph5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Uyeno_", "parent_id": "t1_dgaxd1v", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Smh. Ive been doing this thing off and on for 4 years and i feel like i'm finally getting a good grasp on it. First part is trying to get lucid, second part is dream control which i'm still learning. People just dont have patience. I'm planning on becoming a professional artist in the next year or two (i already have tons of skill) and plan on having my lucid dreams inspire me with my art too. But i havent gotten to that yet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Smh. Ive been doing this thing off and on for 4 years and i feel like i&amp;#39;m finally getting a good grasp on it. First part is trying to get lucid, second part is dream control which i&amp;#39;m still learning. People just dont have patience. I&amp;#39;m planning on becoming a professional artist in the next year or two (i already have tons of skill) and plan on having my lucid dreams inspire me with my art too. But i havent gotten to that yet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgaxph5", "score_hidden": false, "stickied": false, "created": 1492307458.0, "created_utc": 1492278658.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgaxd1v", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Nateruz", "parent_id": "t1_dgax70k", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Yeah, that's about what I was thinking. By the replies I'm getting, there's also trying to lucid dream, which isn't easy for everyone. Someone even said their depression comes from not being able to lucid dream.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, that&amp;#39;s about what I was thinking. By the replies I&amp;#39;m getting, there&amp;#39;s also trying to lucid dream, which isn&amp;#39;t easy for everyone. Someone even said their depression comes from not being able to lucid dream.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgaxd1v", "score_hidden": false, "stickied": false, "created": 1492306992.0, "created_utc": 1492278192.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgax70k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Uyeno_", "parent_id": "t3_65es0x", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "For me i use it as a source of motivation. To accomplish anything great in life, you have to have a vision, a dream. You can literally experience your huge goals, your dreams inside your dreams. What youre basically doing is faking results, which drives motivation in your day to day life. Want to have the perfect body? Lucid dream about it and have it drive you during your waking life to work harder. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me i use it as a source of motivation. To accomplish anything great in life, you have to have a vision, a dream. You can literally experience your huge goals, your dreams inside your dreams. What youre basically doing is faking results, which drives motivation in your day to day life. Want to have the perfect body? Lucid dream about it and have it drive you during your waking life to work harder. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgax70k", "score_hidden": false, "stickied": false, "created": 1492306762.0, "created_utc": 1492277962.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65es0x", "likes": null, "replies": "", "user_reports": [], "id": "dgc4r56", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Drakefoxaroo", "parent_id": "t3_65es0x", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I used to have drug habits that I gave up for lucid dreaming.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I used to have drug habits that I gave up for lucid dreaming.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgc4r56", "score_hidden": false, "stickied": false, "created": 1492384418.0, "created_utc": 1492355618.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]