[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Great news! About a week ago I regained the ability to dream after what it seemed to be months that I hadn&amp;#39;t had a regular old dream. But the entire last week, I didn&amp;#39;t have any dream other than the 1.&lt;/p&gt;\n\n&lt;p&gt;But, 2 nights ago, I had a dream again, and I wrote it down in my dream journal like the last one. &lt;/p&gt;\n\n&lt;p&gt;Last night, I had a dream as well. There&amp;#39;s a bit of backstory and some stuff after but I&amp;#39;m gonna shorten it to where I realize I&amp;#39;m lucid dreaming.&lt;/p&gt;\n\n&lt;p&gt;Me and my friend go on a rollercoaster and when we get off, we talk to the 2 people operating it. For some reason, we get in an argument about how safe it is, and then some other people (from what I recall, I think they were redneck type people lol) come over and listen and soon join in on the argument against the 2 operators. For whatever reason, I kind of realize and say out loud &amp;quot;I&amp;#39;m dreaming&amp;quot;. And almost instantly I like transition into feeling in control.&lt;/p&gt;\n\n&lt;p&gt;But, even after reading so much about lucid dreams and staying calm and not getting excited, I freak out. I realize I&amp;#39;m finally lucid dreaming and I&amp;#39;m just so happy. But, even though I was lucid dreaming and I gained control, it felt like a regular dream. Not that vivid, and I can only recall parts of it. I remember I was so excited I started yelling at them all (I don&amp;#39;t remember what I was yelling). And everyone but the operators started running (not in a panic, just jogging regularly).&lt;/p&gt;\n\n&lt;p&gt;And this is where the lucid dream ends. &lt;strong&gt;But&lt;/strong&gt;, the dream doesn&amp;#39;t end. It like turns from a dream, to a lucid dream, to a dream again all in the same dream. I stay in the dream, and I lose control of realizing I&amp;#39;m lucid dreaming. We all ran to this house and I remember some type of creepy stuff happened in it, and some more shit happened in the dream. &lt;/p&gt;\n\n&lt;p&gt;I have so many questions... But the main one is; did I really lucid dream? Or was it something else? I only ask this because it felt like every other dream, and it wasn&amp;#39;t very vivid at all, and the dream continued as I lost control of lucidity. Whereas everyone else&amp;#39;s first LD typically it seems like they remember it crystal clear and they get excited and the dream ends and they wake up.&lt;/p&gt;\n\n&lt;p&gt;Also, I did enter every single detail I remember in my dream journal.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Great news! About a week ago I regained the ability to dream after what it seemed to be months that I hadn't had a regular old dream. But the entire last week, I didn't have any dream other than the 1.\n\nBut, 2 nights ago, I had a dream again, and I wrote it down in my dream journal like the last one. \n\nLast night, I had a dream as well. There's a bit of backstory and some stuff after but I'm gonna shorten it to where I realize I'm lucid dreaming.\n\nMe and my friend go on a rollercoaster and when we get off, we talk to the 2 people operating it. For some reason, we get in an argument about how safe it is, and then some other people (from what I recall, I think they were redneck type people lol) come over and listen and soon join in on the argument against the 2 operators. For whatever reason, I kind of realize and say out loud \"I'm dreaming\". And almost instantly I like transition into feeling in control.\n\nBut, even after reading so much about lucid dreams and staying calm and not getting excited, I freak out. I realize I'm finally lucid dreaming and I'm just so happy. But, even though I was lucid dreaming and I gained control, it felt like a regular dream. Not that vivid, and I can only recall parts of it. I remember I was so excited I started yelling at them all (I don't remember what I was yelling). And everyone but the operators started running (not in a panic, just jogging regularly).\n\nAnd this is where the lucid dream ends. **But**, the dream doesn't end. It like turns from a dream, to a lucid dream, to a dream again all in the same dream. I stay in the dream, and I lose control of realizing I'm lucid dreaming. We all ran to this house and I remember some type of creepy stuff happened in it, and some more shit happened in the dream. \n\nI have so many questions... But the main one is; did I really lucid dream? Or was it something else? I only ask this because it felt like every other dream, and it wasn't very vivid at all, and the dream continued as I lost control of lucidity. Whereas everyone else's first LD typically it seems like they remember it crystal clear and they get excited and the dream ends and they wake up.\n\nAlso, I did enter every single detail I remember in my dream journal.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65iqi0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "Ininsicken", "saved": false, "mod_reports": [], "name": "t3_65iqi0", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/65iqi0/i_had_my_first_ld_last_night_but/", "num_reports": null, "locked": false, "stickied": false, "created": 1492286377.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/65iqi0/i_had_my_first_ld_last_night_but/", "author_flair_text": null, "quarantine": false, "title": "I had my first LD last night! But...", "created_utc": 1492257577.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 6, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65iqi0", "likes": null, "replies": "", "user_reports": [], "id": "dgaqyk7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Dream_Hacker", "parent_id": "t3_65iqi0", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Gaining and losing lucidity in the course of a single dream is quite common.    Sure, beginners usually wake up directly from their early lucid dreams, because: 1) of the excitement; 2) first lucid dreams often come right before waking.   Losing lucidity and continuing on dreaming does make remembering the lucid part more challenging.   \n\nCongrats!   Keep going and you'll certainly have many more!\n\nFor more vivid dreams in general (non-lucid dreams do not have to hazy and vague, they can be bright and vivid as well!), practice mindfulness and pay attention to all conscious (waking/dreaming) life experiences.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gaining and losing lucidity in the course of a single dream is quite common.    Sure, beginners usually wake up directly from their early lucid dreams, because: 1) of the excitement; 2) first lucid dreams often come right before waking.   Losing lucidity and continuing on dreaming does make remembering the lucid part more challenging.   &lt;/p&gt;\n\n&lt;p&gt;Congrats!   Keep going and you&amp;#39;ll certainly have many more!&lt;/p&gt;\n\n&lt;p&gt;For more vivid dreams in general (non-lucid dreams do not have to hazy and vague, they can be bright and vivid as well!), practice mindfulness and pay attention to all conscious (waking/dreaming) life experiences.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgaqyk7", "score_hidden": false, "stickied": false, "created": 1492298086.0, "created_utc": 1492269286.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65iqi0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65iqi0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65iqi0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65iqi0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65iqi0", "likes": null, "replies": "", "user_reports": [], "id": "dgd95i7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlackStarX97", "parent_id": "t1_dgcwnlk", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I'm not sure if i can call that a lucid dream, for me, it was just a dream that got affected by my researches about lucid dreaming (i hope i explained myself). \n\nI just had a similar experience this night, where at some point i was in a small room and i tried to open a door, just to find out that there were multiple doors stacked on each other, and it made me say to myself (or someone who was in a room near me, i'm not sure) that it happened because in lucid dream if you want to change the scenery you have to go through some doors or a portal. After that, i just continued my dream normally. \n\nI hope you get what I'm saying, that it was just me dreaming of being lucid, but without any vividness. \n\nP. S: i still have dreams if i have to wake up to do something, but lately that i hadn't, dreams became longer", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if i can call that a lucid dream, for me, it was just a dream that got affected by my researches about lucid dreaming (i hope i explained myself). &lt;/p&gt;\n\n&lt;p&gt;I just had a similar experience this night, where at some point i was in a small room and i tried to open a door, just to find out that there were multiple doors stacked on each other, and it made me say to myself (or someone who was in a room near me, i&amp;#39;m not sure) that it happened because in lucid dream if you want to change the scenery you have to go through some doors or a portal. After that, i just continued my dream normally. &lt;/p&gt;\n\n&lt;p&gt;I hope you get what I&amp;#39;m saying, that it was just me dreaming of being lucid, but without any vividness. &lt;/p&gt;\n\n&lt;p&gt;P. S: i still have dreams if i have to wake up to do something, but lately that i hadn&amp;#39;t, dreams became longer&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgd95i7", "score_hidden": false, "stickied": false, "created": 1492443436.0, "created_utc": 1492414636.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwnlk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ininsicken", "parent_id": "t1_dgcmmld", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Reality checks never worked for me. Seems I only have been able to dream/lucid dream (once) when I don't have to worry about being anywhere in the morning. Like last night I barely could recall parts of a dream because I had to work at 10 am, even though I woke myself up around 8 am. \n\nAlso, was that your first lucid dream? If so update me if you get anymore progress. I'm interested to see since you have similar experience to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reality checks never worked for me. Seems I only have been able to dream/lucid dream (once) when I don&amp;#39;t have to worry about being anywhere in the morning. Like last night I barely could recall parts of a dream because I had to work at 10 am, even though I woke myself up around 8 am. &lt;/p&gt;\n\n&lt;p&gt;Also, was that your first lucid dream? If so update me if you get anymore progress. I&amp;#39;m interested to see since you have similar experience to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgcwnlk", "score_hidden": false, "stickied": false, "created": 1492421513.0, "created_utc": 1492392713.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcmmld", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlackStarX97", "parent_id": "t1_dgclbmk", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "The strange thing is that I was doong reality checks in a rush, and when i tried to poke a finger through my hand, ot didn't go through, but in that moment i didn't even care about the results of the reality checks ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The strange thing is that I was doong reality checks in a rush, and when i tried to poke a finger through my hand, ot didn&amp;#39;t go through, but in that moment i didn&amp;#39;t even care about the results of the reality checks &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgcmmld", "score_hidden": false, "stickied": false, "created": 1492408037.0, "created_utc": 1492379237.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgclbmk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ininsicken", "parent_id": "t1_dgcjqbz", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Seems like exactly what happened to me except I never did reality checks. I just randomly realized I was dreaming.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seems like exactly what happened to me except I never did reality checks. I just randomly realized I was dreaming.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgclbmk", "score_hidden": false, "stickied": false, "created": 1492406329.0, "created_utc": 1492377529.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcjqbz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BlackStarX97", "parent_id": "t3_65iqi0", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Had something similar two days ago, but after doing some reality checks and realizing i was dreaming, i start to kinda freak out and do whatever i could (and that made me think afterwards that i wasn't lucid). I lost lucidity after a short while and the dream wasn't vivid at all\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Had something similar two days ago, but after doing some reality checks and realizing i was dreaming, i start to kinda freak out and do whatever i could (and that made me think afterwards that i wasn&amp;#39;t lucid). I lost lucidity after a short while and the dream wasn&amp;#39;t vivid at all&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgcjqbz", "score_hidden": false, "stickied": false, "created": 1492404256.0, "created_utc": 1492375456.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]