[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was in a car driving to someplace, and I remember that I fell asleep. I then remember dreaming about being inside my bed, and I saw my brother right next to my bedside. I knew I was inside a dream, so I tried to get up and move, but I couldn&amp;#39;t. I then woke back up in the car. Later in the car ride, I fell back asleep, and I was in the same dream again. I still new that I was dreaming, but I couldn&amp;#39;t move. &lt;/p&gt;\n\n&lt;p&gt;Then I realized that I was not dreaming at all. It was when I was in the car that I was dreaming. When I was in my bed, I was actually awake. It&amp;#39;s like everything that I thought was happening got reversed.&lt;/p&gt;\n\n&lt;p&gt;The weird thing was... I could instantly go back into the car dream. I could switch out of being in a paralysis state into the car dream and vice versa.&lt;/p&gt;\n\n&lt;p&gt;When I finally got out of sleep paralysis, I realized that my brother wasn&amp;#39;t there. It was just me in my bed...&lt;/p&gt;\n\n&lt;p&gt;This is my first time having sleep paralysis, but it was different then I thought it what be. I was so confused the whole time, but I didn&amp;#39;t have any scary hallucinations. Have you ever had sleep paralysis? What was it like? What did you think of my story?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was in a car driving to someplace, and I remember that I fell asleep. I then remember dreaming about being inside my bed, and I saw my brother right next to my bedside. I knew I was inside a dream, so I tried to get up and move, but I couldn't. I then woke back up in the car. Later in the car ride, I fell back asleep, and I was in the same dream again. I still new that I was dreaming, but I couldn't move. \n\nThen I realized that I was not dreaming at all. It was when I was in the car that I was dreaming. When I was in my bed, I was actually awake. It's like everything that I thought was happening got reversed.\n\nThe weird thing was... I could instantly go back into the car dream. I could switch out of being in a paralysis state into the car dream and vice versa.\n\nWhen I finally got out of sleep paralysis, I realized that my brother wasn't there. It was just me in my bed...\n\nThis is my first time having sleep paralysis, but it was different then I thought it what be. I was so confused the whole time, but I didn't have any scary hallucinations. Have you ever had sleep paralysis? What was it like? What did you think of my story?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65jw6r", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 9, "report_reasons": null, "author": "LucidFigure", "saved": false, "mod_reports": [], "name": "t3_65jw6r", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/65jw6r/i_just_had_the_craziest_sleep_paralysis/", "num_reports": null, "locked": false, "stickied": false, "created": 1492301923.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/65jw6r/i_just_had_the_craziest_sleep_paralysis/", "author_flair_text": null, "quarantine": false, "title": "I just had the craziest sleep paralysis...", "created_utc": 1492273123.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65jw6r", "likes": null, "replies": "", "user_reports": [], "id": "dgb0jw3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Lawltas", "parent_id": "t3_65jw6r", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Dude this is so weird when i had sleep paralysis i also was in my bed and there also was my brother besides wtf", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude this is so weird when i had sleep paralysis i also was in my bed and there also was my brother besides wtf&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgb0jw3", "score_hidden": false, "stickied": false, "created": 1492311348.0, "created_utc": 1492282548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65jw6r", "likes": null, "replies": "", "user_reports": [], "id": "dgbv1di", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "deoxanth", "parent_id": "t3_65jw6r", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "Sorry kinda long... \n\nI've only had what I'd call a real sleep paralysis episode once. \n\nI was laying down on the couch at my mom's old house. We had been out late the night before, so I was extra tired that day. I remember laying down across the whole couch and I put my feet up on the arm, since I'm too tall to fit just on the cushions. The moment I put my feet up and could stretch out my legs I felt the most relaxed and comfortable in my life and that's when it happened. \n\nI felt like my arms and torso became very heavy, like a weight was laid on top of me. My whole body was heavy actually, and the only thing I eventually managed to move was my head. It was very frightening as I really couldn't move my body at all. My eyes were open and I was looking at a friend in the kitchen about 8 feet away. I couldn't move a muscle, and I was silently screaming in my head the whole time. The weight on my body kept increasing... slowly becoming heavier and heavier. At this point I put all I had in just raising my head up. Just getting my friend to notice the fear on my face and come to my aid. I thought I was dying. \n\nFinally I got my head to move and was able to come up into a sit-up position. All at once I got control of my body back. I sat up on the couch and just panicked for a bit until I could calm down.\n\nI sometimes get into an accidental lucid dream - which is why I'm in the sub. During the moment I'm drifting off and I feel like a lucid dream could happen... like, I know that I'll know I'm dreaming. Sometimes, in that sleepy, comfy, drifty place, sometimes I get that feeling that if I don't actually drift off, I'm going to enter sleep paralysis again. Like, I'll be stuck in-between if that makes sense. I've learned to feel it coming and have kinda been able to avoid it.\n\n I don't know if this helps or what.... I just wanted to get it out I guess. I'm glad your episode was less scary for you. I think it's the feeling of something holding you down. Ugh... just thinking about it now...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry kinda long... &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve only had what I&amp;#39;d call a real sleep paralysis episode once. &lt;/p&gt;\n\n&lt;p&gt;I was laying down on the couch at my mom&amp;#39;s old house. We had been out late the night before, so I was extra tired that day. I remember laying down across the whole couch and I put my feet up on the arm, since I&amp;#39;m too tall to fit just on the cushions. The moment I put my feet up and could stretch out my legs I felt the most relaxed and comfortable in my life and that&amp;#39;s when it happened. &lt;/p&gt;\n\n&lt;p&gt;I felt like my arms and torso became very heavy, like a weight was laid on top of me. My whole body was heavy actually, and the only thing I eventually managed to move was my head. It was very frightening as I really couldn&amp;#39;t move my body at all. My eyes were open and I was looking at a friend in the kitchen about 8 feet away. I couldn&amp;#39;t move a muscle, and I was silently screaming in my head the whole time. The weight on my body kept increasing... slowly becoming heavier and heavier. At this point I put all I had in just raising my head up. Just getting my friend to notice the fear on my face and come to my aid. I thought I was dying. &lt;/p&gt;\n\n&lt;p&gt;Finally I got my head to move and was able to come up into a sit-up position. All at once I got control of my body back. I sat up on the couch and just panicked for a bit until I could calm down.&lt;/p&gt;\n\n&lt;p&gt;I sometimes get into an accidental lucid dream - which is why I&amp;#39;m in the sub. During the moment I&amp;#39;m drifting off and I feel like a lucid dream could happen... like, I know that I&amp;#39;ll know I&amp;#39;m dreaming. Sometimes, in that sleepy, comfy, drifty place, sometimes I get that feeling that if I don&amp;#39;t actually drift off, I&amp;#39;m going to enter sleep paralysis again. Like, I&amp;#39;ll be stuck in-between if that makes sense. I&amp;#39;ve learned to feel it coming and have kinda been able to avoid it.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if this helps or what.... I just wanted to get it out I guess. I&amp;#39;m glad your episode was less scary for you. I think it&amp;#39;s the feeling of something holding you down. Ugh... just thinking about it now...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgbv1di", "score_hidden": false, "stickied": false, "created": 1492361369.0, "created_utc": 1492332569.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]