[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just a playful reminder:\nThis is still a dream that seems to be going on at the moment. And it&amp;#39;s possible to wake up to the dream that has been taken to be the actual reality. Don&amp;#39;t merely blindly believe me though. I&amp;#39;m just saying that it&amp;#39;s possible to start to entertain the possibility and eventually to directly have the experience beyond the dream character that seems to be appearing for the moment.&lt;/p&gt;\n\n&lt;p&gt;There are clues within this dream that point out the fact that it&amp;#39;s a dream and it&amp;#39;s possible to wake up. Buddha talked about it for example, Jesus pointed it out as well among other characters. There are other traditions that talk about it as well. It&amp;#39;s about nothing more than becoming lucid right now. The lucidity is beyond/prior to the idea of this life, just being aware. Who are you when you are not taking yourself to be the dream character? What are you without referring to thoughts and imagination about yourself, not refering to past and memories which are actually just thinking appearing now? Who/what is aware of this &amp;quot;you-character&amp;quot; that you have taken to be yourself up until now? If these questions are entertained in the right manner (lightly, curiously, open mindedly), the dream will start to be seen through until the trance breaks altogether, at least for a clear moment.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying anyone &amp;quot;should&amp;quot; wake up. If life&amp;#39;s good then there&amp;#39;s probably no urge for resolution. But if it&amp;#39;s unsatisfactory then it&amp;#39;s good to know that it&amp;#39;s not that serious and there&amp;#39;s a way to end the suffering or dissatisfaction by direct realization ie. becoming lucid. Which is the only way to resolve the dilemma of existing in time and space, which is a dream seemingly happening to a central dream character called &amp;quot;Me-this-body&amp;quot;. Whatever the body&amp;#39;s name is. You are actually prior to the appearance of the body and when that is suddenly realized all the seriousness and heaviness of this life disappears.&lt;/p&gt;\n\n&lt;p&gt;Ps. If anyone has been or is considering checking out by suicide I must disappoint you and say it most probably won&amp;#39;t help. Since there is some truth to karma, apparent cause and effect. There would probably be another dream/nightmare after this apparent body dies. The only thing that ultimately helps is seeing the sufferer that has been taken to be myself as not ultimately what I am. &amp;quot;I am prior to the sense of being a separate person, being aware of it&amp;quot;. There&amp;#39;s nothing wrong with apparent persons and personalities. They don&amp;#39;t need to be gotten rid of. Nothing needs to be gotten rid of. Everything is an expression of the freedom that we actually are.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Nothing real can be threatened.\nNothing unreal exists.\nHerein lies the peace of God.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just a playful reminder:\nThis is still a dream that seems to be going on at the moment. And it's possible to wake up to the dream that has been taken to be the actual reality. Don't merely blindly believe me though. I'm just saying that it's possible to start to entertain the possibility and eventually to directly have the experience beyond the dream character that seems to be appearing for the moment.\n\nThere are clues within this dream that point out the fact that it's a dream and it's possible to wake up. Buddha talked about it for example, Jesus pointed it out as well among other characters. There are other traditions that talk about it as well. It's about nothing more than becoming lucid right now. The lucidity is beyond/prior to the idea of this life, just being aware. Who are you when you are not taking yourself to be the dream character? What are you without referring to thoughts and imagination about yourself, not refering to past and memories which are actually just thinking appearing now? Who/what is aware of this \"you-character\" that you have taken to be yourself up until now? If these questions are entertained in the right manner (lightly, curiously, open mindedly), the dream will start to be seen through until the trance breaks altogether, at least for a clear moment.\n\nI'm not saying anyone \"should\" wake up. If life's good then there's probably no urge for resolution. But if it's unsatisfactory then it's good to know that it's not that serious and there's a way to end the suffering or dissatisfaction by direct realization ie. becoming lucid. Which is the only way to resolve the dilemma of existing in time and space, which is a dream seemingly happening to a central dream character called \"Me-this-body\". Whatever the body's name is. You are actually prior to the appearance of the body and when that is suddenly realized all the seriousness and heaviness of this life disappears.\n\nPs. If anyone has been or is considering checking out by suicide I must disappoint you and say it most probably won't help. Since there is some truth to karma, apparent cause and effect. There would probably be another dream/nightmare after this apparent body dies. The only thing that ultimately helps is seeing the sufferer that has been taken to be myself as not ultimately what I am. \"I am prior to the sense of being a separate person, being aware of it\". There's nothing wrong with apparent persons and personalities. They don't need to be gotten rid of. Nothing needs to be gotten rid of. Everything is an expression of the freedom that we actually are.\n\n\"Nothing real can be threatened.\nNothing unreal exists.\nHerein lies the peace of God.\"", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65l4ql", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 12, "report_reasons": null, "author": "Reef_Fields", "saved": false, "mod_reports": [], "name": "t3_65l4ql", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": 1492287031.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/65l4ql/why_arent_you_lucid_now/", "num_reports": null, "locked": false, "stickied": false, "created": 1492315643.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/65l4ql/why_arent_you_lucid_now/", "author_flair_text": null, "quarantine": false, "title": "Why aren't you lucid now?", "created_utc": 1492286843.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 1, "visited": false, "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65l4ql", "likes": null, "replies": "", "user_reports": [], "id": "dgbl0rt", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Luxevolve", "parent_id": "t3_65l4ql", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "This is some crazy synchronicity is all I can say.  \nThanks for the wonderful reminder.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is some crazy synchronicity is all I can say.&lt;br/&gt;\nThanks for the wonderful reminder.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgbl0rt", "score_hidden": false, "stickied": false, "created": 1492340202.0, "created_utc": 1492311402.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}]