[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey everybody , I figured I&amp;#39;d share my scariest lucid dreaming experience.&lt;/p&gt;\n\n&lt;p&gt;I was a freshman college and I had gotten interested in lucid dreaming and astral projection. Through practice I had gotten fairly proficient at lucid dreaming, I figured the next step was to learn to astral project. I read somewhere that lucid dreaming is an avenue into astral projection so I was excited. Que a weekday afternoon. I took a nap intending to lucid dream. The dream was fine with me generally in control but then I ended up on a dark sidewalk with some street lights lighting the way, and a slight drizzle. As I am walking down the sidewalk a figure begins following me. This thing is very tall and wearing a long trench coat with a hat tilted down covering his face. I think nothing of it as I am usually in control of my dreams. &lt;/p&gt;\n\n&lt;p&gt;The thing eventually is walking right behind me and I turn around telling it to leave and that this was my dream. He calmly walks up to me and lifts me up and says I have no power here and begins laughing at me. He lets me go and I run away when I suddenly fall into an endless black void. When I hit the bottom I am still surrounded by darkness and then I see a multi colored light being emitted from some large box. I approach the box and a voice tells me to look into it. As I peer into the box I see every worldly desire I have. The voice tells me to enter and it will all be mine. I put my hands on the side of the box and my hands begin to rot. I pull away and the voice tempts me back.  I start getting really freaked out and I begin praying ( I&amp;#39;m Christian ) and the voice laughs and says I am now beyond saving. I have no chance of escape and no one will help me, I belong to him. Finally after much taunting by this thing I force myself awake and my eyes open. &lt;/p&gt;\n\n&lt;p&gt;I am laying in my bed and I literally see my roommate on his laptop with his headphones in. I quickly realize I can&amp;#39;t move and then I hear a voice in my ear, the same voice as the man in the coat and in the void. It tells me that I have meddled in things I shouldn&amp;#39;t have and that I could never escape him. He keeps taunting me until I finally wake up by moving my toes. &lt;/p&gt;\n\n&lt;p&gt;I am sure you can guess that I dropped lucid dreaming and astral projection. I did have one more encounter with the voice where he just whispered look whose back and then started laughing. Luckily I haven&amp;#39;t had SP for about 2 years now, I hope to keep it that way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey everybody , I figured I'd share my scariest lucid dreaming experience.\n\nI was a freshman college and I had gotten interested in lucid dreaming and astral projection. Through practice I had gotten fairly proficient at lucid dreaming, I figured the next step was to learn to astral project. I read somewhere that lucid dreaming is an avenue into astral projection so I was excited. Que a weekday afternoon. I took a nap intending to lucid dream. The dream was fine with me generally in control but then I ended up on a dark sidewalk with some street lights lighting the way, and a slight drizzle. As I am walking down the sidewalk a figure begins following me. This thing is very tall and wearing a long trench coat with a hat tilted down covering his face. I think nothing of it as I am usually in control of my dreams. \n\nThe thing eventually is walking right behind me and I turn around telling it to leave and that this was my dream. He calmly walks up to me and lifts me up and says I have no power here and begins laughing at me. He lets me go and I run away when I suddenly fall into an endless black void. When I hit the bottom I am still surrounded by darkness and then I see a multi colored light being emitted from some large box. I approach the box and a voice tells me to look into it. As I peer into the box I see every worldly desire I have. The voice tells me to enter and it will all be mine. I put my hands on the side of the box and my hands begin to rot. I pull away and the voice tempts me back.  I start getting really freaked out and I begin praying ( I'm Christian ) and the voice laughs and says I am now beyond saving. I have no chance of escape and no one will help me, I belong to him. Finally after much taunting by this thing I force myself awake and my eyes open. \n\nI am laying in my bed and I literally see my roommate on his laptop with his headphones in. I quickly realize I can't move and then I hear a voice in my ear, the same voice as the man in the coat and in the void. It tells me that I have meddled in things I shouldn't have and that I could never escape him. He keeps taunting me until I finally wake up by moving my toes. \n\nI am sure you can guess that I dropped lucid dreaming and astral projection. I did have one more encounter with the voice where he just whispered look whose back and then started laughing. Luckily I haven't had SP for about 2 years now, I hope to keep it that way.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65ljp2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "ManInCoat", "saved": false, "mod_reports": [], "name": "t3_65ljp2", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/65ljp2/lucid_dream_to_sleep_paralysis/", "num_reports": null, "locked": false, "stickied": false, "created": 1492320521.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/65ljp2/lucid_dream_to_sleep_paralysis/", "author_flair_text": null, "quarantine": false, "title": "Lucid Dream to Sleep Paralysis", "created_utc": 1492291721.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]