[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You can read the wall of text coming up, I just woke up so I decided to write it down here to manifest the experience and memory, but &lt;strong&gt;I will put the main questions in bold, so you can skip ahead if you like&lt;/strong&gt; if you understandably don&amp;#39;t feel like reading it all. Now I think I had my first genuine lucid dreaming experience tonight (without trying). In the past I head dreams where I dreamed that I was in charge of the dream experience, but this time I believe that while this was also the case towards the end and here and there in terms of world building, it started off with me in control. Weird experience over all and I got some questions.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;First off, I never planned for this tonight. I didn&amp;#39;t keep a dream diary and so on, but I took 1 mg of melatonin and 1 mg of Xanax/alprazolam before going to bed. After about 4 hours or so of falling asleep I had my first very short-lived lucid experience, I was in a dream in which I was in an indoor swimming pool at night with tons of other people, I was swimming through the air and in the distance a nuclear explosion went off, that suddenly got closer, turned out to be a nuclear tornado, then a normal tornado, smashed through the wall and chased us, then a vacuum cleaner and that&amp;#39;s pretty much the point where I realized that this even for a dream doesn&amp;#39;t make much sense, got lucid for like 1 second and woke up. I believe the dream was too intense/nightmareish, wrote it down because of how weird it was and went back to bed. That&amp;#39;s when about another 2 to 4 hours later I had an actual lucid dream.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The location was set in the apartment I grew up in from the age of 6 to around 18.&lt;/p&gt;\n\n&lt;p&gt;In terms of of intensity of phenomena it was definitely the most realistic dream I ever had, although not comparable with real life. The visual sensations were as strong as me being drunk in a poorly lit room or some really strong memories of a well lit room, maybe a bit stronger. Smell wasn&amp;#39;t there at all but I generally don&amp;#39;t care about that sense, so that&amp;#39;s maybe why. Hearing also wasn&amp;#39;t really there, but that&amp;#39;s because in my dreams I just always know what sound occurs or thing is being said instead of it actually happening, maybe that&amp;#39;s why. Taste was actually there here and there and was relatively real, but taste IRL is also not the most intense sensation for me. And at last touch, it was there here and there but it felt numb in general and also not as intense. Overall though, everything taken together it was the most realistic dream I had. But: &lt;strong&gt;How intense can it get? Is this it, or to what degree is it possible to feel the dream world around you? Can I cultivate this with practice and experience?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In terms of what I was able to do, well, that was a bit weird because whenever I tried to go somewhere towards an experience that I haven&amp;#39;t fully experienced yet IRL, I drifted away. There were like 3 dream levels for me, 1 the lucid dream, 2 a sort of &amp;quot;lobby&amp;quot; and 3 the process of waking up. So when I did a mistake that required too much concentration I felt myself getting dragged away towards 3 and in the end I did end up losing more and more control in the dream itself and waking up, which is where I am right now, writing this. &lt;strong&gt;Will I be able to gain more control over time, with practice and more experience, and be more conscious? Because today it felt like a battle versus my unconscious, which eventually won and took over, and once I fought back against it I woke up.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I am already losing memory of what happened tbh, I don&amp;#39;t even remember anymore how I found out I was dreaming, only that after a while I had control over what to do. I did what every man my age would immediately attempt to do, eat ice cream, have sex and play video games. I must say I was faithful to my girlfriend though! The ice cream was where I discovered that taste actually functions pretty well, although it felt like tasting something while on LSD (which is actually more impressive IMO), the sex I don&amp;#39;t remember as well anymore but that is actually quite realistic when compared to real sex, but that&amp;#39;s when I discovered the touch sensation wasn&amp;#39;t all there (like having sex while being drunk), at least it wasn&amp;#39;t physically exhausting and I wasn&amp;#39;t horny like a dog so I just stopped and last but not least video games, which was actually my way of experiencing a bit of chaotic dreaming. It&amp;#39;s crazy that I wasn&amp;#39;t able to fly myself but able to let a video game character fly that I then imagined to be myself, but oh well. Sadly I didn&amp;#39;t think of working out while dreaming, I heard it actually influences muscle growth to a small degree. &lt;strong&gt;Will I be able to go further with practice, that is experience unrealistic phenomena and so on over time and gain more and more freedom?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Well that was pretty much it, maybe I&amp;#39;ll get a reply or two, thanks for listening!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "You can read the wall of text coming up, I just woke up so I decided to write it down here to manifest the experience and memory, but **I will put the main questions in bold, so you can skip ahead if you like** if you understandably don't feel like reading it all. Now I think I had my first genuine lucid dreaming experience tonight (without trying). In the past I head dreams where I dreamed that I was in charge of the dream experience, but this time I believe that while this was also the case towards the end and here and there in terms of world building, it started off with me in control. Weird experience over all and I got some questions.\n\n*First off, I never planned for this tonight. I didn't keep a dream diary and so on, but I took 1 mg of melatonin and 1 mg of Xanax/alprazolam before going to bed. After about 4 hours or so of falling asleep I had my first very short-lived lucid experience, I was in a dream in which I was in an indoor swimming pool at night with tons of other people, I was swimming through the air and in the distance a nuclear explosion went off, that suddenly got closer, turned out to be a nuclear tornado, then a normal tornado, smashed through the wall and chased us, then a vacuum cleaner and that's pretty much the point where I realized that this even for a dream doesn't make much sense, got lucid for like 1 second and woke up. I believe the dream was too intense/nightmareish, wrote it down because of how weird it was and went back to bed. That's when about another 2 to 4 hours later I had an actual lucid dream.*\n\nThe location was set in the apartment I grew up in from the age of 6 to around 18.\n\nIn terms of of intensity of phenomena it was definitely the most realistic dream I ever had, although not comparable with real life. The visual sensations were as strong as me being drunk in a poorly lit room or some really strong memories of a well lit room, maybe a bit stronger. Smell wasn't there at all but I generally don't care about that sense, so that's maybe why. Hearing also wasn't really there, but that's because in my dreams I just always know what sound occurs or thing is being said instead of it actually happening, maybe that's why. Taste was actually there here and there and was relatively real, but taste IRL is also not the most intense sensation for me. And at last touch, it was there here and there but it felt numb in general and also not as intense. Overall though, everything taken together it was the most realistic dream I had. But: **How intense can it get? Is this it, or to what degree is it possible to feel the dream world around you? Can I cultivate this with practice and experience?**\n\nIn terms of what I was able to do, well, that was a bit weird because whenever I tried to go somewhere towards an experience that I haven't fully experienced yet IRL, I drifted away. There were like 3 dream levels for me, 1 the lucid dream, 2 a sort of \"lobby\" and 3 the process of waking up. So when I did a mistake that required too much concentration I felt myself getting dragged away towards 3 and in the end I did end up losing more and more control in the dream itself and waking up, which is where I am right now, writing this. **Will I be able to gain more control over time, with practice and more experience, and be more conscious? Because today it felt like a battle versus my unconscious, which eventually won and took over, and once I fought back against it I woke up.**\n\nI am already losing memory of what happened tbh, I don't even remember anymore how I found out I was dreaming, only that after a while I had control over what to do. I did what every man my age would immediately attempt to do, eat ice cream, have sex and play video games. I must say I was faithful to my girlfriend though! The ice cream was where I discovered that taste actually functions pretty well, although it felt like tasting something while on LSD (which is actually more impressive IMO), the sex I don't remember as well anymore but that is actually quite realistic when compared to real sex, but that's when I discovered the touch sensation wasn't all there (like having sex while being drunk), at least it wasn't physically exhausting and I wasn't horny like a dog so I just stopped and last but not least video games, which was actually my way of experiencing a bit of chaotic dreaming. It's crazy that I wasn't able to fly myself but able to let a video game character fly that I then imagined to be myself, but oh well. Sadly I didn't think of working out while dreaming, I heard it actually influences muscle growth to a small degree. **Will I be able to go further with practice, that is experience unrealistic phenomena and so on over time and gain more and more freedom?**\n\nWell that was pretty much it, maybe I'll get a reply or two, thanks for listening!", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Success!", "id": "65tppv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 5, "report_reasons": null, "author": "spuksprenger", "saved": false, "mod_reports": [], "name": "t3_65tppv", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": 1492406368.0, "link_flair_css_class": "success", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/65tppv/first_unexpected_lucid_dream_ice_cream_sex_and/", "num_reports": null, "locked": false, "stickied": false, "created": 1492434689.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/65tppv/first_unexpected_lucid_dream_ice_cream_sex_and/", "author_flair_text": null, "quarantine": false, "title": "first unexpected lucid dream, ice cream, sex and video games! (and a couple of questions for you experienced dreamers)", "created_utc": 1492405889.0, "distinguished": null, "media": null, "upvote_ratio": 0.86, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65tppv", "likes": null, "replies": "", "user_reports": [], "id": "dgd7g1n", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Cobblest0ne", "parent_id": "t3_65tppv", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "&gt; How intense can it get? Is this it, or to what degree is it possible to feel the dream world around you? Can I cultivate this with practice and experience?\n\nIt depends on how lucid you are. It can go from vivid to extremly realistic. Depends on a lot of factors (experience with lucid dreams, technique, ...)\n\n&gt; Will I be able to gain more control over time, with practice and more experience, and be more conscious? Because today it felt like a battle versus my unconscious, which eventually won and took over, and once I fought back against it I woke up\n\nDefenitly. This can also help you \n\nhttp://www.dreamviews.com/wiki/Dream-Stabilization-and-Clarity-Tutorial\n\n&gt; Will I be able to go further with practice, that is experience unrealistic phenomena and so on over time and gain more and more freedom?\n\nLike Elon Musk would say, ***Yes***\n\n**Conclusion :**\n\nYou had a low lucid dream. Not uncommon for beginners but defenitly how lucid dreams can be. But a big first step in the right direction\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How intense can it get? Is this it, or to what degree is it possible to feel the dream world around you? Can I cultivate this with practice and experience?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It depends on how lucid you are. It can go from vivid to extremly realistic. Depends on a lot of factors (experience with lucid dreams, technique, ...)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Will I be able to gain more control over time, with practice and more experience, and be more conscious? Because today it felt like a battle versus my unconscious, which eventually won and took over, and once I fought back against it I woke up&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Defenitly. This can also help you &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.dreamviews.com/wiki/Dream-Stabilization-and-Clarity-Tutorial\"&gt;http://www.dreamviews.com/wiki/Dream-Stabilization-and-Clarity-Tutorial&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Will I be able to go further with practice, that is experience unrealistic phenomena and so on over time and gain more and more freedom?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Like Elon Musk would say, &lt;strong&gt;&lt;em&gt;Yes&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conclusion :&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;You had a low lucid dream. Not uncommon for beginners but defenitly how lucid dreams can be. But a big first step in the right direction&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgd7g1n", "score_hidden": false, "stickied": false, "created": 1492439232.0, "created_utc": 1492410432.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2r0f4", "removal_reason": null, "link_id": "t3_65tppv", "likes": null, "replies": "", "user_reports": [], "id": "dgd7g8n", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "BowlOfManZ", "parent_id": "t3_65tppv", "subreddit_name_prefixed": "r/LucidDreaming", "controversiality": 0, "body": "I'll be honest, I didn't read the whole thing, just the questions and skimming some context (it's past 2:00 AM and I have school tomorrow (don't be like me, get healthy amounts of sleep, just today I've been busy)).\nDreams can be exactly like real life. In fact, I'm pretty sure they can be realer than real life. Look into clarity and dream stabilization methods if you're trying to get more vivid dreams.\nAs an answer to all the practice themed questions, yes. I really don't know what more to say about that.\n\n...shit, it's 2:30 now I'm going to bed", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be honest, I didn&amp;#39;t read the whole thing, just the questions and skimming some context (it&amp;#39;s past 2:00 AM and I have school tomorrow (don&amp;#39;t be like me, get healthy amounts of sleep, just today I&amp;#39;ve been busy)).\nDreams can be exactly like real life. In fact, I&amp;#39;m pretty sure they can be realer than real life. Look into clarity and dream stabilization methods if you&amp;#39;re trying to get more vivid dreams.\nAs an answer to all the practice themed questions, yes. I really don&amp;#39;t know what more to say about that.&lt;/p&gt;\n\n&lt;p&gt;...shit, it&amp;#39;s 2:30 now I&amp;#39;m going to bed&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "LucidDreaming", "name": "t1_dgd7g8n", "score_hidden": false, "stickied": false, "created": 1492439245.0, "created_utc": 1492410445.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]