[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "LucidDreaming", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ve known about lucid dreaming for a few years now but have never done it. Anyways I tried to meditate last night to help go to sleep and it was some voice guided thing. Anyways I remember being in a class room and it all looked very vivid. I&amp;#39;m not sure what exactly sparked the idea that I was dreaming but I think it was looking at my hands and seeing how many fingers I had. Anyways I started to think &amp;quot;oh my god I&amp;#39;m dreaming right now!&amp;quot;, I was afraid to act out though because I wasn&amp;#39;t %100 sure I was dreaming or if it was actually real. Then I remember a fruit was on my desk, I think it was an apple. The dots started to connect and I now knew I was %100 in a dream. Once I made this connection, I assume the principle came in and asked for me to step outside. I ran away from him and suddenly I was being chased down the street. My two best friends suddenly joined behind me running from our principle. I remember I screamed out &amp;quot;I WISH WE HAD BIKES!&amp;quot; And three bikes appeared like how you would spawn in something in a video game. (Appear in mid air then drop to the ground). We got on and got away from the principle. That&amp;#39;s all I really remember haha but it was so vivid.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I've known about lucid dreaming for a few years now but have never done it. Anyways I tried to meditate last night to help go to sleep and it was some voice guided thing. Anyways I remember being in a class room and it all looked very vivid. I'm not sure what exactly sparked the idea that I was dreaming but I think it was looking at my hands and seeing how many fingers I had. Anyways I started to think \"oh my god I'm dreaming right now!\", I was afraid to act out though because I wasn't %100 sure I was dreaming or if it was actually real. Then I remember a fruit was on my desk, I think it was an apple. The dots started to connect and I now knew I was %100 in a dream. Once I made this connection, I assume the principle came in and asked for me to step outside. I ran away from him and suddenly I was being chased down the street. My two best friends suddenly joined behind me running from our principle. I remember I screamed out \"I WISH WE HAD BIKES!\" And three bikes appeared like how you would spawn in something in a video game. (Appear in mid air then drop to the ground). We got on and got away from the principle. That's all I really remember haha but it was so vivid.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65x18g", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 2, "report_reasons": null, "author": "KoasMind", "saved": false, "mod_reports": [], "name": "t3_65x18g", "subreddit_name_prefixed": "r/LucidDreaming", "approved_by": null, "over_18": false, "domain": "self.LucidDreaming", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2r0f4", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/LucidDreaming/comments/65x18g/my_first_lucid_dream/", "num_reports": null, "locked": false, "stickied": false, "created": 1492479370.0, "url": "https://www.reddit.com/r/LucidDreaming/comments/65x18g/my_first_lucid_dream/", "author_flair_text": null, "quarantine": false, "title": "My first lucid dream.", "created_utc": 1492450570.0, "distinguished": null, "media": null, "upvote_ratio": 1.0, "num_comments": 0, "visited": false, "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [], "after": null, "before": null}}]