[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "electronic_cigarette", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For a long time, I&amp;#39;ve been waiting for a regulated dual 18650 squonker with a DNA board. Wasn&amp;#39;t interested in unregulated, single 18650, 26650, lipo, any of those. Just a dual 18650 with a DNA board. When I found out Lost Vape was coming out with one, I looked up everything I could. Waited months for it to come out and ordered it as soon as I saw it from an American retailer. I got mine at Element Vape with a pair of VTC6s so I paid just under $175. Ordered on a Thursday morning, arrived on Saturday via Priority Mail. Note that I live in San Diego and Element Vape is in LA, so that&amp;#39;s not a real distance to travel. Anyway onto the mod.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Packaging&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My box came shrink wrapped. It was in a regular priority mail envelope. The ones lined with bubble wrap even though you know an actual fall would probably do some kind of damage. No damage to the box&amp;#39;s exterior which is basically a black Triade box. Like other people have noted, the inner lining where the mod sits was messed up a bit. Plastic was cracked but it didn&amp;#39;t mess up the mod so I can forgive that. Maybe it&amp;#39;s me but the material for the box is nicer than the one the Triade came in. It&amp;#39;s softer but hey, a box is a box, you&amp;#39;re not gonna vape a box so it&amp;#39;s not something to gush over.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Contents&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;1-Mod&lt;/p&gt;\n\n&lt;p&gt;1-USB-A to Micro-USB cable&lt;/p&gt;\n\n&lt;p&gt;1-11ml bottle&lt;/p&gt;\n\n&lt;p&gt;Instruction Manuals&lt;/p&gt;\n\n&lt;p&gt;Only thing I (and a lot of other people) can complain about is the lack of a second bottle. Other thing that&amp;#39;s just nitpicky is the USB cable. It&amp;#39;s too short and fragile. I used the one that came with my Triade to charge my Halcyon from a battery bank and that&amp;#39;s the only charge it ever made. Why? The plastic part of the Micro-USB section came apart. We all probably have more cables than we need, but even I can say that I don&amp;#39;t have enough.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Mod&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Gotta get it off my chest first. I HATE the firing button on it. It&amp;#39;s too mushy, requires too much force to press, and could just come off the body a hair higher. The up/down buttons feel much more solid and have a more positive click to them. I just hope it doesn&amp;#39;t suffer the same fate as my Triade, as the firing button on that likes to stick.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not much bigger than the Triade and it feels good in my hands. There&amp;#39;s quite a bit of heft to it with batteries in but I prefer it since I feel like it makes for a sturdier mod. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t care too much for the bare metal look, I&amp;#39;d much rather it be painted the same color as the rest of the mod or be more matte but it makes it unique and I&amp;#39;m pretty sure I&amp;#39;ll stop caring or just grow to like it.&lt;/p&gt;\n\n&lt;p&gt;The battery door isn&amp;#39;t too strong nor is it too weak. It takes a lot less effort than the Triade because the notches to lock the bottom aren&amp;#39;t there but it&amp;#39;s not like any violent shaking will remove it. A drop will, but I don&amp;#39;t want to test that and dropping my mods is the last thing I want to do.&lt;/p&gt;\n\n&lt;p&gt;The cutout for the squonk bottle is something I&amp;#39;m still determining whether or not I like. On one hand, it shows the bottle and just that, a &lt;em&gt;perfect&lt;/em&gt; cut out. But on the other hand, I feel like it could show just a bit more so you have more of the bottle to push down. You don&amp;#39;t have to use another hand to squeeze the bottle and the chamfer helps but I feel like it could just show a little bit more.&lt;/p&gt;\n\n&lt;p&gt;When I opened it up, there was what I assume was the residue of VG or PG inside the bottle. Little droplets that I washed out with water but still enough to make a stickler pissed off. Same for the 510, little drop of VG/PG but something you can clean up.&lt;/p&gt;\n\n&lt;p&gt;The bottle is nice and soft for me. A lot softer than the Halcyon, but probably not as much as those Italian super soft bottles. The tubing is real tight and makes a good seal but I&amp;#39;m sure that&amp;#39;ll loosen up a bit over time.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Other&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if Lost Vape set up the board with the right case settings, but I&amp;#39;m trusting that they did. The presets on there are decent. Option for straight wattage, Ni200 with different preheat levels, SS316, Titanium, all the standard stuff. Not much to say since DNA75/200/250 are basically the same when it comes to layout on the mod and on EScribe. I just did my usual tweaks to change brightness, what info shows on the screen, etc.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been using my Hadaly on there with 26N80/36K 6/5 wrap and compared to my Halcyon, the Drone reads .03 lower. (0.61 vs 0.64). That might just be the 510 on the Halcyon but it doesn&amp;#39;t make too big of a difference for the way I vape.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Overall&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Was it worth it? To me, yes. Until something like a 1600mAh lipo squonker comes out with a body that doesn&amp;#39;t feel like a massive brick in my hands comes out, this will probably my daily mod as long as I squonk. If there was a way to have the board max out at 60W to allow the batteries to be run in parallel, I&amp;#39;d love that and I probably wouldn&amp;#39;t buy another squonk mod for a long time. I won&amp;#39;t speak about the anodizing, paint job, etc as it&amp;#39;s too early to tell.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "For a long time, I've been waiting for a regulated dual 18650 squonker with a DNA board. Wasn't interested in unregulated, single 18650, 26650, lipo, any of those. Just a dual 18650 with a DNA board. When I found out Lost Vape was coming out with one, I looked up everything I could. Waited months for it to come out and ordered it as soon as I saw it from an American retailer. I got mine at Element Vape with a pair of VTC6s so I paid just under $175. Ordered on a Thursday morning, arrived on Saturday via Priority Mail. Note that I live in San Diego and Element Vape is in LA, so that's not a real distance to travel. Anyway onto the mod.\n\n**Packaging**\n\nMy box came shrink wrapped. It was in a regular priority mail envelope. The ones lined with bubble wrap even though you know an actual fall would probably do some kind of damage. No damage to the box's exterior which is basically a black Triade box. Like other people have noted, the inner lining where the mod sits was messed up a bit. Plastic was cracked but it didn't mess up the mod so I can forgive that. Maybe it's me but the material for the box is nicer than the one the Triade came in. It's softer but hey, a box is a box, you're not gonna vape a box so it's not something to gush over.\n\n**Contents**\n\n1-Mod\n\n1-USB-A to Micro-USB cable\n\n1-11ml bottle\n\nInstruction Manuals\n\n\nOnly thing I (and a lot of other people) can complain about is the lack of a second bottle. Other thing that's just nitpicky is the USB cable. It's too short and fragile. I used the one that came with my Triade to charge my Halcyon from a battery bank and that's the only charge it ever made. Why? The plastic part of the Micro-USB section came apart. We all probably have more cables than we need, but even I can say that I don't have enough.\n\n**Mod**\n\nGotta get it off my chest first. I HATE the firing button on it. It's too mushy, requires too much force to press, and could just come off the body a hair higher. The up/down buttons feel much more solid and have a more positive click to them. I just hope it doesn't suffer the same fate as my Triade, as the firing button on that likes to stick.\n\nIt's not much bigger than the Triade and it feels good in my hands. There's quite a bit of heft to it with batteries in but I prefer it since I feel like it makes for a sturdier mod. \n\nI don't care too much for the bare metal look, I'd much rather it be painted the same color as the rest of the mod or be more matte but it makes it unique and I'm pretty sure I'll stop caring or just grow to like it.\n\nThe battery door isn't too strong nor is it too weak. It takes a lot less effort than the Triade because the notches to lock the bottom aren't there but it's not like any violent shaking will remove it. A drop will, but I don't want to test that and dropping my mods is the last thing I want to do.\n\nThe cutout for the squonk bottle is something I'm still determining whether or not I like. On one hand, it shows the bottle and just that, a *perfect* cut out. But on the other hand, I feel like it could show just a bit more so you have more of the bottle to push down. You don't have to use another hand to squeeze the bottle and the chamfer helps but I feel like it could just show a little bit more.\n\nWhen I opened it up, there was what I assume was the residue of VG or PG inside the bottle. Little droplets that I washed out with water but still enough to make a stickler pissed off. Same for the 510, little drop of VG/PG but something you can clean up.\n\nThe bottle is nice and soft for me. A lot softer than the Halcyon, but probably not as much as those Italian super soft bottles. The tubing is real tight and makes a good seal but I'm sure that'll loosen up a bit over time.\n\n**Other**\n\nI don't know if Lost Vape set up the board with the right case settings, but I'm trusting that they did. The presets on there are decent. Option for straight wattage, Ni200 with different preheat levels, SS316, Titanium, all the standard stuff. Not much to say since DNA75/200/250 are basically the same when it comes to layout on the mod and on EScribe. I just did my usual tweaks to change brightness, what info shows on the screen, etc.\n\nI've been using my Hadaly on there with 26N80/36K 6/5 wrap and compared to my Halcyon, the Drone reads .03 lower. (0.61 vs 0.64). That might just be the 510 on the Halcyon but it doesn't make too big of a difference for the way I vape.\n\n\n**Overall**\n\nWas it worth it? To me, yes. Until something like a 1600mAh lipo squonker comes out with a body that doesn't feel like a massive brick in my hands comes out, this will probably my daily mod as long as I squonk. If there was a way to have the board max out at 60W to allow the batteries to be run in parallel, I'd love that and I probably wouldn't buy another squonk mod for a long time. I won't speak about the anodizing, paint job, etc as it's too early to tell.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Review", "id": "65ruad", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10, "report_reasons": null, "author": "suspiciouspackages", "saved": false, "mod_reports": [], "name": "t3_65ruad", "subreddit_name_prefixed": "r/electronic_cigarette", "approved_by": null, "over_18": false, "domain": "self.electronic_cigarette", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmlu", "edited": false, "link_flair_css_class": "review", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/electronic_cigarette/comments/65ruad/lost_vape_drone_first_impressions/", "num_reports": null, "locked": false, "stickied": false, "created": 1492410577.0, "url": "https://www.reddit.com/r/electronic_cigarette/comments/65ruad/lost_vape_drone_first_impressions/", "author_flair_text": null, "quarantine": false, "title": "Lost Vape Drone - First Impressions", "created_utc": 1492381777.0, "distinguished": null, "media": null, "upvote_ratio": 0.78, "num_comments": 19, "visited": false, "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgcpuyc", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "sabledrakon", "parent_id": "t3_65ruad", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "This really makes me wish I had the cash for a Drone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This really makes me wish I had the cash for a Drone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgcpuyc", "score_hidden": false, "stickied": false, "created": 1492412411.0, "created_utc": 1492383611.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgeden0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ONFIREIAM", "parent_id": "t1_dgd6jyl", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "You know you could send them to me and I can send a picture of me using it that you can put on your shelf", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know you could send them to me and I can send a picture of me using it that you can put on your shelf&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgeden0", "score_hidden": false, "stickied": false, "created": 1492503358.0, "created_utc": 1492474558.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd6jyl", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ndrynih", "parent_id": "t3_65ruad", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Two weeks ago i bought therion just to left it on dusty corner. And now this.\n\nMy wife gonna kill me if she knew that i've ordered Drone today.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Two weeks ago i bought therion just to left it on dusty corner. And now this.&lt;/p&gt;\n\n&lt;p&gt;My wife gonna kill me if she knew that i&amp;#39;ve ordered Drone today.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgd6jyl", "score_hidden": false, "stickied": false, "created": 1492437272.0, "created_utc": 1492408472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgcwf95", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Greybush_The_Rotund", "parent_id": "t1_dgcqbqa", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Same, the firing button on mine irks me. It's too close to flush, soggier than three day old fried chicken, and just doesn't have a satisfying click or resistance to it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same, the firing button on mine irks me. It&amp;#39;s too close to flush, soggier than three day old fried chicken, and just doesn&amp;#39;t have a satisfying click or resistance to it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgcwf95", "score_hidden": false, "stickied": false, "created": 1492421213.0, "created_utc": 1492392413.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgcsjnc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "suspiciouspackages", "parent_id": "t1_dgcqbqa", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "When it comes to regulated mods, I've had an iPV3, Reuleaux DNA, Triade, Halcyon, and this. There might be one I'm forgetting but whatever. The Reuleaux is the mushiest I would want the firing button to be. It has a springiness to it, but it still makes a nice click and doesn't require much force. The Drone just feels unfinished when it comes to the button. Cause really, the up/down buttons are great. The firing button is completely different.\n\n**Forgot the Lavabox DNA200. That's the mushiest I would take a button. I knew I forgot one.", "edited": 1492399322.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When it comes to regulated mods, I&amp;#39;ve had an iPV3, Reuleaux DNA, Triade, Halcyon, and this. There might be one I&amp;#39;m forgetting but whatever. The Reuleaux is the mushiest I would want the firing button to be. It has a springiness to it, but it still makes a nice click and doesn&amp;#39;t require much force. The Drone just feels unfinished when it comes to the button. Cause really, the up/down buttons are great. The firing button is completely different.&lt;/p&gt;\n\n&lt;p&gt;**Forgot the Lavabox DNA200. That&amp;#39;s the mushiest I would take a button. I knew I forgot one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgcsjnc", "score_hidden": false, "stickied": false, "created": 1492416070.0, "created_utc": 1492387270.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqbqa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FormidableFish", "parent_id": "t3_65ruad", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "I bought this as my first squonker and I'm impressed with everything but the battery door and firing button. The door doesn't seem to quite fit properly and is a little bit raised on the side where the bottle is. I know what you mean about the firing button. My finger slips occasionally and it's a totally different feeling to the Therion. Other than that, everything is great. \n\nGot it set up with a Nalu but waiting for my Hastur 1.5 and Aromamizer V-RDA to arrive. The Nalu is far too airy and loud. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I bought this as my first squonker and I&amp;#39;m impressed with everything but the battery door and firing button. The door doesn&amp;#39;t seem to quite fit properly and is a little bit raised on the side where the bottle is. I know what you mean about the firing button. My finger slips occasionally and it&amp;#39;s a totally different feeling to the Therion. Other than that, everything is great. &lt;/p&gt;\n\n&lt;p&gt;Got it set up with a Nalu but waiting for my Hastur 1.5 and Aromamizer V-RDA to arrive. The Nalu is far too airy and loud. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgcqbqa", "score_hidden": false, "stickied": false, "created": 1492413063.0, "created_utc": 1492384263.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgdn7nf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Voxbury", "parent_id": "t3_65ruad", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "I share some of your feelings about my Drone.  I was rather annoyed that it didn't include a spare bottle as the Therion BF did.\n\nAlso wasn't a fan of the aesthetic.  It's like they took the outside materials of the SKAR and threw them at a Triade shape, which leaves it feeling cheap for what it costs.  \n\nBottle placement could also have been a bit better.  The way you have to grab the mod to squeeze the bottle is slightly awkward since I can't squonk with my pinky finger.\n\nAll in all, not impressed with this one.  I love most all the Lost Vape products, but I feel like this one missed the mark.  If the classic Therion/Triade finishes were used with the leather and powder coats, I could have been alright with everything else, but this one is going to be sold immediately for me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I share some of your feelings about my Drone.  I was rather annoyed that it didn&amp;#39;t include a spare bottle as the Therion BF did.&lt;/p&gt;\n\n&lt;p&gt;Also wasn&amp;#39;t a fan of the aesthetic.  It&amp;#39;s like they took the outside materials of the SKAR and threw them at a Triade shape, which leaves it feeling cheap for what it costs.  &lt;/p&gt;\n\n&lt;p&gt;Bottle placement could also have been a bit better.  The way you have to grab the mod to squeeze the bottle is slightly awkward since I can&amp;#39;t squonk with my pinky finger.&lt;/p&gt;\n\n&lt;p&gt;All in all, not impressed with this one.  I love most all the Lost Vape products, but I feel like this one missed the mark.  If the classic Therion/Triade finishes were used with the leather and powder coats, I could have been alright with everything else, but this one is going to be sold immediately for me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgdn7nf", "score_hidden": false, "stickied": false, "created": 1492472641.0, "created_utc": 1492443841.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgdujpk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CryptoVaper", "parent_id": "t3_65ruad", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Just got mine on Friday.  Working good so far but I also noticed the firing button requires more force than the one on my Therion 166. Feels about the same in hand as my Reuleaux DNA 200, just 10mm taller.\n\nI just wish it had the same styling options as my Therion with its black frame and leather/snakeskin door options. Of course, they will probably release that in a month.\n\nAnd that 8\" USB cable is worthless at that length.  Also wish it included a spare bottle. But now I have plenty of battery life and fast charging so that's a big improvement over my Kanger Dripbox 2.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just got mine on Friday.  Working good so far but I also noticed the firing button requires more force than the one on my Therion 166. Feels about the same in hand as my Reuleaux DNA 200, just 10mm taller.&lt;/p&gt;\n\n&lt;p&gt;I just wish it had the same styling options as my Therion with its black frame and leather/snakeskin door options. Of course, they will probably release that in a month.&lt;/p&gt;\n\n&lt;p&gt;And that 8&amp;quot; USB cable is worthless at that length.  Also wish it included a spare bottle. But now I have plenty of battery life and fast charging so that&amp;#39;s a big improvement over my Kanger Dripbox 2.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgdujpk", "score_hidden": false, "stickied": false, "created": 1492480823.0, "created_utc": 1492452023.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgcvfog", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "suspiciouspackages", "parent_id": "t1_dgcv4q3", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Yeah it is low. I threw my batteries on the charger at 70% and there's still 4.0V according to my LUC V4.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it is low. I threw my batteries on the charger at 70% and there&amp;#39;s still 4.0V according to my LUC V4.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgcvfog", "score_hidden": false, "stickied": false, "created": 1492419958.0, "created_utc": 1492391158.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgdhm1o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sabledrakon", "parent_id": "t1_dgdha6f", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Shiiit. Sounds like you've got it worse man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shiiit. Sounds like you&amp;#39;ve got it worse man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgdhm1o", "score_hidden": false, "stickied": false, "created": 1492465354.0, "created_utc": 1492436554.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdha6f", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Wayne0", "parent_id": "t1_dgdh652", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "You lose your smarts. I turn into a pumpkin and my glass slippers disappear.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You lose your smarts. I turn into a pumpkin and my glass slippers disappear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgdha6f", "score_hidden": false, "stickied": false, "created": 1492464838.0, "created_utc": 1492436038.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdh652", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sabledrakon", "parent_id": "t1_dgd4bdd", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Well that'll teach me not to try and be smart after midmight. Thanks for the save.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well that&amp;#39;ll teach me not to try and be smart after midmight. Thanks for the save.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgdh652", "score_hidden": false, "stickied": false, "created": 1492464657.0, "created_utc": 1492435857.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4bdd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wayne0", "parent_id": "t1_dgd2gbe", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "&gt; ..... The values are 1500, 2, 7.4v.\n\nVTC6s are **3000 mAh each** not 1500", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;..... The values are 1500, 2, 7.4v.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;VTC6s are &lt;strong&gt;3000 mAh each&lt;/strong&gt; not 1500&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgd4bdd", "score_hidden": false, "stickied": false, "created": 1492432834.0, "created_utc": 1492404034.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgd3wzm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Wayne0", "parent_id": "t1_dgd2gbe", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "/u/sabledrakon  Not for a pair (2) of them as the print screen shows.\n\nAt best, depending on his mod and csc chosen, they should be just under 10Wh's each.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/sabledrakon\"&gt;/u/sabledrakon&lt;/a&gt;  Not for a pair (2) of them as the print screen shows.&lt;/p&gt;\n\n&lt;p&gt;At best, depending on his mod and csc chosen, they should be just under 10Wh&amp;#39;s each.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgd3wzm", "score_hidden": false, "stickied": false, "created": 1492432127.0, "created_utc": 1492403327.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2gbe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sabledrakon", "parent_id": "t1_dgcv4q3", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Actually, 13.2Wh is high for VTC6s. Those should be 11.1Wh. The values are 1500, 2, 7.4v.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, 13.2Wh is high for VTC6s. Those should be 11.1Wh. The values are 1500, 2, 7.4v.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgd2gbe", "score_hidden": false, "stickied": false, "created": 1492429724.0, "created_utc": 1492400924.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcv4q3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Wayne0", "parent_id": "t1_dgcund1", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Looks great. They've been known to send many out with just evolv defaults. The Wh's look pretty low for VTC6's, and although you can just load up someone elses curve and Wh's, you really should run your own on your mod (½ hour with full batteries).\n\nEnjoy your mod.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Looks great. They&amp;#39;ve been known to send many out with just evolv defaults. The Wh&amp;#39;s look pretty low for VTC6&amp;#39;s, and although you can just load up someone elses curve and Wh&amp;#39;s, you really should run your own on your mod (½ hour with full batteries).&lt;/p&gt;\n\n&lt;p&gt;Enjoy your mod.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgcv4q3", "score_hidden": false, "stickied": false, "created": 1492419561.0, "created_utc": 1492390761.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65ruad", "likes": null, "replies": "", "user_reports": [], "id": "dgd2am8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sabledrakon", "parent_id": "t1_dgcund1", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Looks great. Seems LV finally got their finger out of their ass with actually getting shit set up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Looks great. Seems LV finally got their finger out of their ass with actually getting shit set up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgd2am8", "score_hidden": false, "stickied": false, "created": 1492429477.0, "created_utc": 1492400677.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcund1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "suspiciouspackages", "parent_id": "t1_dgcsqph", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Looks good to me. I didn't touch anything on here so yeah.\n\n[Pic](http://imgur.com/a/TPPPp)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Looks good to me. I didn&amp;#39;t touch anything on here so yeah.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://imgur.com/a/TPPPp\"&gt;Pic&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgcund1", "score_hidden": false, "stickied": false, "created": 1492418914.0, "created_utc": 1492390114.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dgcsqph", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Wayne0", "parent_id": "t3_65ruad", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "&gt; I don't know if Lost Vape set up the board with the right case settings, but I'm trusting that they did.\n\nTrust, but verify. If your mod resistance is blank/zero ... nope, but 5 minute job.\n\nIf under Thermal, the first 2 values are 150 150 ... nope, about 3 hours to run.\n\nCheck and let us know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t know if Lost Vape set up the board with the right case settings, but I&amp;#39;m trusting that they did.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Trust, but verify. If your mod resistance is blank/zero ... nope, but 5 minute job.&lt;/p&gt;\n\n&lt;p&gt;If under Thermal, the first 2 values are 150 150 ... nope, about 3 hours to run.&lt;/p&gt;\n\n&lt;p&gt;Check and let us know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgcsqph", "score_hidden": false, "stickied": false, "created": 1492416342.0, "created_utc": 1492387542.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]