[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "electronic_cigarette", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been using this as my only atty since I got it, so roughly 2 weeks now. These are my experiences only and YMMV.  This might not be great but I wanted to put something out there for those who might be interested. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Machining: 10/10&lt;/strong&gt; \nThe machining on this thing is absolutely spectacular. It is probably one of the cleanest tanks that I have ever used. Absolutely no rough spots anywhere, the engraving is clean and smooth to the touch. Beautifully done. Every bit of threading is butter smooth and requires minimal effort to remove or tighten anything. Also, this can be used directly out of the box if you wish, there is NO machine oil ANYWHERE. This has been deep cleaned prior to packaging and shipping. No smell of anything but instead you gave a perfectly clean ready to use tank. I still have this a rinse out with some hot water prior to use but no need to do an ultrasonic cleaning or soapy water unless you want to.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Design: 8/10&lt;/strong&gt;\nI love the little things that they have changed about this with the coil system being the most noticeable. The Innokin iSub series coils used a plug and play system that this Crown has adapted and made their own. There is no need to screw anything in and it is even possible to change the coil with a completely full tank of juice with minimal mess. You will still get juice on your fingers but its not a big thing, just have a towel nearby. This tank does still leak, not much but there is still a leaking problem that they say can be remedied by cleaning the condensation catcher out regularly. This is not really the case. Top fill system is great, the juice holes are a little smaller than I would like but fits &lt;em&gt;MOST&lt;/em&gt; droppers with no problem but some of you who use glass droppers might have some issues. I really wish that this would have been top airflow but every tank is going to have a bit of a downside, this is one of them for me. I love the driptips that they are including with each tank as well as the standard 510 drip tip and cover. The cover is silicone so YAY no latex allergy worries for us :D This tank is also incredibly easy to dismantle and replace the glass/clean. Just dont lose the key that is needed to lock it back together. Minimum juice level line is a great way to ensure you dont get a dry hit, abide by this and you wont have any problems.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Coils:Overall 9/10&lt;/strong&gt;\nBoth the .25 and .5 coils wick like a dream, there is no real break in period and even the slight break in period does not have the horrible cotton taste that you had with the Crown 1 coils. This is a very good coil design and the cotton is amazing, I honestly want whatever they are using as a loose cotton for my RTAs. These are a completely different coil design and structure, so none of the previous coils will be compatible and at this time I am unsure as to whether there is anything on the market that will be compatible for this tank. These coils could easily handle an 80VG mix, but not sure how much more than that they would be able to wick. This wicks my 70VG+ mixes with not even a second thought, it acts like its dying of thirst LOL.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;0.25 coils&lt;/em&gt;-- Calling all you custard, creams and bakery lovers! This is the coil for you! This coil does great at higher wattages, I had even taken this coil up farther than the recommended wattages and it was still performing like a champ! Flavour and production are great. BUT, this coil will kill citrus flavours, which is unfortunate as this is my preferred profile. The high wattages needed and the coil itself just doesn&amp;#39;t work well for the citrus vapers out there.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;0.50 coils&lt;/em&gt;-- This one is for you vapers that are primarily citrus based profiles! The flavour is fantastic, Im running this at between 72-76W and the flavour from these are fan-freakin-tastic! They recommend 70-80W but they can go higher if you desire, but I found that the 72-76W range is perfect for me. Flavour and production is great on the .5 coils!\nNo RBA for this as of yet, but they may release one later down the road.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Packaging:&lt;/strong&gt; Only comes with 2 coils this time but thats ok :D Comes with 1 of each ohm coil, along with locking key, drip tip cover, spare glass, TONS of spare o-rings, user manual and warranty card. The thing that I found interesting is that Uwell are now including their authenticity code INSIDE the packaging, this helps to ensure that people dont just pick up a code from somewhere and throw it on clone packaging. There is also a ripcord style tape around the outside of the clam-shell, making it so much easier to open than the previous versions.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Overall rating: 9/10&lt;/strong&gt;\nThis is a damn good stock coil tank! Beats every other stock coil tank I have used including the Crown 1. Definitely worth picking up. Juice consumption isn&amp;#39;t as bad as I was expecting, I go through more juice in my Sapor 25 rta than with this thing, so its doing something right :D My .5 coil I have been using over a week now and seems to be showing no signs of slowing down at all. Should be able to get a minimum of 2 weeks per coils but this will also depend on the amount of sweeteners you use or if you are big into the coil killing juices.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have been using this as my only atty since I got it, so roughly 2 weeks now. These are my experiences only and YMMV.  This might not be great but I wanted to put something out there for those who might be interested. \n\n**Machining: 10/10** \nThe machining on this thing is absolutely spectacular. It is probably one of the cleanest tanks that I have ever used. Absolutely no rough spots anywhere, the engraving is clean and smooth to the touch. Beautifully done. Every bit of threading is butter smooth and requires minimal effort to remove or tighten anything. Also, this can be used directly out of the box if you wish, there is NO machine oil ANYWHERE. This has been deep cleaned prior to packaging and shipping. No smell of anything but instead you gave a perfectly clean ready to use tank. I still have this a rinse out with some hot water prior to use but no need to do an ultrasonic cleaning or soapy water unless you want to.\n\n\n**Design: 8/10**\nI love the little things that they have changed about this with the coil system being the most noticeable. The Innokin iSub series coils used a plug and play system that this Crown has adapted and made their own. There is no need to screw anything in and it is even possible to change the coil with a completely full tank of juice with minimal mess. You will still get juice on your fingers but its not a big thing, just have a towel nearby. This tank does still leak, not much but there is still a leaking problem that they say can be remedied by cleaning the condensation catcher out regularly. This is not really the case. Top fill system is great, the juice holes are a little smaller than I would like but fits *MOST* droppers with no problem but some of you who use glass droppers might have some issues. I really wish that this would have been top airflow but every tank is going to have a bit of a downside, this is one of them for me. I love the driptips that they are including with each tank as well as the standard 510 drip tip and cover. The cover is silicone so YAY no latex allergy worries for us :D This tank is also incredibly easy to dismantle and replace the glass/clean. Just dont lose the key that is needed to lock it back together. Minimum juice level line is a great way to ensure you dont get a dry hit, abide by this and you wont have any problems.\n\n\n**Coils:Overall 9/10**\nBoth the .25 and .5 coils wick like a dream, there is no real break in period and even the slight break in period does not have the horrible cotton taste that you had with the Crown 1 coils. This is a very good coil design and the cotton is amazing, I honestly want whatever they are using as a loose cotton for my RTAs. These are a completely different coil design and structure, so none of the previous coils will be compatible and at this time I am unsure as to whether there is anything on the market that will be compatible for this tank. These coils could easily handle an 80VG mix, but not sure how much more than that they would be able to wick. This wicks my 70VG+ mixes with not even a second thought, it acts like its dying of thirst LOL.\n\n\n*0.25 coils*-- Calling all you custard, creams and bakery lovers! This is the coil for you! This coil does great at higher wattages, I had even taken this coil up farther than the recommended wattages and it was still performing like a champ! Flavour and production are great. BUT, this coil will kill citrus flavours, which is unfortunate as this is my preferred profile. The high wattages needed and the coil itself just doesn't work well for the citrus vapers out there.\n\n\n*0.50 coils*-- This one is for you vapers that are primarily citrus based profiles! The flavour is fantastic, Im running this at between 72-76W and the flavour from these are fan-freakin-tastic! They recommend 70-80W but they can go higher if you desire, but I found that the 72-76W range is perfect for me. Flavour and production is great on the .5 coils!\nNo RBA for this as of yet, but they may release one later down the road.\n\n\n**Packaging:** Only comes with 2 coils this time but thats ok :D Comes with 1 of each ohm coil, along with locking key, drip tip cover, spare glass, TONS of spare o-rings, user manual and warranty card. The thing that I found interesting is that Uwell are now including their authenticity code INSIDE the packaging, this helps to ensure that people dont just pick up a code from somewhere and throw it on clone packaging. There is also a ripcord style tape around the outside of the clam-shell, making it so much easier to open than the previous versions.\n\n\n**Overall rating: 9/10**\nThis is a damn good stock coil tank! Beats every other stock coil tank I have used including the Crown 1. Definitely worth picking up. Juice consumption isn't as bad as I was expecting, I go through more juice in my Sapor 25 rta than with this thing, so its doing something right :D My .5 coil I have been using over a week now and seems to be showing no signs of slowing down at all. Should be able to get a minimum of 2 weeks per coils but this will also depend on the amount of sweeteners you use or if you are big into the coil killing juices.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": "Review", "id": "65xpto", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 34, "report_reasons": null, "author": "aclapp1626", "saved": false, "mod_reports": [], "name": "t3_65xpto", "subreddit_name_prefixed": "r/electronic_cigarette", "approved_by": null, "over_18": false, "domain": "self.electronic_cigarette", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qmlu", "edited": 1492457462.0, "link_flair_css_class": "review", "author_flair_css_class": null, "downs": 0, "brand_safe": false, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/electronic_cigarette/comments/65xpto/crown_iii_review_thing_d/", "num_reports": null, "locked": false, "stickied": false, "created": 1492485778.0, "url": "https://www.reddit.com/r/electronic_cigarette/comments/65xpto/crown_iii_review_thing_d/", "author_flair_text": null, "quarantine": false, "title": "Crown III Review Thing :D", "created_utc": 1492456978.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 16, "visited": false, "subreddit_type": "public", "ups": 34}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": "", "user_reports": [], "id": "dgdzwh8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HellsKitchenVaper", "parent_id": "t1_dgdzodh", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Yep! I'm liking it so far, but I'm still not going to recommend it until the production line gets released because I have a feeling some companies send out good samples but lackluster production batches (\\*coughcoughWismeccoughcough*).\n\nBUT for people who are looking into the Crown 2, I've been telling them to just wait for the Crown 3 if they want something in the Crown line. Fuck the Crown 2 and the headache it's given everyone.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep! I&amp;#39;m liking it so far, but I&amp;#39;m still not going to recommend it until the production line gets released because I have a feeling some companies send out good samples but lackluster production batches (*coughcoughWismeccoughcough*).&lt;/p&gt;\n\n&lt;p&gt;BUT for people who are looking into the Crown 2, I&amp;#39;ve been telling them to just wait for the Crown 3 if they want something in the Crown line. Fuck the Crown 2 and the headache it&amp;#39;s given everyone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgdzwh8", "score_hidden": false, "stickied": false, "created": 1492486874.0, "created_utc": 1492458074.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzodh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aclapp1626", "parent_id": "t1_dgdzh1q", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Thanks for the added bits! Yeah the leaking isnt a huge issue but does still happen, so I wanted to mention that since some people are claiming there is no leaking at all :D  I dont normally do these kind of things but wanted to share my experience in the off chance anyone cared to know LOL.  So far I will say Im impressed by this thing, the coils are beasts and its a very well made tank :D  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the added bits! Yeah the leaking isnt a huge issue but does still happen, so I wanted to mention that since some people are claiming there is no leaking at all :D  I dont normally do these kind of things but wanted to share my experience in the off chance anyone cared to know LOL.  So far I will say Im impressed by this thing, the coils are beasts and its a very well made tank :D  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgdzodh", "score_hidden": false, "stickied": false, "created": 1492486622.0, "created_utc": 1492457822.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgdzh1q", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "HellsKitchenVaper", "parent_id": "t3_65xpto", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "To add some more info/tips to your review:\n\n&gt; This tank does still leak, not much but there is still a leaking problem that they say can be remedied by cleaning the condensation catcher out regularly\n\nThe leaking, from what I can tell, occurs during the refilling process due to the whole vacuum science. It'll usually just be a few drops in the base, but it's usually not a problem for a good 10ish refills. Even then, it's super simply to turn the tank upside down, unscrew the base, and dab up any juice with a napkin. I mix menthol with most of my juices, so when I shake the tank, I wrap a tissue around the airflow holes just in case of any juice stuck in the base.\n\nI used to recommend vaping at around half the wattage rating to prevent leaks, but I find the Crown 3 coils are pretty accurate with the rating, so hit the max 80/90W and you'll be gucci.\n\n&gt; Just dont lose the key that is needed to lock it back together.\n\nI lost mine on day 1. But not to fear! Almost anything that fits in the chimney area will work. I've used the back of tweezers, my car keys, a paper clip, and a knife.\n\n&gt; Only comes with 2 coils this time but thats ok\n\nSince there was no huge leaking, dry hits, or resistance reading issues, my main focus was to see how long each coil would run to. I swapped out the 0.25 for the 0.5 to start and that little sucker ran to around 5,300 puffs before it started giving me an off taste every few hits. I've reset the puff counter properly for the 0.25 coil and it's at 566 puffs with no problems so far.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add some more info/tips to your review:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;This tank does still leak, not much but there is still a leaking problem that they say can be remedied by cleaning the condensation catcher out regularly&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The leaking, from what I can tell, occurs during the refilling process due to the whole vacuum science. It&amp;#39;ll usually just be a few drops in the base, but it&amp;#39;s usually not a problem for a good 10ish refills. Even then, it&amp;#39;s super simply to turn the tank upside down, unscrew the base, and dab up any juice with a napkin. I mix menthol with most of my juices, so when I shake the tank, I wrap a tissue around the airflow holes just in case of any juice stuck in the base.&lt;/p&gt;\n\n&lt;p&gt;I used to recommend vaping at around half the wattage rating to prevent leaks, but I find the Crown 3 coils are pretty accurate with the rating, so hit the max 80/90W and you&amp;#39;ll be gucci.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Just dont lose the key that is needed to lock it back together.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I lost mine on day 1. But not to fear! Almost anything that fits in the chimney area will work. I&amp;#39;ve used the back of tweezers, my car keys, a paper clip, and a knife.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Only comes with 2 coils this time but thats ok&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Since there was no huge leaking, dry hits, or resistance reading issues, my main focus was to see how long each coil would run to. I swapped out the 0.25 for the 0.5 to start and that little sucker ran to around 5,300 puffs before it started giving me an off taste every few hits. I&amp;#39;ve reset the puff counter properly for the 0.25 coil and it&amp;#39;s at 566 puffs with no problems so far.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dgdzh1q", "score_hidden": false, "stickied": false, "created": 1492486392.0, "created_utc": 1492457592.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": "", "user_reports": [], "id": "dge09jm", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "musicman3030", "parent_id": "t3_65xpto", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Really great review. I want one but am waiting on RBA news. About the tool thingy, the ass end of tweezers works great to get that lock piece out on crown2s. I heard the c3 tool is also designed to fit in the airflow control to get over tightened bases off, which sounds way more useful to me especially if it fits in other tanks AFC's.", "edited": 1492460040.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really great review. I want one but am waiting on RBA news. About the tool thingy, the ass end of tweezers works great to get that lock piece out on crown2s. I heard the c3 tool is also designed to fit in the airflow control to get over tightened bases off, which sounds way more useful to me especially if it fits in other tanks AFC&amp;#39;s.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge09jm", "score_hidden": false, "stickied": false, "created": 1492487280.0, "created_utc": 1492458480.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": "", "user_reports": [], "id": "dge6dny", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kappakai", "parent_id": "t3_65xpto", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Maybe this one will really be just right. The v1 sold well because it was a decent tank at a great price for the time. The v2 was good when it worked right, but those first batches of coils and revisions were hit or miss. I think they recovered with the SE-1 but they still used the badly maligned v2 coils, even though the V2 coils had been fixed by that time. The v3, we've been testing for a few weeks now, and they've been good. Again nothing spectacular, to me anyway - and that could definitely be a function of the juice - but a solid tank for the price. No leaking issues so far, no dry hits, nothing like that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe this one will really be just right. The v1 sold well because it was a decent tank at a great price for the time. The v2 was good when it worked right, but those first batches of coils and revisions were hit or miss. I think they recovered with the SE-1 but they still used the badly maligned v2 coils, even though the V2 coils had been fixed by that time. The v3, we&amp;#39;ve been testing for a few weeks now, and they&amp;#39;ve been good. Again nothing spectacular, to me anyway - and that could definitely be a function of the juice - but a solid tank for the price. No leaking issues so far, no dry hits, nothing like that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge6dny", "score_hidden": false, "stickied": false, "created": 1492494314.0, "created_utc": 1492465514.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": "", "user_reports": [], "id": "dge7gqg", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lasgar", "parent_id": "t3_65xpto", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "I appreciate the review. I don't really use prebuilt coil tanks anymore but plenty of my friends still do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I appreciate the review. I don&amp;#39;t really use prebuilt coil tanks anymore but plenty of my friends still do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge7gqg", "score_hidden": false, "stickied": false, "created": 1492495667.0, "created_utc": 1492466867.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": "", "user_reports": [], "id": "dge54pe", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aclapp1626", "parent_id": "t1_dge37eu", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "I was skeptical myself tbh.  I am not a reviewer by any means and I actually got this from a giveaway, the 2 years of free stuff from them.  So I kind of went into this with an open mind and surprised myself.  I tried...TRIED...to find things I didnt like about it, trying to break it so to speak and wish I could have said that this was a crap tank or whatever.  I didnt have the crown 2 because of so many bad reports.  I never buy anything for the first month or two its out because I like to see other peoples experiences. But this surpasses all the other stock coil tanks I have used and owned.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was skeptical myself tbh.  I am not a reviewer by any means and I actually got this from a giveaway, the 2 years of free stuff from them.  So I kind of went into this with an open mind and surprised myself.  I tried...TRIED...to find things I didnt like about it, trying to break it so to speak and wish I could have said that this was a crap tank or whatever.  I didnt have the crown 2 because of so many bad reports.  I never buy anything for the first month or two its out because I like to see other peoples experiences. But this surpasses all the other stock coil tanks I have used and owned.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge54pe", "score_hidden": false, "stickied": false, "created": 1492492791.0, "created_utc": 1492463991.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge37eu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WaltonGogginsTeeth", "parent_id": "t3_65xpto", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "After my nightmare experience with the Crown 2 I was going to boycott this.  However, every good review I read makes me want it more now.  Gonna have to pick this up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;After my nightmare experience with the Crown 2 I was going to boycott this.  However, every good review I read makes me want it more now.  Gonna have to pick this up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge37eu", "score_hidden": false, "stickied": false, "created": 1492490571.0, "created_utc": 1492461771.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": "", "user_reports": [], "id": "dge4j26", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Moobyghost", "parent_id": "t1_dge4i6q", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Awesome!! Thanks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Awesome!! Thanks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge4j26", "score_hidden": false, "stickied": false, "created": 1492492070.0, "created_utc": 1492463270.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge4i6q", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zestypotatoes", "parent_id": "t1_dge3hff", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "You can order directly from Uwell and they ship from California. Otherwise, they shipped out from China last Monday, so they should be hitting online any day now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can order directly from Uwell and they ship from California. Otherwise, they shipped out from China last Monday, so they should be hitting online any day now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge4i6q", "score_hidden": false, "stickied": false, "created": 1492492042.0, "created_utc": 1492463242.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dge3hff", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Moobyghost", "parent_id": "t3_65xpto", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Does anyone know where you can find one of these in stock? I can not find them anywhere. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does anyone know where you can find one of these in stock? I can not find them anywhere. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge3hff", "score_hidden": false, "stickied": false, "created": 1492490882.0, "created_utc": 1492462082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": "", "user_reports": [], "id": "dge3e9b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WaltonGogginsTeeth", "parent_id": "t1_dge17j5", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "My Crown 1 had leaking issues with the .25 coils.  But just this weekend i found the .5 factory coil that came with it and installed it and it's been pretty good.  Lots of flavor and vapor.  But those factory coils always seem to be good.  I want to hear how the replacement Crown 3 coils work before I pull the trigger. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My Crown 1 had leaking issues with the .25 coils.  But just this weekend i found the .5 factory coil that came with it and installed it and it&amp;#39;s been pretty good.  Lots of flavor and vapor.  But those factory coils always seem to be good.  I want to hear how the replacement Crown 3 coils work before I pull the trigger. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge3e9b", "score_hidden": false, "stickied": false, "created": 1492490784.0, "created_utc": 1492461984.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qmlu", "removal_reason": null, "link_id": "t3_65xpto", "likes": null, "replies": "", "user_reports": [], "id": "dge6kbg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aclapp1626", "parent_id": "t1_dge6hg5", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Yeah I actually sold my V1 to a guy who wanted it.  I dont like having a lot of stuff that I dont use anymore so I tend to sell or trade them :D I hope the guy is enjoying it :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah I actually sold my V1 to a guy who wanted it.  I dont like having a lot of stuff that I dont use anymore so I tend to sell or trade them :D I hope the guy is enjoying it :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge6kbg", "score_hidden": false, "stickied": false, "created": 1492494543.0, "created_utc": 1492465743.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge6hg5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ctrlaltcreate", "parent_id": "t1_dge5djx", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "I'm still using a crown 1, and the most recent batch of coils have been solid. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m still using a crown 1, and the most recent batch of coils have been solid. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge6hg5", "score_hidden": false, "stickied": false, "created": 1492494445.0, "created_utc": 1492465645.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge5djx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "aclapp1626", "parent_id": "t1_dge17j5", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "The first batch of coils I got for the Crown 1 were great! Awesome flavour and good production.  Unfortunately things went downhill quickly with the coils.  I purchased coils from retailers online and directly from Uwells site, they were all horrible.  I was pissed off and ended up just buying RTAs instead that way if something is wrong with the coil or Im not happy with it I can easily fix my problem.  This tank however, I am impressed, its why I wanted to post something about it.  I didnt receive this for review purposes, I didnt even have to do a review on it because it was just a giveaway thing but it has impressed me enough for me want to share with others.  I dont blame you for wanting to wait or not buy another one, but just keep an eye out because Im sure there are going to be a ton more people talking about this as they are purchased :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The first batch of coils I got for the Crown 1 were great! Awesome flavour and good production.  Unfortunately things went downhill quickly with the coils.  I purchased coils from retailers online and directly from Uwells site, they were all horrible.  I was pissed off and ended up just buying RTAs instead that way if something is wrong with the coil or Im not happy with it I can easily fix my problem.  This tank however, I am impressed, its why I wanted to post something about it.  I didnt receive this for review purposes, I didnt even have to do a review on it because it was just a giveaway thing but it has impressed me enough for me want to share with others.  I dont blame you for wanting to wait or not buy another one, but just keep an eye out because Im sure there are going to be a ton more people talking about this as they are purchased :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge5djx", "score_hidden": false, "stickied": false, "created": 1492493090.0, "created_utc": 1492464290.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dge17j5", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "KillerAI", "parent_id": "t3_65xpto", "subreddit_name_prefixed": "r/electronic_cigarette", "controversiality": 0, "body": "Man, to me the Crown 1 sucked ass. \n\nDidn't buy the Crown 2, but while YouTube Advertisers (''reviewers'') said it was the best new thing on release, it ended up being a total fiasco. \n\nI might be skeptic, but I doubt I would buy any other Uwell product, unless it has the hype the Smok Alien had a few months back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Man, to me the Crown 1 sucked ass. &lt;/p&gt;\n\n&lt;p&gt;Didn&amp;#39;t buy the Crown 2, but while YouTube Advertisers (&amp;#39;&amp;#39;reviewers&amp;#39;&amp;#39;) said it was the best new thing on release, it ended up being a total fiasco. &lt;/p&gt;\n\n&lt;p&gt;I might be skeptic, but I doubt I would buy any other Uwell product, unless it has the hype the Smok Alien had a few months back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "electronic_cigarette", "name": "t1_dge17j5", "score_hidden": false, "stickied": false, "created": 1492488343.0, "created_utc": 1492459543.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]