[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Meditation", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;ve been meditating for one hour a day for the past month or so and it&amp;#39;s been very enlightening. I use Headspace&amp;#39;s 1 hour guided meditation audio (after completing the foundation series and the focus series on and off over several months last year). &lt;/p&gt;\n\n&lt;p&gt;INSIGHTS&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I have a clearer sense of self and have increased awareness of what is important in life. I keep having all of these epiphanies and have realised that in the last few years I was under considerable mental stress/tension which prevented me from seeing things clearly. It&amp;#39;s great to be able to look at myself and my life clearly. It helps with goal prioritisation, my level of self-awareness and my overall happiness.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It has increased my empathy. I am not the most empathetic person to be honest - I think I&amp;#39;m just wired differently and prefer reason &amp;amp; rationality (which can sometimes get me in trouble) to compassion &amp;amp; humility. I remember being in the bakery and being served by an old lady who was not that polite - ordinarily it would annoy me, but I now appreciate she is probably having a bad day and I am in acceptance of her and of the situation.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Similarly, I am less reactive more generally. I think my default state, before meditation, is to react to things easily. I would get annoyed or angry at little things, have microexpressions which were actually obvious, then try to hide it. When I was younger I was more charming and chatty (I think because I was naturally more mindful or at least I did not overthink things to the point of oblivion) and I&amp;#39;m finding I&amp;#39;m reverting back to this mode which is amazing. In fact this is one of the biggest benefits for me personally as I don&amp;#39;t want to be bad company.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Less attachment and greater acceptance of what life gives me. This is an interesting point - I think I&amp;#39;m becoming less ambitious (which maybe a good thing because I&amp;#39;m crazy ambitious) but it&amp;#39;s not what I initially hoped for in meditation. I don&amp;#39;t know how to exactly balance this - I think I will keep meditating and tone it down if I start to lose the zest for life? Maybe I just see things clearer though and am not so hungry or desiring of things which were merely quick fixes or superficial solutions. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;QUESTIONS&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I focus on the breath and count (one on rising sensation, two on the falling sensation, up to ten, then start again) but I feel like counting is a form of thinking so perhaps it is better to stop? I tried just focusing on each breath as it passes but I don&amp;#39;t think I was able to reach a deep meditative state and I got more distracted by other thoughts. Do I just need more practice? Is one better than the other? &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In between exhaling/inhaling and getting to the next breath, there is a slight pause. I find that this is often when a thought will pop up into my mind. What I do is I specifically &amp;quot;blank out&amp;quot; my mind (for lack of a better term) and then focus on the counting again. I read on this subreddit that you shouldn&amp;#39;t actively try to &amp;quot;blank out&amp;quot; your mind, but when I tried not doing that my mind just went crazy again. It&amp;#39;s not like I&amp;#39;m actively trying to shut my brain down, it&amp;#39;s more I&amp;#39;m making a pause and being committed to not making a thought or letting my mind wander. Is this OK?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The other thing I do, which feels like it helps me reach a deeper meditative state, is to &amp;quot;lean into the emptiness&amp;quot; within me. I am not sure how better to describe it than that. Basically, I feel like inside me there is a lot of empty space, and I just &amp;quot;jump right in&amp;quot; and feel it. After doing this, I sometimes get some positive feelings and endorphins.  Does that make sense and am I doing it right?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So I've been meditating for one hour a day for the past month or so and it's been very enlightening. I use Headspace's 1 hour guided meditation audio (after completing the foundation series and the focus series on and off over several months last year). \n\nINSIGHTS\n\n1. I have a clearer sense of self and have increased awareness of what is important in life. I keep having all of these epiphanies and have realised that in the last few years I was under considerable mental stress/tension which prevented me from seeing things clearly. It's great to be able to look at myself and my life clearly. It helps with goal prioritisation, my level of self-awareness and my overall happiness.\n\n2. It has increased my empathy. I am not the most empathetic person to be honest - I think I'm just wired differently and prefer reason &amp; rationality (which can sometimes get me in trouble) to compassion &amp; humility. I remember being in the bakery and being served by an old lady who was not that polite - ordinarily it would annoy me, but I now appreciate she is probably having a bad day and I am in acceptance of her and of the situation.\n\n3. Similarly, I am less reactive more generally. I think my default state, before meditation, is to react to things easily. I would get annoyed or angry at little things, have microexpressions which were actually obvious, then try to hide it. When I was younger I was more charming and chatty (I think because I was naturally more mindful or at least I did not overthink things to the point of oblivion) and I'm finding I'm reverting back to this mode which is amazing. In fact this is one of the biggest benefits for me personally as I don't want to be bad company.\n\n4. Less attachment and greater acceptance of what life gives me. This is an interesting point - I think I'm becoming less ambitious (which maybe a good thing because I'm crazy ambitious) but it's not what I initially hoped for in meditation. I don't know how to exactly balance this - I think I will keep meditating and tone it down if I start to lose the zest for life? Maybe I just see things clearer though and am not so hungry or desiring of things which were merely quick fixes or superficial solutions. \n\n\nQUESTIONS\n\n1. I focus on the breath and count (one on rising sensation, two on the falling sensation, up to ten, then start again) but I feel like counting is a form of thinking so perhaps it is better to stop? I tried just focusing on each breath as it passes but I don't think I was able to reach a deep meditative state and I got more distracted by other thoughts. Do I just need more practice? Is one better than the other? \n\n2. In between exhaling/inhaling and getting to the next breath, there is a slight pause. I find that this is often when a thought will pop up into my mind. What I do is I specifically \"blank out\" my mind (for lack of a better term) and then focus on the counting again. I read on this subreddit that you shouldn't actively try to \"blank out\" your mind, but when I tried not doing that my mind just went crazy again. It's not like I'm actively trying to shut my brain down, it's more I'm making a pause and being committed to not making a thought or letting my mind wander. Is this OK?\n\n3. The other thing I do, which feels like it helps me reach a deeper meditative state, is to \"lean into the emptiness\" within me. I am not sure how better to describe it than that. Basically, I feel like inside me there is a lot of empty space, and I just \"jump right in\" and feel it. After doing this, I sometimes get some positive feelings and endorphins.  Does that make sense and am I doing it right?", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64qgrx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 61, "report_reasons": null, "author": "invntr", "saved": false, "mod_reports": [], "name": "t3_64qgrx", "subreddit_name_prefixed": "r/Meditation", "approved_by": null, "over_18": false, "domain": "self.Meditation", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qnc9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Meditation/comments/64qgrx/after_a_month_of_daily_1hour_meditation_sessions/", "num_reports": null, "locked": false, "stickied": false, "created": 1491941983.0, "url": "https://www.reddit.com/r/Meditation/comments/64qgrx/after_a_month_of_daily_1hour_meditation_sessions/", "author_flair_text": null, "quarantine": false, "title": "After a month of daily 1-hour meditation sessions", "created_utc": 1491913183.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 11, "visited": false, "subreddit_type": "public", "ups": 61}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": "", "user_reports": [], "id": "dg4lffc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "buddhaghosa_the_wise", "parent_id": "t1_dg4iozf", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Most modern meditation teachers suggest phasing out the counting earlier than later, or not starting it at all. Keep in mind this book was probably written for monks who don't have the worldly distractions that we do. If you wait until you have no thoughts you'll be waiting forever. It is up to you but just keep in mind you are adding an artificial component to the breath, and it sounds to me like you could start training yourself off it right now. I never did the counting at all, and though I am still interrupted by thoughts at times, their sway has decreased substantially over time. \n\nWhether you pause or not doesn't really matter, just try to keep the breath natural and maintain focus on whatever point you have chosen to perceive breath. The important point is not to blank out - so just maintain focus on your breath spot. It is ok if thoughts come, just try your best not to follow them, and when you do let them go knowingly and return to breath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most modern meditation teachers suggest phasing out the counting earlier than later, or not starting it at all. Keep in mind this book was probably written for monks who don&amp;#39;t have the worldly distractions that we do. If you wait until you have no thoughts you&amp;#39;ll be waiting forever. It is up to you but just keep in mind you are adding an artificial component to the breath, and it sounds to me like you could start training yourself off it right now. I never did the counting at all, and though I am still interrupted by thoughts at times, their sway has decreased substantially over time. &lt;/p&gt;\n\n&lt;p&gt;Whether you pause or not doesn&amp;#39;t really matter, just try to keep the breath natural and maintain focus on whatever point you have chosen to perceive breath. The important point is not to blank out - so just maintain focus on your breath spot. It is ok if thoughts come, just try your best not to follow them, and when you do let them go knowingly and return to breath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4lffc", "score_hidden": false, "stickied": false, "created": 1491960574.0, "created_utc": 1491931774.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iozf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "invntr", "parent_id": "t1_dg4ckit", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Thank you so much for your comment!\n\nSo the book mentions to progress from counting when you no longer get distracted and can hold the focus on counting without being interrupted by thoughts. I think I am a while away from this stage still.\n\nAlso I do actually have a pause in between breaths. Maybe it's not something I do naturally but when I'm focused on my breathing I go like this: breathe in.. (2-3 second pause)... breathe out...\n\nShould I try breathing without interruption?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much for your comment!&lt;/p&gt;\n\n&lt;p&gt;So the book mentions to progress from counting when you no longer get distracted and can hold the focus on counting without being interrupted by thoughts. I think I am a while away from this stage still.&lt;/p&gt;\n\n&lt;p&gt;Also I do actually have a pause in between breaths. Maybe it&amp;#39;s not something I do naturally but when I&amp;#39;m focused on my breathing I go like this: breathe in.. (2-3 second pause)... breathe out...&lt;/p&gt;\n\n&lt;p&gt;Should I try breathing without interruption?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4iozf", "score_hidden": false, "stickied": false, "created": 1491957594.0, "created_utc": 1491928794.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ckit", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "buddhaghosa_the_wise", "parent_id": "t3_64qgrx", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Good job sticking to a schedule and getting a daily practice down.\n\nFor your questions:\n\n**Question 1** You should stop counting eventually, the sooner the better IMO. One issue is that you can end up becoming more absorbed in the counting than the breath, and suddenly you can find yourself counting and not paying attention to the breath at all! It is a useful crutch for some when starting, but eventually needs to be discontinued. \n\nI wouldn't worry much about achieving deep meditative states either, that will happen naturally. The focus should be on knowing the breath as deeply as you can and quieting your mind - which also happens naturally when your focus becomes one-pointed.\n\nSee the book below as well, which has a section on counting.\n\n\n**Question 2** You shouldn't blank out, keep your attention on whatever part of the breath you are focusing on. In time you will see that where you thought there was a pause, there is in fact still breath - it just becomes very subtle at the outer edges.\n\nConsider this passage from Ledi Sayadaw: (https://www.bps.lk/olib/wh/wh431-p.html)\n\n\n*VIII. The First Tetrad*\n\n(I) The yogi (one devoted to mental training) mindfully exhales an out-breath, and mindfully inhales an in-breath. [4]\n\n(II) When a long breath is exhaled, he knows that he exhales a long out-breath. When a long breath is inhaled, he knows that he inhales a long in-breath. When a short breath is exhaled, he knows that he exhales a short out-breath. When a short breath is inhaled, he knows that he inhales a short in-breath.\n\n(III) While exhaling, he tries to experience the entire out-breath—its beginning, middle, and end. While inhaling, he tries to experience the entire in-breath—its beginning, middle, and end.\n\n(IV) As he exhales, he tries to allay and calm down the out-breath. As he inhales, he tries to allay and calm down the in-breath.\n\n(I) So sato’va assasati sato’va passasati.\n\n(II) Digham va assasanto digham assasamiti pajanati. Digham va passasanto digham passasamiti pajanati. Rassam va assasanto rassam assasamiti pajanati. Rassam va passasanto rassam passasamiti pajanati.\n\n(III) Sabbakayapatisamvedi assasissamiti sikkhati. Sabbakayapatisamvedi passasissamiti sikkhati.\n\n(IV) Passambhayam kayasankharam assasissamiti sikkhati. Passambhayam kayasankharam passasissamiti sikkhati.\n\nIn the first stage, the attempt has to be made to keep the attention firmly fixed on the out-breath and the in-breath.\n\nIn the second stage, the attempt has to be made to perceive the long and short out-breath and in-breath respectively as long and short.\n\nIn the third stage, the attempt has to be made to experience the entire out-breath and in-breath—the beginning, middle, and end.\n\nIn the fourth stage, the attempt has to be made to allay and calm down the out-breaths and in-breaths until they become extremely gentle.\n\nIn the first stage, it is as yet not possible to perceive such details as the length of the out-breaths and in-breaths. In this stage, one has to keep one’s attention on the tip of the nose or the upper lip, as the case may be, wherever the striking of the out-breaths and in-breaths can be clearly grasped, and the attempt must be made to be aware of every out-breath and in-breath that occurs. The attempt must be made for one or two hours, or for whatever length of time one is able to put forth effort, during which the attention must be firmly tied to the tip of the nose or the upper lip. The attempt must be persisted with until every out-breath and in-breath is perceived, without any breath escaping attention.\n\nIn the second stage, when the keeping of the attention on the out-breaths and in-breaths has been mastered, one has to attempt to perceive the long out-breath and in-breath as long, and the short out-breath and in-breath as short. Even during the space of one sitting, long as well as short breaths occur. Every long breath and every short breath must be perceived as such, and the perception must cover every breath, without missing even one out-breath or one in-breath. When the out-breaths and in-breaths are exhaled and inhaled slowly, they are long; and when they are exhaled and inhaled quickly, they are short. Thus, perceiving the long and short out-breaths and in-breaths consists of perceiving the slow and quick out-breaths and in-breaths.\n\nIn the third stage, when the perception of the long and short out-breaths and in-breaths has been mastered, every breath occurring within the body must be experienced in its entirety, right from its starting point within the body through its middle to the point where it ends within the body, the extremities of the breath (start or end as the case may be) being at the tip of the nose and at the navel.\n\nIn the fourth stage, when the experiencing of every breath in its entirety has been mastered, the coarse or rough breaths must be calmed down and allayed by degrees, making them more and more gentle and delicate, until ultimately the stage is reached when one thinks that one’s out-breaths and in-breaths have entirely disappeared.", "edited": 1491922233.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good job sticking to a schedule and getting a daily practice down.&lt;/p&gt;\n\n&lt;p&gt;For your questions:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Question 1&lt;/strong&gt; You should stop counting eventually, the sooner the better IMO. One issue is that you can end up becoming more absorbed in the counting than the breath, and suddenly you can find yourself counting and not paying attention to the breath at all! It is a useful crutch for some when starting, but eventually needs to be discontinued. &lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t worry much about achieving deep meditative states either, that will happen naturally. The focus should be on knowing the breath as deeply as you can and quieting your mind - which also happens naturally when your focus becomes one-pointed.&lt;/p&gt;\n\n&lt;p&gt;See the book below as well, which has a section on counting.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Question 2&lt;/strong&gt; You shouldn&amp;#39;t blank out, keep your attention on whatever part of the breath you are focusing on. In time you will see that where you thought there was a pause, there is in fact still breath - it just becomes very subtle at the outer edges.&lt;/p&gt;\n\n&lt;p&gt;Consider this passage from Ledi Sayadaw: (&lt;a href=\"https://www.bps.lk/olib/wh/wh431-p.html\"&gt;https://www.bps.lk/olib/wh/wh431-p.html&lt;/a&gt;)&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;VIII. The First Tetrad&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;(I) The yogi (one devoted to mental training) mindfully exhales an out-breath, and mindfully inhales an in-breath. [4]&lt;/p&gt;\n\n&lt;p&gt;(II) When a long breath is exhaled, he knows that he exhales a long out-breath. When a long breath is inhaled, he knows that he inhales a long in-breath. When a short breath is exhaled, he knows that he exhales a short out-breath. When a short breath is inhaled, he knows that he inhales a short in-breath.&lt;/p&gt;\n\n&lt;p&gt;(III) While exhaling, he tries to experience the entire out-breath—its beginning, middle, and end. While inhaling, he tries to experience the entire in-breath—its beginning, middle, and end.&lt;/p&gt;\n\n&lt;p&gt;(IV) As he exhales, he tries to allay and calm down the out-breath. As he inhales, he tries to allay and calm down the in-breath.&lt;/p&gt;\n\n&lt;p&gt;(I) So sato’va assasati sato’va passasati.&lt;/p&gt;\n\n&lt;p&gt;(II) Digham va assasanto digham assasamiti pajanati. Digham va passasanto digham passasamiti pajanati. Rassam va assasanto rassam assasamiti pajanati. Rassam va passasanto rassam passasamiti pajanati.&lt;/p&gt;\n\n&lt;p&gt;(III) Sabbakayapatisamvedi assasissamiti sikkhati. Sabbakayapatisamvedi passasissamiti sikkhati.&lt;/p&gt;\n\n&lt;p&gt;(IV) Passambhayam kayasankharam assasissamiti sikkhati. Passambhayam kayasankharam passasissamiti sikkhati.&lt;/p&gt;\n\n&lt;p&gt;In the first stage, the attempt has to be made to keep the attention firmly fixed on the out-breath and the in-breath.&lt;/p&gt;\n\n&lt;p&gt;In the second stage, the attempt has to be made to perceive the long and short out-breath and in-breath respectively as long and short.&lt;/p&gt;\n\n&lt;p&gt;In the third stage, the attempt has to be made to experience the entire out-breath and in-breath—the beginning, middle, and end.&lt;/p&gt;\n\n&lt;p&gt;In the fourth stage, the attempt has to be made to allay and calm down the out-breaths and in-breaths until they become extremely gentle.&lt;/p&gt;\n\n&lt;p&gt;In the first stage, it is as yet not possible to perceive such details as the length of the out-breaths and in-breaths. In this stage, one has to keep one’s attention on the tip of the nose or the upper lip, as the case may be, wherever the striking of the out-breaths and in-breaths can be clearly grasped, and the attempt must be made to be aware of every out-breath and in-breath that occurs. The attempt must be made for one or two hours, or for whatever length of time one is able to put forth effort, during which the attention must be firmly tied to the tip of the nose or the upper lip. The attempt must be persisted with until every out-breath and in-breath is perceived, without any breath escaping attention.&lt;/p&gt;\n\n&lt;p&gt;In the second stage, when the keeping of the attention on the out-breaths and in-breaths has been mastered, one has to attempt to perceive the long out-breath and in-breath as long, and the short out-breath and in-breath as short. Even during the space of one sitting, long as well as short breaths occur. Every long breath and every short breath must be perceived as such, and the perception must cover every breath, without missing even one out-breath or one in-breath. When the out-breaths and in-breaths are exhaled and inhaled slowly, they are long; and when they are exhaled and inhaled quickly, they are short. Thus, perceiving the long and short out-breaths and in-breaths consists of perceiving the slow and quick out-breaths and in-breaths.&lt;/p&gt;\n\n&lt;p&gt;In the third stage, when the perception of the long and short out-breaths and in-breaths has been mastered, every breath occurring within the body must be experienced in its entirety, right from its starting point within the body through its middle to the point where it ends within the body, the extremities of the breath (start or end as the case may be) being at the tip of the nose and at the navel.&lt;/p&gt;\n\n&lt;p&gt;In the fourth stage, when the experiencing of every breath in its entirety has been mastered, the coarse or rough breaths must be calmed down and allayed by degrees, making them more and more gentle and delicate, until ultimately the stage is reached when one thinks that one’s out-breaths and in-breaths have entirely disappeared.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4ckit", "score_hidden": false, "stickied": false, "created": 1491950792.0, "created_utc": 1491921992.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": "", "user_reports": [], "id": "dg4n4lp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "imhereagainwow", "parent_id": "t3_64qgrx", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Nice. Did you start with a shorter amount of time or just go straight to an hour a day?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice. Did you start with a shorter amount of time or just go straight to an hour a day?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4n4lp", "score_hidden": false, "stickied": false, "created": 1491962431.0, "created_utc": 1491933631.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": "", "user_reports": [], "id": "dg4eteg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Someguy5d", "parent_id": "t3_64qgrx", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "\"lean into the emptiness\". Fascinating image, i have to note this down.\n\nLet me make a wild speculation about it: \"The emptiness\" is the fear of death, that lurks in the subconscious of everybody. \"Leaning into it\" means you are trying to face that fear and get positive feelings and endorphins out of it, kind of like a base jumper, if you will. If so, you are certainly doing it right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;lean into the emptiness&amp;quot;. Fascinating image, i have to note this down.&lt;/p&gt;\n\n&lt;p&gt;Let me make a wild speculation about it: &amp;quot;The emptiness&amp;quot; is the fear of death, that lurks in the subconscious of everybody. &amp;quot;Leaning into it&amp;quot; means you are trying to face that fear and get positive feelings and endorphins out of it, kind of like a base jumper, if you will. If so, you are certainly doing it right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4eteg", "score_hidden": false, "stickied": false, "created": 1491953323.0, "created_utc": 1491924523.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": "", "user_reports": [], "id": "dg4t80r", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "tobwilk", "parent_id": "t3_64qgrx", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Thank you for sharing your well written experience of meditation and how it is changing your life. It's nice to read about.\n\nI'm by far an expert. I started with head space, but decided to move on to doing it on my own as I liked the freedom of not having another voice or my headphones. \n\nI also found, in my head I started visualising either a circle or a wave. As I breath i and out, i imagine the wave or circle changing shape in a clean motion. I found that this gets rid of the 'breaks' that I think you are describing. I also tried experimenting with TM mediation and a mantra. However, i found the sounds in my head took away from the peace of breathing.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for sharing your well written experience of meditation and how it is changing your life. It&amp;#39;s nice to read about.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m by far an expert. I started with head space, but decided to move on to doing it on my own as I liked the freedom of not having another voice or my headphones. &lt;/p&gt;\n\n&lt;p&gt;I also found, in my head I started visualising either a circle or a wave. As I breath i and out, i imagine the wave or circle changing shape in a clean motion. I found that this gets rid of the &amp;#39;breaks&amp;#39; that I think you are describing. I also tried experimenting with TM mediation and a mantra. However, i found the sounds in my head took away from the peace of breathing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4t80r", "score_hidden": false, "stickied": false, "created": 1491969000.0, "created_utc": 1491940200.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": "", "user_reports": [], "id": "dg55b97", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dandandandan", "parent_id": "t3_64qgrx", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Regarding the inbetween breath, I try and focus on where a breath begins. Try and perceive the exact moment the in-breath starts. If you are focusing on the nostrils, realise that feeling the movement of air is not the first part of the breath. Find the precedent, which may be in the diaphragm. Then find what comes before the diaphragm movement. Then find what triggers the diaphragm to move, and so on.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Regarding the inbetween breath, I try and focus on where a breath begins. Try and perceive the exact moment the in-breath starts. If you are focusing on the nostrils, realise that feeling the movement of air is not the first part of the breath. Find the precedent, which may be in the diaphragm. Then find what comes before the diaphragm movement. Then find what triggers the diaphragm to move, and so on.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg55b97", "score_hidden": false, "stickied": false, "created": 1491983851.0, "created_utc": 1491955051.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": "", "user_reports": [], "id": "dg47ov9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Exdiv", "parent_id": "t3_64qgrx", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Wow congrats, I have just started and I know that it is a great tool for dealing with stresses in life.  Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow congrats, I have just started and I know that it is a great tool for dealing with stresses in life.  Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg47ov9", "score_hidden": false, "stickied": false, "created": 1491944344.0, "created_utc": 1491915544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": "", "user_reports": [], "id": "dg4bnxh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "invntr", "parent_id": "t1_dg4bgqv", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Maybe that's your problem - you have a timer. I don't - I just listen to the one hour audio track so I sit back and am just guided all the way through. Sometimes my mind wonders how much time has passed, but I simply acknowledge it then re-focus my attention back on the breath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe that&amp;#39;s your problem - you have a timer. I don&amp;#39;t - I just listen to the one hour audio track so I sit back and am just guided all the way through. Sometimes my mind wonders how much time has passed, but I simply acknowledge it then re-focus my attention back on the breath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4bnxh", "score_hidden": false, "stickied": false, "created": 1491949718.0, "created_utc": 1491920918.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64qgrx", "likes": null, "replies": "", "user_reports": [], "id": "dg4fzax", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sorryaboutlastnight", "parent_id": "t1_dg4bgqv", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Set a timer for one hour - and don't look at it until it sounds.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Set a timer for one hour - and don&amp;#39;t look at it until it sounds.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4fzax", "score_hidden": false, "stickied": false, "created": 1491954620.0, "created_utc": 1491925820.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4bgqv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "VaccusMonastica", "parent_id": "t3_64qgrx", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "I can't seem to break past 35 minutes. What did you do to get to 1 hour? That's my goal, but I for me I get to a point in my meditation where I am compelled to look at my timer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t seem to break past 35 minutes. What did you do to get to 1 hour? That&amp;#39;s my goal, but I for me I get to a point in my meditation where I am compelled to look at my timer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4bgqv", "score_hidden": false, "stickied": false, "created": 1491949477.0, "created_utc": 1491920677.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]