[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Meditation", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A little background about me: I&amp;#39;m a 23 year old male. Grew up in many different countries. Spent college in the states the past 4-5 years. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve done LSD twice. Never meditated before that. Both times I noticed that for me, there were two general &amp;quot;phases&amp;quot;. The first phase was mostly visuals and wanting to do stuff, and the second phase was a lot of contemplation, reflection, and a kind of awareness I couldn&amp;#39;t have achieved without the psychedelic. It felt as if I were viewing life from a perspective of no external influence (whether that be cultural, genetic or other influences). &lt;/p&gt;\n\n&lt;p&gt;I meditated for the first time today. The reason I decided to get into it is mainly because I want to lower my ego, increase control over my emotions, get a better hold over self-control and self-discipline, and to reduce laziness/increase motivation. &lt;/p&gt;\n\n&lt;p&gt;I used a recommended meditation style for beginners: sit on the floor cross legged, take deep inhales and exhales, and focus only on breathing for 15 minutes. I was very surprised with the results. The 15 minutes went by very quickly. My head was turned slightly upward, and I felt very relaxed. It was similar to the second phase of my LSD experience, but much less intense. &lt;/p&gt;\n\n&lt;p&gt;My question is, is the reason I&amp;#39;ve had a good experience meditating despite it being my first time because I&amp;#39;ve tried LSD before? Or is it another factor? Or do more people than I think actually have a good first meditation experience? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "A little background about me: I'm a 23 year old male. Grew up in many different countries. Spent college in the states the past 4-5 years. \n\nI've done LSD twice. Never meditated before that. Both times I noticed that for me, there were two general \"phases\". The first phase was mostly visuals and wanting to do stuff, and the second phase was a lot of contemplation, reflection, and a kind of awareness I couldn't have achieved without the psychedelic. It felt as if I were viewing life from a perspective of no external influence (whether that be cultural, genetic or other influences). \n\nI meditated for the first time today. The reason I decided to get into it is mainly because I want to lower my ego, increase control over my emotions, get a better hold over self-control and self-discipline, and to reduce laziness/increase motivation. \n\nI used a recommended meditation style for beginners: sit on the floor cross legged, take deep inhales and exhales, and focus only on breathing for 15 minutes. I was very surprised with the results. The 15 minutes went by very quickly. My head was turned slightly upward, and I felt very relaxed. It was similar to the second phase of my LSD experience, but much less intense. \n\nMy question is, is the reason I've had a good experience meditating despite it being my first time because I've tried LSD before? Or is it another factor? Or do more people than I think actually have a good first meditation experience? ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64sr42", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 13, "report_reasons": null, "author": "MQ1993", "saved": false, "mod_reports": [], "name": "t3_64sr42", "subreddit_name_prefixed": "r/Meditation", "approved_by": null, "over_18": false, "domain": "self.Meditation", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qnc9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Meditation/comments/64sr42/does_lsd_help_ease_into_meditation/", "num_reports": null, "locked": false, "stickied": false, "created": 1491964602.0, "url": "https://www.reddit.com/r/Meditation/comments/64sr42/does_lsd_help_ease_into_meditation/", "author_flair_text": null, "quarantine": false, "title": "Does LSD help ease into Meditation?", "created_utc": 1491935802.0, "distinguished": null, "media": null, "upvote_ratio": 0.69, "num_comments": 5, "visited": false, "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64sr42", "likes": null, "replies": "", "user_reports": [], "id": "dg4qays", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "HarveySpecter11", "parent_id": "t3_64sr42", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Well, I don't think we can say why you've had a good experience.  By the way, you should drop the attitude to judge your meditation in categories of \"good\" or \"bad\", or to interpret your experience. It just is what it is. ;)\n\nSo, meditation and LSD. I've tried microdosing LSD, see: r/microdosing for the details. With mcirodosing, I feel that my meditation has improved significantly. It really helps to focus on the internal and your breath. \n\nI've also had one full trip and I think LSD and meditation have something in common. Maybe it's the fact that LSD causes a shift in perspective and you get to know youself better, just like meditation. During meditation there seems to be a change of perception, just like with LSD (but not as strong, at least to me). So, yes I would say it seems similar in a way.\n\nBut there is one big difference. Lucy takes over control of yourself when you are tripping and there is not much you can do about it. In contrast, meditation should lead to more mind control; so maybe the ultimate goal of meditation (if there is one at all) would be that you have the full control over yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, I don&amp;#39;t think we can say why you&amp;#39;ve had a good experience.  By the way, you should drop the attitude to judge your meditation in categories of &amp;quot;good&amp;quot; or &amp;quot;bad&amp;quot;, or to interpret your experience. It just is what it is. ;)&lt;/p&gt;\n\n&lt;p&gt;So, meditation and LSD. I&amp;#39;ve tried microdosing LSD, see: &lt;a href=\"/r/microdosing\"&gt;r/microdosing&lt;/a&gt; for the details. With mcirodosing, I feel that my meditation has improved significantly. It really helps to focus on the internal and your breath. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also had one full trip and I think LSD and meditation have something in common. Maybe it&amp;#39;s the fact that LSD causes a shift in perspective and you get to know youself better, just like meditation. During meditation there seems to be a change of perception, just like with LSD (but not as strong, at least to me). So, yes I would say it seems similar in a way.&lt;/p&gt;\n\n&lt;p&gt;But there is one big difference. Lucy takes over control of yourself when you are tripping and there is not much you can do about it. In contrast, meditation should lead to more mind control; so maybe the ultimate goal of meditation (if there is one at all) would be that you have the full control over yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4qays", "score_hidden": false, "stickied": false, "created": 1491965879.0, "created_utc": 1491937079.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64sr42", "likes": null, "replies": "", "user_reports": [], "id": "dg4yltc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wires55", "parent_id": "t3_64sr42", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "It can a good gateway to practice in the way it shows you that your perceptions on reality are misinformed and deluded but the two have little in common after that. The similarities are drawn due to the \"ego-death\" state you get from psychedelics which are similar in some ways to one of the formless jhana states that Shakyamuni Buddha trained within. \n \n&gt;People who say these things about drugs and meditation may have tried drugs but most have never really attempted much meditation. Oh maybe they’ve gone to a handful of yoga classes and done shavasana. Or maybe they’ve been to a Vipassana retreat or even rented a cabin at Tassajara one summer. But they don’t have any real depth of experience with meditation to compare to their drug experiences. \" - Zen Priest Brad Warner  \n  \nFull article [here](http://hardcorezen.blogspot.co.uk/2011/07/mountain-of-drugs.html).", "edited": 1491947138.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It can a good gateway to practice in the way it shows you that your perceptions on reality are misinformed and deluded but the two have little in common after that. The similarities are drawn due to the &amp;quot;ego-death&amp;quot; state you get from psychedelics which are similar in some ways to one of the formless jhana states that Shakyamuni Buddha trained within. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;People who say these things about drugs and meditation may have tried drugs but most have never really attempted much meditation. Oh maybe they’ve gone to a handful of yoga classes and done shavasana. Or maybe they’ve been to a Vipassana retreat or even rented a cabin at Tassajara one summer. But they don’t have any real depth of experience with meditation to compare to their drug experiences. &amp;quot; - Zen Priest Brad Warner  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Full article &lt;a href=\"http://hardcorezen.blogspot.co.uk/2011/07/mountain-of-drugs.html\"&gt;here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4yltc", "score_hidden": false, "stickied": false, "created": 1491975148.0, "created_utc": 1491946348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64sr42", "likes": null, "replies": "", "user_reports": [], "id": "dg4xpeo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "retractatus", "parent_id": "t3_64sr42", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "My first meditation was good, and I think this is a normal experience.\n\nNo experience with LSD here, but I used to be way into cannabis because of it's meditative effects. \n\nAs I got deeper and deeper into practising meditation with the guidance of a teacher, I stopped valuing meditation and cannabis for the effects (the lights show and the groovy feeling). In fact, I stopped cannabis all together and started to appreciate sober meditation.\n\nBy the way, one of my meditation teachers regularly uses psilocybin for healing purposes in his practise. It really works for him, and he's one of the most magnificent humans I've ever encountered. So there's definitely a place for psychedelics in a rigorous practise.\n\nI think that your goals are well set. All the best.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My first meditation was good, and I think this is a normal experience.&lt;/p&gt;\n\n&lt;p&gt;No experience with LSD here, but I used to be way into cannabis because of it&amp;#39;s meditative effects. &lt;/p&gt;\n\n&lt;p&gt;As I got deeper and deeper into practising meditation with the guidance of a teacher, I stopped valuing meditation and cannabis for the effects (the lights show and the groovy feeling). In fact, I stopped cannabis all together and started to appreciate sober meditation.&lt;/p&gt;\n\n&lt;p&gt;By the way, one of my meditation teachers regularly uses psilocybin for healing purposes in his practise. It really works for him, and he&amp;#39;s one of the most magnificent humans I&amp;#39;ve ever encountered. So there&amp;#39;s definitely a place for psychedelics in a rigorous practise.&lt;/p&gt;\n\n&lt;p&gt;I think that your goals are well set. All the best.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4xpeo", "score_hidden": false, "stickied": false, "created": 1491974064.0, "created_utc": 1491945264.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64sr42", "likes": null, "replies": "", "user_reports": [], "id": "dg4w7w3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SqueakerChops", "parent_id": "t3_64sr42", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "imo what might have helped was that you were more open to the new expierence. I haven't done psychedelics very often (lsd and shrooms), but I began looking into meditation after my last trip last Sep or so. I've had a terrible habit with meditating since then and haven't made much progress, (I read too much and sit too little) but I do remember that it was fairly easy early on to get to... hmm... \"significant seeming states\" I'd say.\n\nTrying new things can be difficult to put your heart into for a lot of people. Usually, because the ego is firmly in the driver's seat. There's often a bit of an 'afterglow' I feel after psychedelics, elevated mood, easier to try new things and stuff like that. Even if it's been a while since then for you, you have had a somewhat similar experience to it, so it felt familar, or something like that. So there is a chance you would have had a slightly harder time otherwise; perhaps you avoided some roadblocks, like doubt or mistrust of strange feelings.\n\nIt's definitely not the same for everyone! But looking back on myself... its hard to see how I could have even gotten interested in it without my psychedelic use. Things just happened the way they did for me, and here I am. \n\nBasically... its like *anything* can *potentially* help someone ease into meditation. I do, not that rarely, see psychedelics help people towards this path. But I also see people get trapped by it, always chasing after the next trippy meditative state, taking hits to make the meditation \"good\" enough. Nice now and then of course, but if its the only thing they deem good enough, and don't value any sober meditation, then they probably aren't really learning anything about themselves. \n\nAll in all, I'd guess what was likely most significant for you was that you seemed to have approached it with an open mind, not holding many reservations. \n\nBe it the first time or the 500th though... every meditation will be different. Not necessarily drastically, but they're just unique instances from one another. Some days your mind will be less quiet than others. It isn't worse or better c: It's all just sitting with your self, and learning about your self. Don't worry if it's hard to avoid judging them for now though! Little by little and all that.\n\ngood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;imo what might have helped was that you were more open to the new expierence. I haven&amp;#39;t done psychedelics very often (lsd and shrooms), but I began looking into meditation after my last trip last Sep or so. I&amp;#39;ve had a terrible habit with meditating since then and haven&amp;#39;t made much progress, (I read too much and sit too little) but I do remember that it was fairly easy early on to get to... hmm... &amp;quot;significant seeming states&amp;quot; I&amp;#39;d say.&lt;/p&gt;\n\n&lt;p&gt;Trying new things can be difficult to put your heart into for a lot of people. Usually, because the ego is firmly in the driver&amp;#39;s seat. There&amp;#39;s often a bit of an &amp;#39;afterglow&amp;#39; I feel after psychedelics, elevated mood, easier to try new things and stuff like that. Even if it&amp;#39;s been a while since then for you, you have had a somewhat similar experience to it, so it felt familar, or something like that. So there is a chance you would have had a slightly harder time otherwise; perhaps you avoided some roadblocks, like doubt or mistrust of strange feelings.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s definitely not the same for everyone! But looking back on myself... its hard to see how I could have even gotten interested in it without my psychedelic use. Things just happened the way they did for me, and here I am. &lt;/p&gt;\n\n&lt;p&gt;Basically... its like &lt;em&gt;anything&lt;/em&gt; can &lt;em&gt;potentially&lt;/em&gt; help someone ease into meditation. I do, not that rarely, see psychedelics help people towards this path. But I also see people get trapped by it, always chasing after the next trippy meditative state, taking hits to make the meditation &amp;quot;good&amp;quot; enough. Nice now and then of course, but if its the only thing they deem good enough, and don&amp;#39;t value any sober meditation, then they probably aren&amp;#39;t really learning anything about themselves. &lt;/p&gt;\n\n&lt;p&gt;All in all, I&amp;#39;d guess what was likely most significant for you was that you seemed to have approached it with an open mind, not holding many reservations. &lt;/p&gt;\n\n&lt;p&gt;Be it the first time or the 500th though... every meditation will be different. Not necessarily drastically, but they&amp;#39;re just unique instances from one another. Some days your mind will be less quiet than others. It isn&amp;#39;t worse or better c: It&amp;#39;s all just sitting with your self, and learning about your self. Don&amp;#39;t worry if it&amp;#39;s hard to avoid judging them for now though! Little by little and all that.&lt;/p&gt;\n\n&lt;p&gt;good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg4w7w3", "score_hidden": false, "stickied": false, "created": 1491972329.0, "created_utc": 1491943529.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64sr42", "likes": null, "replies": "", "user_reports": [], "id": "dg5b23a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "greenwizardneedsfood", "parent_id": "t3_64sr42", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Yes. Personally I've found it to be like a temporary meditation cheat code with the added option of imagination land if you want it (where you will probably go for a majority of the first phase you mentioned). Obviously you're still on drugs though so ya know, be careful and safe and recognize and respect that the drugs will always be affecting you to some extent. That being said, I've done both separately and together for several years and some of the most consequential effects and indescribable events from either of them have come when I've done them together. They really can play well off of each other. I can offer you theories of why and how and if all day, but from my personal experiences as well as information I've gathered from other people, I strongly believe that it can really facilitate going into at least extremely similar states. Personally it's provided some sort of sense of direction for my meditation. It's not that you're shooting to go to the same place, but going through this spectrum of level of observation and attachment to the external world, for me at least, has seemingly been informative of methods and pointers for my everyday practice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Personally I&amp;#39;ve found it to be like a temporary meditation cheat code with the added option of imagination land if you want it (where you will probably go for a majority of the first phase you mentioned). Obviously you&amp;#39;re still on drugs though so ya know, be careful and safe and recognize and respect that the drugs will always be affecting you to some extent. That being said, I&amp;#39;ve done both separately and together for several years and some of the most consequential effects and indescribable events from either of them have come when I&amp;#39;ve done them together. They really can play well off of each other. I can offer you theories of why and how and if all day, but from my personal experiences as well as information I&amp;#39;ve gathered from other people, I strongly believe that it can really facilitate going into at least extremely similar states. Personally it&amp;#39;s provided some sort of sense of direction for my meditation. It&amp;#39;s not that you&amp;#39;re shooting to go to the same place, but going through this spectrum of level of observation and attachment to the external world, for me at least, has seemingly been informative of methods and pointers for my everyday practice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg5b23a", "score_hidden": false, "stickied": false, "created": 1491991374.0, "created_utc": 1491962574.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]