[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Meditation", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last November I decided to take some shrooms (3 grams) and smoke some weed at the same time before the trip began. I&amp;#39;ve done shrooms twice before and didn&amp;#39;t experience anything like this. It started off with some terrible anxiety, which remained throughout the whole trip. The next most vivid part of the trip was where I told myself that I had to die, that the only way I could escape this was to kill myself. I knew my mom and sister would be devastated if I killed myself, so I decided that I would give myself lung cancer by smoking excessively. &lt;/p&gt;\n\n&lt;p&gt;I pictured myself lying naked in a restaurant or somewhere in public covered in my own feces and people staring at me in utter disgust. After a while I climbed into my bedsheets and closed my eyes. This was when the anxiety went down a little bit, but the trip turned to a whole new level. I felt like there were these things taking me to another dimension where I would play the role of &amp;quot;god&amp;quot; or the universe of whatever. I felt myself experiencing nothing but suffering, I felt me as a single entity transfer my consciousness into every person throughout time. I felt the pain of the Jews who were burned alive, the people in the scuff videos I saw online, my ex-boss who treated my like shit but I understood that he through was suffering quite a lot. &lt;/p&gt;\n\n&lt;p&gt;My trip ended when my roommate walked into our condo and I snapped back to reality. What followed however was a huge amount of anxiety from the thought of nihilism, that everything we do is completely useless. Nothing has a purpose and we&amp;#39;re all in this universe to suffer. It turned me inside out, I indulged in my own nihilistic thoughts and refused to talk to someone about it, and it really really fucked me up. &lt;/p&gt;\n\n&lt;p&gt;Thanks to &lt;a href=\"/r/meditation\"&gt;/r/meditation&lt;/a&gt; I&amp;#39;ve hit almost a month of daily meditation which has reduced my anxiety quite a bit, but I still get panic attacks. I was before living in a very solipsistic mindset, thinking that I was the only one who actually existed and everything, everyone was just a projection of my mind (hence having the power to give myself lung cancer) but this has almost completely gone away through meditation. &lt;/p&gt;\n\n&lt;p&gt;I always wonder, what is gonna happen when I die, will I live the lives of all of these people who have suffered all over again? At times I have thought about killing myself, but a while back I read on &lt;a href=\"/r/GlitchInTheMatrix\"&gt;/r/GlitchInTheMatrix&lt;/a&gt; (I know it sounds stupid, but its been feeding the fire in my head) that these people tried killing themselves, and woke up in a different reality; an identical reality with a slightly different timeline. What the fuck is the point of existing?&lt;/p&gt;\n\n&lt;p&gt;I know that only I can find the answer to this question (maybe), and through meditation I have realized some things buried in my subconscious, like the people who bullied me when I was a kid, or the death of my father at a very young age. Things like that which I am now starting realize were the catalyst to my depression and anxiety, and look at them from a different perspective. &lt;/p&gt;\n\n&lt;p&gt;However, asking you guys is very comforting; I just wanna hear it from someone else before I figure it out for myself. Like a mother when she tells her kid that everything will be okay after they woke up from a nightmare.&lt;/p&gt;\n\n&lt;p&gt;What have you guys figured out on your journeys about the meaning of life? I don&amp;#39;t wanna keep living in this cynical mindset, it hurts.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit:&lt;/strong&gt; Sorry for the long post, I tried to make it as short as possible but I couldn&amp;#39;t summarize it anymore than this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Last November I decided to take some shrooms (3 grams) and smoke some weed at the same time before the trip began. I've done shrooms twice before and didn't experience anything like this. It started off with some terrible anxiety, which remained throughout the whole trip. The next most vivid part of the trip was where I told myself that I had to die, that the only way I could escape this was to kill myself. I knew my mom and sister would be devastated if I killed myself, so I decided that I would give myself lung cancer by smoking excessively. \n\nI pictured myself lying naked in a restaurant or somewhere in public covered in my own feces and people staring at me in utter disgust. After a while I climbed into my bedsheets and closed my eyes. This was when the anxiety went down a little bit, but the trip turned to a whole new level. I felt like there were these things taking me to another dimension where I would play the role of \"god\" or the universe of whatever. I felt myself experiencing nothing but suffering, I felt me as a single entity transfer my consciousness into every person throughout time. I felt the pain of the Jews who were burned alive, the people in the scuff videos I saw online, my ex-boss who treated my like shit but I understood that he through was suffering quite a lot. \n\nMy trip ended when my roommate walked into our condo and I snapped back to reality. What followed however was a huge amount of anxiety from the thought of nihilism, that everything we do is completely useless. Nothing has a purpose and we're all in this universe to suffer. It turned me inside out, I indulged in my own nihilistic thoughts and refused to talk to someone about it, and it really really fucked me up. \n\nThanks to /r/meditation I've hit almost a month of daily meditation which has reduced my anxiety quite a bit, but I still get panic attacks. I was before living in a very solipsistic mindset, thinking that I was the only one who actually existed and everything, everyone was just a projection of my mind (hence having the power to give myself lung cancer) but this has almost completely gone away through meditation. \n\nI always wonder, what is gonna happen when I die, will I live the lives of all of these people who have suffered all over again? At times I have thought about killing myself, but a while back I read on /r/GlitchInTheMatrix (I know it sounds stupid, but its been feeding the fire in my head) that these people tried killing themselves, and woke up in a different reality; an identical reality with a slightly different timeline. What the fuck is the point of existing?\n\nI know that only I can find the answer to this question (maybe), and through meditation I have realized some things buried in my subconscious, like the people who bullied me when I was a kid, or the death of my father at a very young age. Things like that which I am now starting realize were the catalyst to my depression and anxiety, and look at them from a different perspective. \n\nHowever, asking you guys is very comforting; I just wanna hear it from someone else before I figure it out for myself. Like a mother when she tells her kid that everything will be okay after they woke up from a nightmare.\n\nWhat have you guys figured out on your journeys about the meaning of life? I don't wanna keep living in this cynical mindset, it hurts.\n\n**edit:** Sorry for the long post, I tried to make it as short as possible but I couldn't summarize it anymore than this.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "64yhdy", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 39, "report_reasons": null, "author": "MilkForBones", "saved": false, "mod_reports": [], "name": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "approved_by": null, "over_18": false, "domain": "self.Meditation", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qnc9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Meditation/comments/64yhdy/fear_of_reality_its_scary_and_i_dont_know_what_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492036132.0, "url": "https://www.reddit.com/r/Meditation/comments/64yhdy/fear_of_reality_its_scary_and_i_dont_know_what_to/", "author_flair_text": null, "quarantine": false, "title": "Fear of reality? It's scary and I don't know what to do", "created_utc": 1492007332.0, "distinguished": null, "media": null, "upvote_ratio": 0.96, "num_comments": 35, "visited": false, "subreddit_type": "public", "ups": 39}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg682qm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "wanderingtrance", "parent_id": "t1_dg607oc", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "I've had anxiety for 6 years or so,  smoking pot actually made it worse and I would have obsessive thoughts about things and have a panic attack. Only happened twice but I could tell it always builds to this, like a dirty glass of water just getting fuller and fuller waiting to over-spill, every time I smoke (if i did it often). Sometimes I would distract myself but the thoughts were going on under the surface. Once I quit smoking the anxiety lessened because i think it was easier to get out of my own head. Now Ive added meditation to that and it is showing me lots of truth. In relation to your anxiety, it WILL be okay. All this repressed stuff coming up is part of it. Sometimes we have anxiety (extreme emotional discomfort) and our thoughts want to link it to something in particular, like, that life is meaningless, when really it has to do with something else that was never dealt with, like bullying. I'm not saying this is exactly your case, but through meditation I have seen that thoughts DO do this. Thoughts are one thing, emotions another, but thoughts can grasp onto emotion and use them. Its gonna feel real though, all those thoughts, like they are true, meditation will help you the difference of true and not. But you are underneath all this, these thoughts seem really important, but underneath is actual truth hiding there. Keep meditating, you are on the right path.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had anxiety for 6 years or so,  smoking pot actually made it worse and I would have obsessive thoughts about things and have a panic attack. Only happened twice but I could tell it always builds to this, like a dirty glass of water just getting fuller and fuller waiting to over-spill, every time I smoke (if i did it often). Sometimes I would distract myself but the thoughts were going on under the surface. Once I quit smoking the anxiety lessened because i think it was easier to get out of my own head. Now Ive added meditation to that and it is showing me lots of truth. In relation to your anxiety, it WILL be okay. All this repressed stuff coming up is part of it. Sometimes we have anxiety (extreme emotional discomfort) and our thoughts want to link it to something in particular, like, that life is meaningless, when really it has to do with something else that was never dealt with, like bullying. I&amp;#39;m not saying this is exactly your case, but through meditation I have seen that thoughts DO do this. Thoughts are one thing, emotions another, but thoughts can grasp onto emotion and use them. Its gonna feel real though, all those thoughts, like they are true, meditation will help you the difference of true and not. But you are underneath all this, these thoughts seem really important, but underneath is actual truth hiding there. Keep meditating, you are on the right path.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg682qm", "score_hidden": false, "stickied": false, "created": 1492047391.0, "created_utc": 1492018591.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg63om2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thedevilsdelinquent", "parent_id": "t1_dg607oc", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "To add to that, it's pretty often that people come back from trips with heightened anxiety about reality and such. It will fade. It may take you a while, but it will fade. Meditation is key.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add to that, it&amp;#39;s pretty often that people come back from trips with heightened anxiety about reality and such. It will fade. It may take you a while, but it will fade. Meditation is key.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg63om2", "score_hidden": false, "stickied": false, "created": 1492042897.0, "created_utc": 1492014097.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg765id", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Orc_", "parent_id": "t1_dg607oc", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "For me it took 6 months and I'm still not at 100%, sometimes I make mistakes and trigger symthoms, yesturday I had the worst panic attack even tho I haven't had one in months.\n\nI hope to recover 100% and keep the new knowledge on panic attacks and how the mind can be so nasty.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For me it took 6 months and I&amp;#39;m still not at 100%, sometimes I make mistakes and trigger symthoms, yesturday I had the worst panic attack even tho I haven&amp;#39;t had one in months.&lt;/p&gt;\n\n&lt;p&gt;I hope to recover 100% and keep the new knowledge on panic attacks and how the mind can be so nasty.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg765id", "score_hidden": false, "stickied": false, "created": 1492088179.0, "created_utc": 1492059379.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg8vd31", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "visceralconcept", "parent_id": "t1_dg607oc", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Same with me and same drug (LSD). I tripped the fuck out of reality and it lasted a while. I had to come to accepting the fat that reality is what we want it to be, and the fact that I was so fixed to a matrix reality and suddenly being released form it scared the shit out of me. \n\nI did LSD after years and realized its effects on me become kind obvious like as opposed to the thrill factor and stuff that I Used to have, thus makes it obsolete. I was also into spirituality a lot and curious on philosophy and learning more about my inner working which eventually helped me free myself from myself. Of course, I'm in the process of it, and I'm slowly learning about fear now, surprisingly I'm learning it through love.. \n\nNo more smoking or any of that stuff for me, cus I straight up feel like reality itself is a high that many of us can't control which motivates me to try harder to do that and not add anything else into it like the herb.. :) I Still love the fuck out of reggae music, no hate at all... ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Same with me and same drug (LSD). I tripped the fuck out of reality and it lasted a while. I had to come to accepting the fat that reality is what we want it to be, and the fact that I was so fixed to a matrix reality and suddenly being released form it scared the shit out of me. &lt;/p&gt;\n\n&lt;p&gt;I did LSD after years and realized its effects on me become kind obvious like as opposed to the thrill factor and stuff that I Used to have, thus makes it obsolete. I was also into spirituality a lot and curious on philosophy and learning more about my inner working which eventually helped me free myself from myself. Of course, I&amp;#39;m in the process of it, and I&amp;#39;m slowly learning about fear now, surprisingly I&amp;#39;m learning it through love.. &lt;/p&gt;\n\n&lt;p&gt;No more smoking or any of that stuff for me, cus I straight up feel like reality itself is a high that many of us can&amp;#39;t control which motivates me to try harder to do that and not add anything else into it like the herb.. :) I Still love the fuck out of reggae music, no hate at all... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg8vd31", "score_hidden": false, "stickied": false, "created": 1492181375.0, "created_utc": 1492152575.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg607oc", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Chukwuuzi", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Dude I had a really similar experience on lsd and it took some time to readjust to reality but it will happen with time, I also thought I was the only one that existed at one point \n\nEDIT: I've also stopped smoking weed don't know if you do/it will help but it did for me", "edited": 1492014239.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dude I had a really similar experience on lsd and it took some time to readjust to reality but it will happen with time, I also thought I was the only one that existed at one point &lt;/p&gt;\n\n&lt;p&gt;EDIT: I&amp;#39;ve also stopped smoking weed don&amp;#39;t know if you do/it will help but it did for me&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg607oc", "score_hidden": false, "stickied": false, "created": 1492039128.0, "created_utc": 1492010328.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7p1gv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MilkForBones", "parent_id": "t1_dg60ed6", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "&gt; We want the answer so we can stop having to wonder and guess, and just know.\n\nThis is me 120%. I think at this point I just need to stop feeding this thirst for knowledge. There are some things looking into don't result in answers, but in more questions. Its an endless loop which will drive me to insanity. I think /u/average_jacuzzi points this out quite eloquently in his answer as well.\n\n&gt; Whether or not it is a depressing one or a rejoiceful one is decided personally, subjectively. There is the knowledge, and then there is how you *feel* about it, the sentiments you attach to that\n\nThis is beautiful. I'm going to try and look at all the negatives I experience from another perspective, as reality is truly all about perspective. Thank you so much.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;We want the answer so we can stop having to wonder and guess, and just know.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is me 120%. I think at this point I just need to stop feeding this thirst for knowledge. There are some things looking into don&amp;#39;t result in answers, but in more questions. Its an endless loop which will drive me to insanity. I think &lt;a href=\"/u/average_jacuzzi\"&gt;/u/average_jacuzzi&lt;/a&gt; points this out quite eloquently in his answer as well.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Whether or not it is a depressing one or a rejoiceful one is decided personally, subjectively. There is the knowledge, and then there is how you &lt;em&gt;feel&lt;/em&gt; about it, the sentiments you attach to that&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is beautiful. I&amp;#39;m going to try and look at all the negatives I experience from another perspective, as reality is truly all about perspective. Thank you so much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7p1gv", "score_hidden": false, "stickied": false, "created": 1492125713.0, "created_utc": 1492096913.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7x2ef", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Orc_", "parent_id": "t1_dg7b9x2", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "We need to fight useless concepts and promote those that increase general well-being and civilizational pursuits.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We need to fight useless concepts and promote those that increase general well-being and civilizational pursuits.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7x2ef", "score_hidden": false, "stickied": false, "created": 1492134254.0, "created_utc": 1492105454.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7b9x2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Moogle22", "parent_id": "t1_dg769t6", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Woah chill. You may not agree with it but it doesn't mean it's a bad philosophy. This is a meditation sub, there's no need to be so combative. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Woah chill. You may not agree with it but it doesn&amp;#39;t mean it&amp;#39;s a bad philosophy. This is a meditation sub, there&amp;#39;s no need to be so combative. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7b9x2", "score_hidden": false, "stickied": false, "created": 1492100496.0, "created_utc": 1492071696.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7wss7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Orc_", "parent_id": "t1_dg7ceru", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "&gt; Does no existing anymore scare you that much? I've always thought there's a lot of peace and comfort from that philosophy, that everything ends.\n\nActually it's the other way around, buddhist concepts are crybaby shit.\n\n\"ceasing\"? It doesn't exist, it's a myth, an impossibility, you cannot \"not\" exist, just like nothing does not exist so something must exist (this is why there is something other than nothing) consciousness of existence also must exist.\n\n\"end\" is an illusion of this linear world, which isn't even linear, there is no evidence it is linear, it could by cyclical.\n\nIt's not about fear it's about preaching bullshit to people, it's about telling people there is a white rabbit they must catch.\n\nDon't waste your time with religion and the fools that created it, give the middle finger to the buddha and give the middle ginger to all those that created christianity, they're are mediocre fools with no real civilizational pursuits. which the the greatest good we know as it created localized goals that increase pleasure and intellectual pursuits.", "edited": 1492105351.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Does no existing anymore scare you that much? I&amp;#39;ve always thought there&amp;#39;s a lot of peace and comfort from that philosophy, that everything ends.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Actually it&amp;#39;s the other way around, buddhist concepts are crybaby shit.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;ceasing&amp;quot;? It doesn&amp;#39;t exist, it&amp;#39;s a myth, an impossibility, you cannot &amp;quot;not&amp;quot; exist, just like nothing does not exist so something must exist (this is why there is something other than nothing) consciousness of existence also must exist.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;end&amp;quot; is an illusion of this linear world, which isn&amp;#39;t even linear, there is no evidence it is linear, it could by cyclical.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not about fear it&amp;#39;s about preaching bullshit to people, it&amp;#39;s about telling people there is a white rabbit they must catch.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t waste your time with religion and the fools that created it, give the middle finger to the buddha and give the middle ginger to all those that created christianity, they&amp;#39;re are mediocre fools with no real civilizational pursuits. which the the greatest good we know as it created localized goals that increase pleasure and intellectual pursuits.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7wss7", "score_hidden": false, "stickied": false, "created": 1492133968.0, "created_utc": 1492105168.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ceru", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "klabboy", "parent_id": "t1_dg769t6", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Does no existing anymore scare you that much? I've always thought there's a lot of peace and comfort from that philosophy, that everything ends. \n\nI personally don't believe it but I can see how its comforting. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does no existing anymore scare you that much? I&amp;#39;ve always thought there&amp;#39;s a lot of peace and comfort from that philosophy, that everything ends. &lt;/p&gt;\n\n&lt;p&gt;I personally don&amp;#39;t believe it but I can see how its comforting. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7ceru", "score_hidden": false, "stickied": false, "created": 1492103963.0, "created_utc": 1492075163.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7eqjd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "healslutthrowaway1", "parent_id": "t1_dg769t6", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "When Buddha spoke of enlightenment as the blowing out of the candle, he also said that there was no other way to describe the experience, because saying that it felt like ten thousand suns arising in your soul (meaning cosmic bliss) was a complete understatement and did it no justice. The only way he could describe it was, instead of something new being there, the very source of all his suffering had been extinguished, and there was nothing left to experience in the world but perfection.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When Buddha spoke of enlightenment as the blowing out of the candle, he also said that there was no other way to describe the experience, because saying that it felt like ten thousand suns arising in your soul (meaning cosmic bliss) was a complete understatement and did it no justice. The only way he could describe it was, instead of something new being there, the very source of all his suffering had been extinguished, and there was nothing left to experience in the world but perfection.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7eqjd", "score_hidden": false, "stickied": false, "created": 1492110712.0, "created_utc": 1492081912.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7n16n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SqueakerChops", "parent_id": "t1_dg769t6", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "yeah I really don't mean any offense but you have misunderstood the buddhist thought (for the record i don't claim to be an expert, far from it)\n\n&gt;so seek to delete yourself with nirvana?\n\nThe implications of this sentence is where the understanding splits I think. What exactly does that mean to you? to 'delete yourself' as you put it?\n\nTo me, its saying exactly what many people make their goal in meditation- to reduce the 'ego', to get the wise, calm part of you in the driver's seat instead of the craving, gratification seeking part. \n\nThe idea is that everything is suffering, because we have a constructed self that we believe is \"ME\". This is the internal dialogue that justifies your less-than-wise actions. That says things like 'Well what has that guy ever done for me me? Screw him, I'm not helping.' \n\nThrough the lens of this constructed self, many things can seem different then they are. I understand that it can feel like losing yourself, becoming an empty shell or something like that, but that again is thru the lens of this constructed false-self. At some point in the path its realized that its actually liberation. Freedom can make us feel contained at times, when our feet aren't used to the walking. \n\nAnd again, the subject of nihlism. That is not something that always means despair and hopelessness. Why does the idea of no god, no point, no end fill you with horror? honest question. Mediation is about learning your self no matter the philosophy right? Try to consider why the idea of those things being true fills you with aversion. \n\nWanting by itself is not suffering. Clinging to the wanting, Identifying with the wanting, and letting it have power over you, BE you, is what leads to the suffering. \n\nIdeas are just ideas. How you feel about them is seperate. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yeah I really don&amp;#39;t mean any offense but you have misunderstood the buddhist thought (for the record i don&amp;#39;t claim to be an expert, far from it)&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;so seek to delete yourself with nirvana?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The implications of this sentence is where the understanding splits I think. What exactly does that mean to you? to &amp;#39;delete yourself&amp;#39; as you put it?&lt;/p&gt;\n\n&lt;p&gt;To me, its saying exactly what many people make their goal in meditation- to reduce the &amp;#39;ego&amp;#39;, to get the wise, calm part of you in the driver&amp;#39;s seat instead of the craving, gratification seeking part. &lt;/p&gt;\n\n&lt;p&gt;The idea is that everything is suffering, because we have a constructed self that we believe is &amp;quot;ME&amp;quot;. This is the internal dialogue that justifies your less-than-wise actions. That says things like &amp;#39;Well what has that guy ever done for me me? Screw him, I&amp;#39;m not helping.&amp;#39; &lt;/p&gt;\n\n&lt;p&gt;Through the lens of this constructed self, many things can seem different then they are. I understand that it can feel like losing yourself, becoming an empty shell or something like that, but that again is thru the lens of this constructed false-self. At some point in the path its realized that its actually liberation. Freedom can make us feel contained at times, when our feet aren&amp;#39;t used to the walking. &lt;/p&gt;\n\n&lt;p&gt;And again, the subject of nihlism. That is not something that always means despair and hopelessness. Why does the idea of no god, no point, no end fill you with horror? honest question. Mediation is about learning your self no matter the philosophy right? Try to consider why the idea of those things being true fills you with aversion. &lt;/p&gt;\n\n&lt;p&gt;Wanting by itself is not suffering. Clinging to the wanting, Identifying with the wanting, and letting it have power over you, BE you, is what leads to the suffering. &lt;/p&gt;\n\n&lt;p&gt;Ideas are just ideas. How you feel about them is seperate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7n16n", "score_hidden": false, "stickied": false, "created": 1492123483.0, "created_utc": 1492094683.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg769t6", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Orc_", "parent_id": "t1_dg60ed6", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "&gt; In fact, that's basically the first of the four noble truths of Buddhism!\n\nWhich is a load of crap, existing is suffering so seek to delete yourself with nirvana?\n\nNot to mention talking about budhism with somebody having existential issue is fucked, buddhism is existential horror, it's the worst freaking religion, one that teaches there's no God and we are trapped in a suffering without point or end.\n\nSo your next point about \"living\"? Weren't you speaking about buddhism? Existing leads to suffering and wanting by itself is suffering.\n\nChoose a better philosphy rather than one that makes people do lines to seek \"wisdom\" from monks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;In fact, that&amp;#39;s basically the first of the four noble truths of Buddhism!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Which is a load of crap, existing is suffering so seek to delete yourself with nirvana?&lt;/p&gt;\n\n&lt;p&gt;Not to mention talking about budhism with somebody having existential issue is fucked, buddhism is existential horror, it&amp;#39;s the worst freaking religion, one that teaches there&amp;#39;s no God and we are trapped in a suffering without point or end.&lt;/p&gt;\n\n&lt;p&gt;So your next point about &amp;quot;living&amp;quot;? Weren&amp;#39;t you speaking about buddhism? Existing leads to suffering and wanting by itself is suffering.&lt;/p&gt;\n\n&lt;p&gt;Choose a better philosphy rather than one that makes people do lines to seek &amp;quot;wisdom&amp;quot; from monks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg769t6", "score_hidden": false, "stickied": false, "created": 1492088381.0, "created_utc": 1492059581.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg60ed6", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "SqueakerChops", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "To me, the main subject of that trip you described seems to be you expierencing... well a whole bunch of empathy. There's a lot of suffering in the word. fact. There always has been. In fact, that's basically the first of the four noble truths of Buddhism! Look into some overview of buddhist thought if you'd like, but don't worry if it doesn't seem to be for you. \n\nSomething that is rather encouraged, like by implication that is, by most of our modern society, is to not worry about it. Don't think about it, it is not your problem, that kind of sentiment. So we're basically taught to shove it down, bottle it up, and turn a blind eye to the tradegies of many people existences.\n\nShrooms can do a whole heck of a thorough job at unearthing buried things like that. \n\nAs to your main question: You are 100% correct. Only you can find that answer for yourself, only you can realize and expierence that kind of truth, the kind that will shake your core.\n\nYour current conclusion is not alien to me at all. It does all very often seem pointless. futile. That is what we are very easily tempted to see, when the things we have been told very obviously do not measure up to our own understanding/experiences. \n\nI have occasionally done psychedelics. On my last one like a year ago I was left with a take away thought: 'there is no point'\n\nBut, strangely, it was not a negative feeling. I actually felt an inexplicable hope. I really didn't understand it for months though. You see, realizing a 'truth' is one thing. Whether or not it is a depressing one or a rejoiceful one is decided personally, subjectively. There is the knowledge, and then there is how you *feel* about it, the sentiments you attach to that. \n\nWe commonly want there to be a point, so we can know what we should do in order: to be happy, to be safe, to be on the right side, etc. We want the answer so we can stop having to wonder and guess, and just *know*. But there is no objective point or reason, none that I have found, save for one possibility that I have not been able to disprove. \n\nThe point of living, from where I find myself today, is to live. To really live. To be. To exist. To find our own meaning. To find what is real for each of us. There is no language to my knowledge that can convey the meaning of life from one brain to another in one package, language is too limiting. I'm not waxing romantic here, its literally too limiting to convey it. We can hint at it, point at it, but the only way to find 'the point' is to personally live, free from the bullshit we find ourselves programmed with. Basically what I'm saying is... keep going. Keep journeying. Keep seeking. The cynycism won't last forever, because NOTHING lasts forever. Everything is temporary, coming and going. The point is the path. The expierence of life, and what you do with it. \n\nI would suggest meditating with your feeling of cynicism, this feeling that hurts. The feeling of hurt itself, and why it is there. Not thinking it out and reasoning about it with your thoughts, but observing it with your awareness, the same way you observe in how you usually mediate (i'll guess breath because it seems to be the most common). Sit with this feeling, if you can, and become familiar with it... learn it. Just a suggestion, I'm no expert!\n\nI wish you luck and peace on your adventure c:", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To me, the main subject of that trip you described seems to be you expierencing... well a whole bunch of empathy. There&amp;#39;s a lot of suffering in the word. fact. There always has been. In fact, that&amp;#39;s basically the first of the four noble truths of Buddhism! Look into some overview of buddhist thought if you&amp;#39;d like, but don&amp;#39;t worry if it doesn&amp;#39;t seem to be for you. &lt;/p&gt;\n\n&lt;p&gt;Something that is rather encouraged, like by implication that is, by most of our modern society, is to not worry about it. Don&amp;#39;t think about it, it is not your problem, that kind of sentiment. So we&amp;#39;re basically taught to shove it down, bottle it up, and turn a blind eye to the tradegies of many people existences.&lt;/p&gt;\n\n&lt;p&gt;Shrooms can do a whole heck of a thorough job at unearthing buried things like that. &lt;/p&gt;\n\n&lt;p&gt;As to your main question: You are 100% correct. Only you can find that answer for yourself, only you can realize and expierence that kind of truth, the kind that will shake your core.&lt;/p&gt;\n\n&lt;p&gt;Your current conclusion is not alien to me at all. It does all very often seem pointless. futile. That is what we are very easily tempted to see, when the things we have been told very obviously do not measure up to our own understanding/experiences. &lt;/p&gt;\n\n&lt;p&gt;I have occasionally done psychedelics. On my last one like a year ago I was left with a take away thought: &amp;#39;there is no point&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;But, strangely, it was not a negative feeling. I actually felt an inexplicable hope. I really didn&amp;#39;t understand it for months though. You see, realizing a &amp;#39;truth&amp;#39; is one thing. Whether or not it is a depressing one or a rejoiceful one is decided personally, subjectively. There is the knowledge, and then there is how you &lt;em&gt;feel&lt;/em&gt; about it, the sentiments you attach to that. &lt;/p&gt;\n\n&lt;p&gt;We commonly want there to be a point, so we can know what we should do in order: to be happy, to be safe, to be on the right side, etc. We want the answer so we can stop having to wonder and guess, and just &lt;em&gt;know&lt;/em&gt;. But there is no objective point or reason, none that I have found, save for one possibility that I have not been able to disprove. &lt;/p&gt;\n\n&lt;p&gt;The point of living, from where I find myself today, is to live. To really live. To be. To exist. To find our own meaning. To find what is real for each of us. There is no language to my knowledge that can convey the meaning of life from one brain to another in one package, language is too limiting. I&amp;#39;m not waxing romantic here, its literally too limiting to convey it. We can hint at it, point at it, but the only way to find &amp;#39;the point&amp;#39; is to personally live, free from the bullshit we find ourselves programmed with. Basically what I&amp;#39;m saying is... keep going. Keep journeying. Keep seeking. The cynycism won&amp;#39;t last forever, because NOTHING lasts forever. Everything is temporary, coming and going. The point is the path. The expierence of life, and what you do with it. &lt;/p&gt;\n\n&lt;p&gt;I would suggest meditating with your feeling of cynicism, this feeling that hurts. The feeling of hurt itself, and why it is there. Not thinking it out and reasoning about it with your thoughts, but observing it with your awareness, the same way you observe in how you usually mediate (i&amp;#39;ll guess breath because it seems to be the most common). Sit with this feeling, if you can, and become familiar with it... learn it. Just a suggestion, I&amp;#39;m no expert!&lt;/p&gt;\n\n&lt;p&gt;I wish you luck and peace on your adventure c:&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg60ed6", "score_hidden": false, "stickied": false, "created": 1492039331.0, "created_utc": 1492010531.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg78b05", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lexxxgrace25", "parent_id": "t1_dg64sfk", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Wow. This is exactly what I needed. I have no words. Doing this in my head released all of my nihilistic induced anxiety. Just wow. Thank you kind stranger. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. This is exactly what I needed. I have no words. Doing this in my head released all of my nihilistic induced anxiety. Just wow. Thank you kind stranger. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg78b05", "score_hidden": false, "stickied": false, "created": 1492092516.0, "created_utc": 1492063716.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg64sfk", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "macjoven", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "There is a contemplation that I like to do occasionally when all my thinking about life the universe and everything becomes overwhelming: I imagine that I died five minutes ago. All my problems, all my stuff, all my accomplishments, all of my conclusions, all my money, all my relationships, all of my obligations, all of my identity and personality, all of it, everything, is gone, lost to me five minutes ago. \n\nYet here I am and I have no idea why or for how long. Everything I now have access too is a gift. If I ask \"Where did this apartment come from?\" people might say \"What are you talking about? You rent it, you earned that money and paid that landlord\" but it wasn't me. That guy who earned the money and paid the rent died five minutes ago. For me, this five minute year old, it is a gift, as is language, a working mind, this bank account, car and cats. \n\nIt is a beautiful contemplation. \n\nYou don't need to figure things out. Try looking at things freshly. Put the past behind you. Look.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a contemplation that I like to do occasionally when all my thinking about life the universe and everything becomes overwhelming: I imagine that I died five minutes ago. All my problems, all my stuff, all my accomplishments, all of my conclusions, all my money, all my relationships, all of my obligations, all of my identity and personality, all of it, everything, is gone, lost to me five minutes ago. &lt;/p&gt;\n\n&lt;p&gt;Yet here I am and I have no idea why or for how long. Everything I now have access too is a gift. If I ask &amp;quot;Where did this apartment come from?&amp;quot; people might say &amp;quot;What are you talking about? You rent it, you earned that money and paid that landlord&amp;quot; but it wasn&amp;#39;t me. That guy who earned the money and paid the rent died five minutes ago. For me, this five minute year old, it is a gift, as is language, a working mind, this bank account, car and cats. &lt;/p&gt;\n\n&lt;p&gt;It is a beautiful contemplation. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need to figure things out. Try looking at things freshly. Put the past behind you. Look.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg64sfk", "score_hidden": false, "stickied": false, "created": 1492044050.0, "created_utc": 1492015250.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7ohm2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MilkForBones", "parent_id": "t1_dg6xl0p", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "I agree. Whilst having these thoughts, kush does nothing more than fuel the fire. I think I'm gonna take a long long break until I can \"fix\" myself on my own. Without the help of these \"cheat drugs\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree. Whilst having these thoughts, kush does nothing more than fuel the fire. I think I&amp;#39;m gonna take a long long break until I can &amp;quot;fix&amp;quot; myself on my own. Without the help of these &amp;quot;cheat drugs&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7ohm2", "score_hidden": false, "stickied": false, "created": 1492125106.0, "created_utc": 1492096306.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6xl0p", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "skeeter1234", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Here is something I've concluded - pot is fucking horrible for people that have problems with nihilism.  It's essentially why I quit - because I would always start thinking about deep questions about the meaning of life, and you can *never* come to a definitive conclusion.  This creates nihilism, because it feels like since you can't come to a conclusion there isn't one.  It's a hall of mirrors.   \n\nHere's my advice.  Quit pot.  \n\nAlso, start an intense exercise routine.  Running, biking, or intense hiking.  It is by far the most important thing anyone can do for their mental health.   \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here is something I&amp;#39;ve concluded - pot is fucking horrible for people that have problems with nihilism.  It&amp;#39;s essentially why I quit - because I would always start thinking about deep questions about the meaning of life, and you can &lt;em&gt;never&lt;/em&gt; come to a definitive conclusion.  This creates nihilism, because it feels like since you can&amp;#39;t come to a conclusion there isn&amp;#39;t one.  It&amp;#39;s a hall of mirrors.   &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s my advice.  Quit pot.  &lt;/p&gt;\n\n&lt;p&gt;Also, start an intense exercise routine.  Running, biking, or intense hiking.  It is by far the most important thing anyone can do for their mental health.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg6xl0p", "score_hidden": false, "stickied": false, "created": 1492076236.0, "created_utc": 1492047436.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7nr94", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MilkForBones", "parent_id": "t1_dg6nhwv", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "&gt; But you are missing the other half of the question: \"Why do I want to die?\" This question is also unanswerable. By killing yourself, you are assuming that the purpose of life is death\n\nI'm at a loss for words, I honestly don't know what to say to this. Never did I think of it this way. Thank you. Thank you so much much for bringing this up. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But you are missing the other half of the question: &amp;quot;Why do I want to die?&amp;quot; This question is also unanswerable. By killing yourself, you are assuming that the purpose of life is death&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m at a loss for words, I honestly don&amp;#39;t know what to say to this. Never did I think of it this way. Thank you. Thank you so much much for bringing this up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7nr94", "score_hidden": false, "stickied": false, "created": 1492124300.0, "created_utc": 1492095500.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6nhwv", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "OneMeditator", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Be assured that the purpose of existence is not to suffer, nor is it to be joyous. Yes, suffering happens, and joy happens. Your suicidal desire is essentially a failed search for the question: \"Why do I want to live?\" You cannot answer it, so you want to kill yourself. But you are missing the other half of the question: \"Why do I want to die?\" This question is also unanswerable. By killing yourself, you are assuming that the purpose of life is death - but that is a wrong assumption. Life has its own intrinsic purpose - there is nothing external. *And that is the beauty of it*. Just live life for its own sake, for its enjoyment. Don't take life for granted. And remember, your death is something that will happen to your loved ones, not you. So keep your hands off of yourself. Be free and enjoy. And stay away from these drugs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Be assured that the purpose of existence is not to suffer, nor is it to be joyous. Yes, suffering happens, and joy happens. Your suicidal desire is essentially a failed search for the question: &amp;quot;Why do I want to live?&amp;quot; You cannot answer it, so you want to kill yourself. But you are missing the other half of the question: &amp;quot;Why do I want to die?&amp;quot; This question is also unanswerable. By killing yourself, you are assuming that the purpose of life is death - but that is a wrong assumption. Life has its own intrinsic purpose - there is nothing external. &lt;em&gt;And that is the beauty of it&lt;/em&gt;. Just live life for its own sake, for its enjoyment. Don&amp;#39;t take life for granted. And remember, your death is something that will happen to your loved ones, not you. So keep your hands off of yourself. Be free and enjoy. And stay away from these drugs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg6nhwv", "score_hidden": false, "stickied": false, "created": 1492063837.0, "created_utc": 1492035037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg62b6k", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "walker84", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "The true meaning of cynical, back there on the ancient greeks, was to be free from false ideals and false moralism at all costs. It was a pretty idea about what Man really needs to be happy. Today cynism its more related to nihilism and quiet despair. If you read your post again you will see that you know what you want, that it is to get out of the loop of pessimism and negativity. This its already a firts step to do this, I guess. There you are, talking to us about all those feelings, it's certainly a good thing.\n\nBTW - your trip remembered something I had long time ago about everybody dying someday and the smashing feel of despair, but I was on acid (first an last time), and man, there's nothing to be afraid: reality it's just how the things are when stripped from our desires of how it should be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The true meaning of cynical, back there on the ancient greeks, was to be free from false ideals and false moralism at all costs. It was a pretty idea about what Man really needs to be happy. Today cynism its more related to nihilism and quiet despair. If you read your post again you will see that you know what you want, that it is to get out of the loop of pessimism and negativity. This its already a firts step to do this, I guess. There you are, talking to us about all those feelings, it&amp;#39;s certainly a good thing.&lt;/p&gt;\n\n&lt;p&gt;BTW - your trip remembered something I had long time ago about everybody dying someday and the smashing feel of despair, but I was on acid (first an last time), and man, there&amp;#39;s nothing to be afraid: reality it&amp;#39;s just how the things are when stripped from our desires of how it should be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg62b6k", "score_hidden": false, "stickied": false, "created": 1492041426.0, "created_utc": 1492012626.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg62q6o", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lucifey", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "It sounds like you need to clear your mind and breathe. You're letting your thoughts about \"reality\" and \"the meaning of life\" control you and run wild. Look into mindfulness meditation and just try to accept each moment for what it is by staying in the present. \n\nYour mind and ego are searching for validation through meaning but it leads you nowhere, your thoughts running in circles while making you more and more miserable. Learn to use meditation to break free from the cycle. Acknowledge these thoughts and let them go because they don't inherently have any power over you except for the power you give them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you need to clear your mind and breathe. You&amp;#39;re letting your thoughts about &amp;quot;reality&amp;quot; and &amp;quot;the meaning of life&amp;quot; control you and run wild. Look into mindfulness meditation and just try to accept each moment for what it is by staying in the present. &lt;/p&gt;\n\n&lt;p&gt;Your mind and ego are searching for validation through meaning but it leads you nowhere, your thoughts running in circles while making you more and more miserable. Learn to use meditation to break free from the cycle. Acknowledge these thoughts and let them go because they don&amp;#39;t inherently have any power over you except for the power you give them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg62q6o", "score_hidden": false, "stickied": false, "created": 1492041871.0, "created_utc": 1492013071.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg6mvj6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Brother, just focus on the present moment. This alone is a positive intention as there is often not much happening now that can bring you fear, and whatever does come up you can simply breathe with and water the seed of equanimity in your mind. :)\n\nIf you are looking for the meaning of life, do self-enquiry. Ask yourself \"Who am I?\" This functions as a Zen koan that slowly and immediately reveals itself to varying degrees.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Brother, just focus on the present moment. This alone is a positive intention as there is often not much happening now that can bring you fear, and whatever does come up you can simply breathe with and water the seed of equanimity in your mind. :)&lt;/p&gt;\n\n&lt;p&gt;If you are looking for the meaning of life, do self-enquiry. Ask yourself &amp;quot;Who am I?&amp;quot; This functions as a Zen koan that slowly and immediately reveals itself to varying degrees.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg6mvj6", "score_hidden": false, "stickied": false, "created": 1492063069.0, "created_utc": 1492034269.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg6k95h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Iljitsch", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "I have had very similar problems during the last few years. Something that really helped me was listening to Alan Watts. You can listen to his speeches on youtube and I can recommend his book \"the book\". He gives you new perspectives on nihilism and existential questions. He also talks a lot about meditation and explains the buddhist and hindu point of view on these things. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have had very similar problems during the last few years. Something that really helped me was listening to Alan Watts. You can listen to his speeches on youtube and I can recommend his book &amp;quot;the book&amp;quot;. He gives you new perspectives on nihilism and existential questions. He also talks a lot about meditation and explains the buddhist and hindu point of view on these things. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg6k95h", "score_hidden": false, "stickied": false, "created": 1492059975.0, "created_utc": 1492031175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg6qqot", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elsee", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "I have a lot to say but I'm also stuck on mobile. First, I feel you, and like most, have experienced the same near bottomless dread of a brains anxieties. Your anxious thoughts need not persist though, there are things that can help you change your mindset. I strongly recommend looking up fear inventories online. They are a process that comes from AA (I think?) But I have found them immensely therapeutic. You write down and itemize all your anxieties. What you are experiencing in current fear. Read it back to yourself after, and reflect on each fear. Confront it. At the end, recite a little prayer (or mantra or what have you, need not be religious), then tear that list a part, light it on fire, eat it, whatever. Then meditate and reflect. \n\n\nI usually feel wonderful after doing this and I use it often in times of stress.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a lot to say but I&amp;#39;m also stuck on mobile. First, I feel you, and like most, have experienced the same near bottomless dread of a brains anxieties. Your anxious thoughts need not persist though, there are things that can help you change your mindset. I strongly recommend looking up fear inventories online. They are a process that comes from AA (I think?) But I have found them immensely therapeutic. You write down and itemize all your anxieties. What you are experiencing in current fear. Read it back to yourself after, and reflect on each fear. Confront it. At the end, recite a little prayer (or mantra or what have you, need not be religious), then tear that list a part, light it on fire, eat it, whatever. Then meditate and reflect. &lt;/p&gt;\n\n&lt;p&gt;I usually feel wonderful after doing this and I use it often in times of stress.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg6qqot", "score_hidden": false, "stickied": false, "created": 1492067872.0, "created_utc": 1492039072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg6qqp8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elsee", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "I have a lot to say but I'm also stuck on mobile. First, I feel you, and like most, have experienced the same near bottomless dread of a brains anxieties. Your anxious thoughts need not persist though, there are things that can help you change your mindset. I strongly recommend looking up fear inventories online. They are a process that comes from AA (I think?) But I have found them immensely therapeutic. You write down and itemize all your anxieties. What you are experiencing in current fear. Read it back to yourself after, and reflect on each fear. Confront it. At the end, recite a little prayer (or mantra or what have you, need not be religious), then tear that list a part, light it on fire, eat it, whatever. Then meditate and reflect. \n\n\nI usually feel wonderful after doing this and I use it often in times of stress.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a lot to say but I&amp;#39;m also stuck on mobile. First, I feel you, and like most, have experienced the same near bottomless dread of a brains anxieties. Your anxious thoughts need not persist though, there are things that can help you change your mindset. I strongly recommend looking up fear inventories online. They are a process that comes from AA (I think?) But I have found them immensely therapeutic. You write down and itemize all your anxieties. What you are experiencing in current fear. Read it back to yourself after, and reflect on each fear. Confront it. At the end, recite a little prayer (or mantra or what have you, need not be religious), then tear that list a part, light it on fire, eat it, whatever. Then meditate and reflect. &lt;/p&gt;\n\n&lt;p&gt;I usually feel wonderful after doing this and I use it often in times of stress.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg6qqp8", "score_hidden": false, "stickied": false, "created": 1492067872.0, "created_utc": 1492039072.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg70yya", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "OmSpark", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Go check out Teal Swan's [Youtube channel](https://www.youtube.com/user/TheSpiritualCatalyst). She's got some of the best advice on how to deal with negative situations.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go check out Teal Swan&amp;#39;s &lt;a href=\"https://www.youtube.com/user/TheSpiritualCatalyst\"&gt;Youtube channel&lt;/a&gt;. She&amp;#39;s got some of the best advice on how to deal with negative situations.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg70yya", "score_hidden": false, "stickied": false, "created": 1492080485.0, "created_utc": 1492051685.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg8pold", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "average_jacuzzi", "parent_id": "t1_dg7ox5j", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Easier said than done for sure. Ignorance is comfortable, I would say there is absolutely nothing wrong with your curiosity, for our sanities' sake I think its just a matter of finding the balance of discovering this life in a way which doesn't cause us to suffer more than we need or to over-indulge in our biases. You got it friend!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Easier said than done for sure. Ignorance is comfortable, I would say there is absolutely nothing wrong with your curiosity, for our sanities&amp;#39; sake I think its just a matter of finding the balance of discovering this life in a way which doesn&amp;#39;t cause us to suffer more than we need or to over-indulge in our biases. You got it friend!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg8pold", "score_hidden": false, "stickied": false, "created": 1492170260.0, "created_utc": 1492141460.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7ox5j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MilkForBones", "parent_id": "t1_dg79p4m", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "&gt; Life and death isn't a problem to be solved, even if you were to come to an answer, it would only inspire new questions and mysteries. Thats the awesome and sometimes unsettling nature of infinity.\n\nYou're so right about this. I really need to just let go. This wild goose chase is going to do nothing for me other than bring more anxiety and fear of the unknown. \n\nYeah infinity is a very very abstract idea and just as terrifying as it is, it is beautiful. In my previous less terrifying trips, I came to truly appreciate the wonders of life and its unknowns. I realize the less I want to know about it and just go with it, the happier I am. I guess ignorance truly is bliss. Thank you for your post, it's quite consoling :)\n", "edited": 1492097050.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Life and death isn&amp;#39;t a problem to be solved, even if you were to come to an answer, it would only inspire new questions and mysteries. Thats the awesome and sometimes unsettling nature of infinity.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re so right about this. I really need to just let go. This wild goose chase is going to do nothing for me other than bring more anxiety and fear of the unknown. &lt;/p&gt;\n\n&lt;p&gt;Yeah infinity is a very very abstract idea and just as terrifying as it is, it is beautiful. In my previous less terrifying trips, I came to truly appreciate the wonders of life and its unknowns. I realize the less I want to know about it and just go with it, the happier I am. I guess ignorance truly is bliss. Thank you for your post, it&amp;#39;s quite consoling :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7ox5j", "score_hidden": false, "stickied": false, "created": 1492125583.0, "created_utc": 1492096783.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg79p4m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "average_jacuzzi", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Life and death isn't a problem to be solved, even if you were to come to an answer, it would only inspire new questions and mysteries. Thats the awesome and sometimes unsettling nature of infinity. I personally receive more truth when I surrender the pursuit to possess the finality that i believe an answer would bring me. That finality is an illusion, because again, when you arrive at answer you've really just arrived at a new set of questions. Better to listen than to assert an understanding. It's not a game to win, its an experience to experience. Personally I believe we are here to learn. I have shared the experience you described of being god, and that life force flowing through all people, as well as the suffering. And that is a hell of thing to experience and integrate, don't be too hard on yourself. But there are some beautiful insights within that experience, no? Find power within the things inside your domain: your choice, your breath, your word, your intention. There is surely suffering, but this life has so so much to offer when you show it love. Wish you all the best, everything comes around sooner or later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Life and death isn&amp;#39;t a problem to be solved, even if you were to come to an answer, it would only inspire new questions and mysteries. Thats the awesome and sometimes unsettling nature of infinity. I personally receive more truth when I surrender the pursuit to possess the finality that i believe an answer would bring me. That finality is an illusion, because again, when you arrive at answer you&amp;#39;ve really just arrived at a new set of questions. Better to listen than to assert an understanding. It&amp;#39;s not a game to win, its an experience to experience. Personally I believe we are here to learn. I have shared the experience you described of being god, and that life force flowing through all people, as well as the suffering. And that is a hell of thing to experience and integrate, don&amp;#39;t be too hard on yourself. But there are some beautiful insights within that experience, no? Find power within the things inside your domain: your choice, your breath, your word, your intention. There is surely suffering, but this life has so so much to offer when you show it love. Wish you all the best, everything comes around sooner or later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg79p4m", "score_hidden": false, "stickied": false, "created": 1492096016.0, "created_utc": 1492067216.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7deaj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Ascensus", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "The point of being alive is just to be alive. Life is not words, so some sentence about what the meaning of life is would be a symbol and not the meaning of life. Does music have any meaning other than the music itself?\n\nhttps://www.youtube.com/watch?v=21RwqnB8GrE", "edited": 1492078924.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The point of being alive is just to be alive. Life is not words, so some sentence about what the meaning of life is would be a symbol and not the meaning of life. Does music have any meaning other than the music itself?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=21RwqnB8GrE\"&gt;https://www.youtube.com/watch?v=21RwqnB8GrE&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7deaj", "score_hidden": false, "stickied": false, "created": 1492106968.0, "created_utc": 1492078168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7doxj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "toweltig", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "The whole nature of life as far as we know it, seems to be a result of \"dead\" particles/matter interacting in ways that  gives rise to entities with a basic sense of reality, of course this process got a lot more complex through time and we know it's possible for these unalive interactions to become aware of existence, to do a lot more than just eat, sleep, reproduce and defecate. To actually have a sense of self and a sense of identity. No other animal or creature has the intellect we do and I think that addressing the question of purpose is a really important part of understanding ourselves. Yes, life may simply be a result of complex interactions that lead to something completely  the opposite of death or non-life, but it's the way you look at the process that matters. It's really up to you then to think it's all meaningless and continue your suffering or instead acknowledge the beauty of the whole process whatever this is and have unconditional love for not just others, but the whole process of reality. We are not separate from nature or reality and we are not a part of it either, we ARE the process. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The whole nature of life as far as we know it, seems to be a result of &amp;quot;dead&amp;quot; particles/matter interacting in ways that  gives rise to entities with a basic sense of reality, of course this process got a lot more complex through time and we know it&amp;#39;s possible for these unalive interactions to become aware of existence, to do a lot more than just eat, sleep, reproduce and defecate. To actually have a sense of self and a sense of identity. No other animal or creature has the intellect we do and I think that addressing the question of purpose is a really important part of understanding ourselves. Yes, life may simply be a result of complex interactions that lead to something completely  the opposite of death or non-life, but it&amp;#39;s the way you look at the process that matters. It&amp;#39;s really up to you then to think it&amp;#39;s all meaningless and continue your suffering or instead acknowledge the beauty of the whole process whatever this is and have unconditional love for not just others, but the whole process of reality. We are not separate from nature or reality and we are not a part of it either, we ARE the process. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7doxj", "score_hidden": false, "stickied": false, "created": 1492107853.0, "created_utc": 1492079053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dg7odb8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MilkForBones", "parent_id": "t1_dg7hh51", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "&gt; Change what you can, accept what you can't.\n\nThis is something that I've sort of been trying to do for the past month, and I feel I've made some progress. It's such a relief to just kick back and not give a shit about the unknown. \n\n&gt; nihilism is the realization that there is no good and bad\n\nAnother thing I experienced during my trip was the fear of the animals which are mutilated for us in the meat factories, the frustration of their hopelessness, how they know they are going to die and they can do nothing but wait for it and fight with their life when their time comes. Or the fact that world hunger could be cured if we stopped feeding the animals we kill and fed the poor and helpless. \n\nI always just thought that it's okay, Karma will come for them and good will happen. But it won't. Nothing fucking matters. A lot of my anxiety stemmed from what you said about good and bad being an illusion, and it's been so so fucking hard to get over it. \n\nI have started to get over it though, unfortunately by not giving a fuck. I want to care for the beings which are suffering, but it's just too much I guess. \n\nThank you for this post. I can resonate with a lot of what you said. It feels good to see that others have suffered the same feeling I am with, but have managed to overcome it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Change what you can, accept what you can&amp;#39;t.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is something that I&amp;#39;ve sort of been trying to do for the past month, and I feel I&amp;#39;ve made some progress. It&amp;#39;s such a relief to just kick back and not give a shit about the unknown. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;nihilism is the realization that there is no good and bad&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Another thing I experienced during my trip was the fear of the animals which are mutilated for us in the meat factories, the frustration of their hopelessness, how they know they are going to die and they can do nothing but wait for it and fight with their life when their time comes. Or the fact that world hunger could be cured if we stopped feeding the animals we kill and fed the poor and helpless. &lt;/p&gt;\n\n&lt;p&gt;I always just thought that it&amp;#39;s okay, Karma will come for them and good will happen. But it won&amp;#39;t. Nothing fucking matters. A lot of my anxiety stemmed from what you said about good and bad being an illusion, and it&amp;#39;s been so so fucking hard to get over it. &lt;/p&gt;\n\n&lt;p&gt;I have started to get over it though, unfortunately by not giving a fuck. I want to care for the beings which are suffering, but it&amp;#39;s just too much I guess. &lt;/p&gt;\n\n&lt;p&gt;Thank you for this post. I can resonate with a lot of what you said. It feels good to see that others have suffered the same feeling I am with, but have managed to overcome it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7odb8", "score_hidden": false, "stickied": false, "created": 1492124974.0, "created_utc": 1492096174.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7hh51", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Un-discovered", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "I went through a roller coaster of nihilism while on lsd. Unfortunately, you were caught in phase 1, which is that everything that exists has no destiny or purpose. Everything simply exists, including us. The beauty with having no predetermined path is that you get to make your own! Yes, we live in a society filled with societal constructs, which we have to abide by, such as laws. But, that doesn't diminish the beauty of being aware that our lives have no point and that we control how we want it to play this game. Just exist, the rest is bonus. It's beautiful how anything exists at all. I tell myself those two sentences when I'm feeling overwhelmed or depressed. My favorite perspective in regards to nihilism is the realization that there is no good and bad (this fucked me up a bit). They are societal contructs. At the end of the day every person is living their life in a way they believe is best for them. That's great news for us! We don't have to bully ourselves or try to please others, we just get to live our lives in a way we desire. \n\nI'm sure you are aware about how crazy the brain is, how altering it's chemistry results in an entirely different perception of reality, and more importantly that we have this \"mind\" and because of it we have the freedom of choice. This is the human experience in a nutshell (credit to REBT therapy) : a thought arises or an external event occurs (A), we throw our beliefs (B) onto A, our beliefs then drive our reaction to A. At the end of the day I am able to choose my beliefs, and therefore how I want to live. It's way easier said than done, but practice makes perfect. \n\nThe next thing is to realize life is as simple as you make it. We really do complicate shit for ourselves, but it's not our fault. How can someone see the simplicity of life, when they are bombarded by things deemed to be complications from the beginning. Everything is simply actions and outcomes and everything can be broken down into smaller steps. Change what you can, accept what you can't. \n\nAt the end of the day we are guests to life. You are allowed to do whatever you want with your life. I obviously don't want you to kill yourself, but as an example it wouldn't be \"wrong\" of you to do so. It's your one life experience... Even if it means nothing, even if there is something after death, why not enjoy this life experience in whatever way you desire, and take solace in the idea that when you die you will solve your curiosity in regards to death. It would be dope to die then live again. It would also be \"serene\" to die and fade into nothingness. \n\nFeel free to pm me if you'd like to talk. I love these kinds of conversations", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through a roller coaster of nihilism while on lsd. Unfortunately, you were caught in phase 1, which is that everything that exists has no destiny or purpose. Everything simply exists, including us. The beauty with having no predetermined path is that you get to make your own! Yes, we live in a society filled with societal constructs, which we have to abide by, such as laws. But, that doesn&amp;#39;t diminish the beauty of being aware that our lives have no point and that we control how we want it to play this game. Just exist, the rest is bonus. It&amp;#39;s beautiful how anything exists at all. I tell myself those two sentences when I&amp;#39;m feeling overwhelmed or depressed. My favorite perspective in regards to nihilism is the realization that there is no good and bad (this fucked me up a bit). They are societal contructs. At the end of the day every person is living their life in a way they believe is best for them. That&amp;#39;s great news for us! We don&amp;#39;t have to bully ourselves or try to please others, we just get to live our lives in a way we desire. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sure you are aware about how crazy the brain is, how altering it&amp;#39;s chemistry results in an entirely different perception of reality, and more importantly that we have this &amp;quot;mind&amp;quot; and because of it we have the freedom of choice. This is the human experience in a nutshell (credit to REBT therapy) : a thought arises or an external event occurs (A), we throw our beliefs (B) onto A, our beliefs then drive our reaction to A. At the end of the day I am able to choose my beliefs, and therefore how I want to live. It&amp;#39;s way easier said than done, but practice makes perfect. &lt;/p&gt;\n\n&lt;p&gt;The next thing is to realize life is as simple as you make it. We really do complicate shit for ourselves, but it&amp;#39;s not our fault. How can someone see the simplicity of life, when they are bombarded by things deemed to be complications from the beginning. Everything is simply actions and outcomes and everything can be broken down into smaller steps. Change what you can, accept what you can&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;At the end of the day we are guests to life. You are allowed to do whatever you want with your life. I obviously don&amp;#39;t want you to kill yourself, but as an example it wouldn&amp;#39;t be &amp;quot;wrong&amp;quot; of you to do so. It&amp;#39;s your one life experience... Even if it means nothing, even if there is something after death, why not enjoy this life experience in whatever way you desire, and take solace in the idea that when you die you will solve your curiosity in regards to death. It would be dope to die then live again. It would also be &amp;quot;serene&amp;quot; to die and fade into nothingness. &lt;/p&gt;\n\n&lt;p&gt;Feel free to pm me if you&amp;#39;d like to talk. I love these kinds of conversations&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dg7hh51", "score_hidden": false, "stickied": false, "created": 1492116135.0, "created_utc": 1492087335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_64yhdy", "likes": null, "replies": "", "user_reports": [], "id": "dgcdkvq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GhostsOnly", "parent_id": "t3_64yhdy", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "My daily life is the healthy version of that. Healthy as in, it's normal for me because I'm an INFJ.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My daily life is the healthy version of that. Healthy as in, it&amp;#39;s normal for me because I&amp;#39;m an INFJ.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dgcdkvq", "score_hidden": false, "stickied": false, "created": 1492396179.0, "created_utc": 1492367379.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]