[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Meditation", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I need to tell someone who&amp;#39;ll understand what I just experienced.&lt;/p&gt;\n\n&lt;p&gt;I was doing the Focus series on the Headspace app and I wasn&amp;#39;t very interested in the exercise on the first day. Halfway through today I realized that the points where my focus rested were the same places that I&amp;#39;ve seen in depictions of chakras. By the time I had made this realization the instructor said to let go of all focus and I felt a profound rush of both relaxation and awareness. I saw a second pair of eyes open (as if they were my own) and I could only see pure white. I felt a head rush, like my consciousness was swelling out of my skin. It was so unexpected it almost forced my eyes open.&lt;/p&gt;\n\n&lt;p&gt;When my focus returned to my body it was different. I noticed the bugs flying around, and one of them landed on me. I enjoyed their company but they started crawling up towards my face. Being a tad squeamish around bugs I tried to blow him away with my breath and shake him off. He kept his trek upward and I reacted by quickly flicking him off of me. When I noticed his unmoving body on my lap I felt like a murderer. I&amp;#39;ve never felt this way when meditating before, but needless to say I&amp;#39;ve never been more excited to meditate again.&lt;/p&gt;\n\n&lt;p&gt;Sorry if I&amp;#39;m rambling, I&amp;#39;m still pretty shaken from the experience.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I need to tell someone who'll understand what I just experienced.\n\nI was doing the Focus series on the Headspace app and I wasn't very interested in the exercise on the first day. Halfway through today I realized that the points where my focus rested were the same places that I've seen in depictions of chakras. By the time I had made this realization the instructor said to let go of all focus and I felt a profound rush of both relaxation and awareness. I saw a second pair of eyes open (as if they were my own) and I could only see pure white. I felt a head rush, like my consciousness was swelling out of my skin. It was so unexpected it almost forced my eyes open.\n\nWhen my focus returned to my body it was different. I noticed the bugs flying around, and one of them landed on me. I enjoyed their company but they started crawling up towards my face. Being a tad squeamish around bugs I tried to blow him away with my breath and shake him off. He kept his trek upward and I reacted by quickly flicking him off of me. When I noticed his unmoving body on my lap I felt like a murderer. I've never felt this way when meditating before, but needless to say I've never been more excited to meditate again.\n\nSorry if I'm rambling, I'm still pretty shaken from the experience.", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65lp2l", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "TEARRIER-Box", "saved": false, "mod_reports": [], "name": "t3_65lp2l", "subreddit_name_prefixed": "r/Meditation", "approved_by": null, "over_18": false, "domain": "self.Meditation", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qnc9", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Meditation/comments/65lp2l/i_need_to_talk_about_my_experience_headspace/", "num_reports": null, "locked": false, "stickied": false, "created": 1492322297.0, "url": "https://www.reddit.com/r/Meditation/comments/65lp2l/i_need_to_talk_about_my_experience_headspace/", "author_flair_text": null, "quarantine": false, "title": "I need to talk about my experience. [Headspace]", "created_utc": 1492293497.0, "distinguished": null, "media": null, "upvote_ratio": 0.75, "num_comments": 2, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_65lp2l", "likes": null, "replies": "", "user_reports": [], "id": "dgbw6p0", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "CharlieLima", "parent_id": "t3_65lp2l", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "I've had similar experiences as well. Had a time a couple of years ago when I felt really connected to nature and literally saw my self in the trees and animals.\n\nDon't want to make you disappointed, but eventually the feeling will pass and something else will appear. That's the nature of mind. I would actually recommend to try investigate in the thought/feeling of excitement you talk about. If you attach to this feeling, you'll unfortunately end up being attached to \"unmotivation\" and \"boredom\".\n\nGood luck on your journey! I wish you well!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had similar experiences as well. Had a time a couple of years ago when I felt really connected to nature and literally saw my self in the trees and animals.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t want to make you disappointed, but eventually the feeling will pass and something else will appear. That&amp;#39;s the nature of mind. I would actually recommend to try investigate in the thought/feeling of excitement you talk about. If you attach to this feeling, you&amp;#39;ll unfortunately end up being attached to &amp;quot;unmotivation&amp;quot; and &amp;quot;boredom&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Good luck on your journey! I wish you well!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dgbw6p0", "score_hidden": false, "stickied": false, "created": 1492365310.0, "created_utc": 1492336510.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_65lp2l", "likes": null, "replies": "", "user_reports": [], "id": "dgctcoc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "AnElementaryParticle", "parent_id": "t3_65lp2l", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "That's great, I hope it motivates you to continue. Many meditation traditions in the Buddhist context at least have a similar approach to these occasional unusual or novel phenomena (as distinct to what might be classed as recognisable benchmark experiences in stages of certain traditions). They can be fascinating, interesting and novel but don't get too caught up in them. Note them and let them go. One thing you might realise if you continue is that the mind is amazing. It can create all sorts of subjective experiences and as you look closer even more may occur. Trying to analyse and seek a deep meaning in all of them can be a fruitless pursuit as we are all very different and unique individuals, we might all be travelling the same road but each mind is it's own unique one of a kind vehicle. It can be like asking others to explain your dreams I suppose, some are interesting and informative, others random wacky and pointless to note or remember. An outside observer can only guess. So enjoy those experiences but don't get too attached to them. That can sometimes set up a sort of conditional mindstate where you start to crave 'novel' experiences. You want to keep the attitude where if nothing happens in your meditation that's fine, if something novel occurs that's fine too, then let it go. But of course you can appreciate it and let it motivate you to continue!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s great, I hope it motivates you to continue. Many meditation traditions in the Buddhist context at least have a similar approach to these occasional unusual or novel phenomena (as distinct to what might be classed as recognisable benchmark experiences in stages of certain traditions). They can be fascinating, interesting and novel but don&amp;#39;t get too caught up in them. Note them and let them go. One thing you might realise if you continue is that the mind is amazing. It can create all sorts of subjective experiences and as you look closer even more may occur. Trying to analyse and seek a deep meaning in all of them can be a fruitless pursuit as we are all very different and unique individuals, we might all be travelling the same road but each mind is it&amp;#39;s own unique one of a kind vehicle. It can be like asking others to explain your dreams I suppose, some are interesting and informative, others random wacky and pointless to note or remember. An outside observer can only guess. So enjoy those experiences but don&amp;#39;t get too attached to them. That can sometimes set up a sort of conditional mindstate where you start to crave &amp;#39;novel&amp;#39; experiences. You want to keep the attitude where if nothing happens in your meditation that&amp;#39;s fine, if something novel occurs that&amp;#39;s fine too, then let it go. But of course you can appreciate it and let it motivate you to continue!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dgctcoc", "score_hidden": false, "stickied": false, "created": 1492417174.0, "created_utc": 1492388374.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]