[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "Meditation", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello all,&lt;/p&gt;\n\n&lt;p&gt;I hope all is well with you!! I was wondering if I could get some advice on how to approach living with my inner voice. I practice vipassana 20-30 minutes minimum daily, for over a year now. I would estimate that I am around stage 5 along my path if you&amp;#39;re working off the Mind Illuminated interpretation of it. I am past my &amp;quot;peak&amp;quot; experience having experienced that totally glorious euphoric jhana that opens up your mind to the greater world and makes you feel connected to all in peace and compassion. Someone I was talking to a few weeks ago suggested that I might be going through the Dark Night of the Soul but I&amp;#39;m personally not attaching myself to that concept at the moment. I have been having a hard time meditating lately - that is true - and the fruits of my meditation have been less than &amp;quot;blissful&amp;quot; but I don&amp;#39;t want to over-analyze and interpret my experience. &lt;/p&gt;\n\n&lt;p&gt;Back to the specifics. Throughout my meditation, I have become increasingly aware of my inner voice. It&amp;#39;s there when I read (it mutters the words my eyes see) and there when I need to do task (&amp;quot;Ooohh this feels nice!&amp;quot;). Lately, I&amp;#39;ve been really wanting to live without it and I want to get to a point where I don&amp;#39;t have a constant sort of &amp;quot;feedback&amp;quot; voice with everything that I do. I&amp;#39;ve noticed it really trips me up when I&amp;#39;m not at my best and sends me into an anxious spiral that can start with something like &amp;quot;Was that dumb? Did I ruin this opportunity?&amp;quot; and then I have a sort of self-critical, hyper-aware sort of analysis of everything that I did. I&amp;#39;ve learned that self-criticism is a mental pattern that I have (internal dialog about how I can be better) and I&amp;#39;ve come to realize that it&amp;#39;s a form of self-punishment based on the thought of not being &amp;quot;good enough&amp;quot; that I think I acquired during my childhood through an interpretation that I was being treated &amp;quot;poorly&amp;quot; and &amp;quot;unjustly&amp;quot; by my brother and becoming aware of this interpretation of myself has lessened my anxiety considerably.&lt;/p&gt;\n\n&lt;p&gt;Important note, I&amp;#39;m really scared someone is going to say I&amp;#39;m schizophrenic because that&amp;#39;s what I heard of schizo people all my life - that they hear voices - and that meditation has a tendency to bring out preexisting mental disorders that might have been dormant. I believe I&amp;#39;m just a really anxious person that&amp;#39;s also really aware of my mental chatter. &lt;/p&gt;\n\n&lt;p&gt;Back to the inner voice issue, at this point, it&amp;#39;s mostly just a sort of &amp;quot;narration&amp;quot; and I have control over it when I want it to stop. I&amp;#39;m mostly aware of it and I can catch it before it takes on a life of its own. But the problem is that it&amp;#39;s there often in the slightest of ways and it worries me a little (kind of anxious about it even as I type because I&amp;#39;m aware of the mental murmuring of the words as I&amp;#39;m typing) and I don&amp;#39;t know how to kind of &amp;quot;accept&amp;quot; it. It doesn&amp;#39;t seem natural somehow. The way that I&amp;#39;m approaching it now is &amp;quot;It&amp;#39;s just there. It&amp;#39;s a friend. Acknowledge that it&amp;#39;s there, don&amp;#39;t resist, it&amp;#39;s a part of being aware.&amp;quot; and it&amp;#39;s been working well, I try not to see it as a problem, but I&amp;#39;m not actually sure if this is correct especially since it can contribute to feelings on anxiety if I find myself feeling bad. Is this normal? Should there be a goal of eliminating it? Can someone guide me on the correct way of dealing with my inner voice? &lt;/p&gt;\n\n&lt;p&gt;Thank you so much in advance :)))) &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello all,\n\nI hope all is well with you!! I was wondering if I could get some advice on how to approach living with my inner voice. I practice vipassana 20-30 minutes minimum daily, for over a year now. I would estimate that I am around stage 5 along my path if you're working off the Mind Illuminated interpretation of it. I am past my \"peak\" experience having experienced that totally glorious euphoric jhana that opens up your mind to the greater world and makes you feel connected to all in peace and compassion. Someone I was talking to a few weeks ago suggested that I might be going through the Dark Night of the Soul but I'm personally not attaching myself to that concept at the moment. I have been having a hard time meditating lately - that is true - and the fruits of my meditation have been less than \"blissful\" but I don't want to over-analyze and interpret my experience. \n\nBack to the specifics. Throughout my meditation, I have become increasingly aware of my inner voice. It's there when I read (it mutters the words my eyes see) and there when I need to do task (\"Ooohh this feels nice!\"). Lately, I've been really wanting to live without it and I want to get to a point where I don't have a constant sort of \"feedback\" voice with everything that I do. I've noticed it really trips me up when I'm not at my best and sends me into an anxious spiral that can start with something like \"Was that dumb? Did I ruin this opportunity?\" and then I have a sort of self-critical, hyper-aware sort of analysis of everything that I did. I've learned that self-criticism is a mental pattern that I have (internal dialog about how I can be better) and I've come to realize that it's a form of self-punishment based on the thought of not being \"good enough\" that I think I acquired during my childhood through an interpretation that I was being treated \"poorly\" and \"unjustly\" by my brother and becoming aware of this interpretation of myself has lessened my anxiety considerably.\n\nImportant note, I'm really scared someone is going to say I'm schizophrenic because that's what I heard of schizo people all my life - that they hear voices - and that meditation has a tendency to bring out preexisting mental disorders that might have been dormant. I believe I'm just a really anxious person that's also really aware of my mental chatter. \n\nBack to the inner voice issue, at this point, it's mostly just a sort of \"narration\" and I have control over it when I want it to stop. I'm mostly aware of it and I can catch it before it takes on a life of its own. But the problem is that it's there often in the slightest of ways and it worries me a little (kind of anxious about it even as I type because I'm aware of the mental murmuring of the words as I'm typing) and I don't know how to kind of \"accept\" it. It doesn't seem natural somehow. The way that I'm approaching it now is \"It's just there. It's a friend. Acknowledge that it's there, don't resist, it's a part of being aware.\" and it's been working well, I try not to see it as a problem, but I'm not actually sure if this is correct especially since it can contribute to feelings on anxiety if I find myself feeling bad. Is this normal? Should there be a goal of eliminating it? Can someone guide me on the correct way of dealing with my inner voice? \n\nThank you so much in advance :)))) ", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "65wonw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 4, "report_reasons": null, "author": "DaleNanton", "saved": false, "mod_reports": [], "name": "t3_65wonw", "subreddit_name_prefixed": "r/Meditation", "approved_by": null, "over_18": false, "domain": "self.Meditation", "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qnc9", "edited": 1492447702.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/Meditation/comments/65wonw/i_get_confused_about_how_to_approach_my_inner/", "num_reports": null, "locked": false, "stickied": false, "created": 1492476132.0, "url": "https://www.reddit.com/r/Meditation/comments/65wonw/i_get_confused_about_how_to_approach_my_inner/", "author_flair_text": null, "quarantine": false, "title": "I get confused about how to approach my inner voice", "created_utc": 1492447332.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 3, "visited": false, "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_65wonw", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_65wonw", "likes": null, "replies": "", "user_reports": [], "id": "dgejlqx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lSl", "parent_id": "t1_dgds2zp", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Reading mindfulness books specifically for anxiety helped me. Search Amazon for \"mindfulness for anxiety\" and pick one that appeals to you. These books provide psychological context and a structured program for using meditation techniques to address anxiety. So it'll be more effective than learning general meditation techniques and figuring out how to apply them to anxiety by yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading mindfulness books specifically for anxiety helped me. Search Amazon for &amp;quot;mindfulness for anxiety&amp;quot; and pick one that appeals to you. These books provide psychological context and a structured program for using meditation techniques to address anxiety. So it&amp;#39;ll be more effective than learning general meditation techniques and figuring out how to apply them to anxiety by yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dgejlqx", "score_hidden": false, "stickied": false, "created": 1492510927.0, "created_utc": 1492482127.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dgds2zp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "DaleNanton", "parent_id": "t3_65wonw", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Another question that I have: is it generally a good idea to try and \"meditate away\" anxiety? When I find myself in an over-thinking spiral, is it better to let it pass naturally or should I try to and meditate? I've noticed if I'm anxious and sit down, it often gets worse (my thoughts just really pop up one after the other) and I try avoiding doing that but also not sure if I'm inhibiting my own progress by avoiding an \"uncomfortable\" mental state. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another question that I have: is it generally a good idea to try and &amp;quot;meditate away&amp;quot; anxiety? When I find myself in an over-thinking spiral, is it better to let it pass naturally or should I try to and meditate? I&amp;#39;ve noticed if I&amp;#39;m anxious and sit down, it often gets worse (my thoughts just really pop up one after the other) and I try avoiding doing that but also not sure if I&amp;#39;m inhibiting my own progress by avoiding an &amp;quot;uncomfortable&amp;quot; mental state. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dgds2zp", "score_hidden": false, "stickied": false, "created": 1492478109.0, "created_utc": 1492449309.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qnc9", "removal_reason": null, "link_id": "t3_65wonw", "likes": null, "replies": "", "user_reports": [], "id": "dgejfga", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lSl", "parent_id": "t3_65wonw", "subreddit_name_prefixed": "r/Meditation", "controversiality": 0, "body": "Shinzen Young has some vipassana techniques for this as part of his [mindfulness framework](http://www.shinzen.org/wp-content/uploads/2016/08/FiveWaystoKnowYourself_ver1.6.pdf). Your inner voice would be labeled \"hear in\" and internal images would be \"see in\" (as opposed to external sounds as \"hear out\" and external sights as \"see out\"). \n\n\"The goal\" is not to eliminate it but more like being able to watch it clearly without getting caught up in it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shinzen Young has some vipassana techniques for this as part of his &lt;a href=\"http://www.shinzen.org/wp-content/uploads/2016/08/FiveWaystoKnowYourself_ver1.6.pdf\"&gt;mindfulness framework&lt;/a&gt;. Your inner voice would be labeled &amp;quot;hear in&amp;quot; and internal images would be &amp;quot;see in&amp;quot; (as opposed to external sounds as &amp;quot;hear out&amp;quot; and external sights as &amp;quot;see out&amp;quot;). &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The goal&amp;quot; is not to eliminate it but more like being able to watch it clearly without getting caught up in it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "Meditation", "name": "t1_dgejfga", "score_hidden": false, "stickied": false, "created": 1492510722.0, "created_utc": 1492481922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]