[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Biology", "id": "64uz0s", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1327, "report_reasons": null, "author": "nybiggs", "saved": false, "mod_reports": [], "name": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Biology", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/64uz0s/eli5_why_do_so_many_people_believe_that_if_your/", "num_reports": null, "locked": false, "stickied": false, "created": 1491986797.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/64uz0s/eli5_why_do_so_many_people_believe_that_if_your/", "author_flair_text": null, "quarantine": false, "title": "ELI5: Why do so many people believe that if your urine isn't clear you aren't drinking enough water and is there any truth to it?", "created_utc": 1491957997.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 205, "visited": false, "subreddit_type": "public", "ups": 1327}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5d9f8", "gilded": 0, "archived": false, "score": 850, "report_reasons": null, "author": "henrykazuka", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Your kidneys produce urine by filtering your blood stream. Urine is made of water, salt and wastes like urea and acid, among other things.\n\n But your kidney isn't like your dumbass intestine which absorbs every single hamburger you ate at McDonald's and keeps it all in the form of fat. No, no, your kidney is smart and knows what should be kept and what should be discarded. This is done through a completely overly complicated system (which medicine students hate) that senses what do you have, what you don't need and what you really need. \n\nIf you decide to drink 7 liters of water because someone dared you or something, then you are going to [die ](http://articles.latimes.com/2007/jan/14/local/me-water14&amp;sa=U&amp;ved=0ahUKEwjXxoDNg6DTAhULkpAKHTLPDHQQFggOMAE&amp;sig2=1COwxLl2klYxd_9YLs3fcw&amp;usg=AFQjCNHVxRFcHQ2R0SKsjh58N0_lBfAS7A)(first from the alteration of your, hydroelectric balance, then because from the embarrassment of appearing on YouTube \"Pranks gone wrong\"). But if you manage to survive, then you are going to pee mostly water. If you decide to dehydrate yourself because you heard it was a good way to lose weight (pro tip: it's not), your kidney will try to keep as much water as it can inside your blood stream while filtering everything else so your pee will look very dark or worse, you don't pee at all and keep all the wastes inside you. \"The composition of the body fluids is apparently determined not by what the mouth takes in, but by what the kidney keeps\"*\n\nYour body is smart but it isn't magical. If you do stupid stuff like I mentioned earlier you are overworking it, so to answer your question: it's not good to have it too clear or too dark. \"Normal urine color ranges from pale yellow to deep amber — the result of a pigment called urochrome and how diluted or concentrated the urine is.\"**\n\nBut since you are constantly losing liquids through breathing, skin evaporation, urine and stool and you absolutely need water to live, it's safer to be a bit overhydrated than it is to be dehydrated. It's like money, I prefer to have $100 and waste it if I don't need it than having only a dollar and suffer for every cent spent. \n\n* Thanks to The Physiology Coloring Book. No kidding, you are supposed to color it while reading! \n\n** http://www.mayoclinic.org/diseases-conditions/urine-color/basics/definition/con-20032831\n\nFun fact: alcohol confuses your body, it start thinking that you are well hydrated so your kidney filters water (that's why you have to pee so much) but you are actually running out of liquids. The party puts the music really loud, so you are forced to shout and you realize that your mouth is really dry so you keep drinking. And then you decide to dance with that friend of yours, losing even more liquids, but things got really hot and heavy so you decide to buy another cold beer, losing more and more liquids and you get where this is going.\n\nEdit: added that you can die from drinking too much water. I don't want to be blamed of promoting that kind of behavior. If you want know more about it, I answered it to someone on the comments.", "edited": 1492043009.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your kidneys produce urine by filtering your blood stream. Urine is made of water, salt and wastes like urea and acid, among other things.&lt;/p&gt;\n\n&lt;p&gt;But your kidney isn&amp;#39;t like your dumbass intestine which absorbs every single hamburger you ate at McDonald&amp;#39;s and keeps it all in the form of fat. No, no, your kidney is smart and knows what should be kept and what should be discarded. This is done through a completely overly complicated system (which medicine students hate) that senses what do you have, what you don&amp;#39;t need and what you really need. &lt;/p&gt;\n\n&lt;p&gt;If you decide to drink 7 liters of water because someone dared you or something, then you are going to &lt;a href=\"http://articles.latimes.com/2007/jan/14/local/me-water14&amp;amp;sa=U&amp;amp;ved=0ahUKEwjXxoDNg6DTAhULkpAKHTLPDHQQFggOMAE&amp;amp;sig2=1COwxLl2klYxd_9YLs3fcw&amp;amp;usg=AFQjCNHVxRFcHQ2R0SKsjh58N0_lBfAS7A\"&gt;die &lt;/a&gt;(first from the alteration of your, hydroelectric balance, then because from the embarrassment of appearing on YouTube &amp;quot;Pranks gone wrong&amp;quot;). But if you manage to survive, then you are going to pee mostly water. If you decide to dehydrate yourself because you heard it was a good way to lose weight (pro tip: it&amp;#39;s not), your kidney will try to keep as much water as it can inside your blood stream while filtering everything else so your pee will look very dark or worse, you don&amp;#39;t pee at all and keep all the wastes inside you. &amp;quot;The composition of the body fluids is apparently determined not by what the mouth takes in, but by what the kidney keeps&amp;quot;*&lt;/p&gt;\n\n&lt;p&gt;Your body is smart but it isn&amp;#39;t magical. If you do stupid stuff like I mentioned earlier you are overworking it, so to answer your question: it&amp;#39;s not good to have it too clear or too dark. &amp;quot;Normal urine color ranges from pale yellow to deep amber — the result of a pigment called urochrome and how diluted or concentrated the urine is.&amp;quot;**&lt;/p&gt;\n\n&lt;p&gt;But since you are constantly losing liquids through breathing, skin evaporation, urine and stool and you absolutely need water to live, it&amp;#39;s safer to be a bit overhydrated than it is to be dehydrated. It&amp;#39;s like money, I prefer to have $100 and waste it if I don&amp;#39;t need it than having only a dollar and suffer for every cent spent. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Thanks to The Physiology Coloring Book. No kidding, you are supposed to color it while reading! &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;** &lt;a href=\"http://www.mayoclinic.org/diseases-conditions/urine-color/basics/definition/con-20032831\"&gt;http://www.mayoclinic.org/diseases-conditions/urine-color/basics/definition/con-20032831&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Fun fact: alcohol confuses your body, it start thinking that you are well hydrated so your kidney filters water (that&amp;#39;s why you have to pee so much) but you are actually running out of liquids. The party puts the music really loud, so you are forced to shout and you realize that your mouth is really dry so you keep drinking. And then you decide to dance with that friend of yours, losing even more liquids, but things got really hot and heavy so you decide to buy another cold beer, losing more and more liquids and you get where this is going.&lt;/p&gt;\n\n&lt;p&gt;Edit: added that you can die from drinking too much water. I don&amp;#39;t want to be blamed of promoting that kind of behavior. If you want know more about it, I answered it to someone on the comments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5d9f8", "score_hidden": false, "stickied": false, "created": 1491994415.0, "created_utc": 1491965615.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 850}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5az0x", "gilded": 0, "archived": false, "score": 1180, "report_reasons": null, "author": "SciviasKnows", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "To understand this, you have to know why we have urine at all. Your blood has to have a very precise chemical balance for your body to be able to work. If it's off even a little bit, you will get sick and eventually die, unless it's corrected. Your kidneys have the job of doing the corrections. They work by filtering out any excesses, returning blood that is chemically \"balanced\", and they are very good at it. The stuff they filter out is basically urine. The most important things filtered out are extra water, extra salt, and urea, a chemical produced continually by the body. Another chemical filtered out by the kidneys is urobilin, which makes urine yellow. Removing certain amount of water is necessary to the process, whether your blood has excess water or not.\n\nIf you are dehydrated, meaning you have not been drinking as much water as your body needs, your kidneys will do their job by removing the bare minimum amount of water to get the other stuff out. That means the urine will be concentrated. Think of it as being like strong tea. Because everything including urobilin is concentrated, its color will be dark yellow. This is actually normal first thing in the morning because you don't drink water while you're sleeping. During the day, it's a reliable sign that your body could really use more water. But it doesn't have to be clear for you to be healthy; a well-hydrated person's urine will still be light yellow unless they are drinking much *more* water than they need.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To understand this, you have to know why we have urine at all. Your blood has to have a very precise chemical balance for your body to be able to work. If it&amp;#39;s off even a little bit, you will get sick and eventually die, unless it&amp;#39;s corrected. Your kidneys have the job of doing the corrections. They work by filtering out any excesses, returning blood that is chemically &amp;quot;balanced&amp;quot;, and they are very good at it. The stuff they filter out is basically urine. The most important things filtered out are extra water, extra salt, and urea, a chemical produced continually by the body. Another chemical filtered out by the kidneys is urobilin, which makes urine yellow. Removing certain amount of water is necessary to the process, whether your blood has excess water or not.&lt;/p&gt;\n\n&lt;p&gt;If you are dehydrated, meaning you have not been drinking as much water as your body needs, your kidneys will do their job by removing the bare minimum amount of water to get the other stuff out. That means the urine will be concentrated. Think of it as being like strong tea. Because everything including urobilin is concentrated, its color will be dark yellow. This is actually normal first thing in the morning because you don&amp;#39;t drink water while you&amp;#39;re sleeping. During the day, it&amp;#39;s a reliable sign that your body could really use more water. But it doesn&amp;#39;t have to be clear for you to be healthy; a well-hydrated person&amp;#39;s urine will still be light yellow unless they are drinking much &lt;em&gt;more&lt;/em&gt; water than they need.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5az0x", "score_hidden": false, "stickied": false, "created": 1491991263.0, "created_utc": 1491962463.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1180}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5e07m", "gilded": 0, "archived": false, "score": 86, "report_reasons": null, "author": "CorvisCorax", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I was a tanker in the National Guard. We did our gunnery qualifications at Ft. Irwin...in August. They told us \"drink water, drink water, DRINK WATER. YOUR PISS SHOULD BE FUCKING CLEAR.\"  I did just that. I wasn't hungry and didn't eat much. I ended up passing out because I drank so much water I washed the electrolytes out of my body. I vaguely remember going to the first aid area, a shady place where they put you in the shade and plug in an IV until you can go back to work. I guess they didn't like my vitals. I briefly came to in the ambulance and one of the medics, a great kid named \"Mort\", of all things, was leaning over me. He looked scared and sounded scared. He didn't think I could hear him. He said my pulse was \"thready\" and \"we are losing him\". At the time I was ok with that and I was out again. I woke up for good in the hospital with a I.V. and a my pants pulled down to my knees. A big bag of ice was over my groin. AT was over for me that year. I was fucked up for over a week. Fuck those days. And Mort, if you are out there, thanks again man.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was a tanker in the National Guard. We did our gunnery qualifications at Ft. Irwin...in August. They told us &amp;quot;drink water, drink water, DRINK WATER. YOUR PISS SHOULD BE FUCKING CLEAR.&amp;quot;  I did just that. I wasn&amp;#39;t hungry and didn&amp;#39;t eat much. I ended up passing out because I drank so much water I washed the electrolytes out of my body. I vaguely remember going to the first aid area, a shady place where they put you in the shade and plug in an IV until you can go back to work. I guess they didn&amp;#39;t like my vitals. I briefly came to in the ambulance and one of the medics, a great kid named &amp;quot;Mort&amp;quot;, of all things, was leaning over me. He looked scared and sounded scared. He didn&amp;#39;t think I could hear him. He said my pulse was &amp;quot;thready&amp;quot; and &amp;quot;we are losing him&amp;quot;. At the time I was ok with that and I was out again. I woke up for good in the hospital with a I.V. and a my pants pulled down to my knees. A big bag of ice was over my groin. AT was over for me that year. I was fucked up for over a week. Fuck those days. And Mort, if you are out there, thanks again man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5e07m", "score_hidden": false, "stickied": false, "created": 1491995479.0, "created_utc": 1491966679.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 86}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg59fcj", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "linehan23", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Clearer urine is a sign of hydration but it doesnt need to be that clear, just not very dark. Side note, caffeine and alcohol are diuretics so they pull extra water into urine in the kidneys. So if you've drank something with them in it you'll have clearer urine but won't necessarily be hydrated.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Clearer urine is a sign of hydration but it doesnt need to be that clear, just not very dark. Side note, caffeine and alcohol are diuretics so they pull extra water into urine in the kidneys. So if you&amp;#39;ve drank something with them in it you&amp;#39;ll have clearer urine but won&amp;#39;t necessarily be hydrated.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg59fcj", "score_hidden": false, "stickied": false, "created": 1491989228.0, "created_utc": 1491960428.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg5qmlb", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "SchipholRijk", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I see a lot of comments discussing the color of urine (darkness), but none discussing the clarity.\n\nThe color of urine is determined by how much you drink, but also what you eat. Eating beetroot will turn your urine pretty dark, but it is not alarming. Not drinking enough water (or soda or beer or wine) will darken your urine too. 2-3 liter of fluids per day should be sufficient in a moderate warm climate.\n\nYour urine should always be clear, with only the occasional floq in it. If your urine is having the clarity of orange juice or white beer, go see your doctor, as you will have a urine/bladder infection. Do not underestimate this, it can kill you. A simple test and antibiotic treatment will usually fix this. \n\nIf your urine is only mildly unclear, just drink a lot of water a couple of days (4-6 liter) and it will flush out the infection.\n\nSource: urostomy patient with 40+ years experience with infections", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see a lot of comments discussing the color of urine (darkness), but none discussing the clarity.&lt;/p&gt;\n\n&lt;p&gt;The color of urine is determined by how much you drink, but also what you eat. Eating beetroot will turn your urine pretty dark, but it is not alarming. Not drinking enough water (or soda or beer or wine) will darken your urine too. 2-3 liter of fluids per day should be sufficient in a moderate warm climate.&lt;/p&gt;\n\n&lt;p&gt;Your urine should always be clear, with only the occasional floq in it. If your urine is having the clarity of orange juice or white beer, go see your doctor, as you will have a urine/bladder infection. Do not underestimate this, it can kill you. A simple test and antibiotic treatment will usually fix this. &lt;/p&gt;\n\n&lt;p&gt;If your urine is only mildly unclear, just drink a lot of water a couple of days (4-6 liter) and it will flush out the infection.&lt;/p&gt;\n\n&lt;p&gt;Source: urostomy patient with 40+ years experience with infections&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5qmlb", "score_hidden": false, "stickied": false, "created": 1492025149.0, "created_utc": 1491996349.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg6b99o", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "chuft_captain", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "It's a fairly good rule of thumb, but the things you eat and drink can change the color as well.\n\n\n\n\nMy daughter had a bunch of friends over one night.  I drove them to Starbucks after I'd gathered them all up.  After a few hours the normal shrieks that accompany these types get togethers changed in tone and timbre, so I went downstairs to see what the emergency was.  They'd all gathered in the restroom and we're staring into the toilet.  One of them was babbling hysterically into the phone.  The water in the bowl was a hue of orange that the human body should not be able to produce.  Not really fluorescent but similar.  It took a few minutes, but once everyone was settled down and I asked a few questions we got it sorted out.  I took over the phone and explained the situation to the parent.  \"No need to worry, Mike.  She asked for extra extra pumpkin spice in her coffee.  I think she'll be fine\".", "edited": 1492022536.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a fairly good rule of thumb, but the things you eat and drink can change the color as well.&lt;/p&gt;\n\n&lt;p&gt;My daughter had a bunch of friends over one night.  I drove them to Starbucks after I&amp;#39;d gathered them all up.  After a few hours the normal shrieks that accompany these types get togethers changed in tone and timbre, so I went downstairs to see what the emergency was.  They&amp;#39;d all gathered in the restroom and we&amp;#39;re staring into the toilet.  One of them was babbling hysterically into the phone.  The water in the bowl was a hue of orange that the human body should not be able to produce.  Not really fluorescent but similar.  It took a few minutes, but once everyone was settled down and I asked a few questions we got it sorted out.  I took over the phone and explained the situation to the parent.  &amp;quot;No need to worry, Mike.  She asked for extra extra pumpkin spice in her coffee.  I think she&amp;#39;ll be fine&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6b99o", "score_hidden": false, "stickied": false, "created": 1492050628.0, "created_utc": 1492021828.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w9sp", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "SpeckledEggs", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Technically clear means you can see through something regardless of color.  For example, windows are clear so you can see through them.  Clear, in terms of urine, is the opposite of cloudy.  You definitely want clear urine because cloudy can mean there are bacteria growing in your bladder, which means you might have a bladder infection.  Clear or cloudy urine can have color to it or not.  \n\nRegarding color, urine can be colorless or a range of yellowish brown colors from straw through amber.  The darker your urine is on this scale, the less hydrated your body is.  You generally want your urine to not be at the extremes of color all the time.  In general, drink water when you feel thirsty.  If you notice your urine is darker yellow, feel free to have a glass of water, especially if you're thirsty or elderly (thirst sensations decrease with age).  There is no need to force yourself to drink water - you can become overhydrated.\n  \nUrine can also be red from blood in the urine, pink from eating beets, greenish from taking vitamins, or other colors depending on what's going on with your body. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Technically clear means you can see through something regardless of color.  For example, windows are clear so you can see through them.  Clear, in terms of urine, is the opposite of cloudy.  You definitely want clear urine because cloudy can mean there are bacteria growing in your bladder, which means you might have a bladder infection.  Clear or cloudy urine can have color to it or not.  &lt;/p&gt;\n\n&lt;p&gt;Regarding color, urine can be colorless or a range of yellowish brown colors from straw through amber.  The darker your urine is on this scale, the less hydrated your body is.  You generally want your urine to not be at the extremes of color all the time.  In general, drink water when you feel thirsty.  If you notice your urine is darker yellow, feel free to have a glass of water, especially if you&amp;#39;re thirsty or elderly (thirst sensations decrease with age).  There is no need to force yourself to drink water - you can become overhydrated.&lt;/p&gt;\n\n&lt;p&gt;Urine can also be red from blood in the urine, pink from eating beets, greenish from taking vitamins, or other colors depending on what&amp;#39;s going on with your body. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5w9sp", "score_hidden": false, "stickied": false, "created": 1492034533.0, "created_utc": 1492005733.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg61rqp", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "HandsomeHodge", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "&gt; Why do *so many people* believe...\n\nIdk why civilians believe it, but when I was in the Marine Corps there were charts like [this](http://www.trngcmd.marines.mil/portals/207/Media/MCCSSS/Posters/Health_Safety/060814-D-RH960-001.jpg) in **literally** every bathroom. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Why do &lt;em&gt;so many people&lt;/em&gt; believe...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Idk why civilians believe it, but when I was in the Marine Corps there were charts like &lt;a href=\"http://www.trngcmd.marines.mil/portals/207/Media/MCCSSS/Posters/Health_Safety/060814-D-RH960-001.jpg\"&gt;this&lt;/a&gt; in &lt;strong&gt;literally&lt;/strong&gt; every bathroom. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg61rqp", "score_hidden": false, "stickied": false, "created": 1492040837.0, "created_utc": 1492012037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg7a0c0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kodack10", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Lets take a very bad situation as an example of doing it wrong. You're lost at sea, starving, thirsty, and so you drink some sea water. Tastes bad, but boy does it feel good to drink something. Problem, it has a lot of salt in it. Your body has a way to get rid of salt but it needs water to do so. Your kidneys are like cellular filters that remove waste, water, and yes even salt from your blood. However the removed waste needs to be flushed out of the kidneys in order to make it into the bladder and be expelled as urine. So your kidneys use more water getting rid of that salt, than you took in drinking it, so you end up losing more water than you gained. \n\nThis is the fundamental principle behind clear urine being considered hydrated. Your body needs water in order to flush uric acid, urea, salt, and other things out of the kidneys. If there is plenty of water, then the urine is very dilute and watery. If there is less water, maybe because your body is dehydrated and it's holding onto water, your urine will be darker and maybe cloudy. \n\nHowever there are other reasons your urine may not be watery that have nothing to do with drinking enough water. People on special diets, people fasting, people on certain medications, may be experiencing ketosis, which is a fat burning mechanism of the body when deprived of carbohydrates. Ketones get broken down to make energy but they result in a lot of metabolic waste that the kidneys have to flush out. So a properly hydrated person on the atkins diet for instance may have darker and strong smelling urine as their body removes ketones. \n\nOn the other hand, somebody  experiencing kidney failure may have very watery urine as their kidneys become unable to filter effectively. \n\nOther people with sodium or potassium imbalances may have their bodies purging water and creating watery urine, even when they are dehydrated. \n\nSo it's a general rule of thumb but there are always exceptions. Except for certain people with nerve damage, in general if you aren't thirsty, then you're drinking enough. If your lips are dry and cracked, you have a headache, your tongue is swollen, these are all signs of dehydration that appear long after thirst, and you really have to try hard not to drink when you're that thirsty to get so bad that you're dangerously dehydrated. \n\nIt's actually more dangerous to be over hydrated as it can deprive your body of sodium, potassium, phosphorus, and magnesium that it needs for nerve activity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lets take a very bad situation as an example of doing it wrong. You&amp;#39;re lost at sea, starving, thirsty, and so you drink some sea water. Tastes bad, but boy does it feel good to drink something. Problem, it has a lot of salt in it. Your body has a way to get rid of salt but it needs water to do so. Your kidneys are like cellular filters that remove waste, water, and yes even salt from your blood. However the removed waste needs to be flushed out of the kidneys in order to make it into the bladder and be expelled as urine. So your kidneys use more water getting rid of that salt, than you took in drinking it, so you end up losing more water than you gained. &lt;/p&gt;\n\n&lt;p&gt;This is the fundamental principle behind clear urine being considered hydrated. Your body needs water in order to flush uric acid, urea, salt, and other things out of the kidneys. If there is plenty of water, then the urine is very dilute and watery. If there is less water, maybe because your body is dehydrated and it&amp;#39;s holding onto water, your urine will be darker and maybe cloudy. &lt;/p&gt;\n\n&lt;p&gt;However there are other reasons your urine may not be watery that have nothing to do with drinking enough water. People on special diets, people fasting, people on certain medications, may be experiencing ketosis, which is a fat burning mechanism of the body when deprived of carbohydrates. Ketones get broken down to make energy but they result in a lot of metabolic waste that the kidneys have to flush out. So a properly hydrated person on the atkins diet for instance may have darker and strong smelling urine as their body removes ketones. &lt;/p&gt;\n\n&lt;p&gt;On the other hand, somebody  experiencing kidney failure may have very watery urine as their kidneys become unable to filter effectively. &lt;/p&gt;\n\n&lt;p&gt;Other people with sodium or potassium imbalances may have their bodies purging water and creating watery urine, even when they are dehydrated. &lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s a general rule of thumb but there are always exceptions. Except for certain people with nerve damage, in general if you aren&amp;#39;t thirsty, then you&amp;#39;re drinking enough. If your lips are dry and cracked, you have a headache, your tongue is swollen, these are all signs of dehydration that appear long after thirst, and you really have to try hard not to drink when you&amp;#39;re that thirsty to get so bad that you&amp;#39;re dangerously dehydrated. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s actually more dangerous to be over hydrated as it can deprive your body of sodium, potassium, phosphorus, and magnesium that it needs for nerve activity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg7a0c0", "score_hidden": false, "stickied": false, "created": 1492096858.0, "created_utc": 1492068058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg62ac3", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DrunkenGolfer", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "ELI5 answer: urine is a mix of water and yellow-coloured bodily waste.  The more water, the more diluted the waste, and the lighter the resulting colour of the mixture.  Some people claim that if the urine is not diluted enough, it is because the body is dehydrated.\n\nIt is interesting that no peer-reviewed study has ever concluded that there is any benefit to the generally accepted health and fitness advice about drinking copious amounts of water.  Our bodies have a very finely tuned mechanism for resolving matters of dehydration, which is thirst.  If you are thirsty, drink water.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;ELI5 answer: urine is a mix of water and yellow-coloured bodily waste.  The more water, the more diluted the waste, and the lighter the resulting colour of the mixture.  Some people claim that if the urine is not diluted enough, it is because the body is dehydrated.&lt;/p&gt;\n\n&lt;p&gt;It is interesting that no peer-reviewed study has ever concluded that there is any benefit to the generally accepted health and fitness advice about drinking copious amounts of water.  Our bodies have a very finely tuned mechanism for resolving matters of dehydration, which is thirst.  If you are thirsty, drink water.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg62ac3", "score_hidden": false, "stickied": false, "created": 1492041400.0, "created_utc": 1492012600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg652qt", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "aurinotari", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "If you're urine is clear you're drinking more water than your body needs and your kidneys are being overworked. If your urine is a darker yellow then you need more fluids. If your urine is a pale/straw yellow then it's just right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re urine is clear you&amp;#39;re drinking more water than your body needs and your kidneys are being overworked. If your urine is a darker yellow then you need more fluids. If your urine is a pale/straw yellow then it&amp;#39;s just right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg652qt", "score_hidden": false, "stickied": false, "created": 1492044345.0, "created_utc": 1492015545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg64nsv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Econo_miser", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This is a situation where A implies B but Not A does not imply Not B. If your pee is clear, you are getting enough water. If your pee is not clear, you could still be getting enough water but some people are idiots who don't understand logic or physiology.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a situation where A implies B but Not A does not imply Not B. If your pee is clear, you are getting enough water. If your pee is not clear, you could still be getting enough water but some people are idiots who don&amp;#39;t understand logic or physiology.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg64nsv", "score_hidden": false, "stickied": false, "created": 1492043921.0, "created_utc": 1492015121.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5l7m2", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "oncewereworriers", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "because i never used to drink water and then I got a tumor in my bladder. my urologist told me i need to drink 2L per day and never 'hold' on to ensure toxins are cleared from the body asap. The clearer your urine, the less toxic you are.\n\nsource: my urologist who has removed a bazillion tumors from ppl who didn't drink enough water. ", "edited": 1491980857.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;because i never used to drink water and then I got a tumor in my bladder. my urologist told me i need to drink 2L per day and never &amp;#39;hold&amp;#39; on to ensure toxins are cleared from the body asap. The clearer your urine, the less toxic you are.&lt;/p&gt;\n\n&lt;p&gt;source: my urologist who has removed a bazillion tumors from ppl who didn&amp;#39;t drink enough water. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5l7m2", "score_hidden": false, "stickied": false, "created": 1492009273.0, "created_utc": 1491980473.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg58zd6", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "pdjudd", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "There is a lot of misinformation regarding hydration. There is a whole slew of people saying that people need to drink x glasses a day. Some say that you start the day dehydrated. More sensible people say you should just drink when you at thirsty. \n\nThe seine thing is just an edition to justify your belief. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a lot of misinformation regarding hydration. There is a whole slew of people saying that people need to drink x glasses a day. Some say that you start the day dehydrated. More sensible people say you should just drink when you at thirsty. &lt;/p&gt;\n\n&lt;p&gt;The seine thing is just an edition to justify your belief. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg58zd6", "score_hidden": false, "stickied": false, "created": 1491988667.0, "created_utc": 1491959867.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg6viu9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GetOffMyLawn_", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Getting adequate amounts of water prevents kidney stones. Drinking adequate fluids makes sure your urine stays dilute enough that crystals do not form in it. Crystals grow into stones, and kidney stones are one of the most painful things you can experience in life. Generally for stone prevention you should pass 2 to 2.5 liters of urine per day. Since most people don't walk around with measuring cups to track their urine output a good rule of thumb that you're passing enough urine is that your urine is pale.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Getting adequate amounts of water prevents kidney stones. Drinking adequate fluids makes sure your urine stays dilute enough that crystals do not form in it. Crystals grow into stones, and kidney stones are one of the most painful things you can experience in life. Generally for stone prevention you should pass 2 to 2.5 liters of urine per day. Since most people don&amp;#39;t walk around with measuring cups to track their urine output a good rule of thumb that you&amp;#39;re passing enough urine is that your urine is pale.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6viu9", "score_hidden": false, "stickied": false, "created": 1492073688.0, "created_utc": 1492044888.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg6fxun", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "SenorDarcy", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "The above explanations are really good but it's worth noting that your urine isn't clear despite looking so, if you kept it concentrated (think peeing in a cup for a doctor) you'd likely see yellow even when very hydrated ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The above explanations are really good but it&amp;#39;s worth noting that your urine isn&amp;#39;t clear despite looking so, if you kept it concentrated (think peeing in a cup for a doctor) you&amp;#39;d likely see yellow even when very hydrated &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6fxun", "score_hidden": false, "stickied": false, "created": 1492055452.0, "created_utc": 1492026652.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg5xz1h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vertabrett", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I read this a couple years back and it really helped:\nhttps://www.nytimes.com/2015/08/25/upshot/no-you-do-not-have-to-drink-8-glasses-of-water-a-day.html?_r=0", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read this a couple years back and it really helped:\n&lt;a href=\"https://www.nytimes.com/2015/08/25/upshot/no-you-do-not-have-to-drink-8-glasses-of-water-a-day.html?_r=0\"&gt;https://www.nytimes.com/2015/08/25/upshot/no-you-do-not-have-to-drink-8-glasses-of-water-a-day.html?_r=0&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5xz1h", "score_hidden": false, "stickied": false, "created": 1492036595.0, "created_utc": 1492007795.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg63imy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "support_support", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I've always wondered why me pee was so colourless those first pees after drinking beers. Ty kind sir", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always wondered why me pee was so colourless those first pees after drinking beers. Ty kind sir&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg63imy", "score_hidden": false, "stickied": false, "created": 1492042723.0, "created_utc": 1492013923.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg5up61", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "nullagravida", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 1, "body": "PR hype, and it's gone too far. \n\nHere's the gentleman who literally wrote the book on running (it's called The Lore of Running and it's 921 pages), out with a recent book about OVER-hydration and how deadly it is:\n\nhttps://www.amazon.com/dp/B0081U6WWG/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1\n\nMy guess is, there are some interests out there that want to sell bottled water and water bottles.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PR hype, and it&amp;#39;s gone too far. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the gentleman who literally wrote the book on running (it&amp;#39;s called The Lore of Running and it&amp;#39;s 921 pages), out with a recent book about OVER-hydration and how deadly it is:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.amazon.com/dp/B0081U6WWG/ref=dp-kindle-redirect?_encoding=UTF8&amp;amp;btkr=1\"&gt;https://www.amazon.com/dp/B0081U6WWG/ref=dp-kindle-redirect?_encoding=UTF8&amp;amp;btkr=1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;My guess is, there are some interests out there that want to sell bottled water and water bottles.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5up61", "score_hidden": false, "stickied": false, "created": 1492032419.0, "created_utc": 1492003619.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": "", "user_reports": [], "id": "dg6dheh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "theDoctorAteMyBaby", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "... Because when you do drink a lot of water, your pee gets lighter?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;... Because when you do drink a lot of water, your pee gets lighter?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6dheh", "score_hidden": false, "stickied": false, "created": 1492052931.0, "created_utc": 1492024131.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5p239", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yogi118", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "But when I drink a lot of beer my pee is always clear? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But when I drink a lot of beer my pee is always clear? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5p239", "score_hidden": false, "stickied": false, "created": 1492020882.0, "created_utc": 1491992082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64uz0s", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg59cz9", "gilded": 0, "archived": false, "score": -25, "report_reasons": null, "author": "bobosnubs", "parent_id": "t3_64uz0s", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Because that is what doctors usually tell us, or at least that is where I've been taught this... and well once you get your PhD, you're kind of considered a credible source, especially in common human health so I would be confident in what they tell you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because that is what doctors usually tell us, or at least that is where I&amp;#39;ve been taught this... and well once you get your PhD, you&amp;#39;re kind of considered a credible source, especially in common human health so I would be confident in what they tell you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg59cz9", "score_hidden": false, "stickied": false, "created": 1491989143.0, "created_utc": 1491960343.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -25}}], "after": null, "before": null}}]