[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Technology", "id": "64vtp9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 826, "report_reasons": null, "author": "q-uierta", "saved": false, "mod_reports": [], "name": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Technology", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/64vtp9/eli5_why_do_video_games_have_leftover_or_unused/", "num_reports": null, "locked": false, "stickied": false, "created": 1491997039.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/64vtp9/eli5_why_do_video_games_have_leftover_or_unused/", "author_flair_text": null, "quarantine": false, "title": "ELI5: Why do video games have leftover or unused content in the data? Is there a purpose in leaving it in?", "created_utc": 1491968239.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 118, "visited": false, "subreddit_type": "public", "ups": 826}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6axbh", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "SpyderRyder_", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This comment is in response to those who say \"JUST FIX EVERYTHING\". \n\nKinda just pasting my comment from another thread lower down. Spent too much time typing this. \n\nIt's all in the severity of the issues and for the higher ups to perceive said issues as \"bad enough\". Producers don't usually understand the severity of things unless they're extremely obvious. Thankfully, even though I'm only a QA Lead, I'm in a position where I can actually voice my concerns for the bugs on the more minor-but-annoying side. We call this kind of stuff \"User Pain\". As in, a typo isn't that bad or annoying. No one would just drop the game and stop playing, send us hate mail, etc, because of a typo. But a looping sound bug, although not game-breaking, could be annoying as hell for players.\n\nEvery single game ever released (save for maybe, Pong) has had bugs. It's just some are a lot worse than others. \n\nHypothetical Situation Time: Let's say it's the last day of work on your game before it's \"Too Late\". \n\nYou find a typo in a side mission. Do you delay the game a month or two for that? That means paying whoever is left on the project for another month AS WELL as the PR shitstorm for the pushback and blablabla. \n\nThat's a lot of time and money. But I used a small issue on purpose. Another small issue that no one gives a shit about would be like assets clipping into each other on a small scale. Could happen throughout the whole game, as long as it's not jarringly obvious it's really not that bad. I'm talking about stuff like you look at the table and it clearly combines into the floor instead of being on-top of it. Stuff like that.\n\nNext is a medium tier. \n\nSo let's say you have the same amount of time left before it's \"Too Late\", except instead of a Typo, it's... \n\nWhen you're on the last level, if you happen to close the game while in the middle of a cutscene, when you reboot your game, the cutscene is skipped and you can't watch it again. Kinda sucks. Kinda. This is worse than a typo, but still, it's very specific (For this example, let's just say it ONLY happens on the final level, during that specific cutscene). Delay the game? Probably not. This is something that can go in the Day 1 Patch or Day 15/30 or whatever. \n\nLast example. Last day before \"Too Late\". You're on the last level about to beat the game and 100% of the time, when killing the final boss, the game crashes. So you do it again just to be sure and yes, 100% of the time, no matter what, the game crashes. This is out of the ordinary since QA would've caught it (or people are about to get fired), but for the sake of the story let's just say they didn't. This is delay-worthy. \n\nAnother major must-fix would be legal issues, but those do not cause User Pain (generally), but producers are 100% going to fix. \n\n**Extra Tidbit:** Bugs usually have classifications such a S-Bug, A, B, C-Class. S is must fix. C is Typos, clipping art, stuff like that. User Pain is something we started a few years ago, which is a 2nd classification we use in tandem. \n\nSo we could say \"The game has 0 S-Bugs! We're pretty good to go...But it has 3000 C-Class still.\" The producers don't exactly care about the C-Class. But now that we've opened them up to hearing what User Pain actually means, we have formulas for bug types like Audio Looping and stuff like that where we say (paraphrasing) \"Yeah, but this B-Class bug has 90/100 User Pain. Literally everyone who buys the game is going to hear it\" and they can rethink their position on the bug. \n\nGames nowadays and always, to be honest, but now more than ever, tend to be super complicated in so many aspects that it's impossible to even *FIND* all the issues, let alone fix them. \n\nThink of this: A game is tested by a team of 40 testers for 40 hours a week (lol) for let's say 2ish years. \n\nIf it's a big game (AAA, million copies sold, etc), within the first 2 hours that it has been released, it has been played by the public for more hours than it was tested throughout it's whole testing cycle. There are things that you guys do that we didn't think of. There are so many possibilities. It's mind blowing. ", "edited": 1492024626.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This comment is in response to those who say &amp;quot;JUST FIX EVERYTHING&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Kinda just pasting my comment from another thread lower down. Spent too much time typing this. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s all in the severity of the issues and for the higher ups to perceive said issues as &amp;quot;bad enough&amp;quot;. Producers don&amp;#39;t usually understand the severity of things unless they&amp;#39;re extremely obvious. Thankfully, even though I&amp;#39;m only a QA Lead, I&amp;#39;m in a position where I can actually voice my concerns for the bugs on the more minor-but-annoying side. We call this kind of stuff &amp;quot;User Pain&amp;quot;. As in, a typo isn&amp;#39;t that bad or annoying. No one would just drop the game and stop playing, send us hate mail, etc, because of a typo. But a looping sound bug, although not game-breaking, could be annoying as hell for players.&lt;/p&gt;\n\n&lt;p&gt;Every single game ever released (save for maybe, Pong) has had bugs. It&amp;#39;s just some are a lot worse than others. &lt;/p&gt;\n\n&lt;p&gt;Hypothetical Situation Time: Let&amp;#39;s say it&amp;#39;s the last day of work on your game before it&amp;#39;s &amp;quot;Too Late&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;You find a typo in a side mission. Do you delay the game a month or two for that? That means paying whoever is left on the project for another month AS WELL as the PR shitstorm for the pushback and blablabla. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s a lot of time and money. But I used a small issue on purpose. Another small issue that no one gives a shit about would be like assets clipping into each other on a small scale. Could happen throughout the whole game, as long as it&amp;#39;s not jarringly obvious it&amp;#39;s really not that bad. I&amp;#39;m talking about stuff like you look at the table and it clearly combines into the floor instead of being on-top of it. Stuff like that.&lt;/p&gt;\n\n&lt;p&gt;Next is a medium tier. &lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s say you have the same amount of time left before it&amp;#39;s &amp;quot;Too Late&amp;quot;, except instead of a Typo, it&amp;#39;s... &lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;re on the last level, if you happen to close the game while in the middle of a cutscene, when you reboot your game, the cutscene is skipped and you can&amp;#39;t watch it again. Kinda sucks. Kinda. This is worse than a typo, but still, it&amp;#39;s very specific (For this example, let&amp;#39;s just say it ONLY happens on the final level, during that specific cutscene). Delay the game? Probably not. This is something that can go in the Day 1 Patch or Day 15/30 or whatever. &lt;/p&gt;\n\n&lt;p&gt;Last example. Last day before &amp;quot;Too Late&amp;quot;. You&amp;#39;re on the last level about to beat the game and 100% of the time, when killing the final boss, the game crashes. So you do it again just to be sure and yes, 100% of the time, no matter what, the game crashes. This is out of the ordinary since QA would&amp;#39;ve caught it (or people are about to get fired), but for the sake of the story let&amp;#39;s just say they didn&amp;#39;t. This is delay-worthy. &lt;/p&gt;\n\n&lt;p&gt;Another major must-fix would be legal issues, but those do not cause User Pain (generally), but producers are 100% going to fix. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Extra Tidbit:&lt;/strong&gt; Bugs usually have classifications such a S-Bug, A, B, C-Class. S is must fix. C is Typos, clipping art, stuff like that. User Pain is something we started a few years ago, which is a 2nd classification we use in tandem. &lt;/p&gt;\n\n&lt;p&gt;So we could say &amp;quot;The game has 0 S-Bugs! We&amp;#39;re pretty good to go...But it has 3000 C-Class still.&amp;quot; The producers don&amp;#39;t exactly care about the C-Class. But now that we&amp;#39;ve opened them up to hearing what User Pain actually means, we have formulas for bug types like Audio Looping and stuff like that where we say (paraphrasing) &amp;quot;Yeah, but this B-Class bug has 90/100 User Pain. Literally everyone who buys the game is going to hear it&amp;quot; and they can rethink their position on the bug. &lt;/p&gt;\n\n&lt;p&gt;Games nowadays and always, to be honest, but now more than ever, tend to be super complicated in so many aspects that it&amp;#39;s impossible to even &lt;em&gt;FIND&lt;/em&gt; all the issues, let alone fix them. &lt;/p&gt;\n\n&lt;p&gt;Think of this: A game is tested by a team of 40 testers for 40 hours a week (lol) for let&amp;#39;s say 2ish years. &lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s a big game (AAA, million copies sold, etc), within the first 2 hours that it has been released, it has been played by the public for more hours than it was tested throughout it&amp;#39;s whole testing cycle. There are things that you guys do that we didn&amp;#39;t think of. There are so many possibilities. It&amp;#39;s mind blowing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6axbh", "score_hidden": false, "stickied": false, "created": 1492050293.0, "created_utc": 1492021493.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 56}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5my5n", "gilded": 0, "archived": false, "score": 609, "report_reasons": null, "author": "no_real_username", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Towards the end of a development cycle, caution is the name of the game.\n\nVideo games are really complex (and often somewhat haphazardly put together), so *any* change risks breaking something. If you're two weeks away from launch, the last thing you want to do is break stuff, so you play it safe, you don't make *any* change unless you are absolutely certain that it is (1) safe, and (2) necessary. So assets that turned out to be unused? Eh, leave them in, they do no harm that way.\n\nThis is also why games sometimes ship with entire levels removed, or with very obvious bugs left in. You're near the launch date, and yes, you know this is a bug, and yes, you're 90% sure fixing it is safe and will break nothing else. But... what if it does? You don't have time to re-test everything else, so you have to ask whether leaving in a known bug is better than fixing it and risking breaking something much more important *that you won't even have time to discover before release*. Or you found a single tricky bug in this map and you just don't have time to fix it so.... just disable that map entirely.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Towards the end of a development cycle, caution is the name of the game.&lt;/p&gt;\n\n&lt;p&gt;Video games are really complex (and often somewhat haphazardly put together), so &lt;em&gt;any&lt;/em&gt; change risks breaking something. If you&amp;#39;re two weeks away from launch, the last thing you want to do is break stuff, so you play it safe, you don&amp;#39;t make &lt;em&gt;any&lt;/em&gt; change unless you are absolutely certain that it is (1) safe, and (2) necessary. So assets that turned out to be unused? Eh, leave them in, they do no harm that way.&lt;/p&gt;\n\n&lt;p&gt;This is also why games sometimes ship with entire levels removed, or with very obvious bugs left in. You&amp;#39;re near the launch date, and yes, you know this is a bug, and yes, you&amp;#39;re 90% sure fixing it is safe and will break nothing else. But... what if it does? You don&amp;#39;t have time to re-test everything else, so you have to ask whether leaving in a known bug is better than fixing it and risking breaking something much more important &lt;em&gt;that you won&amp;#39;t even have time to discover before release&lt;/em&gt;. Or you found a single tricky bug in this map and you just don&amp;#39;t have time to fix it so.... just disable that map entirely.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5my5n", "score_hidden": false, "stickied": false, "created": 1492014261.0, "created_utc": 1491985461.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 609}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5fprm", "gilded": 0, "archived": false, "score": 364, "report_reasons": null, "author": "spargelkol", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "A big reason to not delete content you aren't using is to avoid breaking your game. A lot of games use assets in multiple places, and as the game gets bigger the interconnection can get very complicated. If you aren't completely certain taking something out won't effect something else, it makes sense to just leave it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A big reason to not delete content you aren&amp;#39;t using is to avoid breaking your game. A lot of games use assets in multiple places, and as the game gets bigger the interconnection can get very complicated. If you aren&amp;#39;t completely certain taking something out won&amp;#39;t effect something else, it makes sense to just leave it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5fprm", "score_hidden": false, "stickied": false, "created": 1491998101.0, "created_utc": 1491969301.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 364}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5phjt", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "dracoix", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I can answer this in the context of Age of Empires by Ensemble Studios between version 1 (AoE original) to version 2 (AoK/C) alpha, beta, release, and AoE2HD.\n\nAoE (version 1) was heavily polished with little to no leftover assets within the data or code structure. This cannot be said the same about AoK (version 2). This really came down to how rushed AoK was compared to AoE. Given the day and age of the 2 games, there wasn't really a proper way to clean up assets or remove them. Nothing was brought to 'modern' standards when the format got upgraded from AoE1 to AoE2. Storage space was no longer a big concern, yet the spaghetti ('stuff everywhere') conventions were kept.\n\nThe amount of AoE2 alpha and beta assets left in is perhaps 1/6th of the entire dataset. Much of them only show up in a re-polish for AoC (the expansion), or are little easter eggs for us dataminers to find. Some don't have proper animations, bad transparent backgrounds, or come from the immediate AoE1 dataset just for testing. \n\nSkyBox labs (AoE2HD devs) have done a decent job trudging through the original source code. Including working with reversed-engineered tools to the point where the entire asset blob database (where assets are actually stored) has been exploded (extracted) and used on the fly. Some of the graphics (mostly background images) have finally been updated to modern conventions, yet the engine palette is still low-res color, because all sprite assets use a single palette*. *There's multiple palettes for game objects, each share their own global palette, but really there's only 1 important one.\n\nAlso there's a engine code fork, recoding of the original, that Lucas Arts got back in the day, a little more polished than what AoE2 (AoK/C) is capable of. But the spaghetti conventions still reside within.\n\ntl;dr Don't look into the asset database of AoE, there's a generational programming gap of etiquettes on display.", "edited": 1491994874.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can answer this in the context of Age of Empires by Ensemble Studios between version 1 (AoE original) to version 2 (AoK/C) alpha, beta, release, and AoE2HD.&lt;/p&gt;\n\n&lt;p&gt;AoE (version 1) was heavily polished with little to no leftover assets within the data or code structure. This cannot be said the same about AoK (version 2). This really came down to how rushed AoK was compared to AoE. Given the day and age of the 2 games, there wasn&amp;#39;t really a proper way to clean up assets or remove them. Nothing was brought to &amp;#39;modern&amp;#39; standards when the format got upgraded from AoE1 to AoE2. Storage space was no longer a big concern, yet the spaghetti (&amp;#39;stuff everywhere&amp;#39;) conventions were kept.&lt;/p&gt;\n\n&lt;p&gt;The amount of AoE2 alpha and beta assets left in is perhaps 1/6th of the entire dataset. Much of them only show up in a re-polish for AoC (the expansion), or are little easter eggs for us dataminers to find. Some don&amp;#39;t have proper animations, bad transparent backgrounds, or come from the immediate AoE1 dataset just for testing. &lt;/p&gt;\n\n&lt;p&gt;SkyBox labs (AoE2HD devs) have done a decent job trudging through the original source code. Including working with reversed-engineered tools to the point where the entire asset blob database (where assets are actually stored) has been exploded (extracted) and used on the fly. Some of the graphics (mostly background images) have finally been updated to modern conventions, yet the engine palette is still low-res color, because all sprite assets use a single palette*. *There&amp;#39;s multiple palettes for game objects, each share their own global palette, but really there&amp;#39;s only 1 important one.&lt;/p&gt;\n\n&lt;p&gt;Also there&amp;#39;s a engine code fork, recoding of the original, that Lucas Arts got back in the day, a little more polished than what AoE2 (AoK/C) is capable of. But the spaghetti conventions still reside within.&lt;/p&gt;\n\n&lt;p&gt;tl;dr Don&amp;#39;t look into the asset database of AoE, there&amp;#39;s a generational programming gap of etiquettes on display.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5phjt", "score_hidden": false, "stickied": false, "created": 1492022166.0, "created_utc": 1491993366.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5luda", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "Kinno", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "There might be a forgotten piece of code somewhere in your game that calls the unused content. If you remove it and it does that your entire game will crash. So to remove unused stuff you need to go through your entire game and check to make sure nothing calls the unused thing before you can remove it. Or you can leave it in. Way easier and way safer.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There might be a forgotten piece of code somewhere in your game that calls the unused content. If you remove it and it does that your entire game will crash. So to remove unused stuff you need to go through your entire game and check to make sure nothing calls the unused thing before you can remove it. Or you can leave it in. Way easier and way safer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5luda", "score_hidden": false, "stickied": false, "created": 1492010994.0, "created_utc": 1491982194.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": "", "user_reports": [], "id": "dg5szfp", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Short_Change", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Removing the data is extra work. If it does not do harm the game itself, the best bet is to leave it there.\n\nThese days game sizes mean almost nothing, big or small. With big games, proportionally the unused content takes up a small space. With small games, even with extra content, the storage usage will take up small space anyway.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Removing the data is extra work. If it does not do harm the game itself, the best bet is to leave it there.&lt;/p&gt;\n\n&lt;p&gt;These days game sizes mean almost nothing, big or small. With big games, proportionally the unused content takes up a small space. With small games, even with extra content, the storage usage will take up small space anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5szfp", "score_hidden": false, "stickied": false, "created": 1492029782.0, "created_utc": 1492000982.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a00f", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "OptimalGoat", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I'm nearing the end of a development cycle on a game that I'm making, and this is happening everywhere.\n\nThe biggest reason is that keeping something in the game is generally easier then removing it. Especially if it's just in the files and maybe it'll be needed later. Also, removing it might just not really matter. What's a couple hundred lines of code out of tens of thousands(or, on larger games, tens of thousands out of millions), especially after the compiler does its magic? Maybe deleting maps, textures, etc. might save some file size, but whatever, storage space is cheap.\n\nAn example from my game is that there was an entire mechanic that I developed, refined a bit, and then as I played and tested, decided to go in a different direction. The mechanic was stored in things called \"coroutines\" which are basically bits of code that conditionally run alongside the main code. \nWhen I first took out the mechanic, I wasn't 100% certain that I wouldn't return to it, I just started playtesting and iterating on the design without the mechanic. So rather than remove the coroutines entirely, I just stopped them from running. This was just a change in two lines(in fact, just adding \"//\" in front of them), and if I ever wanted to change it back, I just delete those //'s, and bam, the mechanic is back. \n\nSo, sure, there's some left-over unused content... an entirely unused core mechanic of the game, that's technically in the source code. I probably could, if I wanted to, completely remove that code. But why would I? It doesn't have any negative impact on the game in any way, it doesn't break anything else, and I have bigger fish to fry.\n\nNot to mention, in this case the game is pretty small and I'm the only developer... imagine this happening on a scale hundreds of times bigger with even more involved and codependent things.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m nearing the end of a development cycle on a game that I&amp;#39;m making, and this is happening everywhere.&lt;/p&gt;\n\n&lt;p&gt;The biggest reason is that keeping something in the game is generally easier then removing it. Especially if it&amp;#39;s just in the files and maybe it&amp;#39;ll be needed later. Also, removing it might just not really matter. What&amp;#39;s a couple hundred lines of code out of tens of thousands(or, on larger games, tens of thousands out of millions), especially after the compiler does its magic? Maybe deleting maps, textures, etc. might save some file size, but whatever, storage space is cheap.&lt;/p&gt;\n\n&lt;p&gt;An example from my game is that there was an entire mechanic that I developed, refined a bit, and then as I played and tested, decided to go in a different direction. The mechanic was stored in things called &amp;quot;coroutines&amp;quot; which are basically bits of code that conditionally run alongside the main code. \nWhen I first took out the mechanic, I wasn&amp;#39;t 100% certain that I wouldn&amp;#39;t return to it, I just started playtesting and iterating on the design without the mechanic. So rather than remove the coroutines entirely, I just stopped them from running. This was just a change in two lines(in fact, just adding &amp;quot;//&amp;quot; in front of them), and if I ever wanted to change it back, I just delete those //&amp;#39;s, and bam, the mechanic is back. &lt;/p&gt;\n\n&lt;p&gt;So, sure, there&amp;#39;s some left-over unused content... an entirely unused core mechanic of the game, that&amp;#39;s technically in the source code. I probably could, if I wanted to, completely remove that code. But why would I? It doesn&amp;#39;t have any negative impact on the game in any way, it doesn&amp;#39;t break anything else, and I have bigger fish to fry.&lt;/p&gt;\n\n&lt;p&gt;Not to mention, in this case the game is pretty small and I&amp;#39;m the only developer... imagine this happening on a scale hundreds of times bigger with even more involved and codependent things.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6a00f", "score_hidden": false, "stickied": false, "created": 1492049344.0, "created_utc": 1492020544.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": "", "user_reports": [], "id": "dg5x3pj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "lmolari", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Its everywhere in programming like this. You build a database with lots of things programmers call \"resources\". It contains pictures, strings, music. All kinds of stuff that is no code. \n\nDepending on the programming environment, the age of the project and also the management this database grows like weed and most of the time nobody cares about cleaning it up. \n\nThe reason why is easy explained by an example: You have 5000 pictures, but you only use effectively 1000. So who wants to check 5000 pictures - often even manually - which pictures are used and which are not?\n\nSo most teams think \"there may be 200mb unused data on a 5 gigabyte installer. So what? Why should we invest even a hour of work to clean that up? Nobody would care anyway.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its everywhere in programming like this. You build a database with lots of things programmers call &amp;quot;resources&amp;quot;. It contains pictures, strings, music. All kinds of stuff that is no code. &lt;/p&gt;\n\n&lt;p&gt;Depending on the programming environment, the age of the project and also the management this database grows like weed and most of the time nobody cares about cleaning it up. &lt;/p&gt;\n\n&lt;p&gt;The reason why is easy explained by an example: You have 5000 pictures, but you only use effectively 1000. So who wants to check 5000 pictures - often even manually - which pictures are used and which are not?&lt;/p&gt;\n\n&lt;p&gt;So most teams think &amp;quot;there may be 200mb unused data on a 5 gigabyte installer. So what? Why should we invest even a hour of work to clean that up? Nobody would care anyway.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5x3pj", "score_hidden": false, "stickied": false, "created": 1492035565.0, "created_utc": 1492006765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": "", "user_reports": [], "id": "dg5uubw", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Humblebee89", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Fear of breaking the entire game mostly. Imagine if some low level artist removed the 3D model of the Blargg from Super Mario 64 and it broke the whole game, and they had to push the release date. That dude is fired for sure and the game might make less money. Better safe than sorry and leave it in. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fear of breaking the entire game mostly. Imagine if some low level artist removed the 3D model of the Blargg from Super Mario 64 and it broke the whole game, and they had to push the release date. That dude is fired for sure and the game might make less money. Better safe than sorry and leave it in. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5uubw", "score_hidden": false, "stickied": false, "created": 1492032622.0, "created_utc": 1492003822.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": "", "user_reports": [], "id": "dg76u84", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "greyson107", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Oh I know this one. I work for a game company and it sorta really easy to explain. and it only comes down to a few reasons.\n\n1 \"We don't have time to put this in! Just leave it!\" If the deadline of an area or however you choose to develop is due the idea or the item is left in there scraped. It is quicker and you do always have the chance to patch it back in.\n\n2 \"This thing is gonna break the game or the flow. Leave it there until we know what to do with it.\" Some items or weapons or location what have you could break the game's flow or narrative so they are left out to be either replaced or reworked.\n\n3\"We worked on this area for way too long and it finally all worked out. Don't touch anything! Don't even breathe on it!\" When you build an area kinda like connecting a big box of jumbled wires. and when you have finally made the area work you don't want to touch it again. even if it meant there are leftovers in there. \n\n4 \"The game is gonna luanch! We don't have time to sweep for things! Just leave it in! There is no way to access it normally anyway.\" This happens when your ambition for the game does not meet up with the time frame. Sometimes things are just sealed off instead of being removed. since its easier and quicker to just seal it off.\n\n5 \"We want to delete an earlier area but we already made things after it and we are not sure if we just delete it might break the code.\" \n\n6\"Hey this would be an cheeky easter egg only the hardcore will find.\" There are devs who write things in the codes as a gag or a rant. less common nowadays but still.\n\n\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh I know this one. I work for a game company and it sorta really easy to explain. and it only comes down to a few reasons.&lt;/p&gt;\n\n&lt;p&gt;1 &amp;quot;We don&amp;#39;t have time to put this in! Just leave it!&amp;quot; If the deadline of an area or however you choose to develop is due the idea or the item is left in there scraped. It is quicker and you do always have the chance to patch it back in.&lt;/p&gt;\n\n&lt;p&gt;2 &amp;quot;This thing is gonna break the game or the flow. Leave it there until we know what to do with it.&amp;quot; Some items or weapons or location what have you could break the game&amp;#39;s flow or narrative so they are left out to be either replaced or reworked.&lt;/p&gt;\n\n&lt;p&gt;3&amp;quot;We worked on this area for way too long and it finally all worked out. Don&amp;#39;t touch anything! Don&amp;#39;t even breathe on it!&amp;quot; When you build an area kinda like connecting a big box of jumbled wires. and when you have finally made the area work you don&amp;#39;t want to touch it again. even if it meant there are leftovers in there. &lt;/p&gt;\n\n&lt;p&gt;4 &amp;quot;The game is gonna luanch! We don&amp;#39;t have time to sweep for things! Just leave it in! There is no way to access it normally anyway.&amp;quot; This happens when your ambition for the game does not meet up with the time frame. Sometimes things are just sealed off instead of being removed. since its easier and quicker to just seal it off.&lt;/p&gt;\n\n&lt;p&gt;5 &amp;quot;We want to delete an earlier area but we already made things after it and we are not sure if we just delete it might break the code.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;6&amp;quot;Hey this would be an cheeky easter egg only the hardcore will find.&amp;quot; There are devs who write things in the codes as a gag or a rant. less common nowadays but still.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg76u84", "score_hidden": false, "stickied": false, "created": 1492089391.0, "created_utc": 1492060591.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": "", "user_reports": [], "id": "dg640b5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DangerMacAwesome", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Most software has lot of interconnectivity. This is especially true for video games, which can reuse many assets. That fog could could be a repurposed gas grenade. The sound of that monster might be an audio clip played in reverse and sped up. That texture for the tree trunk might be recolored to be the armor for those bad guys. Many assets are reused in this way, not just art assets. \n\nThis is less true for more recent games where tremendous amounts of storage space alleviates the need to reuse assets.\n\nThis creates something of a spider web of resources in the game. You could remove an item that nothing depends on and that's all well and good, but if there's a connection you didn't see or predict, you might find your web unraveling. Because video games cost a ton of money to make, and a serious problem at launch could be disastrous for return on investment, it is often wiser to simply leave the cut content in.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most software has lot of interconnectivity. This is especially true for video games, which can reuse many assets. That fog could could be a repurposed gas grenade. The sound of that monster might be an audio clip played in reverse and sped up. That texture for the tree trunk might be recolored to be the armor for those bad guys. Many assets are reused in this way, not just art assets. &lt;/p&gt;\n\n&lt;p&gt;This is less true for more recent games where tremendous amounts of storage space alleviates the need to reuse assets.&lt;/p&gt;\n\n&lt;p&gt;This creates something of a spider web of resources in the game. You could remove an item that nothing depends on and that&amp;#39;s all well and good, but if there&amp;#39;s a connection you didn&amp;#39;t see or predict, you might find your web unraveling. Because video games cost a ton of money to make, and a serious problem at launch could be disastrous for return on investment, it is often wiser to simply leave the cut content in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg640b5", "score_hidden": false, "stickied": false, "created": 1492043237.0, "created_utc": 1492014437.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v6tr", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "thewongguy", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "i read thru the comments and still don't understand what is meant by unused content? can someone ELI5  what an example of that content is, and how a regular gamer would even know how to find it? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i read thru the comments and still don&amp;#39;t understand what is meant by unused content? can someone ELI5  what an example of that content is, and how a regular gamer would even know how to find it? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5v6tr", "score_hidden": false, "stickied": false, "created": 1492033104.0, "created_utc": 1492004304.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5f6dx", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 1, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5f6dx", "score_hidden": false, "stickied": false, "created": 1491997246.0, "created_utc": 1491968446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5w3ze", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5w3ze", "score_hidden": false, "stickied": false, "created": 1492034328.0, "created_utc": 1492005528.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": "", "user_reports": [], "id": "dg6d12x", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RBS-METAL", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "If the game is getting any physical distribution at all then there is a factory waiting for the gold master to hit their servers and a pre-allotted time set aside for pressing and packaging.  There are trucks waiting to roll...you get the idea.  The production facility is booked months in advance and during the run up to the holidays there is zero capacity available for rebooking the plant.  So, you get very careful about making changes late in the game and it's better to close off a problematic area to make your manufacturing deadline than risk missing it.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If the game is getting any physical distribution at all then there is a factory waiting for the gold master to hit their servers and a pre-allotted time set aside for pressing and packaging.  There are trucks waiting to roll...you get the idea.  The production facility is booked months in advance and during the run up to the holidays there is zero capacity available for rebooking the plant.  So, you get very careful about making changes late in the game and it&amp;#39;s better to close off a problematic area to make your manufacturing deadline than risk missing it.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6d12x", "score_hidden": false, "stickied": false, "created": 1492052453.0, "created_utc": 1492023653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": "", "user_reports": [], "id": "dg6caip", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pinkstahli", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "In any software development, or actually any development of any technology, the more you fix bugs and add features the higher the potential for unforeseen consequences is. So in a lot of cases, old assets can become mandatory for newer builds to function properly without an added bit of manpower that may be too costly, in order to remover it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In any software development, or actually any development of any technology, the more you fix bugs and add features the higher the potential for unforeseen consequences is. So in a lot of cases, old assets can become mandatory for newer builds to function properly without an added bit of manpower that may be too costly, in order to remover it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6caip", "score_hidden": false, "stickied": false, "created": 1492051685.0, "created_utc": 1492022885.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64vtp9", "likes": null, "replies": "", "user_reports": [], "id": "dg68q92", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RaptorX7", "parent_id": "t3_64vtp9", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Another reason why I think they do this: it's hard to continually make backups of the game after every change has been made. If they try to remove the unused content and the game no longer works, the programmer has to either undo the last change manually or reload the backup, which might be an hour, a day, or a week old. It's a lot of lost progress and slows down development, so it's best to do it only when necessary so they can make one backup, change/remove the content, and then make another backup after it works.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another reason why I think they do this: it&amp;#39;s hard to continually make backups of the game after every change has been made. If they try to remove the unused content and the game no longer works, the programmer has to either undo the last change manually or reload the backup, which might be an hour, a day, or a week old. It&amp;#39;s a lot of lost progress and slows down development, so it&amp;#39;s best to do it only when necessary so they can make one backup, change/remove the content, and then make another backup after it works.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg68q92", "score_hidden": false, "stickied": false, "created": 1492048046.0, "created_utc": 1492019246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]