[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Biology", "id": "64w3sl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 1518, "report_reasons": null, "author": "Klingonadvocate", "saved": false, "mod_reports": [], "name": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Biology", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/64w3sl/eli5_how_does_our_brain_store_information_and_how/", "num_reports": null, "locked": false, "stickied": false, "created": 1492000776.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/64w3sl/eli5_how_does_our_brain_store_information_and_how/", "author_flair_text": null, "quarantine": false, "title": "ELI5 : How does our brain store information and how does it search for it when I'm trying to remember something?", "created_utc": 1491971976.0, "distinguished": null, "media": null, "upvote_ratio": 0.89, "num_comments": 132, "visited": false, "subreddit_type": "public", "ups": 1518}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tqt3", "gilded": 0, "archived": false, "score": 76, "report_reasons": null, "author": "VehaMeursault", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This question is literally almost as old as recorded history, being (to my knowledge) first asked and discussed by Plato, in his *Theaetetus*, and the answer to this day is still: we don't know.\n\nThe reason I refer to philosophy is not just for the sake of historical context, but because the question is necessarily two-fold: on the one hand there is the philosophical perspective, concerned with what it *means* for the brain to 'reach out' to 'bits' of information that is physically stored somewhere; on the other hand there is the (neuro)physiological perspective, which simply aims to measure what interact at what times and quantities when the brain reaches out to its information.\n\nSee, even if we were to identify that part A and part B of the brain are activated when we remember language, and that part X and part Y fire up when we think of imagery or emotions, then we still have no clue what it means to know these things: for example, I know my name is VehaMeursault, but when I'm eating food or doing maths, am I still 'knowing' my name, or do I not know *until* I actively think about it and retrieve that fact from wherever in my brain it is stored?\n\nAlso, although we can identify areas in the brain that pertain to specific types of phenomena (thinking of music light us different part of the brain than thinking of speech or maths), we still cannot perfectly map those thoughts of phenomena, because there are no dedicated particles in play. There is no 'neurone #A018' that is exclusively lit up when you think of 'Careless Whisper', or a 'neurone #X24' when you're having an orgasm. This is because (it seems that) it's not the neurone itself that stores information (like a CD or DVD would) but rather the *organisation* of neurones. \n\nThink of the alphabet: no letter in itself informs you of anything much, but by organising 26 different letters we can suddenly create entire languages! Even if a language could only use 5-letter words, there would still be 12million unique words one could make with 26 letters!\n\nIn a similar way, the organisation of non-specific neurones seems to be what makes 'information'.\n\nFinally: *even if we did* manage to map it all and to confidently say \"this part of the brain does that, and that part does this,\" then we would still be stuck at the problem of experience: *even if* your brain and my brain would light up *exactly* the same way when you and I both eat chocolate, then we would *still* not know if you and I are experiencing the same phenomena.\n\nTL;DR:\n\nThe question is a tricky one to answer, because:\n\n1. it involves *experience* (and thus philosophy) on the one hand, and \n\n2. because it involves mapping the brain, which consists not of *dedicated pieces* of matter, but rather of a few types of particles whose *organisation* seems to hold the key—a fact that would make it only harder because as I said with the language example: 5-letter words of 26 letters already make 12 million permutations possible, let alone hundreds of billions of neurones communicating at the speed of electricity.", "edited": 1492029551.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This question is literally almost as old as recorded history, being (to my knowledge) first asked and discussed by Plato, in his &lt;em&gt;Theaetetus&lt;/em&gt;, and the answer to this day is still: we don&amp;#39;t know.&lt;/p&gt;\n\n&lt;p&gt;The reason I refer to philosophy is not just for the sake of historical context, but because the question is necessarily two-fold: on the one hand there is the philosophical perspective, concerned with what it &lt;em&gt;means&lt;/em&gt; for the brain to &amp;#39;reach out&amp;#39; to &amp;#39;bits&amp;#39; of information that is physically stored somewhere; on the other hand there is the (neuro)physiological perspective, which simply aims to measure what interact at what times and quantities when the brain reaches out to its information.&lt;/p&gt;\n\n&lt;p&gt;See, even if we were to identify that part A and part B of the brain are activated when we remember language, and that part X and part Y fire up when we think of imagery or emotions, then we still have no clue what it means to know these things: for example, I know my name is VehaMeursault, but when I&amp;#39;m eating food or doing maths, am I still &amp;#39;knowing&amp;#39; my name, or do I not know &lt;em&gt;until&lt;/em&gt; I actively think about it and retrieve that fact from wherever in my brain it is stored?&lt;/p&gt;\n\n&lt;p&gt;Also, although we can identify areas in the brain that pertain to specific types of phenomena (thinking of music light us different part of the brain than thinking of speech or maths), we still cannot perfectly map those thoughts of phenomena, because there are no dedicated particles in play. There is no &amp;#39;neurone #A018&amp;#39; that is exclusively lit up when you think of &amp;#39;Careless Whisper&amp;#39;, or a &amp;#39;neurone #X24&amp;#39; when you&amp;#39;re having an orgasm. This is because (it seems that) it&amp;#39;s not the neurone itself that stores information (like a CD or DVD would) but rather the &lt;em&gt;organisation&lt;/em&gt; of neurones. &lt;/p&gt;\n\n&lt;p&gt;Think of the alphabet: no letter in itself informs you of anything much, but by organising 26 different letters we can suddenly create entire languages! Even if a language could only use 5-letter words, there would still be 12million unique words one could make with 26 letters!&lt;/p&gt;\n\n&lt;p&gt;In a similar way, the organisation of non-specific neurones seems to be what makes &amp;#39;information&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Finally: &lt;em&gt;even if we did&lt;/em&gt; manage to map it all and to confidently say &amp;quot;this part of the brain does that, and that part does this,&amp;quot; then we would still be stuck at the problem of experience: &lt;em&gt;even if&lt;/em&gt; your brain and my brain would light up &lt;em&gt;exactly&lt;/em&gt; the same way when you and I both eat chocolate, then we would &lt;em&gt;still&lt;/em&gt; not know if you and I are experiencing the same phenomena.&lt;/p&gt;\n\n&lt;p&gt;TL;DR:&lt;/p&gt;\n\n&lt;p&gt;The question is a tricky one to answer, because:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;it involves &lt;em&gt;experience&lt;/em&gt; (and thus philosophy) on the one hand, and &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;because it involves mapping the brain, which consists not of &lt;em&gt;dedicated pieces&lt;/em&gt; of matter, but rather of a few types of particles whose &lt;em&gt;organisation&lt;/em&gt; seems to hold the key—a fact that would make it only harder because as I said with the language example: 5-letter words of 26 letters already make 12 million permutations possible, let alone hundreds of billions of neurones communicating at the speed of electricity.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5tqt3", "score_hidden": false, "stickied": false, "created": 1492030996.0, "created_utc": 1492002196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 76}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x2am", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "ForOhForError", "parent_id": "t1_dg5v6kc", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Our brains aren't that efficient at storing and retrieving data, however. Our memory is unreliable. Memories are easily altered or misremembered (There's a great article that compares three accounts President Bush gave of the hours surrounding 9/11; all three differ slightly), and contain only some information.\n\nFor example, imagine the front of a penny. You probably think you know the image well (if you're American). But on the penny, is Lincoln facing left or right? Does he have a beard? Where is the text on the coin, and what does it say? And this is visual data, which we retain fairly well. Lists of numbers and exact textual information is lost much more easily.\n\nThe brain is good at finding patterns in information but poor at storing and retrieving information exactly. \n\nAs for speed, hash maps generally are considered to have a constant time retrieval and usually a constant time insert. For fast retrieval, that's usually good enough.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Our brains aren&amp;#39;t that efficient at storing and retrieving data, however. Our memory is unreliable. Memories are easily altered or misremembered (There&amp;#39;s a great article that compares three accounts President Bush gave of the hours surrounding 9/11; all three differ slightly), and contain only some information.&lt;/p&gt;\n\n&lt;p&gt;For example, imagine the front of a penny. You probably think you know the image well (if you&amp;#39;re American). But on the penny, is Lincoln facing left or right? Does he have a beard? Where is the text on the coin, and what does it say? And this is visual data, which we retain fairly well. Lists of numbers and exact textual information is lost much more easily.&lt;/p&gt;\n\n&lt;p&gt;The brain is good at finding patterns in information but poor at storing and retrieving information exactly. &lt;/p&gt;\n\n&lt;p&gt;As for speed, hash maps generally are considered to have a constant time retrieval and usually a constant time insert. For fast retrieval, that&amp;#39;s usually good enough.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5x2am", "score_hidden": false, "stickied": false, "created": 1492035518.0, "created_utc": 1492006718.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5wtjk", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "funmaker0206", "parent_id": "t1_dg5v6kc", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Hey OP maybe I'm chimming in late here but I think I can answer your question. So first off it's important to know that not all neural networks are the same. Depending on what they solve and what they do with that data depends on their speed and effectiveness. The vast majority of NN are referred to as feedforward NN where the data is fed forward from input to output. These can be extremely useful and has a ton of uses but it's not exactly how our brains work.  \n  \nEnter the recurrent NN where data can flow from output to input. This is closer to how our brains work, if it rains I get wet, if I get wet I get cold. Now training a feedforward NN is slow but actually using the trained network is EXTREMELY fast, like could run on an Arduino. It's basically function fitting where finding what y equals takes awhile but inputting values into y = 62.56*x +76 is really easy. Recurrent NN have the same advantages except for one major disadvantage. The networks FORGET old info. Basically the more cycles that happen, the old data has less and less of an impact on the output. Currently this is a fast enough drop off that recurrent neural networks aren't that useful but research is being done to find better and better algorithms that avoid that forgetfulness. Hope that helps.\n  \nTL;DR Learning in NN is slow but using them is very fast. But networks that work like our brain are bad at the learning part.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey OP maybe I&amp;#39;m chimming in late here but I think I can answer your question. So first off it&amp;#39;s important to know that not all neural networks are the same. Depending on what they solve and what they do with that data depends on their speed and effectiveness. The vast majority of NN are referred to as feedforward NN where the data is fed forward from input to output. These can be extremely useful and has a ton of uses but it&amp;#39;s not exactly how our brains work.  &lt;/p&gt;\n\n&lt;p&gt;Enter the recurrent NN where data can flow from output to input. This is closer to how our brains work, if it rains I get wet, if I get wet I get cold. Now training a feedforward NN is slow but actually using the trained network is EXTREMELY fast, like could run on an Arduino. It&amp;#39;s basically function fitting where finding what y equals takes awhile but inputting values into y = 62.56*x +76 is really easy. Recurrent NN have the same advantages except for one major disadvantage. The networks FORGET old info. Basically the more cycles that happen, the old data has less and less of an impact on the output. Currently this is a fast enough drop off that recurrent neural networks aren&amp;#39;t that useful but research is being done to find better and better algorithms that avoid that forgetfulness. Hope that helps.&lt;/p&gt;\n\n&lt;p&gt;TL;DR Learning in NN is slow but using them is very fast. But networks that work like our brain are bad at the learning part.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5wtjk", "score_hidden": false, "stickied": false, "created": 1492035222.0, "created_utc": 1492006422.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg6ayuq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "BigEvilTurtle", "parent_id": "t1_dg5v6kc", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Our brain only has so much energy. Imagine all the things we \"know\" as a diagram of nodes and links. Nodes are concepts we've come to learn, and links connect closely related nodes. How we scan and retrieve information in our minds works like this; it's a semantic network. There's a concept called spreading activation. This refers to how our mind scans this semantic network. When we try to remember something or retrieve information in our minds, nodes activate and the energy of this activation spreads to other nodes via the links. Over time, the energy spreading from node to node decays. Nodes with more links distribute less activation energy to each individual link. So a concept for which we have a lot of semantically related concepts linked consumes more mental energy in retrieval. It's way more complicated than this but I'm simplifying as best as I can. How we retrieve information is very much affected by our semantic memory, how we encode information and our interpretation of events. Top-down processing. Our brains are not \"effective\" at retrieving information as it's heavily warped by encoding efficiency (details are lost) and top-down processing (how we remember things is influenced by closely related semantic concepts).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Our brain only has so much energy. Imagine all the things we &amp;quot;know&amp;quot; as a diagram of nodes and links. Nodes are concepts we&amp;#39;ve come to learn, and links connect closely related nodes. How we scan and retrieve information in our minds works like this; it&amp;#39;s a semantic network. There&amp;#39;s a concept called spreading activation. This refers to how our mind scans this semantic network. When we try to remember something or retrieve information in our minds, nodes activate and the energy of this activation spreads to other nodes via the links. Over time, the energy spreading from node to node decays. Nodes with more links distribute less activation energy to each individual link. So a concept for which we have a lot of semantically related concepts linked consumes more mental energy in retrieval. It&amp;#39;s way more complicated than this but I&amp;#39;m simplifying as best as I can. How we retrieve information is very much affected by our semantic memory, how we encode information and our interpretation of events. Top-down processing. Our brains are not &amp;quot;effective&amp;quot; at retrieving information as it&amp;#39;s heavily warped by encoding efficiency (details are lost) and top-down processing (how we remember things is influenced by closely related semantic concepts).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6ayuq", "score_hidden": false, "stickied": false, "created": 1492050335.0, "created_utc": 1492021535.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vywk", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "retrospy", "parent_id": "t1_dg5v6kc", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Middle-out compression?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Middle-out compression?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5vywk", "score_hidden": false, "stickied": false, "created": 1492034139.0, "created_utc": 1492005339.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vrnf", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "oguzthedoc", "parent_id": "t1_dg5v6kc", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "It would be. And that's why people are trying to build computers that work like human brain. The problem is we don't know how the brain works good enough to replicate its structure. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It would be. And that&amp;#39;s why people are trying to build computers that work like human brain. The problem is we don&amp;#39;t know how the brain works good enough to replicate its structure. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5vrnf", "score_hidden": false, "stickied": false, "created": 1492033881.0, "created_utc": 1492005081.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5wpdf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "arclogos", "parent_id": "t1_dg5v6kc", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "You're overestimating how efficient the brain is. You seem to think it's the BEST method when it's nowhere near close. Just because it's your brain and responsible for you doesn't mean it's not a design that is thousands of years old and running on some pretty bootlegged firmware.\n\nTldr; put less faith in your brain, it works significantly less well than you might imagine.", "edited": 1492006505.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re overestimating how efficient the brain is. You seem to think it&amp;#39;s the BEST method when it&amp;#39;s nowhere near close. Just because it&amp;#39;s your brain and responsible for you doesn&amp;#39;t mean it&amp;#39;s not a design that is thousands of years old and running on some pretty bootlegged firmware.&lt;/p&gt;\n\n&lt;p&gt;Tldr; put less faith in your brain, it works significantly less well than you might imagine.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5wpdf", "score_hidden": false, "stickied": false, "created": 1492035081.0, "created_utc": 1492006281.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg6bep9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "14489553421138532110", "parent_id": "t1_dg5v6kc", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Can you remember every single word you've read for the past 24 hours?\n\nA program could.\n\nBrains aren't efficient at **storing** data.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you remember every single word you&amp;#39;ve read for the past 24 hours?&lt;/p&gt;\n\n&lt;p&gt;A program could.&lt;/p&gt;\n\n&lt;p&gt;Brains aren&amp;#39;t efficient at &lt;strong&gt;storing&lt;/strong&gt; data.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6bep9", "score_hidden": false, "stickied": false, "created": 1492050783.0, "created_utc": 1492021983.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v6kc", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Klingonadvocate", "parent_id": "t1_dg5trtu", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 1, "body": "But if it isn't efficient for storing data then it isn't a data structure based on our brain, is it? My question was that if we make a data structure just as the brain store/ data, then wouldn't the pop and push functions be really fast and independent of the size of the dataset. As our brain is very effective for storing and retrieving data so a data structure based on its design should be equally effective, shouldn't it?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But if it isn&amp;#39;t efficient for storing data then it isn&amp;#39;t a data structure based on our brain, is it? My question was that if we make a data structure just as the brain store/ data, then wouldn&amp;#39;t the pop and push functions be really fast and independent of the size of the dataset. As our brain is very effective for storing and retrieving data so a data structure based on its design should be equally effective, shouldn&amp;#39;t it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5v6kc", "score_hidden": false, "stickied": false, "created": 1492033095.0, "created_utc": 1492004295.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5trtu", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "ForOhForError", "parent_id": "t1_dg5qcke", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "The networks are generally slow because:\n\n1. They're (mostly) done in software, which is always slower than hardware.\n\n2. The structure isn't particularly efficient for storing data - there are already data structures with fast retrieval that serve this purpose better.\n\nHowever, they're better than a lot of other approaches when it comes to machine learning, and there's plenty of projects and research around them at the moment. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The networks are generally slow because:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;They&amp;#39;re (mostly) done in software, which is always slower than hardware.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The structure isn&amp;#39;t particularly efficient for storing data - there are already data structures with fast retrieval that serve this purpose better.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;However, they&amp;#39;re better than a lot of other approaches when it comes to machine learning, and there&amp;#39;s plenty of projects and research around them at the moment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5trtu", "score_hidden": false, "stickied": false, "created": 1492031042.0, "created_utc": 1492002242.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5wa6a", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "arclogos", "parent_id": "t1_dg5vj91", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Your issue lies in order of magnitude. It will take you at least an entire second for your brain to form the question. During that time your brain is working to answer it. \nFast computers with solid state hard drives can search and recall information much much faster, we're talking fractions of a a second here, too small for you to really even percieve.\nAdditionally it is very unrealistic to think that your brain answers instantly. Try doing speed flash cards. Unless you've been doing the same set repeatedly and it's very fresh in your short term you will need at least a second or two.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your issue lies in order of magnitude. It will take you at least an entire second for your brain to form the question. During that time your brain is working to answer it. \nFast computers with solid state hard drives can search and recall information much much faster, we&amp;#39;re talking fractions of a a second here, too small for you to really even percieve.\nAdditionally it is very unrealistic to think that your brain answers instantly. Try doing speed flash cards. Unless you&amp;#39;ve been doing the same set repeatedly and it&amp;#39;s very fresh in your short term you will need at least a second or two.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5wa6a", "score_hidden": false, "stickied": false, "created": 1492034547.0, "created_utc": 1492005747.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5z6o6", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jeremymeyers", "parent_id": "t1_dg5vj91", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "It takes time, but the fact that it takes time is not accessible to \"you\" (in the \"conscious self\"meaning of the word \"you\").  For more, check orlit \"incognito: the secret lives of the brain\"by David Eagleman", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It takes time, but the fact that it takes time is not accessible to &amp;quot;you&amp;quot; (in the &amp;quot;conscious self&amp;quot;meaning of the word &amp;quot;you&amp;quot;).  For more, check orlit &amp;quot;incognito: the secret lives of the brain&amp;quot;by David Eagleman&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5z6o6", "score_hidden": false, "stickied": false, "created": 1492037977.0, "created_utc": 1492009177.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg6uw09", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "96385", "parent_id": "t1_dg5vj91", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "There is a delay between when your brain starts processing and when you become conscious of the thought. It's similar to the delay between when a computer receives a command and when the information actually shows shows up on the screen. We are not aware of exactly when the commands are received by our brains either. We are only aware of when they are passed on to our consciousness. By the time we \"realize\" something, our brain has already processed all sorts of things out of our view. The net effect is really no perceived delay at all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a delay between when your brain starts processing and when you become conscious of the thought. It&amp;#39;s similar to the delay between when a computer receives a command and when the information actually shows shows up on the screen. We are not aware of exactly when the commands are received by our brains either. We are only aware of when they are passed on to our consciousness. By the time we &amp;quot;realize&amp;quot; something, our brain has already processed all sorts of things out of our view. The net effect is really no perceived delay at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6uw09", "score_hidden": false, "stickied": false, "created": 1492072950.0, "created_utc": 1492044150.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vj91", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Klingonadvocate", "parent_id": "t1_dg5v0rt", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I don't get what you mean by it isn't a part of my conscious experience. Say I was to remember what I wore on my 10th birthday and by the time I think of the question, my brain provides me with the answer. So where was the delay in finding the answer?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t get what you mean by it isn&amp;#39;t a part of my conscious experience. Say I was to remember what I wore on my 10th birthday and by the time I think of the question, my brain provides me with the answer. So where was the delay in finding the answer?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5vj91", "score_hidden": false, "stickied": false, "created": 1492033572.0, "created_utc": 1492004772.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5v0rt", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "jeremymeyers", "parent_id": "t1_dg5qcke", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Also keep in mind that the concept of \"being able to retrieve information instantly\"is also an illusory function of the brain. It does in fact take time which is not part of your conscious experience usually.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also keep in mind that the concept of &amp;quot;being able to retrieve information instantly&amp;quot;is also an illusory function of the brain. It does in fact take time which is not part of your conscious experience usually.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5v0rt", "score_hidden": false, "stickied": false, "created": 1492032871.0, "created_utc": 1492004071.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5tugy", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Konkatzenator", "parent_id": "t1_dg5qcke", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I would think you would have to factor out the speed differences between how fast synapses can fire and how quickly we can access data stored in memory or disk - plus any travel time if the data is in a separate physical location.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would think you would have to factor out the speed differences between how fast synapses can fire and how quickly we can access data stored in memory or disk - plus any travel time if the data is in a separate physical location.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5tugy", "score_hidden": false, "stickied": false, "created": 1492031157.0, "created_utc": 1492002357.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5vo7c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thijser2", "parent_id": "t1_dg5qcke", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "These networks are much slower, and the human brain can only store a relatively small amount of data. Actually your entire memory capacity is probably far lower than that of a hard disk. You actually only store pieces of memories and your brain then fills in the blanks afterwards, this is why human memory is fallible, you remember that a car hit a cyclist a few weeks ago and when you try to remember your brain probably decides that cyclist was probably wearing jeans. \n\nNote that these networks are fast in biology because each neuron (brain cell) is basically it's own computer and can communicate pretty quickly with others. We cannot do that very well with digital neural networks as the resulting computer would be huge and just waiting for one signal to come from one side of the server to the other would take far longer then just storing all the data of a large number of neurons inside of a single GPU and running it on there instead. \n\nWhat these artificial neural networks are really good at is dealing with damaged input and either classifying or restoring it. You might reconsider a picture of somebody even if I showed you a picture like [this](http://www.rootschat.com/forum/index.php?action=dlattach;topic=644904.0;attach=367350;image) if you knew the person in the picture you could still recognize them. A computer with a artificial neural network can do the same but more conventional programming approaches cannot. \n\n\nBut what remains important is that we don't quite know how the brain works or how to replicate that. This is likely to chance as in the last decade we have learned more then the 100 years before that and in that time we learned more about the brain than we ever did before. One important problem is that real brains work in real time, most of our imitation brains work with one problem at a time and often with layers of neurons and communication that only goes in one direction. This makes it very easy for us to find out which neurons did the \"right\" thing and which onces were acting incorrectly and punish/reward each individual neuron accordingly. Getting this working in real time with multiple events going on at once and while dealing with the fact that things you did in the past can affect the future makes it much harder. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;These networks are much slower, and the human brain can only store a relatively small amount of data. Actually your entire memory capacity is probably far lower than that of a hard disk. You actually only store pieces of memories and your brain then fills in the blanks afterwards, this is why human memory is fallible, you remember that a car hit a cyclist a few weeks ago and when you try to remember your brain probably decides that cyclist was probably wearing jeans. &lt;/p&gt;\n\n&lt;p&gt;Note that these networks are fast in biology because each neuron (brain cell) is basically it&amp;#39;s own computer and can communicate pretty quickly with others. We cannot do that very well with digital neural networks as the resulting computer would be huge and just waiting for one signal to come from one side of the server to the other would take far longer then just storing all the data of a large number of neurons inside of a single GPU and running it on there instead. &lt;/p&gt;\n\n&lt;p&gt;What these artificial neural networks are really good at is dealing with damaged input and either classifying or restoring it. You might reconsider a picture of somebody even if I showed you a picture like &lt;a href=\"http://www.rootschat.com/forum/index.php?action=dlattach;topic=644904.0;attach=367350;image\"&gt;this&lt;/a&gt; if you knew the person in the picture you could still recognize them. A computer with a artificial neural network can do the same but more conventional programming approaches cannot. &lt;/p&gt;\n\n&lt;p&gt;But what remains important is that we don&amp;#39;t quite know how the brain works or how to replicate that. This is likely to chance as in the last decade we have learned more then the 100 years before that and in that time we learned more about the brain than we ever did before. One important problem is that real brains work in real time, most of our imitation brains work with one problem at a time and often with layers of neurons and communication that only goes in one direction. This makes it very easy for us to find out which neurons did the &amp;quot;right&amp;quot; thing and which onces were acting incorrectly and punish/reward each individual neuron accordingly. Getting this working in real time with multiple events going on at once and while dealing with the fact that things you did in the past can affect the future makes it much harder. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5vo7c", "score_hidden": false, "stickied": false, "created": 1492033754.0, "created_utc": 1492004954.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg6be4b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BunnyBlue896", "parent_id": "t1_dg5qcke", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Constant time? I'm not so sure. People can't really tell the difference in timing between 1ms-10ms. I don't know anything about this subject but I suspect that search time is not constant but rather the differences are so small they all seem instant. Additionally, there are things like \"tip of the tongue\" that indicate otherwise to me. Pure guess though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Constant time? I&amp;#39;m not so sure. People can&amp;#39;t really tell the difference in timing between 1ms-10ms. I don&amp;#39;t know anything about this subject but I suspect that search time is not constant but rather the differences are so small they all seem instant. Additionally, there are things like &amp;quot;tip of the tongue&amp;quot; that indicate otherwise to me. Pure guess though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6be4b", "score_hidden": false, "stickied": false, "created": 1492050766.0, "created_utc": 1492021966.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5qcke", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Klingonadvocate", "parent_id": "t1_dg5os5h", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "But our brain can retrieve most information in constant time, however large the dataset may be. So are these networks as fast as well?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But our brain can retrieve most information in constant time, however large the dataset may be. So are these networks as fast as well?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5qcke", "score_hidden": false, "stickied": false, "created": 1492024484.0, "created_utc": 1491995684.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5os5h", "gilded": 0, "archived": false, "score": 101, "report_reasons": null, "author": "m3rl0c", "parent_id": "t1_dg5oovj", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Glad you asked. A dozen or so already exist, they're called [artificial neural networks](https://en.wikipedia.org/wiki/Artificial_neural_network) and as you've probably guessed by now, they're indeed part based on a biological brains neurology. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad you asked. A dozen or so already exist, they&amp;#39;re called &lt;a href=\"https://en.wikipedia.org/wiki/Artificial_neural_network\"&gt;artificial neural networks&lt;/a&gt; and as you&amp;#39;ve probably guessed by now, they&amp;#39;re indeed part based on a biological brains neurology. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5os5h", "score_hidden": false, "stickied": false, "created": 1492020036.0, "created_utc": 1491991236.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 101}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oovj", "gilded": 0, "archived": false, "score": 66, "report_reasons": null, "author": "Klingonadvocate", "parent_id": "t1_dg5ol3k", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Because you mentioned computer science, I was wondering that if we make a data structure similar to how brain stores data and algorithms similar to how it retrieves it, wouldn't it be super super duper fast?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Because you mentioned computer science, I was wondering that if we make a data structure similar to how brain stores data and algorithms similar to how it retrieves it, wouldn&amp;#39;t it be super super duper fast?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5oovj", "score_hidden": false, "stickied": false, "created": 1492019755.0, "created_utc": 1491990955.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 66}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ol3k", "gilded": 0, "archived": false, "score": 129, "report_reasons": null, "author": "m3rl0c", "parent_id": "t1_dg5k6yr", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "On a side note, it's scary how similar this is to a standard computer program. Data can be saved, cached in computer RAM (think short term brain memory) and then the machine can quickly retrieve the data it needs based on metrics comparable to \"whatever is repeated most\" - scary.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On a side note, it&amp;#39;s scary how similar this is to a standard computer program. Data can be saved, cached in computer RAM (think short term brain memory) and then the machine can quickly retrieve the data it needs based on metrics comparable to &amp;quot;whatever is repeated most&amp;quot; - scary.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5ol3k", "score_hidden": false, "stickied": false, "created": 1492019431.0, "created_utc": 1491990631.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 129}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5k6yr", "gilded": 0, "archived": false, "score": 355, "report_reasons": null, "author": "avengerintraining", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This isn't completely understood but we know some things about how it works.  We have 100 billion neurons that any one can connect to multiple others.  Any sensory input we have can make many connections.  But any single neural connection doesn't amount to anything mentally tangible and can be undone (short term memory).  Repetition makes multiple connections that basically maps out some concept in your brain.  Then, as you repeatedly traverse this mapped concept, or map whole other concepts together, the brain also processes these signals to form shortcuts for those \"mapped concepts\" with even more neural connections, so that accessing that stored information is faster.  The brain is continuously reconfiguring these connections based on the input it receives (what you are doing) so whatever is repeated most could be retrieved the fastest.  Trying to remember something is basically your brain looking for those shortcuts and if you were providing other sensory input, the reconfiguring to optimize whatever you were attentive would have used some of those neurons. Things you remember very easily, the connections were repeated enough to make so many connections that they'd never be completely undone again in your lifetime.", "edited": 1492007491.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t completely understood but we know some things about how it works.  We have 100 billion neurons that any one can connect to multiple others.  Any sensory input we have can make many connections.  But any single neural connection doesn&amp;#39;t amount to anything mentally tangible and can be undone (short term memory).  Repetition makes multiple connections that basically maps out some concept in your brain.  Then, as you repeatedly traverse this mapped concept, or map whole other concepts together, the brain also processes these signals to form shortcuts for those &amp;quot;mapped concepts&amp;quot; with even more neural connections, so that accessing that stored information is faster.  The brain is continuously reconfiguring these connections based on the input it receives (what you are doing) so whatever is repeated most could be retrieved the fastest.  Trying to remember something is basically your brain looking for those shortcuts and if you were providing other sensory input, the reconfiguring to optimize whatever you were attentive would have used some of those neurons. Things you remember very easily, the connections were repeated enough to make so many connections that they&amp;#39;d never be completely undone again in your lifetime.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5k6yr", "score_hidden": false, "stickied": false, "created": 1492006698.0, "created_utc": 1491977898.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 355}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5u9a3", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "robustoutlier", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "The brain is soft like porridge, but contains several* thread-like cells called neurons. The neurons are tied together in different circuits. Scientists know that electricity flows through these neurons and can trace the flow. Scientists can also study individual neurons, but because there are so many of them, they can only study a selected few at a single point in time.\n\nOne part of the brain contains a special circuit, called the hippocampus. One patient once needed surgery because there was some misswiring of the neurons, which caused epilepsy. Today, this type of surgery is a rare choice of treatment, but the doctors had no better option back then in trying to relieve the patient from the suffering that his epilepsy caused. They removed the hippocampus. The consequence was that the today famous patient - Henry Molaison - could not remember things in the long-term.\n\nScientists know that the hippocampus is crucial for long-term memories, but despite decades of research, little is known about the nature of the storage of memories. One very likely explanation is the formation of very small proteins that grow on the tree-like part of the neuron - the dendrites. Memories are probably stored like small buds on a tree with many branches and each neuron in the hippocampus has multiple \"trees\" like this.\n\nThe many dendrites of neurons reach out to other neurons and receive electricity from them. This electricity is then passed on to a single branch of the neuron called the axon. In one part of the hippocampus there is a loop between the neurons, which probably means that there is some kind of rehearsal mechanism, as the electricity passes around the loop multiple times. This could strengthen the memories that are important to remember.\n\nAlthough the hippocampus is very important for creating new memories, other parts of the brain are just as important in recovering stored information. The interaction between the deeply seated hippocampus and the rest of the bark-like part of the brain - the cortex - interact when processing memories, both during storing and retrieval.\n\nWhen neurons get continuously excited in the same circuit, over and over again, the neurons become trained to give a stronger signal. The result is what we call long-term potentiation (LTP). This is one of the major ways that learning works in the brain. When retrieving memories, the strength of the connections between different neurons could determine what should be remembered. The principle behind the idea that \"Neurons that fire together, wire together\" is called Hebbian learning.\n\n\n**Edit:** * More than stars in the known universe.", "edited": 1492087473.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The brain is soft like porridge, but contains several* thread-like cells called neurons. The neurons are tied together in different circuits. Scientists know that electricity flows through these neurons and can trace the flow. Scientists can also study individual neurons, but because there are so many of them, they can only study a selected few at a single point in time.&lt;/p&gt;\n\n&lt;p&gt;One part of the brain contains a special circuit, called the hippocampus. One patient once needed surgery because there was some misswiring of the neurons, which caused epilepsy. Today, this type of surgery is a rare choice of treatment, but the doctors had no better option back then in trying to relieve the patient from the suffering that his epilepsy caused. They removed the hippocampus. The consequence was that the today famous patient - Henry Molaison - could not remember things in the long-term.&lt;/p&gt;\n\n&lt;p&gt;Scientists know that the hippocampus is crucial for long-term memories, but despite decades of research, little is known about the nature of the storage of memories. One very likely explanation is the formation of very small proteins that grow on the tree-like part of the neuron - the dendrites. Memories are probably stored like small buds on a tree with many branches and each neuron in the hippocampus has multiple &amp;quot;trees&amp;quot; like this.&lt;/p&gt;\n\n&lt;p&gt;The many dendrites of neurons reach out to other neurons and receive electricity from them. This electricity is then passed on to a single branch of the neuron called the axon. In one part of the hippocampus there is a loop between the neurons, which probably means that there is some kind of rehearsal mechanism, as the electricity passes around the loop multiple times. This could strengthen the memories that are important to remember.&lt;/p&gt;\n\n&lt;p&gt;Although the hippocampus is very important for creating new memories, other parts of the brain are just as important in recovering stored information. The interaction between the deeply seated hippocampus and the rest of the bark-like part of the brain - the cortex - interact when processing memories, both during storing and retrieval.&lt;/p&gt;\n\n&lt;p&gt;When neurons get continuously excited in the same circuit, over and over again, the neurons become trained to give a stronger signal. The result is what we call long-term potentiation (LTP). This is one of the major ways that learning works in the brain. When retrieving memories, the strength of the connections between different neurons could determine what should be remembered. The principle behind the idea that &amp;quot;Neurons that fire together, wire together&amp;quot; is called Hebbian learning.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; * More than stars in the known universe.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5u9a3", "score_hidden": false, "stickied": false, "created": 1492031780.0, "created_utc": 1492002980.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5nzoq", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "wenheda-heda", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Something to do with synapses + action potentials + repetition = strengthening of occurrence of action potentials + increase in number of synaptic clefts and bonding regions = increasing number of neurons relating to that memory or already established neurons have stronger connections\n\nMemory is \"stored\" in these neurons and when they are not used often they become weak and recycled so you forget useless stuff, when neurons are damaged physically (ie. Blunt force, concussion) by external force, or physically by internal force (ie. Stroke brain hemorrhage, plaques related to dementia in old age) the neurons die and cannot be regenerated. \n\nI don't know the exact process of the searching part but I imagine when you're searching, you're also recollecting related images, sounds, other related memories of this instance and these processes happen to fire and set off relating nearby neurons and they keep firing off others that are connected until a region is triggered that allows you to recall that desired targeted memory. \n\nSorry if this isn't helpful, I've learnt it many times as a student but never really paid that much attention, I had a background in physiology and science psychology. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something to do with synapses + action potentials + repetition = strengthening of occurrence of action potentials + increase in number of synaptic clefts and bonding regions = increasing number of neurons relating to that memory or already established neurons have stronger connections&lt;/p&gt;\n\n&lt;p&gt;Memory is &amp;quot;stored&amp;quot; in these neurons and when they are not used often they become weak and recycled so you forget useless stuff, when neurons are damaged physically (ie. Blunt force, concussion) by external force, or physically by internal force (ie. Stroke brain hemorrhage, plaques related to dementia in old age) the neurons die and cannot be regenerated. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know the exact process of the searching part but I imagine when you&amp;#39;re searching, you&amp;#39;re also recollecting related images, sounds, other related memories of this instance and these processes happen to fire and set off relating nearby neurons and they keep firing off others that are connected until a region is triggered that allows you to recall that desired targeted memory. &lt;/p&gt;\n\n&lt;p&gt;Sorry if this isn&amp;#39;t helpful, I&amp;#39;ve learnt it many times as a student but never really paid that much attention, I had a background in physiology and science psychology. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5nzoq", "score_hidden": false, "stickied": false, "created": 1492017563.0, "created_utc": 1491988763.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg7hwpu", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "noman2561", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I work in artificial intelligence and I can give you a different perspective on how intelligent systems store memory. In AI we study the brain because it's our best natural example of intelligence. \n\nLet's work through an example. Your intelligent system uses a camera to see with. It sees an apple and an orange. When the light hits the grid of optical sensors, each sensor responds differently. This response signal is then interpreted. You have to somehow get from \"this is a pattern of lights\" to \"this is an apple and an orange\". That's where your memory comes in. Your system has some idea of what an apple is. That idea is called a model and is comprised of the different features of an apple. Apples are red or yellow, have a certain shape, taste, and feel. Your apple model accounts for the variances of size, texture, taste, etc. so you're not keeping a perfect record of every apple you've ever encountered but instead a record of the types of apples and their characteristics. The same is true for an orange. When your system assesses the image, it's not looking for an apple or an orange; it's looking for characteristics that tell them apart. If it sees red instead of orange, it can stop looking for characteristics of an orange. Once it has determined that that portion of the image contains an apple, it updates its apple model to account for the new experience. Sometimes it's a big change but most of the time no change is required. \n\nYour human brain works the same way. When you think of an apple, you think of what sets it apart from everything that's not an apple. Your brain actually takes it a step farther and considers timing as a factor. You recognize dancing as a series of movements for a specific purpose usually to a beat. It's hard to formally define dancing because so many things share the characteristics of dancing (it's that way in all forms of art). One of our biggest strengths is our ability to abstract our own memories so that we can identify both an apple and an orange as fruit and then recognize other fruits without relating them to apples or oranges. \n\nSo in summary, you don't remember every little thing you've ever encountered but you remember what makes each type of thing unique. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work in artificial intelligence and I can give you a different perspective on how intelligent systems store memory. In AI we study the brain because it&amp;#39;s our best natural example of intelligence. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s work through an example. Your intelligent system uses a camera to see with. It sees an apple and an orange. When the light hits the grid of optical sensors, each sensor responds differently. This response signal is then interpreted. You have to somehow get from &amp;quot;this is a pattern of lights&amp;quot; to &amp;quot;this is an apple and an orange&amp;quot;. That&amp;#39;s where your memory comes in. Your system has some idea of what an apple is. That idea is called a model and is comprised of the different features of an apple. Apples are red or yellow, have a certain shape, taste, and feel. Your apple model accounts for the variances of size, texture, taste, etc. so you&amp;#39;re not keeping a perfect record of every apple you&amp;#39;ve ever encountered but instead a record of the types of apples and their characteristics. The same is true for an orange. When your system assesses the image, it&amp;#39;s not looking for an apple or an orange; it&amp;#39;s looking for characteristics that tell them apart. If it sees red instead of orange, it can stop looking for characteristics of an orange. Once it has determined that that portion of the image contains an apple, it updates its apple model to account for the new experience. Sometimes it&amp;#39;s a big change but most of the time no change is required. &lt;/p&gt;\n\n&lt;p&gt;Your human brain works the same way. When you think of an apple, you think of what sets it apart from everything that&amp;#39;s not an apple. Your brain actually takes it a step farther and considers timing as a factor. You recognize dancing as a series of movements for a specific purpose usually to a beat. It&amp;#39;s hard to formally define dancing because so many things share the characteristics of dancing (it&amp;#39;s that way in all forms of art). One of our biggest strengths is our ability to abstract our own memories so that we can identify both an apple and an orange as fruit and then recognize other fruits without relating them to apples or oranges. &lt;/p&gt;\n\n&lt;p&gt;So in summary, you don&amp;#39;t remember every little thing you&amp;#39;ve ever encountered but you remember what makes each type of thing unique. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg7hwpu", "score_hidden": false, "stickied": false, "created": 1492116817.0, "created_utc": 1492088017.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6awaz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "penny_farting", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Others have already explained this on a neural level, so I’ll defer to their answers for that. But on a conceptual level, different aspects of a memory are stored in the corresponding parts of the brain. So the visual stuff is stored in the part of your brain that processes visual information, sounds in the sound processing part, etc. A structure in your brain called the hippocampus is responsible for linking together all these different pieces when storing the memory. When it comes time to remember this event, the hippocampus pulls on these links to bring the pieces back together. This usually happens in a cascade of activation – retrieving one part of the memory triggers another part, and so on until you have a complete memory.\n\nIn terms of actively searching for a memory, it is thought that we have to work our way down through hierarchical levels of specificity. So if I’m trying to remember a specific time I played tennis, first the hippocampus might retrieve broad information about my time at college when I played, then activate information about the general routine of playing tennis, before eventually focusing in on a specific event. Sometimes we're not able to make it to the specific event, so we're left with just generic information about it. Sometimes if we're given a good enough cue or index, we can bypass these steps and just go straight to the memory.\n\nNote that there are different systems for dealing with different types of memories. So for example, remembering how to ride a bike (procedural memory), remembering the name of the 34th president (semantic memory), and remembering what you did on your last birthday (episodic memory) all use somewhat different methods of storage and retrieval. I’ve outlined what we believe happens in the last case. Of course, we don’t know how this works for certain, these are just the best theories we have at the moment.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Others have already explained this on a neural level, so I’ll defer to their answers for that. But on a conceptual level, different aspects of a memory are stored in the corresponding parts of the brain. So the visual stuff is stored in the part of your brain that processes visual information, sounds in the sound processing part, etc. A structure in your brain called the hippocampus is responsible for linking together all these different pieces when storing the memory. When it comes time to remember this event, the hippocampus pulls on these links to bring the pieces back together. This usually happens in a cascade of activation – retrieving one part of the memory triggers another part, and so on until you have a complete memory.&lt;/p&gt;\n\n&lt;p&gt;In terms of actively searching for a memory, it is thought that we have to work our way down through hierarchical levels of specificity. So if I’m trying to remember a specific time I played tennis, first the hippocampus might retrieve broad information about my time at college when I played, then activate information about the general routine of playing tennis, before eventually focusing in on a specific event. Sometimes we&amp;#39;re not able to make it to the specific event, so we&amp;#39;re left with just generic information about it. Sometimes if we&amp;#39;re given a good enough cue or index, we can bypass these steps and just go straight to the memory.&lt;/p&gt;\n\n&lt;p&gt;Note that there are different systems for dealing with different types of memories. So for example, remembering how to ride a bike (procedural memory), remembering the name of the 34th president (semantic memory), and remembering what you did on your last birthday (episodic memory) all use somewhat different methods of storage and retrieval. I’ve outlined what we believe happens in the last case. Of course, we don’t know how this works for certain, these are just the best theories we have at the moment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6awaz", "score_hidden": false, "stickied": false, "created": 1492050267.0, "created_utc": 1492021467.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg679pp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "d-L68", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I've read recently that each time you remember an incident, you aren't remembering the actual incident but rather the last time you remembered it,  how far out is that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read recently that each time you remember an incident, you aren&amp;#39;t remembering the actual incident but rather the last time you remembered it,  how far out is that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg679pp", "score_hidden": false, "stickied": false, "created": 1492046587.0, "created_utc": 1492017787.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5hmfd", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5hmfd", "score_hidden": false, "stickied": false, "created": 1492001397.0, "created_utc": 1491972597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg6a6eq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kbg12ila", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Think of it like the sd card on a camera. The camera lens is your eyes, the sd card is your long term memory, when you are trying to remember something you remember through the senses you felt at that point and your memory travels from your long term memory to your short term memory and you can recall the information from there.\n\nShort term memory is memory you recently stored that you can easily recall from in a short time frame although it leaves if forgotten and it goes to long term memory if you revise that memory. \n\nI hope this is sufficient. It's what I can remember from high school psychology. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Think of it like the sd card on a camera. The camera lens is your eyes, the sd card is your long term memory, when you are trying to remember something you remember through the senses you felt at that point and your memory travels from your long term memory to your short term memory and you can recall the information from there.&lt;/p&gt;\n\n&lt;p&gt;Short term memory is memory you recently stored that you can easily recall from in a short time frame although it leaves if forgotten and it goes to long term memory if you revise that memory. &lt;/p&gt;\n\n&lt;p&gt;I hope this is sufficient. It&amp;#39;s what I can remember from high school psychology. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6a6eq", "score_hidden": false, "stickied": false, "created": 1492049528.0, "created_utc": 1492020728.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6jy3b", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Horror_Clause_HoHoHo", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Consciousness is not dependant on the brain. It has a non local source. \n\nImagine your computer/phone/device....it simply shows you the internet one page at a time, bit by bit. But the ENTIRE internet doesn't exist within your device, it is simply a tool to display for you data which exists all around us all the time but goes undetected by human senses. But you can't deny they're there. \n\nConsciousness is energy, living and intelligent energy. In order to experience physical reality, that energy needs a vehicle to translate the incoming data of sight, sound, touch and taste. Our bodes and brains are just conductors that allow a non-physical entity to be immersed in reality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Consciousness is not dependant on the brain. It has a non local source. &lt;/p&gt;\n\n&lt;p&gt;Imagine your computer/phone/device....it simply shows you the internet one page at a time, bit by bit. But the ENTIRE internet doesn&amp;#39;t exist within your device, it is simply a tool to display for you data which exists all around us all the time but goes undetected by human senses. But you can&amp;#39;t deny they&amp;#39;re there. &lt;/p&gt;\n\n&lt;p&gt;Consciousness is energy, living and intelligent energy. In order to experience physical reality, that energy needs a vehicle to translate the incoming data of sight, sound, touch and taste. Our bodes and brains are just conductors that allow a non-physical entity to be immersed in reality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6jy3b", "score_hidden": false, "stickied": false, "created": 1492059626.0, "created_utc": 1492030826.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg6f0jw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "onthedownlows", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Have a listen to Tim Lovejoy podcast with interview with Dr Julia Shaw about memory. \n\nBad description but explains that each memory us like a spiders web across the brain; that is why you can remember using different parts of the brain; smell, visual, feelings at the time etc\n\nhttps://itunes.apple.com/gb/podcast/dear-lovejoy/id1196671475?mt=2&amp;i=1000384008798", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have a listen to Tim Lovejoy podcast with interview with Dr Julia Shaw about memory. &lt;/p&gt;\n\n&lt;p&gt;Bad description but explains that each memory us like a spiders web across the brain; that is why you can remember using different parts of the brain; smell, visual, feelings at the time etc&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://itunes.apple.com/gb/podcast/dear-lovejoy/id1196671475?mt=2&amp;amp;i=1000384008798\"&gt;https://itunes.apple.com/gb/podcast/dear-lovejoy/id1196671475?mt=2&amp;amp;i=1000384008798&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6f0jw", "score_hidden": false, "stickied": false, "created": 1492054505.0, "created_utc": 1492025705.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5xwe7", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Klingonadvocate", "parent_id": "t1_dg5vms6", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "r/wholesomememes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/wholesomememes\"&gt;r/wholesomememes&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5xwe7", "score_hidden": false, "stickied": false, "created": 1492036510.0, "created_utc": 1492007710.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5vms6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Katzenfriedel", "parent_id": "t1_dg5ulef", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "The human brain is not complex enough to comprehend how complex it is. \n\nmaybe your brain is :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The human brain is not complex enough to comprehend how complex it is. &lt;/p&gt;\n\n&lt;p&gt;maybe your brain is :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5vms6", "score_hidden": false, "stickied": false, "created": 1492033703.0, "created_utc": 1492004903.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ulef", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dingodog290", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 1, "body": "The human brain is not complex enough to comprehend how complex it is. Simple answer; we don't know the answer to your question but those who think they know will impress themselves with posting a complex answer with little meaning at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The human brain is not complex enough to comprehend how complex it is. Simple answer; we don&amp;#39;t know the answer to your question but those who think they know will impress themselves with posting a complex answer with little meaning at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5ulef", "score_hidden": false, "stickied": false, "created": 1492032269.0, "created_utc": 1492003469.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg6bfua", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "igits", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "When it comes to long term memory, the brain actually doesn't store anything . If it did, then hydrocephalic patients couldn't lead normal lives, and yet some of them do, despite having less \"brain\" than usual:\n\n&gt; https://www.youtube.com/watch?v=VSlBVoy_ZOg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When it comes to long term memory, the brain actually doesn&amp;#39;t store anything . If it did, then hydrocephalic patients couldn&amp;#39;t lead normal lives, and yet some of them do, despite having less &amp;quot;brain&amp;quot; than usual:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=VSlBVoy_ZOg\"&gt;https://www.youtube.com/watch?v=VSlBVoy_ZOg&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6bfua", "score_hidden": false, "stickied": false, "created": 1492050815.0, "created_utc": 1492022015.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg6f7yn", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "VerifiedMadgod", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I'll give my take. I'm not a scientist or anything. Just an 18 year old that reads a lot of books. \n\nWe have hundreds of millions of \"memory columns\" which store patterns. 300 Million I believe. (Don't quote me on this, this may be actually the number of maximum simultaneous connections). These memory columns store patterns. Touch a stove that's hot. Ouch! Wouldn't want to do that again. Memory column pattern formed. These columns are all interconnected and many can be just different patterns of the same type with minor variations. When our brain sees something it runs through these hundreds of millions of memory columns searching through the correct pattern, each of them having a different \"weight\" of accuracy. For example if you see a Red apple. You brain might fire two (among millions more) memory columns that relate to apples. One for red apples and one for green. The green memory column will still fire but will have a lower \"weight\" than that of the red apple memory column. To clarify, weight refers to probability, and not mass. \n\nWhen we see something, in reality, hundreds of millions of memory columns fire off, all with various weights, which our brain sorts through, until it finds the proper one, at which point we're able to conclude \"That is a ripe red apple\". \n\nWhen we're born our neocortex is practically void of patterns. We may have a few memory columns related to our mother's heart beat. Which is where our enjoyment for music comes, according to science. We actually have the old brain, and the new brain, we used to not have a neocortex (or at least as advanced of one). Our old brain provides us with pleasure or pain (the reward system). \n\nThere is more to it that I don't know as much about. Like the different processes the different sections of the brain contribute. But quite a fascinating process either way. Two books I'd suggest reading are:\n\n1. How to Create A Mind by Raymond Kurzweil\n2. A Beautiful Question: Finding Nature's Deep Design by Frank Wilczek.\n\nRaymond Kurzweil is the leading pioneer of most computerized recognition systems whether it be speech to text, text to speech synthesis, character recognition, and translation. \n\nFrank Wilczek was awarded the nobel prize in physics for his discovery of Asymptotic Freedom in the theory of the strong force. ", "edited": 1492053439.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll give my take. I&amp;#39;m not a scientist or anything. Just an 18 year old that reads a lot of books. &lt;/p&gt;\n\n&lt;p&gt;We have hundreds of millions of &amp;quot;memory columns&amp;quot; which store patterns. 300 Million I believe. (Don&amp;#39;t quote me on this, this may be actually the number of maximum simultaneous connections). These memory columns store patterns. Touch a stove that&amp;#39;s hot. Ouch! Wouldn&amp;#39;t want to do that again. Memory column pattern formed. These columns are all interconnected and many can be just different patterns of the same type with minor variations. When our brain sees something it runs through these hundreds of millions of memory columns searching through the correct pattern, each of them having a different &amp;quot;weight&amp;quot; of accuracy. For example if you see a Red apple. You brain might fire two (among millions more) memory columns that relate to apples. One for red apples and one for green. The green memory column will still fire but will have a lower &amp;quot;weight&amp;quot; than that of the red apple memory column. To clarify, weight refers to probability, and not mass. &lt;/p&gt;\n\n&lt;p&gt;When we see something, in reality, hundreds of millions of memory columns fire off, all with various weights, which our brain sorts through, until it finds the proper one, at which point we&amp;#39;re able to conclude &amp;quot;That is a ripe red apple&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;When we&amp;#39;re born our neocortex is practically void of patterns. We may have a few memory columns related to our mother&amp;#39;s heart beat. Which is where our enjoyment for music comes, according to science. We actually have the old brain, and the new brain, we used to not have a neocortex (or at least as advanced of one). Our old brain provides us with pleasure or pain (the reward system). &lt;/p&gt;\n\n&lt;p&gt;There is more to it that I don&amp;#39;t know as much about. Like the different processes the different sections of the brain contribute. But quite a fascinating process either way. Two books I&amp;#39;d suggest reading are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;How to Create A Mind by Raymond Kurzweil&lt;/li&gt;\n&lt;li&gt;A Beautiful Question: Finding Nature&amp;#39;s Deep Design by Frank Wilczek.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Raymond Kurzweil is the leading pioneer of most computerized recognition systems whether it be speech to text, text to speech synthesis, character recognition, and translation. &lt;/p&gt;\n\n&lt;p&gt;Frank Wilczek was awarded the nobel prize in physics for his discovery of Asymptotic Freedom in the theory of the strong force. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6f7yn", "score_hidden": false, "stickied": false, "created": 1492054716.0, "created_utc": 1492025916.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nhqb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5nhqb", "score_hidden": false, "stickied": false, "created": 1492015955.0, "created_utc": 1491987155.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg6etzq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "elegant_hardwood", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Why are some people better in recognizing single facts and some are better in remembering whole structures / contexts?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why are some people better in recognizing single facts and some are better in remembering whole structures / contexts?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg6etzq", "score_hidden": false, "stickied": false, "created": 1492054322.0, "created_utc": 1492025522.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5trzt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "_John-Titor_", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "To those people saying that our brains function similar to computers, we can't really say for sure: https://aeon.co/essays/your-brain-does-not-process-information-and-it-is-not-a-computer", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To those people saying that our brains function similar to computers, we can&amp;#39;t really say for sure: &lt;a href=\"https://aeon.co/essays/your-brain-does-not-process-information-and-it-is-not-a-computer\"&gt;https://aeon.co/essays/your-brain-does-not-process-information-and-it-is-not-a-computer&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5trzt", "score_hidden": false, "stickied": false, "created": 1492031049.0, "created_utc": 1492002249.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5otgx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alex-x-x", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "why do some people find it easier to remember things than other people, even though it has been repeated the same number of times?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;why do some people find it easier to remember things than other people, even though it has been repeated the same number of times?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5otgx", "score_hidden": false, "stickied": false, "created": 1492020151.0, "created_utc": 1491991351.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg68ut9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "farstriderr", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Why would you assume the brain stores information?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why would you assume the brain stores information?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg68ut9", "score_hidden": false, "stickied": false, "created": 1492048170.0, "created_utc": 1492019370.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_64w3sl", "likes": null, "replies": "", "user_reports": [], "id": "dg5xxsv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Klingonadvocate", "parent_id": "t1_dg5siit", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "So It can be a penis that I've already seen before? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So It can be a penis that I&amp;#39;ve already seen before? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5xxsv", "score_hidden": false, "stickied": false, "created": 1492036555.0, "created_utc": 1492007755.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5siit", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kulkades", "parent_id": "t1_dg5oi0g", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I garuntee it it , u can click on it . You will not see any new penis in there ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I garuntee it it , u can click on it . You will not see any new penis in there &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5siit", "score_hidden": false, "stickied": false, "created": 1492028980.0, "created_utc": 1492000180.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oi0g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "hazmic", "parent_id": "t1_dg5k335", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I'm on the bus and I do not want to click this link with people around me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m on the bus and I do not want to click this link with people around me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5oi0g", "score_hidden": false, "stickied": false, "created": 1492019168.0, "created_utc": 1491990368.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg5k335", "gilded": 0, "archived": false, "score": -12, "report_reasons": null, "author": "Stefanie0613", "parent_id": "t3_64w3sl", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Apparently, if you clench your fist when trying to remember something, it helps https://s-media-cache-ak0.pinimg.com/736x/1d/89/64/1d8964c1700cf445e34313f9ef96dc8d.jpg", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Apparently, if you clench your fist when trying to remember something, it helps &lt;a href=\"https://s-media-cache-ak0.pinimg.com/736x/1d/89/64/1d8964c1700cf445e34313f9ef96dc8d.jpg\"&gt;https://s-media-cache-ak0.pinimg.com/736x/1d/89/64/1d8964c1700cf445e34313f9ef96dc8d.jpg&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg5k335", "score_hidden": false, "stickied": false, "created": 1492006447.0, "created_utc": 1491977647.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -12}}], "after": null, "before": null}}]