[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Biology", "id": "65aa7o", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 109, "report_reasons": null, "author": "Tominator42", "saved": false, "mod_reports": [], "name": "t3_65aa7o", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Biology", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/65aa7o/eli5_why_is_hand_flapping_a_behavior_common_to/", "num_reports": null, "locked": false, "stickied": false, "created": 1492169279.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/65aa7o/eli5_why_is_hand_flapping_a_behavior_common_to/", "author_flair_text": null, "quarantine": false, "title": "ELI5: Why is hand flapping a behavior common to many people with autism?", "created_utc": 1492140479.0, "distinguished": null, "media": null, "upvote_ratio": 0.84, "num_comments": 35, "visited": false, "subreddit_type": "public", "ups": 109}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65aa7o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8v7f2", "gilded": 0, "archived": false, "score": 135, "report_reasons": null, "author": "Nauin", "parent_id": "t3_65aa7o", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I have high functioning autism and while I don't do the hand flapping thing, I will on rare occasions drum my fingers. I don't do it often enough or in rigid enough contexts to consider it a full blown stim, but I do find myself doing the motion in mid-air when I'm trying to remember something during conversations. I usually drum my fingers against something when I'm extremely stressed or trying to find a solution to a problem or scenario.\n\nLike a majority of people with autism I have Sensory Processing Disorder, sometimes referred to as hypersensitivity. It dials my senses up to eleven and my brain does not have the ability to tune out portions of my environment or any surrounding stimulus, everything is processed at roughly the same level and understandably can be very overwhelming. It takes a lot of focus to be able to 'tune in' to certain things; in my case spoken words if there are multiple sources of background noise, but it can be almost anything you would try to process/learn. Visuals, smells, questions on a test, etc.\n\nStims are self stimulating behaviors that sort of comfort and calm the person doing them. In the cases in which I'm drumming my fingers I can very clearly feel the interior movements of my fingers joints and how that interior motion is unbelievably smooth within the joint itself. Combine that with hearing the clicking of my nails and the vibrations feeding into my fingers as they connect with whatever surface I'm tapping on, and the tiny twinges of the ligaments and muscles after I've done it for an extended period of time... It's incredibly pleasant to process. Also if you can't glean from my description it's a distracting and strong sensation, enough to distract me from all of the extra outside stimulus the average person is able to automatically filter out. You could almost consider it a form of mediation, at least in my case (remember, this disorder is a spectrum, so experiences can vary wildly) since it can calm me down when I'm under a lot of pressure but it also allows me to focus significantly better when needed.\n\nI hope that helps, I'm happy to try and answer more questions or elaborate further if needed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have high functioning autism and while I don&amp;#39;t do the hand flapping thing, I will on rare occasions drum my fingers. I don&amp;#39;t do it often enough or in rigid enough contexts to consider it a full blown stim, but I do find myself doing the motion in mid-air when I&amp;#39;m trying to remember something during conversations. I usually drum my fingers against something when I&amp;#39;m extremely stressed or trying to find a solution to a problem or scenario.&lt;/p&gt;\n\n&lt;p&gt;Like a majority of people with autism I have Sensory Processing Disorder, sometimes referred to as hypersensitivity. It dials my senses up to eleven and my brain does not have the ability to tune out portions of my environment or any surrounding stimulus, everything is processed at roughly the same level and understandably can be very overwhelming. It takes a lot of focus to be able to &amp;#39;tune in&amp;#39; to certain things; in my case spoken words if there are multiple sources of background noise, but it can be almost anything you would try to process/learn. Visuals, smells, questions on a test, etc.&lt;/p&gt;\n\n&lt;p&gt;Stims are self stimulating behaviors that sort of comfort and calm the person doing them. In the cases in which I&amp;#39;m drumming my fingers I can very clearly feel the interior movements of my fingers joints and how that interior motion is unbelievably smooth within the joint itself. Combine that with hearing the clicking of my nails and the vibrations feeding into my fingers as they connect with whatever surface I&amp;#39;m tapping on, and the tiny twinges of the ligaments and muscles after I&amp;#39;ve done it for an extended period of time... It&amp;#39;s incredibly pleasant to process. Also if you can&amp;#39;t glean from my description it&amp;#39;s a distracting and strong sensation, enough to distract me from all of the extra outside stimulus the average person is able to automatically filter out. You could almost consider it a form of mediation, at least in my case (remember, this disorder is a spectrum, so experiences can vary wildly) since it can calm me down when I&amp;#39;m under a lot of pressure but it also allows me to focus significantly better when needed.&lt;/p&gt;\n\n&lt;p&gt;I hope that helps, I&amp;#39;m happy to try and answer more questions or elaborate further if needed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg8v7f2", "score_hidden": false, "stickied": false, "created": 1492180975.0, "created_utc": 1492152175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 135}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65aa7o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8scql", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "Scramptha", "parent_id": "t3_65aa7o", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "It's a common physical tick that feels good and relieves stress. Another common tick is spinning or running in circles, as well as rocking and turning their heads. Doctors sometimes call these behaviors \"stimming\" and it is commonly believed that autists are more sensitive to physical stimulation than most people. This also is thought to be a reason why they can be extremely averse to touch, and are hypersensitive to seams or scratchy fabrics in clothing. This is the general reason why people with autism tend to have so many physical ticks, but why hand flapping specifically is so common isn't well understood.\n\nOne theory is that since they are so prone to physical sensation, and since our hands are incredibly sensitive, hand flapping is akin to yelling for people who tend to communicate with their hands/gestures. This would explain why hand flapping so often accompanies laughter, anger, or just excitement in general. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a common physical tick that feels good and relieves stress. Another common tick is spinning or running in circles, as well as rocking and turning their heads. Doctors sometimes call these behaviors &amp;quot;stimming&amp;quot; and it is commonly believed that autists are more sensitive to physical stimulation than most people. This also is thought to be a reason why they can be extremely averse to touch, and are hypersensitive to seams or scratchy fabrics in clothing. This is the general reason why people with autism tend to have so many physical ticks, but why hand flapping specifically is so common isn&amp;#39;t well understood.&lt;/p&gt;\n\n&lt;p&gt;One theory is that since they are so prone to physical sensation, and since our hands are incredibly sensitive, hand flapping is akin to yelling for people who tend to communicate with their hands/gestures. This would explain why hand flapping so often accompanies laughter, anger, or just excitement in general. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg8scql", "score_hidden": false, "stickied": false, "created": 1492174819.0, "created_utc": 1492146019.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65aa7o", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8shlv", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "yup-i-reddit", "parent_id": "t3_65aa7o", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "There is a theory that folks with autism don't have a good understanding of where their body is in space. This sort of motion gives the person feedback about that. Also, this is why they think weighted blankets are so relaxing to people with autism - it gives them feedback about where their body is in space, without them having to seek it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There is a theory that folks with autism don&amp;#39;t have a good understanding of where their body is in space. This sort of motion gives the person feedback about that. Also, this is why they think weighted blankets are so relaxing to people with autism - it gives them feedback about where their body is in space, without them having to seek it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg8shlv", "score_hidden": false, "stickied": false, "created": 1492175082.0, "created_utc": 1492146282.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65aa7o", "likes": null, "replies": "", "user_reports": [], "id": "dg92mg1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "BCBA", "parent_id": "t3_65aa7o", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "It is clinically referred to as a form of Stereotypy. Often grouped with other repetitive behaviors which have no function with their environment. \n\nAnecdotally, it is said to be a \"stimming\" or \"calming\" behavior, but this may not always be the case for people who develop high rate or long duration patterns of it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is clinically referred to as a form of Stereotypy. Often grouped with other repetitive behaviors which have no function with their environment. &lt;/p&gt;\n\n&lt;p&gt;Anecdotally, it is said to be a &amp;quot;stimming&amp;quot; or &amp;quot;calming&amp;quot; behavior, but this may not always be the case for people who develop high rate or long duration patterns of it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg92mg1", "score_hidden": false, "stickied": false, "created": 1492202046.0, "created_utc": 1492173246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}]