[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see these varieties of communism referenced but I don&amp;#39;t understand the difference. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I see these varieties of communism referenced but I don't understand the difference. ", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Culture", "id": "65advm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 133, "report_reasons": null, "author": "kittyoppression", "saved": false, "mod_reports": [], "name": "t3_65advm", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Culture", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/65advm/eli5_stalinism_vs_maoism_vs_trotsykism/", "num_reports": null, "locked": false, "stickied": false, "created": 1492170665.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/65advm/eli5_stalinism_vs_maoism_vs_trotsykism/", "author_flair_text": null, "quarantine": false, "title": "ELI5 Stalinism vs Maoism vs Trotsykism", "created_utc": 1492141865.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 17, "visited": false, "subreddit_type": "public", "ups": 133}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65advm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65advm", "likes": null, "replies": "", "user_reports": [], "id": "dg92ykr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "kittyoppression", "parent_id": "t1_dg8ycl6", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg92ykr", "score_hidden": false, "stickied": false, "created": 1492202686.0, "created_utc": 1492173886.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ycl6", "gilded": 0, "archived": false, "score": 67, "report_reasons": null, "author": "MemeMeUpFamilia", "parent_id": "t3_65advm", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Stalinism doesn't exist. It's basically a slur for anyone who loves Stalin. But usually it references the tendency of Marxist-Leninism.\n\nBefore showing what the difference between Marxist-Leninism, Trotskyists, and Maoism (short for Marxist-Leninist-Maoism) you must know what Marxism is.\n\nMarxism is a body of analysis and critique of capitalism. It forms the basis of the worldview of communists and it is the utter rejection of liberalism. Marxism is considered by communists to be a science in that it is a constantly developing theory shaped by a cycle of making theory, practicing it (applying it to the real world), and then changing the theory to accommodate for what works and what doesn't. Marxism also assumes the world to be ever changing so it develops as the world evolves. \n\nMarxist-Leninism is considered to be a major scientific advancement of Marxism and also differs from Marxism in that it isn't solely analysis and critique, but also a description of how revolution should occur, how we organize the workers, how society should look like, and how to continue combating capitalism and liberal ideology after revolution. Some of the major advancements include:\n\n-**Analysis of imperialism**, how rich Western countries maintain overall high living standards, wealth, and decadence by exploiting the Global South (what some people today would call world systems theory, neoliberalism, or 'globalism').  \n-**The vanguard party**, posits that the revolution must be organized in order to be successful. The most devoted workers form what is called a vanguard party which acts as the central leadership in revolution, and after revolution becomes the government.  \n-Indepth analysis of the state and how it can be a tool of oppression depending on which class controls it.  \n-Posits and proves that revolution is more likely and more successful in developing and more exploited Global South countries.  \n-**The Peasantry is Revolutionary**, it is recognized that the peasantry is also an oppressed class with similar interests to industrial workers. In agrarian societies like Tsarist Russia, uniting the proletariat and peasantry is necessary for successful revolution.  \n-Creates the idea of **Left wing nationalism** as a nationalism for oppressed people/nations that is compatible with communist internationalism.  \n-**Socialism In One Country**, the strategy of a socialist state after revolution should be to rebuild and fortify itself against possible counter revolution or invasion/coup/embargo by the West, rather than take an immediate active stance in exporting revolution to other countries.\n\nTrotskyism is in opposition to Marxist-Leninism. Leon Trotsky, Bolshevik revolutionary, believed the Soviet Union was abandoning internationalism and was also losing touch with its workers, so he created a new theory that is based on Marxism, is similar to Marxist-Leninism, but rejects some of the advancements and contributes new analysis of its own. Some of these things were:  \n\n-Rejection of Socialism In One Country for **Permanent Revolution**, a socialist state after revolution must immediately devote as many military and economic resources as possible to exporting revolution to the entire world, so as to subvert capitalism as fast as possible.  \n-Posits the **Degenerated Worker's state theory** which says that the USSR was becoming 'degenerated' or slowly giving way to a new bureaucratic class with interests of its own to the detriment of the workers.  \n-**United Front and Antifa**, Trotsky was the first person to recognize that fascism was not only worse than liberalism but the greatest threat to communism ever faced. He believed that communists should do whatever it takes to combat fascism, including fighting on the streets AND temporarily siding with liberals (United Front). This is also Trotsky's most important contribution, so important that all tendencies of communism from anarchism to Maoism have accepted it and implemented it.\n\nMaoism, short for Marxist-Leninist-Maoism​, is a scientific advancement of Marxist-Leninism as the name suggests. Currently it is the most popular communist tendency in the world, especially in the Global South. Maoism is not as a big jump from Marxist-Leninism as Marxist-Leninism was from Marxism. Here are a list of some of its advancements:\n\n-**Protracted Peoples War**, strategy for revolution which says that the best way to win is to use guerilla warfare and make the war last as long as possible so as to outlast the state and bleed out Western support.  \n-**The Mass Line**, the best keep the Communist party in tune with the people by taking the unorganized ideas and aspirations of the people and forge policy out of it.  \n-**Theory of Social Imperialism**, in many ways this is similar to Trotsky's Degenerated Workers State theory but Social Imperialism theory is considered more accurate, developed, and comprehensive. It posits that the USSR succumbed to revisionism (which is the unscientific rewriting of Marxism) and started engaging in imperialism, an act previously thought to be exclusive to capitalism. Many also conclude from this theory that the USSR was no longer socialist after Khrushchev took power.  \n-**Cultural Revolution**, Mao recognized that a threat to communism would not just come from the outside but also from the inside in the form of revisionism, and if nothing was done to stop it then it would slowly deteriorate and destroy socialism. Cultural Revolution is a method of stopping revisionism by actively finding and removing members of the party and the state who pretend to be communist and do not believe or care about workers liberation, and to continue the fire of revolutionary fervor in the population by having the people take an active effort in fighting dated or oppressive cultural traditions, and destroying positive symbols of the capitalist past.  \n-**\"Class struggle only intensifies under socialism\"**, a new understanding of socialism that reinforces the importance of taking defense very seriously and actively. It is said that class struggle intensifies under socialism because instead of strikes, riots, and insurrection, there is now proxy wars, coups, spies, covert warfare, and more. The capitalist class will do whatever it takes to hold power, and so will the workers, resulting in intensified struggle on a global scale.", "edited": 1492168329.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stalinism doesn&amp;#39;t exist. It&amp;#39;s basically a slur for anyone who loves Stalin. But usually it references the tendency of Marxist-Leninism.&lt;/p&gt;\n\n&lt;p&gt;Before showing what the difference between Marxist-Leninism, Trotskyists, and Maoism (short for Marxist-Leninist-Maoism) you must know what Marxism is.&lt;/p&gt;\n\n&lt;p&gt;Marxism is a body of analysis and critique of capitalism. It forms the basis of the worldview of communists and it is the utter rejection of liberalism. Marxism is considered by communists to be a science in that it is a constantly developing theory shaped by a cycle of making theory, practicing it (applying it to the real world), and then changing the theory to accommodate for what works and what doesn&amp;#39;t. Marxism also assumes the world to be ever changing so it develops as the world evolves. &lt;/p&gt;\n\n&lt;p&gt;Marxist-Leninism is considered to be a major scientific advancement of Marxism and also differs from Marxism in that it isn&amp;#39;t solely analysis and critique, but also a description of how revolution should occur, how we organize the workers, how society should look like, and how to continue combating capitalism and liberal ideology after revolution. Some of the major advancements include:&lt;/p&gt;\n\n&lt;p&gt;-&lt;strong&gt;Analysis of imperialism&lt;/strong&gt;, how rich Western countries maintain overall high living standards, wealth, and decadence by exploiting the Global South (what some people today would call world systems theory, neoliberalism, or &amp;#39;globalism&amp;#39;).&lt;br/&gt;\n-&lt;strong&gt;The vanguard party&lt;/strong&gt;, posits that the revolution must be organized in order to be successful. The most devoted workers form what is called a vanguard party which acts as the central leadership in revolution, and after revolution becomes the government.&lt;br/&gt;\n-Indepth analysis of the state and how it can be a tool of oppression depending on which class controls it.&lt;br/&gt;\n-Posits and proves that revolution is more likely and more successful in developing and more exploited Global South countries.&lt;br/&gt;\n-&lt;strong&gt;The Peasantry is Revolutionary&lt;/strong&gt;, it is recognized that the peasantry is also an oppressed class with similar interests to industrial workers. In agrarian societies like Tsarist Russia, uniting the proletariat and peasantry is necessary for successful revolution.&lt;br/&gt;\n-Creates the idea of &lt;strong&gt;Left wing nationalism&lt;/strong&gt; as a nationalism for oppressed people/nations that is compatible with communist internationalism.&lt;br/&gt;\n-&lt;strong&gt;Socialism In One Country&lt;/strong&gt;, the strategy of a socialist state after revolution should be to rebuild and fortify itself against possible counter revolution or invasion/coup/embargo by the West, rather than take an immediate active stance in exporting revolution to other countries.&lt;/p&gt;\n\n&lt;p&gt;Trotskyism is in opposition to Marxist-Leninism. Leon Trotsky, Bolshevik revolutionary, believed the Soviet Union was abandoning internationalism and was also losing touch with its workers, so he created a new theory that is based on Marxism, is similar to Marxist-Leninism, but rejects some of the advancements and contributes new analysis of its own. Some of these things were:  &lt;/p&gt;\n\n&lt;p&gt;-Rejection of Socialism In One Country for &lt;strong&gt;Permanent Revolution&lt;/strong&gt;, a socialist state after revolution must immediately devote as many military and economic resources as possible to exporting revolution to the entire world, so as to subvert capitalism as fast as possible.&lt;br/&gt;\n-Posits the &lt;strong&gt;Degenerated Worker&amp;#39;s state theory&lt;/strong&gt; which says that the USSR was becoming &amp;#39;degenerated&amp;#39; or slowly giving way to a new bureaucratic class with interests of its own to the detriment of the workers.&lt;br/&gt;\n-&lt;strong&gt;United Front and Antifa&lt;/strong&gt;, Trotsky was the first person to recognize that fascism was not only worse than liberalism but the greatest threat to communism ever faced. He believed that communists should do whatever it takes to combat fascism, including fighting on the streets AND temporarily siding with liberals (United Front). This is also Trotsky&amp;#39;s most important contribution, so important that all tendencies of communism from anarchism to Maoism have accepted it and implemented it.&lt;/p&gt;\n\n&lt;p&gt;Maoism, short for Marxist-Leninist-Maoism​, is a scientific advancement of Marxist-Leninism as the name suggests. Currently it is the most popular communist tendency in the world, especially in the Global South. Maoism is not as a big jump from Marxist-Leninism as Marxist-Leninism was from Marxism. Here are a list of some of its advancements:&lt;/p&gt;\n\n&lt;p&gt;-&lt;strong&gt;Protracted Peoples War&lt;/strong&gt;, strategy for revolution which says that the best way to win is to use guerilla warfare and make the war last as long as possible so as to outlast the state and bleed out Western support.&lt;br/&gt;\n-&lt;strong&gt;The Mass Line&lt;/strong&gt;, the best keep the Communist party in tune with the people by taking the unorganized ideas and aspirations of the people and forge policy out of it.&lt;br/&gt;\n-&lt;strong&gt;Theory of Social Imperialism&lt;/strong&gt;, in many ways this is similar to Trotsky&amp;#39;s Degenerated Workers State theory but Social Imperialism theory is considered more accurate, developed, and comprehensive. It posits that the USSR succumbed to revisionism (which is the unscientific rewriting of Marxism) and started engaging in imperialism, an act previously thought to be exclusive to capitalism. Many also conclude from this theory that the USSR was no longer socialist after Khrushchev took power.&lt;br/&gt;\n-&lt;strong&gt;Cultural Revolution&lt;/strong&gt;, Mao recognized that a threat to communism would not just come from the outside but also from the inside in the form of revisionism, and if nothing was done to stop it then it would slowly deteriorate and destroy socialism. Cultural Revolution is a method of stopping revisionism by actively finding and removing members of the party and the state who pretend to be communist and do not believe or care about workers liberation, and to continue the fire of revolutionary fervor in the population by having the people take an active effort in fighting dated or oppressive cultural traditions, and destroying positive symbols of the capitalist past.&lt;br/&gt;\n-&lt;strong&gt;&amp;quot;Class struggle only intensifies under socialism&amp;quot;&lt;/strong&gt;, a new understanding of socialism that reinforces the importance of taking defense very seriously and actively. It is said that class struggle intensifies under socialism because instead of strikes, riots, and insurrection, there is now proxy wars, coups, spies, covert warfare, and more. The capitalist class will do whatever it takes to hold power, and so will the workers, resulting in intensified struggle on a global scale.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg8ycl6", "score_hidden": false, "stickied": false, "created": 1492190295.0, "created_utc": 1492161495.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 67}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65advm", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65advm", "likes": null, "replies": "", "user_reports": [], "id": "dg925sl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kittyoppression", "parent_id": "t1_dg8xhes", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Thank you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg925sl", "score_hidden": false, "stickied": false, "created": 1492201113.0, "created_utc": 1492172313.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dg8xhes", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "DickPuppet", "parent_id": "t3_65advm", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "There's probably a lot of tedious differences that the nice folks at /r/socialism will be happy to explain to you in way too much detail but the main differences are these:\n\nTrotskyism: Trotsky believed that the only way to achieve long-lasting communist utopia was to ignite a \"global revolution\" where capitalism worldwide is overthrown and replaced with a single communist society. This is contrasted with...\n\nStalinism: which believes in \"socialism in one country\", i.e. the USSR could survive as a single communist entity and still compete with the capitalist world. Stalinism is also what you think of when you think of the stereotypical USSR: purging political dissidents, rapid, centrally-planned industrialization, and collectivized resources.\n\nMaoism: Maoism was Mao's take on socialist revolution as applied to the socio-political climate of china at the time. Mao believed that the peasant class, as opposed to the worker class in Russia, was the key class of a socialist revolution in China, and his policies were mainly geared towards (in theory) improving the lives of peasants through policies like teaching all of the peasants how to forge iron and having them keep small-scale forges on their property or teaching them to exterminate pests to increase their crop yields. These policies would turn out to massively backfire but that's neither here nor there. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s probably a lot of tedious differences that the nice folks at &lt;a href=\"/r/socialism\"&gt;/r/socialism&lt;/a&gt; will be happy to explain to you in way too much detail but the main differences are these:&lt;/p&gt;\n\n&lt;p&gt;Trotskyism: Trotsky believed that the only way to achieve long-lasting communist utopia was to ignite a &amp;quot;global revolution&amp;quot; where capitalism worldwide is overthrown and replaced with a single communist society. This is contrasted with...&lt;/p&gt;\n\n&lt;p&gt;Stalinism: which believes in &amp;quot;socialism in one country&amp;quot;, i.e. the USSR could survive as a single communist entity and still compete with the capitalist world. Stalinism is also what you think of when you think of the stereotypical USSR: purging political dissidents, rapid, centrally-planned industrialization, and collectivized resources.&lt;/p&gt;\n\n&lt;p&gt;Maoism: Maoism was Mao&amp;#39;s take on socialist revolution as applied to the socio-political climate of china at the time. Mao believed that the peasant class, as opposed to the worker class in Russia, was the key class of a socialist revolution in China, and his policies were mainly geared towards (in theory) improving the lives of peasants through policies like teaching all of the peasants how to forge iron and having them keep small-scale forges on their property or teaching them to exterminate pests to increase their crop yields. These policies would turn out to massively backfire but that&amp;#39;s neither here nor there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg8xhes", "score_hidden": false, "stickied": false, "created": 1492187453.0, "created_utc": 1492158653.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65advm", "likes": null, "replies": "", "user_reports": [], "id": "dg8xuxv", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Seahonk", "parent_id": "t3_65advm", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This is by no means a comprehensive answer but Stalinism is usually identified with Socialism-In-One-Country (as opposed to international workers' revolution) and totalitarianism. Maoism assumes an agrarian peasantry instead of urban proletariat and calls for a mass peasants' uprising instead of an ivory tower vanguard party. It also considers cultural revolutions necessary, since it does not promise socialism will sweep away capitalism quickly at all, and expects to fight ideological battles domestically (possibly forever) \nTrotsky is tougher, he means different things to different people. He rejected the idea of socialism in one country and insisted it was global or nothing. He took an active part in the revolution (which he would have understood to necessarily include the executions of civilian capitalists) but later on developed a reputation as less fanatical and/or violent than other communists- possibly because he opposed Stalin and flirted with anarchists. If you hear the word \"trotskyism\" IRL though it's probably uttered by a leftist referring to wimpy pseudo-communists who don't read the books and think of communism as \"super-super-liberalism.\" Such people are usually drawn to Trotsky because he's more palatable to liberals. (Note that leftists don't usually consider themselves liberals)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is by no means a comprehensive answer but Stalinism is usually identified with Socialism-In-One-Country (as opposed to international workers&amp;#39; revolution) and totalitarianism. Maoism assumes an agrarian peasantry instead of urban proletariat and calls for a mass peasants&amp;#39; uprising instead of an ivory tower vanguard party. It also considers cultural revolutions necessary, since it does not promise socialism will sweep away capitalism quickly at all, and expects to fight ideological battles domestically (possibly forever) \nTrotsky is tougher, he means different things to different people. He rejected the idea of socialism in one country and insisted it was global or nothing. He took an active part in the revolution (which he would have understood to necessarily include the executions of civilian capitalists) but later on developed a reputation as less fanatical and/or violent than other communists- possibly because he opposed Stalin and flirted with anarchists. If you hear the word &amp;quot;trotskyism&amp;quot; IRL though it&amp;#39;s probably uttered by a leftist referring to wimpy pseudo-communists who don&amp;#39;t read the books and think of communism as &amp;quot;super-super-liberalism.&amp;quot; Such people are usually drawn to Trotsky because he&amp;#39;s more palatable to liberals. (Note that leftists don&amp;#39;t usually consider themselves liberals)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg8xuxv", "score_hidden": false, "stickied": false, "created": 1492188684.0, "created_utc": 1492159884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65advm", "likes": null, "replies": "", "user_reports": [], "id": "dg8y5ep", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Ronald-Hapchwarae", "parent_id": "t3_65advm", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Stalin and Trotsky were both proletariat communists. Mao was an agrarian communist. In more simple words Stalin and Trotsky believed in the workers struggle (more in line with Marx though Marx thought it would happen in industrial nations). Mao believed in the farmers struggle.  \n  \nStalin believed in communism in the nation. Stalin wanted to strengthen the USSR rather than expand the revolution. I also believe Stalin wanted to get rid of the SFSR Russia and SSRs in the USSR. Rather than a federal nation have a one nation policy similar to the former British Prime Minister Benjamin Disraeli. Stalin was more to the right (in the bolsheviks so still very far to the left).  \n  \nTrotsky was a military commander and wanted a global revolution, the USSR should invade the other Bourgeois nations and make them good SSRs. His view on this is similar to the French President and Emperor Napoleon I. Trotsky was to the left in the Bolsheviks. Trotsky was also the legitimate successor to Lenin as leader but a conspiracy led by Stalin robbed him of this.  \n  \nMao didn't believe in the workers struggle but the farmers and focused his revolution on this. If you look at a GDP chart in china you can see the industrial revolution comes much later than the communist revolution. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stalin and Trotsky were both proletariat communists. Mao was an agrarian communist. In more simple words Stalin and Trotsky believed in the workers struggle (more in line with Marx though Marx thought it would happen in industrial nations). Mao believed in the farmers struggle.  &lt;/p&gt;\n\n&lt;p&gt;Stalin believed in communism in the nation. Stalin wanted to strengthen the USSR rather than expand the revolution. I also believe Stalin wanted to get rid of the SFSR Russia and SSRs in the USSR. Rather than a federal nation have a one nation policy similar to the former British Prime Minister Benjamin Disraeli. Stalin was more to the right (in the bolsheviks so still very far to the left).  &lt;/p&gt;\n\n&lt;p&gt;Trotsky was a military commander and wanted a global revolution, the USSR should invade the other Bourgeois nations and make them good SSRs. His view on this is similar to the French President and Emperor Napoleon I. Trotsky was to the left in the Bolsheviks. Trotsky was also the legitimate successor to Lenin as leader but a conspiracy led by Stalin robbed him of this.  &lt;/p&gt;\n\n&lt;p&gt;Mao didn&amp;#39;t believe in the workers struggle but the farmers and focused his revolution on this. If you look at a GDP chart in china you can see the industrial revolution comes much later than the communist revolution. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg8y5ep", "score_hidden": false, "stickied": false, "created": 1492189638.0, "created_utc": 1492160838.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65advm", "likes": null, "replies": "", "user_reports": [], "id": "dg8qc5c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65advm", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dg8qc5c", "score_hidden": false, "stickied": false, "created": 1492171318.0, "created_utc": 1492142518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]