[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Physics", "id": "65mwop", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 36, "report_reasons": null, "author": "sqdcn", "saved": false, "mod_reports": [], "name": "t3_65mwop", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Physics", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/65mwop/eli5_tone_scale_pitch_frequency_and_note/", "num_reports": null, "locked": false, "stickied": false, "created": 1492337997.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/65mwop/eli5_tone_scale_pitch_frequency_and_note/", "author_flair_text": null, "quarantine": false, "title": "ELI5: tone, scale, pitch, frequency and note.", "created_utc": 1492309197.0, "distinguished": null, "media": null, "upvote_ratio": 0.74, "num_comments": 15, "visited": false, "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65mwop", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgbnjp1", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "GlenPonderAndChalet", "parent_id": "t3_65mwop", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Sound is vibration (the stretching &amp; compressing of matter), which occurs in the physical universe as waves. We represent the waves in drawings like [this](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS1kOVU5hEcXjcdlGIKxVzs4jkcI8WnUPKaUmvgdbk1c6PShaMcK-GTLhMcGQ).\n\nThe squiggly line represents the wave as it moves from initial stillness (silence, as represented by the horizontal line in the drawing) to maximum compression of the matter (loudest point, as represented by the parts of the squiggly line above the horizontal line), back to stillness, then to maximum stretching of the matter (also loudest point, as represented by the parts of the squiggly line below the horizontal line), then back to stillness (the horizontal line). This is called a *wave cycle*, &amp; it repeats for as long as the sound is happening.\n\nBased on that, *FREQUENCY* is how quickly the line goes through 1 complete wave cycle (still -&gt; max compression -&gt; still -&gt; max stretching -&gt; still). Frequency is described in terms of *Hertz* (Hz), where 1 Hertz means that the wave cycle happens once per second. The higher the number of Hertz, the more wave cycles per second, &amp; the higher the sound.\n\n*PITCH* is the same thing, but described as letters (A through G) instead of numbers. Each letter corresponds to an exact number of Hertz. For example, 440Hz is described in pitch terms as an \"A\". 880Hz is also called an \"A\", because while it is a higher sound than the 440Hz A, their squiggly lines cross over the horizontal line at the same place. \n\nA good way of visualizing this concept is to look at a piano keyboard. It is a repeating pattern of keys, which represents how the letters of pitch repeat themselves, which in turn represents how a number's divisors (points where the squiggly line crosses the horizontal line) are all also present in its double. The distance between a number of Hertz &amp; its double is called an *octave*. \n\nWe have arbitrarily decided in the western world to divide the octave into 12 parts, which we notate using the following pitch descriptions:\n\n- A (white key on a piano)\n- A#/Bb (black key on a piano)\n- B (w)\n- C (w)\n- C#/Db (b)\n- D (w)\n- D#/Eb (b)\n- E (w)\n- F (w)\n- F#/Gb (b)\n- G (w)\n- G#/Ab (b)\n\nA *SCALE* is any arbitrary selection of those 12 used in a piece of music. The most common scales select 8 of the 12 available pitches in the western octave, but scales of as few as 5 or as many as all 12 pitches also occur fairly regularly. \n\nOther non-western cultures divide their octave up into different amounts of pitches; as a result, we tend to use frequency when being scientific (objective global facts), &amp; pitch when being artistic (subjective local feelings).\n\n*TONE* is the shape of the line. The perfectly curved squiggly line in my drawing is only possible in the real world due to the mathematical precision of computers. When it comes to human-created instruments &amp; sounds, there will always be imperfections (like how the differing facial features of people's faces are technically imperfections from perfect ratios &amp; symmetries). \n\nThe nature of those musical imperfections lead to dents &amp; points &amp; angles etc in the squiggly line, &amp; will lead it to look like variants of [this](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS8enefctPJiHASZfC4Si8z83-Up71_0wA97yRJWkDY2kimR0eHY1nKRFyq). These variations in the squiggly line create different tones, &amp; are why an oboe sounds different from a distorted electric guitar.\n\n*NOTE* is just the name that composers/conductors/musicians use for an individual instance of a deliberately made musical sound. It is most useful as a term when discussing music theory or written music.\n\nEdit:formatting.\n\nEdit 2: changed \"air\" to \"matter\" after /u/randomnumber23 correctly pointed out my mistake.", "edited": 1492320168.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sound is vibration (the stretching &amp;amp; compressing of matter), which occurs in the physical universe as waves. We represent the waves in drawings like &lt;a href=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS1kOVU5hEcXjcdlGIKxVzs4jkcI8WnUPKaUmvgdbk1c6PShaMcK-GTLhMcGQ\"&gt;this&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;The squiggly line represents the wave as it moves from initial stillness (silence, as represented by the horizontal line in the drawing) to maximum compression of the matter (loudest point, as represented by the parts of the squiggly line above the horizontal line), back to stillness, then to maximum stretching of the matter (also loudest point, as represented by the parts of the squiggly line below the horizontal line), then back to stillness (the horizontal line). This is called a &lt;em&gt;wave cycle&lt;/em&gt;, &amp;amp; it repeats for as long as the sound is happening.&lt;/p&gt;\n\n&lt;p&gt;Based on that, &lt;em&gt;FREQUENCY&lt;/em&gt; is how quickly the line goes through 1 complete wave cycle (still -&amp;gt; max compression -&amp;gt; still -&amp;gt; max stretching -&amp;gt; still). Frequency is described in terms of &lt;em&gt;Hertz&lt;/em&gt; (Hz), where 1 Hertz means that the wave cycle happens once per second. The higher the number of Hertz, the more wave cycles per second, &amp;amp; the higher the sound.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;PITCH&lt;/em&gt; is the same thing, but described as letters (A through G) instead of numbers. Each letter corresponds to an exact number of Hertz. For example, 440Hz is described in pitch terms as an &amp;quot;A&amp;quot;. 880Hz is also called an &amp;quot;A&amp;quot;, because while it is a higher sound than the 440Hz A, their squiggly lines cross over the horizontal line at the same place. &lt;/p&gt;\n\n&lt;p&gt;A good way of visualizing this concept is to look at a piano keyboard. It is a repeating pattern of keys, which represents how the letters of pitch repeat themselves, which in turn represents how a number&amp;#39;s divisors (points where the squiggly line crosses the horizontal line) are all also present in its double. The distance between a number of Hertz &amp;amp; its double is called an &lt;em&gt;octave&lt;/em&gt;. &lt;/p&gt;\n\n&lt;p&gt;We have arbitrarily decided in the western world to divide the octave into 12 parts, which we notate using the following pitch descriptions:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;A (white key on a piano)&lt;/li&gt;\n&lt;li&gt;A#/Bb (black key on a piano)&lt;/li&gt;\n&lt;li&gt;B (w)&lt;/li&gt;\n&lt;li&gt;C (w)&lt;/li&gt;\n&lt;li&gt;C#/Db (b)&lt;/li&gt;\n&lt;li&gt;D (w)&lt;/li&gt;\n&lt;li&gt;D#/Eb (b)&lt;/li&gt;\n&lt;li&gt;E (w)&lt;/li&gt;\n&lt;li&gt;F (w)&lt;/li&gt;\n&lt;li&gt;F#/Gb (b)&lt;/li&gt;\n&lt;li&gt;G (w)&lt;/li&gt;\n&lt;li&gt;G#/Ab (b)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;A &lt;em&gt;SCALE&lt;/em&gt; is any arbitrary selection of those 12 used in a piece of music. The most common scales select 8 of the 12 available pitches in the western octave, but scales of as few as 5 or as many as all 12 pitches also occur fairly regularly. &lt;/p&gt;\n\n&lt;p&gt;Other non-western cultures divide their octave up into different amounts of pitches; as a result, we tend to use frequency when being scientific (objective global facts), &amp;amp; pitch when being artistic (subjective local feelings).&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;TONE&lt;/em&gt; is the shape of the line. The perfectly curved squiggly line in my drawing is only possible in the real world due to the mathematical precision of computers. When it comes to human-created instruments &amp;amp; sounds, there will always be imperfections (like how the differing facial features of people&amp;#39;s faces are technically imperfections from perfect ratios &amp;amp; symmetries). &lt;/p&gt;\n\n&lt;p&gt;The nature of those musical imperfections lead to dents &amp;amp; points &amp;amp; angles etc in the squiggly line, &amp;amp; will lead it to look like variants of &lt;a href=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS8enefctPJiHASZfC4Si8z83-Up71_0wA97yRJWkDY2kimR0eHY1nKRFyq\"&gt;this&lt;/a&gt;. These variations in the squiggly line create different tones, &amp;amp; are why an oboe sounds different from a distorted electric guitar.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;NOTE&lt;/em&gt; is just the name that composers/conductors/musicians use for an individual instance of a deliberately made musical sound. It is most useful as a term when discussing music theory or written music.&lt;/p&gt;\n\n&lt;p&gt;Edit:formatting.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: changed &amp;quot;air&amp;quot; to &amp;quot;matter&amp;quot; after &lt;a href=\"/u/randomnumber23\"&gt;/u/randomnumber23&lt;/a&gt; correctly pointed out my mistake.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgbnjp1", "score_hidden": false, "stickied": false, "created": 1492344099.0, "created_utc": 1492315299.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65mwop", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgblsln", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "coleslaw74", "parent_id": "t3_65mwop", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Note- a sound \nTone- the quality of a note (the technical word is timbre) \nScale- many notes in a row going up or down or both \nFrequency- how many cycles per second a sound wave is traveling through the air. The scientific term for pitch. Referred to by a number. (440 Hertz)\nPitch- a note of a certain frequency. Referred to by a letter name. (440 Hertz=A4 or A above middle C)\n\nI tried to make that very ELI5. For a bit more detail: \n1. Yes a note can be any sound with pitch (and some would argue without a discernible pitch even). Notes can be \"in tune\" or \"out of tune\" as can pitch, but that gets into a far more complicated conversation about tuning systems, temperament, etc. \n2. Some people say \"tone\" to mean \"note\" IE \"leave a message after the tone\" but tone is synonymous with timbre. A clarinet playing an A4 will sound different than a piano, and than a tuba, and a cello, and a banjo, etc. The pitch and frequency are the same, the tone/timbre differentiates them. \n3. Scales come in many many many forms across the world. Even in western music tradition we have many many types of scales. The loosest way I could describe it was the way I did above. And before someone says \"but they go up and down in a pattern\" no, they don't. Not always and not in all cultures. \n4. A pitch corresponds to a frequency and vice versa. But again, this changes based on culture or country or continent. In Europe, for example, an A4 is 435-438 Hertz, whereas it is 440 in America. What makes one frequency one pitch and another frequency another pitch? See #1, that's a complicated and long answer and is again culturally specific. \n5. Some would argue that \"tone\" is actually what I defined as \"note\" and that a note can be more complicated than a tone. In terms of scientific ways of discussing sound that might be true but in terms of how we use the word tone in a musical context, the way I describe it is more accurate/common. ", "edited": 1492315335.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Note- a sound \nTone- the quality of a note (the technical word is timbre) \nScale- many notes in a row going up or down or both \nFrequency- how many cycles per second a sound wave is traveling through the air. The scientific term for pitch. Referred to by a number. (440 Hertz)\nPitch- a note of a certain frequency. Referred to by a letter name. (440 Hertz=A4 or A above middle C)&lt;/p&gt;\n\n&lt;p&gt;I tried to make that very ELI5. For a bit more detail: \n1. Yes a note can be any sound with pitch (and some would argue without a discernible pitch even). Notes can be &amp;quot;in tune&amp;quot; or &amp;quot;out of tune&amp;quot; as can pitch, but that gets into a far more complicated conversation about tuning systems, temperament, etc. \n2. Some people say &amp;quot;tone&amp;quot; to mean &amp;quot;note&amp;quot; IE &amp;quot;leave a message after the tone&amp;quot; but tone is synonymous with timbre. A clarinet playing an A4 will sound different than a piano, and than a tuba, and a cello, and a banjo, etc. The pitch and frequency are the same, the tone/timbre differentiates them. \n3. Scales come in many many many forms across the world. Even in western music tradition we have many many types of scales. The loosest way I could describe it was the way I did above. And before someone says &amp;quot;but they go up and down in a pattern&amp;quot; no, they don&amp;#39;t. Not always and not in all cultures. \n4. A pitch corresponds to a frequency and vice versa. But again, this changes based on culture or country or continent. In Europe, for example, an A4 is 435-438 Hertz, whereas it is 440 in America. What makes one frequency one pitch and another frequency another pitch? See #1, that&amp;#39;s a complicated and long answer and is again culturally specific. \n5. Some would argue that &amp;quot;tone&amp;quot; is actually what I defined as &amp;quot;note&amp;quot; and that a note can be more complicated than a tone. In terms of scientific ways of discussing sound that might be true but in terms of how we use the word tone in a musical context, the way I describe it is more accurate/common. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgblsln", "score_hidden": false, "stickied": false, "created": 1492341362.0, "created_utc": 1492312562.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65mwop", "likes": null, "replies": "", "user_reports": [], "id": "dgckj3f", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "iHaveAgency", "parent_id": "t3_65mwop", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "They are all *basically* referring to the same thing, except for scale. A scale is a collection if notes in ascending or descending order that sound \"Ok\" to humans when melodies (sequences of single tones) or chords (small numbers of tones played at the same time) are heard using only those notes. This is what is meant by \"tonal\" music, as opposed to \"atonal\" music. Nearly all music you ever hear is tonal.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They are all &lt;em&gt;basically&lt;/em&gt; referring to the same thing, except for scale. A scale is a collection if notes in ascending or descending order that sound &amp;quot;Ok&amp;quot; to humans when melodies (sequences of single tones) or chords (small numbers of tones played at the same time) are heard using only those notes. This is what is meant by &amp;quot;tonal&amp;quot; music, as opposed to &amp;quot;atonal&amp;quot; music. Nearly all music you ever hear is tonal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgckj3f", "score_hidden": false, "stickied": false, "created": 1492405296.0, "created_utc": 1492376496.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]