[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Biology", "id": "65pefi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 647, "report_reasons": null, "author": "KnuxFive", "saved": false, "mod_reports": [], "name": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Biology", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/65pefi/eli5_if_an_addict_goes_into_a_coma_for_enough/", "num_reports": null, "locked": false, "stickied": false, "created": 1492382245.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/65pefi/eli5_if_an_addict_goes_into_a_coma_for_enough/", "author_flair_text": null, "quarantine": false, "title": "ELI5: If an addict goes into a coma for enough time to get it out of their system, would they still be addicted when they wake up?", "created_utc": 1492353445.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 65, "visited": false, "subreddit_type": "public", "ups": 647}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcfwlp", "gilded": 0, "archived": false, "score": 179, "report_reasons": null, "author": "coltsmyth", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I'm an addiction counselor. I've also spent four days in a coma from a polysubstance overdose, and subsequent withdrawal. \n\nLet's get a few terms straight first. Addiction is not diagnosable. Instead, let's call it a (substance) use disorder. There are 11 diagnostic criteria for a use disorder. If someone meets 3, or 7, or 10 of these criteria, their disorder could be mild, moderate, or severe. Someone with a mild substance use disorder might not have the same obsessions or compulsions that another patient may have, or the same feelings of guilt/shame as another, or hasn't been using as coping skill since age 13, or has a very supportive home life with access to a continuum of care, etc. \n\nSo, the answer is yes, it's possible for them to wake up not 'addicted' or at least not physically dependent... but completing withdrawal is not enough for most patients to find long term wellness. About 92% of opioid users that complete a detox-only level of care, without residential treatment, intensive outpatient treatment, etc., end up using again within one year... using problematically... not just using...\n\nSo, while it's possible, the patient would likely need to be mild case, and present with mostly withdrawal related symptoms and none of the thought-life, amygdala activation, guilt/shame, society pressures, home life difficulties, have many coping methods that actually help the patient, etc., that most problematic users face daily. So... let's not try... ok?!?!", "edited": 1492370865.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m an addiction counselor. I&amp;#39;ve also spent four days in a coma from a polysubstance overdose, and subsequent withdrawal. &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s get a few terms straight first. Addiction is not diagnosable. Instead, let&amp;#39;s call it a (substance) use disorder. There are 11 diagnostic criteria for a use disorder. If someone meets 3, or 7, or 10 of these criteria, their disorder could be mild, moderate, or severe. Someone with a mild substance use disorder might not have the same obsessions or compulsions that another patient may have, or the same feelings of guilt/shame as another, or hasn&amp;#39;t been using as coping skill since age 13, or has a very supportive home life with access to a continuum of care, etc. &lt;/p&gt;\n\n&lt;p&gt;So, the answer is yes, it&amp;#39;s possible for them to wake up not &amp;#39;addicted&amp;#39; or at least not physically dependent... but completing withdrawal is not enough for most patients to find long term wellness. About 92% of opioid users that complete a detox-only level of care, without residential treatment, intensive outpatient treatment, etc., end up using again within one year... using problematically... not just using...&lt;/p&gt;\n\n&lt;p&gt;So, while it&amp;#39;s possible, the patient would likely need to be mild case, and present with mostly withdrawal related symptoms and none of the thought-life, amygdala activation, guilt/shame, society pressures, home life difficulties, have many coping methods that actually help the patient, etc., that most problematic users face daily. So... let&amp;#39;s not try... ok?!?!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcfwlp", "score_hidden": false, "stickied": false, "created": 1492399291.0, "created_utc": 1492370491.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 179}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc3mwv", "gilded": 0, "archived": false, "score": 383, "report_reasons": null, "author": "bettinafairchild", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "They would have no physical addiction. They would go through withdrawal while unconscious. But they'd still be addicted psychologically, much like a person who quits for awhile--they will still crave the substance, but not become physically ill when not having any. It's actually a thing to put people to sleep so they can detox while unconscious.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They would have no physical addiction. They would go through withdrawal while unconscious. But they&amp;#39;d still be addicted psychologically, much like a person who quits for awhile--they will still crave the substance, but not become physically ill when not having any. It&amp;#39;s actually a thing to put people to sleep so they can detox while unconscious.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgc3mwv", "score_hidden": false, "stickied": false, "created": 1492382747.0, "created_utc": 1492353947.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 383}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc7b2y", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "JackLawless26", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "You (like most people) are conflating *addiction*, which is a behavior and a psychological/spiritual/brain-chemistry problem, with *chemical dependence*, which is a medical condition. Any person can, for instance, be over prescribed painkillers and their body develop a chemical dependence, which will result in physical withdrawal when the substance is removed.  That part, you can sleep through.  Being an **addict** is a different thing.  An alcoholic who hasn't had a drink in five years is **still an addict**, despite having no physical chemical dependence. It's a reference to the fact that their brain chemistry is simply different, and always will be at our present level of understanding. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You (like most people) are conflating &lt;em&gt;addiction&lt;/em&gt;, which is a behavior and a psychological/spiritual/brain-chemistry problem, with &lt;em&gt;chemical dependence&lt;/em&gt;, which is a medical condition. Any person can, for instance, be over prescribed painkillers and their body develop a chemical dependence, which will result in physical withdrawal when the substance is removed.  That part, you can sleep through.  Being an &lt;strong&gt;addict&lt;/strong&gt; is a different thing.  An alcoholic who hasn&amp;#39;t had a drink in five years is &lt;strong&gt;still an addict&lt;/strong&gt;, despite having no physical chemical dependence. It&amp;#39;s a reference to the fact that their brain chemistry is simply different, and always will be at our present level of understanding. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgc7b2y", "score_hidden": false, "stickied": false, "created": 1492387915.0, "created_utc": 1492359115.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgckn1o", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "MIssFizz", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Physically yes. But most addictions are not about the actual substance though. When it comes to substance abuse then people have that as the solution to their problem but it's not the actual problem. Many look at a drug addict and think if you only took away the drugs then the problem would be solved but what they don't realize is that the drugs is to cover the pain inside them. So it could have been alcohol, drugs, food or whatever. It's kinda like people who cut themselves. It doesn't help to take away the knife cause they clearly have issues. No I am not saying the two are the same, it's just an example. So most likely they will still need a fix and will still be addicted.\n\nI want to point out that there are many who at some point try drugs and then suddenly get addicted and need it and in this case I think your example would actually be a big help. But for many addicts then it wouldn't work cause they would wake up and feel like hell and need something to numb that.", "edited": 1492377316.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Physically yes. But most addictions are not about the actual substance though. When it comes to substance abuse then people have that as the solution to their problem but it&amp;#39;s not the actual problem. Many look at a drug addict and think if you only took away the drugs then the problem would be solved but what they don&amp;#39;t realize is that the drugs is to cover the pain inside them. So it could have been alcohol, drugs, food or whatever. It&amp;#39;s kinda like people who cut themselves. It doesn&amp;#39;t help to take away the knife cause they clearly have issues. No I am not saying the two are the same, it&amp;#39;s just an example. So most likely they will still need a fix and will still be addicted.&lt;/p&gt;\n\n&lt;p&gt;I want to point out that there are many who at some point try drugs and then suddenly get addicted and need it and in this case I think your example would actually be a big help. But for many addicts then it wouldn&amp;#39;t work cause they would wake up and feel like hell and need something to numb that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgckn1o", "score_hidden": false, "stickied": false, "created": 1492405448.0, "created_utc": 1492376648.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgcp650", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kodack10", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Addiction has both physical and mental components. When you are physically addicted to something your body goes into withdrawal and makes the addict sick. That physical withdrawal can vary from unpleasant, to life threatening and it can last days. \n\nThe mental component is drug seeking behavior. The user wants the drug because it helps them cope or satisfies a need they have. Those cravings and needs are likely still there when they wake up, maybe even more so with the stress of a hospital stay. \n\nI'll give you some examples. \nCigarettes - They have a mild physical addiction that can cause irritability, headaches, and low energy when quitting. These usually fade in a few days. However the mental addiction can last for months or years. The user is used to fidgeting with their hands, they often smoke during other activities and doing those activities without a cigarette makes them crave them all the more. Being around other smokers, or in situations where one usually smokes like drinking in a bar, makes it very difficult to abstain. \n\nOpiates - Very strong physical addiction and dependence. Quitting cold turkey leads to intense nausea, diarrhea, sleep interruptions, headaches, intense feelings of hopelessness and malaise. The opiates caused their bodies to produce less endorphins and 'feel good' brain chemicals. Without the drug, the bodies natural pain killers and chemical rewards are not working properly leading to the person being in a lot of pain and discomfort, and things that normally bring joy like friends, food, favorite music and movies, provide little to no relief. This usually fades in several days. The mental aspects of it can last the rest of a persons life. The problems and behaviors that led them to abuse the drug in the first place are often still there when they quit, and recovery can be very difficult and require years of careful control over their behaviors and lives. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Addiction has both physical and mental components. When you are physically addicted to something your body goes into withdrawal and makes the addict sick. That physical withdrawal can vary from unpleasant, to life threatening and it can last days. &lt;/p&gt;\n\n&lt;p&gt;The mental component is drug seeking behavior. The user wants the drug because it helps them cope or satisfies a need they have. Those cravings and needs are likely still there when they wake up, maybe even more so with the stress of a hospital stay. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll give you some examples. \nCigarettes - They have a mild physical addiction that can cause irritability, headaches, and low energy when quitting. These usually fade in a few days. However the mental addiction can last for months or years. The user is used to fidgeting with their hands, they often smoke during other activities and doing those activities without a cigarette makes them crave them all the more. Being around other smokers, or in situations where one usually smokes like drinking in a bar, makes it very difficult to abstain. &lt;/p&gt;\n\n&lt;p&gt;Opiates - Very strong physical addiction and dependence. Quitting cold turkey leads to intense nausea, diarrhea, sleep interruptions, headaches, intense feelings of hopelessness and malaise. The opiates caused their bodies to produce less endorphins and &amp;#39;feel good&amp;#39; brain chemicals. Without the drug, the bodies natural pain killers and chemical rewards are not working properly leading to the person being in a lot of pain and discomfort, and things that normally bring joy like friends, food, favorite music and movies, provide little to no relief. This usually fades in several days. The mental aspects of it can last the rest of a persons life. The problems and behaviors that led them to abuse the drug in the first place are often still there when they quit, and recovery can be very difficult and require years of careful control over their behaviors and lives. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcp650", "score_hidden": false, "stickied": false, "created": 1492411467.0, "created_utc": 1492382667.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgc5a1h", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "FellKnight", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "No physical addiction.  Source: wife was in a coma last year due to alcohol problems, when she woke up, all was good and hasn't had a drink since.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No physical addiction.  Source: wife was in a coma last year due to alcohol problems, when she woke up, all was good and hasn&amp;#39;t had a drink since.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgc5a1h", "score_hidden": false, "stickied": false, "created": 1492385149.0, "created_utc": 1492356349.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgclaht", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "mrmmonty", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "There's actually a very expensive treatment for opiate addiction that involves putting a person to sleep while weaning them off the drugs with an IV drip.  Pretty sure it was featured in an HBO documentary about addiction, although I might be wrong on the producer of the content.  This, like so many other methods is a quick fix to what is in many circumstances a lifelong struggle.  You get through the detox, but you don't know how to function and cope afterwards without the drug, so the fix is usually pretty temporary.  Interesting research with some benefit to treatment going forward, but not a long-term solution by any means.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s actually a very expensive treatment for opiate addiction that involves putting a person to sleep while weaning them off the drugs with an IV drip.  Pretty sure it was featured in an HBO documentary about addiction, although I might be wrong on the producer of the content.  This, like so many other methods is a quick fix to what is in many circumstances a lifelong struggle.  You get through the detox, but you don&amp;#39;t know how to function and cope afterwards without the drug, so the fix is usually pretty temporary.  Interesting research with some benefit to treatment going forward, but not a long-term solution by any means.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgclaht", "score_hidden": false, "stickied": false, "created": 1492406292.0, "created_utc": 1492377492.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgctxst", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Stonewise", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Addiction is far more than a chemical or physical dependence, here is where the problem lies. I've read most of the comments and no one has touched on the \"lifestyle\" of addiction. At one point in my life every person I would interact with on a daily basis was an addict, every contact in my phone, every house I would visit, everything in my life revolved around my addiction. After so long it becomes all that you know and all that you see and do, every day! It slowly takes over every part of your life...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Addiction is far more than a chemical or physical dependence, here is where the problem lies. I&amp;#39;ve read most of the comments and no one has touched on the &amp;quot;lifestyle&amp;quot; of addiction. At one point in my life every person I would interact with on a daily basis was an addict, every contact in my phone, every house I would visit, everything in my life revolved around my addiction. After so long it becomes all that you know and all that you see and do, every day! It slowly takes over every part of your life...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgctxst", "score_hidden": false, "stickied": false, "created": 1492417962.0, "created_utc": 1492389162.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgcx5w3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Foecrass", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Speaking from experience: I was in a coma for 8 days, when I woke up I no longer needed a cigarette.  It was as if I never had an addiction to them at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Speaking from experience: I was in a coma for 8 days, when I woke up I no longer needed a cigarette.  It was as if I never had an addiction to them at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcx5w3", "score_hidden": true, "stickied": false, "created": 1492422200.0, "created_utc": 1492393400.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgcxty6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "halcyonsword", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This actually used to be a pretty popular method of detox, called Prolonged Sleep. The idea was that you could heavily sedate a patient through the worst of the withdrawal. It wasn't effective, to put it mildly. Here is how Burroughs described the process:\n\n*Prolonged Sleep.--The theory sounds good. You go to sleep and wake up cured. Industrial doses of chloral hydrate, barbiturates, thorazine, only produced a nightmare state of semi-consciousness. Withdrawal of sedation, after 5 days, occasioned a severe shock. Symptoms of acute morphine deprivation supervened. The end result was a combined syndrome of unparalleled horror. No cure I ever took was as painful as this allegedly painless method. The cycle of sleep and wakefulness is always deeply disturbed during withdrawal. To further disturb it with massive sedation seems contraindicated to say the least. Withdrawal of morphine is sufficiently traumatic without adding to it withdrawal of barbiturates. After two weeks in the hospital (five days sedation, ten days \"rest\") I was still so weak that I fainted when I tried to walk up a slight incline. I consider prolonged sleep the worst possible method of treating withdrawal.*", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This actually used to be a pretty popular method of detox, called Prolonged Sleep. The idea was that you could heavily sedate a patient through the worst of the withdrawal. It wasn&amp;#39;t effective, to put it mildly. Here is how Burroughs described the process:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Prolonged Sleep.--The theory sounds good. You go to sleep and wake up cured. Industrial doses of chloral hydrate, barbiturates, thorazine, only produced a nightmare state of semi-consciousness. Withdrawal of sedation, after 5 days, occasioned a severe shock. Symptoms of acute morphine deprivation supervened. The end result was a combined syndrome of unparalleled horror. No cure I ever took was as painful as this allegedly painless method. The cycle of sleep and wakefulness is always deeply disturbed during withdrawal. To further disturb it with massive sedation seems contraindicated to say the least. Withdrawal of morphine is sufficiently traumatic without adding to it withdrawal of barbiturates. After two weeks in the hospital (five days sedation, ten days &amp;quot;rest&amp;quot;) I was still so weak that I fainted when I tried to walk up a slight incline. I consider prolonged sleep the worst possible method of treating withdrawal.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcxty6", "score_hidden": true, "stickied": false, "created": 1492423135.0, "created_utc": 1492394335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgcthlk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Myboybear", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "They may not be physically addicted, but they still crave it. My dad was in a medically induced coma and went through withdrawal. When he woke up all he asked for was alcohol/drugs", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They may not be physically addicted, but they still crave it. My dad was in a medically induced coma and went through withdrawal. When he woke up all he asked for was alcohol/drugs&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcthlk", "score_hidden": false, "stickied": false, "created": 1492417356.0, "created_utc": 1492388556.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgcoix3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "FiveYearsAgoOnReddit", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This system has been tried in the past, most notably in Australia: it didn't end well.\n\nhttps://en.wikipedia.org/wiki/Deep_sleep_therapy#Australian_Chelmsford_scandal", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This system has been tried in the past, most notably in Australia: it didn&amp;#39;t end well.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Deep_sleep_therapy#Australian_Chelmsford_scandal\"&gt;https://en.wikipedia.org/wiki/Deep_sleep_therapy#Australian_Chelmsford_scandal&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcoix3", "score_hidden": false, "stickied": false, "created": 1492410570.0, "created_utc": 1492381770.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgc3egy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "WoodrowWilsonThe3rd", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Depends on the substance. It's all so important to note that their are two types of addiction. Mental and physical.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Depends on the substance. It&amp;#39;s all so important to note that their are two types of addiction. Mental and physical.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgc3egy", "score_hidden": false, "stickied": false, "created": 1492382385.0, "created_utc": 1492353585.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65pefi", "likes": null, "replies": "", "user_reports": [], "id": "dgcqrif", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "Ordellus", "parent_id": "t3_65pefi", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Nope, not really.\n\nI used severe a flu to quit smoking. Spend a few days doing nothing but sleeping.... wake up with it all out of your system and it's almost effortless.", "edited": 1492402558.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nope, not really.&lt;/p&gt;\n\n&lt;p&gt;I used severe a flu to quit smoking. Spend a few days doing nothing but sleeping.... wake up with it all out of your system and it&amp;#39;s almost effortless.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcqrif", "score_hidden": false, "stickied": false, "created": 1492413665.0, "created_utc": 1492384865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]