[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;With all the recent stuff coming out in the US, it seems everybody is for them having to wear them as it would solve a lot of problems. Why has it not hapened yet?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "With all the recent stuff coming out in the US, it seems everybody is for them having to wear them as it would solve a lot of problems. Why has it not hapened yet?", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Other", "id": "65r2jv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 32, "report_reasons": null, "author": "origen-gamingftw", "saved": false, "mod_reports": [], "name": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Other", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/65r2jv/eli5why_dont_police_officers_have_to_wear_body/", "num_reports": null, "locked": false, "stickied": false, "created": 1492401603.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/65r2jv/eli5why_dont_police_officers_have_to_wear_body/", "author_flair_text": null, "quarantine": false, "title": "ELI5:Why dont police officers have to wear body cameras yet?", "created_utc": 1492372803.0, "distinguished": null, "media": null, "upvote_ratio": 0.65, "num_comments": 54, "visited": false, "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcpuvu", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "rocelot7", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "•The most apparent and obvious is cost. Those aren't cheap and considering the area's where this would most beneficial are already cash strapped cities. Often the funds just aren't there.\n\n•Privacy concerns of the citizenry. Can't record in people's residence, or interior of car. Also many states require both parties to consent to being recorded, so the cops could violate state law by recording a person. Doing any of the above could make such recordings inadmissible in court.  Also there's concern over the storage of said recordings, plus the distinction between essential and non-essential recordings. \n\n•Their implementation and use would require training on there proper use, what one can and cannot record. Which again adds to the cost. Signed of from incumbent mayor's, governor's, chief's, police unions, etc., down to an individual officer(s) not wishing or wanting to do so if deemed non-essential to his/hers gear and uniform.\n\n•Finally it's not the problem solver its made out to be. Yeah it has helped in some cases but those are few and far between (and more often than not proved the officer innocent from false claims made against them by the person they arrested.) They can be easily damaged, dropped, lost, and misaligned. And remember in situations where they are helpful the last thought on anyone's mind \"is the shot in focus?\" Whats filmed could be obstructed, out of focus, out of range, and sometimes only captures blur. \n\nIn all honestly the cost of body cams could be better spent elsewhere. They can be helpful but better training and equipment would do worlds better than having a recording of an event. ", "edited": 1492386194.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;•The most apparent and obvious is cost. Those aren&amp;#39;t cheap and considering the area&amp;#39;s where this would most beneficial are already cash strapped cities. Often the funds just aren&amp;#39;t there.&lt;/p&gt;\n\n&lt;p&gt;•Privacy concerns of the citizenry. Can&amp;#39;t record in people&amp;#39;s residence, or interior of car. Also many states require both parties to consent to being recorded, so the cops could violate state law by recording a person. Doing any of the above could make such recordings inadmissible in court.  Also there&amp;#39;s concern over the storage of said recordings, plus the distinction between essential and non-essential recordings. &lt;/p&gt;\n\n&lt;p&gt;•Their implementation and use would require training on there proper use, what one can and cannot record. Which again adds to the cost. Signed of from incumbent mayor&amp;#39;s, governor&amp;#39;s, chief&amp;#39;s, police unions, etc., down to an individual officer(s) not wishing or wanting to do so if deemed non-essential to his/hers gear and uniform.&lt;/p&gt;\n\n&lt;p&gt;•Finally it&amp;#39;s not the problem solver its made out to be. Yeah it has helped in some cases but those are few and far between (and more often than not proved the officer innocent from false claims made against them by the person they arrested.) They can be easily damaged, dropped, lost, and misaligned. And remember in situations where they are helpful the last thought on anyone&amp;#39;s mind &amp;quot;is the shot in focus?&amp;quot; Whats filmed could be obstructed, out of focus, out of range, and sometimes only captures blur. &lt;/p&gt;\n\n&lt;p&gt;In all honestly the cost of body cams could be better spent elsewhere. They can be helpful but better training and equipment would do worlds better than having a recording of an event. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcpuvu", "score_hidden": false, "stickied": false, "created": 1492412408.0, "created_utc": 1492383608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgckm6l", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "dmazzoni", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "A lot of the answers so far are good, but they're missing one really important point: police are run by *cities*, not by states or the federal government.\n\nDozens of major cities around the country have already started using body cameras, and some of them for all officers.\n\nOther cities want to do it but haven't yet got the funding.\n\nIn some cities they're seeing resistance from officers or unions, it's true, but overall the trend seems to be to start using them.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of the answers so far are good, but they&amp;#39;re missing one really important point: police are run by &lt;em&gt;cities&lt;/em&gt;, not by states or the federal government.&lt;/p&gt;\n\n&lt;p&gt;Dozens of major cities around the country have already started using body cameras, and some of them for all officers.&lt;/p&gt;\n\n&lt;p&gt;Other cities want to do it but haven&amp;#39;t yet got the funding.&lt;/p&gt;\n\n&lt;p&gt;In some cities they&amp;#39;re seeing resistance from officers or unions, it&amp;#39;s true, but overall the trend seems to be to start using them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgckm6l", "score_hidden": false, "stickied": false, "created": 1492405416.0, "created_utc": 1492376616.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgciwrl", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "SloppyMeathole", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Police unions. No one has mentioned this yet. \n\nAs most police officers are unionized, any change to their working conditions has to be approved through collective bargaining (negotiating with the union). Union contracts often run for 3-5 years so the state can't just tell cops to start using them. \n\nSince many police union members (cops) don't want the cameras the unions can delay or prevent departments from adopting them.\n\nPolice unions are often politically powerful and politicians generally don't like to ram things down their throats that they really don't want. This is why in many places they've either been slow to adopt cameras or haven't done it at all. \n\nNote: I'm not demonizing police unions. They are not the sole reason that cameras are not fully adopted. Money is probably the number one reason, but there are also privacy concerns as well.      ", "edited": 1492376184.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Police unions. No one has mentioned this yet. &lt;/p&gt;\n\n&lt;p&gt;As most police officers are unionized, any change to their working conditions has to be approved through collective bargaining (negotiating with the union). Union contracts often run for 3-5 years so the state can&amp;#39;t just tell cops to start using them. &lt;/p&gt;\n\n&lt;p&gt;Since many police union members (cops) don&amp;#39;t want the cameras the unions can delay or prevent departments from adopting them.&lt;/p&gt;\n\n&lt;p&gt;Police unions are often politically powerful and politicians generally don&amp;#39;t like to ram things down their throats that they really don&amp;#39;t want. This is why in many places they&amp;#39;ve either been slow to adopt cameras or haven&amp;#39;t done it at all. &lt;/p&gt;\n\n&lt;p&gt;Note: I&amp;#39;m not demonizing police unions. They are not the sole reason that cameras are not fully adopted. Money is probably the number one reason, but there are also privacy concerns as well.      &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgciwrl", "score_hidden": false, "stickied": false, "created": 1492403181.0, "created_utc": 1492374381.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcql5u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "jrafferty", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I'm not sure if this is allowed as a top level comment, but it's something that I'm very passionate about so I'm going to respond anyway and attempt to explain like you're five on why you don't want to push body cameras on law enforcement, you want to resist them having access to them.  \n\nI was a federal cop for 5 years so I've seen both sides of the body camera 'movement'.  The citizens who are forcing the issue of body cameras see them as a means to catch cops doing the wrong thing which on the surface makes totals sense, but when you dig into the subject a little deeper that argument for support starts to fall apart.  Employers have been monitoring their employees since the invention of closed circuit TV.  Almost everywhere you go there are cameras watching both the customers and the employees...but mostly the employees.  The average employee isn't bothered by this because they would never do something wrong, a handful of employees are dissuaded from trying anything on camera but if they find a weak spot they'll exploit it, and a select few don't care about the cameras and gamble that nobody is watching.\n\nThe same goes for body cameras.  There are over 900,000 sworn law enforcement officers in the US and the overwhelmingly vast majority of them will spend their entire career faithfully serving the public with honor, dignity, and respect with some of them selflessly and heroically giving their live in the process.  A handful of cops would be dissuaded from doing something questionable on camera but would exploit a weakness in the system if they found one, and a select few just want to watch the world burn.  The numbers for \"bad\" cops are no different than the numbers for \"bad\" doctors, \"bad\" lawyers, or any other profession.  Some people just suck and they choose a variety of different professions to fund their suck ass lives.  \n\nSo now you win and all 900,000+ cops are outfitted with body cameras and dash cams.  But most of the cops would never do anything wrong and now they've got these cameras with them all the time. So what exactly are the camera's purpose?  They become evidence gathering tools against you and you can't just think about today, you have to consider the technological advances of the future.  If we mandated 100% body camera compliance tomorrow, within five years every cop would be a walking talking license plate reader/facial recognition computer.  In ten years we'd have cameras on every street corner and on the highways because \"why pay cops to pull over speeders when you can just send them a ticket in the mail? Cops are needed for real crimes.\"\n\nYou also have to take into account what this would do to our criminal justice system. When television shows like CSI became popular it had a measurable effect on the system that has been labeled [The CSI Effect:](https://en.wikipedia.org/wiki/CSI_effect)\n\n&gt;The CSI effect is hypothesized to affect verdicts in two main ways: first, that jurors expect more forensic evidence than is available or necessary, resulting in a higher rate of acquittal when such evidence is absent; and second, that jurors have greater confidence in forensic and particularly DNA evidence than is warranted, resulting in a higher rate of conviction when such evidence is present. While these and other effects may be caused by crime shows, the most commonly reported effect is that jurors are wrongly acquitting defendants despite overwhelming evidence of guilt. In particular, prosecutors have reported feeling pressured to provide DNA evidence even when eyewitness testimony is available. In one highly publicized incident, Los Angeles County, California District Attorney Steve Cooley blamed actor Robert Blake's acquittal on murder charges on the CSI effect. Cooley noted that the not guilty verdict came despite two witness accounts of Blake's guilt, and claimed that the jury members were \"incredibly stupid\".\n\nIn a world where every cop has a body and dash camera, anything that happens off camera might as well have never happened.  The solution to that?  Cameras everywhere!! The result? Hello 1984. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure if this is allowed as a top level comment, but it&amp;#39;s something that I&amp;#39;m very passionate about so I&amp;#39;m going to respond anyway and attempt to explain like you&amp;#39;re five on why you don&amp;#39;t want to push body cameras on law enforcement, you want to resist them having access to them.  &lt;/p&gt;\n\n&lt;p&gt;I was a federal cop for 5 years so I&amp;#39;ve seen both sides of the body camera &amp;#39;movement&amp;#39;.  The citizens who are forcing the issue of body cameras see them as a means to catch cops doing the wrong thing which on the surface makes totals sense, but when you dig into the subject a little deeper that argument for support starts to fall apart.  Employers have been monitoring their employees since the invention of closed circuit TV.  Almost everywhere you go there are cameras watching both the customers and the employees...but mostly the employees.  The average employee isn&amp;#39;t bothered by this because they would never do something wrong, a handful of employees are dissuaded from trying anything on camera but if they find a weak spot they&amp;#39;ll exploit it, and a select few don&amp;#39;t care about the cameras and gamble that nobody is watching.&lt;/p&gt;\n\n&lt;p&gt;The same goes for body cameras.  There are over 900,000 sworn law enforcement officers in the US and the overwhelmingly vast majority of them will spend their entire career faithfully serving the public with honor, dignity, and respect with some of them selflessly and heroically giving their live in the process.  A handful of cops would be dissuaded from doing something questionable on camera but would exploit a weakness in the system if they found one, and a select few just want to watch the world burn.  The numbers for &amp;quot;bad&amp;quot; cops are no different than the numbers for &amp;quot;bad&amp;quot; doctors, &amp;quot;bad&amp;quot; lawyers, or any other profession.  Some people just suck and they choose a variety of different professions to fund their suck ass lives.  &lt;/p&gt;\n\n&lt;p&gt;So now you win and all 900,000+ cops are outfitted with body cameras and dash cams.  But most of the cops would never do anything wrong and now they&amp;#39;ve got these cameras with them all the time. So what exactly are the camera&amp;#39;s purpose?  They become evidence gathering tools against you and you can&amp;#39;t just think about today, you have to consider the technological advances of the future.  If we mandated 100% body camera compliance tomorrow, within five years every cop would be a walking talking license plate reader/facial recognition computer.  In ten years we&amp;#39;d have cameras on every street corner and on the highways because &amp;quot;why pay cops to pull over speeders when you can just send them a ticket in the mail? Cops are needed for real crimes.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You also have to take into account what this would do to our criminal justice system. When television shows like CSI became popular it had a measurable effect on the system that has been labeled &lt;a href=\"https://en.wikipedia.org/wiki/CSI_effect\"&gt;The CSI Effect:&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The CSI effect is hypothesized to affect verdicts in two main ways: first, that jurors expect more forensic evidence than is available or necessary, resulting in a higher rate of acquittal when such evidence is absent; and second, that jurors have greater confidence in forensic and particularly DNA evidence than is warranted, resulting in a higher rate of conviction when such evidence is present. While these and other effects may be caused by crime shows, the most commonly reported effect is that jurors are wrongly acquitting defendants despite overwhelming evidence of guilt. In particular, prosecutors have reported feeling pressured to provide DNA evidence even when eyewitness testimony is available. In one highly publicized incident, Los Angeles County, California District Attorney Steve Cooley blamed actor Robert Blake&amp;#39;s acquittal on murder charges on the CSI effect. Cooley noted that the not guilty verdict came despite two witness accounts of Blake&amp;#39;s guilt, and claimed that the jury members were &amp;quot;incredibly stupid&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In a world where every cop has a body and dash camera, anything that happens off camera might as well have never happened.  The solution to that?  Cameras everywhere!! The result? Hello 1984. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcql5u", "score_hidden": false, "stickied": false, "created": 1492413427.0, "created_utc": 1492384627.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": "", "user_reports": [], "id": "dgcrsbu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "FA_2A120", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "So one thing I havent seen written yet is server space cost and records requests. I'll go into them here:\n\n1. Server space. Video clips take up a large amount of space on hard drives, so finding organization and storage for these videos numbering in the thousands is a headache. It's expensive to purchase the server space, but also to have it staffed properly. There are mechanisms where video needs to be purged, and you run into legal issues there as well.\n\n2. Open Records Requests. Imagine you're drunk and somehow end up partially or fully nude (this is a pretty common occurrence believe it or not). Your video clip of you nude is now open to be requested by anyone connected to this case, including civil attorneys for any lawsuit that may occur. This video may also be shown publicly in court. There are mechanisms or software that can be used to pixelate or blur nudity, but again....cost.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So one thing I havent seen written yet is server space cost and records requests. I&amp;#39;ll go into them here:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Server space. Video clips take up a large amount of space on hard drives, so finding organization and storage for these videos numbering in the thousands is a headache. It&amp;#39;s expensive to purchase the server space, but also to have it staffed properly. There are mechanisms where video needs to be purged, and you run into legal issues there as well.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Open Records Requests. Imagine you&amp;#39;re drunk and somehow end up partially or fully nude (this is a pretty common occurrence believe it or not). Your video clip of you nude is now open to be requested by anyone connected to this case, including civil attorneys for any lawsuit that may occur. This video may also be shown publicly in court. There are mechanisms or software that can be used to pixelate or blur nudity, but again....cost.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcrsbu", "score_hidden": false, "stickied": false, "created": 1492415039.0, "created_utc": 1492386239.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgchwi1", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "cdb03b", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "1) They are expensive. \n\n2) There are privacy concerns for the Police. \n\n3) There are security concerns for Police. \n\n4) There are privacy concerns for the public interacting with the police. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;1) They are expensive. &lt;/p&gt;\n\n&lt;p&gt;2) There are privacy concerns for the Police. &lt;/p&gt;\n\n&lt;p&gt;3) There are security concerns for Police. &lt;/p&gt;\n\n&lt;p&gt;4) There are privacy concerns for the public interacting with the police. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgchwi1", "score_hidden": false, "stickied": false, "created": 1492401896.0, "created_utc": 1492373096.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgchq50", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Astounded0387", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Most departments that have the funding for them, have them.\n\nPolice departments can't just shit money and equipment.  It requires funding.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Most departments that have the funding for them, have them.&lt;/p&gt;\n\n&lt;p&gt;Police departments can&amp;#39;t just shit money and equipment.  It requires funding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgchq50", "score_hidden": false, "stickied": false, "created": 1492401669.0, "created_utc": 1492372869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": "", "user_reports": [], "id": "dgcz73t", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mario_fingerbang", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Here in Australia cops are wearing them quite a lot. In Queensland, police were actually buying their own body cams until the QPS introduced them. The main reason for this is to cover the cops arses with regards to vexatious complaints by the shitheads they've arrested. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here in Australia cops are wearing them quite a lot. In Queensland, police were actually buying their own body cams until the QPS introduced them. The main reason for this is to cover the cops arses with regards to vexatious complaints by the shitheads they&amp;#39;ve arrested. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcz73t", "score_hidden": true, "stickied": false, "created": 1492425039.0, "created_utc": 1492396239.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": "", "user_reports": [], "id": "dgclclr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nickppapagiorgio", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Everyone may be for them having to wear them in theory, however everyone is not in favor of having their taxes raised to pay for it. When you start talking about taking money out of people's paychecks to pay for it, hypothetical support gets tested real quick.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone may be for them having to wear them in theory, however everyone is not in favor of having their taxes raised to pay for it. When you start talking about taking money out of people&amp;#39;s paychecks to pay for it, hypothetical support gets tested real quick.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgclclr", "score_hidden": false, "stickied": false, "created": 1492406364.0, "created_utc": 1492377564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65r2jv", "likes": null, "replies": "", "user_reports": [], "id": "dgcjpw9", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "GaryNOVA", "parent_id": "t3_65r2jv", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "who's going to pay for them?  that's the reason.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;who&amp;#39;s going to pay for them?  that&amp;#39;s the reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcjpw9", "score_hidden": false, "stickied": false, "created": 1492404239.0, "created_utc": 1492375439.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]