[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "explainlikeimfive", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": "qa", "user_reports": [], "secure_media": null, "link_flair_text": "Technology", "id": "65rjxg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 10335, "report_reasons": null, "author": "Joe_Scotto", "saved": false, "mod_reports": [], "name": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "approved_by": null, "over_18": false, "domain": "self.explainlikeimfive", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2sokd", "edited": false, "link_flair_css_class": "Technology", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/explainlikeimfive/comments/65rjxg/eli5_how_do_hive_applications_get_startup_users/", "num_reports": null, "locked": false, "stickied": false, "created": 1492407190.0, "url": "https://www.reddit.com/r/explainlikeimfive/comments/65rjxg/eli5_how_do_hive_applications_get_startup_users/", "author_flair_text": null, "quarantine": false, "title": "ELI5: How do \"hive\" applications get startup users? Apps like tinder, meetup, and other social apps?", "created_utc": 1492378390.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 479, "visited": false, "subreddit_type": "public", "ups": 10335}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcxar5", "gilded": 1, "archived": false, "score": 5310, "report_reasons": null, "author": "hedant", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "The heart of your question is really 'How are social networks formed?\" The textbook answer is that you need a **critical mass** of users, so that when someone new signs up, there are other people to interact with. Otherwise no matter how many people download your app, the newcomers will just leave if people are just trickling in, which means the app will be perpetually unpopular. The key then is to get a large number of users *at once*, so that the network becomes sustainable.\n\nHowever, this answer only leads to more questions because it creates a paradox that many people refer to as \"the chicken and the egg problem.\" How can you convince the first users to sign up when no one else is around? Unfortunately, there's no easy answer, which is why businesses are willing to pay an incredible amount of money just to buy an existing social network. If you've ever wondered why Instagram, Snapchat, and Twitter are worth so much even though they have no clear business model, this is exactly why (social networks are valuable because they are very difficult to create).\n\nNevertheless, here are a few guidelines that can help create a network. They don't always work (e.g. Google+ have tried and failed), but these are characteristics that successful social networks share:\n\n1) Start with a small but concentrated population. For example, Facebook was initially only available to Harvard students. Once it reached a critical mass of users there, it then expanded to other ivies, and then to all colleges, and finally to everyone. The same can be seen for dating apps like Coffee Meets Bagel, which first started off in NYC, and then gradually expanded to other cities before opening up to everyone. \n\nWhen you start off with a localized population, you lower your marketing costs and you get more mileage out of word of mouth. It's much easier to simultaneously sign up 1000 users in one city than it is to simultaneously sign up 1000 users in a thousand cities.\n\n\n2) Rely on users to recruit other users. Social apps become more useful when more people sign up, which means the users themselves are interested in helping advertise the app. For example, Venmo isn't very useful if your friends don't use it, so there's already an incentive for you to get your friends to install it. This growth will happen slowly over time, but because a critical mass requires a lot of simultaneous new users, you can speed up the process by rewarding existing users who help you expand your network. Venmo did this with a $20 referral bonus to both the new user and the friend who referred them. Other apps reward in-app currencies or features, such as letting you message more people on dating apps.\n\n3) Minimize sign up costs for users. If you've ever wondered why many computer games (e.g. League of Legends) and mobile games are free to play, it's because the very presence of a user is valuable. A multiplayer game would be unplayable if no one else is there. Thus, companies will literally pay new users (e.g. Venmo example above) to sign up. Of course, this is very costly, so the next best thing is to offer the app for free. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The heart of your question is really &amp;#39;How are social networks formed?&amp;quot; The textbook answer is that you need a &lt;strong&gt;critical mass&lt;/strong&gt; of users, so that when someone new signs up, there are other people to interact with. Otherwise no matter how many people download your app, the newcomers will just leave if people are just trickling in, which means the app will be perpetually unpopular. The key then is to get a large number of users &lt;em&gt;at once&lt;/em&gt;, so that the network becomes sustainable.&lt;/p&gt;\n\n&lt;p&gt;However, this answer only leads to more questions because it creates a paradox that many people refer to as &amp;quot;the chicken and the egg problem.&amp;quot; How can you convince the first users to sign up when no one else is around? Unfortunately, there&amp;#39;s no easy answer, which is why businesses are willing to pay an incredible amount of money just to buy an existing social network. If you&amp;#39;ve ever wondered why Instagram, Snapchat, and Twitter are worth so much even though they have no clear business model, this is exactly why (social networks are valuable because they are very difficult to create).&lt;/p&gt;\n\n&lt;p&gt;Nevertheless, here are a few guidelines that can help create a network. They don&amp;#39;t always work (e.g. Google+ have tried and failed), but these are characteristics that successful social networks share:&lt;/p&gt;\n\n&lt;p&gt;1) Start with a small but concentrated population. For example, Facebook was initially only available to Harvard students. Once it reached a critical mass of users there, it then expanded to other ivies, and then to all colleges, and finally to everyone. The same can be seen for dating apps like Coffee Meets Bagel, which first started off in NYC, and then gradually expanded to other cities before opening up to everyone. &lt;/p&gt;\n\n&lt;p&gt;When you start off with a localized population, you lower your marketing costs and you get more mileage out of word of mouth. It&amp;#39;s much easier to simultaneously sign up 1000 users in one city than it is to simultaneously sign up 1000 users in a thousand cities.&lt;/p&gt;\n\n&lt;p&gt;2) Rely on users to recruit other users. Social apps become more useful when more people sign up, which means the users themselves are interested in helping advertise the app. For example, Venmo isn&amp;#39;t very useful if your friends don&amp;#39;t use it, so there&amp;#39;s already an incentive for you to get your friends to install it. This growth will happen slowly over time, but because a critical mass requires a lot of simultaneous new users, you can speed up the process by rewarding existing users who help you expand your network. Venmo did this with a $20 referral bonus to both the new user and the friend who referred them. Other apps reward in-app currencies or features, such as letting you message more people on dating apps.&lt;/p&gt;\n\n&lt;p&gt;3) Minimize sign up costs for users. If you&amp;#39;ve ever wondered why many computer games (e.g. League of Legends) and mobile games are free to play, it&amp;#39;s because the very presence of a user is valuable. A multiplayer game would be unplayable if no one else is there. Thus, companies will literally pay new users (e.g. Venmo example above) to sign up. Of course, this is very costly, so the next best thing is to offer the app for free. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcxar5", "score_hidden": false, "stickied": false, "created": 1492422383.0, "created_utc": 1492393583.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5310}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd3brj", "gilded": 0, "archived": false, "score": 220, "report_reasons": null, "author": "GaryARefuge", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Social networks rely upon something called \"network effect\" to provide a benefit to the user.\n\n- You need a lot of users for the features in the application to work the way they are meant to\n\n---------\n\nExample:  Using a dating app with only 10 users.\n\n- You log into the app and only see 10 people\n- You aren't likely to date any of those 10 people\n- You aren't likely to even connect with any of those 10 people because you don't match\n- None of the features like search, messaging, favoriting, etc provide any value because the isn't a network to interact with\n\nFor many applications the network needs to be in a specific vicinity for those features or the key benefit of the application to be obtained.\n\nExample:  A dating app with 10,000 users but, the users are spread across the world with only 10 users in any given city.\n\nEven though you have many times more users you're still going to have the same shitty experience as if the entire application only had 10 users.\n\n------\n\nSo, what do applications that rely upon the network effect to provide a benefit and value to their user?\n\n- They can create many fake accounts to give the illusion of a big network which leads to actual users joining\n- They create alternative benefits for users that do not rely upon a network effect--like creating contests or giveaways in the application tied to using it, paying users to use the app, creating affiliate programs paying people to get their own network to join and use the app, specific features the aid in the experience (like personal matchmaking or dating consultation services), etc\n- They partner with a much larger network and offer incentives to the partner to on-board their users--like an affiliate program arrangement\n- They acquire an existing company with an establishing network\n\nIf the application's network effect does require the users of that network to be within a close proximity of one another the strategy is focused on a single specific area at a time.\n\nDating apps and ride sharing apps are great examples of this. They start in hyper local areas (college campus) and slowly extend outward. Once they capture a large % of the market in that area they roll out to a new area and build further.\n\nDefinitely read up on Tinder, Bumble, Uber, Lyft, DoorDash, Facebook, Snap, etc for interesting examples of how they each did it a little differently.\n\n------\n\nEverything distills down to an experience.  \n\nA user judges their experience not just upon using the application but, upon every instance of interacting with your company--directly or indirectly through word or mouth/reviews.\n\nWhatever strategy is created and implemented usually supports the overall experiential goal that the social network represents...the key benefit of being a part of that network.\n\nIf you're trying to do this yourself, always be aware of this and always do what enhances the experience by having every strategy, decision, and action in alignment with each other and the overall goal.\n\nIf what you do does not support that goal, you're only creating confusion/discomfort for the user and taking away from that experience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Social networks rely upon something called &amp;quot;network effect&amp;quot; to provide a benefit to the user.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;You need a lot of users for the features in the application to work the way they are meant to&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Example:  Using a dating app with only 10 users.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;You log into the app and only see 10 people&lt;/li&gt;\n&lt;li&gt;You aren&amp;#39;t likely to date any of those 10 people&lt;/li&gt;\n&lt;li&gt;You aren&amp;#39;t likely to even connect with any of those 10 people because you don&amp;#39;t match&lt;/li&gt;\n&lt;li&gt;None of the features like search, messaging, favoriting, etc provide any value because the isn&amp;#39;t a network to interact with&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;For many applications the network needs to be in a specific vicinity for those features or the key benefit of the application to be obtained.&lt;/p&gt;\n\n&lt;p&gt;Example:  A dating app with 10,000 users but, the users are spread across the world with only 10 users in any given city.&lt;/p&gt;\n\n&lt;p&gt;Even though you have many times more users you&amp;#39;re still going to have the same shitty experience as if the entire application only had 10 users.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;So, what do applications that rely upon the network effect to provide a benefit and value to their user?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;They can create many fake accounts to give the illusion of a big network which leads to actual users joining&lt;/li&gt;\n&lt;li&gt;They create alternative benefits for users that do not rely upon a network effect--like creating contests or giveaways in the application tied to using it, paying users to use the app, creating affiliate programs paying people to get their own network to join and use the app, specific features the aid in the experience (like personal matchmaking or dating consultation services), etc&lt;/li&gt;\n&lt;li&gt;They partner with a much larger network and offer incentives to the partner to on-board their users--like an affiliate program arrangement&lt;/li&gt;\n&lt;li&gt;They acquire an existing company with an establishing network&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;If the application&amp;#39;s network effect does require the users of that network to be within a close proximity of one another the strategy is focused on a single specific area at a time.&lt;/p&gt;\n\n&lt;p&gt;Dating apps and ride sharing apps are great examples of this. They start in hyper local areas (college campus) and slowly extend outward. Once they capture a large % of the market in that area they roll out to a new area and build further.&lt;/p&gt;\n\n&lt;p&gt;Definitely read up on Tinder, Bumble, Uber, Lyft, DoorDash, Facebook, Snap, etc for interesting examples of how they each did it a little differently.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Everything distills down to an experience.  &lt;/p&gt;\n\n&lt;p&gt;A user judges their experience not just upon using the application but, upon every instance of interacting with your company--directly or indirectly through word or mouth/reviews.&lt;/p&gt;\n\n&lt;p&gt;Whatever strategy is created and implemented usually supports the overall experiential goal that the social network represents...the key benefit of being a part of that network.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re trying to do this yourself, always be aware of this and always do what enhances the experience by having every strategy, decision, and action in alignment with each other and the overall goal.&lt;/p&gt;\n\n&lt;p&gt;If what you do does not support that goal, you&amp;#39;re only creating confusion/discomfort for the user and taking away from that experience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd3brj", "score_hidden": false, "stickied": false, "created": 1492431138.0, "created_utc": 1492402338.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 220}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcwcat", "gilded": 0, "archived": false, "score": 99, "report_reasons": null, "author": "rump_truck", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "As others have noted, many of them start off with a small, easy to target niche. Facebook and Tinder started off with colleges because college students have a shared identity that their marketers could leverage, it's easy to test your messaging when you can actually watch people react, and young people tend to be early adopters of new technologies.\n\nSome marketplace-type apps cannibalize their competitors. For instance, AirBnB started off putting listings on CraigsList pointing to their own platform, to get people to switch. I've also heard of companies selling things on eBay and including materials promoting their own apps. That way they're getting the best possible users, the ones who are already doing what they want them to do and just need a better way to do it. That minimizes the number of users they need to get in the door to get a useful amount of activity going through the product.\n\nSome companies use a honeypot approach, where they launch a product that doesn't depend on network effects, then use that to build up their audience enough to later switch on the parts that are dependent on network effects. OkCupid started out as just a bunch of wacky, fun questions that you could share with your friends. Then once they had some number of people, they rolled out the ability to find other people based on how close their answers are to yours.\n\nSome go for broke and just try to sprint past it. They build a product dependent on network effects, raise millions of dollars, and sink most of that money into marketing to almost immediately grow the userbase large enough for the product to be useful.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As others have noted, many of them start off with a small, easy to target niche. Facebook and Tinder started off with colleges because college students have a shared identity that their marketers could leverage, it&amp;#39;s easy to test your messaging when you can actually watch people react, and young people tend to be early adopters of new technologies.&lt;/p&gt;\n\n&lt;p&gt;Some marketplace-type apps cannibalize their competitors. For instance, AirBnB started off putting listings on CraigsList pointing to their own platform, to get people to switch. I&amp;#39;ve also heard of companies selling things on eBay and including materials promoting their own apps. That way they&amp;#39;re getting the best possible users, the ones who are already doing what they want them to do and just need a better way to do it. That minimizes the number of users they need to get in the door to get a useful amount of activity going through the product.&lt;/p&gt;\n\n&lt;p&gt;Some companies use a honeypot approach, where they launch a product that doesn&amp;#39;t depend on network effects, then use that to build up their audience enough to later switch on the parts that are dependent on network effects. OkCupid started out as just a bunch of wacky, fun questions that you could share with your friends. Then once they had some number of people, they rolled out the ability to find other people based on how close their answers are to yours.&lt;/p&gt;\n\n&lt;p&gt;Some go for broke and just try to sprint past it. They build a product dependent on network effects, raise millions of dollars, and sink most of that money into marketing to almost immediately grow the userbase large enough for the product to be useful.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcwcat", "score_hidden": false, "stickied": false, "created": 1492421107.0, "created_utc": 1492392307.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 99}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd86ue", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "MNGrrl", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Well, there's a few ways. You could look to how Reddit did it. Looking through the comments, surprised nobody saw it. Basically, they setup the site and then created a pile of alt accounts. As people would post, they'd patiently remind them of the rules and guide them into the behavior of the kind of user they wanted to attract. They also quite literally had conversations with themselves to give the appearance of a larger (and more cohesive) userbase than actually existed. It was basically a re-enactment of the monkey story -- and eventually it reached critical mass and started growing on its own and the alt accounts went defunct. The site you see today is the result of those early efforts. \n\nWas it dishonest? Maybe. But that's how a lot of sites kick off. Slashdot did the same thing, before it rose to prominence in the IT world... and then they sold out and it all came crashing down. There's actually many, many forum-based sites where when they initially went live, it was mostly the author/owners going to other forums and canvasing to draw people to their site and giving the appearance of more activity to keep people around until that critical mass point tipped over and it became self-sustaining.\n\nThere's also examples where they didn't do this and trusted that the mere brand identity or whatever would carry the day: Google+ for example, also known as the Ghost Town of the social networking world, or Hangouts, which is yet another attempt by Google to shove something down people's throats that totally isn't working out. I'm sorry to say, but if you're the only one at a party, more people showing up isn't gonna happen. You need that core glob of people to start roping others in, and even if you have to fake it, it's better than just kicking off the site and then promoting it without that (even fake) activity to engage people. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, there&amp;#39;s a few ways. You could look to how Reddit did it. Looking through the comments, surprised nobody saw it. Basically, they setup the site and then created a pile of alt accounts. As people would post, they&amp;#39;d patiently remind them of the rules and guide them into the behavior of the kind of user they wanted to attract. They also quite literally had conversations with themselves to give the appearance of a larger (and more cohesive) userbase than actually existed. It was basically a re-enactment of the monkey story -- and eventually it reached critical mass and started growing on its own and the alt accounts went defunct. The site you see today is the result of those early efforts. &lt;/p&gt;\n\n&lt;p&gt;Was it dishonest? Maybe. But that&amp;#39;s how a lot of sites kick off. Slashdot did the same thing, before it rose to prominence in the IT world... and then they sold out and it all came crashing down. There&amp;#39;s actually many, many forum-based sites where when they initially went live, it was mostly the author/owners going to other forums and canvasing to draw people to their site and giving the appearance of more activity to keep people around until that critical mass point tipped over and it became self-sustaining.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also examples where they didn&amp;#39;t do this and trusted that the mere brand identity or whatever would carry the day: Google+ for example, also known as the Ghost Town of the social networking world, or Hangouts, which is yet another attempt by Google to shove something down people&amp;#39;s throats that totally isn&amp;#39;t working out. I&amp;#39;m sorry to say, but if you&amp;#39;re the only one at a party, more people showing up isn&amp;#39;t gonna happen. You need that core glob of people to start roping others in, and even if you have to fake it, it&amp;#39;s better than just kicking off the site and then promoting it without that (even fake) activity to engage people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd86ue", "score_hidden": false, "stickied": false, "created": 1492440988.0, "created_utc": 1492412188.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrud6", "gilded": 0, "archived": false, "score": 579, "report_reasons": null, "author": "redwire2012", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "One of the simplest methods is simply not to launch until you have X number of users pre-signed up, i.e.:\n\nWe are launching soon enter your email to be notified when we do\n\nThe peril there is your concept and marketing has to be strong enough to bring them back when you launch. You also need to be aware 1 email != 1 user\n\nThere are bots thy just fill in forms, users that don't bother returning, bounced and changed emails and so on. Rule of thumb tends to be around 10-30% usually come back to check it out", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;One of the simplest methods is simply not to launch until you have X number of users pre-signed up, i.e.:&lt;/p&gt;\n\n&lt;p&gt;We are launching soon enter your email to be notified when we do&lt;/p&gt;\n\n&lt;p&gt;The peril there is your concept and marketing has to be strong enough to bring them back when you launch. You also need to be aware 1 email != 1 user&lt;/p&gt;\n\n&lt;p&gt;There are bots thy just fill in forms, users that don&amp;#39;t bother returning, bounced and changed emails and so on. Rule of thumb tends to be around 10-30% usually come back to check it out&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcrud6", "score_hidden": false, "stickied": false, "created": 1492415115.0, "created_utc": 1492386315.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 579}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcp3q0", "gilded": 0, "archived": false, "score": 448, "report_reasons": null, "author": "ClownFire", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Many don't start with a user base.\n\nQuite a few buy the information they will need to start from a similar business with a different focus. Think buying traffic flow data from Google maps or how many people in what areas are looking for hot singles near them from bing.\n\nAfter that they will advertise​ millions and millions of dollars in advertising, hots special prizes for joining earlier, have bots, and staff do the heavy lifting till the user base picks up. Just like forums really.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many don&amp;#39;t start with a user base.&lt;/p&gt;\n\n&lt;p&gt;Quite a few buy the information they will need to start from a similar business with a different focus. Think buying traffic flow data from Google maps or how many people in what areas are looking for hot singles near them from bing.&lt;/p&gt;\n\n&lt;p&gt;After that they will advertise​ millions and millions of dollars in advertising, hots special prizes for joining earlier, have bots, and staff do the heavy lifting till the user base picks up. Just like forums really.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcp3q0", "score_hidden": false, "stickied": false, "created": 1492411371.0, "created_utc": 1492382571.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 448}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcs03i", "gilded": 0, "archived": false, "score": 1839, "report_reasons": null, "author": "akademia", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "\nTinder targeted a few college campuses when they first launched in the fall of 2012. These colleges included \"party\" schools such as USC. 90% of users were ages between 18-24 in 2012. \n\nI would suspect other social/dating apps would begin in colleges as you have aggregated amount of young people in one area. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tinder targeted a few college campuses when they first launched in the fall of 2012. These colleges included &amp;quot;party&amp;quot; schools such as USC. 90% of users were ages between 18-24 in 2012. &lt;/p&gt;\n\n&lt;p&gt;I would suspect other social/dating apps would begin in colleges as you have aggregated amount of young people in one area. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcs03i", "score_hidden": false, "stickied": false, "created": 1492415330.0, "created_utc": 1492386530.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1839}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgd31in", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Foofymonster", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I work(ed) for a company that had this exactly, I can tell you the answer is money and speed.\n\nI can't give away too many details about the company without giving it away, but we were spending upwards of $25 per person to build an account. It's not that we were paying them, but we used feet on the streets, and face to face interactions with an army of hourly people to just get as many downloads as we possibly can. \n\nWe did this quickly. We just accepted that the first 100-1000 users were going to have a bad time, but once we artificially cranked the wheel enough, we could take our hands off of it and it would go on it's own, and that is exactly what happened. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I work(ed) for a company that had this exactly, I can tell you the answer is money and speed.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t give away too many details about the company without giving it away, but we were spending upwards of $25 per person to build an account. It&amp;#39;s not that we were paying them, but we used feet on the streets, and face to face interactions with an army of hourly people to just get as many downloads as we possibly can. &lt;/p&gt;\n\n&lt;p&gt;We did this quickly. We just accepted that the first 100-1000 users were going to have a bad time, but once we artificially cranked the wheel enough, we could take our hands off of it and it would go on it&amp;#39;s own, and that is exactly what happened. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd31in", "score_hidden": false, "stickied": false, "created": 1492430677.0, "created_utc": 1492401877.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgd1eqt", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "whuttupfoo", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Some of these apps also started as a different platform entirely. When Instagram first started it was promoted as an image filter app but you were forced to create an account to use their filters. It happened to have a feature that would let you post on Facebook and twitter at the same time in exchange for posting on their social network. So it kind of built up that way. \n\nSnapchat was marketed as a private messaging app that happened to grow into its own social network. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some of these apps also started as a different platform entirely. When Instagram first started it was promoted as an image filter app but you were forced to create an account to use their filters. It happened to have a feature that would let you post on Facebook and twitter at the same time in exchange for posting on their social network. So it kind of built up that way. &lt;/p&gt;\n\n&lt;p&gt;Snapchat was marketed as a private messaging app that happened to grow into its own social network. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd1eqt", "score_hidden": false, "stickied": false, "created": 1492428167.0, "created_utc": 1492399367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgct0n4", "gilded": 0, "archived": false, "score": 99, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgct0n4", "score_hidden": false, "stickied": false, "created": 1492416730.0, "created_utc": 1492387930.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 99}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd8lku", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "wizarddewd", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Hey! So I was actually recruited to help spread an app like Tinder because I'm a sort of influential member of my campus and in a fraternity. The one I \"worked\" for offered commission for certain thresholds of downloads for my area, and it was monitored via how many people stated they were at my campus. The app that was described to me versus the actual app in function was very different, and honestly pretty sleazy. The developer was my point of contact and would every couple weeks check in and tell me some new even shallower feature that they added.\n\nAt the end of it all, after I had given up trying to spread this app that I ultimately decided was not something I wanted to support, he sent me a very unprofessional email basically saying, \"Hey! You know how we said we would pay you? Turns out we can't!\"\n\nSo yeah. A lot of the apps rely on getting some college kids to whore out downloads from their friends.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey! So I was actually recruited to help spread an app like Tinder because I&amp;#39;m a sort of influential member of my campus and in a fraternity. The one I &amp;quot;worked&amp;quot; for offered commission for certain thresholds of downloads for my area, and it was monitored via how many people stated they were at my campus. The app that was described to me versus the actual app in function was very different, and honestly pretty sleazy. The developer was my point of contact and would every couple weeks check in and tell me some new even shallower feature that they added.&lt;/p&gt;\n\n&lt;p&gt;At the end of it all, after I had given up trying to spread this app that I ultimately decided was not something I wanted to support, he sent me a very unprofessional email basically saying, &amp;quot;Hey! You know how we said we would pay you? Turns out we can&amp;#39;t!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So yeah. A lot of the apps rely on getting some college kids to whore out downloads from their friends.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd8lku", "score_hidden": false, "stickied": false, "created": 1492441900.0, "created_utc": 1492413100.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2lci", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "Reddit_FTW", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I was on Grindr when it first started. On the original iPhone. The nearest person was like 20-50 miles away. And littered with dick pics as profile pictures. The good old days. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was on Grindr when it first started. On the original iPhone. The nearest person was like 20-50 miles away. And littered with dick pics as profile pictures. The good old days. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd2lci", "score_hidden": false, "stickied": false, "created": 1492429944.0, "created_utc": 1492401144.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcqwch", "gilded": 0, "archived": false, "score": 226, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": 1492385683.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcqwch", "score_hidden": false, "stickied": false, "created": 1492413851.0, "created_utc": 1492385051.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 226}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgcy7d3", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "PM_ME_BOOBPIX", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "At a high level, every new/innovative product (or service) introduced in a marketplace starts with the *Early Adopters*; these are people who are unhappy with the status quo, the stuff out there, and they are looking for something new that fits their needs/wants, often by *hacking* the present products.\n\nEngage then early adopter and ... that's just the beginning.\n\nFor more: https://en.wikipedia.org/wiki/Crossing_the_Chasm", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At a high level, every new/innovative product (or service) introduced in a marketplace starts with the &lt;em&gt;Early Adopters&lt;/em&gt;; these are people who are unhappy with the status quo, the stuff out there, and they are looking for something new that fits their needs/wants, often by &lt;em&gt;hacking&lt;/em&gt; the present products.&lt;/p&gt;\n\n&lt;p&gt;Engage then early adopter and ... that&amp;#39;s just the beginning.&lt;/p&gt;\n\n&lt;p&gt;For more: &lt;a href=\"https://en.wikipedia.org/wiki/Crossing_the_Chasm\"&gt;https://en.wikipedia.org/wiki/Crossing_the_Chasm&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcy7d3", "score_hidden": false, "stickied": false, "created": 1492423654.0, "created_utc": 1492394854.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcvu5p", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcvu5p", "score_hidden": false, "stickied": false, "created": 1492420478.0, "created_utc": 1492391678.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd2uq7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "MrBushido2318", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "What a lot of people seem to neglect in their replies that critical mass isn't just down to the number of people using your service. But the number of people who use it in a particular area.\n\nThis makes universities an extremely good place to target your services. Facebook started out as a way for students to keep in touch that was better than myspace. Tinder likely the same.\n\nYou need to find a high density of the demographic you're targeting and market the fuck out of your product to them. (reddit stole fark users)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a lot of people seem to neglect in their replies that critical mass isn&amp;#39;t just down to the number of people using your service. But the number of people who use it in a particular area.&lt;/p&gt;\n\n&lt;p&gt;This makes universities an extremely good place to target your services. Facebook started out as a way for students to keep in touch that was better than myspace. Tinder likely the same.&lt;/p&gt;\n\n&lt;p&gt;You need to find a high density of the demographic you&amp;#39;re targeting and market the fuck out of your product to them. (reddit stole fark users)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd2uq7", "score_hidden": false, "stickied": false, "created": 1492430368.0, "created_utc": 1492401568.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyrv0", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": 1492436734.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcyrv0", "score_hidden": false, "stickied": false, "created": 1492424449.0, "created_utc": 1492395649.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcr14s", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "PM_Me_PS_Store_Codes", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Smaller companies lean heavily on word of mouth. Tell everyone you know and beg them to tell everyone they know. It was how I found out about the Her app back when it was datch I think it was called. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Smaller companies lean heavily on word of mouth. Tell everyone you know and beg them to tell everyone they know. It was how I found out about the Her app back when it was datch I think it was called. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcr14s", "score_hidden": false, "stickied": false, "created": 1492414032.0, "created_utc": 1492385232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcy949", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "pupperpowell", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "PayPal paid $10 to sign up for a while.\n\nSource: Notes on startups, or how to build the future by Peter Thiel", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;PayPal paid $10 to sign up for a while.&lt;/p&gt;\n\n&lt;p&gt;Source: Notes on startups, or how to build the future by Peter Thiel&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcy949", "score_hidden": false, "stickied": false, "created": 1492423722.0, "created_utc": 1492394922.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgd7lq0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Yamatjac", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "It's less important to have a *lot* of users, and more important to have a big percentage of your users be able to connect with each other.\n\nIf facebook had a user-base of 50 people, and each one was from a different city, none of the users would find it all that useful of a platform. But if those 50 people were from the same school, they might find it to be useful. And those 50 people would start telling their friends that aren't on facebook to get on facebook. And everybody that signed up would have at least a few people that they could talk to, and they'd start telling their friends to get on facebook. You can see how quickly these numbers can skyrocket.\n\nYou only need a small starting point and a well designed platform for it to blow the fuck up. \n\nWith that said, there's also the option of buying users, or recruiting them from other social media platforms. You'll see people doing this a lot on reddit, but usually only in the smaller subreddits. Fake user accounts is another option.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s less important to have a &lt;em&gt;lot&lt;/em&gt; of users, and more important to have a big percentage of your users be able to connect with each other.&lt;/p&gt;\n\n&lt;p&gt;If facebook had a user-base of 50 people, and each one was from a different city, none of the users would find it all that useful of a platform. But if those 50 people were from the same school, they might find it to be useful. And those 50 people would start telling their friends that aren&amp;#39;t on facebook to get on facebook. And everybody that signed up would have at least a few people that they could talk to, and they&amp;#39;d start telling their friends to get on facebook. You can see how quickly these numbers can skyrocket.&lt;/p&gt;\n\n&lt;p&gt;You only need a small starting point and a well designed platform for it to blow the fuck up. &lt;/p&gt;\n\n&lt;p&gt;With that said, there&amp;#39;s also the option of buying users, or recruiting them from other social media platforms. You&amp;#39;ll see people doing this a lot on reddit, but usually only in the smaller subreddits. Fake user accounts is another option.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd7lq0", "score_hidden": false, "stickied": false, "created": 1492439602.0, "created_utc": 1492410802.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgcq47k", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "simianoverlord", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Not a direct answer to the question, but any service that requires a group of users to work relies on \"network effect\". That is, the value of the service is very dependent on having the right number of users in its network. Having too few people on a dating site makes it useless, or in business terms, it has little value. \n\nWhen starting such a service, the cost to acquire each user is an important cost to factor into business plans. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not a direct answer to the question, but any service that requires a group of users to work relies on &amp;quot;network effect&amp;quot;. That is, the value of the service is very dependent on having the right number of users in its network. Having too few people on a dating site makes it useless, or in business terms, it has little value. &lt;/p&gt;\n\n&lt;p&gt;When starting such a service, the cost to acquire each user is an important cost to factor into business plans. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcq47k", "score_hidden": false, "stickied": false, "created": 1492412768.0, "created_utc": 1492383968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcytwz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Snowblxnd", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "There's a locally developed app for music sharing, sharing information about shows and the scene, etc. I learned about them at a music conference, where they started to market and share the app with musicians in the area. They are currently on a tour across the country interviewing and recording musicians from all over the US. They're putting together some good video content and sharing it online.\n\nIt seems like it's a tough grind.\n\nActually, I just remembered something. They held a talk at my college and got Andrew W.K. to talk about the app before I learned about them at the music conference a couple of years later.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a locally developed app for music sharing, sharing information about shows and the scene, etc. I learned about them at a music conference, where they started to market and share the app with musicians in the area. They are currently on a tour across the country interviewing and recording musicians from all over the US. They&amp;#39;re putting together some good video content and sharing it online.&lt;/p&gt;\n\n&lt;p&gt;It seems like it&amp;#39;s a tough grind.&lt;/p&gt;\n\n&lt;p&gt;Actually, I just remembered something. They held a talk at my college and got Andrew W.K. to talk about the app before I learned about them at the music conference a couple of years later.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcytwz", "score_hidden": false, "stickied": false, "created": 1492424529.0, "created_utc": 1492395729.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdl80n", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "mortusest", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Get young women to sign up.\n\nEvery successful social network has started by focusing on teen and college age girls. Tinder actually started by bribing sororities.\n\nGoogle+ gave out early access to 30-40 year old male tech bloggers. Guess what happened to them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get young women to sign up.&lt;/p&gt;\n\n&lt;p&gt;Every successful social network has started by focusing on teen and college age girls. Tinder actually started by bribing sororities.&lt;/p&gt;\n\n&lt;p&gt;Google+ gave out early access to 30-40 year old male tech bloggers. Guess what happened to them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdl80n", "score_hidden": true, "stickied": false, "created": 1492470284.0, "created_utc": 1492441484.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgd6x5h", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "HoneyBoobBoob", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I was offered a promo job for some dating app a year or so ago. We walked down the line of club liv with 'cool' light up shit that drunk tourists live for. If they downloaded our app, they got a random prize and a voucher for a free drink if one of their friends signed up before they entered the club.  (Drinks at liv are like 30$ so almost everyone did it) imagine them doing this in miami, la, new york, chicago etc on the same night in multiple clubs per city? The tourists go home,  the app alerts them to nearby people and they start using it... they are in those cheezy club photos you take at the entrance with the glasses, boom sticks, pins, phone cases etc with the logo on it. Of course they post that super cool time they went to liv on their social media.... advertising to more people. It was pathetic to watch people give up personal info, effectively selling themselves to advertising companies,  to get a fucking light up ring.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was offered a promo job for some dating app a year or so ago. We walked down the line of club liv with &amp;#39;cool&amp;#39; light up shit that drunk tourists live for. If they downloaded our app, they got a random prize and a voucher for a free drink if one of their friends signed up before they entered the club.  (Drinks at liv are like 30$ so almost everyone did it) imagine them doing this in miami, la, new york, chicago etc on the same night in multiple clubs per city? The tourists go home,  the app alerts them to nearby people and they start using it... they are in those cheezy club photos you take at the entrance with the glasses, boom sticks, pins, phone cases etc with the logo on it. Of course they post that super cool time they went to liv on their social media.... advertising to more people. It was pathetic to watch people give up personal info, effectively selling themselves to advertising companies,  to get a fucking light up ring.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd6x5h", "score_hidden": false, "stickied": false, "created": 1492438077.0, "created_utc": 1492409277.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgd0am4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "djvirgen", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "To add to the other answers here, you can also \"buy\" users, but not in the traditional sense. What I mean is you can reach out to internet celebrities that already have their own fan base, and ask them (pay them) to use your app and bring their followers with them. This may not work for dating sites, but it can work for user-generated content sites like blogs, video streaming, etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To add to the other answers here, you can also &amp;quot;buy&amp;quot; users, but not in the traditional sense. What I mean is you can reach out to internet celebrities that already have their own fan base, and ask them (pay them) to use your app and bring their followers with them. This may not work for dating sites, but it can work for user-generated content sites like blogs, video streaming, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd0am4", "score_hidden": false, "stickied": false, "created": 1492426571.0, "created_utc": 1492397771.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdd0dv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "luc122c", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Some apps have a 'pre-order' like sign up phase where you create your account before the app actually comes out. That way, when the app launches, it could already have thousands of users, many of which are excited for it to come out and will start eagerly using it from day 1,", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some apps have a &amp;#39;pre-order&amp;#39; like sign up phase where you create your account before the app actually comes out. That way, when the app launches, it could already have thousands of users, many of which are excited for it to come out and will start eagerly using it from day 1,&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdd0dv", "score_hidden": false, "stickied": false, "created": 1492456097.0, "created_utc": 1492427297.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdg1v2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Vroomped", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "It usually starts with local marketing. I had an idea for an app, and just by taking surveys people wanted to use our app, and kept asking us about it even thought it wasn't economically safe to start that app. Another app has had a history of bulling people out of the market by offering their larger more experienced infrastructure to users.\n\nSo, to answer the question it starts relatively small, but function, unless its comes from an existing company then its the big fish eating the little fish. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It usually starts with local marketing. I had an idea for an app, and just by taking surveys people wanted to use our app, and kept asking us about it even thought it wasn&amp;#39;t economically safe to start that app. Another app has had a history of bulling people out of the market by offering their larger more experienced infrastructure to users.&lt;/p&gt;\n\n&lt;p&gt;So, to answer the question it starts relatively small, but function, unless its comes from an existing company then its the big fish eating the little fish. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdg1v2", "score_hidden": false, "stickied": false, "created": 1492462790.0, "created_utc": 1492433990.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdgihp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "KingOfJura", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Just fake a few people,have your friends get the app and invest in ads.\nAlot.\n\nI see it alot: bars open, dont advertise or very cheaply, run like 6 months so more or less ok and then close.\nBut bars who advertise ALOT, print dozens of flyers, make ads on facebook and in local papers. Blow out tons of money.\nThese bars run like hell. Always. \n\nIts the same with apps.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just fake a few people,have your friends get the app and invest in ads.\nAlot.&lt;/p&gt;\n\n&lt;p&gt;I see it alot: bars open, dont advertise or very cheaply, run like 6 months so more or less ok and then close.\nBut bars who advertise ALOT, print dozens of flyers, make ads on facebook and in local papers. Blow out tons of money.\nThese bars run like hell. Always. &lt;/p&gt;\n\n&lt;p&gt;Its the same with apps.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdgihp", "score_hidden": false, "stickied": false, "created": 1492463590.0, "created_utc": 1492434790.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdd8g1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Thrillhouse01", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I found Tinders story pretty cool. From what I recall they actually threw a party at USC and had everyone there download the app and it grew at least partially naturally from those people. Pretty sure it was like a couple sororities and frats. Look it up. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I found Tinders story pretty cool. From what I recall they actually threw a party at USC and had everyone there download the app and it grew at least partially naturally from those people. Pretty sure it was like a couple sororities and frats. Look it up. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdd8g1", "score_hidden": false, "stickied": false, "created": 1492456709.0, "created_utc": 1492427909.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5xds", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Official_Kanye_West", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "random sidenote but I had an idea for an app called \"MeetUp\" where you can find people near you who share your interests\n\nand then i found out that it already existed with that exact name lmao", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;random sidenote but I had an idea for an app called &amp;quot;MeetUp&amp;quot; where you can find people near you who share your interests&lt;/p&gt;\n\n&lt;p&gt;and then i found out that it already existed with that exact name lmao&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd5xds", "score_hidden": false, "stickied": false, "created": 1492435976.0, "created_utc": 1492407176.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdmivy", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ASDFzxcvTaken", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "While many apps and successful products seem to magically go viral, the fundamentals for marketing apply pretty consistently for all products.\n\nIt's often referred to as \"The four P's of marketing\"; Price, product, place, promotion and I always add a piece of Time. \n\nPrice is fairly obvious for most products, with free apps the price is essentially negative, as you are paying or giving something away of value to your target audience. \n\nProduct, it needs to be good and deliver on what it says. But not necessarily the best. \n\nPlace is about where it exists (online, in an app market, maybe next to similar apps or next to apps that attract your people) but also very critically Place is about physical boundaries of where you get the word out. \n\nPromotion is how you get the word out. This is often what generates the buzz, so this element is what gets the most attention, as it should, but it doesn't outshine the previous three P's.\n\nTime, it seems rather obvious but time is literally money. In order to augment all of the P's to work together and start a fire you have to be realistic about what it costs to reach the number of people to drive to a Tipping Point.\n\nOnce you have identified those parameters it's about reaching enough people frequently enough to get them engaged. Reach and Frequency of connections with your target audience during the time you have set are key and critical to lighting the fire.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While many apps and successful products seem to magically go viral, the fundamentals for marketing apply pretty consistently for all products.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s often referred to as &amp;quot;The four P&amp;#39;s of marketing&amp;quot;; Price, product, place, promotion and I always add a piece of Time. &lt;/p&gt;\n\n&lt;p&gt;Price is fairly obvious for most products, with free apps the price is essentially negative, as you are paying or giving something away of value to your target audience. &lt;/p&gt;\n\n&lt;p&gt;Product, it needs to be good and deliver on what it says. But not necessarily the best. &lt;/p&gt;\n\n&lt;p&gt;Place is about where it exists (online, in an app market, maybe next to similar apps or next to apps that attract your people) but also very critically Place is about physical boundaries of where you get the word out. &lt;/p&gt;\n\n&lt;p&gt;Promotion is how you get the word out. This is often what generates the buzz, so this element is what gets the most attention, as it should, but it doesn&amp;#39;t outshine the previous three P&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;Time, it seems rather obvious but time is literally money. In order to augment all of the P&amp;#39;s to work together and start a fire you have to be realistic about what it costs to reach the number of people to drive to a Tipping Point.&lt;/p&gt;\n\n&lt;p&gt;Once you have identified those parameters it&amp;#39;s about reaching enough people frequently enough to get them engaged. Reach and Frequency of connections with your target audience during the time you have set are key and critical to lighting the fire.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdmivy", "score_hidden": true, "stickied": false, "created": 1492471846.0, "created_utc": 1492443046.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgd95v8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "kristoffernolgren", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This is actually a specific occupation now a days, called growth hacker. Despite the name, https://growthhackers.com/ has a lot of interesting business cases of how different businesses did it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is actually a specific occupation now a days, called growth hacker. Despite the name, &lt;a href=\"https://growthhackers.com/\"&gt;https://growthhackers.com/&lt;/a&gt; has a lot of interesting business cases of how different businesses did it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd95v8", "score_hidden": false, "stickied": false, "created": 1492443463.0, "created_utc": 1492414663.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdgqvm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BaSkA_", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Lots of people who can't, are afraid or don't have enough free time to socialize IRL. Wait the word to spread, make sure your app doesn't suck and you're good to go.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lots of people who can&amp;#39;t, are afraid or don&amp;#39;t have enough free time to socialize IRL. Wait the word to spread, make sure your app doesn&amp;#39;t suck and you&amp;#39;re good to go.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdgqvm", "score_hidden": true, "stickied": false, "created": 1492463976.0, "created_utc": 1492435176.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdhvua", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sanshinron", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "All you guys are tip-toeing around the reality - they use bots, buy users are do all kinds of grey area stuff to get to the critical mass. Everyone does that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All you guys are tip-toeing around the reality - they use bots, buy users are do all kinds of grey area stuff to get to the critical mass. Everyone does that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdhvua", "score_hidden": true, "stickied": false, "created": 1492465770.0, "created_utc": 1492436970.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdk0s2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "comeonnow17", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Tinder went to colleges and sponsored parties at the college bar. Cover charge was free if you showed your phone had the app installed. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tinder went to colleges and sponsored parties at the college bar. Cover charge was free if you showed your phone had the app installed. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdk0s2", "score_hidden": true, "stickied": false, "created": 1492468763.0, "created_utc": 1492439963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5ydj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "zepp789", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Pretty sure I heard somewhere that Tinder started with a huge party. To get in, you had to download and use the app before you came (no pun intended)\n\nMost people left that party pretty happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty sure I heard somewhere that Tinder started with a huge party. To get in, you had to download and use the app before you came (no pun intended)&lt;/p&gt;\n\n&lt;p&gt;Most people left that party pretty happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd5ydj", "score_hidden": false, "stickied": false, "created": 1492436035.0, "created_utc": 1492407235.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdnnpa", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ScottyDetroit", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "This is a huge part of what killed Google+.  Google did a slower rollout of Google+ and throttled who was allowed to join.  When interest was highest for Google+ only a small group of people were allowed to join.  Those folks eventually got bored of talking to each other and didn't use Google+ as much.  When Google+ was finally opened up for anyone to join all the early adopters already left due to boredom.\n\nThe slow-rollout approach worked fine for Gmail, because you can still email people on other services.  Gmail for a long time was invitation-only, and getting invited was a very desirable thing.\n\nGoogle effectively killed any chance of success for Google+ by not releasing it for everyone at the same time.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a huge part of what killed Google+.  Google did a slower rollout of Google+ and throttled who was allowed to join.  When interest was highest for Google+ only a small group of people were allowed to join.  Those folks eventually got bored of talking to each other and didn&amp;#39;t use Google+ as much.  When Google+ was finally opened up for anyone to join all the early adopters already left due to boredom.&lt;/p&gt;\n\n&lt;p&gt;The slow-rollout approach worked fine for Gmail, because you can still email people on other services.  Gmail for a long time was invitation-only, and getting invited was a very desirable thing.&lt;/p&gt;\n\n&lt;p&gt;Google effectively killed any chance of success for Google+ by not releasing it for everyone at the same time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdnnpa", "score_hidden": true, "stickied": false, "created": 1492473154.0, "created_utc": 1492444354.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5pja", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "OmgFmlPeople", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Op read up on customer acquisition funnels and strategy.  Much of it is data mining your analytics, tweak it until you figure out where acquisition is less than the value of the customer and then start throwing money into that specific strategy.  Having a really good analytics team can help you bring customers into your platform for cheap.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Op read up on customer acquisition funnels and strategy.  Much of it is data mining your analytics, tweak it until you figure out where acquisition is less than the value of the customer and then start throwing money into that specific strategy.  Having a really good analytics team can help you bring customers into your platform for cheap.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd5pja", "score_hidden": false, "stickied": false, "created": 1492435531.0, "created_utc": 1492406731.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcrinw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcrinw", "score_hidden": false, "stickied": false, "created": 1492414690.0, "created_utc": 1492385890.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgden39", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Byternes", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Some of these apps also started as a different platform entirely. When Instagram first started it was promoted as an image filter app but you were forced to create an account to use their filters. It happened to have a feature that would let you post on Facebook and twitter at the same time in exchange for posting on their social network. So it kind of built up that way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some of these apps also started as a different platform entirely. When Instagram first started it was promoted as an image filter app but you were forced to create an account to use their filters. It happened to have a feature that would let you post on Facebook and twitter at the same time in exchange for posting on their social network. So it kind of built up that way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgden39", "score_hidden": false, "stickied": false, "created": 1492460074.0, "created_utc": 1492431274.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgd97o6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "everythingundersun", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I don't know about other apps but Tinder was a development from badoo. I used Badoo on the net in the past untill it became too spammy and bot-filled. the layout looked distinctively similiar. So I guess through sheer market testing. badoo had location based swiping. then tinder was developed from that. then they monotized swiping amount. Badoo worked for me to find an international gf. catch? she was only here for two years.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know about other apps but Tinder was a development from badoo. I used Badoo on the net in the past untill it became too spammy and bot-filled. the layout looked distinctively similiar. So I guess through sheer market testing. badoo had location based swiping. then tinder was developed from that. then they monotized swiping amount. Badoo worked for me to find an international gf. catch? she was only here for two years.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd97o6", "score_hidden": false, "stickied": false, "created": 1492443611.0, "created_utc": 1492414811.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdhysn", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "lazydingdong", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Paypal did this where they would pay you for getting other users on that service, I believe they started with $20. Later it would decrease to $10 and so on. And when they didn't give out money for new users they already had an insane amount of users and they grew from there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Paypal did this where they would pay you for getting other users on that service, I believe they started with $20. Later it would decrease to $10 and so on. And when they didn&amp;#39;t give out money for new users they already had an insane amount of users and they grew from there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdhysn", "score_hidden": true, "stickied": false, "created": 1492465898.0, "created_utc": 1492437098.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdc48z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RelativelyCool", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "I was at Roskilde festival last year and people were handing out these vouchers for a group meetup app for when you needed someone to party with. So I assume they try to find a place where there are a lot of people within the targeted audience", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was at Roskilde festival last year and people were handing out these vouchers for a group meetup app for when you needed someone to party with. So I assume they try to find a place where there are a lot of people within the targeted audience&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdc48z", "score_hidden": false, "stickied": false, "created": 1492453362.0, "created_utc": 1492424562.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdi46r", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lochtide7", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "All word of mouth through friends, family and facebook at the start. Friend just started an Uber like app in my smallish city that didn't have Uber. He had 1500 sign ups in 24 hours through facebook alone. From there it spreads", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All word of mouth through friends, family and facebook at the start. Friend just started an Uber like app in my smallish city that didn&amp;#39;t have Uber. He had 1500 sign ups in 24 hours through facebook alone. From there it spreads&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdi46r", "score_hidden": true, "stickied": false, "created": 1492466121.0, "created_utc": 1492437321.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdktta", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "qoloku", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "A lot of smaller applications create referral programs rewarding people for bringing more users to the application by providing custom referral links and a discount for those promoting the app. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of smaller applications create referral programs rewarding people for bringing more users to the application by providing custom referral links and a discount for those promoting the app. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdktta", "score_hidden": true, "stickied": false, "created": 1492469795.0, "created_utc": 1492440995.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgdbkq5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Knukun", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Odd that nobody mentioned user acquisition.\n\nYes, sometimes you can pay to bring in user in your application. Mostly games do this, but it's possible for other applications as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Odd that nobody mentioned user acquisition.&lt;/p&gt;\n\n&lt;p&gt;Yes, sometimes you can pay to bring in user in your application. Mostly games do this, but it&amp;#39;s possible for other applications as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdbkq5", "score_hidden": false, "stickied": false, "created": 1492451568.0, "created_utc": 1492422768.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": "", "user_reports": [], "id": "dgddunx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EliteSno", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "So, what do applications that rely upon the network effect to provide a benefit and value to their user?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, what do applications that rely upon the network effect to provide a benefit and value to their user?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgddunx", "score_hidden": false, "stickied": false, "created": 1492458269.0, "created_utc": 1492429469.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgdbgfk", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgdbgfk", "score_hidden": false, "stickied": false, "created": 1492451159.0, "created_utc": 1492422359.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd9vja", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Moutons4ever", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Fake users, at least partly I think. Wasn't there some scandal with several of these platforms that are designed to make it easier to fuck around ?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fake users, at least partly I think. Wasn&amp;#39;t there some scandal with several of these platforms that are designed to make it easier to fuck around ?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd9vja", "score_hidden": false, "stickied": false, "created": 1492445696.0, "created_utc": 1492416896.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd5vy2", "gilded": 0, "archived": false, "score": -6, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "[deleted]", "edited": 1492412299.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd5vy2", "score_hidden": false, "stickied": false, "created": 1492435892.0, "created_utc": 1492407092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgcyewg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 1, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgcyewg", "score_hidden": false, "stickied": false, "created": 1492423946.0, "created_utc": 1492395146.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd4b23", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 1, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd4b23", "score_hidden": false, "stickied": false, "created": 1492432819.0, "created_utc": 1492404019.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2sokd", "removal_reason": null, "link_id": "t3_65rjxg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "more"}], "after": null, "before": null}}, "user_reports": [], "id": "dgd71sr", "gilded": 0, "archived": false, "score": -18, "report_reasons": null, "author": "Might-be-a-Trowaway", "parent_id": "t3_65rjxg", "subreddit_name_prefixed": "r/explainlikeimfive", "controversiality": 0, "body": "Well, you make something​ that people like or need.  Then they use that service.  \nFor some I reason I currently find myself dwelling on the recent study that estimated the average IQ of an American at 98.  Hmmm....\n\n\n*Awwwww.  The truth can be painful, you sobbing vaginas.", "edited": 1492417177.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, you make something​ that people like or need.  Then they use that service.&lt;br/&gt;\nFor some I reason I currently find myself dwelling on the recent study that estimated the average IQ of an American at 98.  Hmmm....&lt;/p&gt;\n\n&lt;p&gt;*Awwwww.  The truth can be painful, you sobbing vaginas.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "explainlikeimfive", "name": "t1_dgd71sr", "score_hidden": false, "stickied": false, "created": 1492438360.0, "created_utc": 1492409560.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -18}}], "after": null, "before": null}}]