[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My girlfriend and I have been dating about two years and haven&amp;#39;t had any major problems. Our relationship is really good/solid.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;ve never met her family. I didn&amp;#39;t mind before but now it&amp;#39;s causing problems. She&amp;#39;s graduating and being admitted to the bar as a lawyer, but she&amp;#39;s told me I&amp;#39;m not invited to either event as her parents will be there.&lt;/p&gt;\n\n&lt;p&gt;My girlfriend lives with her parents. She&amp;#39;s not close with her father but does have a good relationship with her mother. She doesn&amp;#39;t have any siblings. All her extended family live overseas.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile I am very close with my family. I currently live at home, as do my adult siblings. We regularly have proper sit down family dinners, we still travel together, etc. It&amp;#39;s all very stereotypical nuclear family stuff. I also have extended family who I see often and who live locally.&lt;/p&gt;\n\n&lt;p&gt;My girlfriend has met all these people. She stays over my house almost every weekend. She comes to Christmas, Easter, etc. She&amp;#39;s met all of my friends, and often comes along when I hang out with them.&lt;/p&gt;\n\n&lt;p&gt;Her mum knows I exist but hasn&amp;#39;t met me. Her dad thinks she&amp;#39;s going to a female friend&amp;#39;s house every weekend and doesn&amp;#39;t know she has a boyfriend. I&amp;#39;ve met a few of her friends but many of them are overseas in her home country.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m really upset about her not wanting me at her graduation or bar admission. I&amp;#39;m graduating around the same time and she&amp;#39;s going to be attending my ceremony with my parents. Part of the joy of a serious relationship for me is celebrating your successes together as much as you share all the difficult stuff.&lt;/p&gt;\n\n&lt;p&gt;We argued about it for a few days but I don&amp;#39;t wanna go if she doesn&amp;#39;t want me to be there. I don&amp;#39;t want her to begrudgingly let me hide somewhere in the crowd and pretend she doesn&amp;#39;t know me. It would be ridiculous and humiliating. We&amp;#39;ve talked before about her introducing me to her parents but she&amp;#39;s continuously put it off or just vaguely said she&amp;#39;ll do it eventually.&lt;/p&gt;\n\n&lt;p&gt;I want to be there for the big things in my girlfriend&amp;#39;s life. She has a complicated relationship with her parents but our relationship isn&amp;#39;t super young any more and I think when it starts causing situations like this it&amp;#39;s gotten really weird. Am I being unreasonable? I don&amp;#39;t know what to do.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt;: My girlfriend won&amp;#39;t introduce me to her family and won&amp;#39;t let me attend big events in her life. In contrast she has met my family and is included in everything.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My girlfriend and I have been dating about two years and haven't had any major problems. Our relationship is really good/solid.\n\nBut I've never met her family. I didn't mind before but now it's causing problems. She's graduating and being admitted to the bar as a lawyer, but she's told me I'm not invited to either event as her parents will be there.\n\nMy girlfriend lives with her parents. She's not close with her father but does have a good relationship with her mother. She doesn't have any siblings. All her extended family live overseas.\n\nMeanwhile I am very close with my family. I currently live at home, as do my adult siblings. We regularly have proper sit down family dinners, we still travel together, etc. It's all very stereotypical nuclear family stuff. I also have extended family who I see often and who live locally.\n\nMy girlfriend has met all these people. She stays over my house almost every weekend. She comes to Christmas, Easter, etc. She's met all of my friends, and often comes along when I hang out with them.\n\nHer mum knows I exist but hasn't met me. Her dad thinks she's going to a female friend's house every weekend and doesn't know she has a boyfriend. I've met a few of her friends but many of them are overseas in her home country.\n\nI'm really upset about her not wanting me at her graduation or bar admission. I'm graduating around the same time and she's going to be attending my ceremony with my parents. Part of the joy of a serious relationship for me is celebrating your successes together as much as you share all the difficult stuff.\n\nWe argued about it for a few days but I don't wanna go if she doesn't want me to be there. I don't want her to begrudgingly let me hide somewhere in the crowd and pretend she doesn't know me. It would be ridiculous and humiliating. We've talked before about her introducing me to her parents but she's continuously put it off or just vaguely said she'll do it eventually.\n\nI want to be there for the big things in my girlfriend's life. She has a complicated relationship with her parents but our relationship isn't super young any more and I think when it starts causing situations like this it's gotten really weird. Am I being unreasonable? I don't know what to do.\n\n**TL;DR**: My girlfriend won't introduce me to her family and won't let me attend big events in her life. In contrast she has met my family and is included in everything.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Dating", "id": "64o5m0", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 311, "report_reasons": null, "author": "throwaway1238971", "saved": false, "mod_reports": [], "name": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-yw dating", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/64o5m0/my_26m_girlfriend_25f_of_2_years_hasnt_introduced/", "num_reports": null, "locked": false, "stickied": false, "created": 1491906463.0, "url": "https://www.reddit.com/r/relationships/comments/64o5m0/my_26m_girlfriend_25f_of_2_years_hasnt_introduced/", "author_flair_text": null, "quarantine": false, "title": "My (26M) girlfriend (25F) of 2 years hasn't introduced me to her family and doesn't want me to attend big events in her life", "created_utc": 1491877663.0, "distinguished": null, "media": null, "upvote_ratio": 0.94, "num_comments": 103, "visited": false, "subreddit_type": "public", "ups": 311}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3u6k4", "gilded": 0, "archived": false, "score": 200, "report_reasons": null, "author": "Dridier_Dogba", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think this is the best answer here. My initial thought was she is not hiding OP, she's hiding her parents. She wouldn't be going to Easter and Christmas dinners if she wasn't serious about the relationship. She may be insecure and not want to make things awkward by introducing him to a potentially dysfunctional family. \n\nThat being said, some clarity would be appreciated and required fairly soon because if they plan on getting married then it has to happen sooner or later. She can try to stall a little longer but it won't last forever. \n\nI don't think it's worth throwing the relationship away though, I think there's quite a bit of digging to be done first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is the best answer here. My initial thought was she is not hiding OP, she&amp;#39;s hiding her parents. She wouldn&amp;#39;t be going to Easter and Christmas dinners if she wasn&amp;#39;t serious about the relationship. She may be insecure and not want to make things awkward by introducing him to a potentially dysfunctional family. &lt;/p&gt;\n\n&lt;p&gt;That being said, some clarity would be appreciated and required fairly soon because if they plan on getting married then it has to happen sooner or later. She can try to stall a little longer but it won&amp;#39;t last forever. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think it&amp;#39;s worth throwing the relationship away though, I think there&amp;#39;s quite a bit of digging to be done first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3u6k4", "score_hidden": false, "stickied": false, "created": 1491912714.0, "created_utc": 1491883914.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 200}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4aa0o", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "sweetterry", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Could be her dad is bankrolling her education and she's waiting to graduate before she cuts him off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could be her dad is bankrolling her education and she&amp;#39;s waiting to graduate before she cuts him off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4aa0o", "score_hidden": false, "stickied": false, "created": 1491947975.0, "created_utc": 1491919175.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3x1ex", "gilded": 0, "archived": false, "score": 66, "report_reasons": null, "author": "snug_dealer", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Was hoping to see this. For many reasons, I'm planning on cutting off contact with my family when I can. So it isn't necessary for my boyfriend to get a relationship with them since they'll be out of our lives soon enough. The thing is, though, my boyfriend knows and agrees with why we won't be seeing them. But after two years, if it is like with my case, I believe you are owed an explanation. Some things can be hard to talk about, especially family. This might be her way of trying to keep you safe from them, but you need to know if that is truly the case.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was hoping to see this. For many reasons, I&amp;#39;m planning on cutting off contact with my family when I can. So it isn&amp;#39;t necessary for my boyfriend to get a relationship with them since they&amp;#39;ll be out of our lives soon enough. The thing is, though, my boyfriend knows and agrees with why we won&amp;#39;t be seeing them. But after two years, if it is like with my case, I believe you are owed an explanation. Some things can be hard to talk about, especially family. This might be her way of trying to keep you safe from them, but you need to know if that is truly the case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3x1ex", "score_hidden": false, "stickied": false, "created": 1491917828.0, "created_utc": 1491889028.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 66}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3y4gt", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "qtpiezgurl", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So much this. Reading this post reminded me of well, me. I'm the gf in this situation and I never introduce anybody to my family. They're an overbearing wreck and if I'm honest, I would likely not date a guy who had a family like mine because it'd be too much to handle unless he had proper boundaries in place. Honestly, this sounds like your gf drawing boundaries for her family who might not understand them otherwise.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So much this. Reading this post reminded me of well, me. I&amp;#39;m the gf in this situation and I never introduce anybody to my family. They&amp;#39;re an overbearing wreck and if I&amp;#39;m honest, I would likely not date a guy who had a family like mine because it&amp;#39;d be too much to handle unless he had proper boundaries in place. Honestly, this sounds like your gf drawing boundaries for her family who might not understand them otherwise.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3y4gt", "score_hidden": false, "stickied": false, "created": 1491920213.0, "created_utc": 1491891413.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3yvay", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "DolfinRapeSurvivor", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree that this is the best answer. Reason: I am in your girlfriend's position. My parents and I have a VERY complicated relationship.\n\nMy girlfriend of the last 2.5 years is the most amazing person in my world and my soon to be wife. She have never met my parents and I doubt they know she exists. She knows the extend of our relationship and respects it 100%. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that this is the best answer. Reason: I am in your girlfriend&amp;#39;s position. My parents and I have a VERY complicated relationship.&lt;/p&gt;\n\n&lt;p&gt;My girlfriend of the last 2.5 years is the most amazing person in my world and my soon to be wife. She have never met my parents and I doubt they know she exists. She knows the extend of our relationship and respects it 100%. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3yvay", "score_hidden": false, "stickied": false, "created": 1491922023.0, "created_utc": 1491893223.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4kp4d", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "GirlWhoPoops", "parent_id": "t1_dg4g5tk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm not interested in a bunch of hateful messages either, but it's not uncommon.  When I was 22-25, I worked somewhere with many people from a particular culture that did the same thing.  Would date local girls for a couple of years before marrying a girl their parents had selected, a girl from their culture.  These guys also did not bother introducing the temporary girlfriends to their family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not interested in a bunch of hateful messages either, but it&amp;#39;s not uncommon.  When I was 22-25, I worked somewhere with many people from a particular culture that did the same thing.  Would date local girls for a couple of years before marrying a girl their parents had selected, a girl from their culture.  These guys also did not bother introducing the temporary girlfriends to their family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4kp4d", "score_hidden": false, "stickied": false, "created": 1491959775.0, "created_utc": 1491930975.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg5f1q3", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "my_open_stomach", "parent_id": "t1_dg4g5tk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Exactly. This is unfortunately my read on the situation as well. I say this coming from an Indian background, as the US-born child of Indian immigrant parents. Indian culture has similar expectations. You may be able to date around when younger but ultimately you must marry within the race. (It's actually very racist.) My parents were never that strict, they're more open, and I rejected most of their culture anyway- but if OP's GF has not done similarly, and/or her parents are not open (doesn't sound like they are), this is my prognosis for their relationship as well, sadly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. This is unfortunately my read on the situation as well. I say this coming from an Indian background, as the US-born child of Indian immigrant parents. Indian culture has similar expectations. You may be able to date around when younger but ultimately you must marry within the race. (It&amp;#39;s actually very racist.) My parents were never that strict, they&amp;#39;re more open, and I rejected most of their culture anyway- but if OP&amp;#39;s GF has not done similarly, and/or her parents are not open (doesn&amp;#39;t sound like they are), this is my prognosis for their relationship as well, sadly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5f1q3", "score_hidden": false, "stickied": false, "created": 1491997045.0, "created_utc": 1491968245.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dgamzae", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Chxrliefxckingshxxn", "parent_id": "t1_dg4g5tk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree with this 100%. In fact my best friend is in this exact situation. She's been with an Asian for five years. Hasn't met any of his family apart from one sister who was only trying to be pally with her to stop my best friend from seeing her brother. \nMy family (also being Asian muslims, but not as traditional) know his family and know that soon enough he'll be married off. My best friend does not believe this, Or understand it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with this 100%. In fact my best friend is in this exact situation. She&amp;#39;s been with an Asian for five years. Hasn&amp;#39;t met any of his family apart from one sister who was only trying to be pally with her to stop my best friend from seeing her brother. \nMy family (also being Asian muslims, but not as traditional) know his family and know that soon enough he&amp;#39;ll be married off. My best friend does not believe this, Or understand it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgamzae", "score_hidden": false, "stickied": false, "created": 1492291557.0, "created_utc": 1492262757.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4g5tk", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "YungPootieTang", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "EDIT: Before I get another nasty PM, I am simply pointing out that this exact scenario plays out all the time with \"traditional\" Eastern Asian families. People have dated for years and years, only to find out that their partner was never planning on marrying them.... that their family dictates they marry within their race. I'm not saying this is **surely** what the situation is, but when that *is* the situation, it literally plays out exactly like this. The significant never meets the family, never gets a great reason why, never gets to go to \"milestone\" events in their partner's life.\n\n\n&gt; It might be more complicated than you think. Honestly, she might be trying to protect you or protect your relationship if she thinks her wreck of a family will scare you off. \n\nHe commented in a post below that she's Korean.... this is probably like most cases when this happens.... the Korean/Asian partner really likes or even loves the person they're with, but there's an expiration date on the relationship. Eventually she'll marry Korean.", "edited": 1491926463.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;EDIT: Before I get another nasty PM, I am simply pointing out that this exact scenario plays out all the time with &amp;quot;traditional&amp;quot; Eastern Asian families. People have dated for years and years, only to find out that their partner was never planning on marrying them.... that their family dictates they marry within their race. I&amp;#39;m not saying this is &lt;strong&gt;surely&lt;/strong&gt; what the situation is, but when that &lt;em&gt;is&lt;/em&gt; the situation, it literally plays out exactly like this. The significant never meets the family, never gets a great reason why, never gets to go to &amp;quot;milestone&amp;quot; events in their partner&amp;#39;s life.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It might be more complicated than you think. Honestly, she might be trying to protect you or protect your relationship if she thinks her wreck of a family will scare you off. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He commented in a post below that she&amp;#39;s Korean.... this is probably like most cases when this happens.... the Korean/Asian partner really likes or even loves the person they&amp;#39;re with, but there&amp;#39;s an expiration date on the relationship. Eventually she&amp;#39;ll marry Korean.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4g5tk", "score_hidden": false, "stickied": false, "created": 1491954816.0, "created_utc": 1491926016.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 47}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4wxth", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "bexyrex", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This so much. I hid my SO of two years from my family because my family is a dysfunctional mess with a history of abuse.\n\nThey only just found out about him January after my tuition was paid off and I had saved enough money to feed myself in case my mom cut me off and when I was 700mi away where she couldnt assault me.\n\nNow her situation may not be that bad as mine was but her instinct to hide everything is just the same. I don't know if she's in therapy About whatever is going on with her family but she really needs to be if she's gonna save her relationship. I am lucky that I WAS already in therapy and my SO understood my family background. But she's seriously omitting something from him and it's not healthy for a partnership at all. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This so much. I hid my SO of two years from my family because my family is a dysfunctional mess with a history of abuse.&lt;/p&gt;\n\n&lt;p&gt;They only just found out about him January after my tuition was paid off and I had saved enough money to feed myself in case my mom cut me off and when I was 700mi away where she couldnt assault me.&lt;/p&gt;\n\n&lt;p&gt;Now her situation may not be that bad as mine was but her instinct to hide everything is just the same. I don&amp;#39;t know if she&amp;#39;s in therapy About whatever is going on with her family but she really needs to be if she&amp;#39;s gonna save her relationship. I am lucky that I WAS already in therapy and my SO understood my family background. But she&amp;#39;s seriously omitting something from him and it&amp;#39;s not healthy for a partnership at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4wxth", "score_hidden": false, "stickied": false, "created": 1491973155.0, "created_utc": 1491944355.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4erde", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "freudinthehizouse", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree with this. My family dynamic is really fucked up and although I know it's not a good thing, last boyfriend (1 year) never met them. It had nothing to do with him. I would have loved to introduce him to my family if only they weren't so insane and fucked up.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with this. My family dynamic is really fucked up and although I know it&amp;#39;s not a good thing, last boyfriend (1 year) never met them. It had nothing to do with him. I would have loved to introduce him to my family if only they weren&amp;#39;t so insane and fucked up.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4erde", "score_hidden": false, "stickied": false, "created": 1491953260.0, "created_utc": 1491924460.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg5i87l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ChaoticSquirrel", "parent_id": "t1_dg3sb69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yep. I moved 2000 miles away from my parents for school and do not introduce them to many people when they visit. \n\nMy mother likes to say very mean-spirited things about me disguised as \"jokes\" when I introduce her to friends/SOs. There's a whole lot fucked up about our relationship. My parents take almost zero interest in my day-to-day life beyond checking my bank accounts and my grades, despite me desperately wanting them to. There was some mild verbal abuse and a lot of overly-controlling behavior going on when I was a teenager that I'm still not completely over, so being around them sets me on edge. \n\nI don't like bringing that into the life I'm still trying to build out here. I don't want my friends seeing me so on edge. I don't want my mother to take jabs at me in front of my friends. I also don't like how much they judge everyone and everything, and I don't want my friends associating that type of behavior. So I definitely understand where OP's GF is coming from if her relationship with them is anything like mine. But she should also explain that to OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep. I moved 2000 miles away from my parents for school and do not introduce them to many people when they visit. &lt;/p&gt;\n\n&lt;p&gt;My mother likes to say very mean-spirited things about me disguised as &amp;quot;jokes&amp;quot; when I introduce her to friends/SOs. There&amp;#39;s a whole lot fucked up about our relationship. My parents take almost zero interest in my day-to-day life beyond checking my bank accounts and my grades, despite me desperately wanting them to. There was some mild verbal abuse and a lot of overly-controlling behavior going on when I was a teenager that I&amp;#39;m still not completely over, so being around them sets me on edge. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t like bringing that into the life I&amp;#39;m still trying to build out here. I don&amp;#39;t want my friends seeing me so on edge. I don&amp;#39;t want my mother to take jabs at me in front of my friends. I also don&amp;#39;t like how much they judge everyone and everything, and I don&amp;#39;t want my friends associating that type of behavior. So I definitely understand where OP&amp;#39;s GF is coming from if her relationship with them is anything like mine. But she should also explain that to OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5i87l", "score_hidden": false, "stickied": false, "created": 1492002545.0, "created_utc": 1491973745.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3sb69", "gilded": 0, "archived": false, "score": 618, "report_reasons": null, "author": "yifrancisren", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; She has a complicated relationship with her parents\n\nIt might be more complicated than you think. Honestly, she might be trying to protect you or protect your relationship if she thinks her wreck of a family will scare you off. Especially if you have a picture-perfect nuclear family. This is misguided of her, but not horrific betrayal. Maybe try to get a bigger, better picture of her family and their dynamic while maintaining that you are accepting, but if you sense that she's unwilling to be open about things, you might need couple's therapy and/or to re-evaluate the relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She has a complicated relationship with her parents&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It might be more complicated than you think. Honestly, she might be trying to protect you or protect your relationship if she thinks her wreck of a family will scare you off. Especially if you have a picture-perfect nuclear family. This is misguided of her, but not horrific betrayal. Maybe try to get a bigger, better picture of her family and their dynamic while maintaining that you are accepting, but if you sense that she&amp;#39;s unwilling to be open about things, you might need couple&amp;#39;s therapy and/or to re-evaluate the relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3sb69", "score_hidden": false, "stickied": false, "created": 1491909882.0, "created_utc": 1491881082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 618}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3xxch", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "sweetcheeks920", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is definitly a cultural issue, her dad is probably strict. I had the same relationship with my parents (mom knew I had a bf but she never met him, dad didn't even know I was dating) until I met my current bf who I know I was serious about. Even then I still don't bring him around much, It's just really awkward after a lifetime of being told that boys are bad and will distract you from school and a career", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is definitly a cultural issue, her dad is probably strict. I had the same relationship with my parents (mom knew I had a bf but she never met him, dad didn&amp;#39;t even know I was dating) until I met my current bf who I know I was serious about. Even then I still don&amp;#39;t bring him around much, It&amp;#39;s just really awkward after a lifetime of being told that boys are bad and will distract you from school and a career&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3xxch", "score_hidden": false, "stickied": false, "created": 1491919763.0, "created_utc": 1491890963.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4tbzs", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "hieiazndood", "parent_id": "t1_dg4ocne", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Eastern Asian American here. Above comment is right in that most of the time when the SO meets the parents, it does signal the big \"marriage\" alert. When the parents meet each other for the first time, that's when it is super serious wedding planning time as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eastern Asian American here. Above comment is right in that most of the time when the SO meets the parents, it does signal the big &amp;quot;marriage&amp;quot; alert. When the parents meet each other for the first time, that&amp;#39;s when it is super serious wedding planning time as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4tbzs", "score_hidden": false, "stickied": false, "created": 1491969121.0, "created_utc": 1491940321.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ocne", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Pinsalinj", "parent_id": "t1_dg4mlpt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks then. I've been wondering about it for months, it's funny to have a potential answer completely at random on Reddit :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks then. I&amp;#39;ve been wondering about it for months, it&amp;#39;s funny to have a potential answer completely at random on Reddit :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ocne", "score_hidden": false, "stickied": false, "created": 1491963784.0, "created_utc": 1491934984.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg5f53j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "my_open_stomach", "parent_id": "t1_dg4mlpt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "US-born child of Indian parents here- and I totally agree, even with my relatively lax/open and not-very-strict parents.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;US-born child of Indian parents here- and I totally agree, even with my relatively lax/open and not-very-strict parents.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5f53j", "score_hidden": false, "stickied": false, "created": 1491997190.0, "created_utc": 1491968390.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mlpt", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "bluerandome", "parent_id": "t1_dg4l4c1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I can't generalise about all asians obviously, but I'm Indian and even if my parents knew I was seriously dating someone, introducing him would be equivalent of saying we're getting married soon. Like not just serious enough to marry but actually set a date.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t generalise about all asians obviously, but I&amp;#39;m Indian and even if my parents knew I was seriously dating someone, introducing him would be equivalent of saying we&amp;#39;re getting married soon. Like not just serious enough to marry but actually set a date.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4mlpt", "score_hidden": false, "stickied": false, "created": 1491961851.0, "created_utc": 1491933051.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4vuw8", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rcl2", "parent_id": "t1_dg4l4c1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Three years seems long, but from my experience you meet the parents when the relationship is leading to marriage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Three years seems long, but from my experience you meet the parents when the relationship is leading to marriage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4vuw8", "score_hidden": false, "stickied": false, "created": 1491971933.0, "created_utc": 1491943133.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg5fbfk", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "my_open_stomach", "parent_id": "t1_dg4t735", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah it's totally racist. There's a tendency among some people (not here, not you, just a general statement) to overlook racism when it comes from someone who is a racial minority. Well, Indian parents may be racial minorities but they *can* sometimes also be very racist against anyone who is not Indian. (Signed, US-born child of Indian immigrant parents)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah it&amp;#39;s totally racist. There&amp;#39;s a tendency among some people (not here, not you, just a general statement) to overlook racism when it comes from someone who is a racial minority. Well, Indian parents may be racial minorities but they &lt;em&gt;can&lt;/em&gt; sometimes also be very racist against anyone who is not Indian. (Signed, US-born child of Indian immigrant parents)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5fbfk", "score_hidden": false, "stickied": false, "created": 1491997466.0, "created_utc": 1491968666.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4ul55", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pinsalinj", "parent_id": "t1_dg4t735", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That's what I'm afraid of :/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I&amp;#39;m afraid of :/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ul55", "score_hidden": false, "stickied": false, "created": 1491970507.0, "created_utc": 1491941707.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4t735", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "YouKnowMeYeah", "parent_id": "t1_dg4l4c1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's not normal for Asian girl to be dating anyone without her parents knowing him or about him. I mean that's the norm in countries like India, China, etc. Obviously there's exception. So when an Asian person doesn't introduce their non-Asian partner to his/her family, it can most certainly mean one thing.... the Asian parent don't approve of their daughter/son dating/marrying non-Asians. Same as it is with white parents throwing a hissyfit when their sweet little girl dates a black dude or one of them Mooozlim or whatever. It's not malicious racism. But it's still racism/tribalism. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not normal for Asian girl to be dating anyone without her parents knowing him or about him. I mean that&amp;#39;s the norm in countries like India, China, etc. Obviously there&amp;#39;s exception. So when an Asian person doesn&amp;#39;t introduce their non-Asian partner to his/her family, it can most certainly mean one thing.... the Asian parent don&amp;#39;t approve of their daughter/son dating/marrying non-Asians. Same as it is with white parents throwing a hissyfit when their sweet little girl dates a black dude or one of them Mooozlim or whatever. It&amp;#39;s not malicious racism. But it&amp;#39;s still racism/tribalism. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4t735", "score_hidden": false, "stickied": false, "created": 1491968971.0, "created_utc": 1491940171.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4l4c1", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Pinsalinj", "parent_id": "t1_dg3zs91", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My brother has a chinese girlfriend, he actually went to China so he could be with her, and he has still not met her parents after three years. Apparently they know about him, though. Is it normal for Asian people to take so much time before introducing their SOs to their parents?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My brother has a chinese girlfriend, he actually went to China so he could be with her, and he has still not met her parents after three years. Apparently they know about him, though. Is it normal for Asian people to take so much time before introducing their SOs to their parents?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4l4c1", "score_hidden": false, "stickied": false, "created": 1491960239.0, "created_utc": 1491931439.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3zs91", "gilded": 0, "archived": false, "score": 84, "report_reasons": null, "author": "bluerandome", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's asian isn't she? If she is, ask her if the timeline of meeting her parents is after you agree to get engaged", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s asian isn&amp;#39;t she? If she is, ask her if the timeline of meeting her parents is after you agree to get engaged&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3zs91", "score_hidden": false, "stickied": false, "created": 1491924440.0, "created_utc": 1491895640.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 84}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg44rxa", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "MDKrouzer", "parent_id": "t1_dg3z1gp", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I had a Sri Lankan friend who had the same approach for her boyfriend who she eventually married. She didn't introduce him to her parents until they got engaged.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a Sri Lankan friend who had the same approach for her boyfriend who she eventually married. She didn&amp;#39;t introduce him to her parents until they got engaged.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg44rxa", "score_hidden": false, "stickied": false, "created": 1491938949.0, "created_utc": 1491910149.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3z1gp", "gilded": 0, "archived": false, "score": 86, "report_reasons": null, "author": "xPawreen", "parent_id": "t1_dg3t5cf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My parents are Chinese but not the most traditional type (and not religious at all), but they do still have a few old fashioned values that they hang on to. They did not want to meet my sister's husband until they were engaged, and have no desire to meet my boyfriend of 3.5 years until we're engaged as well. Maybe this is the case with your girlfriend too. \n\nEdit: the sub AsianParentStories might be able to give you some perspective and insight on this cultural issue (but obviously talk to your girlfriend first to find out the real reason why!)", "edited": 1491893999.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My parents are Chinese but not the most traditional type (and not religious at all), but they do still have a few old fashioned values that they hang on to. They did not want to meet my sister&amp;#39;s husband until they were engaged, and have no desire to meet my boyfriend of 3.5 years until we&amp;#39;re engaged as well. Maybe this is the case with your girlfriend too. &lt;/p&gt;\n\n&lt;p&gt;Edit: the sub AsianParentStories might be able to give you some perspective and insight on this cultural issue (but obviously talk to your girlfriend first to find out the real reason why!)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3z1gp", "score_hidden": false, "stickied": false, "created": 1491922454.0, "created_utc": 1491893654.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 86}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3y7cw", "gilded": 0, "archived": false, "score": 66, "report_reasons": null, "author": "qtpiezgurl", "parent_id": "t1_dg3t5cf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your post up there screamed \"Asian gf\" to me that I'm kind of relieved to see this confirmed here. What you're describing with your gf reminds me of me and if it's anything like my case, it's more about hiding the parents than it is about hiding the bf. This might not necessarily make you feel better but the reading between the lines makes me think there might be a fair amount of dysfunction in her family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your post up there screamed &amp;quot;Asian gf&amp;quot; to me that I&amp;#39;m kind of relieved to see this confirmed here. What you&amp;#39;re describing with your gf reminds me of me and if it&amp;#39;s anything like my case, it&amp;#39;s more about hiding the parents than it is about hiding the bf. This might not necessarily make you feel better but the reading between the lines makes me think there might be a fair amount of dysfunction in her family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3y7cw", "score_hidden": false, "stickied": false, "created": 1491920397.0, "created_utc": 1491891597.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 66}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg48xza", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "castille360", "parent_id": "t1_dg3tvmp", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The posts where someone mentions a foreign culture but doesn't identify it drive me crazy. When it comes to family, social rules and expectations - culture of origin matters. A lot.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The posts where someone mentions a foreign culture but doesn&amp;#39;t identify it drive me crazy. When it comes to family, social rules and expectations - culture of origin matters. A lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48xza", "score_hidden": false, "stickied": false, "created": 1491946200.0, "created_utc": 1491917400.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4yt45", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "nopromisingoldman", "parent_id": "t1_dg4j3oy", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm full Indian with a black partner and I know exactly the face being referenced here", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m full Indian with a black partner and I know exactly the face being referenced here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4yt45", "score_hidden": false, "stickied": false, "created": 1491975390.0, "created_utc": 1491946590.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg5fq0a", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "my_open_stomach", "parent_id": "t1_dg4j3oy", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; there was a face made when I told him he was black\n\nLol, US-born child of Indian parents (both in my case) here and I can see this face so vividly haha.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;there was a face made when I told him he was black&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Lol, US-born child of Indian parents (both in my case) here and I can see this face so vividly haha.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5fq0a", "score_hidden": false, "stickied": false, "created": 1491998113.0, "created_utc": 1491969313.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4j3oy", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "akunomegami", "parent_id": "t1_dg3v2l0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Coming from a mixed race family I can tell you those kinds of traditions stick hard. My mother is white and my dad is Indian, I was raised in the US. My dad proposed several times the notion of finding me a husband in India. (Yes, sometimes he was joking, but it was far too often to be just a joke.)\n\n He hasn't met my current SO yet, but there was a face made when I told him he was black. In my dad's mind he thinks I should find an Indian husband, despite not being in that culture at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Coming from a mixed race family I can tell you those kinds of traditions stick hard. My mother is white and my dad is Indian, I was raised in the US. My dad proposed several times the notion of finding me a husband in India. (Yes, sometimes he was joking, but it was far too often to be just a joke.)&lt;/p&gt;\n\n&lt;p&gt;He hasn&amp;#39;t met my current SO yet, but there was a face made when I told him he was black. In my dad&amp;#39;s mind he thinks I should find an Indian husband, despite not being in that culture at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4j3oy", "score_hidden": false, "stickied": false, "created": 1491958037.0, "created_utc": 1491929237.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3vel8", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "yifrancisren", "parent_id": "t1_dg3v2l0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sorry if I was too harsh - it's just all-too-common that the white half of a relationship in a white-dominated country fails to see the non-white side of things. Even very well-integrated people will still carry a cultural baggage.\n\nNote that white could be replaced with any race/culture except not usually on reddit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if I was too harsh - it&amp;#39;s just all-too-common that the white half of a relationship in a white-dominated country fails to see the non-white side of things. Even very well-integrated people will still carry a cultural baggage.&lt;/p&gt;\n\n&lt;p&gt;Note that white could be replaced with any race/culture except not usually on reddit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3vel8", "score_hidden": false, "stickied": false, "created": 1491914749.0, "created_utc": 1491885949.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 56}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4re8y", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "harkandhush", "parent_id": "t1_dg3v2l0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Another factor that might be at play: her mother knows about you, but her father thinks that she's at a friend's house every weekend?  She doesn't want her dad to know that she's having sex.  Her mother seems to be in on not telling the father, which means either the mother told her not to tell the father or is in support of the idea of not telling him.  \n\nIs he paying for her schooling?  Helping her get set up financially after school?  It's possible that she's afraid he'll cut her off if he finds out that she's been having weekends away with a man all this time.  Things may get easier once she's set up with a job and able to support herself and separate her life from theirs.  It might be a good idea to talk with her about where you both see the relationship going and what her plans are for herself after graduation.  Is she moving out once she finds a job?  Is she looking for work only locally?  What are your plans?  Are you going to live together after you both graduate?  After two years, those are pretty reasonable conversations to have if you're not already having them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another factor that might be at play: her mother knows about you, but her father thinks that she&amp;#39;s at a friend&amp;#39;s house every weekend?  She doesn&amp;#39;t want her dad to know that she&amp;#39;s having sex.  Her mother seems to be in on not telling the father, which means either the mother told her not to tell the father or is in support of the idea of not telling him.  &lt;/p&gt;\n\n&lt;p&gt;Is he paying for her schooling?  Helping her get set up financially after school?  It&amp;#39;s possible that she&amp;#39;s afraid he&amp;#39;ll cut her off if he finds out that she&amp;#39;s been having weekends away with a man all this time.  Things may get easier once she&amp;#39;s set up with a job and able to support herself and separate her life from theirs.  It might be a good idea to talk with her about where you both see the relationship going and what her plans are for herself after graduation.  Is she moving out once she finds a job?  Is she looking for work only locally?  What are your plans?  Are you going to live together after you both graduate?  After two years, those are pretty reasonable conversations to have if you&amp;#39;re not already having them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4re8y", "score_hidden": false, "stickied": false, "created": 1491967031.0, "created_utc": 1491938231.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3v2l0", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "throwaway1238971", "parent_id": "t1_dg3tvmp", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;And maybe put some effort into learning more about her cultural identity and customs if you're so clueless about her cultural background that your OP doesn't even bother to mention the specific cultural background that explains half the story.\n\nWe talk a lot about the context of her Korean background. She's told me before that she has little cultural connection to South Korea. She's also said that her parents aren't very traditional, and that they studied and worked in the US for most of their adult lives. For these reasons it didn't occur to me to mention it in the OP. I don't think I'm clueless on her cultural background but thanks for your contribution, it's something to consider.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And maybe put some effort into learning more about her cultural identity and customs if you&amp;#39;re so clueless about her cultural background that your OP doesn&amp;#39;t even bother to mention the specific cultural background that explains half the story.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We talk a lot about the context of her Korean background. She&amp;#39;s told me before that she has little cultural connection to South Korea. She&amp;#39;s also said that her parents aren&amp;#39;t very traditional, and that they studied and worked in the US for most of their adult lives. For these reasons it didn&amp;#39;t occur to me to mention it in the OP. I don&amp;#39;t think I&amp;#39;m clueless on her cultural background but thanks for your contribution, it&amp;#39;s something to consider.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3v2l0", "score_hidden": false, "stickied": false, "created": 1491914172.0, "created_utc": 1491885372.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3tvmp", "gilded": 0, "archived": false, "score": 80, "report_reasons": null, "author": "yifrancisren", "parent_id": "t1_dg3t5cf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "From a soompi article on Korean wedding customs: \"In the U.S. and in many other countries, it’s not considered a big deal to introduce your new boyfriend or girlfriend to your family early in the relationship, but in Korea, the parents will not typically meet any significant other… except for the last one. So if you’re being introduced to the parents, chances are that your partner is gearing up to make it permanent.\"\n\nSo it's pretty much cultural for you to not meet her parents until you've talked a lot about engagement at least. At which point you would meet her parents. Then your parents would meet each other, and you would get engaged. Even if she isn't into traditional customs, she might want to avoid accidentally signaling marriage to the more old-fashioned parents.\n\nI also understand her not wanting to tell her dad about you if he's a pain in the ass. She has to live with them, and doesn't want to deal with nagging about how boys are distracting her from school or judging the shit out of you for not being Korean. If she doesn't have reasonable financial means to move out on her own, it might just be to keep the peace while she lives with them. Usually when you see a post on /r/relationships that's like \"I financially depend on my parents but I am gay/atheist/whatever which they detest to the very core\", the suggestion is to just suck it up and lie until you are free. Well, that's kind of what she's doing.\n\nI'd say the fact that she has told her mom about you means that her dad is just a jerk. It reflects more on her dad than on your suitability as a boyfriend.\n\nBut if you really want to meet her parents, start talking engagement and move in together. And maybe put some effort into learning more about her cultural identity and customs if you're so clueless about her cultural background that your OP doesn't even bother to mention the specific cultural background that explains half the story.", "edited": 1491884164.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From a soompi article on Korean wedding customs: &amp;quot;In the U.S. and in many other countries, it’s not considered a big deal to introduce your new boyfriend or girlfriend to your family early in the relationship, but in Korea, the parents will not typically meet any significant other… except for the last one. So if you’re being introduced to the parents, chances are that your partner is gearing up to make it permanent.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s pretty much cultural for you to not meet her parents until you&amp;#39;ve talked a lot about engagement at least. At which point you would meet her parents. Then your parents would meet each other, and you would get engaged. Even if she isn&amp;#39;t into traditional customs, she might want to avoid accidentally signaling marriage to the more old-fashioned parents.&lt;/p&gt;\n\n&lt;p&gt;I also understand her not wanting to tell her dad about you if he&amp;#39;s a pain in the ass. She has to live with them, and doesn&amp;#39;t want to deal with nagging about how boys are distracting her from school or judging the shit out of you for not being Korean. If she doesn&amp;#39;t have reasonable financial means to move out on her own, it might just be to keep the peace while she lives with them. Usually when you see a post on &lt;a href=\"/r/relationships\"&gt;/r/relationships&lt;/a&gt; that&amp;#39;s like &amp;quot;I financially depend on my parents but I am gay/atheist/whatever which they detest to the very core&amp;quot;, the suggestion is to just suck it up and lie until you are free. Well, that&amp;#39;s kind of what she&amp;#39;s doing.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say the fact that she has told her mom about you means that her dad is just a jerk. It reflects more on her dad than on your suitability as a boyfriend.&lt;/p&gt;\n\n&lt;p&gt;But if you really want to meet her parents, start talking engagement and move in together. And maybe put some effort into learning more about her cultural identity and customs if you&amp;#39;re so clueless about her cultural background that your OP doesn&amp;#39;t even bother to mention the specific cultural background that explains half the story.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3tvmp", "score_hidden": false, "stickied": false, "created": 1491912221.0, "created_utc": 1491883421.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 80}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4olm8", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "be_more_constructive", "parent_id": "t1_dg4ke4q", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Of course there are progressives in any culture.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course there are progressives in any culture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4olm8", "score_hidden": false, "stickied": false, "created": 1491964059.0, "created_utc": 1491935259.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ke4q", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg48598", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ke4q", "score_hidden": false, "stickied": false, "created": 1491959438.0, "created_utc": 1491930638.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48598", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Bonobosaurus", "parent_id": "t1_dg3t5cf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh yeah. You won't meet her parents until you're engaged. It's a cultural thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh yeah. You won&amp;#39;t meet her parents until you&amp;#39;re engaged. It&amp;#39;s a cultural thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48598", "score_hidden": false, "stickied": false, "created": 1491945059.0, "created_utc": 1491916259.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg40mmt", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Mojojojo3030", "parent_id": "t1_dg3t5cf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You should add this to the OP. I dated a Korean for half a year and never met her parents, an Indian for 2 years and never met hers. It's often part of the package. Here I was thinking she just wasn't serious about you when it is just that she has racist or prenuptially-challenged parents lol. \n\nI don't really see why you care so much. If you marry, how long she hid it will be secondary to the fact that you are white/have been boinking her. Pretending to be a friend in the crowd is only humiliating if you let it humiliate you. Honestly it should only be humiliating to them if they had any perspective. If you really can't hang, maybe factor that in next time you shack up with a second gen Korean? I mean, this was pretty foreseeable wasn't it?\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should add this to the OP. I dated a Korean for half a year and never met her parents, an Indian for 2 years and never met hers. It&amp;#39;s often part of the package. Here I was thinking she just wasn&amp;#39;t serious about you when it is just that she has racist or prenuptially-challenged parents lol. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really see why you care so much. If you marry, how long she hid it will be secondary to the fact that you are white/have been boinking her. Pretending to be a friend in the crowd is only humiliating if you let it humiliate you. Honestly it should only be humiliating to them if they had any perspective. If you really can&amp;#39;t hang, maybe factor that in next time you shack up with a second gen Korean? I mean, this was pretty foreseeable wasn&amp;#39;t it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg40mmt", "score_hidden": false, "stickied": false, "created": 1491926886.0, "created_utc": 1491898086.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4cffq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "YungPootieTang", "parent_id": "t1_dg3t5cf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Her parents are from South Korea but she grew up in the United States. I'm a white Australian guy.\n\n\nAre you 100% sure she sees you as a marriage partner? This is the usual recipe for \"I love this person and will date him right now, but later I'll marry someone my parents approve of.... someone Korean\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Her parents are from South Korea but she grew up in the United States. I&amp;#39;m a white Australian guy.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Are you 100% sure she sees you as a marriage partner? This is the usual recipe for &amp;quot;I love this person and will date him right now, but later I&amp;#39;ll marry someone my parents approve of.... someone Korean&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4cffq", "score_hidden": false, "stickied": false, "created": 1491950626.0, "created_utc": 1491921826.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3t5cf", "gilded": 0, "archived": false, "score": 63, "report_reasons": null, "author": "throwaway1238971", "parent_id": "t1_dg3sdb6", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Her parents are from South Korea but she grew up in the United States. I'm a white Australian guy.\n\nHer parents aren't puritans and both dated other people before getting married late. They're not particularly religious or anything.", "edited": 1491882482.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Her parents are from South Korea but she grew up in the United States. I&amp;#39;m a white Australian guy.&lt;/p&gt;\n\n&lt;p&gt;Her parents aren&amp;#39;t puritans and both dated other people before getting married late. They&amp;#39;re not particularly religious or anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3t5cf", "score_hidden": false, "stickied": false, "created": 1491911094.0, "created_utc": 1491882294.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 63}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3sdb6", "gilded": 0, "archived": false, "score": 96, "report_reasons": null, "author": "yifrancisren", "parent_id": "t1_dg3rrtt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There are some cultures where you might not meet the parents until you're engaged. Some greater cultural context would allow people to make more informed comments.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are some cultures where you might not meet the parents until you&amp;#39;re engaged. Some greater cultural context would allow people to make more informed comments.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3sdb6", "score_hidden": false, "stickied": false, "created": 1491909966.0, "created_utc": 1491881166.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 96}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4zco4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PNWfan", "parent_id": "t1_dg3rrtt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just communicate all those concerns to her and see what her plan is. If she doesn't have an answer then I would put your foot down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just communicate all those concerns to her and see what her plan is. If she doesn&amp;#39;t have an answer then I would put your foot down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4zco4", "score_hidden": false, "stickied": false, "created": 1491976047.0, "created_utc": 1491947247.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3rrtt", "gilded": 0, "archived": false, "score": 63, "report_reasons": null, "author": "throwaway1238971", "parent_id": "t1_dg3r53f", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks for the different perspective. I have tried to understand this perspective but my problem is I don't see how it ends. I mean at some point, if this is a serious relationship to her, she will have to tell her father. It seems like to me it will only get more awkward with the passage of time for her to tell him (\"you've been dating for how long?!\")\n\nI've tried to be patient with her about this (I drop her off a few houses before her house, I don't make any noise if her parents call her phone, etc) but am I really expected to go along with it forever?\n\nIf we end up lasting that long, I don't want to meet them at our wedding, and miss all the major stuff in her life before that. I'm not expecting her parents to invite me around for dinner or let me into their home. Just to be present at things like her graduation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the different perspective. I have tried to understand this perspective but my problem is I don&amp;#39;t see how it ends. I mean at some point, if this is a serious relationship to her, she will have to tell her father. It seems like to me it will only get more awkward with the passage of time for her to tell him (&amp;quot;you&amp;#39;ve been dating for how long?!&amp;quot;)&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve tried to be patient with her about this (I drop her off a few houses before her house, I don&amp;#39;t make any noise if her parents call her phone, etc) but am I really expected to go along with it forever?&lt;/p&gt;\n\n&lt;p&gt;If we end up lasting that long, I don&amp;#39;t want to meet them at our wedding, and miss all the major stuff in her life before that. I&amp;#39;m not expecting her parents to invite me around for dinner or let me into their home. Just to be present at things like her graduation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3rrtt", "score_hidden": false, "stickied": false, "created": 1491909134.0, "created_utc": 1491880334.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 63}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4angj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "SaxifragetheGreen", "parent_id": "t1_dg3r53f", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;That has nothing to do with you.. \n\nThat's not true. It absolutely has to do with the OP. It's his life, his GF, and he's the one missing out on her life because shes can't act like a decent human being and introduce her long-time BF to her family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That has nothing to do with you.. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not true. It absolutely has to do with the OP. It&amp;#39;s his life, his GF, and he&amp;#39;s the one missing out on her life because shes can&amp;#39;t act like a decent human being and introduce her long-time BF to her family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4angj", "score_hidden": false, "stickied": false, "created": 1491948463.0, "created_utc": 1491919663.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3yyka", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "xPawreen", "parent_id": "t1_dg3sebz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It might not be that black and white. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might not be that black and white. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3yyka", "score_hidden": false, "stickied": false, "created": 1491922250.0, "created_utc": 1491893450.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4f23a", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "gtfohoney2", "parent_id": "t1_dg3sebz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She lives with her family, \"standing up\" to them could mean homelessness ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She lives with her family, &amp;quot;standing up&amp;quot; to them could mean homelessness &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4f23a", "score_hidden": false, "stickied": false, "created": 1491953594.0, "created_utc": 1491924794.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3sebz", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "iSoReddit", "parent_id": "t1_dg3r53f", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "&gt; That has nothing to do with you.. It's only her father's mentality\n\nIt's more her inability to stand up to her father that anything else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;That has nothing to do with you.. It&amp;#39;s only her father&amp;#39;s mentality&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s more her inability to stand up to her father that anything else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3sebz", "score_hidden": false, "stickied": false, "created": 1491910007.0, "created_utc": 1491881207.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3r53f", "gilded": 0, "archived": false, "score": 128, "report_reasons": null, "author": "Zaxxxx", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I come from another country and I completely understand her.. She doesn't want to have any conflict with her father so that's why she prefers not to tell him about you. \nThat has nothing to do with you.. It's only her father's mentality.. and protectiveness of daughter. \nDon't worry too much..Not every family is open and open-minded..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I come from another country and I completely understand her.. She doesn&amp;#39;t want to have any conflict with her father so that&amp;#39;s why she prefers not to tell him about you. \nThat has nothing to do with you.. It&amp;#39;s only her father&amp;#39;s mentality.. and protectiveness of daughter. \nDon&amp;#39;t worry too much..Not every family is open and open-minded..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3r53f", "score_hidden": false, "stickied": false, "created": 1491908296.0, "created_utc": 1491879496.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 128}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg40r9s", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "meowsasaurus", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've been the GF in this scenario (BF at the time was white, I'm not). I was born and raised here in the US, don't have any deep ties to my Asian cultures and my parents have lived here almost there entire life as well. In a lot of Asian households, it's not uncommon for SOs to not be invited to events until the relationship is seen as serious by the parents, which generally means engaged. This was a large struggle for my BF to deal with because it made him feel unwelcome, which is a total valid point. I was invited to Christmas with his family, but there was no way in hell that he could have ever attended even a casual friends and family get together with my family. I felt terrible, and if your GF is in a similar situation, she likely does as well. The joke of \"no dating till you're married\" also hits really close to home as well. Shitty as the situation is, she has no control over overarching possibly racist attitudes and archaic cultures. \n\nJust have a conversation with her and ask why you can't meet her family. My boyfriend constantly asked the same thing and it was so difficult communicating the cultural difference. There's no easy way to say \"Sorry but my parents just don't want you here. You're not welcome but honestly it's nothing personal it's just a cultural thing\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been the GF in this scenario (BF at the time was white, I&amp;#39;m not). I was born and raised here in the US, don&amp;#39;t have any deep ties to my Asian cultures and my parents have lived here almost there entire life as well. In a lot of Asian households, it&amp;#39;s not uncommon for SOs to not be invited to events until the relationship is seen as serious by the parents, which generally means engaged. This was a large struggle for my BF to deal with because it made him feel unwelcome, which is a total valid point. I was invited to Christmas with his family, but there was no way in hell that he could have ever attended even a casual friends and family get together with my family. I felt terrible, and if your GF is in a similar situation, she likely does as well. The joke of &amp;quot;no dating till you&amp;#39;re married&amp;quot; also hits really close to home as well. Shitty as the situation is, she has no control over overarching possibly racist attitudes and archaic cultures. &lt;/p&gt;\n\n&lt;p&gt;Just have a conversation with her and ask why you can&amp;#39;t meet her family. My boyfriend constantly asked the same thing and it was so difficult communicating the cultural difference. There&amp;#39;s no easy way to say &amp;quot;Sorry but my parents just don&amp;#39;t want you here. You&amp;#39;re not welcome but honestly it&amp;#39;s nothing personal it&amp;#39;s just a cultural thing&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg40r9s", "score_hidden": false, "stickied": false, "created": 1491927274.0, "created_utc": 1491898474.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg46ftj", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "natha105", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;many of them are overseas in her home country.\n\nThis is the key sentence.  Most people do not live at home through law school.  Most people are allowed to date (she is lying to her father about where she is going).\n\nThe obvious answer to all this is that she is under the thumb of her parents and her father might be willing to turn a blind eye to things but if confronted with the fact she is dating a western guy he will lose face and react EXTREMELY badly.\n\nShe hasn't told you because she thinks you would demand a confrontation if you found this out.\n\nYou two don't need counseling or anything like that.  Just let her deal with her family.  If you are getting ready to propose I would talk with her about how that is going to work.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;many of them are overseas in her home country.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is the key sentence.  Most people do not live at home through law school.  Most people are allowed to date (she is lying to her father about where she is going).&lt;/p&gt;\n\n&lt;p&gt;The obvious answer to all this is that she is under the thumb of her parents and her father might be willing to turn a blind eye to things but if confronted with the fact she is dating a western guy he will lose face and react EXTREMELY badly.&lt;/p&gt;\n\n&lt;p&gt;She hasn&amp;#39;t told you because she thinks you would demand a confrontation if you found this out.&lt;/p&gt;\n\n&lt;p&gt;You two don&amp;#39;t need counseling or anything like that.  Just let her deal with her family.  If you are getting ready to propose I would talk with her about how that is going to work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg46ftj", "score_hidden": false, "stickied": false, "created": 1491942285.0, "created_utc": 1491913485.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg48ry6", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Zap_Dannigan", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "People are giving the reason why she might be hiding the parents, and that's all good.... But that she's not telling him that's reason and making him wonder about her intentions and commitment is pretty effed up ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People are giving the reason why she might be hiding the parents, and that&amp;#39;s all good.... But that she&amp;#39;s not telling him that&amp;#39;s reason and making him wonder about her intentions and commitment is pretty effed up &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48ry6", "score_hidden": false, "stickied": false, "created": 1491945970.0, "created_utc": 1491917170.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4fl27", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "tranberry", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP, just a perspective from an Asian chick with a white bf. In college, I told my dad about four months into dating because I considered him the \"cooler\" parent. All my cousins think he's the coolest uncle. He didn't care that I swore all the time. We would watch Arrested Development together, and most importantly, when I had told him I dated a guy in high school a year after the fact, he was really upset that I didn't tell him about it. Surely he would act like a normal ass person right?\n\nNoooope. Flipped out on me, gave me lectures about how school was more important, blah blah blah. OP, we will have been together for six years this year. We've been living together for over two. He hasn't spent more than a few hours with my bf every time they meet and for the longest time called him an incorrect variation of his name (think calling him Greg instead of Craig).\n\nAnd my dad is the \"cool\" dad.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, just a perspective from an Asian chick with a white bf. In college, I told my dad about four months into dating because I considered him the &amp;quot;cooler&amp;quot; parent. All my cousins think he&amp;#39;s the coolest uncle. He didn&amp;#39;t care that I swore all the time. We would watch Arrested Development together, and most importantly, when I had told him I dated a guy in high school a year after the fact, he was really upset that I didn&amp;#39;t tell him about it. Surely he would act like a normal ass person right?&lt;/p&gt;\n\n&lt;p&gt;Noooope. Flipped out on me, gave me lectures about how school was more important, blah blah blah. OP, we will have been together for six years this year. We&amp;#39;ve been living together for over two. He hasn&amp;#39;t spent more than a few hours with my bf every time they meet and for the longest time called him an incorrect variation of his name (think calling him Greg instead of Craig).&lt;/p&gt;\n\n&lt;p&gt;And my dad is the &amp;quot;cool&amp;quot; dad.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4fl27", "score_hidden": false, "stickied": false, "created": 1491954184.0, "created_utc": 1491925384.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3x6ao", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "herpy_McDerpster", "parent_id": "t1_dg3rl1x", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Grow a pair and have an adult conversation with her. Find out the problem, and he ready to walk if she can't talk to you about it.\n\nYou've been along on eggshells like a whipped puppy for two years, and its time to move forward with our without her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Grow a pair and have an adult conversation with her. Find out the problem, and he ready to walk if she can&amp;#39;t talk to you about it.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve been along on eggshells like a whipped puppy for two years, and its time to move forward with our without her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3x6ao", "score_hidden": false, "stickied": false, "created": 1491918112.0, "created_utc": 1491889312.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4c14h", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "WantonWontonWalton", "parent_id": "t1_dg4bet0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "yea but think about it from her perspective. if i was OPs gf, saying 'i can't introduce you until we're engaged' would sound to me like I'm telling him \"oh you wanna meet my parents? marry me or gtfo\". maybe she just doesn't want to put that kind of pressure on OP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yea but think about it from her perspective. if i was OPs gf, saying &amp;#39;i can&amp;#39;t introduce you until we&amp;#39;re engaged&amp;#39; would sound to me like I&amp;#39;m telling him &amp;quot;oh you wanna meet my parents? marry me or gtfo&amp;quot;. maybe she just doesn&amp;#39;t want to put that kind of pressure on OP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4c14h", "score_hidden": false, "stickied": false, "created": 1491950161.0, "created_utc": 1491921361.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4bet0", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "RobotPartsCorp", "parent_id": "t1_dg47scf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah but she has yet to explain that to OP. She could easily say \"I can not introduce you until we are engaged\" and then they could both figure out a way to navigate that. Saying \"it's complicated\" actually makes it all complicated and vague and helps no one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah but she has yet to explain that to OP. She could easily say &amp;quot;I can not introduce you until we are engaged&amp;quot; and then they could both figure out a way to navigate that. Saying &amp;quot;it&amp;#39;s complicated&amp;quot; actually makes it all complicated and vague and helps no one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4bet0", "score_hidden": false, "stickied": false, "created": 1491949412.0, "created_utc": 1491920612.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47scf", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "dalekinthewwing", "parent_id": "t1_dg3rl1x", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you're overreacting a bit. It's VERY common for Asians (regardless of how Westernized/non-traditional they are) to not introduce their partners to their families, especially before engagement. I really don't think it's cause for breakup. Also some people just aren't close to their family? I hardly ever introduce my friends to my mother simply because I don't like her. I don't like hanging out with my mother so why waste time enmeshing my social circle with her? I think you and your gf may have different views on family values.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re overreacting a bit. It&amp;#39;s VERY common for Asians (regardless of how Westernized/non-traditional they are) to not introduce their partners to their families, especially before engagement. I really don&amp;#39;t think it&amp;#39;s cause for breakup. Also some people just aren&amp;#39;t close to their family? I hardly ever introduce my friends to my mother simply because I don&amp;#39;t like her. I don&amp;#39;t like hanging out with my mother so why waste time enmeshing my social circle with her? I think you and your gf may have different views on family values.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47scf", "score_hidden": false, "stickied": false, "created": 1491944499.0, "created_utc": 1491915699.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3rl1x", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "throwaway1238971", "parent_id": "t1_dg3pvwr", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Are you guys planning to live together soon? Get married? Have kids? \n\nWe lived together for a year when I briefly lived out of home. We've talked about where we might live together in the future, how we might raise our children etc.\n\n&gt;I don't think you're being unreasonable and I think it's time for some answers.\n\nI just don't know how far I should be taking this - whether it's reasonable to call into question the entire relationship and consider breaking up if she doesn't budge.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Are you guys planning to live together soon? Get married? Have kids? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;We lived together for a year when I briefly lived out of home. We&amp;#39;ve talked about where we might live together in the future, how we might raise our children etc.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t think you&amp;#39;re being unreasonable and I think it&amp;#39;s time for some answers.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I just don&amp;#39;t know how far I should be taking this - whether it&amp;#39;s reasonable to call into question the entire relationship and consider breaking up if she doesn&amp;#39;t budge.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3rl1x", "score_hidden": false, "stickied": false, "created": 1491908892.0, "created_utc": 1491880092.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3pvwr", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "C1awed", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "By this point, she has to have some reason not to introduce you and she really should tell you what it is.  Are you guys planning to live together soon?  Get married?  Have kids?  Your relationship is to the point where things are already being strained - you're not allowed to go to her graduation - by this.\n\nHow is she expecting the future of your relationship to go?  She can't hide you forever.  \n\nI don't think you're being unreasonable and I think it's time for some answers.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By this point, she has to have some reason not to introduce you and she really should tell you what it is.  Are you guys planning to live together soon?  Get married?  Have kids?  Your relationship is to the point where things are already being strained - you&amp;#39;re not allowed to go to her graduation - by this.&lt;/p&gt;\n\n&lt;p&gt;How is she expecting the future of your relationship to go?  She can&amp;#39;t hide you forever.  &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think you&amp;#39;re being unreasonable and I think it&amp;#39;s time for some answers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3pvwr", "score_hidden": false, "stickied": false, "created": 1491906732.0, "created_utc": 1491877932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3sbnw", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "follow-jono", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I understand there may be some reasons to do with her father and why she might not want you to meet him. But the irreparable fact is that as a couple you are already missing out on big parts and events of each others lives (e.g. her graduation). This doesn't seem very healthy to me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand there may be some reasons to do with her father and why she might not want you to meet him. But the irreparable fact is that as a couple you are already missing out on big parts and events of each others lives (e.g. her graduation). This doesn&amp;#39;t seem very healthy to me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3sbnw", "score_hidden": false, "stickied": false, "created": 1491909902.0, "created_utc": 1491881102.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4avmb", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Flownique", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't think her graduation/bar admission events are a good time to push for being included. The conflict with her parents (which is obviously what this is about) is going to overshadow the whole experience for her and make an otherwise happy celebration day into something incredibly stressful.\n\nI don't know from your post what the exact issue is - is it because they're Korean and don't approve of a white boyfriend? Is it because they're traditional and don't approve of boyfriends at all? You should talk to her and figure out what's going on, but ultimately you need to respect her decision not to bring you around her family. It's just not that simple or easy for everyone, especially if you're Asian. You probably didn't have to face the same stakes when you introduced her to your family so it's not a fair or equivalent comparison. I mean there's literally Asian parents out there who will threaten to disown you, send you back to the home country, or cut off support if you date outside the race or sometimes even if you date at all. I'm sure you never had to weigh such risks when you invited your girlfriend over for Easter.\n\nIt sounds like you have really strong family ties, meanwhile her family and friends live far away and she can't risk telling them much about her dating life. That must be really hard. Imagine if she brought you around and she was forced to choose between you and what little family ties she has. Those are some pretty high stakes.\n\nAs long as she brings you around her friends I don't think this is a cut and dry issue of her \"hiding\" you. It sounds like it's specifically a family thing. So try to be understanding.", "edited": 1491920593.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think her graduation/bar admission events are a good time to push for being included. The conflict with her parents (which is obviously what this is about) is going to overshadow the whole experience for her and make an otherwise happy celebration day into something incredibly stressful.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know from your post what the exact issue is - is it because they&amp;#39;re Korean and don&amp;#39;t approve of a white boyfriend? Is it because they&amp;#39;re traditional and don&amp;#39;t approve of boyfriends at all? You should talk to her and figure out what&amp;#39;s going on, but ultimately you need to respect her decision not to bring you around her family. It&amp;#39;s just not that simple or easy for everyone, especially if you&amp;#39;re Asian. You probably didn&amp;#39;t have to face the same stakes when you introduced her to your family so it&amp;#39;s not a fair or equivalent comparison. I mean there&amp;#39;s literally Asian parents out there who will threaten to disown you, send you back to the home country, or cut off support if you date outside the race or sometimes even if you date at all. I&amp;#39;m sure you never had to weigh such risks when you invited your girlfriend over for Easter.&lt;/p&gt;\n\n&lt;p&gt;It sounds like you have really strong family ties, meanwhile her family and friends live far away and she can&amp;#39;t risk telling them much about her dating life. That must be really hard. Imagine if she brought you around and she was forced to choose between you and what little family ties she has. Those are some pretty high stakes.&lt;/p&gt;\n\n&lt;p&gt;As long as she brings you around her friends I don&amp;#39;t think this is a cut and dry issue of her &amp;quot;hiding&amp;quot; you. It sounds like it&amp;#39;s specifically a family thing. So try to be understanding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4avmb", "score_hidden": false, "stickied": false, "created": 1491948752.0, "created_utc": 1491919952.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3rje6", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "lamamaloca", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm guessing this is very much a cultural issue. You may have to adjust your expectations somewhat. ", "edited": 1491912620.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m guessing this is very much a cultural issue. You may have to adjust your expectations somewhat. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3rje6", "score_hidden": false, "stickied": false, "created": 1491908834.0, "created_utc": 1491880034.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4f57p", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "4b3ats", "parent_id": "t1_dg3yy1q", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I disagree with this statement, plus OP wasn't even given the chance to understand because his girlfriend won't communicate with him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree with this statement, plus OP wasn&amp;#39;t even given the chance to understand because his girlfriend won&amp;#39;t communicate with him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4f57p", "score_hidden": false, "stickied": false, "created": 1491953692.0, "created_utc": 1491924892.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3yy1q", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "hazel865322", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There are some problems with her family that you are not aware of. People who have nice families like you, cannot understand this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are some problems with her family that you are not aware of. People who have nice families like you, cannot understand this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3yy1q", "score_hidden": false, "stickied": false, "created": 1491922214.0, "created_utc": 1491893414.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4fix9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "clockinmyrari", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Personally, I would not let my parents meet my boyfriend until... the day of the wedding ... but I don't really want to get married so idk.\n\nI won't tell my parents because I know they are not supportive of me dating in general. They would put in their unwanted 2 cents, make snide comments, be haters of MY relationship with someone * I * like / love. So forgive me (or your girlfriend) for trying to keep the toxic out of your relationship. \n\nWhen I was still with my boyfriend (now ex), I have my graduation coming up where my parents are going to be there. I really wanted him there as well but I know it would just be trouble because my parents would judge and criticise the relationship to shreds. \n\nDo you see that maybe that's where you GF is coming from? As much as she cares about you, parents are old dogs who won't budge ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Personally, I would not let my parents meet my boyfriend until... the day of the wedding ... but I don&amp;#39;t really want to get married so idk.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t tell my parents because I know they are not supportive of me dating in general. They would put in their unwanted 2 cents, make snide comments, be haters of MY relationship with someone * I * like / love. So forgive me (or your girlfriend) for trying to keep the toxic out of your relationship. &lt;/p&gt;\n\n&lt;p&gt;When I was still with my boyfriend (now ex), I have my graduation coming up where my parents are going to be there. I really wanted him there as well but I know it would just be trouble because my parents would judge and criticise the relationship to shreds. &lt;/p&gt;\n\n&lt;p&gt;Do you see that maybe that&amp;#39;s where you GF is coming from? As much as she cares about you, parents are old dogs who won&amp;#39;t budge &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4fix9", "score_hidden": false, "stickied": false, "created": 1491954119.0, "created_utc": 1491925319.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4rclz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "clutchy22", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Indian or any other strict dating culture? Are you white?  Just a guess.  My best friend had to be engaged and living with his girlfriend, who he had dated for nearly 10 years and her father never knew because she would be disowned (her mom knew the whole time), just to get approval and introduced.  There were legitimate scenarios where he hid in a closet to avoid the father, and even when introduced after the engagement, faked having a separate bedroom that he would sleep in, away from her.  It sounds like you live with your parents, this would NOT fly outright in certain cultures, they want to see a man who can successfully take care of their daughter as they would.", "edited": 1491938492.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Indian or any other strict dating culture? Are you white?  Just a guess.  My best friend had to be engaged and living with his girlfriend, who he had dated for nearly 10 years and her father never knew because she would be disowned (her mom knew the whole time), just to get approval and introduced.  There were legitimate scenarios where he hid in a closet to avoid the father, and even when introduced after the engagement, faked having a separate bedroom that he would sleep in, away from her.  It sounds like you live with your parents, this would NOT fly outright in certain cultures, they want to see a man who can successfully take care of their daughter as they would.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4rclz", "score_hidden": false, "stickied": false, "created": 1491966980.0, "created_utc": 1491938180.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4xdrc", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Inevitablename", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ok all this \"But that is the culture\" talk, for real, my parents are from Korea too, and they're also of the \"we only want to meet your future husband, not anyone else\" mindset... But I actually TOLD my boyfriend WHY when I explained I was keeping various parts of our relationship secret from my parents. \"They're going to be a PITA and never shut up about us getting married.\" Lo and behold, I was right. Every time I go home, \"Why aren't you married yet? Get married. You two should get married.\" Now he knows I was right!\n\nAnyway. Has your girlfriend actually told you why she doesn't want you to meet them yet and when, if ever, she would like that to happen? Koreans in America are usually VERY Christian (most of our families join Korean churches here) and tend to be pretty strict with their girls, but come on. She's an attorney now (or almost) and can surely use words to communicate to you, else I have bad news about her future career.\n\nThe highlights:\n(1) why she has made this choice\n(2) when that will change\n(3) what she is open to doing as a compromise\n(4) her understanding of your position and why this hurts your feelings", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok all this &amp;quot;But that is the culture&amp;quot; talk, for real, my parents are from Korea too, and they&amp;#39;re also of the &amp;quot;we only want to meet your future husband, not anyone else&amp;quot; mindset... But I actually TOLD my boyfriend WHY when I explained I was keeping various parts of our relationship secret from my parents. &amp;quot;They&amp;#39;re going to be a PITA and never shut up about us getting married.&amp;quot; Lo and behold, I was right. Every time I go home, &amp;quot;Why aren&amp;#39;t you married yet? Get married. You two should get married.&amp;quot; Now he knows I was right!&lt;/p&gt;\n\n&lt;p&gt;Anyway. Has your girlfriend actually told you why she doesn&amp;#39;t want you to meet them yet and when, if ever, she would like that to happen? Koreans in America are usually VERY Christian (most of our families join Korean churches here) and tend to be pretty strict with their girls, but come on. She&amp;#39;s an attorney now (or almost) and can surely use words to communicate to you, else I have bad news about her future career.&lt;/p&gt;\n\n&lt;p&gt;The highlights:\n(1) why she has made this choice\n(2) when that will change\n(3) what she is open to doing as a compromise\n(4) her understanding of your position and why this hurts your feelings&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4xdrc", "score_hidden": false, "stickied": false, "created": 1491973673.0, "created_utc": 1491944873.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3z3a2", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "xPawreen", "parent_id": "t1_dg3yls5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "True, the girlfriend still lives at home and if her dad was racist, her life is a whole lot easier if she doesn't tell him about her white boyfriend until after she moves out. Otherwise she might have to deal with her dad being shitty about it on a daily basis. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True, the girlfriend still lives at home and if her dad was racist, her life is a whole lot easier if she doesn&amp;#39;t tell him about her white boyfriend until after she moves out. Otherwise she might have to deal with her dad being shitty about it on a daily basis. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3z3a2", "score_hidden": false, "stickied": false, "created": 1491922578.0, "created_utc": 1491893778.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg576gj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nujabesss", "parent_id": "t1_dg4kqao", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "No, I tell my partners that my parents are very insular and it would just be easier if they didn't meet them. I have aunts and uncles I consider my parental figures in that have met my SO's. OP never told us if he met any other family. I'm almost estranged from my mom and dad though, so it's easy. I wouldn't introduce unless it was certain we were getting married. Otherwise--why stress them (and me) out?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, I tell my partners that my parents are very insular and it would just be easier if they didn&amp;#39;t meet them. I have aunts and uncles I consider my parental figures in that have met my SO&amp;#39;s. OP never told us if he met any other family. I&amp;#39;m almost estranged from my mom and dad though, so it&amp;#39;s easy. I wouldn&amp;#39;t introduce unless it was certain we were getting married. Otherwise--why stress them (and me) out?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg576gj", "score_hidden": false, "stickied": false, "created": 1491986327.0, "created_utc": 1491957527.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4kqao", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "GirthBrooks", "parent_id": "t1_dg3yls5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I have not mentioned any of my relationships to my dad because I haven't dated anyone Asian, not because I'm ashamed of them but because it's just easier to deal with him if he doesn't know. \n\nDo you lie and deflect to your partner when that happens? I can sympathize with OP's GF's situation with her dad, but not her lack of communication with OP.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I have not mentioned any of my relationships to my dad because I haven&amp;#39;t dated anyone Asian, not because I&amp;#39;m ashamed of them but because it&amp;#39;s just easier to deal with him if he doesn&amp;#39;t know. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Do you lie and deflect to your partner when that happens? I can sympathize with OP&amp;#39;s GF&amp;#39;s situation with her dad, but not her lack of communication with OP.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4kqao", "score_hidden": false, "stickied": false, "created": 1491959811.0, "created_utc": 1491931011.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg578ad", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nujabesss", "parent_id": "t1_dg481u4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well I'm only 20, so I'm not really worried about that. In the future though, I am sure my balls will be ginormous, and I'll just tell them what I'm doing, and that's that. Because I'm still young, they see me dating as irresponsible, so I don't tell them about relationships period anyway. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I&amp;#39;m only 20, so I&amp;#39;m not really worried about that. In the future though, I am sure my balls will be ginormous, and I&amp;#39;ll just tell them what I&amp;#39;m doing, and that&amp;#39;s that. Because I&amp;#39;m still young, they see me dating as irresponsible, so I don&amp;#39;t tell them about relationships period anyway. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg578ad", "score_hidden": false, "stickied": false, "created": 1491986394.0, "created_utc": 1491957594.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg481u4", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "run_cueca", "parent_id": "t1_dg3yls5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What will you do if you want to get married/start a family?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What will you do if you want to get married/start a family?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg481u4", "score_hidden": false, "stickied": false, "created": 1491944916.0, "created_utc": 1491916116.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3yls5", "gilded": 0, "archived": false, "score": 37, "report_reasons": null, "author": "nujabesss", "parent_id": "t1_dg3qm7z", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I disagree. OP mentioned he's white and his girlfriend is Korean. In my own experience, old Asian people can be pretty racist when it comes to their kids dating different races. I have not mentioned any of my relationships to my dad because I haven't dated anyone Asian, not because I'm ashamed of them but because it's just easier to deal with him if he doesn't know.  There are uncles and aunts who I am closer to, who are not racist and would not judge a person based on race, who I introduced boyfriends to. It's honestly a culture thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I disagree. OP mentioned he&amp;#39;s white and his girlfriend is Korean. In my own experience, old Asian people can be pretty racist when it comes to their kids dating different races. I have not mentioned any of my relationships to my dad because I haven&amp;#39;t dated anyone Asian, not because I&amp;#39;m ashamed of them but because it&amp;#39;s just easier to deal with him if he doesn&amp;#39;t know.  There are uncles and aunts who I am closer to, who are not racist and would not judge a person based on race, who I introduced boyfriends to. It&amp;#39;s honestly a culture thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3yls5", "score_hidden": false, "stickied": false, "created": 1491921359.0, "created_utc": 1491892559.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 37}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3qm7z", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "javanator999", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is a huge red flag flapping in the breeze. If I was going to call it, I'd say she doesn't see you as marriage material and doesn't want her family thinking she is slutty for having sex before marriage. \n\nThink about this very carefully, you could get dumped in a hurry when she decides to marry someone her folks will approve of.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a huge red flag flapping in the breeze. If I was going to call it, I&amp;#39;d say she doesn&amp;#39;t see you as marriage material and doesn&amp;#39;t want her family thinking she is slutty for having sex before marriage. &lt;/p&gt;\n\n&lt;p&gt;Think about this very carefully, you could get dumped in a hurry when she decides to marry someone her folks will approve of.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3qm7z", "score_hidden": false, "stickied": false, "created": 1491907626.0, "created_utc": 1491878826.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3pyld", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "madmaxime", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "&gt; We've talked before about her introducing me to her parents but she's continuously put it off or just vaguely said she'll do it eventually.\n\nAnd you've been fed this bullshit for 2 years? Mate move on. I don't think that's going to change so you either get over it, or get over her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;We&amp;#39;ve talked before about her introducing me to her parents but she&amp;#39;s continuously put it off or just vaguely said she&amp;#39;ll do it eventually.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And you&amp;#39;ve been fed this bullshit for 2 years? Mate move on. I don&amp;#39;t think that&amp;#39;s going to change so you either get over it, or get over her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3pyld", "score_hidden": false, "stickied": false, "created": 1491906827.0, "created_utc": 1491878027.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4733t", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Apocalypse487x", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think it would help to know where her family is from.  I have a similar situation with my family.  They don't know anything about my life anymore. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it would help to know where her family is from.  I have a similar situation with my family.  They don&amp;#39;t know anything about my life anymore. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4733t", "score_hidden": false, "stickied": false, "created": 1491943390.0, "created_utc": 1491914590.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4ek13", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "cakeycakeycake", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If her dad doesn't know about you there's a reason. She may be escaping considerable abuse or being financially cut off during law school if they met you or knew about you.\n\nYou don't have to stick around if that upsets you enough, I'm just guessing she has a very good reason, particularly if her dad doesn't even know she has a boyfriend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If her dad doesn&amp;#39;t know about you there&amp;#39;s a reason. She may be escaping considerable abuse or being financially cut off during law school if they met you or knew about you.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to stick around if that upsets you enough, I&amp;#39;m just guessing she has a very good reason, particularly if her dad doesn&amp;#39;t even know she has a boyfriend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ek13", "score_hidden": false, "stickied": false, "created": 1491953038.0, "created_utc": 1491924238.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4fapj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "6ickle", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've always been the same way. I am reluctant to introduce people to my family because they ask too many questions and would get all up in my life. I want to avoid that as long as possible. I've always joked that my family wouldn't meet anyone I marry until I actually am getting married. I guess I don't have a very normal perspective on this. \n\nWhen is the standard time you are supposed to introduce your bf/gf to your family?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always been the same way. I am reluctant to introduce people to my family because they ask too many questions and would get all up in my life. I want to avoid that as long as possible. I&amp;#39;ve always joked that my family wouldn&amp;#39;t meet anyone I marry until I actually am getting married. I guess I don&amp;#39;t have a very normal perspective on this. &lt;/p&gt;\n\n&lt;p&gt;When is the standard time you are supposed to introduce your bf/gf to your family?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4fapj", "score_hidden": false, "stickied": false, "created": 1491953862.0, "created_utc": 1491925062.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3wyn9", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "IvainFirelord", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think your feelings here are completely justified, and the biggest issue for me is that it seems you've shared those (completely justified) feelings and apparently she doesn't care. That, to me, is a huge problem. You're in the right, she's being dishonest with her father, and you're the one left wondering why your girlfriend doesn't care to have you at her graduation. I don't know how your argument went, but either you need to get a reason from her that you find satisfactory enough that you feel okay about the situation, or you need to work out between the two of you exactly when she comes clean about your relationship. Hopefully before graduation. Otherwise, reevaluate. Why would she be unwilling to give you a good reason or work out a timeline for coming clean from her own little web of lies? Probably nothing good.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your feelings here are completely justified, and the biggest issue for me is that it seems you&amp;#39;ve shared those (completely justified) feelings and apparently she doesn&amp;#39;t care. That, to me, is a huge problem. You&amp;#39;re in the right, she&amp;#39;s being dishonest with her father, and you&amp;#39;re the one left wondering why your girlfriend doesn&amp;#39;t care to have you at her graduation. I don&amp;#39;t know how your argument went, but either you need to get a reason from her that you find satisfactory enough that you feel okay about the situation, or you need to work out between the two of you exactly when she comes clean about your relationship. Hopefully before graduation. Otherwise, reevaluate. Why would she be unwilling to give you a good reason or work out a timeline for coming clean from her own little web of lies? Probably nothing good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3wyn9", "score_hidden": false, "stickied": false, "created": 1491917670.0, "created_utc": 1491888870.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg48sm1", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Mirage_III", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She doesn't want to marry you but likes to have a boyfriend. When she finds someone she's ready to marry, she's going to leave you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She doesn&amp;#39;t want to marry you but likes to have a boyfriend. When she finds someone she&amp;#39;s ready to marry, she&amp;#39;s going to leave you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48sm1", "score_hidden": false, "stickied": false, "created": 1491945995.0, "created_utc": 1491917195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3z4v4", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "xPawreen", "parent_id": "t1_dg3y6ld", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "But generally asian parents are much stricter on daughters than sons. Thats just how the culture is sometimes. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But generally asian parents are much stricter on daughters than sons. Thats just how the culture is sometimes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3z4v4", "score_hidden": false, "stickied": false, "created": 1491922692.0, "created_utc": 1491893892.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3y6ld", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3y6ld", "score_hidden": false, "stickied": false, "created": 1491920349.0, "created_utc": 1491891549.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg49qnc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "smartmoron", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She might just be embarrassed by her parents and doesn't want you to meet them as she might think you'd think less of her if you'd meet them. I love my parents but I try to limit my friends contact to them (especially my father) because I hate how they behave around my friends and especially my female friends. Whenever I would have a girl over/they see me with a girl they assume she's my gf or my dad makes inappropriate comments (wow shes got some big assets) and I hate talking about that stuff with them. Might be the same issue and I 100% understand her. Now I'm not in a relationship and you guys are 2 years in.. she probably has some bigger problems with her parents than I do with mine and I think you should respect that BUT talking to her about WHY she doesn't want you to meet them doesn't seem wrong to me. If she doesn't want you to meet her parents I think you should just wait until she's comfortable with you meeting them. Good luck with your relationship! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She might just be embarrassed by her parents and doesn&amp;#39;t want you to meet them as she might think you&amp;#39;d think less of her if you&amp;#39;d meet them. I love my parents but I try to limit my friends contact to them (especially my father) because I hate how they behave around my friends and especially my female friends. Whenever I would have a girl over/they see me with a girl they assume she&amp;#39;s my gf or my dad makes inappropriate comments (wow shes got some big assets) and I hate talking about that stuff with them. Might be the same issue and I 100% understand her. Now I&amp;#39;m not in a relationship and you guys are 2 years in.. she probably has some bigger problems with her parents than I do with mine and I think you should respect that BUT talking to her about WHY she doesn&amp;#39;t want you to meet them doesn&amp;#39;t seem wrong to me. If she doesn&amp;#39;t want you to meet her parents I think you should just wait until she&amp;#39;s comfortable with you meeting them. Good luck with your relationship! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg49qnc", "score_hidden": false, "stickied": false, "created": 1491947276.0, "created_utc": 1491918476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4leal", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Spadoni9320", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was just like your girlfriend. I stayed at my boyfriend's house every weekend, went with him to every family(his family) event, and dated him for over three years. It's most likely she is protecting the relationship from her parents. Before I went no contact with my mother, I had to be very careful because she wanted me to break up with every guy I dated, and embarrased me in front of them, if I introduced them. It could be an apportunity to show support, and communicate better. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was just like your girlfriend. I stayed at my boyfriend&amp;#39;s house every weekend, went with him to every family(his family) event, and dated him for over three years. It&amp;#39;s most likely she is protecting the relationship from her parents. Before I went no contact with my mother, I had to be very careful because she wanted me to break up with every guy I dated, and embarrased me in front of them, if I introduced them. It could be an apportunity to show support, and communicate better. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4leal", "score_hidden": false, "stickied": false, "created": 1491960541.0, "created_utc": 1491931741.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4w2pp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "GoldEyes10", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Honestly the question that could open a lot of doors would be \"have you told your parents we're dating\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly the question that could open a lot of doors would be &amp;quot;have you told your parents we&amp;#39;re dating&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4w2pp", "score_hidden": false, "stickied": false, "created": 1491972173.0, "created_utc": 1491943373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4wsu7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Tired_as_Fuck_", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Her dad thinks she's going to a female friend's house\n\nAfter two years and at 25 years old? And as someone who is becoming a lawyer? ... Is she Asian? \n\nSome cultures have expectations that a super weird to us and sometimes wander into abuse territory. You see a lot of it on /r/Asianparentstories. \n\nIf she's western/white then I'd be concerned that her dad is abusive or that she's taking her *other* boyfriend. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Her dad thinks she&amp;#39;s going to a female friend&amp;#39;s house&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;After two years and at 25 years old? And as someone who is becoming a lawyer? ... Is she Asian? &lt;/p&gt;\n\n&lt;p&gt;Some cultures have expectations that a super weird to us and sometimes wander into abuse territory. You see a lot of it on &lt;a href=\"/r/Asianparentstories\"&gt;/r/Asianparentstories&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;If she&amp;#39;s western/white then I&amp;#39;d be concerned that her dad is abusive or that she&amp;#39;s taking her &lt;em&gt;other&lt;/em&gt; boyfriend. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4wsu7", "score_hidden": false, "stickied": false, "created": 1491972995.0, "created_utc": 1491944195.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3sbeu", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "iSoReddit", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Based on the title and this\n\n&gt; My girlfriend and I have been dating about two years and haven't had any major problems. Our relationship is really good/solid.\n\nI'd say you're a bit delusional. Not having been introduced to her family in 2 years of dating is a HUGE problem and Indicative of a not good/solid relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Based on the title and this&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My girlfriend and I have been dating about two years and haven&amp;#39;t had any major problems. Our relationship is really good/solid.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;d say you&amp;#39;re a bit delusional. Not having been introduced to her family in 2 years of dating is a HUGE problem and Indicative of a not good/solid relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3sbeu", "score_hidden": false, "stickied": false, "created": 1491909892.0, "created_utc": 1491881092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg44fhq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "jp0pz", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": " It's like a scapegoat for her and is unhealthy for the relationship between you two could be an angle for manipulation on her part. If she does similar things with anyone else I would run for the hills. If she's not actively discussing and working on progressing through this with you it's a huge issue also that is an insane request to make of someone in the first place. If they are so bad that you can't be around them then she shouldn't be either. If you think she's a narcissist leave her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s like a scapegoat for her and is unhealthy for the relationship between you two could be an angle for manipulation on her part. If she does similar things with anyone else I would run for the hills. If she&amp;#39;s not actively discussing and working on progressing through this with you it&amp;#39;s a huge issue also that is an insane request to make of someone in the first place. If they are so bad that you can&amp;#39;t be around them then she shouldn&amp;#39;t be either. If you think she&amp;#39;s a narcissist leave her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg44fhq", "score_hidden": false, "stickied": false, "created": 1491938146.0, "created_utc": 1491909346.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4ai4u", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "zepelino", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't like this\n\nIf my GF live with a terrible family, I want to know that and help her\n\nWhen I graduated, my parents were divorcing and fighting all the time. THEY were not invited, while my girlfriend was. I was just 21 y.o. and I already had that boundaries very well clarified", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t like this&lt;/p&gt;\n\n&lt;p&gt;If my GF live with a terrible family, I want to know that and help her&lt;/p&gt;\n\n&lt;p&gt;When I graduated, my parents were divorcing and fighting all the time. THEY were not invited, while my girlfriend was. I was just 21 y.o. and I already had that boundaries very well clarified&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ai4u", "score_hidden": false, "stickied": false, "created": 1491948271.0, "created_utc": 1491919471.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3pzi8", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "lalalaurrenn", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "This is pretty unacceptable. She either needs to give you a good reason why you can't meet her family (I can't think of one), or she needs to introduce you. It's totally disrespectful to allow her father to believe you don't exist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is pretty unacceptable. She either needs to give you a good reason why you can&amp;#39;t meet her family (I can&amp;#39;t think of one), or she needs to introduce you. It&amp;#39;s totally disrespectful to allow her father to believe you don&amp;#39;t exist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3pzi8", "score_hidden": false, "stickied": false, "created": 1491906858.0, "created_utc": 1491878058.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4cdhv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "YungPootieTang", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Meanwhile I am very close with my family. I currently live at home, as do my adult siblings\n\nTwo thoughts.....\n\n\n1) She could be hiding her family from you... at least the way you described them.\n\n2) She literally could be hiding you... maybe she likes you but isn't necessarily \"proud\" of you? I hate putting it that way. I hope this is not sensitive, but I have to ask.... why are you living at home at 26? Also, why are *all* your adult siblings still living at home...? \n\n\nThe **only** reason I ask is because it *could* be necessary for some reason, or you could not exactly be reaching for the stars. Her family sounds a little shaky, and it very well may be scenario 1, but I really can't write off Scenario 2 unless I have a better idea of why you might be living with your parents and all your adult siblings at 26.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Meanwhile I am very close with my family. I currently live at home, as do my adult siblings&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Two thoughts.....&lt;/p&gt;\n\n&lt;p&gt;1) She could be hiding her family from you... at least the way you described them.&lt;/p&gt;\n\n&lt;p&gt;2) She literally could be hiding you... maybe she likes you but isn&amp;#39;t necessarily &amp;quot;proud&amp;quot; of you? I hate putting it that way. I hope this is not sensitive, but I have to ask.... why are you living at home at 26? Also, why are &lt;em&gt;all&lt;/em&gt; your adult siblings still living at home...? &lt;/p&gt;\n\n&lt;p&gt;The &lt;strong&gt;only&lt;/strong&gt; reason I ask is because it &lt;em&gt;could&lt;/em&gt; be necessary for some reason, or you could not exactly be reaching for the stars. Her family sounds a little shaky, and it very well may be scenario 1, but I really can&amp;#39;t write off Scenario 2 unless I have a better idea of why you might be living with your parents and all your adult siblings at 26.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4cdhv", "score_hidden": false, "stickied": false, "created": 1491950563.0, "created_utc": 1491921763.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg40ffq", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "maps2001", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "This is not going to end well for you op.A woman that can completely detach her personal life from her family life like she can is not good marriage material.She will drop you like a hot stone as soon as a better option comes along and she doesn't want to have to introduce any man to her family that she has no long term plans with.She has made it clear to you that she doesn't see any future with you so take her at her word.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is not going to end well for you op.A woman that can completely detach her personal life from her family life like she can is not good marriage material.She will drop you like a hot stone as soon as a better option comes along and she doesn&amp;#39;t want to have to introduce any man to her family that she has no long term plans with.She has made it clear to you that she doesn&amp;#39;t see any future with you so take her at her word.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg40ffq", "score_hidden": false, "stickied": false, "created": 1491926288.0, "created_utc": 1491897488.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg40mxc", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "AmidstTheCrowd", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Have you tried asking \"why don't you want your family to know I exist?\"\n\nThat would be a good place to start.  Also need to consider the possibility you are the \"other man\".", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you tried asking &amp;quot;why don&amp;#39;t you want your family to know I exist?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That would be a good place to start.  Also need to consider the possibility you are the &amp;quot;other man&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg40mxc", "score_hidden": false, "stickied": false, "created": 1491926909.0, "created_utc": 1491898109.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg47s7s", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "RockyClub", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Something just sounds fishy though. Just talk to her and tell her how she makes you feel...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Something just sounds fishy though. Just talk to her and tell her how she makes you feel...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47s7s", "score_hidden": false, "stickied": false, "created": 1491944493.0, "created_utc": 1491915693.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg48sa2", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "SurelyGoing2Hell", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Regardless of whether she is protecting you from her parents, or herself from her parents, or any other reason, I think enough time has passed to expect her to have the backbone to introduce you to her parents and to be prepared to have your back if there are any issues.\n\nThis may be harsh, but if she's not willing to be openly dating you, I'd dump her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Regardless of whether she is protecting you from her parents, or herself from her parents, or any other reason, I think enough time has passed to expect her to have the backbone to introduce you to her parents and to be prepared to have your back if there are any issues.&lt;/p&gt;\n\n&lt;p&gt;This may be harsh, but if she&amp;#39;s not willing to be openly dating you, I&amp;#39;d dump her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48sa2", "score_hidden": false, "stickied": false, "created": 1491945983.0, "created_utc": 1491917183.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg3y21u", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "proudneanderthal", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I read the post and all your comments, and I'd say just about **any** option is just as likely as another, which means there are way more scenarios where she ends things then they those where she stays with you.  \n\nShe's offering no reasonable explanation, or assurance that she'll stick around.  If you stay with her you need to take it on faith, and also be prepared for her to just dump you out of the blue, no warning, no discussions, just **boom** it's over.    Don't expect and explanation, or an apology.  If you can live with these expectations then stay with her and stop questioning things.  However if you can't accept those terms then you need to have a very serious discussion with her about the fact that her requirements don't match up with your expectations.    You won't be giving her an ultimatum, anymore than she give you one when she tells you that you can't participate with her family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I read the post and all your comments, and I&amp;#39;d say just about &lt;strong&gt;any&lt;/strong&gt; option is just as likely as another, which means there are way more scenarios where she ends things then they those where she stays with you.  &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s offering no reasonable explanation, or assurance that she&amp;#39;ll stick around.  If you stay with her you need to take it on faith, and also be prepared for her to just dump you out of the blue, no warning, no discussions, just &lt;strong&gt;boom&lt;/strong&gt; it&amp;#39;s over.    Don&amp;#39;t expect and explanation, or an apology.  If you can live with these expectations then stay with her and stop questioning things.  However if you can&amp;#39;t accept those terms then you need to have a very serious discussion with her about the fact that her requirements don&amp;#39;t match up with your expectations.    You won&amp;#39;t be giving her an ultimatum, anymore than she give you one when she tells you that you can&amp;#39;t participate with her family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3y21u", "score_hidden": false, "stickied": false, "created": 1491920061.0, "created_utc": 1491891261.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64o5m0", "likes": null, "replies": "", "user_reports": [], "id": "dg4q16g", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ShyPear", "parent_id": "t1_dg43cz3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you meant hopefully it's NOT the latter, right?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you meant hopefully it&amp;#39;s NOT the latter, right?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4q16g", "score_hidden": false, "stickied": false, "created": 1491965598.0, "created_utc": 1491936798.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43cz3", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "The-Jesus_Christ", "parent_id": "t3_64o5m0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Either she has a really fucked up family or she's in a relationship with somebody else for longer than with you. Hopefully it's the latter but she needs to be completely honest with you as this relationship can't last if it continues this way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Either she has a really fucked up family or she&amp;#39;s in a relationship with somebody else for longer than with you. Hopefully it&amp;#39;s the latter but she needs to be completely honest with you as this relationship can&amp;#39;t last if it continues this way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg43cz3", "score_hidden": false, "stickied": false, "created": 1491935355.0, "created_utc": 1491906555.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}]