[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m hoping to get some feedback on how big of a red flag this is, and what we can do as a couple to overcome this. &lt;/p&gt;\n\n&lt;p&gt;I have been dating my boyfriend for a little over a year. A few months ago I started to notice a pattern: when something goes wrong, he blames me. Small things. Sometimes they are no ones fault (miscommunications), sometimes they are his fault. I am not coming her to say I never do anything wrong, but the problem I am writing about is specifically times when I do not feel I can or should be yelled at.&lt;/p&gt;\n\n&lt;p&gt;Example one: when my boyfriend was getting used to driving my car he would always turn the lights on out of habit. When he would park the car and turn it off it would ding at him because the lights were on. For probably the first 5-10 times this happened he would say &amp;quot;why did you leave your lights on?&amp;quot;. He would say this in a snappy way. OK so obviously I didn&amp;#39;t leave the lights on if they lights weren&amp;#39;t on in the garage when he got in the car to drive, and I think he would notice if I reached across him while he was driving (and why on early would I do that?). This happened enough times where I started realizing what was going on and pointing out to him that his first reaction when something &amp;quot;goes wrong&amp;quot; is to blame someone, and since I&amp;#39;m the one that&amp;#39;s around he blames me. Very small, very low stress example but this is where I started noticing the pattern.&lt;/p&gt;\n\n&lt;p&gt;Example two: he got glasses recently, and they are black. He was staying at my place the first week he had them, and was on the side of the bed I usually sleep on. He took his glasses off and set them on a black catch-all tray I keep on my end table, for my rings, phone, etc when I go to bed. I did not see him do this, I do not have glasses and am not used to checking places for glasses. His black glasses blended in with the black tray. It was dark in the room and we were getting ready for bed, I took my rings off and dropped them on the tray. They didn&amp;#39;t scratch his glasses but he got very upset with me, he didn&amp;#39;t scream but he raised his voice and gave me a lecture on being careful with his glasses. He was very annoyed with me and I felt like he was condescending. I thought about it for a while and his reaction bothered me enough I had a conversation with him about it - that I understand the reason he yelled was because it would be costly if his glasses were damaged but it wasn&amp;#39;t right to yell at me and pin blame on me for not looking for glasses when a) I don&amp;#39;t wear glasses and I&amp;#39;m not used to looking for them since he just started wearing them, and b) he set them on something they blended into and he would know I use it to hold things that could scratch glasses. I told him I was sorry and I would be more careful but I needed him to understand that in small mistake situations he can&amp;#39;t let his anger intensify based on the dollar cost of a potential outcome. I wanted him to distinguish between the actual mistake made and the appropriate response to that mistake (setting something down without looking) as opposed to getting very angry because his $400 glasses were in a precarious situation.&lt;/p&gt;\n\n&lt;p&gt;It seems so silly writing out that scenario, but something about how mad he got really bothered me. In my gut I just felt it was wrong and I needed to address it. I don&amp;#39;t like to &amp;quot;have a talk&amp;quot; about every little thing that happens, but his reaction stuck with me for hours so I brought it up. &lt;/p&gt;\n\n&lt;p&gt;Example three: Google Maps. When I drive and use Google Maps, I like to hold the phone myself. I can skim the upcoming directions, and for me it is just easier to read it myself. He prefers to have me hold the phone and give him directions while he drives, and at first I did not mind playing co-pilot. I&amp;#39;d usually give him a quick summary of the next several steps, and then tell him as the steps are coming up. If I don&amp;#39;t say a step at the right time, or I tell him something and we start talking about something else and he misses a turn or an exit, he blames me. I am not good at giving directions, or I should have told him to exit. I always hold the phone in such a manner that we can both see the navigation screen, and I feel like this is a situation where we are both at fault. He is just as capable of seeing exit 20 as I am, but we were both caught up in conversation etc, why is it my fault that he missed the exit? Why is it not both of our faults, or neither?  Why isn&amp;#39;t it just a thing that happens and we take the next exit and move on with life?\nSometimes this is not a big ordeal and other times it really escalates. Again, it is usually tied to the outcome - he gets much more angry if he misses an exit than an optional turn, etc. I don&amp;#39;t think I&amp;#39;m any better or worse at reading directions off a screen than the next person. It has happened so many times that I noticed I start to get really tense and panicky if a direction comes up that is happening soon (.2 mile or something like that) because I&amp;#39;m afraid he&amp;#39;ll miss it and get mad at me. After I noticed this reaction in myself, the next time it happened I told him I was done being copilot. He said that&amp;#39;s fine just let google speak the directions and he&amp;#39;ll get there just fine. Of course immediately after he has said google can direct him better than me, he&amp;#39;s asking me &amp;quot;when&amp;#39;s my next turn?&amp;quot; And not waiting for Google to speak the direction. I have hit my wall and told him I&amp;#39;m not doing this anymore he can wait for google to tell him and blame the google developers if he misses a turn. We laugh about it but I also feel it&amp;#39;s a little ridiculous, and avoidance isn&amp;#39;t the best way to deal with problems but I can&amp;#39;t handle being the berated navigator anymore. &lt;/p&gt;\n\n&lt;p&gt;Current scenario: yesterday we went to brunch with another couple. There was a wait so myself and the other girl went to the bar to get drinks while our SOs waited on the patio. In my state they are very strict at all bars about having an ID per drink - one person cannot buy a round, you always have to show all IDs. We have come to expect this so I asked for his ID, bought our drinks, and returned. He wanted coffee and a drink, plus my drink my hands were quite full. I put our IDs in my wallet, put my wallet in my purse, and brought our drinks outside to where the boys were. &lt;/p&gt;\n\n&lt;p&gt;Today, he left for a business trip. He travels a lot for work and uses a service that takes your bio signs and lets you cut the travel lines. They do not require an ID and he didn&amp;#39;t realize he didn&amp;#39;t have it until he&amp;#39;d spent a full day partaking in Opening Day celebrations (he didn&amp;#39;t work today - took his trip a day early because he loves baseball) and was going to pick up his rental car and drive 1.5 hours to his destination in the suburbs. He texted me on the way to say he didn&amp;#39;t have his ID. My heart dropped because I knew this was going to be a big inconvenience for him and he was probably going to be mad at me. I tried to make up for it by quickly finding the ID, sending pictures of it he asked for, and researching online what can be done if you need a rental car and don&amp;#39;t have an ID (no shock here - not much).  They wouldn&amp;#39;t give him a rental and he called me and totally unleashed. He was yelling about why did I have his ID, why didn&amp;#39;t I give it back, this is all my fault etc. a lot of yelling. At first I was calm and I reminded him why I had it and apologized for not giving it back but we both forgot, it was a small oversight with large unintended consequences. He was so mad, saying I was brushing this off because I was warm at home and he was stuck in the airport. I told him I wasn&amp;#39;t brushing it off and I know he must be so frustrated and I was giving suggestions (...get an uber, stay someplace closer, etc) but he was not having it. He kept directing the conversation back to how this was my fault and I had no idea how mad he was. I was not going to let him mow me over - I felt like a jerk arguing with him while he&amp;#39;s stuck at the airport (not really stuck, he&amp;#39;s mainly mad that it will cost a lot more to use uber for 4 days instead of a rental) but I also think that because this is such a pattern I need to address these reactions as they happen. He was even angrier at the general concept that I would be the one upset in this situation at all. He kept yelling and yelling and I told him I was not going to stay on the phone and be yelled at so I was hanging up, love you, talk to you tomorrow. &lt;/p&gt;\n\n&lt;p&gt;He called me back almost immediately and started off more calm, and said the ID was his fault. I told him that&amp;#39;s not my point, I forgot to give it back, he forgot to ask for it back, we&amp;#39;re both to blame but the point is blaming doesn&amp;#39;t change the situation he&amp;#39;s in at all and we need to be solution oriented. I asked if he understood why I was upset but he got mad again. It was 10 bipolar minutes of him saying it was his fault, then my fault - completely missing my point. It was a mutual oversight with shitty consequences but he&amp;#39;s directing his anger over those shitty consequences entirely at me and I&amp;#39;m not going to take it. I ended up having to hang up on him again because he was yelling and not listening and we were getting nowhere. This is not a common occurrence for us - I think I&amp;#39;ve only hung up on him one other time before (which now that I think of it was an example of him being angry about circumstances out of our control and directing it at me, but this post has gotten too long and I&amp;#39;m too tired to add it now) and I didn&amp;#39;t hang up for dramatic effect or anything - he was just talking so aggressively and I couldn&amp;#39;t handle sitting there continuing to let him yell at me so I said I love you and I hope you think this over tonight and we can talk about it tomorrow and hung up. He called me again before he went to bed and was much nicer, apologized a lot (seemed more genuine this time) and I apologized for not being more supportive while he was in a stressful situation but I need him to understand no matter how great the stress he can&amp;#39;t treat me this way. I told him I really appreciated his apology but I also want him to work towards being more self aware and not flipping out on me whenever he&amp;#39;s upset in the first place.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr: boyfriend sometimes lashes out at me when I do little things wrong or things generally aren&amp;#39;t going his way. He always apologizes when I talk to him about it but it&amp;#39;s gotten to the point where I feel very panicked when something inconvenient happens to him because I feel he will be mad at me. I try to address the problem each time it happens as part of the larger pattern but I don&amp;#39;t know if my approach is appropriate, especially when he&amp;#39;s angry because he&amp;#39;s in a frustrating situations and I&amp;#39;m making it about me and my feelings of frustration. I&amp;#39;m not sure how to sympathize with him while also being clear that I will not be a scapegoat just because he&amp;#39;s frustrated. &lt;/p&gt;\n\n&lt;p&gt;I also want to add that while tonight was really trying, we do love each other a lot and generally have a very stable and happy relationship. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm hoping to get some feedback on how big of a red flag this is, and what we can do as a couple to overcome this. \n\nI have been dating my boyfriend for a little over a year. A few months ago I started to notice a pattern: when something goes wrong, he blames me. Small things. Sometimes they are no ones fault (miscommunications), sometimes they are his fault. I am not coming her to say I never do anything wrong, but the problem I am writing about is specifically times when I do not feel I can or should be yelled at.\n\nExample one: when my boyfriend was getting used to driving my car he would always turn the lights on out of habit. When he would park the car and turn it off it would ding at him because the lights were on. For probably the first 5-10 times this happened he would say \"why did you leave your lights on?\". He would say this in a snappy way. OK so obviously I didn't leave the lights on if they lights weren't on in the garage when he got in the car to drive, and I think he would notice if I reached across him while he was driving (and why on early would I do that?). This happened enough times where I started realizing what was going on and pointing out to him that his first reaction when something \"goes wrong\" is to blame someone, and since I'm the one that's around he blames me. Very small, very low stress example but this is where I started noticing the pattern.\n\nExample two: he got glasses recently, and they are black. He was staying at my place the first week he had them, and was on the side of the bed I usually sleep on. He took his glasses off and set them on a black catch-all tray I keep on my end table, for my rings, phone, etc when I go to bed. I did not see him do this, I do not have glasses and am not used to checking places for glasses. His black glasses blended in with the black tray. It was dark in the room and we were getting ready for bed, I took my rings off and dropped them on the tray. They didn't scratch his glasses but he got very upset with me, he didn't scream but he raised his voice and gave me a lecture on being careful with his glasses. He was very annoyed with me and I felt like he was condescending. I thought about it for a while and his reaction bothered me enough I had a conversation with him about it - that I understand the reason he yelled was because it would be costly if his glasses were damaged but it wasn't right to yell at me and pin blame on me for not looking for glasses when a) I don't wear glasses and I'm not used to looking for them since he just started wearing them, and b) he set them on something they blended into and he would know I use it to hold things that could scratch glasses. I told him I was sorry and I would be more careful but I needed him to understand that in small mistake situations he can't let his anger intensify based on the dollar cost of a potential outcome. I wanted him to distinguish between the actual mistake made and the appropriate response to that mistake (setting something down without looking) as opposed to getting very angry because his $400 glasses were in a precarious situation.\n\nIt seems so silly writing out that scenario, but something about how mad he got really bothered me. In my gut I just felt it was wrong and I needed to address it. I don't like to \"have a talk\" about every little thing that happens, but his reaction stuck with me for hours so I brought it up. \n\nExample three: Google Maps. When I drive and use Google Maps, I like to hold the phone myself. I can skim the upcoming directions, and for me it is just easier to read it myself. He prefers to have me hold the phone and give him directions while he drives, and at first I did not mind playing co-pilot. I'd usually give him a quick summary of the next several steps, and then tell him as the steps are coming up. If I don't say a step at the right time, or I tell him something and we start talking about something else and he misses a turn or an exit, he blames me. I am not good at giving directions, or I should have told him to exit. I always hold the phone in such a manner that we can both see the navigation screen, and I feel like this is a situation where we are both at fault. He is just as capable of seeing exit 20 as I am, but we were both caught up in conversation etc, why is it my fault that he missed the exit? Why is it not both of our faults, or neither?  Why isn't it just a thing that happens and we take the next exit and move on with life?\nSometimes this is not a big ordeal and other times it really escalates. Again, it is usually tied to the outcome - he gets much more angry if he misses an exit than an optional turn, etc. I don't think I'm any better or worse at reading directions off a screen than the next person. It has happened so many times that I noticed I start to get really tense and panicky if a direction comes up that is happening soon (.2 mile or something like that) because I'm afraid he'll miss it and get mad at me. After I noticed this reaction in myself, the next time it happened I told him I was done being copilot. He said that's fine just let google speak the directions and he'll get there just fine. Of course immediately after he has said google can direct him better than me, he's asking me \"when's my next turn?\" And not waiting for Google to speak the direction. I have hit my wall and told him I'm not doing this anymore he can wait for google to tell him and blame the google developers if he misses a turn. We laugh about it but I also feel it's a little ridiculous, and avoidance isn't the best way to deal with problems but I can't handle being the berated navigator anymore. \n\nCurrent scenario: yesterday we went to brunch with another couple. There was a wait so myself and the other girl went to the bar to get drinks while our SOs waited on the patio. In my state they are very strict at all bars about having an ID per drink - one person cannot buy a round, you always have to show all IDs. We have come to expect this so I asked for his ID, bought our drinks, and returned. He wanted coffee and a drink, plus my drink my hands were quite full. I put our IDs in my wallet, put my wallet in my purse, and brought our drinks outside to where the boys were. \n\nToday, he left for a business trip. He travels a lot for work and uses a service that takes your bio signs and lets you cut the travel lines. They do not require an ID and he didn't realize he didn't have it until he'd spent a full day partaking in Opening Day celebrations (he didn't work today - took his trip a day early because he loves baseball) and was going to pick up his rental car and drive 1.5 hours to his destination in the suburbs. He texted me on the way to say he didn't have his ID. My heart dropped because I knew this was going to be a big inconvenience for him and he was probably going to be mad at me. I tried to make up for it by quickly finding the ID, sending pictures of it he asked for, and researching online what can be done if you need a rental car and don't have an ID (no shock here - not much).  They wouldn't give him a rental and he called me and totally unleashed. He was yelling about why did I have his ID, why didn't I give it back, this is all my fault etc. a lot of yelling. At first I was calm and I reminded him why I had it and apologized for not giving it back but we both forgot, it was a small oversight with large unintended consequences. He was so mad, saying I was brushing this off because I was warm at home and he was stuck in the airport. I told him I wasn't brushing it off and I know he must be so frustrated and I was giving suggestions (...get an uber, stay someplace closer, etc) but he was not having it. He kept directing the conversation back to how this was my fault and I had no idea how mad he was. I was not going to let him mow me over - I felt like a jerk arguing with him while he's stuck at the airport (not really stuck, he's mainly mad that it will cost a lot more to use uber for 4 days instead of a rental) but I also think that because this is such a pattern I need to address these reactions as they happen. He was even angrier at the general concept that I would be the one upset in this situation at all. He kept yelling and yelling and I told him I was not going to stay on the phone and be yelled at so I was hanging up, love you, talk to you tomorrow. \n\nHe called me back almost immediately and started off more calm, and said the ID was his fault. I told him that's not my point, I forgot to give it back, he forgot to ask for it back, we're both to blame but the point is blaming doesn't change the situation he's in at all and we need to be solution oriented. I asked if he understood why I was upset but he got mad again. It was 10 bipolar minutes of him saying it was his fault, then my fault - completely missing my point. It was a mutual oversight with shitty consequences but he's directing his anger over those shitty consequences entirely at me and I'm not going to take it. I ended up having to hang up on him again because he was yelling and not listening and we were getting nowhere. This is not a common occurrence for us - I think I've only hung up on him one other time before (which now that I think of it was an example of him being angry about circumstances out of our control and directing it at me, but this post has gotten too long and I'm too tired to add it now) and I didn't hang up for dramatic effect or anything - he was just talking so aggressively and I couldn't handle sitting there continuing to let him yell at me so I said I love you and I hope you think this over tonight and we can talk about it tomorrow and hung up. He called me again before he went to bed and was much nicer, apologized a lot (seemed more genuine this time) and I apologized for not being more supportive while he was in a stressful situation but I need him to understand no matter how great the stress he can't treat me this way. I told him I really appreciated his apology but I also want him to work towards being more self aware and not flipping out on me whenever he's upset in the first place.\n\n\nTl;dr: boyfriend sometimes lashes out at me when I do little things wrong or things generally aren't going his way. He always apologizes when I talk to him about it but it's gotten to the point where I feel very panicked when something inconvenient happens to him because I feel he will be mad at me. I try to address the problem each time it happens as part of the larger pattern but I don't know if my approach is appropriate, especially when he's angry because he's in a frustrating situations and I'm making it about me and my feelings of frustration. I'm not sure how to sympathize with him while also being clear that I will not be a scapegoat just because he's frustrated. \n\nI also want to add that while tonight was really trying, we do love each other a lot and generally have a very stable and happy relationship. ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "64pcvk", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 191, "report_reasons": null, "author": "Beaches_Pineapples", "saved": false, "mod_reports": [], "name": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/64pcvk/when_things_go_wrong_my_27f_boyfriend_40m_blames/", "num_reports": null, "locked": false, "stickied": false, "created": 1491923529.0, "url": "https://www.reddit.com/r/relationships/comments/64pcvk/when_things_go_wrong_my_27f_boyfriend_40m_blames/", "author_flair_text": null, "quarantine": false, "title": "When things go wrong, my (27F) boyfriend (40M) blames me", "created_utc": 1491894729.0, "distinguished": null, "media": null, "upvote_ratio": 0.88, "num_comments": 88, "visited": false, "subreddit_type": "public", "ups": 191}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4zt3q", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "whatglasses5", "parent_id": "t1_dg4002d", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Seriously! He's forty damn years old and still places this much energy on finding fault in every situation - he's not changing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously! He&amp;#39;s forty damn years old and still places this much energy on finding fault in every situation - he&amp;#39;s not changing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4zt3q", "score_hidden": false, "stickied": false, "created": 1491976606.0, "created_utc": 1491947806.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4002d", "gilded": 0, "archived": false, "score": 669, "report_reasons": null, "author": "arpsazombie", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He's 40. Chances of him changing are very very low. I'd bet if you spoke to his ex's they'd have lots of stories about this same subject. \n\nStable and happy doesn't include berating and taking your frustration out on your partner to the point they are panicking about google directions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s 40. Chances of him changing are very very low. I&amp;#39;d bet if you spoke to his ex&amp;#39;s they&amp;#39;d have lots of stories about this same subject. &lt;/p&gt;\n\n&lt;p&gt;Stable and happy doesn&amp;#39;t include berating and taking your frustration out on your partner to the point they are panicking about google directions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4002d", "score_hidden": false, "stickied": false, "created": 1491925058.0, "created_utc": 1491896258.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 669}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4pg5w", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "black_rose_", "parent_id": "t1_dg4gz6f", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; he called me and totally unleashed. He was yelling ... He called me back almost immediately and started off more calm, and said the ID was his fault. \n\nSuch an obvious creepy cycle of abuse here. The yo-yo between terrifying and reassuring. I'm always on the breakup train for posts about abuse and oh my god OP don't wait for this guy to change... it's not going to happen, this is just his personality. Do you wanna get yelled at for random things the rest of your life? It's not worth it. Your mental health will degrade continuously as long as your'e with him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;he called me and totally unleashed. He was yelling ... He called me back almost immediately and started off more calm, and said the ID was his fault. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Such an obvious creepy cycle of abuse here. The yo-yo between terrifying and reassuring. I&amp;#39;m always on the breakup train for posts about abuse and oh my god OP don&amp;#39;t wait for this guy to change... it&amp;#39;s not going to happen, this is just his personality. Do you wanna get yelled at for random things the rest of your life? It&amp;#39;s not worth it. Your mental health will degrade continuously as long as your&amp;#39;e with him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4pg5w", "score_hidden": false, "stickied": false, "created": 1491964984.0, "created_utc": 1491936184.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 42}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4gz6f", "gilded": 0, "archived": false, "score": 69, "report_reasons": null, "author": "akireaxx", "parent_id": "t1_dg426td", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was walking on egg shells reading OPs story worried what was gonna happen next. I can't imagine dealing with her boyfriend. What an immature jerk! OP has great patience and communication skills, she deserves someone who will be respectful and loving like she is. He wants a doormat. :( Not okay.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was walking on egg shells reading OPs story worried what was gonna happen next. I can&amp;#39;t imagine dealing with her boyfriend. What an immature jerk! OP has great patience and communication skills, she deserves someone who will be respectful and loving like she is. He wants a doormat. :( Not okay.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4gz6f", "score_hidden": false, "stickied": false, "created": 1491955715.0, "created_utc": 1491926915.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 69}}], "after": null, "before": null}}, "user_reports": [], "id": "dg426td", "gilded": 0, "archived": false, "score": 170, "report_reasons": null, "author": "mrbetter", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "a lot of people are pointing out the age gap and how he probably can't get a girl his age because they won't tolerate any of this behavior, but i wanna also point out that your relationship seems to also have just gotten out of the honey moon phase right as these problems started popping up.\n\nhe was a perfect gentleman and on his best behavior during the honey moon phase because he wanted to charm you and get you dating him. now that you both are comfortable around each other and he doesn't have to be on his best behavior, he can drop the act. you're now seeing the real him, and i'm sure these were the same issues his exes had with him. ask yourself, if he showed you this side of him on that first date, would there be a second one?\n\nand honestly can i just say this dynamic is insanely unhealthy (also obviously could escalate as duration of the relationship grows). at the end of the day, you don't need to be sympathizing and sharing blame when someone is being an asshole to you, stop being a push over and trying to meet in the middle when he can't be assed to do that too, because instead of you meeting in the middle you're now meeting on his side. unhealthy one sided dynamic because you're worried about his anger issues and walking on eggshells around him. don't make his problems yours if he won't do that himself", "edited": 1491903447.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;a lot of people are pointing out the age gap and how he probably can&amp;#39;t get a girl his age because they won&amp;#39;t tolerate any of this behavior, but i wanna also point out that your relationship seems to also have just gotten out of the honey moon phase right as these problems started popping up.&lt;/p&gt;\n\n&lt;p&gt;he was a perfect gentleman and on his best behavior during the honey moon phase because he wanted to charm you and get you dating him. now that you both are comfortable around each other and he doesn&amp;#39;t have to be on his best behavior, he can drop the act. you&amp;#39;re now seeing the real him, and i&amp;#39;m sure these were the same issues his exes had with him. ask yourself, if he showed you this side of him on that first date, would there be a second one?&lt;/p&gt;\n\n&lt;p&gt;and honestly can i just say this dynamic is insanely unhealthy (also obviously could escalate as duration of the relationship grows). at the end of the day, you don&amp;#39;t need to be sympathizing and sharing blame when someone is being an asshole to you, stop being a push over and trying to meet in the middle when he can&amp;#39;t be assed to do that too, because instead of you meeting in the middle you&amp;#39;re now meeting on his side. unhealthy one sided dynamic because you&amp;#39;re worried about his anger issues and walking on eggshells around him. don&amp;#39;t make his problems yours if he won&amp;#39;t do that himself&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg426td", "score_hidden": false, "stickied": false, "created": 1491931710.0, "created_utc": 1491902910.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 170}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4pbly", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "black_rose_", "parent_id": "t1_dg4h58u", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, and OP is about the age where my self-respect kicked in too. I realized there was just no point in wasting time dating guys who didn't treat me with respect 100% of the time. Like, I am not friends with girls who treat me like shit all the time so why on earth would someone get a free pass to raise their voice at me just because we're dating...?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, and OP is about the age where my self-respect kicked in too. I realized there was just no point in wasting time dating guys who didn&amp;#39;t treat me with respect 100% of the time. Like, I am not friends with girls who treat me like shit all the time so why on earth would someone get a free pass to raise their voice at me just because we&amp;#39;re dating...?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4pbly", "score_hidden": false, "stickied": false, "created": 1491964847.0, "created_utc": 1491936047.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4h58u", "gilded": 0, "archived": false, "score": 81, "report_reasons": null, "author": "DesperateForADwarf", "parent_id": "t1_dg41isx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;I hate to bring up the age gap because it's always the first thing people jump on\n\nThere's a very good reason for that.  It's far, far more rare for two people over a decade apart in age to have enough in common to have a legitimate attraction beyond purely sexual.  It's far, far more common for the older party to have a reason they prefer younger partners (easier to steamroll, inexperienced enough to know what not to take, etc).\n\nPeople can hate the \"stereotype\" it all they want, but in most cases cases huge age gap is intended, not incidental. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I hate to bring up the age gap because it&amp;#39;s always the first thing people jump on&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There&amp;#39;s a very good reason for that.  It&amp;#39;s far, far more rare for two people over a decade apart in age to have enough in common to have a legitimate attraction beyond purely sexual.  It&amp;#39;s far, far more common for the older party to have a reason they prefer younger partners (easier to steamroll, inexperienced enough to know what not to take, etc).&lt;/p&gt;\n\n&lt;p&gt;People can hate the &amp;quot;stereotype&amp;quot; it all they want, but in most cases cases huge age gap is intended, not incidental. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4h58u", "score_hidden": false, "stickied": false, "created": 1491955902.0, "created_utc": 1491927102.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 81}}], "after": null, "before": null}}, "user_reports": [], "id": "dg41isx", "gilded": 0, "archived": false, "score": 355, "report_reasons": null, "author": "skwrtl", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I hate to bring up the age gap because it's always the first thing people jump on, but I see others already have so I might as well add my 2c. It seems like older controlling people often gravitate towards dating younger people who are easier to push around.\n\nP.S. get a GPS holder for your phone, that's not safe and can get you a ticket where I live", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hate to bring up the age gap because it&amp;#39;s always the first thing people jump on, but I see others already have so I might as well add my 2c. It seems like older controlling people often gravitate towards dating younger people who are easier to push around.&lt;/p&gt;\n\n&lt;p&gt;P.S. get a GPS holder for your phone, that&amp;#39;s not safe and can get you a ticket where I live&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg41isx", "score_hidden": false, "stickied": false, "created": 1491929622.0, "created_utc": 1491900822.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 355}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4om82", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "blueXcat", "parent_id": "t1_dg4mz9m", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yep, or I put mine on a little stand that I only check when I'm at a red light\n\nI still lave my hands to drive", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yep, or I put mine on a little stand that I only check when I&amp;#39;m at a red light&lt;/p&gt;\n\n&lt;p&gt;I still lave my hands to drive&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4om82", "score_hidden": false, "stickied": false, "created": 1491964077.0, "created_utc": 1491935277.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4mz9m", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "sweetterry", "parent_id": "t1_dg3zs1y", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yea no shit, doesn't google talk you through the exits anyway?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yea no shit, doesn&amp;#39;t google talk you through the exits anyway?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4mz9m", "score_hidden": false, "stickied": false, "created": 1491962267.0, "created_utc": 1491933467.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 25}}], "after": null, "before": null}}, "user_reports": [], "id": "dg3zs1y", "gilded": 0, "archived": false, "score": 360, "report_reasons": null, "author": "blueXcat", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There's no wonder he's dating women 13 years younger than him\n\nEven at 28, I wouldn't put up with this attitude, women his age even less\n\nAlso, don't hold your phone while driving", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no wonder he&amp;#39;s dating women 13 years younger than him&lt;/p&gt;\n\n&lt;p&gt;Even at 28, I wouldn&amp;#39;t put up with this attitude, women his age even less&lt;/p&gt;\n\n&lt;p&gt;Also, don&amp;#39;t hold your phone while driving&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3zs1y", "score_hidden": false, "stickied": false, "created": 1491924424.0, "created_utc": 1491895624.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 360}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg3zmhv", "gilded": 0, "archived": false, "score": 180, "report_reasons": null, "author": "airaqua", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your bf's behaviour isn't okay at all. Do you know why he can't get a woman his own age? No one would put up with this sort of stuff. They have enough self-respect to just dump him. Adults should be able to take on responsibility, they should work on themselves and not yell at others. When you talk about your bf, it sounds like he's a 15 year old.\n\nYou can't change your bf. If he doesn't realise that his behaviour is an issue and if he doesn't make an effort to improve, there's nothing you can do. Either you accept this and stay (not advised), or you leave and find someone who respects you and can communicate and argue in a healthy way. It's not healthy to walk on eggshells around your partner to avoid certain situations. You should be able to sit down and have normal communication without yelling etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your bf&amp;#39;s behaviour isn&amp;#39;t okay at all. Do you know why he can&amp;#39;t get a woman his own age? No one would put up with this sort of stuff. They have enough self-respect to just dump him. Adults should be able to take on responsibility, they should work on themselves and not yell at others. When you talk about your bf, it sounds like he&amp;#39;s a 15 year old.&lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t change your bf. If he doesn&amp;#39;t realise that his behaviour is an issue and if he doesn&amp;#39;t make an effort to improve, there&amp;#39;s nothing you can do. Either you accept this and stay (not advised), or you leave and find someone who respects you and can communicate and argue in a healthy way. It&amp;#39;s not healthy to walk on eggshells around your partner to avoid certain situations. You should be able to sit down and have normal communication without yelling etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3zmhv", "score_hidden": false, "stickied": false, "created": 1491924003.0, "created_utc": 1491895203.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 180}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4018k", "gilded": 0, "archived": false, "score": 69, "report_reasons": null, "author": "Putrid3ath", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You sound amazingly patient. \nHe sounds awful. My initial thought after reading this was \"fuck that\". Mainly because I have also dated someone like this who blamed me for everything and never wanted to hear if he was at fault. He was also abusive and yelled a lot so I really feel for you.\nI would suggest not putting up with this nonsense for much longer.\nSending hugs your way! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound amazingly patient. \nHe sounds awful. My initial thought after reading this was &amp;quot;fuck that&amp;quot;. Mainly because I have also dated someone like this who blamed me for everything and never wanted to hear if he was at fault. He was also abusive and yelled a lot so I really feel for you.\nI would suggest not putting up with this nonsense for much longer.\nSending hugs your way! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4018k", "score_hidden": false, "stickied": false, "created": 1491925149.0, "created_utc": 1491896349.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 69}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg47cdb", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "Salt-Pile", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So, what I am getting is that he refuses to take responsibility for his own actions. \n\nAny adult is responsible for his or her own identification. He is the one who owns it, he is the one who needs it, he is the one who suffers without it, therefore he is the one who should make sure he has it and that he retrieves it after lending it. Being angry that he failed to bring his id is completely natural, but seeking out someone else to blame and berate is not.\n\n&gt;I don't know if my approach is appropriate, especially when he's angry because he's in a frustrating situations and I'm making it about me and my feelings of frustration.\n\nIf anything, you're underreacting. It's completely unacceptable for him to treat you in this manner. You're a human being and he should respect you, not deliberately use you as a sort of emotional punching-bag on which to take out his frustrations at his own behaviour.\n\n*He* is the one who is making \"it\" about you. There are two separate issues here - how he feels, and how he treats you. How he treats you should not be up for negotiation depending on how he feels. Maintaining your boundaries and insisting on being treated appropriately is not re-focusing his problems on you, quite the opposite.\n\n&gt;I'm not sure how to sympathize with him while also being clear that I will not be a scapegoat just because he's frustrated. \n\nSympathy and engagement are for people who respect you and take responsibility for themselves. Whenever he stops doing those things, I think you're quite right to withdraw yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, what I am getting is that he refuses to take responsibility for his own actions. &lt;/p&gt;\n\n&lt;p&gt;Any adult is responsible for his or her own identification. He is the one who owns it, he is the one who needs it, he is the one who suffers without it, therefore he is the one who should make sure he has it and that he retrieves it after lending it. Being angry that he failed to bring his id is completely natural, but seeking out someone else to blame and berate is not.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t know if my approach is appropriate, especially when he&amp;#39;s angry because he&amp;#39;s in a frustrating situations and I&amp;#39;m making it about me and my feelings of frustration.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If anything, you&amp;#39;re underreacting. It&amp;#39;s completely unacceptable for him to treat you in this manner. You&amp;#39;re a human being and he should respect you, not deliberately use you as a sort of emotional punching-bag on which to take out his frustrations at his own behaviour.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;He&lt;/em&gt; is the one who is making &amp;quot;it&amp;quot; about you. There are two separate issues here - how he feels, and how he treats you. How he treats you should not be up for negotiation depending on how he feels. Maintaining your boundaries and insisting on being treated appropriately is not re-focusing his problems on you, quite the opposite.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m not sure how to sympathize with him while also being clear that I will not be a scapegoat just because he&amp;#39;s frustrated. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sympathy and engagement are for people who respect you and take responsibility for themselves. Whenever he stops doing those things, I think you&amp;#39;re quite right to withdraw yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47cdb", "score_hidden": false, "stickied": false, "created": 1491943799.0, "created_utc": 1491914999.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg47pdr", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "Whallywhaler", "parent_id": "t1_dg44mgm", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I would bet $ that past partners left when the berating turned truly verbally abusive and became public. This guys got a short fuse and zero emotional intelligence. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would bet $ that past partners left when the berating turned truly verbally abusive and became public. This guys got a short fuse and zero emotional intelligence. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47pdr", "score_hidden": false, "stickied": false, "created": 1491944367.0, "created_utc": 1491915567.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44mgm", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg44mgm", "score_hidden": false, "stickied": false, "created": 1491938601.0, "created_utc": 1491909801.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg40nfx", "gilded": 0, "archived": false, "score": 84, "report_reasons": null, "author": "BlueWaterGirl", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I have to agree with others on this one. He's 40, you can't teach an old dog new tricks. I wonder what his ex would say, probably he did the same to her and she left him for it. It makes me think he goes for younger women because ones his age wouldn't take it as easily.\n\nI was in the same situation for three years, yes, three years! At first I was like you, very patient. It started getting worse though and then the mental, emotional, and some physical abuse followed. Not saying your boyfriend would do the same, but usually it does follow. He'll see that you can take him blaming you and would then think he can get away with other things. This is a big red flag and one you need to be careful with if you do want to stay. There's no fixing him though and you cant change someone unless they want to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have to agree with others on this one. He&amp;#39;s 40, you can&amp;#39;t teach an old dog new tricks. I wonder what his ex would say, probably he did the same to her and she left him for it. It makes me think he goes for younger women because ones his age wouldn&amp;#39;t take it as easily.&lt;/p&gt;\n\n&lt;p&gt;I was in the same situation for three years, yes, three years! At first I was like you, very patient. It started getting worse though and then the mental, emotional, and some physical abuse followed. Not saying your boyfriend would do the same, but usually it does follow. He&amp;#39;ll see that you can take him blaming you and would then think he can get away with other things. This is a big red flag and one you need to be careful with if you do want to stay. There&amp;#39;s no fixing him though and you cant change someone unless they want to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg40nfx", "score_hidden": false, "stickied": false, "created": 1491926954.0, "created_utc": 1491898154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 84}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg46zwn", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Oblivinatior", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "All the red flags. You're both grown adults, he shouldn't be 'yelling' at you. \n\nThe part where you preemptively freaked out when you realised you had his licence was not a good sign, this doesn't seem like a happy relationship.\n\nDo you see a future with someone whose response to any challenge is to yell and scream like a petulant child who didn't get their way? Or someone who blames everyone else for their problems? What if something actually bad happens in your life, is this person going to be a support to you in challenging times?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All the red flags. You&amp;#39;re both grown adults, he shouldn&amp;#39;t be &amp;#39;yelling&amp;#39; at you. &lt;/p&gt;\n\n&lt;p&gt;The part where you preemptively freaked out when you realised you had his licence was not a good sign, this doesn&amp;#39;t seem like a happy relationship.&lt;/p&gt;\n\n&lt;p&gt;Do you see a future with someone whose response to any challenge is to yell and scream like a petulant child who didn&amp;#39;t get their way? Or someone who blames everyone else for their problems? What if something actually bad happens in your life, is this person going to be a support to you in challenging times?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg46zwn", "score_hidden": false, "stickied": false, "created": 1491943244.0, "created_utc": 1491914444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4y5qn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Ika_bunny", "parent_id": "t1_dg4iwcc", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This! My boyfriend has never yelled at me, EVER it's not a difficult concept if you yell at me I dump you that's it ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This! My boyfriend has never yelled at me, EVER it&amp;#39;s not a difficult concept if you yell at me I dump you that&amp;#39;s it &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4y5qn", "score_hidden": false, "stickied": false, "created": 1491974608.0, "created_utc": 1491945808.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4iwcc", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "TentaclesAndCupcakes", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You've been with this guy for a _year_ and you can easily list off multiple times he's yelled, screamed, and blamed you for things that weren't your fault. I'm guessing there are probably even more examples to list. He's a dud. Throw him back.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve been with this guy for a &lt;em&gt;year&lt;/em&gt; and you can easily list off multiple times he&amp;#39;s yelled, screamed, and blamed you for things that weren&amp;#39;t your fault. I&amp;#39;m guessing there are probably even more examples to list. He&amp;#39;s a dud. Throw him back.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4iwcc", "score_hidden": false, "stickied": false, "created": 1491957817.0, "created_utc": 1491929017.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4i8dl", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "browneyesandlashes", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What type of idiot travels and doesn't make sure he has his Id!?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What type of idiot travels and doesn&amp;#39;t make sure he has his Id!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4i8dl", "score_hidden": false, "stickied": false, "created": 1491957081.0, "created_utc": 1491928281.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg46h92", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "hiilike", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If I were you, I wouldn't marry this guy. And if I weren't gonna marry him, I'd probably end the relationship to make way for someone better suited for me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I were you, I wouldn&amp;#39;t marry this guy. And if I weren&amp;#39;t gonna marry him, I&amp;#39;d probably end the relationship to make way for someone better suited for me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg46h92", "score_hidden": false, "stickied": false, "created": 1491942358.0, "created_utc": 1491913558.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4a936", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "earthgarden", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Some people simply cannot accept blame or responsibility for *anything* bad or wrong in their lives, no matter how trite of an issue it is. If by 40 he doesn't understand that no one has to be the 'bad guy' or blamed for every little thing, he never will. \n\nAlso if by 40 he doesn't understand that HE is responsible for the care of his personal items like glasses, he never will. Heck I impressed this upon my sons when they were less than 10 years old each. It is unreasonable to expect other people to look out for and manage your glasses. My goodness that issue alone would have me telling him to f!ck right off. You're going to come for me over YOUR glasses, madafaka? Not in this life\n\nAnd the yelling, why do you tolerate that?? Stay with him if you want, and I'm glad you finally declared a boundary and hung up on him, but seriously I would have hung up the *moment* he started yelling. You think you're being mature and reasonable by staying calm during such an outlandish tirade, but all you're doing is tolerating abuse and letting him know he can talk to you all kinds of crazy ways and just straight violate by yelling at you. You are not a dog or a child, and actually neither dog nor child should be yelled at either.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some people simply cannot accept blame or responsibility for &lt;em&gt;anything&lt;/em&gt; bad or wrong in their lives, no matter how trite of an issue it is. If by 40 he doesn&amp;#39;t understand that no one has to be the &amp;#39;bad guy&amp;#39; or blamed for every little thing, he never will. &lt;/p&gt;\n\n&lt;p&gt;Also if by 40 he doesn&amp;#39;t understand that HE is responsible for the care of his personal items like glasses, he never will. Heck I impressed this upon my sons when they were less than 10 years old each. It is unreasonable to expect other people to look out for and manage your glasses. My goodness that issue alone would have me telling him to f!ck right off. You&amp;#39;re going to come for me over YOUR glasses, madafaka? Not in this life&lt;/p&gt;\n\n&lt;p&gt;And the yelling, why do you tolerate that?? Stay with him if you want, and I&amp;#39;m glad you finally declared a boundary and hung up on him, but seriously I would have hung up the &lt;em&gt;moment&lt;/em&gt; he started yelling. You think you&amp;#39;re being mature and reasonable by staying calm during such an outlandish tirade, but all you&amp;#39;re doing is tolerating abuse and letting him know he can talk to you all kinds of crazy ways and just straight violate by yelling at you. You are not a dog or a child, and actually neither dog nor child should be yelled at either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4a936", "score_hidden": false, "stickied": false, "created": 1491947942.0, "created_utc": 1491919142.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg47l7u", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "Whallywhaler", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is abusive behavior. Maybe it doesn't feel like it now but it will escalate. \n\nEven when you explain the logical conversation you had, you mention you apologized. He didn't. He thinks he's not wrong. He is. \n\nLook, you have already gotten fed up over this a few times. You know he's done the same to past partners. And there's the age difference. He doesn't get to berate you like a child. \n\nI have forgotten to hand my husband's bank card back to him. That sinking feeling when you realize it's in your coat pocket and your SO's day is going to be a bit less smooth. And you know how it's handled? \"Babe I'm sorry I forget to give your card back I have it here.\" \"Oh shit! Haha I totally forgot too. I've got some cash for lunch.\" Because he is a *fellow adult* and it's his responsibility too. \n\nYour boyfriend is immature and unkind and I wouldn't stick around to see just how bad it can get. It's only a matter of time before he's publicly berating you too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is abusive behavior. Maybe it doesn&amp;#39;t feel like it now but it will escalate. &lt;/p&gt;\n\n&lt;p&gt;Even when you explain the logical conversation you had, you mention you apologized. He didn&amp;#39;t. He thinks he&amp;#39;s not wrong. He is. &lt;/p&gt;\n\n&lt;p&gt;Look, you have already gotten fed up over this a few times. You know he&amp;#39;s done the same to past partners. And there&amp;#39;s the age difference. He doesn&amp;#39;t get to berate you like a child. &lt;/p&gt;\n\n&lt;p&gt;I have forgotten to hand my husband&amp;#39;s bank card back to him. That sinking feeling when you realize it&amp;#39;s in your coat pocket and your SO&amp;#39;s day is going to be a bit less smooth. And you know how it&amp;#39;s handled? &amp;quot;Babe I&amp;#39;m sorry I forget to give your card back I have it here.&amp;quot; &amp;quot;Oh shit! Haha I totally forgot too. I&amp;#39;ve got some cash for lunch.&amp;quot; Because he is a &lt;em&gt;fellow adult&lt;/em&gt; and it&amp;#39;s his responsibility too. &lt;/p&gt;\n\n&lt;p&gt;Your boyfriend is immature and unkind and I wouldn&amp;#39;t stick around to see just how bad it can get. It&amp;#39;s only a matter of time before he&amp;#39;s publicly berating you too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47l7u", "score_hidden": false, "stickied": false, "created": 1491944185.0, "created_utc": 1491915385.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg455gl", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "littlewoolie", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He is gaslighting you and trying to manipulate you into doing all of his thinking for him. So long as you're the one carrying the burden of responsibility, you're also the one carrying the blame. Notice how there is no gratitude from him for the times you come through and nothing went wrong?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is gaslighting you and trying to manipulate you into doing all of his thinking for him. So long as you&amp;#39;re the one carrying the burden of responsibility, you&amp;#39;re also the one carrying the blame. Notice how there is no gratitude from him for the times you come through and nothing went wrong?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg455gl", "score_hidden": false, "stickied": false, "created": 1491939781.0, "created_utc": 1491910981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4hm4q", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "jurassiceyebrows", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is ridiculous. I didn't even finish it. You're dating someone who acts like a child and throws temper tantrums at the smallest things. I dated someone like this many years ago, before I realized that yelling doesn't have to be part of relationships. I am so glad I moved on and found my husband who is a kinder, gentler person. \n\nSure, we snap at each other and get bitchy and frustrated. But he has never once yelled at me. And I've done plenty of the wrong/late directions on Google Maps!\n\nWe've driven thousands and thousands of miles together--two road trips spanning the entire western portion of the US, around the whole country of Iceland, on the wild roads of the developing country of Qatar in which we now live, where Google Maps is often wrong, all over the northern region of Oman....we've had plenty of wrong turns, misunderstood directions, turn arounds, bad routes, and getting lost in our short time together! And we've done all this with kids!\n\nGuess how many times I've been yelled at as a result of giving wrong information/not understanding/being late? Uh...zero. Because my husband loves and respects me. And also because, *it's not a huge fucking deal to turn around and try again*. It's not. I married him because I don't like people who make mountains out of molehills and have such weak character that they freak the fuck out about easily resolved situations. \n\nThe ID thing sounds like something I would totally do. Yes, my husband would be frustrated. He may even be a bit frustrated at ME. But he's an adult and this is the 21st century. Really, it's not the end of the world. It's definitely a \"Welll...*Shit*.\" situation, it's not fun, and it sucks. I don't think yelling would even enter my husband's mind. What good does it do? It doesn't solve the problem. \n\nAlso, I could not STAND being with a man that needs me to help him solve his own problems. My bad-tempered ex boyfriend used to be like that. I felt like I had to help come up with solutions to make things better in order to deal with his bad temper. I'm sorry, but I grew out of that at 23. I just do not have the emotional energy to be a grown man's mother like that anymore. A real man, with good character and responsibility, can look at a situation and solve his own problems. He can delegate tasks if he needs help and communicate his needs effectively. \n\nI can understand him being mad and frustrated, but yelling at you is only serving as emotional gratification for him. That's what I finally figured out about my ex boyfriend. He gets off on the temper tantrums. He likes making a big stink so people will run around after him and try to clean up the mess so that he doesn't have to do it--and to make himself feel better in the process. Because he's a big baby with no maturity or coping skills. \n\nI've been in your shoes, and I just couldn't do it anymore. I couldn't put in the emotional work. I couldn't deal with cringing inside and bracing for the fits of anger. I couldn't deal with being treated like garbage, no matter how good our good times were. \n\nHoney, you deserve better. A good man ALWAYS has time for warm hugs and kind words--even when he is angry. \n\nThese kinds of men exist. I didn't believe it, either. When you get mad, you yell, right? No. No, actually, that's not a requirement in relationships. I don't get yelled at anymore, and my husband can solve his own problems. Because he's a man, not a little boy pretending to be one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is ridiculous. I didn&amp;#39;t even finish it. You&amp;#39;re dating someone who acts like a child and throws temper tantrums at the smallest things. I dated someone like this many years ago, before I realized that yelling doesn&amp;#39;t have to be part of relationships. I am so glad I moved on and found my husband who is a kinder, gentler person. &lt;/p&gt;\n\n&lt;p&gt;Sure, we snap at each other and get bitchy and frustrated. But he has never once yelled at me. And I&amp;#39;ve done plenty of the wrong/late directions on Google Maps!&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve driven thousands and thousands of miles together--two road trips spanning the entire western portion of the US, around the whole country of Iceland, on the wild roads of the developing country of Qatar in which we now live, where Google Maps is often wrong, all over the northern region of Oman....we&amp;#39;ve had plenty of wrong turns, misunderstood directions, turn arounds, bad routes, and getting lost in our short time together! And we&amp;#39;ve done all this with kids!&lt;/p&gt;\n\n&lt;p&gt;Guess how many times I&amp;#39;ve been yelled at as a result of giving wrong information/not understanding/being late? Uh...zero. Because my husband loves and respects me. And also because, &lt;em&gt;it&amp;#39;s not a huge fucking deal to turn around and try again&lt;/em&gt;. It&amp;#39;s not. I married him because I don&amp;#39;t like people who make mountains out of molehills and have such weak character that they freak the fuck out about easily resolved situations. &lt;/p&gt;\n\n&lt;p&gt;The ID thing sounds like something I would totally do. Yes, my husband would be frustrated. He may even be a bit frustrated at ME. But he&amp;#39;s an adult and this is the 21st century. Really, it&amp;#39;s not the end of the world. It&amp;#39;s definitely a &amp;quot;Welll...&lt;em&gt;Shit&lt;/em&gt;.&amp;quot; situation, it&amp;#39;s not fun, and it sucks. I don&amp;#39;t think yelling would even enter my husband&amp;#39;s mind. What good does it do? It doesn&amp;#39;t solve the problem. &lt;/p&gt;\n\n&lt;p&gt;Also, I could not STAND being with a man that needs me to help him solve his own problems. My bad-tempered ex boyfriend used to be like that. I felt like I had to help come up with solutions to make things better in order to deal with his bad temper. I&amp;#39;m sorry, but I grew out of that at 23. I just do not have the emotional energy to be a grown man&amp;#39;s mother like that anymore. A real man, with good character and responsibility, can look at a situation and solve his own problems. He can delegate tasks if he needs help and communicate his needs effectively. &lt;/p&gt;\n\n&lt;p&gt;I can understand him being mad and frustrated, but yelling at you is only serving as emotional gratification for him. That&amp;#39;s what I finally figured out about my ex boyfriend. He gets off on the temper tantrums. He likes making a big stink so people will run around after him and try to clean up the mess so that he doesn&amp;#39;t have to do it--and to make himself feel better in the process. Because he&amp;#39;s a big baby with no maturity or coping skills. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in your shoes, and I just couldn&amp;#39;t do it anymore. I couldn&amp;#39;t put in the emotional work. I couldn&amp;#39;t deal with cringing inside and bracing for the fits of anger. I couldn&amp;#39;t deal with being treated like garbage, no matter how good our good times were. &lt;/p&gt;\n\n&lt;p&gt;Honey, you deserve better. A good man ALWAYS has time for warm hugs and kind words--even when he is angry. &lt;/p&gt;\n\n&lt;p&gt;These kinds of men exist. I didn&amp;#39;t believe it, either. When you get mad, you yell, right? No. No, actually, that&amp;#39;s not a requirement in relationships. I don&amp;#39;t get yelled at anymore, and my husband can solve his own problems. Because he&amp;#39;s a man, not a little boy pretending to be one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4hm4q", "score_hidden": false, "stickied": false, "created": 1491956409.0, "created_utc": 1491927609.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4hffp", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "cinnapear", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Straight talk:  You're dating a 40 year old man and it takes an act of god to change a 40 year old man's ways.\n\nHe will continue to blame you for things that aren't your fault.  It will not stop.  That's who he is.  He's had 40 years to learn to blame others for his mistakes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Straight talk:  You&amp;#39;re dating a 40 year old man and it takes an act of god to change a 40 year old man&amp;#39;s ways.&lt;/p&gt;\n\n&lt;p&gt;He will continue to blame you for things that aren&amp;#39;t your fault.  It will not stop.  That&amp;#39;s who he is.  He&amp;#39;s had 40 years to learn to blame others for his mistakes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4hffp", "score_hidden": false, "stickied": false, "created": 1491956210.0, "created_utc": 1491927410.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4a25l", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Aladdin_Caine", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There's no \"we as a couple\" - your boyfriend has a shitty personality and you want to change him. \n\nI don't think this will end well for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s no &amp;quot;we as a couple&amp;quot; - your boyfriend has a shitty personality and you want to change him. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think this will end well for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4a25l", "score_hidden": false, "stickied": false, "created": 1491947692.0, "created_utc": 1491918892.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg43hnk", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "itypeallmycomments", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you've got to wonder why he tries to place blame. When he asks \"why did you leave your car lights on?\", what is he looking for? Is he looking for a legit reason that he would understand?\n\nIf there was a perfectly good reason for it, would he accept that? (ignore the fact that it was him who turned them on).\n\nI just think it's probably more insidious than that. He doesn't want to hear logic, he just wants to shift/place blame in a way that makes him the accuser, and therefore the one in power. He makes you prove your innocence, then he finds fault in your arguments, and so he never presumes he's the guilty one.\n\nAnyway, this guy was in highschool while you were in the womb, that alone is just too weird.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;ve got to wonder why he tries to place blame. When he asks &amp;quot;why did you leave your car lights on?&amp;quot;, what is he looking for? Is he looking for a legit reason that he would understand?&lt;/p&gt;\n\n&lt;p&gt;If there was a perfectly good reason for it, would he accept that? (ignore the fact that it was him who turned them on).&lt;/p&gt;\n\n&lt;p&gt;I just think it&amp;#39;s probably more insidious than that. He doesn&amp;#39;t want to hear logic, he just wants to shift/place blame in a way that makes him the accuser, and therefore the one in power. He makes you prove your innocence, then he finds fault in your arguments, and so he never presumes he&amp;#39;s the guilty one.&lt;/p&gt;\n\n&lt;p&gt;Anyway, this guy was in highschool while you were in the womb, that alone is just too weird.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg43hnk", "score_hidden": false, "stickied": false, "created": 1491935715.0, "created_utc": 1491906915.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4eob2", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Jilly_Bean16", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He is treating you like an absentminded child and you don't deserve that. He also seems to have an issue with admitting fault. \n\nThis is your reality, and you're at a crossroads now. He is a 40 year old man, do you really expect him to change after all this time? It's your choice if you want to continue with this as your reality or if you want something better. Personally I think you deserve better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is treating you like an absentminded child and you don&amp;#39;t deserve that. He also seems to have an issue with admitting fault. &lt;/p&gt;\n\n&lt;p&gt;This is your reality, and you&amp;#39;re at a crossroads now. He is a 40 year old man, do you really expect him to change after all this time? It&amp;#39;s your choice if you want to continue with this as your reality or if you want something better. Personally I think you deserve better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4eob2", "score_hidden": false, "stickied": false, "created": 1491953166.0, "created_utc": 1491924366.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4g7li", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Meayow", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "#angerproblems\nOP this will only get worse as your relationship gets deeper. His immediate response to problems is to find someone to blame. He does this because he has some emotional problem. He can work on it, or this will be your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;h1&gt;angerproblems&lt;/h1&gt;\n\n&lt;p&gt;OP this will only get worse as your relationship gets deeper. His immediate response to problems is to find someone to blame. He does this because he has some emotional problem. He can work on it, or this will be your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4g7li", "score_hidden": false, "stickied": false, "created": 1491954870.0, "created_utc": 1491926070.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4mvl7", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "itsjustadreamwakeup", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Huge Red Flag!!! I went through three years of this, it did not get better no matter how much I tried to talk to him or how \"good\" I tried to be. Once you are out of it I can almost guarantee how freeing it is to know that not everything that bad happens is your fault. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Huge Red Flag!!! I went through three years of this, it did not get better no matter how much I tried to talk to him or how &amp;quot;good&amp;quot; I tried to be. Once you are out of it I can almost guarantee how freeing it is to know that not everything that bad happens is your fault. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4mvl7", "score_hidden": false, "stickied": false, "created": 1491962153.0, "created_utc": 1491933353.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg3zrfp", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "WasJosie", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sounds like you are handling it pretty well.  My only suggestion is to cut him off at the pass more quickly - there is no reason for you to sit there and listen to him berate you. That's intolerable so don't tolerate it. I wonder if he could use some help finding ways to express his frustration in an acceptable way. He is probably copying what he heard his parents do, and he needs a new model. Maybe the two of you could talk about this, or he could address it with a counselor.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like you are handling it pretty well.  My only suggestion is to cut him off at the pass more quickly - there is no reason for you to sit there and listen to him berate you. That&amp;#39;s intolerable so don&amp;#39;t tolerate it. I wonder if he could use some help finding ways to express his frustration in an acceptable way. He is probably copying what he heard his parents do, and he needs a new model. Maybe the two of you could talk about this, or he could address it with a counselor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg3zrfp", "score_hidden": false, "stickied": false, "created": 1491924377.0, "created_utc": 1491895577.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg47lr3", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Yay_Rabies", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He sounds exhausting because you have to do everything for him!  \nNot only is everything your fault, but all mistakes are the end of the world for him.  Automatic lights which shut themselves off warrant a fight.  Missing a turn while using a gps that recalculates the route for you warrants a fight.  And maybe I'm just paranoid but if I gave my SO my drivers license I would be on edge until I knew it was back in my wallet and on my person.  Even if I did a fast lane at an airport I would never think of trying to go anywhere that has security checks without a drivers license, my LTC or my passport.   Or maybe I'm just an adult.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He sounds exhausting because you have to do everything for him!&lt;br/&gt;\nNot only is everything your fault, but all mistakes are the end of the world for him.  Automatic lights which shut themselves off warrant a fight.  Missing a turn while using a gps that recalculates the route for you warrants a fight.  And maybe I&amp;#39;m just paranoid but if I gave my SO my drivers license I would be on edge until I knew it was back in my wallet and on my person.  Even if I did a fast lane at an airport I would never think of trying to go anywhere that has security checks without a drivers license, my LTC or my passport.   Or maybe I&amp;#39;m just an adult.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47lr3", "score_hidden": false, "stickied": false, "created": 1491944207.0, "created_utc": 1491915407.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4ima8", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "dragonfliesloveme", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The fact that you are getting panicked when something goes wrong for him tells me that your brain has learned that you are indeed the scapegoat.  The flight-or-fight response is present to some degree when you feel panicked; part of your brain is beseeching you to remove yourself from the situation for self-preservation, so you don't have to go through with the mental torment that happens when you get berated.\n\nThe thing is, though, if you learn this to the point that you have actually internalized it, you are in for a world of suck, because then you don't even need the main trigger (him) to blame yourself for things and to have a panicked response when things go badly for other people. You could break up with him today or he could die tomorrow, and if you have internalized these messages about yourself, you will still be having this type of response to stressful situations. And that makes for a long and unhappy life.\n\nSo get away from him before you internalize his bullshit.\n\nSpeaking of shit, your relationship doesn't sound great besides this one issue, it sounds like a shit sandwich. Everything is great in that sandwich except for the piece of shit that's hidden within it and is waiting there to poison you. Don't eat shit sandwiches. Go through life with a sandwich that does not include a poisonous piece of shit in it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact that you are getting panicked when something goes wrong for him tells me that your brain has learned that you are indeed the scapegoat.  The flight-or-fight response is present to some degree when you feel panicked; part of your brain is beseeching you to remove yourself from the situation for self-preservation, so you don&amp;#39;t have to go through with the mental torment that happens when you get berated.&lt;/p&gt;\n\n&lt;p&gt;The thing is, though, if you learn this to the point that you have actually internalized it, you are in for a world of suck, because then you don&amp;#39;t even need the main trigger (him) to blame yourself for things and to have a panicked response when things go badly for other people. You could break up with him today or he could die tomorrow, and if you have internalized these messages about yourself, you will still be having this type of response to stressful situations. And that makes for a long and unhappy life.&lt;/p&gt;\n\n&lt;p&gt;So get away from him before you internalize his bullshit.&lt;/p&gt;\n\n&lt;p&gt;Speaking of shit, your relationship doesn&amp;#39;t sound great besides this one issue, it sounds like a shit sandwich. Everything is great in that sandwich except for the piece of shit that&amp;#39;s hidden within it and is waiting there to poison you. Don&amp;#39;t eat shit sandwiches. Go through life with a sandwich that does not include a poisonous piece of shit in it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ima8", "score_hidden": false, "stickied": false, "created": 1491957513.0, "created_utc": 1491928713.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg48t4c", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Skippylu", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You sound like you are constantly walking on eggshells around him, doesn't sound like a happy relationship. Plus I don't want to jump on the bandwagon but there's a reason he isn't dating someone his own age. \n\nYou seem to be making excuses for him in your post and blame yourself a lot. He sounds like an effort to be with and on top of that he blames you for his mistakes, so yeah huge red flag. ", "edited": 1491917483.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sound like you are constantly walking on eggshells around him, doesn&amp;#39;t sound like a happy relationship. Plus I don&amp;#39;t want to jump on the bandwagon but there&amp;#39;s a reason he isn&amp;#39;t dating someone his own age. &lt;/p&gt;\n\n&lt;p&gt;You seem to be making excuses for him in your post and blame yourself a lot. He sounds like an effort to be with and on top of that he blames you for his mistakes, so yeah huge red flag. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48t4c", "score_hidden": false, "stickied": false, "created": 1491946015.0, "created_utc": 1491917215.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4nhm3", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Takes2-2Mango", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "God this sounds familiar.  OP, this is verbal abuse.  He is verbally abusing you and gaslighting you into make you think things are always your fault.  Only she's a shitty gaslighter, so you're recognizing it.\n\nAbuse is a choice, and considering he's 40, this is ingrained in him.  He knows he's wrong, but he chooses to use you as a punching bag instead of handling the consequences of his own actions, or dealing with accidents and mistakes like a healthy, normal person.\n\nThere is little to suggest this will change.  This did not change with my ex, and it steadily and slowly got worse until it exploded into physical abuse after we got engaged.\n\nCouples counseling is not recommended in abusive situations, because it will only give him ammunition to use against you.  If HE were to recognize he is abusive and decide on his own to get therapy, it will be recommended that he attend therapy for at least a year and be single while he does it.\n\nAll this to say...you are being abused and it will escalate, and the only smart choice is to leave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;God this sounds familiar.  OP, this is verbal abuse.  He is verbally abusing you and gaslighting you into make you think things are always your fault.  Only she&amp;#39;s a shitty gaslighter, so you&amp;#39;re recognizing it.&lt;/p&gt;\n\n&lt;p&gt;Abuse is a choice, and considering he&amp;#39;s 40, this is ingrained in him.  He knows he&amp;#39;s wrong, but he chooses to use you as a punching bag instead of handling the consequences of his own actions, or dealing with accidents and mistakes like a healthy, normal person.&lt;/p&gt;\n\n&lt;p&gt;There is little to suggest this will change.  This did not change with my ex, and it steadily and slowly got worse until it exploded into physical abuse after we got engaged.&lt;/p&gt;\n\n&lt;p&gt;Couples counseling is not recommended in abusive situations, because it will only give him ammunition to use against you.  If HE were to recognize he is abusive and decide on his own to get therapy, it will be recommended that he attend therapy for at least a year and be single while he does it.&lt;/p&gt;\n\n&lt;p&gt;All this to say...you are being abused and it will escalate, and the only smart choice is to leave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4nhm3", "score_hidden": false, "stickied": false, "created": 1491962826.0, "created_utc": 1491934026.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4odki", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Wubbalubbadubbitydo", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Why in the world would you tolerate all that? Learn to love yourself enough not to. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why in the world would you tolerate all that? Learn to love yourself enough not to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4odki", "score_hidden": false, "stickied": false, "created": 1491963811.0, "created_utc": 1491935011.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg499wm", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "silverraven1189", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Older men that are controlling tend to gravitate towards younger, inexperienced women.\n\nAny woman his age would know that his actions are big, glaring, red flags. \n\nHe's 40 years old and is blaming you for the fact that he was too careless to remember his ID? He travels for work! He should be checking he has his ID before every trip. How is that your fault? \n\nHe is emotionally abusive. \n\nIf you were in a healthy relationship, you wouldn't be automatically worried that he was going to tell at you whenever anything went wrong. I've forgotten or broken a ton of things and my boyfriend has never, ever raised his voice at me. This is normal. Yelling at your partner is not normal, especially at 40 years old.\n\nI have a feeling that what he's doing is starting the process of gaslighting you. Despite knowing that you never leave the lights on in your car, how many times have you second guessed yourself and wondered if maybe you did leave them on. How many times have you second guessed yourself and wondered if maybe it was your fault that he was telling at you? He's slowly trying to undermine your confidence in yourself and your memory of how events really happened. Google 'gaslighting' and really think about whether he's doing this to you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Older men that are controlling tend to gravitate towards younger, inexperienced women.&lt;/p&gt;\n\n&lt;p&gt;Any woman his age would know that his actions are big, glaring, red flags. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s 40 years old and is blaming you for the fact that he was too careless to remember his ID? He travels for work! He should be checking he has his ID before every trip. How is that your fault? &lt;/p&gt;\n\n&lt;p&gt;He is emotionally abusive. &lt;/p&gt;\n\n&lt;p&gt;If you were in a healthy relationship, you wouldn&amp;#39;t be automatically worried that he was going to tell at you whenever anything went wrong. I&amp;#39;ve forgotten or broken a ton of things and my boyfriend has never, ever raised his voice at me. This is normal. Yelling at your partner is not normal, especially at 40 years old.&lt;/p&gt;\n\n&lt;p&gt;I have a feeling that what he&amp;#39;s doing is starting the process of gaslighting you. Despite knowing that you never leave the lights on in your car, how many times have you second guessed yourself and wondered if maybe you did leave them on. How many times have you second guessed yourself and wondered if maybe it was your fault that he was telling at you? He&amp;#39;s slowly trying to undermine your confidence in yourself and your memory of how events really happened. Google &amp;#39;gaslighting&amp;#39; and really think about whether he&amp;#39;s doing this to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg499wm", "score_hidden": false, "stickied": false, "created": 1491946656.0, "created_utc": 1491917856.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4369n", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Not_a_Leaf", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He's 40 years old. \n\nEnough said", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s 40 years old. &lt;/p&gt;\n\n&lt;p&gt;Enough said&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4369n", "score_hidden": false, "stickied": false, "created": 1491934810.0, "created_utc": 1491906010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4bv9s", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "starshine1988", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This sounds exhausting and frustrating. I cannot deal with people who expect their passenger to be a 'co-pilot.' It's 2017, we have freaking robots to do that for us! He sounds like a baby that prefers complaining to figuring out solutions. \n\nOther people mentioned that he probably hasn't got a longer term partner at this point is that this gets worse with time. I could very easily see him lashing out at you in front of friends or family. There's no turning back from that.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds exhausting and frustrating. I cannot deal with people who expect their passenger to be a &amp;#39;co-pilot.&amp;#39; It&amp;#39;s 2017, we have freaking robots to do that for us! He sounds like a baby that prefers complaining to figuring out solutions. &lt;/p&gt;\n\n&lt;p&gt;Other people mentioned that he probably hasn&amp;#39;t got a longer term partner at this point is that this gets worse with time. I could very easily see him lashing out at you in front of friends or family. There&amp;#39;s no turning back from that.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4bv9s", "score_hidden": false, "stickied": false, "created": 1491949968.0, "created_utc": 1491921168.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4lkv0", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "KingLi88", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So why are you dating a 40 year old?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So why are you dating a 40 year old?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4lkv0", "score_hidden": false, "stickied": false, "created": 1491960737.0, "created_utc": 1491931937.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4mekn", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "YouKnowYourCrazy", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Walking on eggshells, being afraid of your BF's temper is no way to live. Dump this loser. He's 40. He still hasn't learned how to handle life's frustrations without flipping out and casting blame around? Um, no.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Walking on eggshells, being afraid of your BF&amp;#39;s temper is no way to live. Dump this loser. He&amp;#39;s 40. He still hasn&amp;#39;t learned how to handle life&amp;#39;s frustrations without flipping out and casting blame around? Um, no.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4mekn", "score_hidden": false, "stickied": false, "created": 1491961636.0, "created_utc": 1491932836.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4jaid", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "macimom", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Here is the absolute 100% truth\n\nYour bf is an asshole.\n\nThis is why he is 40 and still available.\n\nHe blames everyone else instead of taking responsibility for himself.\n\nDTMFA or your future will be one of constantly being blamed for everything.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here is the absolute 100% truth&lt;/p&gt;\n\n&lt;p&gt;Your bf is an asshole.&lt;/p&gt;\n\n&lt;p&gt;This is why he is 40 and still available.&lt;/p&gt;\n\n&lt;p&gt;He blames everyone else instead of taking responsibility for himself.&lt;/p&gt;\n\n&lt;p&gt;DTMFA or your future will be one of constantly being blamed for everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4jaid", "score_hidden": false, "stickied": false, "created": 1491958238.0, "created_utc": 1491929438.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4mxkm", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "annieisokayannie", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Giiiiiiiirl, no. He's controlling and that's the EXACT reason he's not dating someone his own age. Please take it from someone who's been there (I'm 28, he's 41). We're separated now and have a child together - he's berated me for the nearly three years we've been separated, ranging from calling me a whore to a bad mother for \"not loving my child enough to work out our problems.\" I spend ever day of my life ignoring texts and emails about what a terrible person I am for daring to leave him. You don't want this.\n\nThis doesn't get better - only worse. 95% of the time, the only reason a 40 year old wants to date someone 13 years his junior is because no one his own age is willing to put up with his bullshit.\n\nRuuuuuun.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Giiiiiiiirl, no. He&amp;#39;s controlling and that&amp;#39;s the EXACT reason he&amp;#39;s not dating someone his own age. Please take it from someone who&amp;#39;s been there (I&amp;#39;m 28, he&amp;#39;s 41). We&amp;#39;re separated now and have a child together - he&amp;#39;s berated me for the nearly three years we&amp;#39;ve been separated, ranging from calling me a whore to a bad mother for &amp;quot;not loving my child enough to work out our problems.&amp;quot; I spend ever day of my life ignoring texts and emails about what a terrible person I am for daring to leave him. You don&amp;#39;t want this.&lt;/p&gt;\n\n&lt;p&gt;This doesn&amp;#39;t get better - only worse. 95% of the time, the only reason a 40 year old wants to date someone 13 years his junior is because no one his own age is willing to put up with his bullshit.&lt;/p&gt;\n\n&lt;p&gt;Ruuuuuun.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4mxkm", "score_hidden": false, "stickied": false, "created": 1491962215.0, "created_utc": 1491933415.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg48b00", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "YouCantSaveEveryone", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He's 40. He's not gonna change. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s 40. He&amp;#39;s not gonna change. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48b00", "score_hidden": false, "stickied": false, "created": 1491945296.0, "created_utc": 1491916496.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4lgjq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "oneebitchchan", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's just going to get worse and worse over time, most likely. He seems like a grouch that doesn't want to admit fault. And he's treating you poorly.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s just going to get worse and worse over time, most likely. He seems like a grouch that doesn&amp;#39;t want to admit fault. And he&amp;#39;s treating you poorly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4lgjq", "score_hidden": false, "stickied": false, "created": 1491960609.0, "created_utc": 1491931809.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4nu53", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Meownowwow", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;and what we can do as a couple to overcome this.\n\nAs other have pointed out, it will be very hard for him to change as he has been operating this way for the past 40 years.\n\nThere is nothing you can do as a couple to fix this as it is solely his problem. It doesn't sound like he ants to fix this, if he wanted to he would have attended therapy by now.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;and what we can do as a couple to overcome this.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As other have pointed out, it will be very hard for him to change as he has been operating this way for the past 40 years.&lt;/p&gt;\n\n&lt;p&gt;There is nothing you can do as a couple to fix this as it is solely his problem. It doesn&amp;#39;t sound like he ants to fix this, if he wanted to he would have attended therapy by now.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4nu53", "score_hidden": false, "stickied": false, "created": 1491963212.0, "created_utc": 1491934412.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4o2tn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "slodro_the_sloth", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You deserve so much more than what this guy has to offer. Do you find yourself anxious all the time needing to stay ahead of his needs so you're not in trouble or having a discussion about respect? You're a year in and he isn't changing. Cut your losses and now you know what you will not tolerate next time around. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You deserve so much more than what this guy has to offer. Do you find yourself anxious all the time needing to stay ahead of his needs so you&amp;#39;re not in trouble or having a discussion about respect? You&amp;#39;re a year in and he isn&amp;#39;t changing. Cut your losses and now you know what you will not tolerate next time around. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4o2tn", "score_hidden": false, "stickied": false, "created": 1491963481.0, "created_utc": 1491934681.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4r32g", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "planetalletron", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Having dated this exact same type of guy with this exact same age gap, I'm gonna tell you right now... he's not gonna change. It's gonna get worse. You're gonna get more frustrated and hurt. Dump him. Please. PLEASE dump him. For your sanity and safety. This will escalate. I promise you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having dated this exact same type of guy with this exact same age gap, I&amp;#39;m gonna tell you right now... he&amp;#39;s not gonna change. It&amp;#39;s gonna get worse. You&amp;#39;re gonna get more frustrated and hurt. Dump him. Please. PLEASE dump him. For your sanity and safety. This will escalate. I promise you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4r32g", "score_hidden": false, "stickied": false, "created": 1491966700.0, "created_utc": 1491937900.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4rj2n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "student_loan_ginnie", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "All I needed to do was to read the title... No 40-year woman would put up with his shit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All I needed to do was to read the title... No 40-year woman would put up with his shit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4rj2n", "score_hidden": false, "stickied": false, "created": 1491967176.0, "created_utc": 1491938376.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg48cuj", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "GymSkiLax", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Stop dating someone 1.5x your age, and maybe you'll find someone more mature. Hes dating someone so much younger because no one his age will put up with his shit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stop dating someone 1.5x your age, and maybe you&amp;#39;ll find someone more mature. Hes dating someone so much younger because no one his age will put up with his shit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48cuj", "score_hidden": false, "stickied": false, "created": 1491945370.0, "created_utc": 1491916570.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4e75u", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RestingMurderFace", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Christ he sounds exhausting. \n\nHe's not going to change, OP. Not at his age. Do you want your life to be like this?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Christ he sounds exhausting. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s not going to change, OP. Not at his age. Do you want your life to be like this?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4e75u", "score_hidden": false, "stickied": false, "created": 1491952643.0, "created_utc": 1491923843.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg43ol2", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Happyendings4all", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Therapy for both of you, separately, with the stated goal for you of standing up for yourself, and for his, of being kinder and working together better. \n\nIf your actual job is being his support team, you need a salary, a job definition and professional courtesy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Therapy for both of you, separately, with the stated goal for you of standing up for yourself, and for his, of being kinder and working together better. &lt;/p&gt;\n\n&lt;p&gt;If your actual job is being his support team, you need a salary, a job definition and professional courtesy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg43ol2", "score_hidden": false, "stickied": false, "created": 1491936234.0, "created_utc": 1491907434.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4rzzy", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "ellamenopea", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If you can get his ID to an airport, the major airlines have small package services you can use to ship things under 16 oz. Maybe faster than fedex etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you can get his ID to an airport, the major airlines have small package services you can use to ship things under 16 oz. Maybe faster than fedex etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4rzzy", "score_hidden": false, "stickied": false, "created": 1491967684.0, "created_utc": 1491938884.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4v0u2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "SantisimaMuerte", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This sounds a lot like my SO. Blames me/everything/everyone else whenever anything goes wrong, nothing is ever his fault even if it's a direct result of something he did or neglected to do. For example, one night he forgot to take his meds and that was my fault because apparently it's *my* job to set his pills out for him even though he's perfectly capable of doing it himself. There are other things too, like he berates me for spending money on things he considers frivolous but when he spends hundreds of dollars on bullshit and we end up broke and eating ramen till payday, well *I* should have been more responsible and stopped him. And of course, there are the tantrums. It's like having a big, dumb, overgrown child.  \n\nI know what you mean by feeling panicked, I feel that way too. You're constantly trying to anticipate every little thing that could possibly go wrong and think of ways to prevent it or cover your ass so he won't have any excuse to blame you for it. And when something does go wrong, no matter how big or small, you have to brace yourself for a tongue-lashing. I consider it a form of mental abuse, he's keeping you in a state of constant anxiety and apprehension and it's an exhausting, nerve-wracking way to live. I can't tell you to break up with him, but this is definitely one of the reasons why I'll be breaking up with mine. ", "edited": 1491974306.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This sounds a lot like my SO. Blames me/everything/everyone else whenever anything goes wrong, nothing is ever his fault even if it&amp;#39;s a direct result of something he did or neglected to do. For example, one night he forgot to take his meds and that was my fault because apparently it&amp;#39;s &lt;em&gt;my&lt;/em&gt; job to set his pills out for him even though he&amp;#39;s perfectly capable of doing it himself. There are other things too, like he berates me for spending money on things he considers frivolous but when he spends hundreds of dollars on bullshit and we end up broke and eating ramen till payday, well &lt;em&gt;I&lt;/em&gt; should have been more responsible and stopped him. And of course, there are the tantrums. It&amp;#39;s like having a big, dumb, overgrown child.  &lt;/p&gt;\n\n&lt;p&gt;I know what you mean by feeling panicked, I feel that way too. You&amp;#39;re constantly trying to anticipate every little thing that could possibly go wrong and think of ways to prevent it or cover your ass so he won&amp;#39;t have any excuse to blame you for it. And when something does go wrong, no matter how big or small, you have to brace yourself for a tongue-lashing. I consider it a form of mental abuse, he&amp;#39;s keeping you in a state of constant anxiety and apprehension and it&amp;#39;s an exhausting, nerve-wracking way to live. I can&amp;#39;t tell you to break up with him, but this is definitely one of the reasons why I&amp;#39;ll be breaking up with mine. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4v0u2", "score_hidden": false, "stickied": false, "created": 1491970996.0, "created_utc": 1491942196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4yxjm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "IncredibleBulk2", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Nothing about your relationship sounds happy or loving. Please leave him. He's not going to change or hear you out. He needs to show you how mad he is by putting you down. This is not going to end well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nothing about your relationship sounds happy or loving. Please leave him. He&amp;#39;s not going to change or hear you out. He needs to show you how mad he is by putting you down. This is not going to end well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4yxjm", "score_hidden": false, "stickied": false, "created": 1491975539.0, "created_utc": 1491946739.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg52ovh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "inflagra", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I have dealt with anger issues, and they are really hard to get over because you need a ton of insight and you have to take complete responsibility for your actions and emotions. Your boyfriend doesn't seem to have any real insight into his behavior and why he acts the way he does, so it's unlikely that he's going to change before you get too sick of his behavior to stick around. \n\nOne thing I know -- he likes getting angry at you. There's something physically gratifying about all that self-righteous anger, and he really likes finding excuses to lash out. \n\nSo, he can either give up something that makes him feel really good in the moment, or he can do lots of mentally laborious work to figure out why he's such a fuck up. Most people choose the former and try to find a partner willing to put up with their bad behavior.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have dealt with anger issues, and they are really hard to get over because you need a ton of insight and you have to take complete responsibility for your actions and emotions. Your boyfriend doesn&amp;#39;t seem to have any real insight into his behavior and why he acts the way he does, so it&amp;#39;s unlikely that he&amp;#39;s going to change before you get too sick of his behavior to stick around. &lt;/p&gt;\n\n&lt;p&gt;One thing I know -- he likes getting angry at you. There&amp;#39;s something physically gratifying about all that self-righteous anger, and he really likes finding excuses to lash out. &lt;/p&gt;\n\n&lt;p&gt;So, he can either give up something that makes him feel really good in the moment, or he can do lots of mentally laborious work to figure out why he&amp;#39;s such a fuck up. Most people choose the former and try to find a partner willing to put up with their bad behavior.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg52ovh", "score_hidden": false, "stickied": false, "created": 1491980291.0, "created_utc": 1491951491.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg56cab", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "eccentricgiraffe", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are thirteen years younger, and you sound more mature than he does. I would be done at this point.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are thirteen years younger, and you sound more mature than he does. I would be done at this point.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg56cab", "score_hidden": false, "stickied": false, "created": 1491985206.0, "created_utc": 1491956406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg5f9vh", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "feelsanddreams", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hes 40 and acting like this.... Seriously he is never going to change. He will reel you in by \"acting nice\" again. Its abusive and you need to leave. Wouldnt be surprised if this even escalates and tries to make it your fault.\n\nGet out of there and find someone who respects you and takes responsibility for their actions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hes 40 and acting like this.... Seriously he is never going to change. He will reel you in by &amp;quot;acting nice&amp;quot; again. Its abusive and you need to leave. Wouldnt be surprised if this even escalates and tries to make it your fault.&lt;/p&gt;\n\n&lt;p&gt;Get out of there and find someone who respects you and takes responsibility for their actions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5f9vh", "score_hidden": false, "stickied": false, "created": 1491997397.0, "created_utc": 1491968597.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg5fozk", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "dingalingalong", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; When I drive and use Google Maps, I like to hold the phone myself.\n\nThis is dangerous.  I know you think it's not and you're fine, but it is - it's just that you haven't crashed and killed someone yet because you were distracted.\n\nGet a phone holder for your car.  This also neatly solves the problem of your boyfriend wanting you to hold the phone - just put it in the phone holder instead.\n\nP.S. Google Maps has voice directions.  Your boyfriend should learn to use them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;When I drive and use Google Maps, I like to hold the phone myself.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is dangerous.  I know you think it&amp;#39;s not and you&amp;#39;re fine, but it is - it&amp;#39;s just that you haven&amp;#39;t crashed and killed someone yet because you were distracted.&lt;/p&gt;\n\n&lt;p&gt;Get a phone holder for your car.  This also neatly solves the problem of your boyfriend wanting you to hold the phone - just put it in the phone holder instead.&lt;/p&gt;\n\n&lt;p&gt;P.S. Google Maps has voice directions.  Your boyfriend should learn to use them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5fozk", "score_hidden": false, "stickied": false, "created": 1491998067.0, "created_utc": 1491969267.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg5rge5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwawayno123456789", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your heart is already dropping when something goes wrong because you know he is going to take it out on you.\n\nThis is a giant, bedsheets sized red flag", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your heart is already dropping when something goes wrong because you know he is going to take it out on you.&lt;/p&gt;\n\n&lt;p&gt;This is a giant, bedsheets sized red flag&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5rge5", "score_hidden": false, "stickied": false, "created": 1492026954.0, "created_utc": 1491998154.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg61b5y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jurassiceyebrows", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Our relationship is totally perfect and it's totally healthy and stable except when things don't go his way and he gets mad,\"  - This should be stickied in this subreddit because it's the oldest story in the book. \n\nHoney, it's not hard to be a nice, \"healthy\", decent guy when things are going your way. The issue is, when things get tough, when he gets mad, this is how he behaves. Therefore you do NOT have a healthy stable relationship. That's literally the opposite. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Our relationship is totally perfect and it&amp;#39;s totally healthy and stable except when things don&amp;#39;t go his way and he gets mad,&amp;quot;  - This should be stickied in this subreddit because it&amp;#39;s the oldest story in the book. &lt;/p&gt;\n\n&lt;p&gt;Honey, it&amp;#39;s not hard to be a nice, &amp;quot;healthy&amp;quot;, decent guy when things are going your way. The issue is, when things get tough, when he gets mad, this is how he behaves. Therefore you do NOT have a healthy stable relationship. That&amp;#39;s literally the opposite. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg61b5y", "score_hidden": false, "stickied": false, "created": 1492040331.0, "created_utc": 1492011531.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4klyl", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "dorothy_zbornak_esq", "parent_id": "t1_dg4itcq", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Idk I would call it a trainwreck. It looks pretty wrecky from here.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Idk I would call it a trainwreck. It looks pretty wrecky from here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4klyl", "score_hidden": false, "stickied": false, "created": 1491959676.0, "created_utc": 1491930876.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4itcq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "unknownymous555", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Whenever I see an age gap as wide as yours I always expect a train wreck. It's not a train wreck yet but it has all the signs of heading there.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whenever I see an age gap as wide as yours I always expect a train wreck. It&amp;#39;s not a train wreck yet but it has all the signs of heading there.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4itcq", "score_hidden": false, "stickied": false, "created": 1491957728.0, "created_utc": 1491928928.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4owlp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "beezermama", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Basically, you're dating an older man who's treating you like a daughter instead of a life partner. He's dating you and not another 40-something woman a) because you have a perkier body, let's be real, and b) because you'll let him get away with his crappy actions. If you're fine with that, and are willing to bend yourself into a pretzel to accommodate his actions, then continue in the relationship. If you want a real partnership, then this isn't the person for that.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Basically, you&amp;#39;re dating an older man who&amp;#39;s treating you like a daughter instead of a life partner. He&amp;#39;s dating you and not another 40-something woman a) because you have a perkier body, let&amp;#39;s be real, and b) because you&amp;#39;ll let him get away with his crappy actions. If you&amp;#39;re fine with that, and are willing to bend yourself into a pretzel to accommodate his actions, then continue in the relationship. If you want a real partnership, then this isn&amp;#39;t the person for that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4owlp", "score_hidden": false, "stickied": false, "created": 1491964388.0, "created_utc": 1491935588.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg5eaf7", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "aznbabeeo", "parent_id": "t1_dg4j4rt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP doesn't actually say whether she's tried speaking to him about being solution oriented when there's not a conflict at hand first. They both have to be in a  good and conflict free space before they discuss the issue at hand. If those things don't work then by all means it would make sense to leave,", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP doesn&amp;#39;t actually say whether she&amp;#39;s tried speaking to him about being solution oriented when there&amp;#39;s not a conflict at hand first. They both have to be in a  good and conflict free space before they discuss the issue at hand. If those things don&amp;#39;t work then by all means it would make sense to leave,&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5eaf7", "score_hidden": false, "stickied": false, "created": 1491995895.0, "created_utc": 1491967095.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4j4rt", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "dragonfliesloveme", "parent_id": "t1_dg49yyv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You said they need to work on a solution together.  The following is from the original post above:\n\n&gt;but the point is blaming doesn't change the situation he's in at all and **we need to be solution oriented.**\n\nYeah, OP tried being solution-oriented and just got more anger and yelling. \n\nCan it be worked out in counseling?  Maybe, but I doubt he's interested in it. I think he likes to control her emotions with his blaming and his anger, and keep her at a disadvantage in the relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You said they need to work on a solution together.  The following is from the original post above:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;but the point is blaming doesn&amp;#39;t change the situation he&amp;#39;s in at all and &lt;strong&gt;we need to be solution oriented.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, OP tried being solution-oriented and just got more anger and yelling. &lt;/p&gt;\n\n&lt;p&gt;Can it be worked out in counseling?  Maybe, but I doubt he&amp;#39;s interested in it. I think he likes to control her emotions with his blaming and his anger, and keep her at a disadvantage in the relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4j4rt", "score_hidden": false, "stickied": false, "created": 1491958069.0, "created_utc": 1491929269.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49yyv", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "aznbabeeo", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "I'm going to take a gentler approach to this than most, but please don't crucify me! \n\n\n\nIt seems to me that your bf always needs to place blame and that is a coping mechanism to these situations no matter how big or small. People do this because it helps them feel less guilty or frustrated about a situation because instead of blaming themselves they can direct their frustrations on something or someone else.\n\n\n\nThis is something that definitely needs to end dealt with, but your bf is 40 and so he needs help. When you aren't fighting, I would bring it up and see if there are solutions to him trying to change that behavior and you also helping him to change. Meaning that when the blame game starts happening, telling him calmly that blaming someone is not going to help and that you have to work on a solution together. Whenever he gets angry, redirect to a solution. If you've already tried this 2 part approach, I would ask if he wouldn't mind getting couples counseling. \n\n\n\nReddit will tell you that this is an age gap thing, and it might be, but this is a common personality trait that I see in people of all ages, it just has to be corrected. If you try to correct these things and you see no progress, than it might be time to really think hard about if you want to be with someone is going to always pin the blame on you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to take a gentler approach to this than most, but please don&amp;#39;t crucify me! &lt;/p&gt;\n\n&lt;p&gt;It seems to me that your bf always needs to place blame and that is a coping mechanism to these situations no matter how big or small. People do this because it helps them feel less guilty or frustrated about a situation because instead of blaming themselves they can direct their frustrations on something or someone else.&lt;/p&gt;\n\n&lt;p&gt;This is something that definitely needs to end dealt with, but your bf is 40 and so he needs help. When you aren&amp;#39;t fighting, I would bring it up and see if there are solutions to him trying to change that behavior and you also helping him to change. Meaning that when the blame game starts happening, telling him calmly that blaming someone is not going to help and that you have to work on a solution together. Whenever he gets angry, redirect to a solution. If you&amp;#39;ve already tried this 2 part approach, I would ask if he wouldn&amp;#39;t mind getting couples counseling. &lt;/p&gt;\n\n&lt;p&gt;Reddit will tell you that this is an age gap thing, and it might be, but this is a common personality trait that I see in people of all ages, it just has to be corrected. If you try to correct these things and you see no progress, than it might be time to really think hard about if you want to be with someone is going to always pin the blame on you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg49yyv", "score_hidden": false, "stickied": false, "created": 1491947580.0, "created_utc": 1491918780.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg48xqj", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Willuknight", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Don't date someone 12yrs older than you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t date someone 12yrs older than you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48xqj", "score_hidden": false, "stickied": false, "created": 1491946190.0, "created_utc": 1491917390.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg56lko", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "EarlGreyhair", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You shouldn't be walking on eggshells in your relationship, especially when he explodes at you for stuff you didn't do. Honeslty, it sounds like he is gaslighting you and, whether consciously or unconsciously, trying to condition you to be passive.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You shouldn&amp;#39;t be walking on eggshells in your relationship, especially when he explodes at you for stuff you didn&amp;#39;t do. Honeslty, it sounds like he is gaslighting you and, whether consciously or unconsciously, trying to condition you to be passive.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg56lko", "score_hidden": false, "stickied": false, "created": 1491985547.0, "created_utc": 1491956747.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg5ghtm", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vociferocity", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ok the only thing I want to say is it's not really safe to hold your phone and drive. It's actually illegal where I live! So that's one thing you guys might want to find a better solution for", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok the only thing I want to say is it&amp;#39;s not really safe to hold your phone and drive. It&amp;#39;s actually illegal where I live! So that&amp;#39;s one thing you guys might want to find a better solution for&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5ghtm", "score_hidden": false, "stickied": false, "created": 1491999391.0, "created_utc": 1491970591.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg5jmki", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "2cynincalyfe", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Even if you don't believe the age gap is a problem, he is still treating you horribly. You deserve better than that", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if you don&amp;#39;t believe the age gap is a problem, he is still treating you horribly. You deserve better than that&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jmki", "score_hidden": false, "stickied": false, "created": 1492005372.0, "created_utc": 1491976572.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg5lh14", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "k9centipede", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Since everyone else covered everything wrong with him, I just want to remind you: \n\nYou don't need his permission to end the relationship. He isn't going to want to let you go. It's not because he cares about you. It's because he cares about himself. At your expense. \n\nYou don't need his permission to end the relationship. \n\nFigure out an exit plan. Where you can stay and all that. \n\nAnd don't waste any time explaining it to him. He's going to demand you explain it because he wants to poke holes in your reason so you feel disempowered. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since everyone else covered everything wrong with him, I just want to remind you: &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need his permission to end the relationship. He isn&amp;#39;t going to want to let you go. It&amp;#39;s not because he cares about you. It&amp;#39;s because he cares about himself. At your expense. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need his permission to end the relationship. &lt;/p&gt;\n\n&lt;p&gt;Figure out an exit plan. Where you can stay and all that. &lt;/p&gt;\n\n&lt;p&gt;And don&amp;#39;t waste any time explaining it to him. He&amp;#39;s going to demand you explain it because he wants to poke holes in your reason so you feel disempowered. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5lh14", "score_hidden": false, "stickied": false, "created": 1492009965.0, "created_utc": 1491981165.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg7uzks", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "belo57", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Our relationship is totally perfect and it's totally healthy and stable except when things don't go his way and he gets mad,\"\n\nThat's exactly what I said to myself and friends when I shared my problems with them. Your relationship mirrored my last one exactly (with different occurrences; it wasn't GPS navigation but they were small things as well; add in gaslighting and stonewalling and you have a perfect recipe for an emotional abusive relationship). \n\nMy ex was 34 and I was 28, take it from me - he won't change because he doesn't see or is aware of the need to. It spirals downhill from here on (and these flags happened to me when it was during our honeymoon stage period). Do you want to spend the rest of your life/ relationship with someone that makes you feel like you are walking on eggshells? It will get very exhausting and his behavior will erode your self-esteem and personality away.\n\nYou deserve better, if you really want to work on this with him - sit him down and voice your concerns. You are both adults - if he refuses to acknowledge the issue at hand, it's time to reconsider the relationship. You're 27 - there are much better men out there that want to have a healthy relationship with you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Our relationship is totally perfect and it&amp;#39;s totally healthy and stable except when things don&amp;#39;t go his way and he gets mad,&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s exactly what I said to myself and friends when I shared my problems with them. Your relationship mirrored my last one exactly (with different occurrences; it wasn&amp;#39;t GPS navigation but they were small things as well; add in gaslighting and stonewalling and you have a perfect recipe for an emotional abusive relationship). &lt;/p&gt;\n\n&lt;p&gt;My ex was 34 and I was 28, take it from me - he won&amp;#39;t change because he doesn&amp;#39;t see or is aware of the need to. It spirals downhill from here on (and these flags happened to me when it was during our honeymoon stage period). Do you want to spend the rest of your life/ relationship with someone that makes you feel like you are walking on eggshells? It will get very exhausting and his behavior will erode your self-esteem and personality away.&lt;/p&gt;\n\n&lt;p&gt;You deserve better, if you really want to work on this with him - sit him down and voice your concerns. You are both adults - if he refuses to acknowledge the issue at hand, it&amp;#39;s time to reconsider the relationship. You&amp;#39;re 27 - there are much better men out there that want to have a healthy relationship with you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7uzks", "score_hidden": false, "stickied": false, "created": 1492132039.0, "created_utc": 1492103239.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4xrwg", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "staybrutal", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Besides all of the yelling and abuse that you should not tolerate, have you considered fedexing the ID?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Besides all of the yelling and abuse that you should not tolerate, have you considered fedexing the ID?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4xrwg", "score_hidden": false, "stickied": false, "created": 1491974148.0, "created_utc": 1491945348.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4eyv8", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "cakeycakeycake", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "I'd be pissed about the ID too, and the direction giving kind of IS your fault (also you really shouldn't hold it yourself when you drive if its avoidable- that's super unsafe). BUT THAT BEING SAID his overreactions upset you and he's 40 years old- he's a grown man and he's not going to change. His rants aren't productive. Again- He won't change. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d be pissed about the ID too, and the direction giving kind of IS your fault (also you really shouldn&amp;#39;t hold it yourself when you drive if its avoidable- that&amp;#39;s super unsafe). BUT THAT BEING SAID his overreactions upset you and he&amp;#39;s 40 years old- he&amp;#39;s a grown man and he&amp;#39;s not going to change. His rants aren&amp;#39;t productive. Again- He won&amp;#39;t change. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4eyv8", "score_hidden": false, "stickied": false, "created": 1491953493.0, "created_utc": 1491924693.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4nfoa", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "ShesTyping", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "your BF doesn't have good crisis management skills (crisis in this usage means everything from the tiny little bumps to the major issues), he instantly looks to deflect any personal responsibility and when called on it turns it into a martyr-ish poor me blame game. You can't fix this on your own, and it's not a little thing. This kind of behavior won't stop or become less... without some professional help this behavior not only won't change, it will gradually escalate into a method of controlling your behavior and emotional abuse. Eventually his constant blaming will turn into festering resentment, which will lead to bitterness and dislike.\n\nIf you two love each other, I would strongly recommend couples counselling (therapist may even recommend he gets individual sessions as well). He needs to learn better methods of dealing with things, and there certainly seems to be communication issues. \n\nGood luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;your BF doesn&amp;#39;t have good crisis management skills (crisis in this usage means everything from the tiny little bumps to the major issues), he instantly looks to deflect any personal responsibility and when called on it turns it into a martyr-ish poor me blame game. You can&amp;#39;t fix this on your own, and it&amp;#39;s not a little thing. This kind of behavior won&amp;#39;t stop or become less... without some professional help this behavior not only won&amp;#39;t change, it will gradually escalate into a method of controlling your behavior and emotional abuse. Eventually his constant blaming will turn into festering resentment, which will lead to bitterness and dislike.&lt;/p&gt;\n\n&lt;p&gt;If you two love each other, I would strongly recommend couples counselling (therapist may even recommend he gets individual sessions as well). He needs to learn better methods of dealing with things, and there certainly seems to be communication issues. &lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4nfoa", "score_hidden": false, "stickied": false, "created": 1491962766.0, "created_utc": 1491933966.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg47s9x", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Whallywhaler", "parent_id": "t1_dg42nm9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Maybe, but people don't \"snap out of\" deeply ingrained bad habits that are products of their own insecurity. \n\nOP can't go into this with the savior mindset. She owes him nothing. He's 40. He knows this stuff isn't his fault. He is throwing tantrums at 40 and that's not likely to change unless he realizes it's wrong. And judging from the post, he doesn't. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe, but people don&amp;#39;t &amp;quot;snap out of&amp;quot; deeply ingrained bad habits that are products of their own insecurity. &lt;/p&gt;\n\n&lt;p&gt;OP can&amp;#39;t go into this with the savior mindset. She owes him nothing. He&amp;#39;s 40. He knows this stuff isn&amp;#39;t his fault. He is throwing tantrums at 40 and that&amp;#39;s not likely to change unless he realizes it&amp;#39;s wrong. And judging from the post, he doesn&amp;#39;t. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47s9x", "score_hidden": false, "stickied": false, "created": 1491944496.0, "created_utc": 1491915696.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4aj64", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4afrq", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4aj64", "score_hidden": false, "stickied": false, "created": 1491948308.0, "created_utc": 1491919508.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4afrq", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg494ur", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4afrq", "score_hidden": false, "stickied": false, "created": 1491948185.0, "created_utc": 1491919385.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg494ur", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg42nm9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg494ur", "score_hidden": false, "stickied": false, "created": 1491946461.0, "created_utc": 1491917661.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg4o7pr", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "rainbowtomatoes", "parent_id": "t1_dg42nm9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What happens when an abused woman sees and applies this garbage logic to her SO? How long do you think she should stay to save a man who hits her or screams at her or threatens her life but \"doesn't mean it\"?\n\nWhy is it her job to fix him and risk danger more than it is his job to fix himself, alone, where he can't hurt anyone?\n\nEdit: and to can't ", "edited": 1491948556.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What happens when an abused woman sees and applies this garbage logic to her SO? How long do you think she should stay to save a man who hits her or screams at her or threatens her life but &amp;quot;doesn&amp;#39;t mean it&amp;quot;?&lt;/p&gt;\n\n&lt;p&gt;Why is it her job to fix him and risk danger more than it is his job to fix himself, alone, where he can&amp;#39;t hurt anyone?&lt;/p&gt;\n\n&lt;p&gt;Edit: and to can&amp;#39;t &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4o7pr", "score_hidden": false, "stickied": false, "created": 1491963630.0, "created_utc": 1491934830.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg42nm9", "gilded": 0, "archived": false, "score": -14, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg42nm9", "score_hidden": false, "stickied": false, "created": 1491933205.0, "created_utc": 1491904405.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pcvk", "likes": null, "replies": "", "user_reports": [], "id": "dg48hr7", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "aroseandathorn", "parent_id": "t3_64pcvk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ahhh OP, hugs and sympathy. As someone who is also dating an older person, I will be really honest: I think the power dynamic is part of the reason why they seek out these types of relationships. You are doing the right thing by taking a firm stance and not letting him push you around. Have you thought about showing him this post // copying its contents into an email or a letter? Maybe if he sees all of these examples lined up one after another, with a common theme, he'll better be able to recognize his behaviour. My guess is that he's doing it because it's a reflex and something that he's been allowed to get away with his whole life and never had to challenge... but honestly, things are not going to get better from here on their own, he has no incentive to change unless you really reiterate how much of a problem this is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahhh OP, hugs and sympathy. As someone who is also dating an older person, I will be really honest: I think the power dynamic is part of the reason why they seek out these types of relationships. You are doing the right thing by taking a firm stance and not letting him push you around. Have you thought about showing him this post // copying its contents into an email or a letter? Maybe if he sees all of these examples lined up one after another, with a common theme, he&amp;#39;ll better be able to recognize his behaviour. My guess is that he&amp;#39;s doing it because it&amp;#39;s a reflex and something that he&amp;#39;s been allowed to get away with his whole life and never had to challenge... but honestly, things are not going to get better from here on their own, he has no incentive to change unless you really reiterate how much of a problem this is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48hr7", "score_hidden": false, "stickied": false, "created": 1491945567.0, "created_utc": 1491916767.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]