[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To start with some background, I have known this girl, Laura, from my hometown (let&amp;#39;s call it A) since we were young and played a sport together. Our interaction was always friendly but we didn&amp;#39;t hang out outside of sports. Then I went away for college and would see her maybe once a year when I visited home. She stayed in A for college. Now I am graduated and living on my own a few hours away in a city we&amp;#39;ll call B. &lt;/p&gt;\n\n&lt;p&gt;Laura started a new relationship and moved outside of B with Tyler after 3 months of dating. Then out of the blue I get a text from her telling me all about this horrid verbal abuse he has put her through and that she took a lot of pills and was in the hospital. He broke up with her afterwards.&lt;/p&gt;\n\n&lt;p&gt;Now she had nowhere to live because her place in A was owned by a friend who found a new roommate (which Laura thought was awful but I find understandable) and they also had a falling out (which I&amp;#39;ve noticed is a pattern with her). She still had some classes to finish in A, but just started a new part time job in B. Her parents tell her if she moves back in with them in A, they will pay for the rest of her college and everything else. The only exception is she can&amp;#39;t bring her dog, Rocco, which they were against her getting in the first place.&lt;/p&gt;\n\n&lt;p&gt;I am a very protective friend and she was at rock bottom, so I offered to help. She wanted to keep her job in B part time so I let her stay at my place while she looked for a new apartment, and asked my parents to watch Rocco in the meantime. They were generous enough to do so (they live on a ranch with multiple dogs).&lt;/p&gt;\n\n&lt;p&gt;She stayed at my place for a little over a month free of charge. When she did find a place, they didn&amp;#39;t allow dogs. My parents are again generous enough to say that since Rocco gets along so well with our dogs, he can stay part time until she graduates (which was 9 months away).&lt;/p&gt;\n\n&lt;p&gt;She starts to overstay her welcome a bit, but I kept letting it slide because of what a low point she was at. I don&amp;#39;t visit home very often, about once every other month. But I hadn&amp;#39;t been home in 6 months without her being there, lingering or even sleeping in my bed once (so I had to sleep on the couch). I&amp;#39;ve also done large amounts of favors for her at this point, including helping her move out of her ex&amp;#39;s place an hour away, twice. &lt;/p&gt;\n\n&lt;p&gt;I start to get miffed when all this is taken for granted. She&amp;#39;ll do things like ask me to pay her back for the one drink she bought me the night before. I think she is so delusional that she doesn&amp;#39;t even think about the free rent, dog care, drinks, gas money, I have spent on her. If I ask a small favor, she won&amp;#39;t respond or she&amp;#39;ll tell me she&amp;#39;s ready when she knows it&amp;#39;s too late.  &lt;/p&gt;\n\n&lt;p&gt;It all comes to a head when we had an event in B. I&amp;#39;m going with a group of my friends and she asked months earlier to tag along. She tells me she can&amp;#39;t pick up her ticket (which she did pay for) so I do so for her. I let her know the plans a week in advance, then text her the night before with no response, and once again the morning of just to be sure.&lt;/p&gt;\n\n&lt;p&gt;She then texts me back 5 minutes before the event starts, that she&amp;#39;s on her way. We were no longer at the pregame and I had left her stuff there because I hadn&amp;#39;t gotten a response in two days and wasn&amp;#39;t going to carry her bag of stuff around with me all day. She blows up at me. I kind of told her off a little bit and she left me alone.&lt;/p&gt;\n\n&lt;p&gt;She goes to my parents house to get her dog, and according to my mom she just stands in the door for 5 minutes crying (presumably for attention or comforting). My mom just ignored it. Laura told my mom I owed her money for the event that I &amp;quot;ditched&amp;quot; her at, so my mom paid her. Laura also said she would be taking Rocco and leaving for awhile. I thought it was all finally over with.&lt;/p&gt;\n\n&lt;p&gt;I call my mom a few days ago to catch up, and can hear Rocco barking in the background. I specifically told my parents that if she asked if her dog could return, they must tell her to talk to me. I don&amp;#39;t want this girl using us anymore. My mom lied to me at first, and then concedes and told me it&amp;#39;s because one of our dogs was lonely without Rocco. I tell her I have to go and haven&amp;#39;t heard from her since.&lt;/p&gt;\n\n&lt;p&gt;Today I get a text from Laura saying &lt;em&gt;&amp;quot;Hey, so I know you&amp;#39;re mad at me, and I&amp;#39;m also upset with you. But I honestly don&amp;#39;t understand why you are upset with me, if anything you ditched me and left me hanging on a day I specifically took off and worked really hard for. I&amp;#39;m sorry if I hurt you in any way, but it is no reason to be upset with your mom for watching Rocco when I&amp;#39;m in A and he has nowhere to go. Your family has been so great to me and I am very thankful for that. I am just really upset and just don&amp;#39;t understand.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Even just retyping that has me livid. I&amp;#39;m not yet sure what my mom said to her. I guess my question is what do I say/do at this point? I do not want to be friends with this girl. I know I can&amp;#39;t lay into her (even though I want to) so I want to be mature, but am unsure the best way to go about it. I also am unsure what to do with my parents. Help!&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Acquaintance of mine has somewhat of a breakdown, my family and I help her, and now she&amp;#39;s overstaying her welcome and trying to get in between my parents and I. Help! What do I say to her (see above quotes) and how to deal with parents?&lt;/p&gt;\n\n&lt;p&gt;Edit: Thank you for all of your replies thus far! I am reading each one. Something I hadn&amp;#39;t considered that many of you pointed out was that it is my parents&amp;#39; decision on what to do with the dog. I agree, it is their house so their call. &lt;/p&gt;\n\n&lt;p&gt;Also, yes I was a pushover...yes, I will stop. I have not replied to her just yet. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "To start with some background, I have known this girl, Laura, from my hometown (let's call it A) since we were young and played a sport together. Our interaction was always friendly but we didn't hang out outside of sports. Then I went away for college and would see her maybe once a year when I visited home. She stayed in A for college. Now I am graduated and living on my own a few hours away in a city we'll call B. \n\nLaura started a new relationship and moved outside of B with Tyler after 3 months of dating. Then out of the blue I get a text from her telling me all about this horrid verbal abuse he has put her through and that she took a lot of pills and was in the hospital. He broke up with her afterwards.\n\nNow she had nowhere to live because her place in A was owned by a friend who found a new roommate (which Laura thought was awful but I find understandable) and they also had a falling out (which I've noticed is a pattern with her). She still had some classes to finish in A, but just started a new part time job in B. Her parents tell her if she moves back in with them in A, they will pay for the rest of her college and everything else. The only exception is she can't bring her dog, Rocco, which they were against her getting in the first place.\n\nI am a very protective friend and she was at rock bottom, so I offered to help. She wanted to keep her job in B part time so I let her stay at my place while she looked for a new apartment, and asked my parents to watch Rocco in the meantime. They were generous enough to do so (they live on a ranch with multiple dogs).\n\nShe stayed at my place for a little over a month free of charge. When she did find a place, they didn't allow dogs. My parents are again generous enough to say that since Rocco gets along so well with our dogs, he can stay part time until she graduates (which was 9 months away).\n\nShe starts to overstay her welcome a bit, but I kept letting it slide because of what a low point she was at. I don't visit home very often, about once every other month. But I hadn't been home in 6 months without her being there, lingering or even sleeping in my bed once (so I had to sleep on the couch). I've also done large amounts of favors for her at this point, including helping her move out of her ex's place an hour away, twice. \n\nI start to get miffed when all this is taken for granted. She'll do things like ask me to pay her back for the one drink she bought me the night before. I think she is so delusional that she doesn't even think about the free rent, dog care, drinks, gas money, I have spent on her. If I ask a small favor, she won't respond or she'll tell me she's ready when she knows it's too late.  \n\nIt all comes to a head when we had an event in B. I'm going with a group of my friends and she asked months earlier to tag along. She tells me she can't pick up her ticket (which she did pay for) so I do so for her. I let her know the plans a week in advance, then text her the night before with no response, and once again the morning of just to be sure.\n\nShe then texts me back 5 minutes before the event starts, that she's on her way. We were no longer at the pregame and I had left her stuff there because I hadn't gotten a response in two days and wasn't going to carry her bag of stuff around with me all day. She blows up at me. I kind of told her off a little bit and she left me alone.\n\nShe goes to my parents house to get her dog, and according to my mom she just stands in the door for 5 minutes crying (presumably for attention or comforting). My mom just ignored it. Laura told my mom I owed her money for the event that I \"ditched\" her at, so my mom paid her. Laura also said she would be taking Rocco and leaving for awhile. I thought it was all finally over with.\n\nI call my mom a few days ago to catch up, and can hear Rocco barking in the background. I specifically told my parents that if she asked if her dog could return, they must tell her to talk to me. I don't want this girl using us anymore. My mom lied to me at first, and then concedes and told me it's because one of our dogs was lonely without Rocco. I tell her I have to go and haven't heard from her since.\n\nToday I get a text from Laura saying *\"Hey, so I know you're mad at me, and I'm also upset with you. But I honestly don't understand why you are upset with me, if anything you ditched me and left me hanging on a day I specifically took off and worked really hard for. I'm sorry if I hurt you in any way, but it is no reason to be upset with your mom for watching Rocco when I'm in A and he has nowhere to go. Your family has been so great to me and I am very thankful for that. I am just really upset and just don't understand.\"*\n\nEven just retyping that has me livid. I'm not yet sure what my mom said to her. I guess my question is what do I say/do at this point? I do not want to be friends with this girl. I know I can't lay into her (even though I want to) so I want to be mature, but am unsure the best way to go about it. I also am unsure what to do with my parents. Help!\n  \n  ---   \n  **tl;dr**: Acquaintance of mine has somewhat of a breakdown, my family and I help her, and now she's overstaying her welcome and trying to get in between my parents and I. Help! What do I say to her (see above quotes) and how to deal with parents?\n\nEdit: Thank you for all of your replies thus far! I am reading each one. Something I hadn't considered that many of you pointed out was that it is my parents' decision on what to do with the dog. I agree, it is their house so their call. \n\nAlso, yes I was a pushover...yes, I will stop. I have not replied to her just yet. ", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Non-Romantic", "id": "64prv8", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 473, "report_reasons": null, "author": "prettynacho", "saved": false, "mod_reports": [], "name": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": 1491926022.0, "link_flair_css_class": "m-gn misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/64prv8/me_23_f_with_my_friendacquaintance_23_f_of_10/", "num_reports": null, "locked": false, "stickied": false, "created": 1491931162.0, "url": "https://www.reddit.com/r/relationships/comments/64prv8/me_23_f_with_my_friendacquaintance_23_f_of_10/", "author_flair_text": null, "quarantine": false, "title": "Me [23 F] with my friend/acquaintance [23 F] of ~10 years, she is constantly playing the victim, and now she's escalated it to the point of involving my parents [60s M/F].", "created_utc": 1491902362.0, "distinguished": null, "media": null, "upvote_ratio": 0.95, "num_comments": 55, "visited": false, "subreddit_type": "public", "ups": 473}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4vmyh", "gilded": 0, "archived": false, "score": 89, "report_reasons": null, "author": "Tired_as_Fuck_", "parent_id": "t1_dg45f1y", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Also \"You lived in my house without paying any rent well beyond your welcome\".\n\nLike half a year is excessive. But OP really should have kicked her the fuck out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also &amp;quot;You lived in my house without paying any rent well beyond your welcome&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Like half a year is excessive. But OP really should have kicked her the fuck out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4vmyh", "score_hidden": false, "stickied": false, "created": 1491971691.0, "created_utc": 1491942891.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 89}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4kt05", "gilded": 0, "archived": false, "score": 62, "report_reasons": null, "author": "OShaunesssy", "parent_id": "t1_dg45f1y", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "best response ever. Send exactly what was typed up here and her response will tell you all you need to know. Save the text convo's just in case shit gets petty with your mom and your friend lying to her. Good luck OP, this all sounds like childish bullshit", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;best response ever. Send exactly what was typed up here and her response will tell you all you need to know. Save the text convo&amp;#39;s just in case shit gets petty with your mom and your friend lying to her. Good luck OP, this all sounds like childish bullshit&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4kt05", "score_hidden": false, "stickied": false, "created": 1491959893.0, "created_utc": 1491931093.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 62}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5cgi2", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Pomguo", "parent_id": "t1_dg45f1y", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "/u/prettynacho you haven't responded to the above reply but it's the best one in this thread. Might seem overly harsh, but it's entirely truthful and fair. Like ripping off a bandaid, this is the response that is needed at this point - open honesty - after months of being a doormat just to avoid awkwardness. \n\nI might also add in the part about her making your parents pay for her ticket to an event that she was only unable to attend due to completely failing to communicate or coordinate with you despite ample opportunity. You are right to be mad about someone else charging your parents for their fuckup.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/prettynacho\"&gt;/u/prettynacho&lt;/a&gt; you haven&amp;#39;t responded to the above reply but it&amp;#39;s the best one in this thread. Might seem overly harsh, but it&amp;#39;s entirely truthful and fair. Like ripping off a bandaid, this is the response that is needed at this point - open honesty - after months of being a doormat just to avoid awkwardness. &lt;/p&gt;\n\n&lt;p&gt;I might also add in the part about her making your parents pay for her ticket to an event that she was only unable to attend due to completely failing to communicate or coordinate with you despite ample opportunity. You are right to be mad about someone else charging your parents for their fuckup.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5cgi2", "score_hidden": false, "stickied": false, "created": 1491993292.0, "created_utc": 1491964492.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 19}}], "after": null, "before": null}}, "user_reports": [], "id": "dg45f1y", "gilded": 0, "archived": false, "score": 624, "report_reasons": null, "author": "littlewoolie", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Today I get a text from Laura saying \"Hey, so I know you're mad at me, and I'm also upset with you. But I honestly don't understand why you are upset with me, if anything you ditched me and left me hanging on a day I specifically took off and worked really hard for. I'm sorry if I hurt you in any way, but it is no reason to be upset with your mom for watching Rocco when I'm in A and he has nowhere to go. Your family has been so great to me and I am very thankful for that. I am just really upset and just don't understand.\"\n\n\"I am upset that you deliberately ignored my attempts at communication in the weeks leading up the event, failed to inform me that you were even coming until 5 minutes before it starts, and then had the audacity to blame me for your lack of responsibility\" \n\n\" I am upset that even after the event, you cowardly, went behind my back to my mother and spread lies to her about our argument. You are dishonest and irresponsible. I will not hold it against your dog, he is welcome to stay there as long as my parents do. As for coming to my own house, you are no longer welcome there. From now on, our interactions will occur outside of my residence\"\n\nIf she is truly your friend, OP, then she will apologise properly and understand. Being friends means you should have the freedom to say what you want so long as it isn't abusive. \n\nAs for your parents, let them know that it is entirely their choice if the dog stays with them, but you should encourage them to ask for some type of financial assistance or for your friend to give your parents complete ownership.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Today I get a text from Laura saying &amp;quot;Hey, so I know you&amp;#39;re mad at me, and I&amp;#39;m also upset with you. But I honestly don&amp;#39;t understand why you are upset with me, if anything you ditched me and left me hanging on a day I specifically took off and worked really hard for. I&amp;#39;m sorry if I hurt you in any way, but it is no reason to be upset with your mom for watching Rocco when I&amp;#39;m in A and he has nowhere to go. Your family has been so great to me and I am very thankful for that. I am just really upset and just don&amp;#39;t understand.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;I am upset that you deliberately ignored my attempts at communication in the weeks leading up the event, failed to inform me that you were even coming until 5 minutes before it starts, and then had the audacity to blame me for your lack of responsibility&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&amp;quot; I am upset that even after the event, you cowardly, went behind my back to my mother and spread lies to her about our argument. You are dishonest and irresponsible. I will not hold it against your dog, he is welcome to stay there as long as my parents do. As for coming to my own house, you are no longer welcome there. From now on, our interactions will occur outside of my residence&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;If she is truly your friend, OP, then she will apologise properly and understand. Being friends means you should have the freedom to say what you want so long as it isn&amp;#39;t abusive. &lt;/p&gt;\n\n&lt;p&gt;As for your parents, let them know that it is entirely their choice if the dog stays with them, but you should encourage them to ask for some type of financial assistance or for your friend to give your parents complete ownership.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg45f1y", "score_hidden": false, "stickied": false, "created": 1491940352.0, "created_utc": 1491911552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 624}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4e3um", "gilded": 0, "archived": false, "score": 97, "report_reasons": null, "author": "divastating", "parent_id": "t1_dg44tj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This was my initial reaction as well. I can't fathom allowing someone to sleep in MY bed in MY parent's house and me sleeping on the couch. Absolutely not, never", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was my initial reaction as well. I can&amp;#39;t fathom allowing someone to sleep in MY bed in MY parent&amp;#39;s house and me sleeping on the couch. Absolutely not, never&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4e3um", "score_hidden": false, "stickied": false, "created": 1491952540.0, "created_utc": 1491923740.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 97}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4h7hg", "gilded": 0, "archived": false, "score": 105, "report_reasons": null, "author": "Hanolva", "parent_id": "t1_dg4ew81", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wow. She's no friend. I would have said, \"why were you in my bed? Isn't that a bit strange? Since I did not okay you sleeping in my bed, and you made a mess of my sheets, it is on YOU to wash my bedsheets.\" And she would have done just that if she wanted to stick around.\n\nI'd also have locked my door. Honestly, who is this person? Sorry you're a pushover. I hope you can figure that out before someone else takes advantage of you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. She&amp;#39;s no friend. I would have said, &amp;quot;why were you in my bed? Isn&amp;#39;t that a bit strange? Since I did not okay you sleeping in my bed, and you made a mess of my sheets, it is on YOU to wash my bedsheets.&amp;quot; And she would have done just that if she wanted to stick around.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d also have locked my door. Honestly, who is this person? Sorry you&amp;#39;re a pushover. I hope you can figure that out before someone else takes advantage of you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4h7hg", "score_hidden": false, "stickied": false, "created": 1491955971.0, "created_utc": 1491927171.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 105}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4t7ch", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "munchbunny", "parent_id": "t1_dg4ew81", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "About the \"pick your battles\" point: when it comes to growing a backbone, one of the first things I had to learn was that \"picking your battles\" is usually how I justified avoiding confrontation. I wasn't actually picking my battles wisely, I was trying to make myself feel better after I let someone walk over me.\n\nIf you're actually trying to pick your battles, the battle you *need* to fight is the one right where your boundary is, not once they've already marched past it. Confrontation *has to happen* when it's fresh in mind so that it's clear you're not letting it slide.\n\nFor example, in the \"mascara on the pillowcase\" situation, I would have immediately responded \"I'm sorry to hear that, but going into my room without my permission is not okay, and getting your makeup on my pillowcase is even worse. If you're going to stay here you need to show respect.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;About the &amp;quot;pick your battles&amp;quot; point: when it comes to growing a backbone, one of the first things I had to learn was that &amp;quot;picking your battles&amp;quot; is usually how I justified avoiding confrontation. I wasn&amp;#39;t actually picking my battles wisely, I was trying to make myself feel better after I let someone walk over me.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re actually trying to pick your battles, the battle you &lt;em&gt;need&lt;/em&gt; to fight is the one right where your boundary is, not once they&amp;#39;ve already marched past it. Confrontation &lt;em&gt;has to happen&lt;/em&gt; when it&amp;#39;s fresh in mind so that it&amp;#39;s clear you&amp;#39;re not letting it slide.&lt;/p&gt;\n\n&lt;p&gt;For example, in the &amp;quot;mascara on the pillowcase&amp;quot; situation, I would have immediately responded &amp;quot;I&amp;#39;m sorry to hear that, but going into my room without my permission is not okay, and getting your makeup on my pillowcase is even worse. If you&amp;#39;re going to stay here you need to show respect.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4t7ch", "score_hidden": false, "stickied": false, "created": 1491968978.0, "created_utc": 1491940178.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ew81", "gilded": 0, "archived": false, "score": 89, "report_reasons": null, "author": "prettynacho", "parent_id": "t1_dg44tj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This does make me sound like a pretty bad pushover, which I fully admit I have been throughout this situation. But she had already been in my room earlier that day and when I arrived home she told me I might need to wash my pillow case because she cried mascara on it......that pissed me off enough that I told her to wash it herself and stay in there. I was home to relax and spend time with my family. Kind of a \"pick your battles\" thing for me....should have been wiser.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This does make me sound like a pretty bad pushover, which I fully admit I have been throughout this situation. But she had already been in my room earlier that day and when I arrived home she told me I might need to wash my pillow case because she cried mascara on it......that pissed me off enough that I told her to wash it herself and stay in there. I was home to relax and spend time with my family. Kind of a &amp;quot;pick your battles&amp;quot; thing for me....should have been wiser.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ew81", "score_hidden": false, "stickied": false, "created": 1491953411.0, "created_utc": 1491924611.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 89}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44tj2", "gilded": 0, "archived": false, "score": 360, "report_reasons": null, "author": "helendestroy", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; or even sleeping in my bed (so I have to sleep on the couch).\n\n... if someone refuses to get out of your bed, you strip the sheets. Seriously, learn to set and keep boundaries. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;or even sleeping in my bed (so I have to sleep on the couch).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;... if someone refuses to get out of your bed, you strip the sheets. Seriously, learn to set and keep boundaries. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg44tj2", "score_hidden": false, "stickied": false, "created": 1491939050.0, "created_utc": 1491910250.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 360}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4fspz", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "MathHatter", "parent_id": "t1_dg42hxl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, you can't control your parents' relationship with her and Rocco at this point. That cat was out of the bag a few months ago. You can explain to your parents what your boundaries are with regards to Laura (and why) -- for instance, that she shouldn't be allowed into your room, or that you'd like to be able to schedule visits at your parents' house without her there (in which case they should ask her to leave if she shows up). And you should communicate those boundaries to Laura as well. But you can't demand that you get veto power over all your parents' interactions with her and Rocco.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, you can&amp;#39;t control your parents&amp;#39; relationship with her and Rocco at this point. That cat was out of the bag a few months ago. You can explain to your parents what your boundaries are with regards to Laura (and why) -- for instance, that she shouldn&amp;#39;t be allowed into your room, or that you&amp;#39;d like to be able to schedule visits at your parents&amp;#39; house without her there (in which case they should ask her to leave if she shows up). And you should communicate those boundaries to Laura as well. But you can&amp;#39;t demand that you get veto power over all your parents&amp;#39; interactions with her and Rocco.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4fspz", "score_hidden": false, "stickied": false, "created": 1491954418.0, "created_utc": 1491925618.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 20}}], "after": null, "before": null}}, "user_reports": [], "id": "dg42hxl", "gilded": 0, "archived": false, "score": 195, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Two things: \n\nYou need to let your parents make their own choices. If they want to keep Rocco around, then that is their choice. However, I would let your parents know that you are not going to be helping Friend anymore.\n\nStop letting her walk all over you. If she is in your bed, ask her to get out of your room.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Two things: &lt;/p&gt;\n\n&lt;p&gt;You need to let your parents make their own choices. If they want to keep Rocco around, then that is their choice. However, I would let your parents know that you are not going to be helping Friend anymore.&lt;/p&gt;\n\n&lt;p&gt;Stop letting her walk all over you. If she is in your bed, ask her to get out of your room.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg42hxl", "score_hidden": false, "stickied": false, "created": 1491932703.0, "created_utc": 1491903903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 195}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg47z2t", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Whallywhaler", "parent_id": "t1_dg47qed", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes. Of course you can lay into her. And you should. Hell, think of it as a favor. \n\nShe's not to stay with you any more. Your parents assistance with the dog is their choice but sit down with your dad and make it very clear they are never to help her anymore than this. If she ever shows up again crying saying you owe her $? \"Sorry that's between you and OP\". Give nothing else to this girl. She's a constant victim. You will never help enough. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Of course you can lay into her. And you should. Hell, think of it as a favor. &lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s not to stay with you any more. Your parents assistance with the dog is their choice but sit down with your dad and make it very clear they are never to help her anymore than this. If she ever shows up again crying saying you owe her $? &amp;quot;Sorry that&amp;#39;s between you and OP&amp;quot;. Give nothing else to this girl. She&amp;#39;s a constant victim. You will never help enough. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47z2t", "score_hidden": false, "stickied": false, "created": 1491944795.0, "created_utc": 1491915995.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4dpym", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "oralbglide", "parent_id": "t1_dg49wkx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Why do you think she continues to have fall outs with other people? Probably bc she isn't a good person and this is a repeated pattern of behavior for her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why do you think she continues to have fall outs with other people? Probably bc she isn&amp;#39;t a good person and this is a repeated pattern of behavior for her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4dpym", "score_hidden": false, "stickied": false, "created": 1491952104.0, "created_utc": 1491923304.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg55yep", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "ViviElnora", "parent_id": "t1_dg4h82d", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You would not be a \"driving factor\" of a possible suicide attempt. Your response would be a minor contribution to the true driving factors, her depression, possible narcissism, and other mental health disorders. If you feel you need to do something, let her know you are worried about how she is struggling to heal from the abuse (you could give her the \"benefit of the doubt\" and partially blame her behavior on the abuse) and that you hope she will find the strength to get professional help because she deserves to be healthy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You would not be a &amp;quot;driving factor&amp;quot; of a possible suicide attempt. Your response would be a minor contribution to the true driving factors, her depression, possible narcissism, and other mental health disorders. If you feel you need to do something, let her know you are worried about how she is struggling to heal from the abuse (you could give her the &amp;quot;benefit of the doubt&amp;quot; and partially blame her behavior on the abuse) and that you hope she will find the strength to get professional help because she deserves to be healthy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg55yep", "score_hidden": false, "stickied": false, "created": 1491984695.0, "created_utc": 1491955895.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4h82d", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "prettynacho", "parent_id": "t1_dg4fuxs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks for your response. At this point it will most definitely be a fallout. I plan on being blunt about it.\n\nI think I have been avoiding the fallout for cowardly reasons. I'd rather drift away and remain amicable than have a total blunder, but that's no longer possible. It's also likely that I'll see her around my city or hometown, but that would be uncomfortable at worst, so doable. Lastly, I'm still somewhat concerned for her mental health. I don't want to be the driving factor for another attempt/downward spiral of hers. I know it wouldn't be my fault, but it is still an uncomfortable thought. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for your response. At this point it will most definitely be a fallout. I plan on being blunt about it.&lt;/p&gt;\n\n&lt;p&gt;I think I have been avoiding the fallout for cowardly reasons. I&amp;#39;d rather drift away and remain amicable than have a total blunder, but that&amp;#39;s no longer possible. It&amp;#39;s also likely that I&amp;#39;ll see her around my city or hometown, but that would be uncomfortable at worst, so doable. Lastly, I&amp;#39;m still somewhat concerned for her mental health. I don&amp;#39;t want to be the driving factor for another attempt/downward spiral of hers. I know it wouldn&amp;#39;t be my fault, but it is still an uncomfortable thought. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4h82d", "score_hidden": false, "stickied": false, "created": 1491955987.0, "created_utc": 1491927187.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4fuxs", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "MathHatter", "parent_id": "t1_dg49wkx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Why is it a problem if you have a fallout with her? If it would make you feel better to be blunt and honest with her, do it. And if that results in a falling out, not her learning any lessons, then why is that a problem for you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why is it a problem if you have a fallout with her? If it would make you feel better to be blunt and honest with her, do it. And if that results in a falling out, not her learning any lessons, then why is that a problem for you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4fuxs", "score_hidden": false, "stickied": false, "created": 1491954486.0, "created_utc": 1491925686.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4egkl", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "stink3rbelle", "parent_id": "t1_dg49wkx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Not sure if it's naïveté or ignorance. Maybe a combination of the two.\n\nIt could also be poor emotion management or a mental health issue. If your parents have any pull over her, I would suggest they make her getting professional help a prerequisite to housing Rocco.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Not sure if it&amp;#39;s naïveté or ignorance. Maybe a combination of the two.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It could also be poor emotion management or a mental health issue. If your parents have any pull over her, I would suggest they make her getting professional help a prerequisite to housing Rocco.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4egkl", "score_hidden": false, "stickied": false, "created": 1491952933.0, "created_utc": 1491924133.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg63krq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cinnapear", "parent_id": "t1_dg49wkx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are such a doormat.  If someone wrongs you, you either tell them off or avoid them.  Get it together, girl.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are such a doormat.  If someone wrongs you, you either tell them off or avoid them.  Get it together, girl.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg63krq", "score_hidden": false, "stickied": false, "created": 1492042785.0, "created_utc": 1492013985.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49wkx", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "prettynacho", "parent_id": "t1_dg47qed", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you for your response. I understand that I could lay into her, but I'm not sure it would ever get through to her. She's had so many falling outs with people in the past and she genuinely does not understand that she is he common denominator in these situations. She's even had men tell her straight up via text message \"I told you on our first date that I am not interested in a relationship and since you are starting to get feelings I think we should end it\" and she tells me she doesn't understand because she thought she could change him. Not sure if it's naïveté or ignorance. Maybe a combination of the two. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your response. I understand that I could lay into her, but I&amp;#39;m not sure it would ever get through to her. She&amp;#39;s had so many falling outs with people in the past and she genuinely does not understand that she is he common denominator in these situations. She&amp;#39;s even had men tell her straight up via text message &amp;quot;I told you on our first date that I am not interested in a relationship and since you are starting to get feelings I think we should end it&amp;quot; and she tells me she doesn&amp;#39;t understand because she thought she could change him. Not sure if it&amp;#39;s naïveté or ignorance. Maybe a combination of the two. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg49wkx", "score_hidden": false, "stickied": false, "created": 1491947493.0, "created_utc": 1491918693.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 36}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47qed", "gilded": 0, "archived": false, "score": 81, "report_reasons": null, "author": "kifferella", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You say you \"know\" you cannot lay into her and I am curious about this statement...\n\nBecause you can, and should. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You say you &amp;quot;know&amp;quot; you cannot lay into her and I am curious about this statement...&lt;/p&gt;\n\n&lt;p&gt;Because you can, and should. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47qed", "score_hidden": false, "stickied": false, "created": 1491944414.0, "created_utc": 1491915614.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 81}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4pklb", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "lousymom", "parent_id": "t1_dg49e4j", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It sounds like you really need to sit down and have a chat with your parents about how this woman has behaved. It seems like she is now driving a wedge in between you and your parents as well. This is something you should discuss with them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like you really need to sit down and have a chat with your parents about how this woman has behaved. It seems like she is now driving a wedge in between you and your parents as well. This is something you should discuss with them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4pklb", "score_hidden": false, "stickied": false, "created": 1491965114.0, "created_utc": 1491936314.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49e4j", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "prettynacho", "parent_id": "t1_dg44tgj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you for your comment, I appreciate it.\n\n&gt; I don't understand why she is still going to your place when you mentioned she found one of her own, the one that doesn't allow dogs?\n\nShe hasn't been to my apartment in months. When she goes to drop off or pickup her dog from my parents place she has a habit of staying to study or chat with whoever is there. And she no longer gives warning of that which is why she's been there every time I'm home.\n\n&gt;She seems like the kind of person that is poor at understanding what we consider to be normal social exchange\n\nI think you really hit the nail on the head with this one. It's something to consider and also something a friend has pointed out in the past. I agree that I should have installed boundaries further in the past and not let things slide. I am at fault for that but dealing with the backlash didn't seem worth it at the time. I like your email idea and think I will do that. Thanks again!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your comment, I appreciate it.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I don&amp;#39;t understand why she is still going to your place when you mentioned she found one of her own, the one that doesn&amp;#39;t allow dogs?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;She hasn&amp;#39;t been to my apartment in months. When she goes to drop off or pickup her dog from my parents place she has a habit of staying to study or chat with whoever is there. And she no longer gives warning of that which is why she&amp;#39;s been there every time I&amp;#39;m home.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;She seems like the kind of person that is poor at understanding what we consider to be normal social exchange&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think you really hit the nail on the head with this one. It&amp;#39;s something to consider and also something a friend has pointed out in the past. I agree that I should have installed boundaries further in the past and not let things slide. I am at fault for that but dealing with the backlash didn&amp;#39;t seem worth it at the time. I like your email idea and think I will do that. Thanks again!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg49e4j", "score_hidden": false, "stickied": false, "created": 1491946814.0, "created_utc": 1491918014.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 45}}], "after": null, "before": null}}, "user_reports": [], "id": "dg44tgj", "gilded": 0, "archived": false, "score": 70, "report_reasons": null, "author": "petoburn", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't understand why she is still going to your place when you mentioned she found one of her own, the one that doesn't allow dogs? Change the locks, ask for the key back, hell tell the landlord that your purse got stolen so they'll pay for it if you need to. You don't need someone walking into your place, and if things escalate, I wouldn't want her to have access to my personal stuff either.\n\n\nShe seems like the kind of person that is poor at understanding what we consider to be normal social exchanges (i.e. I'll shout you a drink seeing as you did xyz for me), sees only how things impact on her (maybe a narcissist?) and will take without realizing that she isn't giving in return. Unfortunately until now you've let her without installing any boundaries, so from her perspective things were fine until you ditched her for this event. I think you need to be honest about what she's been doing that is upsetting you, i.e. not doing favors, using your place rent free without offering anything in return and demanding small sums of money for things like drinks. I don't expect this relationship to end well at all, but I'd lay it all out to her in something like an email, coz she'll probably just blow up at you in person, so that you both have some kind of closure - you'll feel like you've said your piece, and she'll feel hard-done by, realize you're no longer going to give her what she wants, and move on to the next person. Or maybe she'll have a massive awakening and sort herself out, who knows.\n\n\nI'd probably then forward the email to my parents, let them know you appreciate them helping when you asked and its their decision to keep doing so or not, you won't mind either way, but that you feel she's now abusing your friendship and you won't be assisting her anymore. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t understand why she is still going to your place when you mentioned she found one of her own, the one that doesn&amp;#39;t allow dogs? Change the locks, ask for the key back, hell tell the landlord that your purse got stolen so they&amp;#39;ll pay for it if you need to. You don&amp;#39;t need someone walking into your place, and if things escalate, I wouldn&amp;#39;t want her to have access to my personal stuff either.&lt;/p&gt;\n\n&lt;p&gt;She seems like the kind of person that is poor at understanding what we consider to be normal social exchanges (i.e. I&amp;#39;ll shout you a drink seeing as you did xyz for me), sees only how things impact on her (maybe a narcissist?) and will take without realizing that she isn&amp;#39;t giving in return. Unfortunately until now you&amp;#39;ve let her without installing any boundaries, so from her perspective things were fine until you ditched her for this event. I think you need to be honest about what she&amp;#39;s been doing that is upsetting you, i.e. not doing favors, using your place rent free without offering anything in return and demanding small sums of money for things like drinks. I don&amp;#39;t expect this relationship to end well at all, but I&amp;#39;d lay it all out to her in something like an email, coz she&amp;#39;ll probably just blow up at you in person, so that you both have some kind of closure - you&amp;#39;ll feel like you&amp;#39;ve said your piece, and she&amp;#39;ll feel hard-done by, realize you&amp;#39;re no longer going to give her what she wants, and move on to the next person. Or maybe she&amp;#39;ll have a massive awakening and sort herself out, who knows.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d probably then forward the email to my parents, let them know you appreciate them helping when you asked and its their decision to keep doing so or not, you won&amp;#39;t mind either way, but that you feel she&amp;#39;s now abusing your friendship and you won&amp;#39;t be assisting her anymore. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg44tgj", "score_hidden": false, "stickied": false, "created": 1491939046.0, "created_utc": 1491910246.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 70}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4ev92", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "annarchy8", "parent_id": "t1_dg4ec07", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's never a bad thing to be nice to people. But you have to stand up for yourself when someone mistakes your kindness for weakness and starts walking all over you. Otherwise, they will just take advantage of you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s never a bad thing to be nice to people. But you have to stand up for yourself when someone mistakes your kindness for weakness and starts walking all over you. Otherwise, they will just take advantage of you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ev92", "score_hidden": false, "stickied": false, "created": 1491953380.0, "created_utc": 1491924580.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4ec07", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "prettynacho", "parent_id": "t1_dg4bdec", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This does make me sound like a pretty bad pushover, which I fully admit I have been throughout this situation. But she had already been in my room earlier that day and when I arrived home she told me I might need to wash my pillow case because she cried mascara on it......that pissed me off enough that I told her to wash it herself and stay in there. I was home to relax and spend time with my family. Kind of a \"pick your battles\" thing for me....should have been wiser. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This does make me sound like a pretty bad pushover, which I fully admit I have been throughout this situation. But she had already been in my room earlier that day and when I arrived home she told me I might need to wash my pillow case because she cried mascara on it......that pissed me off enough that I told her to wash it herself and stay in there. I was home to relax and spend time with my family. Kind of a &amp;quot;pick your battles&amp;quot; thing for me....should have been wiser. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ec07", "score_hidden": false, "stickied": false, "created": 1491952794.0, "created_utc": 1491923994.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4bdec", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "annarchy8", "parent_id": "t1_dg463fo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Taking in a friend in need is definitely not what makes her a doormat. Overextending herself, not setting clear boundaries, not communicating that she felt used, though, make her a doormat. Seriously, she allowed her friend to sleep in her bed while she slept in the couch?? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Taking in a friend in need is definitely not what makes her a doormat. Overextending herself, not setting clear boundaries, not communicating that she felt used, though, make her a doormat. Seriously, she allowed her friend to sleep in her bed while she slept in the couch?? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4bdec", "score_hidden": false, "stickied": false, "created": 1491949367.0, "created_utc": 1491920567.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, "user_reports": [], "id": "dg463fo", "gilded": 0, "archived": false, "score": 57, "report_reasons": null, "author": "applekins20", "parent_id": "t1_dg43fyf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "In fairness she stated that much before anything really unfolded. If my friend texted me that they had been abused, I would try to take them in as well. I'd like to think most people would. I don't think that makes you a doormat. \n\nI'd argue OP's fault was over-extending her kindness without really knowing the person/situation. And then not putting limits/barriers when things got bad. She didn't communicate at all that this girl was behaving poorly and so of course now the girl is playing the victim card. \n\nBut taking in someone who's been abused is not a flaw, nor does it make you a doormat. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In fairness she stated that much before anything really unfolded. If my friend texted me that they had been abused, I would try to take them in as well. I&amp;#39;d like to think most people would. I don&amp;#39;t think that makes you a doormat. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d argue OP&amp;#39;s fault was over-extending her kindness without really knowing the person/situation. And then not putting limits/barriers when things got bad. She didn&amp;#39;t communicate at all that this girl was behaving poorly and so of course now the girl is playing the victim card. &lt;/p&gt;\n\n&lt;p&gt;But taking in someone who&amp;#39;s been abused is not a flaw, nor does it make you a doormat. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg463fo", "score_hidden": false, "stickied": false, "created": 1491941672.0, "created_utc": 1491912872.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 57}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5t46c", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "uncoupdefoudre", "parent_id": "t1_dg58a2y", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Agreed! I think we are saying the same thing :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agreed! I think we are saying the same thing :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5t46c", "score_hidden": false, "stickied": false, "created": 1492029999.0, "created_utc": 1492001199.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58a2y", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Clovergendered", "parent_id": "t1_dg57ze1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I dunno. After many, many /r/relationships stories I'm no longer too shocked by what a lot of the posters describe as \"friends\" actually being abusive and manipulative leeches who are barely acquaintances and contribute nothing to the \"friendship\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I dunno. After many, many &lt;a href=\"/r/relationships\"&gt;/r/relationships&lt;/a&gt; stories I&amp;#39;m no longer too shocked by what a lot of the posters describe as &amp;quot;friends&amp;quot; actually being abusive and manipulative leeches who are barely acquaintances and contribute nothing to the &amp;quot;friendship&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg58a2y", "score_hidden": false, "stickied": false, "created": 1491987770.0, "created_utc": 1491958970.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg57ze1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "uncoupdefoudre", "parent_id": "t1_dg43fyf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I am a very protective friend\n\nThat line stuck out at me for a different reason. I didn't even get the impression that Laura was an actual *friend*, more like a long-term acquaintance:\n\n&gt; I have known this girl, Laura, from my hometown (let's call it A) since we were young and played a sport together. Our interaction was always friendly but we didn't hang out outside of sports. Then I went away for college and would see her maybe once a year when I visited home. Now I am graduated and living on my own a few hours away in a city we'll call B.\n\nI mean, I know it is possible to stay close while not talking much but OP be honest - prior to all this, would you have called her a close friend? \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I am a very protective friend&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That line stuck out at me for a different reason. I didn&amp;#39;t even get the impression that Laura was an actual &lt;em&gt;friend&lt;/em&gt;, more like a long-term acquaintance:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I have known this girl, Laura, from my hometown (let&amp;#39;s call it A) since we were young and played a sport together. Our interaction was always friendly but we didn&amp;#39;t hang out outside of sports. Then I went away for college and would see her maybe once a year when I visited home. Now I am graduated and living on my own a few hours away in a city we&amp;#39;ll call B.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I mean, I know it is possible to stay close while not talking much but OP be honest - prior to all this, would you have called her a close friend? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg57ze1", "score_hidden": false, "stickied": false, "created": 1491987386.0, "created_utc": 1491958586.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg43fyf", "gilded": 0, "archived": false, "score": 229, "report_reasons": null, "author": "Clovergendered", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I am a very protective friend \n\nTranslation: I am a doormat from a family of doormats. This person is not a \"friend\", she's just someone who knows you will ask \"how high?\" when she says \"jump\" and takes advantage of the fact. You finally seem to be aware of that, so stop. Just stop. Your parents will have to make their own choices unfortunately.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I am a very protective friend &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Translation: I am a doormat from a family of doormats. This person is not a &amp;quot;friend&amp;quot;, she&amp;#39;s just someone who knows you will ask &amp;quot;how high?&amp;quot; when she says &amp;quot;jump&amp;quot; and takes advantage of the fact. You finally seem to be aware of that, so stop. Just stop. Your parents will have to make their own choices unfortunately.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg43fyf", "score_hidden": false, "stickied": false, "created": 1491935586.0, "created_utc": 1491906786.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 229}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4eb4l", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "stink3rbelle", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;according to my mom she just stands in the door for 5 minutes crying (presumably for attention or comforting). My mom just ignored it. \n\nDoes your mom know that this young woman conned her out of the money for that event? Your mom is doing well here not giving in to obvious dramatics. I would have a little faith that she and your father can handle this woman's manipulations as well. It's up to them about the dog, and it's not your place to involve yourself there. Distance yourself from the issue, and distance yourself from this woman. I don't think you're out of line to confront her, either, at least via text:\n\"Laura, you left me in the lurch for plans for the event, I had no way to know your plans or read your mind, and you *specifically* ignored two communications from me asking for confirmation. It was not unreasonable to learn from that that you did not plan to go. You turned around and asked my parents to pay you for it when you still haven't paid me back. Don't stoop to the level of a conman and then try to come to me saying how *I* wronged *you*. My parents are free to do as they choose, and I will try to be civil if I run into you at their house, but I don't want to see you or hear from you again outside of there. When I'm there, I also expect you to let me sleep in my own bed if you really can't remove yourself for a brief time.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;according to my mom she just stands in the door for 5 minutes crying (presumably for attention or comforting). My mom just ignored it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Does your mom know that this young woman conned her out of the money for that event? Your mom is doing well here not giving in to obvious dramatics. I would have a little faith that she and your father can handle this woman&amp;#39;s manipulations as well. It&amp;#39;s up to them about the dog, and it&amp;#39;s not your place to involve yourself there. Distance yourself from the issue, and distance yourself from this woman. I don&amp;#39;t think you&amp;#39;re out of line to confront her, either, at least via text:\n&amp;quot;Laura, you left me in the lurch for plans for the event, I had no way to know your plans or read your mind, and you &lt;em&gt;specifically&lt;/em&gt; ignored two communications from me asking for confirmation. It was not unreasonable to learn from that that you did not plan to go. You turned around and asked my parents to pay you for it when you still haven&amp;#39;t paid me back. Don&amp;#39;t stoop to the level of a conman and then try to come to me saying how &lt;em&gt;I&lt;/em&gt; wronged &lt;em&gt;you&lt;/em&gt;. My parents are free to do as they choose, and I will try to be civil if I run into you at their house, but I don&amp;#39;t want to see you or hear from you again outside of there. When I&amp;#39;m there, I also expect you to let me sleep in my own bed if you really can&amp;#39;t remove yourself for a brief time.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4eb4l", "score_hidden": false, "stickied": false, "created": 1491952766.0, "created_utc": 1491923966.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4d82i", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "odietamoquareidfacia", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Did you tell your parents that she made you pay for a drink when she was living with you rent free, that you didn't owe her anything and she scammed them and that he has been mooching of you and have the nerve to say that you ditched on her?\n\nTell them everything, tell them that if you give her an inch she will take a mile, and then block Laura in all your devices like all her friends did before you and will do after you, because she is an user. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you tell your parents that she made you pay for a drink when she was living with you rent free, that you didn&amp;#39;t owe her anything and she scammed them and that he has been mooching of you and have the nerve to say that you ditched on her?&lt;/p&gt;\n\n&lt;p&gt;Tell them everything, tell them that if you give her an inch she will take a mile, and then block Laura in all your devices like all her friends did before you and will do after you, because she is an user. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4d82i", "score_hidden": false, "stickied": false, "created": 1491951532.0, "created_utc": 1491922732.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4et9d", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "prettynacho", "parent_id": "t1_dg4cbx9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Laura did pay for the ticket herself. The event required prior pickup of a shirt, bag, etc. that she asked me to do for her. I had her stuff for a week and she made no arrangements to grab it or come to the pregame in time. Regardless, my parents did not owe her a dime and I can't imagine she's that oblivious to not understand that!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Laura did pay for the ticket herself. The event required prior pickup of a shirt, bag, etc. that she asked me to do for her. I had her stuff for a week and she made no arrangements to grab it or come to the pregame in time. Regardless, my parents did not owe her a dime and I can&amp;#39;t imagine she&amp;#39;s that oblivious to not understand that!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4et9d", "score_hidden": false, "stickied": false, "created": 1491953318.0, "created_utc": 1491924518.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4cbx9", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "graceandpoise_pffft", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Soooo you bought her ticket to the event, and she told your mom that you owed her money for the event?\n\nI'd be telling Momma that Laura needs to be paying her that money back. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Soooo you bought her ticket to the event, and she told your mom that you owed her money for the event?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d be telling Momma that Laura needs to be paying her that money back. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4cbx9", "score_hidden": false, "stickied": false, "created": 1491950511.0, "created_utc": 1491921711.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4b95r", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4b95r", "score_hidden": false, "stickied": false, "created": 1491949222.0, "created_utc": 1491920422.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4faet", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "fire-toe-fighter", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This girl is a piece of work. She's the one who ditched you! And took everything for granted - your family has gone above and beyond frankly. \n\nThe dog thing with your parents - I'd leave that be for now because it is ultimately making your parents happier. But I'd make a point of saying, having taking advantage of your parents by demanding that money, that she is no longer welcome in your home. Just the dog. \n\nHer response to this will be telling. And may even determine whether you should escalate to talking to your parents about banning the dog (if her response is way out of line). If things escalate, your parents would hopefully do the right thing in valuing their daughter's dignity and self-respect over their dog's playmate. You sound like a good person. Do you really waste your energy on someone who is happy to stick a knife in you to save their own face?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This girl is a piece of work. She&amp;#39;s the one who ditched you! And took everything for granted - your family has gone above and beyond frankly. &lt;/p&gt;\n\n&lt;p&gt;The dog thing with your parents - I&amp;#39;d leave that be for now because it is ultimately making your parents happier. But I&amp;#39;d make a point of saying, having taking advantage of your parents by demanding that money, that she is no longer welcome in your home. Just the dog. &lt;/p&gt;\n\n&lt;p&gt;Her response to this will be telling. And may even determine whether you should escalate to talking to your parents about banning the dog (if her response is way out of line). If things escalate, your parents would hopefully do the right thing in valuing their daughter&amp;#39;s dignity and self-respect over their dog&amp;#39;s playmate. You sound like a good person. Do you really waste your energy on someone who is happy to stick a knife in you to save their own face?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4faet", "score_hidden": false, "stickied": false, "created": 1491953853.0, "created_utc": 1491925053.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4ifr9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "macimom", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Laura you have been exploiting me and ben unappreciative of everything my family and I have done for you.  Please dont contact m again.\"\n\nYour parents are going to have to set their own boundaries.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Laura you have been exploiting me and ben unappreciative of everything my family and I have done for you.  Please dont contact m again.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Your parents are going to have to set their own boundaries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ifr9", "score_hidden": false, "stickied": false, "created": 1491957310.0, "created_utc": 1491928510.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg49rxt", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "starshine1988", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You should definitely lay into her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should definitely lay into her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg49rxt", "score_hidden": false, "stickied": false, "created": 1491947322.0, "created_utc": 1491918522.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4nn6n", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "OTL_OTL_OTL", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;. I also am unsure what to do with my parents. Help!\n\nI guarantee you they are ok looking after the dog because they like the dog and maybe got attached, not because they care any bit for your \"friend\" aka the moocher\n\nStop doing favors for the friend and also let your parents know you' no longer want to be friends. Whatever they end up doing with her is up to them but also be clear to your parents to not give her money to settle any \"debts\" she claims to have from you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;. I also am unsure what to do with my parents. Help!&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I guarantee you they are ok looking after the dog because they like the dog and maybe got attached, not because they care any bit for your &amp;quot;friend&amp;quot; aka the moocher&lt;/p&gt;\n\n&lt;p&gt;Stop doing favors for the friend and also let your parents know you&amp;#39; no longer want to be friends. Whatever they end up doing with her is up to them but also be clear to your parents to not give her money to settle any &amp;quot;debts&amp;quot; she claims to have from you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4nn6n", "score_hidden": false, "stickied": false, "created": 1491962999.0, "created_utc": 1491934199.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg52bai", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "whirlingderv", "parent_id": "t1_dg4nzvz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Suddenly I'm understanding what might have driven her parents to be so dead-set against her getting a dog. They probably knew all of the care was going to fall to them and so forbidding her bringing one home is the only way they could set boundaries against becoming unwilling dog owners themselves for their daughter's convenience.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Suddenly I&amp;#39;m understanding what might have driven her parents to be so dead-set against her getting a dog. They probably knew all of the care was going to fall to them and so forbidding her bringing one home is the only way they could set boundaries against becoming unwilling dog owners themselves for their daughter&amp;#39;s convenience.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg52bai", "score_hidden": false, "stickied": false, "created": 1491979800.0, "created_utc": 1491951000.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4nzvz", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "prettynacho", "parent_id": "t1_dg4l7vg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My thoughts exactly on the dog front. My parents just finally got Rocco all house trained. And he's 3 years old. Poor guy doesn't deserve it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My thoughts exactly on the dog front. My parents just finally got Rocco all house trained. And he&amp;#39;s 3 years old. Poor guy doesn&amp;#39;t deserve it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4nzvz", "score_hidden": false, "stickied": false, "created": 1491963391.0, "created_utc": 1491934591.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4l7vg", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "simpleadvice4u", "parent_id": "t1_dg4k2q9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My hope is that you somehow feed her need to play the victim, that she chooses to believe your parents think that of her, and that she packs her bag of woe and hurt feels and heads someplace else.\n\nFFS tho, how bad a dog owner do you have to be to take a place to live THAT DOESN'T ALLOW DOGS? There was almost certainly a place she could've rented that allowed dogs, but it no doubt had some associated inconvenience -- distance from where she wanted to be, lower standard of cleanliness, whatever. But if you aren't ready to make that sort of sacrifice, you don't get a dog, period. Drives me nuts.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My hope is that you somehow feed her need to play the victim, that she chooses to believe your parents think that of her, and that she packs her bag of woe and hurt feels and heads someplace else.&lt;/p&gt;\n\n&lt;p&gt;FFS tho, how bad a dog owner do you have to be to take a place to live THAT DOESN&amp;#39;T ALLOW DOGS? There was almost certainly a place she could&amp;#39;ve rented that allowed dogs, but it no doubt had some associated inconvenience -- distance from where she wanted to be, lower standard of cleanliness, whatever. But if you aren&amp;#39;t ready to make that sort of sacrifice, you don&amp;#39;t get a dog, period. Drives me nuts.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4l7vg", "score_hidden": false, "stickied": false, "created": 1491960346.0, "created_utc": 1491931546.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4nxjp", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "OTL_OTL_OTL", "parent_id": "t1_dg4k2q9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So basically she lies and tries to gaslight you. Why bother keeping the friendship? She's not just a terrible moocher, she's also a lying manipulator. Ditch her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So basically she lies and tries to gaslight you. Why bother keeping the friendship? She&amp;#39;s not just a terrible moocher, she&amp;#39;s also a lying manipulator. Ditch her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4nxjp", "score_hidden": false, "stickied": false, "created": 1491963319.0, "created_utc": 1491934519.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4k2q9", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "prettynacho", "parent_id": "t1_dg4dzbi", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Worst part is, I already rehashed the events of that day with her the next day. Complete with screenshots of the texts. She claims to not have received all my texts and sent me a screenshot where she deleted some of them. We both have iPhones....it says delivered in those messages lol. I told her I was not expected to cater to her, nor should I be. \n\n&gt; You love to play the victim, and it is exhausting. I do not care that you are upset with me. You have been using both myself and my family for close to half a year, and you do absolutely nothing in appreciation. The fact that you asked my mother for money is the most entitled, ungrateful, sneaky, thieving, pathetic thing I have ever heard in my life. \n\nThis...this I like. Thank you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Worst part is, I already rehashed the events of that day with her the next day. Complete with screenshots of the texts. She claims to not have received all my texts and sent me a screenshot where she deleted some of them. We both have iPhones....it says delivered in those messages lol. I told her I was not expected to cater to her, nor should I be. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You love to play the victim, and it is exhausting. I do not care that you are upset with me. You have been using both myself and my family for close to half a year, and you do absolutely nothing in appreciation. The fact that you asked my mother for money is the most entitled, ungrateful, sneaky, thieving, pathetic thing I have ever heard in my life. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This...this I like. Thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4k2q9", "score_hidden": false, "stickied": false, "created": 1491959090.0, "created_utc": 1491930290.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4dzbi", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "simpleadvice4u", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So you tell her why you are upset. \"I contacted you several times about the ticket, and you ignored me, so I went ahead with my plans. Instead of being responsible, you just expect people to take care of you while you behave in a wholly self-absorbed way. You love to play the victim, and it is exhausting. I do not care that you are upset with me. You have been using both myself and my family for close to half a year, and you do absolutely nothing in appreciation. The fact that you asked my mother for money is the most entitled, ungrateful, sneaky, thieving, pathetic thing I have ever heard in my life. My parents and I constantly talk about how we cannot wait for you to grow up and get out, just we know that you will start mooching off someone else, so we continue to allow your irresponsible behavior for the time being. But I want you to understand that -- we all see you as someone who pretends to be a victim because she fails at life.\"\n\nHopefully this shames her into getting the F out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you tell her why you are upset. &amp;quot;I contacted you several times about the ticket, and you ignored me, so I went ahead with my plans. Instead of being responsible, you just expect people to take care of you while you behave in a wholly self-absorbed way. You love to play the victim, and it is exhausting. I do not care that you are upset with me. You have been using both myself and my family for close to half a year, and you do absolutely nothing in appreciation. The fact that you asked my mother for money is the most entitled, ungrateful, sneaky, thieving, pathetic thing I have ever heard in my life. My parents and I constantly talk about how we cannot wait for you to grow up and get out, just we know that you will start mooching off someone else, so we continue to allow your irresponsible behavior for the time being. But I want you to understand that -- we all see you as someone who pretends to be a victim because she fails at life.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Hopefully this shames her into getting the F out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4dzbi", "score_hidden": false, "stickied": false, "created": 1491952400.0, "created_utc": 1491923600.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg45fzh", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "girder_shade", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The only victim here is the OP. Seriously grow a backbone. This girl is walking all over you...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only victim here is the OP. Seriously grow a backbone. This girl is walking all over you...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg45fzh", "score_hidden": false, "stickied": false, "created": 1491940408.0, "created_utc": 1491911608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4nkxd", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "wasuremon0", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you need to do some image management with your parents, before this girl comes between you and them.\n\nYeah, Yeah, your parents are adults and make their own choices.  But this girl is an expert at  smear campaigns. She's talked so much shit  about her ex boyfriend, exfriends, even her own parents. She's a charming liar. Now she's blackening YOUR name to your parents, all while triggering their nurturing instincts.  If you let it happen, she may take your parents from you.\n\nTake a day off work and visit them. Strengthen your ties with them. Warn them about this girl's modus operendai.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you need to do some image management with your parents, before this girl comes between you and them.&lt;/p&gt;\n\n&lt;p&gt;Yeah, Yeah, your parents are adults and make their own choices.  But this girl is an expert at  smear campaigns. She&amp;#39;s talked so much shit  about her ex boyfriend, exfriends, even her own parents. She&amp;#39;s a charming liar. Now she&amp;#39;s blackening YOUR name to your parents, all while triggering their nurturing instincts.  If you let it happen, she may take your parents from you.&lt;/p&gt;\n\n&lt;p&gt;Take a day off work and visit them. Strengthen your ties with them. Warn them about this girl&amp;#39;s modus operendai.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4nkxd", "score_hidden": false, "stickied": false, "created": 1491962927.0, "created_utc": 1491934127.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4s9y1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "fishsticks_inmymouth", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;I know I can't lay into her (even though I want to) \n\nGirl, why not? I encourage you to lay into her, actually. She's leaving you open to respond to a text that basically says \"Sorry you feel that way but I did nothing wrong\". Fucking tell her what she did wrong!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I know I can&amp;#39;t lay into her (even though I want to) &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Girl, why not? I encourage you to lay into her, actually. She&amp;#39;s leaving you open to respond to a text that basically says &amp;quot;Sorry you feel that way but I did nothing wrong&amp;quot;. Fucking tell her what she did wrong!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4s9y1", "score_hidden": false, "stickied": false, "created": 1491967990.0, "created_utc": 1491939190.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4lrvs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rabidhamster87", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Anything you say will just contribute to the hostility of the situation.  I would just give her a taste of her own medicine and stop replying to her messages.  If you don't want her in your life anymore, you have no obligation to continue your friendship with her.  It is your parents' decision to keep Rocco, so just leave that between your parents and her.  They know how you feel about it already, so talking about it with them anymore is just going to lead to problems.  If THEY bring up Laura, just be firm in your decision to no longer be friends.  You don't owe any explanations and they know you.  If you act like the bigger person by refusing to discuss it, it doesn't matter what she says because she will just dig herself a hole and they will start to realize how she is on their own.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Anything you say will just contribute to the hostility of the situation.  I would just give her a taste of her own medicine and stop replying to her messages.  If you don&amp;#39;t want her in your life anymore, you have no obligation to continue your friendship with her.  It is your parents&amp;#39; decision to keep Rocco, so just leave that between your parents and her.  They know how you feel about it already, so talking about it with them anymore is just going to lead to problems.  If THEY bring up Laura, just be firm in your decision to no longer be friends.  You don&amp;#39;t owe any explanations and they know you.  If you act like the bigger person by refusing to discuss it, it doesn&amp;#39;t matter what she says because she will just dig herself a hole and they will start to realize how she is on their own.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4lrvs", "score_hidden": false, "stickied": false, "created": 1491960949.0, "created_utc": 1491932149.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4lzbw", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "135791357", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"I am upset with you because you didn't respond to my texts in the days leading up to (event), and then had the nerve to blame me for leaving without you, and even demanding money from my parents. This is after all my family and I have done for you and your dog.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;I am upset with you because you didn&amp;#39;t respond to my texts in the days leading up to (event), and then had the nerve to blame me for leaving without you, and even demanding money from my parents. This is after all my family and I have done for you and your dog.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4lzbw", "score_hidden": false, "stickied": false, "created": 1491961173.0, "created_utc": 1491932373.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg59fsn", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Pathological_Liar-", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She's walking all over you. \n\nShe had a pretty sweet deal staying with you rent free. And even if you did set a bunch of rules for her staying there, she should follow them. I'm not saying you did, but her entitled ass should have zero things to complain about. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She&amp;#39;s walking all over you. &lt;/p&gt;\n\n&lt;p&gt;She had a pretty sweet deal staying with you rent free. And even if you did set a bunch of rules for her staying there, she should follow them. I&amp;#39;m not saying you did, but her entitled ass should have zero things to complain about. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg59fsn", "score_hidden": false, "stickied": false, "created": 1491989244.0, "created_utc": 1491960444.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5llud", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dodo_bird1979", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Call her and lay out why you're done with her. Then block her number. And if she starts trying to make you feel crazy, remember how many other people she's alienated like this. You are not the first person to go through this with her.\n\nRe: your parents and the dog, I would guess that once you sever your friendship with Laura, they will get tired of dealing with her and her dog pretty quickly. It's pretty hard to maintain a relationship with someone else's parents once you and their kid are no longer on speaking terms.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call her and lay out why you&amp;#39;re done with her. Then block her number. And if she starts trying to make you feel crazy, remember how many other people she&amp;#39;s alienated like this. You are not the first person to go through this with her.&lt;/p&gt;\n\n&lt;p&gt;Re: your parents and the dog, I would guess that once you sever your friendship with Laura, they will get tired of dealing with her and her dog pretty quickly. It&amp;#39;s pretty hard to maintain a relationship with someone else&amp;#39;s parents once you and their kid are no longer on speaking terms.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5llud", "score_hidden": false, "stickied": false, "created": 1492010325.0, "created_utc": 1491981525.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg5m6mx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tingiling", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your parents have to set their own boundaries with this girl. But you should still have a discussion with them about her and what your boundaries are here.\n\nThose boundaries should included that they never lie to you even if they think it will upset you, that they don't get involve with your arguments with her, that they don't give her money in your name ever again (does your mum realise that by paying your \"debt\" she agreed that you'd done something wrong and completly undermind the boundary you were trying to set with her), and they don't let her use your room even when you're not there. Explain why these are important boundaries and that you can't let this girl come between you on such important matters or in your own home.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your parents have to set their own boundaries with this girl. But you should still have a discussion with them about her and what your boundaries are here.&lt;/p&gt;\n\n&lt;p&gt;Those boundaries should included that they never lie to you even if they think it will upset you, that they don&amp;#39;t get involve with your arguments with her, that they don&amp;#39;t give her money in your name ever again (does your mum realise that by paying your &amp;quot;debt&amp;quot; she agreed that you&amp;#39;d done something wrong and completly undermind the boundary you were trying to set with her), and they don&amp;#39;t let her use your room even when you&amp;#39;re not there. Explain why these are important boundaries and that you can&amp;#39;t let this girl come between you on such important matters or in your own home.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5m6mx", "score_hidden": false, "stickied": false, "created": 1492011961.0, "created_utc": 1491983161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64prv8", "likes": null, "replies": "", "user_reports": [], "id": "dg4owv3", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "harkandhush", "parent_id": "t3_64prv8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't know how you could possibly reply to that text with anything other than LOL FUCK YOU.  Like she clearly can't be reasoned with and doesn't exist in reality.  This isn't a little miscommunication.  She's been living off of your family for a long as time and taking advantage of your kindness and has no regard for that.  Drop her ass.  She's not a friend.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know how you could possibly reply to that text with anything other than LOL FUCK YOU.  Like she clearly can&amp;#39;t be reasoned with and doesn&amp;#39;t exist in reality.  This isn&amp;#39;t a little miscommunication.  She&amp;#39;s been living off of your family for a long as time and taking advantage of your kindness and has no regard for that.  Drop her ass.  She&amp;#39;s not a friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4owv3", "score_hidden": false, "stickied": false, "created": 1491964396.0, "created_utc": 1491935596.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]