[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;[Personal Issues]\nMy post keeps being removed because the bot thinks I&amp;#39;m not tagging it properly. Hopefully it works this time.&lt;/p&gt;\n\n&lt;p&gt;Every person I (25F) hang out with, every friend, family member, co-worker, or random person I start chatting with, without even consciously doing it, I change to fit who they are. Any person I&amp;#39;ve dated, I&amp;#39;ve been a different person for. My taste in music changed. My taste in food, art, jokes, books, TV shows, it all changes depending on who I&amp;#39;m around. I&amp;#39;ve been keeping it a secret because I think it means I&amp;#39;m some kind of sociopath, but I have no problem with continuing to do it so I&amp;#39;m conflicted about it.&lt;/p&gt;\n\n&lt;p&gt;The best example I have is that at one point I lived in a country area and my best friend and romantic interest (let&amp;#39;s call him Rick) was a country boy through and through. I wore boots, I listened to nothing but country music, I helped out on his farm, and loved it all. None of it felt faked or forced. I was happy that way.&lt;/p&gt;\n\n&lt;p&gt;We went our separate ways and I moved to the city. My new best guy friend (let&amp;#39;s call him Joe) was a guy I met at work. I had a bit of a drug history and he has a crazy one. Our friendship is completely different than anything else. I listen to scremo and chat nonchalantly about drug use and make jokes I would have been offended by with my previous friend. We go out to bars and I started reading comic books and watching anime with him. Also became a huge fan of sifi. None of this ever feels fake either.&lt;/p&gt;\n\n&lt;p&gt;My boyfriend (let&amp;#39;s call him Jeff) is your classic rock guy. Longboards, plays guitar, listens to vinyl records, watched old and weird movies, but also loves new stuff. Listens to classic rock and indie-rock. Loves to go do 90&amp;#39;s style stuff like roller rinks, bowling, burger joints. And I love every minute of it. None of that feels fake either.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the kicker though, I can tell I&amp;#39;m different. I know the way I speak around my family, and every individual friend or coworker I have is completely different and adapted to their personality. It&amp;#39;s not a conscious choice I make, but afterwards it always hits me that I was different again.&lt;/p&gt;\n\n&lt;p&gt;The same goes with literally anyone I meet. I&amp;#39;m struggling with dating right now (I&amp;#39;m Polyamorous: having multiple meaningful relationships) because I find myself adapting to the opinions of the guys I&amp;#39;m talking with without even thinking about it. I&amp;#39;ll be messaging with a Christian guy and comfortably discussing the Bible and how society has forgetting some important things, and at the same exact moment be messaging with a rock-and-roll boy talking about drugs and sex. And even if I don&amp;#39;t like something they love, I can lie so easily about it and eventually I find myself enjoying that activity. And I can see myself being happy with anyone, because I know I&amp;#39;ll just adapt and fit.&lt;/p&gt;\n\n&lt;p&gt;Part of me thinks it&amp;#39;s because I grew up with guardians (they were and still are incredible parents to me) and only saw my biological mom on certain days. She never really showed me much love or approval like a mother should have, and many times didn&amp;#39;t show up at all. I found myself always wanting to do whatever she wanted to do because I knew as long as she was happy I would be with her and &amp;quot;happy&amp;quot; too. I think because I grew up basically training myself to adapt that way, it became second nature and now I don&amp;#39;t know how to turn it off. When my boyfriend asked me what I want to do, or really when anyone asks me that, I find myself immediately going down a list of what THEY would want to do and picking something from there. I don&amp;#39;t mind, I know I&amp;#39;ll enjoy myself, and even if I don&amp;#39;t, I know I can fake it until I do.&lt;/p&gt;\n\n&lt;p&gt;But it makes me think that there is something actually wrong with me. Like I&amp;#39;m a sociopath or something. Lying about who I am shouldn&amp;#39;t be this easy or so second nature, right?&lt;/p&gt;\n\n&lt;p&gt;TL/DR: I&amp;#39;m a social chameleon and find myself constantly changing my personality to fit whoever I am around. It&amp;#39;s become second nature since I grew up doing that to get attention or affection from my biological mom. But now I can&amp;#39;t find a way to stop myself from doing it, and I think it makes me some kind of sociopath.&lt;/p&gt;\n\n&lt;p&gt;Edit: added age and gender&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Personal Issues]\nMy post keeps being removed because the bot thinks I'm not tagging it properly. Hopefully it works this time.\n\nEvery person I (25F) hang out with, every friend, family member, co-worker, or random person I start chatting with, without even consciously doing it, I change to fit who they are. Any person I've dated, I've been a different person for. My taste in music changed. My taste in food, art, jokes, books, TV shows, it all changes depending on who I'm around. I've been keeping it a secret because I think it means I'm some kind of sociopath, but I have no problem with continuing to do it so I'm conflicted about it.\n\nThe best example I have is that at one point I lived in a country area and my best friend and romantic interest (let's call him Rick) was a country boy through and through. I wore boots, I listened to nothing but country music, I helped out on his farm, and loved it all. None of it felt faked or forced. I was happy that way.\n\nWe went our separate ways and I moved to the city. My new best guy friend (let's call him Joe) was a guy I met at work. I had a bit of a drug history and he has a crazy one. Our friendship is completely different than anything else. I listen to scremo and chat nonchalantly about drug use and make jokes I would have been offended by with my previous friend. We go out to bars and I started reading comic books and watching anime with him. Also became a huge fan of sifi. None of this ever feels fake either.\n\nMy boyfriend (let's call him Jeff) is your classic rock guy. Longboards, plays guitar, listens to vinyl records, watched old and weird movies, but also loves new stuff. Listens to classic rock and indie-rock. Loves to go do 90's style stuff like roller rinks, bowling, burger joints. And I love every minute of it. None of that feels fake either.\n\nHere's the kicker though, I can tell I'm different. I know the way I speak around my family, and every individual friend or coworker I have is completely different and adapted to their personality. It's not a conscious choice I make, but afterwards it always hits me that I was different again.\n\nThe same goes with literally anyone I meet. I'm struggling with dating right now (I'm Polyamorous: having multiple meaningful relationships) because I find myself adapting to the opinions of the guys I'm talking with without even thinking about it. I'll be messaging with a Christian guy and comfortably discussing the Bible and how society has forgetting some important things, and at the same exact moment be messaging with a rock-and-roll boy talking about drugs and sex. And even if I don't like something they love, I can lie so easily about it and eventually I find myself enjoying that activity. And I can see myself being happy with anyone, because I know I'll just adapt and fit.\n\nPart of me thinks it's because I grew up with guardians (they were and still are incredible parents to me) and only saw my biological mom on certain days. She never really showed me much love or approval like a mother should have, and many times didn't show up at all. I found myself always wanting to do whatever she wanted to do because I knew as long as she was happy I would be with her and \"happy\" too. I think because I grew up basically training myself to adapt that way, it became second nature and now I don't know how to turn it off. When my boyfriend asked me what I want to do, or really when anyone asks me that, I find myself immediately going down a list of what THEY would want to do and picking something from there. I don't mind, I know I'll enjoy myself, and even if I don't, I know I can fake it until I do.\n\nBut it makes me think that there is something actually wrong with me. Like I'm a sociopath or something. Lying about who I am shouldn't be this easy or so second nature, right?\n\nTL/DR: I'm a social chameleon and find myself constantly changing my personality to fit whoever I am around. It's become second nature since I grew up doing that to get attention or affection from my biological mom. But now I can't find a way to stop myself from doing it, and I think it makes me some kind of sociopath.\n\nEdit: added age and gender", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Personal issues", "id": "64pz69", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 534, "report_reasons": null, "author": "HiChamomileChameleon", "saved": false, "mod_reports": [], "name": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": 1491976128.0, "link_flair_css_class": "m-io personal", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/64pz69/im_a_social_chameleon_to_the_extent_where_im/", "num_reports": null, "locked": false, "stickied": false, "created": 1491934665.0, "url": "https://www.reddit.com/r/relationships/comments/64pz69/im_a_social_chameleon_to_the_extent_where_im/", "author_flair_text": null, "quarantine": false, "title": "I'm a social chameleon to the extent where I'm worried it means I'm some kind of sociopath. [Personal Issues]", "created_utc": 1491905865.0, "distinguished": null, "media": null, "upvote_ratio": 0.92, "num_comments": 93, "visited": false, "subreddit_type": "public", "ups": 534}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4sk0r", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "yun-harla", "parent_id": "t1_dg4s9bb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My mom's also going through that. Just make sure you're not letting those conversations be about making her feel better instead of figuring out what you need and how the two of you heal. It sounds like your mom is sincere and that means a lot, but if you feel angry or upset or whatever you feel, you're justified. Feelings are always okay -- even the uncomfortable ones. \n\nOoh, you might also like the advice blog Captain Awkward. It's a great resource for figuring out how to be emotionally healthy and have more authentic relationships.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My mom&amp;#39;s also going through that. Just make sure you&amp;#39;re not letting those conversations be about making her feel better instead of figuring out what you need and how the two of you heal. It sounds like your mom is sincere and that means a lot, but if you feel angry or upset or whatever you feel, you&amp;#39;re justified. Feelings are always okay -- even the uncomfortable ones. &lt;/p&gt;\n\n&lt;p&gt;Ooh, you might also like the advice blog Captain Awkward. It&amp;#39;s a great resource for figuring out how to be emotionally healthy and have more authentic relationships.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4sk0r", "score_hidden": false, "stickied": false, "created": 1491968287.0, "created_utc": 1491939487.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4s9bb", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Nonotnora48", "parent_id": "t1_dg4rvvy", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you. Yes I've only just started putting the pieces together. I've talked at length about my childhood with my mother. She has many regrets and she was actually the one to bring up the topic a few times. Out of the blue one day she rang me up to apologise for not cuddling me enough when I was a kid. After my nephew was born a few years ago my mother read some child development books and did some self reflection and realised she didn't handle things the best. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. Yes I&amp;#39;ve only just started putting the pieces together. I&amp;#39;ve talked at length about my childhood with my mother. She has many regrets and she was actually the one to bring up the topic a few times. Out of the blue one day she rang me up to apologise for not cuddling me enough when I was a kid. After my nephew was born a few years ago my mother read some child development books and did some self reflection and realised she didn&amp;#39;t handle things the best. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4s9bb", "score_hidden": false, "stickied": false, "created": 1491967971.0, "created_utc": 1491939171.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5pxx0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "emmawriter", "parent_id": "t1_dg5oyqp", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm really sorry, I got my comment threads mixed up. Apologies.\n\nRe: mindfulness, I'm still learning a lot about it myself. I've been trying a few 'guided meditation' audios (there's lots free online, I like the Headspace app which has a free trial) and I find those really good. \n\nGuided meditations are about stopping whatever you're doing, relaxing your body, and examining how you feel and what's bothering you. I use it when depressed, stressed or anxious, and I've found it really good for looking at my mental state objectively. There's even an 'SOS' audio in the Headspace app that I can play when I'm really struggling to keep it together.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really sorry, I got my comment threads mixed up. Apologies.&lt;/p&gt;\n\n&lt;p&gt;Re: mindfulness, I&amp;#39;m still learning a lot about it myself. I&amp;#39;ve been trying a few &amp;#39;guided meditation&amp;#39; audios (there&amp;#39;s lots free online, I like the Headspace app which has a free trial) and I find those really good. &lt;/p&gt;\n\n&lt;p&gt;Guided meditations are about stopping whatever you&amp;#39;re doing, relaxing your body, and examining how you feel and what&amp;#39;s bothering you. I use it when depressed, stressed or anxious, and I&amp;#39;ve found it really good for looking at my mental state objectively. There&amp;#39;s even an &amp;#39;SOS&amp;#39; audio in the Headspace app that I can play when I&amp;#39;m really struggling to keep it together.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5pxx0", "score_hidden": false, "stickied": false, "created": 1492023428.0, "created_utc": 1491994628.0, "depth": 7, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5oyqp", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5omeo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was asking about emotional neglect. When younger I used to try to impress those around me by solving things for them or figuring things out before they did and I always got abused for it, being sensitive it broke me - it would be good to get a book about emotional neglect so I can figure out how a healthy person would have been raised.\n\nI know mindfulness from a distance, am I wrong to assume that it just means to live in the moment as that is the definition I know of and I don't understand any other.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was asking about emotional neglect. When younger I used to try to impress those around me by solving things for them or figuring things out before they did and I always got abused for it, being sensitive it broke me - it would be good to get a book about emotional neglect so I can figure out how a healthy person would have been raised.&lt;/p&gt;\n\n&lt;p&gt;I know mindfulness from a distance, am I wrong to assume that it just means to live in the moment as that is the definition I know of and I don&amp;#39;t understand any other.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5oyqp", "score_hidden": false, "stickied": false, "created": 1492020601.0, "created_utc": 1491991801.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5omeo", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "emmawriter", "parent_id": "t1_dg5nm1o", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I just looked it up, it's \"Wherever You Go, There You Are\" by Jon Kabat-Zinn. There are similarly titled books but they're not about mindfulness.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just looked it up, it&amp;#39;s &amp;quot;Wherever You Go, There You Are&amp;quot; by Jon Kabat-Zinn. There are similarly titled books but they&amp;#39;re not about mindfulness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5omeo", "score_hidden": false, "stickied": false, "created": 1492019543.0, "created_utc": 1491990743.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5nm1o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg4rvvy", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hey /u/yun-harla who is the book by?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey &lt;a href=\"/u/yun-harla\"&gt;/u/yun-harla&lt;/a&gt; who is the book by?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5nm1o", "score_hidden": false, "stickied": false, "created": 1492016344.0, "created_utc": 1491987544.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rvvy", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "yun-harla", "parent_id": "t1_dg4rmsl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, emotional neglect is...awful. I'm so sorry that happened to you. You were not in the way. You were a child. You should have been the center of the family, not a tangent. Even when parents aren't at fault for their kids' pain, that pain is still just as important and real. There's actually a book called Emotional Neglect that I think you'll find valuable. Just pace yourself, because this stuff is intense no matter how long it's been since you were a kid.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, emotional neglect is...awful. I&amp;#39;m so sorry that happened to you. You were not in the way. You were a child. You should have been the center of the family, not a tangent. Even when parents aren&amp;#39;t at fault for their kids&amp;#39; pain, that pain is still just as important and real. There&amp;#39;s actually a book called Emotional Neglect that I think you&amp;#39;ll find valuable. Just pace yourself, because this stuff is intense no matter how long it&amp;#39;s been since you were a kid.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4rvvy", "score_hidden": false, "stickied": false, "created": 1491967560.0, "created_utc": 1491938760.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg7c98p", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Nonotnora48", "parent_id": "t1_dg5t03v", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you. However I definitely wasn't neglected, just that my emotional needs were often overlooked or dismissed. No abuse at all and it didn't cause me trauma. More I think it allowed anxiety and stress to fester inside me for a loooooong time. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. However I definitely wasn&amp;#39;t neglected, just that my emotional needs were often overlooked or dismissed. No abuse at all and it didn&amp;#39;t cause me trauma. More I think it allowed anxiety and stress to fester inside me for a loooooong time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7c98p", "score_hidden": false, "stickied": false, "created": 1492103494.0, "created_utc": 1492074694.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5t03v", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "GoldenArchx", "parent_id": "t1_dg4rmsl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm so sorry that you were neglected in that way. I really relate to you and OP. I was abused as a child (no one know still) . My mother then died a few years later and left two younger siblings behind. I got lost in the chaos of it all during my late childhood and adolescence. It left me with abandonment issues and an unstable sense of self as well. I suspect some elements of BPD but luckily I meditate and practice mindfulness which really helps. \n\nJust know what you're not alone! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry that you were neglected in that way. I really relate to you and OP. I was abused as a child (no one know still) . My mother then died a few years later and left two younger siblings behind. I got lost in the chaos of it all during my late childhood and adolescence. It left me with abandonment issues and an unstable sense of self as well. I suspect some elements of BPD but luckily I meditate and practice mindfulness which really helps. &lt;/p&gt;\n\n&lt;p&gt;Just know what you&amp;#39;re not alone! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5t03v", "score_hidden": false, "stickied": false, "created": 1492029812.0, "created_utc": 1492001012.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4rmsl", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "Nonotnora48", "parent_id": "t1_dg4n3c9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh wow I am now middle aged and your comment has helped me understand myself so much better. I am a people pleaser and only just now managing to isolate my own actual interests rather than ones I've taken on from other people. Although my parents were good people, my sister died when I was four and I was basically overlooked for the next ten years while they dealt with their grief. It's not their fault but I grew up thinking I was in the way a lot of the time and a nuisance. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh wow I am now middle aged and your comment has helped me understand myself so much better. I am a people pleaser and only just now managing to isolate my own actual interests rather than ones I&amp;#39;ve taken on from other people. Although my parents were good people, my sister died when I was four and I was basically overlooked for the next ten years while they dealt with their grief. It&amp;#39;s not their fault but I grew up thinking I was in the way a lot of the time and a nuisance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4rmsl", "score_hidden": false, "stickied": false, "created": 1491967288.0, "created_utc": 1491938488.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg610bw", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "SerpentsDance", "parent_id": "t1_dg4n3c9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My sister is that way. Always has been. Any guy she dated, she would adapt to his interests and likes/dislikes. Like, she always hated fish. When she dated a guy who was majorly into fishing, she learned how to fish and would go fishing with him and then eat what they caught. He was also into diving, and she became a certified scuba diver. After they broke up, she never touched fish nor went scuba diving again. She does stuff like that with everyone. Just adapts herself to fit whatever their interests are. \n\n\nWe grew up with an abusive father who isolated us from the rest of our family. Our mother was very loving, but she was also very ill and couldn't do very much to protect us from our father sometimes. My sister was often his target more than I was (he was emotionally/verbally abusive to us, not physically. He reserved the physical abuse for our mother). But it makes sense that her issue with not really having a sense of self would stem from that. I sort of became the opposite - I developed a very strong sense of self and while I'm open to exploring things my friends and husband and co-workers enjoy just to try new things, I don't immediately make those things my identity.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My sister is that way. Always has been. Any guy she dated, she would adapt to his interests and likes/dislikes. Like, she always hated fish. When she dated a guy who was majorly into fishing, she learned how to fish and would go fishing with him and then eat what they caught. He was also into diving, and she became a certified scuba diver. After they broke up, she never touched fish nor went scuba diving again. She does stuff like that with everyone. Just adapts herself to fit whatever their interests are. &lt;/p&gt;\n\n&lt;p&gt;We grew up with an abusive father who isolated us from the rest of our family. Our mother was very loving, but she was also very ill and couldn&amp;#39;t do very much to protect us from our father sometimes. My sister was often his target more than I was (he was emotionally/verbally abusive to us, not physically. He reserved the physical abuse for our mother). But it makes sense that her issue with not really having a sense of self would stem from that. I sort of became the opposite - I developed a very strong sense of self and while I&amp;#39;m open to exploring things my friends and husband and co-workers enjoy just to try new things, I don&amp;#39;t immediately make those things my identity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg610bw", "score_hidden": false, "stickied": false, "created": 1492039999.0, "created_utc": 1492011199.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4xfoi", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TexasThrowDown", "parent_id": "t1_dg4n3c9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm 27 and have a similar personality to OP.  My parents divorced when I was very young, and I've never thought it affected me, but reading this comment makes me think.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 27 and have a similar personality to OP.  My parents divorced when I was very young, and I&amp;#39;ve never thought it affected me, but reading this comment makes me think.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4xfoi", "score_hidden": false, "stickied": false, "created": 1491973736.0, "created_utc": 1491944936.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4n3c9", "gilded": 0, "archived": false, "score": 122, "report_reasons": null, "author": "yun-harla", "parent_id": "t1_dg47sjl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Having an unstable sense of self is actually not too uncommon. Hell, a lot of people go through it as teenagers and young adults. It doesn't make you a bad person. But it does make you alienated from yourself, whoever that might be, which affects your quality of life. Therapy helps, meditation too (the book Wherever You Go, There You Are is a great resource on mindfulness). If you don't have trouble experiencing strong emotions or respecting other people's emotions, and you have a felt sense of right and wrong, you're not a sociopath. You're a people-pleaser who is maybe scared of discovering/developing who you really are because you didn't experience enough unconditional love as a kid. Unconditional love is what lets kids be themselves, and while you can't expect that kind of love as an adult (it would be unhealthy) except from a pet, you CAN make up for that lack in a therapeutic environment.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Having an unstable sense of self is actually not too uncommon. Hell, a lot of people go through it as teenagers and young adults. It doesn&amp;#39;t make you a bad person. But it does make you alienated from yourself, whoever that might be, which affects your quality of life. Therapy helps, meditation too (the book Wherever You Go, There You Are is a great resource on mindfulness). If you don&amp;#39;t have trouble experiencing strong emotions or respecting other people&amp;#39;s emotions, and you have a felt sense of right and wrong, you&amp;#39;re not a sociopath. You&amp;#39;re a people-pleaser who is maybe scared of discovering/developing who you really are because you didn&amp;#39;t experience enough unconditional love as a kid. Unconditional love is what lets kids be themselves, and while you can&amp;#39;t expect that kind of love as an adult (it would be unhealthy) except from a pet, you CAN make up for that lack in a therapeutic environment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4n3c9", "score_hidden": false, "stickied": false, "created": 1491962392.0, "created_utc": 1491933592.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 122}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4ztc1", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "tormaad", "parent_id": "t1_dg4t7kd", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That may be true- early childhood was pretty bad, and it got to around mediocre by high school. Still, though, my social abilities have gotten me incredibly far and I consider my people reading / character judgment to be one of my best traits. I can't say for sure if it was instinctively trained as a defense mechanism, but I guess I tend to overlook the bad since the silver lining is pretty nice.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That may be true- early childhood was pretty bad, and it got to around mediocre by high school. Still, though, my social abilities have gotten me incredibly far and I consider my people reading / character judgment to be one of my best traits. I can&amp;#39;t say for sure if it was instinctively trained as a defense mechanism, but I guess I tend to overlook the bad since the silver lining is pretty nice.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ztc1", "score_hidden": false, "stickied": false, "created": 1491976614.0, "created_utc": 1491947814.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4t7kd", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "Welsh_Pulisic", "parent_id": "t1_dg4epwk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\" I don't have any trauma or reasons for why I'm like this\".\n\nI bet you normalize your trauma. This is typical. I'm sure your nuclear family thought it was all great...but it probably was not.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot; I don&amp;#39;t have any trauma or reasons for why I&amp;#39;m like this&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I bet you normalize your trauma. This is typical. I&amp;#39;m sure your nuclear family thought it was all great...but it probably was not.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4t7kd", "score_hidden": false, "stickied": false, "created": 1491968986.0, "created_utc": 1491940186.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 17}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4epwk", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "tormaad", "parent_id": "t1_dg47sjl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Holy shit this comment rang so true for me. I don't have any trauma or reasons for why I'm like this, but the part about feeling like an entirely new person every few months just really resonated.. thank you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit this comment rang so true for me. I don&amp;#39;t have any trauma or reasons for why I&amp;#39;m like this, but the part about feeling like an entirely new person every few months just really resonated.. thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4epwk", "score_hidden": false, "stickied": false, "created": 1491953216.0, "created_utc": 1491924416.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4yk8g", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Burcu1234", "parent_id": "t1_dg47sjl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Have you described me? I enjoy adapting my personality to the people around me. It makes me EXTREMELY adaptable and flexible  - which are valuable skills.It gives me pleasure to manage different people.  I cannot understand it when people say 'be yourself' because it makes me feel like I am fake all the time. However, I am very self critical and focus on why people may not like me. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you described me? I enjoy adapting my personality to the people around me. It makes me EXTREMELY adaptable and flexible  - which are valuable skills.It gives me pleasure to manage different people.  I cannot understand it when people say &amp;#39;be yourself&amp;#39; because it makes me feel like I am fake all the time. However, I am very self critical and focus on why people may not like me. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4yk8g", "score_hidden": false, "stickied": false, "created": 1491975095.0, "created_utc": 1491946295.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5t7r8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "maydsilee", "parent_id": "t1_dg47sjl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I feel like I almost wrote your comment myself!! I, too, resound a ton with OP's post. I've always adapted myself to people, and my issue is that I don't think I've ever had trauma (I was always a happy child, but I did develop mental health problems later for technically no reason - just chemical imbalance) that would make me this way. My best friend and I relate to each other so well because she's literally the *only* person I can be \"myself\" with. I can disagree with her, without feeling that I'm doing something wrong; with others, I can't do that for some reason, because I had already found myself aligning with everything they did and nodding and agreeing. For the sake of coming off as real, I could disagree with them on minor things (Like \"Oh, man! That movie was great\" or \"I don't really like this food\" while they don't think so), but for a lot of fundamental stuff, I won't disagree aloud. I wouldn't even realize what I was doing until much later. For the longest time, my boyfriend and I had problems with communications because of this, but at least that's gotten better. \n\nWhile I struggle with my own emotions all the time (to the degree that I disassociate at the drop of a feather; it's a huge issue), I can fake empathy very well and give sound advice. Like you, I'd just adjust myself accordingly, but the problem is that I honestly didn't give a fuck about others' problems, even if I faked it wonderfully. There's so many people who feel they know me (and tell me how nice I am, and welcoming, and it's like...no, I'm not. The things I tell my best friend are a massive stark contrast to how others perceive me), but that's because I make them feel that way, even though they don't know the most basic of things about me. I also find it very easy to lie while I adjust myself to people, which used to frighten me about myself. To some degree, once someone likes me, I then get the sort of \"Okay, well that's conquered\" feeling and move on. I never felt that way toward my boyfriend or best friend, as they're the exception. Doing this would make people (those who felt they \"know me,\" because I made them feel special) feel abandoned and they would end up trying to repeatedly get my attention again, but I'd have become bored during conversation (all the while still giving them tidbits, I guess? So they still get that special feeling), and it just being an endless cycle. I'd feel awful, but not know how to change it.\n\nFortunately, I'm in therapy for all this, and have been for a while. I find it sort of relieving that more people experience this, since for the longest time, I feared that I, too, was a psychopath. The only saving grace I had was my love for animals, since I had always heard that psychopaths/sociopaths didn't care about anyone or anything, and if there's one thing I care for with every fiber of my being, it's animals! It's interesting to me that so many others know what this feels like.\n\n**Edit:** Typo!", "edited": 1492001696.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like I almost wrote your comment myself!! I, too, resound a ton with OP&amp;#39;s post. I&amp;#39;ve always adapted myself to people, and my issue is that I don&amp;#39;t think I&amp;#39;ve ever had trauma (I was always a happy child, but I did develop mental health problems later for technically no reason - just chemical imbalance) that would make me this way. My best friend and I relate to each other so well because she&amp;#39;s literally the &lt;em&gt;only&lt;/em&gt; person I can be &amp;quot;myself&amp;quot; with. I can disagree with her, without feeling that I&amp;#39;m doing something wrong; with others, I can&amp;#39;t do that for some reason, because I had already found myself aligning with everything they did and nodding and agreeing. For the sake of coming off as real, I could disagree with them on minor things (Like &amp;quot;Oh, man! That movie was great&amp;quot; or &amp;quot;I don&amp;#39;t really like this food&amp;quot; while they don&amp;#39;t think so), but for a lot of fundamental stuff, I won&amp;#39;t disagree aloud. I wouldn&amp;#39;t even realize what I was doing until much later. For the longest time, my boyfriend and I had problems with communications because of this, but at least that&amp;#39;s gotten better. &lt;/p&gt;\n\n&lt;p&gt;While I struggle with my own emotions all the time (to the degree that I disassociate at the drop of a feather; it&amp;#39;s a huge issue), I can fake empathy very well and give sound advice. Like you, I&amp;#39;d just adjust myself accordingly, but the problem is that I honestly didn&amp;#39;t give a fuck about others&amp;#39; problems, even if I faked it wonderfully. There&amp;#39;s so many people who feel they know me (and tell me how nice I am, and welcoming, and it&amp;#39;s like...no, I&amp;#39;m not. The things I tell my best friend are a massive stark contrast to how others perceive me), but that&amp;#39;s because I make them feel that way, even though they don&amp;#39;t know the most basic of things about me. I also find it very easy to lie while I adjust myself to people, which used to frighten me about myself. To some degree, once someone likes me, I then get the sort of &amp;quot;Okay, well that&amp;#39;s conquered&amp;quot; feeling and move on. I never felt that way toward my boyfriend or best friend, as they&amp;#39;re the exception. Doing this would make people (those who felt they &amp;quot;know me,&amp;quot; because I made them feel special) feel abandoned and they would end up trying to repeatedly get my attention again, but I&amp;#39;d have become bored during conversation (all the while still giving them tidbits, I guess? So they still get that special feeling), and it just being an endless cycle. I&amp;#39;d feel awful, but not know how to change it.&lt;/p&gt;\n\n&lt;p&gt;Fortunately, I&amp;#39;m in therapy for all this, and have been for a while. I find it sort of relieving that more people experience this, since for the longest time, I feared that I, too, was a psychopath. The only saving grace I had was my love for animals, since I had always heard that psychopaths/sociopaths didn&amp;#39;t care about anyone or anything, and if there&amp;#39;s one thing I care for with every fiber of my being, it&amp;#39;s animals! It&amp;#39;s interesting to me that so many others know what this feels like.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; Typo!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5t7r8", "score_hidden": false, "stickied": false, "created": 1492030159.0, "created_utc": 1492001359.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47sjl", "gilded": 0, "archived": false, "score": 447, "report_reasons": null, "author": "AnotherChameleon", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hey, I'm also someone who 'suffers'/experiences this sort of phenomenon. I'll second therapy, it's a good way to unpack everything and understand it better.\n\nIt's important to figure out why you've developed this skill. Is it a defense/coping mechanism, response to trauma, etc. \n\nLike you I was terrified that I was secretly a sociopath because in addition to the chameleon personality I also mimic people's emotions because I do not experience many on my own. An individually tweaked pattern of speech, body language, vocabulary, etc. for everyone I interact with, all completely involuntarily. The constant shifting makes a few months feel like it was an entire lifetime ago where I was a different person.\n\n**The good news is you're not a sociopath.** Simply expressing this concern is pretty much enough to prove that. The bad news is it's really hard to label exactly what is going on and why, especially without outside help. Though the stuff with mom is an excellent place to start.\n\nWhat are you like when you're alone? Do you have a solo personality or are you just sort of nothing (for lack of a better word). I'm the latter so most of my advice deals with working through that.\n\nWhat you can do right away is look up \"mindfulness\". Take some time each day and try and ground yourself in the present. Don't think about who you were or what you were doing in the past, don't worry about who you'll be or what you'll be doing in an hour/day/week.\n\nTake some time to be alone, look into a mirror and mimic that person (this might be uncomfortable at first). Listen to the music they like. Do something solo they want to do. Maybe even write their/your thoughts in a journal. The idea is to kind of establish a default \"personality\" for you when you're alone and then slowly integrating it until you stop feeling the need to use the chameleon.\n\nGood luck", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I&amp;#39;m also someone who &amp;#39;suffers&amp;#39;/experiences this sort of phenomenon. I&amp;#39;ll second therapy, it&amp;#39;s a good way to unpack everything and understand it better.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important to figure out why you&amp;#39;ve developed this skill. Is it a defense/coping mechanism, response to trauma, etc. &lt;/p&gt;\n\n&lt;p&gt;Like you I was terrified that I was secretly a sociopath because in addition to the chameleon personality I also mimic people&amp;#39;s emotions because I do not experience many on my own. An individually tweaked pattern of speech, body language, vocabulary, etc. for everyone I interact with, all completely involuntarily. The constant shifting makes a few months feel like it was an entire lifetime ago where I was a different person.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The good news is you&amp;#39;re not a sociopath.&lt;/strong&gt; Simply expressing this concern is pretty much enough to prove that. The bad news is it&amp;#39;s really hard to label exactly what is going on and why, especially without outside help. Though the stuff with mom is an excellent place to start.&lt;/p&gt;\n\n&lt;p&gt;What are you like when you&amp;#39;re alone? Do you have a solo personality or are you just sort of nothing (for lack of a better word). I&amp;#39;m the latter so most of my advice deals with working through that.&lt;/p&gt;\n\n&lt;p&gt;What you can do right away is look up &amp;quot;mindfulness&amp;quot;. Take some time each day and try and ground yourself in the present. Don&amp;#39;t think about who you were or what you were doing in the past, don&amp;#39;t worry about who you&amp;#39;ll be or what you&amp;#39;ll be doing in an hour/day/week.&lt;/p&gt;\n\n&lt;p&gt;Take some time to be alone, look into a mirror and mimic that person (this might be uncomfortable at first). Listen to the music they like. Do something solo they want to do. Maybe even write their/your thoughts in a journal. The idea is to kind of establish a default &amp;quot;personality&amp;quot; for you when you&amp;#39;re alone and then slowly integrating it until you stop feeling the need to use the chameleon.&lt;/p&gt;\n\n&lt;p&gt;Good luck&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47sjl", "score_hidden": false, "stickied": false, "created": 1491944508.0, "created_utc": 1491915708.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 447}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg43ul0", "gilded": 0, "archived": false, "score": 203, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The first thing you need to do is find a therapist and tell them the truth. At least about your bio mom. I think that is the real reason this bothers you and figuring out what part is yourself and what part is mom will allow you to accept some stuff.\n\nHowever, what is wrong with liking new things and wanting to be new people? It bothers you, so you should work on it. *But* it seems like you do a ton of different stuff, learning different hobbies, and growing as a person. It might be that you don't have strong opinions of your own and are really just apathetic about most things. \n\nIt sounds like you meet new people, have a blast doing things with them, and then move forward with someone new. So I don't think this is 100% a bad thing. I just thing you need to discover a happy medium between 'being liked' and 'completely changing your personality for other people.' ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The first thing you need to do is find a therapist and tell them the truth. At least about your bio mom. I think that is the real reason this bothers you and figuring out what part is yourself and what part is mom will allow you to accept some stuff.&lt;/p&gt;\n\n&lt;p&gt;However, what is wrong with liking new things and wanting to be new people? It bothers you, so you should work on it. &lt;em&gt;But&lt;/em&gt; it seems like you do a ton of different stuff, learning different hobbies, and growing as a person. It might be that you don&amp;#39;t have strong opinions of your own and are really just apathetic about most things. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you meet new people, have a blast doing things with them, and then move forward with someone new. So I don&amp;#39;t think this is 100% a bad thing. I just thing you need to discover a happy medium between &amp;#39;being liked&amp;#39; and &amp;#39;completely changing your personality for other people.&amp;#39; &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg43ul0", "score_hidden": false, "stickied": false, "created": 1491936678.0, "created_utc": 1491907878.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 203}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5qvb2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "djamberj", "parent_id": "t1_dg49tc1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I relate to this so much. Especially about the \"undoing.\" I used to say yes to everything because I thought people would like me more. I grew up with parent issues too and therapy had helped me realize this stuff. I'm 29 now, and after lots of work (started at 25 as well) I feel more like myself. There's still things I love that I \"picked up\" from exes or whatever, but I feel more like me now. Introspection and mindfulness is key!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I relate to this so much. Especially about the &amp;quot;undoing.&amp;quot; I used to say yes to everything because I thought people would like me more. I grew up with parent issues too and therapy had helped me realize this stuff. I&amp;#39;m 29 now, and after lots of work (started at 25 as well) I feel more like myself. There&amp;#39;s still things I love that I &amp;quot;picked up&amp;quot; from exes or whatever, but I feel more like me now. Introspection and mindfulness is key!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5qvb2", "score_hidden": false, "stickied": false, "created": 1492025700.0, "created_utc": 1491996900.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg49tc1", "gilded": 0, "archived": false, "score": 49, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hey! I relate to this a lot, honestly! Even the metal scene/church talks describes some of my experiences exactly. Not to sound like I'm trivializing, but some people call this being \"a social butterfly.\" What's certain is you're NOT a sociopath. Being this adaptable isn't bad, I promise.\n\nHowever! The lying does concern me a little. I know how it goes when you're this socially fluid; it's almost second-nature. Someone asks if you've heard of a band, if you like a show, if you've ever done an activity, and you just say \"yes\" without a second of thought. Whoops, you just lied. But if you go home and listen to the band, watch the show, or go out and try the activity, it sort of feels like you've undone the lie, right? And then, eventually, hey! You DO like the thing anyway. So what's the harm? It took me a long time as I became an adult to get out of this way of thinking/acting, and it still challenges me to be honest.\n\nIt's important first of all to understand that you don't have to have perfectly aligned interests with someone to become close. In fact, people LOVE introducing someone to their interests. I've found that if someone asks if I've heard of something, and I truthfully answer no, they're usually pretty excited to show me/tell me about it.\n\nYou're walking the fine line between being super adventurous and open-minded (great!), and being an empty glass for everyone else to fill with whatever personality works for best them (not so good).\n\nI wonder if you're actually, totally, absolutely happy each time you take on a new identity for a boyfriend or friend, or if part of you does wish you could let your different interests and personalities mingle? I'm not trying to presume, but I know I'm much happier as a person now that I'm with friends that don't blink if I'm more \"country\" one day and more \"punk\" the next.\n\nPeople aren't confined to genres! You can be all of these different parts of you, and that's okay.\n\nThe only hangup you seem to have is an inability to draw the line between finding new interests, and letting people sort of mold you.\n\nSince it does seem to be troubling you, I'd suggest seeing a counselor, talking to them about your mom, and exploring your apparent absolute need to fit in perfectly with everyone. Again, I don't think anything is \"wrong\" with you. I just think you have a lot of introspection and self-exploration to do so that you can end up happy. Good luck!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey! I relate to this a lot, honestly! Even the metal scene/church talks describes some of my experiences exactly. Not to sound like I&amp;#39;m trivializing, but some people call this being &amp;quot;a social butterfly.&amp;quot; What&amp;#39;s certain is you&amp;#39;re NOT a sociopath. Being this adaptable isn&amp;#39;t bad, I promise.&lt;/p&gt;\n\n&lt;p&gt;However! The lying does concern me a little. I know how it goes when you&amp;#39;re this socially fluid; it&amp;#39;s almost second-nature. Someone asks if you&amp;#39;ve heard of a band, if you like a show, if you&amp;#39;ve ever done an activity, and you just say &amp;quot;yes&amp;quot; without a second of thought. Whoops, you just lied. But if you go home and listen to the band, watch the show, or go out and try the activity, it sort of feels like you&amp;#39;ve undone the lie, right? And then, eventually, hey! You DO like the thing anyway. So what&amp;#39;s the harm? It took me a long time as I became an adult to get out of this way of thinking/acting, and it still challenges me to be honest.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s important first of all to understand that you don&amp;#39;t have to have perfectly aligned interests with someone to become close. In fact, people LOVE introducing someone to their interests. I&amp;#39;ve found that if someone asks if I&amp;#39;ve heard of something, and I truthfully answer no, they&amp;#39;re usually pretty excited to show me/tell me about it.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re walking the fine line between being super adventurous and open-minded (great!), and being an empty glass for everyone else to fill with whatever personality works for best them (not so good).&lt;/p&gt;\n\n&lt;p&gt;I wonder if you&amp;#39;re actually, totally, absolutely happy each time you take on a new identity for a boyfriend or friend, or if part of you does wish you could let your different interests and personalities mingle? I&amp;#39;m not trying to presume, but I know I&amp;#39;m much happier as a person now that I&amp;#39;m with friends that don&amp;#39;t blink if I&amp;#39;m more &amp;quot;country&amp;quot; one day and more &amp;quot;punk&amp;quot; the next.&lt;/p&gt;\n\n&lt;p&gt;People aren&amp;#39;t confined to genres! You can be all of these different parts of you, and that&amp;#39;s okay.&lt;/p&gt;\n\n&lt;p&gt;The only hangup you seem to have is an inability to draw the line between finding new interests, and letting people sort of mold you.&lt;/p&gt;\n\n&lt;p&gt;Since it does seem to be troubling you, I&amp;#39;d suggest seeing a counselor, talking to them about your mom, and exploring your apparent absolute need to fit in perfectly with everyone. Again, I don&amp;#39;t think anything is &amp;quot;wrong&amp;quot; with you. I just think you have a lot of introspection and self-exploration to do so that you can end up happy. Good luck!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg49tc1", "score_hidden": false, "stickied": false, "created": 1491947374.0, "created_utc": 1491918574.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 49}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4955k", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "acox1701", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; [Personal Issues] My post keeps being removed because the bot thinks I'm not tagging it properly. Hopefully it works this time.\n\nI'm going to recommend that you read the instructions for submitting a post, and then include your age and gender in the title. On the other hand, if the bot lets you keep this one up, then no worries on that front.\n\nOther than that, I'm just gonna repeat what everyone else here said. I've never been diagnosed, but I have considered that I might be some mild form of sociopath. I have little to no natural empathy or sympathy with anyone. What I do have is a generalized sense of fair play and being nice; I just don't have a natural sense of what that should look like. I spent the past twenty five years or so building empathy and sympathy out of logic and reasoning. I can be very, very cold and rational when considering things; sometime it is necessary to do, or allow to be done, terrible things, in the pursuit of a greater good. I find it important to consider such things, rather than to just shunt the unpleasant thoughts aside. This has disturbed some people, in the past.\n\nBut, as everyone else here says, the fact that you are being introspective, that you care about this sort of thing, functionally eliminates you being a sociopath. You *might* even have several of the qualities of the condition, but not all of them.\n\nLastly, it sounds as though you're just one of those people who are interesting in people, and have an endless ability to share their interests. There's nothing wrong with that. hell, most people find it a desirable quality. As long as you're not hurting anyone, (including yourself) more power to you.\n\nThis last, of course, is why we want your age and gender. A sixteen year old doing this is just moving into maturity. A 70 year old, well, that's odd. Not a problem, but odd. Well, maybe not even that odd. A 70 year old has *lots* of experience to draw on when talking to people about stuff, provided they are still clear-headed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;[Personal Issues] My post keeps being removed because the bot thinks I&amp;#39;m not tagging it properly. Hopefully it works this time.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I&amp;#39;m going to recommend that you read the instructions for submitting a post, and then include your age and gender in the title. On the other hand, if the bot lets you keep this one up, then no worries on that front.&lt;/p&gt;\n\n&lt;p&gt;Other than that, I&amp;#39;m just gonna repeat what everyone else here said. I&amp;#39;ve never been diagnosed, but I have considered that I might be some mild form of sociopath. I have little to no natural empathy or sympathy with anyone. What I do have is a generalized sense of fair play and being nice; I just don&amp;#39;t have a natural sense of what that should look like. I spent the past twenty five years or so building empathy and sympathy out of logic and reasoning. I can be very, very cold and rational when considering things; sometime it is necessary to do, or allow to be done, terrible things, in the pursuit of a greater good. I find it important to consider such things, rather than to just shunt the unpleasant thoughts aside. This has disturbed some people, in the past.&lt;/p&gt;\n\n&lt;p&gt;But, as everyone else here says, the fact that you are being introspective, that you care about this sort of thing, functionally eliminates you being a sociopath. You &lt;em&gt;might&lt;/em&gt; even have several of the qualities of the condition, but not all of them.&lt;/p&gt;\n\n&lt;p&gt;Lastly, it sounds as though you&amp;#39;re just one of those people who are interesting in people, and have an endless ability to share their interests. There&amp;#39;s nothing wrong with that. hell, most people find it a desirable quality. As long as you&amp;#39;re not hurting anyone, (including yourself) more power to you.&lt;/p&gt;\n\n&lt;p&gt;This last, of course, is why we want your age and gender. A sixteen year old doing this is just moving into maturity. A 70 year old, well, that&amp;#39;s odd. Not a problem, but odd. Well, maybe not even that odd. A 70 year old has &lt;em&gt;lots&lt;/em&gt; of experience to draw on when talking to people about stuff, provided they are still clear-headed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4955k", "score_hidden": false, "stickied": false, "created": 1491946473.0, "created_utc": 1491917673.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg48snh", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "professor_sage", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What was your longest stretch of being single and how did that time feel to you? Do you do this with friends too or just romantic partners?\n\nThe good news is that while you're probably more full throttle than most people, this is still a fairly normal things for human beings to do. You're not a sociopath. If you want to learn to be more comfortable asserting your own preferences (or discovering what those preferences are) then you should figure out what about this behavior bothers you and what you want to change.\n\n- Are you bothered by the fact that you feel like you're lying to people?\n\n- Are you worried that absent a boyfriend you won't know what to do with yourself?\n\n- Are you worried that this shifting personality will be damaging to you personally at some point, or that it sabotages your relationships because it's not sustainable?\n\n- All of the above?\n\nFor problems 1 and 3 I would recommend CBT or Cognitive Behavioral Therapy. The idea is you want to catch the thought as you're having it and then make a conscious effort to course correct. For problem 2 I think the only solution would be to be completely single for a while. Just sit with yourself and see how it feels, see if you feel anxious without a partner or if you just start mimicking your friends instead. \n\nYou could do all of this with the guidance of a therapist to help you unpack as you go, but if your relationships are otherwise good and you don't feel like you're experiencing any personal harm, or doing any kind of harm to your partners, then know there's nothing inherently wrong with having a kind of shaky sense of self. One of my friends switches interests every other month based on who she's dating at the time. But she seems happy so no one really cares.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What was your longest stretch of being single and how did that time feel to you? Do you do this with friends too or just romantic partners?&lt;/p&gt;\n\n&lt;p&gt;The good news is that while you&amp;#39;re probably more full throttle than most people, this is still a fairly normal things for human beings to do. You&amp;#39;re not a sociopath. If you want to learn to be more comfortable asserting your own preferences (or discovering what those preferences are) then you should figure out what about this behavior bothers you and what you want to change.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Are you bothered by the fact that you feel like you&amp;#39;re lying to people?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Are you worried that absent a boyfriend you won&amp;#39;t know what to do with yourself?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Are you worried that this shifting personality will be damaging to you personally at some point, or that it sabotages your relationships because it&amp;#39;s not sustainable?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;All of the above?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;For problems 1 and 3 I would recommend CBT or Cognitive Behavioral Therapy. The idea is you want to catch the thought as you&amp;#39;re having it and then make a conscious effort to course correct. For problem 2 I think the only solution would be to be completely single for a while. Just sit with yourself and see how it feels, see if you feel anxious without a partner or if you just start mimicking your friends instead. &lt;/p&gt;\n\n&lt;p&gt;You could do all of this with the guidance of a therapist to help you unpack as you go, but if your relationships are otherwise good and you don&amp;#39;t feel like you&amp;#39;re experiencing any personal harm, or doing any kind of harm to your partners, then know there&amp;#39;s nothing inherently wrong with having a kind of shaky sense of self. One of my friends switches interests every other month based on who she&amp;#39;s dating at the time. But she seems happy so no one really cares.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48snh", "score_hidden": false, "stickied": false, "created": 1491945996.0, "created_utc": 1491917196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg46r3x", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "Floomby", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think it more likely that your desire to be accepted makes you very open, which is a good thing, a caracteristic of temperament even. Maybe you have very eclectic taste in music. It is only a problem if you are failing to listen to your own preferences and judgment. \n\nFor instance, what if your Christian friend said something harsh against homosexuality? Or what if your drug using friend offered you a bunch of Vicodins? What would you do? \n\nHave you researched what are the criterion of diagnosing someone as a sociopath? \n\nFor example, do you exhibit any of these characteristics: lack of empathy, indifference to suffering, compulsive lying, a capacity and tendency to manipulate people for your personal gain, lack of remorse, sham or guilt, the capacity to commit crimes if you thought you could get away with it? \n\nI'm getting the impression that if anything, you may be suppressing your identity in order to be loved and accepted. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think it more likely that your desire to be accepted makes you very open, which is a good thing, a caracteristic of temperament even. Maybe you have very eclectic taste in music. It is only a problem if you are failing to listen to your own preferences and judgment. &lt;/p&gt;\n\n&lt;p&gt;For instance, what if your Christian friend said something harsh against homosexuality? Or what if your drug using friend offered you a bunch of Vicodins? What would you do? &lt;/p&gt;\n\n&lt;p&gt;Have you researched what are the criterion of diagnosing someone as a sociopath? &lt;/p&gt;\n\n&lt;p&gt;For example, do you exhibit any of these characteristics: lack of empathy, indifference to suffering, compulsive lying, a capacity and tendency to manipulate people for your personal gain, lack of remorse, sham or guilt, the capacity to commit crimes if you thought you could get away with it? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m getting the impression that if anything, you may be suppressing your identity in order to be loved and accepted. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg46r3x", "score_hidden": false, "stickied": false, "created": 1491942837.0, "created_utc": 1491914037.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4euhi", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "Taear", "parent_id": "t1_dg47qou", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The moment I saw that they'd said Honey I thought this.\n\nIt's like a mid 60s southern American person talking to me in my head, I don't understand why people do it. Like saying \"love\" and etc.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The moment I saw that they&amp;#39;d said Honey I thought this.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like a mid 60s southern American person talking to me in my head, I don&amp;#39;t understand why people do it. Like saying &amp;quot;love&amp;quot; and etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4euhi", "score_hidden": false, "stickied": false, "created": 1491953356.0, "created_utc": 1491924556.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 30}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4ebyr", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "starshine1988", "parent_id": "t1_dg47qou", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Eh I use those when I'm afraid of coming off too harsh or when people are super heartbroken/sad. I hope people don't take it that way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Eh I use those when I&amp;#39;m afraid of coming off too harsh or when people are super heartbroken/sad. I hope people don&amp;#39;t take it that way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ebyr", "score_hidden": false, "stickied": false, "created": 1491952792.0, "created_utc": 1491923992.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4uw22", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "stillbarracuda", "parent_id": "t1_dg47qou", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's definitely not meant as condescending, but as an expression of sympathy and caring. Maybe this is a regional thing? I grew up in the South and people say honey, sugar, darling, sweetie, buddy, etc. all the time.\n\nEdit: sorry for all the deleted comments, I'm on mobile and it multiple-posted.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s definitely not meant as condescending, but as an expression of sympathy and caring. Maybe this is a regional thing? I grew up in the South and people say honey, sugar, darling, sweetie, buddy, etc. all the time.&lt;/p&gt;\n\n&lt;p&gt;Edit: sorry for all the deleted comments, I&amp;#39;m on mobile and it multiple-posted.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4uw22", "score_hidden": false, "stickied": false, "created": 1491970845.0, "created_utc": 1491942045.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg48qc9", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "BoerboelBoss", "parent_id": "t1_dg48n0y", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just voicing my opinion here. If you're a caring mother then say honey I guess.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just voicing my opinion here. If you&amp;#39;re a caring mother then say honey I guess.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48qc9", "score_hidden": false, "stickied": false, "created": 1491945908.0, "created_utc": 1491917108.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48n0y", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "Cobraess", "parent_id": "t1_dg48f6e", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Honey, as in giving the kind of advice a caring mother would. If the OP isn't commenting to display their discontent with the above commenters supposed condescending tone then I don't think we should make it a bigger issue than we already have. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honey, as in giving the kind of advice a caring mother would. If the OP isn&amp;#39;t commenting to display their discontent with the above commenters supposed condescending tone then I don&amp;#39;t think we should make it a bigger issue than we already have. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48n0y", "score_hidden": false, "stickied": false, "created": 1491945776.0, "created_utc": 1491916976.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dg48f6e", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "BoerboelBoss", "parent_id": "t1_dg484tb", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Honey, like they are some poor lost child? Like I said it's petty but I it's condescending and I've seen it enough to want to point it out that's all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honey, like they are some poor lost child? Like I said it&amp;#39;s petty but I it&amp;#39;s condescending and I&amp;#39;ve seen it enough to want to point it out that&amp;#39;s all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg48f6e", "score_hidden": false, "stickied": false, "created": 1491945466.0, "created_utc": 1491916666.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg484tb", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "Cobraess", "parent_id": "t1_dg47qou", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "C'mon, it's a relationship sub asking people for advice. Honey is an appropriate way to answer a post like this, they need guidance and sympathy. The commenter even wishes them good luck. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;C&amp;#39;mon, it&amp;#39;s a relationship sub asking people for advice. Honey is an appropriate way to answer a post like this, they need guidance and sympathy. The commenter even wishes them good luck. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg484tb", "score_hidden": false, "stickied": false, "created": 1491945040.0, "created_utc": 1491916240.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 33}}], "after": null, "before": null}}, "user_reports": [], "id": "dg47qou", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "BoerboelBoss", "parent_id": "t1_dg456hx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Saying hon or honey comes off as so condescending. Not trying to attack you but I see it everywhere and it bugs me. You're advice is good though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Saying hon or honey comes off as so condescending. Not trying to attack you but I see it everywhere and it bugs me. You&amp;#39;re advice is good though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg47qou", "score_hidden": false, "stickied": false, "created": 1491944426.0, "created_utc": 1491915626.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 39}}], "after": null, "before": null}}, "user_reports": [], "id": "dg456hx", "gilded": 0, "archived": false, "score": 56, "report_reasons": null, "author": "iamtomie", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Honey, if you really were a sociopath you wouldn't be worrying the way you are. To me it seems you seem desperate to connect with people and to be liked, and you've picked up on the fact that playing to other's preferences and interests makes them warm to you. I think you should take some time alone to figure out your identity and what you, the real you, connects to. I'm 22 and only in the past year have I managed to do this. It takes time, and speaking to a therapist might help. \n\nYou need to learn independence and to make choices for you, not just other people. You might have to force it at first, but I promise once you start to empower yourself by thinking of your own needs and activities you enjoy too you'll start to feel better. Good luck!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honey, if you really were a sociopath you wouldn&amp;#39;t be worrying the way you are. To me it seems you seem desperate to connect with people and to be liked, and you&amp;#39;ve picked up on the fact that playing to other&amp;#39;s preferences and interests makes them warm to you. I think you should take some time alone to figure out your identity and what you, the real you, connects to. I&amp;#39;m 22 and only in the past year have I managed to do this. It takes time, and speaking to a therapist might help. &lt;/p&gt;\n\n&lt;p&gt;You need to learn independence and to make choices for you, not just other people. You might have to force it at first, but I promise once you start to empower yourself by thinking of your own needs and activities you enjoy too you&amp;#39;ll start to feel better. Good luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg456hx", "score_hidden": false, "stickied": false, "created": 1491939844.0, "created_utc": 1491911044.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 56}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg49f83", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "aurelie_v", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I went through a period of chameleon-like behaviours, and I still often find myself mirroring people if I don't take care not to. There can be many reasons for this sort of pattern, and it is probably a good idea to see an experienced therapist, as others have suggested, and talk it through with them. When I was younger and these issues were more troubling to me, I was diagnosed with borderline personality disorder, which is a condition that can often involve shifting presentation of self and very unstable self image – now that I'm older, I have doubts about that diagnosis, and I'm certainly not trying to diagnose you, as that's completely impossible over the internet. But I think you might find it interesting to read about as the descriptions of how people with that condition experience \"selfhood\" might resonate with you and make you feel less alone with this. It doesn't mean that you necessarily have anything \"wrong with you\" – that's not what I'm trying to say at all. Personality is very complex, and for everyone it consists of a mixture of inborn traits, habits, and learned behaviours. \n\nIt sounds like you might want to try to figure out, over time, a slightly more stable sense of \"you-ness\" ... Who or what is the core, central part of you, what your lasting beliefs and likes and dislikes are. It's possible to do that, and also to remain flexible and open to change. If you do see a therapist, it might take a while to find someone you click with, and to build trust (especially as you will likely start by mirroring them and being what you think they want you to be, out of habit), but stick with it. Even if it takes a while, it will be worth the effort. Wishing you well &lt;3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I went through a period of chameleon-like behaviours, and I still often find myself mirroring people if I don&amp;#39;t take care not to. There can be many reasons for this sort of pattern, and it is probably a good idea to see an experienced therapist, as others have suggested, and talk it through with them. When I was younger and these issues were more troubling to me, I was diagnosed with borderline personality disorder, which is a condition that can often involve shifting presentation of self and very unstable self image – now that I&amp;#39;m older, I have doubts about that diagnosis, and I&amp;#39;m certainly not trying to diagnose you, as that&amp;#39;s completely impossible over the internet. But I think you might find it interesting to read about as the descriptions of how people with that condition experience &amp;quot;selfhood&amp;quot; might resonate with you and make you feel less alone with this. It doesn&amp;#39;t mean that you necessarily have anything &amp;quot;wrong with you&amp;quot; – that&amp;#39;s not what I&amp;#39;m trying to say at all. Personality is very complex, and for everyone it consists of a mixture of inborn traits, habits, and learned behaviours. &lt;/p&gt;\n\n&lt;p&gt;It sounds like you might want to try to figure out, over time, a slightly more stable sense of &amp;quot;you-ness&amp;quot; ... Who or what is the core, central part of you, what your lasting beliefs and likes and dislikes are. It&amp;#39;s possible to do that, and also to remain flexible and open to change. If you do see a therapist, it might take a while to find someone you click with, and to build trust (especially as you will likely start by mirroring them and being what you think they want you to be, out of habit), but stick with it. Even if it takes a while, it will be worth the effort. Wishing you well &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg49f83", "score_hidden": false, "stickied": false, "created": 1491946852.0, "created_utc": 1491918052.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg44gc4", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "mwobuddy", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Almost all of us do this. Its called \"presenting self\". We always put on airs in order to get what we really want, companions. Think about small-talk. I'm sure thats where you pretend to like things the most. But what is small-talk? Its all superficial bullshit designed to allow people to be near each other and derive satisfaction from the event, its not really about that small crap.\n\nIf I had a nickel for every time a guy pretended to be into sports to fit in with people they liked being around..\n\nPeople's relationships only work when there's common ground somewhere, otherwise it feels forced and puts people off.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Almost all of us do this. Its called &amp;quot;presenting self&amp;quot;. We always put on airs in order to get what we really want, companions. Think about small-talk. I&amp;#39;m sure thats where you pretend to like things the most. But what is small-talk? Its all superficial bullshit designed to allow people to be near each other and derive satisfaction from the event, its not really about that small crap.&lt;/p&gt;\n\n&lt;p&gt;If I had a nickel for every time a guy pretended to be into sports to fit in with people they liked being around..&lt;/p&gt;\n\n&lt;p&gt;People&amp;#39;s relationships only work when there&amp;#39;s common ground somewhere, otherwise it feels forced and puts people off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg44gc4", "score_hidden": false, "stickied": false, "created": 1491938201.0, "created_utc": 1491909401.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4c90k", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "finmeister", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was raised by a narcissist and used to be the same way. I'm not a sociopath, psychopath, narcissist, or borderline. I just had VERY low self esteem, no boundaries, and I really, really, super, to an insane extent was seeking approval. I had also never been allowed to develop a sense of self. \n\nI was the woman who wasn't there. No hobbies, no interests, no religion/faith or lack thereof, no preferences, no goals, no idea about my strengths and weaknesses, nothing. Looking back it kind of scares me now. \n\nBut the great news is, it's fixable. I feel that now, I have great self awareness, at least as good as most people, better than some. \n\nOne of the first things my therapist told me, was if you're genuinely worried you're a sociopath, there's no way you can be one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was raised by a narcissist and used to be the same way. I&amp;#39;m not a sociopath, psychopath, narcissist, or borderline. I just had VERY low self esteem, no boundaries, and I really, really, super, to an insane extent was seeking approval. I had also never been allowed to develop a sense of self. &lt;/p&gt;\n\n&lt;p&gt;I was the woman who wasn&amp;#39;t there. No hobbies, no interests, no religion/faith or lack thereof, no preferences, no goals, no idea about my strengths and weaknesses, nothing. Looking back it kind of scares me now. &lt;/p&gt;\n\n&lt;p&gt;But the great news is, it&amp;#39;s fixable. I feel that now, I have great self awareness, at least as good as most people, better than some. &lt;/p&gt;\n\n&lt;p&gt;One of the first things my therapist told me, was if you&amp;#39;re genuinely worried you&amp;#39;re a sociopath, there&amp;#39;s no way you can be one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4c90k", "score_hidden": false, "stickied": false, "created": 1491950417.0, "created_utc": 1491921617.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg43vfw", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think as a complex human being one person is not all that we are made for. Sure most suppress and find this easy but you haven't and are making use of you brain functionality more than the average person.\n\nWhat ever name you have for your self so be it. But in this you also learn what you truly like as you observe what feels less right and wrong. How can someone say they are truly sure they are happy if they have only experienced one experience.\n\nYou are lucky.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think as a complex human being one person is not all that we are made for. Sure most suppress and find this easy but you haven&amp;#39;t and are making use of you brain functionality more than the average person.&lt;/p&gt;\n\n&lt;p&gt;What ever name you have for your self so be it. But in this you also learn what you truly like as you observe what feels less right and wrong. How can someone say they are truly sure they are happy if they have only experienced one experience.&lt;/p&gt;\n\n&lt;p&gt;You are lucky.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg43vfw", "score_hidden": false, "stickied": false, "created": 1491936743.0, "created_utc": 1491907943.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4ljyr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Freyya", "parent_id": "t1_dg4b6e4", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I have this problem in spades. Also a Pisces. You just blew my mind.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have this problem in spades. Also a Pisces. You just blew my mind.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ljyr", "score_hidden": false, "stickied": false, "created": 1491960711.0, "created_utc": 1491931911.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg4b6e4", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "GreenWithIvy", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "As others have said, the fact you're worried about this shows you're not a sociopath. This is just a personality quirk in some people and it's not as uncommon as you think. Obviously you know yourself best, but for everyone I've known who's been like this -- while they're wonderful people -- I think it stems from a bit of insecurity. You definitely have your own personality -- it just sounds like it's a bit \"shy\" and gets subsumed when other more active personalities are nearby. \n\n(Also, I know this sounds TOTALLY ridiculous, I'm fully aware, but I swear they're always Pisces). \n\nA therapist could really help you -- not because there's something wrong with you, but because everyone needs a place to talk out these things!\n\nEdit: typo", "edited": 1491935266.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As others have said, the fact you&amp;#39;re worried about this shows you&amp;#39;re not a sociopath. This is just a personality quirk in some people and it&amp;#39;s not as uncommon as you think. Obviously you know yourself best, but for everyone I&amp;#39;ve known who&amp;#39;s been like this -- while they&amp;#39;re wonderful people -- I think it stems from a bit of insecurity. You definitely have your own personality -- it just sounds like it&amp;#39;s a bit &amp;quot;shy&amp;quot; and gets subsumed when other more active personalities are nearby. &lt;/p&gt;\n\n&lt;p&gt;(Also, I know this sounds TOTALLY ridiculous, I&amp;#39;m fully aware, but I swear they&amp;#39;re always Pisces). &lt;/p&gt;\n\n&lt;p&gt;A therapist could really help you -- not because there&amp;#39;s something wrong with you, but because everyone needs a place to talk out these things!&lt;/p&gt;\n\n&lt;p&gt;Edit: typo&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4b6e4", "score_hidden": false, "stickied": false, "created": 1491949127.0, "created_utc": 1491920327.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4jymi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Nora_Oie", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You don't say how old you are, but this is a very common experience (call it a phase, maybe) for people up until their mid twenties or a little later.  \n\nYou're not really lying, btw.  It's an unconscious decision to take on the traits and interests of people around you, which is one way that we find out who we are.\n\nYou were asked a really good question about \"What are you like when you are alone?\"  This, and the issues with your bio mom, are good ones to take to therapy.  \n\nBut none of what you describe is related to being a sociopath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t say how old you are, but this is a very common experience (call it a phase, maybe) for people up until their mid twenties or a little later.  &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not really lying, btw.  It&amp;#39;s an unconscious decision to take on the traits and interests of people around you, which is one way that we find out who we are.&lt;/p&gt;\n\n&lt;p&gt;You were asked a really good question about &amp;quot;What are you like when you are alone?&amp;quot;  This, and the issues with your bio mom, are good ones to take to therapy.  &lt;/p&gt;\n\n&lt;p&gt;But none of what you describe is related to being a sociopath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4jymi", "score_hidden": false, "stickied": false, "created": 1491958963.0, "created_utc": 1491930163.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg484pq", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Catworldullus", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Here's the rule: if you're worried about being a sociopath, you're inherently not a sociopath.\n\nSo that aside, are you adopting their interests to please who you're talking to? Or because you want the validation of fitting in. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s the rule: if you&amp;#39;re worried about being a sociopath, you&amp;#39;re inherently not a sociopath.&lt;/p&gt;\n\n&lt;p&gt;So that aside, are you adopting their interests to please who you&amp;#39;re talking to? Or because you want the validation of fitting in. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg484pq", "score_hidden": false, "stickied": false, "created": 1491945036.0, "created_utc": 1491916236.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4e99d", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "croshad", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well you say it all feels real, not fake. So there's nothing wrong with how you are. I would love to be able to enjoy such as wide variety of things.\n\nIf the issue is you feeling like you lack an identity, uniqueness, then maybe it would benefit talking to a professional to figure out how to get there. And nothing that you said suggests you're a sociopath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well you say it all feels real, not fake. So there&amp;#39;s nothing wrong with how you are. I would love to be able to enjoy such as wide variety of things.&lt;/p&gt;\n\n&lt;p&gt;If the issue is you feeling like you lack an identity, uniqueness, then maybe it would benefit talking to a professional to figure out how to get there. And nothing that you said suggests you&amp;#39;re a sociopath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4e99d", "score_hidden": false, "stickied": false, "created": 1491952709.0, "created_utc": 1491923909.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4fu4n", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Celany", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just want to chime in that I dealt with this too. My mom probably has Borderline Personality Disorder (two of my therapists who met/spoke to her multiple times independently told me that) and when I was growing up, I literally could NOT be myself without her losing her mind. I spent a lot of time trying to be what she wanted, until I got away from her, which made it hard for me to know what *I* wanted.\n\nOn top of that, I've come to realize that I'm probably an EXTREMELY easy-going person (I think I would have been even without her), who is VERY interested in pretty much everything in the world. So when I meet someone new who has passions that I don't know anything about, it is VERY easy for me to dip into getting involved in their passions...at least for awhile.\n\nLike others have said, therapy is the best place to work on this. One therapist of mine in particular worked with me extensively to slowly tease through myself to learn what things I actually like and also taught me how to speak up/advocate for myself in terms of doing what I like with friends (with can be anything from going to a concert that *I* like/want to go to with like-minded friends, to speaking up when a group of friends is deciding where to go to dinner, and being firm that no, I do NOT want to go for Thai, but I AM in the mood for Italian or Mexican). It is a long slow process. I can tell you (15 years after that therapy) that it is a life-long process.\n\nOne of the most important things is that if you start to get signals that you DON'T like something as much as you originally did, it is OK to speak up and say so. For many hobbies, after I dip into them for 3-6 months, I get an idea of whether or not I want to continue with them, or if they're something I'll do occasionally with my friend, but the hobby really isn't for me. Learning to speak up like that was really important to me, and the best thing I learned to make that easier is to be really clear with my friends. By which I mean, if it was a new hobby, I would tell them \"X is a new hobby, and so far it sounds really cool! I definitely want to try it out, but I don't want to fully commit to getting totally into it until I've done it for some months\" And then I'd check in with myself about how I was feeling about this hobby, so I could update my friend \"Friend, I do like this, but I don't looooove it, so I'll be happy to do it with you sometimes, but I don't see myself being as into it as you are\" and make sure we were clear. \n\nAnother important thing is that if you're comfortable playing \"devil's advocate\" or talking \"in theory\" with people (I'm referencing your Christian guy/rock-&amp;-roll guy comment), it is VERY important to make it clear to them that you are doing that. For the sake of future fighting and someone feeling as though you lied, knowing how to make it clear that you can see how X works for some people *but might not necessarily be the thing that you personally ascribe to yourself* is really important. A therapist can help you learn to do that. \n\nAnyways, it's good to know now that you will probably never be \"neurotypical\" in this particular way - and that's not necessarily a bad thing. In some ways, I find it really nice to enjoy such a wide range of activities and personalities and ways of doing things. I think that overall, my life is richer for it and happier. And I do now know a lot of dislikes and likes I have, though it took me a long time to get here. So I feel more secure in myself. But at the same time, still very flexible in the way that you describe. \n\n**TLDR: You can be happy just the way you are, but therapy will really help you to navigate the world well with the mental/emotional framework that you have inside you.**", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just want to chime in that I dealt with this too. My mom probably has Borderline Personality Disorder (two of my therapists who met/spoke to her multiple times independently told me that) and when I was growing up, I literally could NOT be myself without her losing her mind. I spent a lot of time trying to be what she wanted, until I got away from her, which made it hard for me to know what &lt;em&gt;I&lt;/em&gt; wanted.&lt;/p&gt;\n\n&lt;p&gt;On top of that, I&amp;#39;ve come to realize that I&amp;#39;m probably an EXTREMELY easy-going person (I think I would have been even without her), who is VERY interested in pretty much everything in the world. So when I meet someone new who has passions that I don&amp;#39;t know anything about, it is VERY easy for me to dip into getting involved in their passions...at least for awhile.&lt;/p&gt;\n\n&lt;p&gt;Like others have said, therapy is the best place to work on this. One therapist of mine in particular worked with me extensively to slowly tease through myself to learn what things I actually like and also taught me how to speak up/advocate for myself in terms of doing what I like with friends (with can be anything from going to a concert that &lt;em&gt;I&lt;/em&gt; like/want to go to with like-minded friends, to speaking up when a group of friends is deciding where to go to dinner, and being firm that no, I do NOT want to go for Thai, but I AM in the mood for Italian or Mexican). It is a long slow process. I can tell you (15 years after that therapy) that it is a life-long process.&lt;/p&gt;\n\n&lt;p&gt;One of the most important things is that if you start to get signals that you DON&amp;#39;T like something as much as you originally did, it is OK to speak up and say so. For many hobbies, after I dip into them for 3-6 months, I get an idea of whether or not I want to continue with them, or if they&amp;#39;re something I&amp;#39;ll do occasionally with my friend, but the hobby really isn&amp;#39;t for me. Learning to speak up like that was really important to me, and the best thing I learned to make that easier is to be really clear with my friends. By which I mean, if it was a new hobby, I would tell them &amp;quot;X is a new hobby, and so far it sounds really cool! I definitely want to try it out, but I don&amp;#39;t want to fully commit to getting totally into it until I&amp;#39;ve done it for some months&amp;quot; And then I&amp;#39;d check in with myself about how I was feeling about this hobby, so I could update my friend &amp;quot;Friend, I do like this, but I don&amp;#39;t looooove it, so I&amp;#39;ll be happy to do it with you sometimes, but I don&amp;#39;t see myself being as into it as you are&amp;quot; and make sure we were clear. &lt;/p&gt;\n\n&lt;p&gt;Another important thing is that if you&amp;#39;re comfortable playing &amp;quot;devil&amp;#39;s advocate&amp;quot; or talking &amp;quot;in theory&amp;quot; with people (I&amp;#39;m referencing your Christian guy/rock-&amp;amp;-roll guy comment), it is VERY important to make it clear to them that you are doing that. For the sake of future fighting and someone feeling as though you lied, knowing how to make it clear that you can see how X works for some people &lt;em&gt;but might not necessarily be the thing that you personally ascribe to yourself&lt;/em&gt; is really important. A therapist can help you learn to do that. &lt;/p&gt;\n\n&lt;p&gt;Anyways, it&amp;#39;s good to know now that you will probably never be &amp;quot;neurotypical&amp;quot; in this particular way - and that&amp;#39;s not necessarily a bad thing. In some ways, I find it really nice to enjoy such a wide range of activities and personalities and ways of doing things. I think that overall, my life is richer for it and happier. And I do now know a lot of dislikes and likes I have, though it took me a long time to get here. So I feel more secure in myself. But at the same time, still very flexible in the way that you describe. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR: You can be happy just the way you are, but therapy will really help you to navigate the world well with the mental/emotional framework that you have inside you.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4fu4n", "score_hidden": false, "stickied": false, "created": 1491954460.0, "created_utc": 1491925660.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4i5md", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "crashfrog", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Like I'm a sociopath or something.\n\nI mean the fact that you're worried about it probably proves that you aren't. Do you experience fear or anxiety? Do you view other people as merely instruments or objects for you to get what you want?\n\nIf you *actually experience connection* to other people, value and care for them because *they're people* and not just because they're useful to you; or if just asking yourself that question makes you feel anxious about the answer, then no, you're almost certainly not a sociopath.\n\nOne thing you can be absolutely certain that sociopaths *never think* is \"oh no, I think I might be a sociopath.\" Because they just don't care if they are or not.\n\n&gt; Every person I hang out with, every friend, family member, co-worker, or random person I start chatting with, without even consciously doing it, I change to fit who they are. \n\nEverybody does this at least a little bit; everybody is at least a little bothered by doing it. But it's part of how human sociality works - we play roles for each other that are determined socially, by unspoken (or formal and explicit) expectations about how we should act. It may very well be that you're *particularly good at it.* Cool, it's a talent! Maybe you'd appreciate work in a customer-facing or client-hospitality role, as a result. Or not, that's cool, too. Maybe you'd make a great actor or comedian, maybe. Voice actor? Are you good at accent and vocabulary shifts?\n\nOf course, what has you worried is that you feel like you're using people by doing this (you're not), or that you're just \"roles\" all the way down, with no depth or core to your personality. That's often a problem that afflicts young people since they haven't had a lot of time to get to know themselves. But that's what *you* need to do - spend time alone, doing things, so you can understand how *you* are when no one's around. Develop some hobbies that you discover you enjoy during that process. Even if being alone with yourself isn't something you like, now, it's worth suffering through, anyway. That's the only way to develop a core identity that isn't centered around playing a role for other people.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Like I&amp;#39;m a sociopath or something.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I mean the fact that you&amp;#39;re worried about it probably proves that you aren&amp;#39;t. Do you experience fear or anxiety? Do you view other people as merely instruments or objects for you to get what you want?&lt;/p&gt;\n\n&lt;p&gt;If you &lt;em&gt;actually experience connection&lt;/em&gt; to other people, value and care for them because &lt;em&gt;they&amp;#39;re people&lt;/em&gt; and not just because they&amp;#39;re useful to you; or if just asking yourself that question makes you feel anxious about the answer, then no, you&amp;#39;re almost certainly not a sociopath.&lt;/p&gt;\n\n&lt;p&gt;One thing you can be absolutely certain that sociopaths &lt;em&gt;never think&lt;/em&gt; is &amp;quot;oh no, I think I might be a sociopath.&amp;quot; Because they just don&amp;#39;t care if they are or not.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Every person I hang out with, every friend, family member, co-worker, or random person I start chatting with, without even consciously doing it, I change to fit who they are. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Everybody does this at least a little bit; everybody is at least a little bothered by doing it. But it&amp;#39;s part of how human sociality works - we play roles for each other that are determined socially, by unspoken (or formal and explicit) expectations about how we should act. It may very well be that you&amp;#39;re &lt;em&gt;particularly good at it.&lt;/em&gt; Cool, it&amp;#39;s a talent! Maybe you&amp;#39;d appreciate work in a customer-facing or client-hospitality role, as a result. Or not, that&amp;#39;s cool, too. Maybe you&amp;#39;d make a great actor or comedian, maybe. Voice actor? Are you good at accent and vocabulary shifts?&lt;/p&gt;\n\n&lt;p&gt;Of course, what has you worried is that you feel like you&amp;#39;re using people by doing this (you&amp;#39;re not), or that you&amp;#39;re just &amp;quot;roles&amp;quot; all the way down, with no depth or core to your personality. That&amp;#39;s often a problem that afflicts young people since they haven&amp;#39;t had a lot of time to get to know themselves. But that&amp;#39;s what &lt;em&gt;you&lt;/em&gt; need to do - spend time alone, doing things, so you can understand how &lt;em&gt;you&lt;/em&gt; are when no one&amp;#39;s around. Develop some hobbies that you discover you enjoy during that process. Even if being alone with yourself isn&amp;#39;t something you like, now, it&amp;#39;s worth suffering through, anyway. That&amp;#39;s the only way to develop a core identity that isn&amp;#39;t centered around playing a role for other people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4i5md", "score_hidden": false, "stickied": false, "created": 1491956994.0, "created_utc": 1491928194.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4itkj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "streetwearlurk", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well this was a little startling to read, I thought I'd drunkenly posted this on a throwaway and forgotten when I first read the title.\n\nI 100% do this. With one ex, I was super active, went out all the time and was super social and into older video games and getting high. With another I was a bit more punk-y, and tough, since all our friends were huge rugby guys. With current SO, I'm more content to sit inside and play LoL or watch Netflix, and cook because he's not super big on going out. With one group of friends I'm a bit more of the odd one out, and often a bit reserved, but generally \"basic\". With another group I'm much more myself, but also much bolder and hipstery than I generally am, and also more polite and firm in what I want out of things, and even within that group I vary with how I act a decent amount from person to person. One of them I can act childish with, one is just jokingly aggressive, one I can dish dirt with (which isn't much my thing with other girls usually), and another makes me feel really intellectual.\n\nMy SO is... rather disturbed by it, it seems, because he isn't really in that second group of friends, it's a bit unnerving to have me act so differently with another group of people. I've always been sort of aware of this issue, so I keep six degrees of separation between family and friends and other groups I interact with. I slipped with that recently in letting my SO see one of those other sides of me, and I know it bothers him a lot.\n\nI'm not sure what to do. I'm doing counseling, and also share a similar no-bio-mom situation. I just will bend and stretch myself until I fit each mold as I need to. It hasn't really... helped nail down an identity or anything, it's mostly just helping me learn which me I like best?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well this was a little startling to read, I thought I&amp;#39;d drunkenly posted this on a throwaway and forgotten when I first read the title.&lt;/p&gt;\n\n&lt;p&gt;I 100% do this. With one ex, I was super active, went out all the time and was super social and into older video games and getting high. With another I was a bit more punk-y, and tough, since all our friends were huge rugby guys. With current SO, I&amp;#39;m more content to sit inside and play LoL or watch Netflix, and cook because he&amp;#39;s not super big on going out. With one group of friends I&amp;#39;m a bit more of the odd one out, and often a bit reserved, but generally &amp;quot;basic&amp;quot;. With another group I&amp;#39;m much more myself, but also much bolder and hipstery than I generally am, and also more polite and firm in what I want out of things, and even within that group I vary with how I act a decent amount from person to person. One of them I can act childish with, one is just jokingly aggressive, one I can dish dirt with (which isn&amp;#39;t much my thing with other girls usually), and another makes me feel really intellectual.&lt;/p&gt;\n\n&lt;p&gt;My SO is... rather disturbed by it, it seems, because he isn&amp;#39;t really in that second group of friends, it&amp;#39;s a bit unnerving to have me act so differently with another group of people. I&amp;#39;ve always been sort of aware of this issue, so I keep six degrees of separation between family and friends and other groups I interact with. I slipped with that recently in letting my SO see one of those other sides of me, and I know it bothers him a lot.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure what to do. I&amp;#39;m doing counseling, and also share a similar no-bio-mom situation. I just will bend and stretch myself until I fit each mold as I need to. It hasn&amp;#39;t really... helped nail down an identity or anything, it&amp;#39;s mostly just helping me learn which me I like best?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4itkj", "score_hidden": false, "stickied": false, "created": 1491957735.0, "created_utc": 1491928935.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5aclf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "_Psychopathy_", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hi! \n\nI am a research psychologist that studies psychopathy/sociopathy (note the username), so while I don't usually have good advice to share in /r/relationships, I might this time. \n\nGood news! No chance that you would meet criteria for Anti-social personality disorder (the official designation for people that we classify as sociopaths). There is a lot of reasons for me to come to that conclusion, but basically, shifting identity is not a hallmark trait of that disorder. Lying is, but it is a different kind of lying (lying to get ahead, lying to manipulate others etc, telling totally outrageous lies to see if they can get away with it.)\n\nAs some other commenters here have noted, disturbed sense of identity can be a trait common in individuals with Borderline personality disorder, but that is JUST ONE trait. Please hear me when I say that one trait does not make someone meet criteria for a personality disorder. If your relationships are pretty stable (like you would not describe them as being on an emotional rollercoaster) you likely don't have that disorder either. \n\nSo while you probably don't have a personality disorder of any kind, any time that someone is struggling with their sense of identity, I would recommend therapy. That is exactly what it exists for. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! &lt;/p&gt;\n\n&lt;p&gt;I am a research psychologist that studies psychopathy/sociopathy (note the username), so while I don&amp;#39;t usually have good advice to share in &lt;a href=\"/r/relationships\"&gt;/r/relationships&lt;/a&gt;, I might this time. &lt;/p&gt;\n\n&lt;p&gt;Good news! No chance that you would meet criteria for Anti-social personality disorder (the official designation for people that we classify as sociopaths). There is a lot of reasons for me to come to that conclusion, but basically, shifting identity is not a hallmark trait of that disorder. Lying is, but it is a different kind of lying (lying to get ahead, lying to manipulate others etc, telling totally outrageous lies to see if they can get away with it.)&lt;/p&gt;\n\n&lt;p&gt;As some other commenters here have noted, disturbed sense of identity can be a trait common in individuals with Borderline personality disorder, but that is JUST ONE trait. Please hear me when I say that one trait does not make someone meet criteria for a personality disorder. If your relationships are pretty stable (like you would not describe them as being on an emotional rollercoaster) you likely don&amp;#39;t have that disorder either. &lt;/p&gt;\n\n&lt;p&gt;So while you probably don&amp;#39;t have a personality disorder of any kind, any time that someone is struggling with their sense of identity, I would recommend therapy. That is exactly what it exists for. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5aclf", "score_hidden": false, "stickied": false, "created": 1491990435.0, "created_utc": 1491961635.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg6lfrj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "historicalpresent", "parent_id": "t1_dg5jzym", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks for posting thread. I am exactly the same as you (and have been for as long as I can remember) and it has been so interesting to read all the comments. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for posting thread. I am exactly the same as you (and have been for as long as I can remember) and it has been so interesting to read all the comments. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6lfrj", "score_hidden": false, "stickied": false, "created": 1492061345.0, "created_utc": 1492032545.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jzym", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "HiChamomileChameleon", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Seriously, thank you all for your comments. I edited my post to add my age and gender because so many people were asking (25F).\n\nI'm already seeing a therapist to deal with some totally unrelated things, I've just always kept this fear to myself. I'll bring it up next time and try to start working on it.\n\nFor those that asked, this is something I do with every single person I interact with every day. It's not just boyfriends. It's family members, coworkers, friends, boyfriends, and even complete strangers. I think a lot of you are right that it probably has to do with wanting to be accepted and liked; sounds stupid to say that. Part of why polyamory works so well for me is because I genuinely love people and want nothing more than to love and be loved by people. I enjoy seeing others happy so I always put them above myself, its second nature and rarely do I regret it. But it does mean I'm limiting my true self to fit into the box that the other person (whoever they may be) would prefer I fit into. My current boyfriend is the first person I've EVER asked to do specific things that were for my personal enjoyment without considering if it was something he enjoyed before asking. And I have anxiety every single time I ask, not because he's ever denied me, I just do.\n\nAfter what you all said, I'm not worried I'm a sociopath anymore, so, thank you! I'll definitely take the advice given here by so many of you regarding self discovery and try to start the process of sorting through what's actually ME and what's become part of me simply for someone else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Seriously, thank you all for your comments. I edited my post to add my age and gender because so many people were asking (25F).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m already seeing a therapist to deal with some totally unrelated things, I&amp;#39;ve just always kept this fear to myself. I&amp;#39;ll bring it up next time and try to start working on it.&lt;/p&gt;\n\n&lt;p&gt;For those that asked, this is something I do with every single person I interact with every day. It&amp;#39;s not just boyfriends. It&amp;#39;s family members, coworkers, friends, boyfriends, and even complete strangers. I think a lot of you are right that it probably has to do with wanting to be accepted and liked; sounds stupid to say that. Part of why polyamory works so well for me is because I genuinely love people and want nothing more than to love and be loved by people. I enjoy seeing others happy so I always put them above myself, its second nature and rarely do I regret it. But it does mean I&amp;#39;m limiting my true self to fit into the box that the other person (whoever they may be) would prefer I fit into. My current boyfriend is the first person I&amp;#39;ve EVER asked to do specific things that were for my personal enjoyment without considering if it was something he enjoyed before asking. And I have anxiety every single time I ask, not because he&amp;#39;s ever denied me, I just do.&lt;/p&gt;\n\n&lt;p&gt;After what you all said, I&amp;#39;m not worried I&amp;#39;m a sociopath anymore, so, thank you! I&amp;#39;ll definitely take the advice given here by so many of you regarding self discovery and try to start the process of sorting through what&amp;#39;s actually ME and what&amp;#39;s become part of me simply for someone else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jzym", "score_hidden": false, "stickied": false, "created": 1492006236.0, "created_utc": 1491977436.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg44ygs", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "gldedbttrfly", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The fact you are even worried about this shows you aren't a sociopath. \n\nI think you just want to be special and need validation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The fact you are even worried about this shows you aren&amp;#39;t a sociopath. &lt;/p&gt;\n\n&lt;p&gt;I think you just want to be special and need validation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg44ygs", "score_hidden": false, "stickied": false, "created": 1491939364.0, "created_utc": 1491910564.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4b3nm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RedTheDopeKing", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "A true sociopath wouldn't worry about their motives so I think you're ok there. \n\nIt sounds to me like you need validation too much from people so you shift to meet their tastes and opinions. Be you, whoever that may be.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A true sociopath wouldn&amp;#39;t worry about their motives so I think you&amp;#39;re ok there. &lt;/p&gt;\n\n&lt;p&gt;It sounds to me like you need validation too much from people so you shift to meet their tastes and opinions. Be you, whoever that may be.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4b3nm", "score_hidden": false, "stickied": false, "created": 1491949032.0, "created_utc": 1491920232.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4dw1x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "green_turban", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Identity is an interesting thing.  It's absolutely fine to try on different \"selves\" when you interact with others, and I think you're just someone who is able to adapt to new experiences in a very complete way. \n\nMaybe just being \"you\" means trying new experiences and people in a whole hearted way.  \n\nDon't beat yourself up over it, enjoy it, and don't be afraid to think about who \"you\" really are and figure out which aspects of yourself you want to stay consistent around different people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Identity is an interesting thing.  It&amp;#39;s absolutely fine to try on different &amp;quot;selves&amp;quot; when you interact with others, and I think you&amp;#39;re just someone who is able to adapt to new experiences in a very complete way. &lt;/p&gt;\n\n&lt;p&gt;Maybe just being &amp;quot;you&amp;quot; means trying new experiences and people in a whole hearted way.  &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t beat yourself up over it, enjoy it, and don&amp;#39;t be afraid to think about who &amp;quot;you&amp;quot; really are and figure out which aspects of yourself you want to stay consistent around different people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4dw1x", "score_hidden": false, "stickied": false, "created": 1491952300.0, "created_utc": 1491923500.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4elcu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "starshine1988", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It'd be helpful to know how old you are. From my teens to early twenties I tried on all sorts of personalities and subcultures. That doesn't make someone a sociopath, it just means they get interested in stuff, are generally agreeable, and like to talk about other people's interests. It's how you get exposed to all sorts of fun and new things. Its how you become great at Jeopardy. \n\nI don't think you should really be worried about this at all. I think it would be troubling to hear that you appropriated a cowboy identify for something like a monetary gain, or to manipulate someone into doing something specific for you, rather than liking a person and trying on their life for a bit and then letting it drop after it ran it's course. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;d be helpful to know how old you are. From my teens to early twenties I tried on all sorts of personalities and subcultures. That doesn&amp;#39;t make someone a sociopath, it just means they get interested in stuff, are generally agreeable, and like to talk about other people&amp;#39;s interests. It&amp;#39;s how you get exposed to all sorts of fun and new things. Its how you become great at Jeopardy. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think you should really be worried about this at all. I think it would be troubling to hear that you appropriated a cowboy identify for something like a monetary gain, or to manipulate someone into doing something specific for you, rather than liking a person and trying on their life for a bit and then letting it drop after it ran it&amp;#39;s course. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4elcu", "score_hidden": false, "stickied": false, "created": 1491953078.0, "created_utc": 1491924278.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4ivo8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Purplestripes8", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "We all empathise and emulate with the people around us to some extent, in order to fit in. You're not a sociopath. To determine if this behaviour is a problem we have to consider if it interferes with your daily quality of life. My question is, when you are alone - around no one - who are you? What is your personality? ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We all empathise and emulate with the people around us to some extent, in order to fit in. You&amp;#39;re not a sociopath. To determine if this behaviour is a problem we have to consider if it interferes with your daily quality of life. My question is, when you are alone - around no one - who are you? What is your personality? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ivo8", "score_hidden": false, "stickied": false, "created": 1491957798.0, "created_utc": 1491928998.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4m8uo", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thehalflingcooks", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If you're worried, you're not a sociopath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re worried, you&amp;#39;re not a sociopath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4m8uo", "score_hidden": false, "stickied": false, "created": 1491961463.0, "created_utc": 1491932663.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4mna8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Moobx", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hmm in my class we learned that there people with independent type of selves and people with interdependent type of selves. Independent is about being consistent with urself, and interdependent about being consistent with others. Basically, it seems u are interdependent type and ur self is fluid. U adjust to situations and people. However I am just a student, so I think that's it's a good idea to listen to what others are saying seeing a therapist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hmm in my class we learned that there people with independent type of selves and people with interdependent type of selves. Independent is about being consistent with urself, and interdependent about being consistent with others. Basically, it seems u are interdependent type and ur self is fluid. U adjust to situations and people. However I am just a student, so I think that&amp;#39;s it&amp;#39;s a good idea to listen to what others are saying seeing a therapist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4mna8", "score_hidden": false, "stickied": false, "created": 1491961899.0, "created_utc": 1491933099.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4mphc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Jolsen", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "How old are you?\n\nHonestly it just sounds like you are having a lot of different life experiences and figuring out who you are. There isn't anything wrong with that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How old are you?&lt;/p&gt;\n\n&lt;p&gt;Honestly it just sounds like you are having a lot of different life experiences and figuring out who you are. There isn&amp;#39;t anything wrong with that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4mphc", "score_hidden": false, "stickied": false, "created": 1491961966.0, "created_utc": 1491933166.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4msl0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "RestingMurderFace", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wow. Have you ever seen the movie Runaway Bride with Julia Roberts? Because the whole movie is about her being like this and unable to commit to anyone.\n\nBy the end, she forces herself to really think about who she is and what she, herself, actually likes and values. Might be worth it to watch for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. Have you ever seen the movie Runaway Bride with Julia Roberts? Because the whole movie is about her being like this and unable to commit to anyone.&lt;/p&gt;\n\n&lt;p&gt;By the end, she forces herself to really think about who she is and what she, herself, actually likes and values. Might be worth it to watch for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4msl0", "score_hidden": false, "stickied": false, "created": 1491962063.0, "created_utc": 1491933263.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4qy93", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Derptron5K", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think a lot of people will identify with this to some degree, especially those who don't have the most solid opinion of themselves.  I identify anyway.\n\nThe thing is that there is no \"you\".  No unshaking, rock-solid identity waiting to be unearthed.  You're experimenting with different personalities, hoping one fits.  This experience is almost universal.  In your case, it sounds like they fit a little too well!  You're worried about how well you fit in to each new person.\n\nI think you're looking in the right direction when you say it's about approval.  You validate others, and they validate you.  That feels good.  In the long run, it sounds like you are hoping to validate yourself.  That's great.  Being able to validate yourself is huge, psychologically, and it's a major milestone in many people's lives.\n\nAnd, proportionately, it's much harder and less obvious than mimicking traits from others.  It's a journey no one can take for you, and that's why people will recommend therapy and meditation.  They are both great tools for untangling your thoughts, becoming mindful of your feelings, and listening to yourself.\n\nAsking for help is a great first step.  Where you go from here is up to you.  Good luck (=", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of people will identify with this to some degree, especially those who don&amp;#39;t have the most solid opinion of themselves.  I identify anyway.&lt;/p&gt;\n\n&lt;p&gt;The thing is that there is no &amp;quot;you&amp;quot;.  No unshaking, rock-solid identity waiting to be unearthed.  You&amp;#39;re experimenting with different personalities, hoping one fits.  This experience is almost universal.  In your case, it sounds like they fit a little too well!  You&amp;#39;re worried about how well you fit in to each new person.&lt;/p&gt;\n\n&lt;p&gt;I think you&amp;#39;re looking in the right direction when you say it&amp;#39;s about approval.  You validate others, and they validate you.  That feels good.  In the long run, it sounds like you are hoping to validate yourself.  That&amp;#39;s great.  Being able to validate yourself is huge, psychologically, and it&amp;#39;s a major milestone in many people&amp;#39;s lives.&lt;/p&gt;\n\n&lt;p&gt;And, proportionately, it&amp;#39;s much harder and less obvious than mimicking traits from others.  It&amp;#39;s a journey no one can take for you, and that&amp;#39;s why people will recommend therapy and meditation.  They are both great tools for untangling your thoughts, becoming mindful of your feelings, and listening to yourself.&lt;/p&gt;\n\n&lt;p&gt;Asking for help is a great first step.  Where you go from here is up to you.  Good luck (=&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4qy93", "score_hidden": false, "stickied": false, "created": 1491966562.0, "created_utc": 1491937762.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4to70", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "TheLoneJack", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think an important point to consider is whether or not those personalities are actually contradictory to each other.  People do have different facets to them, and some people are more accepting of new things or like a wider variety of things than others.\n\nA basic example might be music tastes--you mention one person that loved country and another that loved rock.  If you like both, there's no reason to talk about country music with the rock-lover.  If it comes up you can say that you enjoy country music as well, it just might not come up.  Similarly, if you know that they'd hate to do a particular thing, it makes sense to not suggest it and to focus on things that you could enjoy together.  That's just focusing on the facets of yourself that you share with the person (and it's okay if you only just explored those facets upon meeting them).\n\nBut if he asked about your thoughts on country music and your response was to trash talk it, that's a point of concern.  That indicates that you have this idea that it might be a bad thing to have different opinions/likes/interests from people close to you--which effectively means you aren't allowing yourself to be your own person.\n\nSomething you could maybe experiment with is mentioning that variety of interests to people.  Maybe ask the rock-lover what his thought on country music is and mention that you like both that *and* rock--that sort of thing.  Is that something that you're comfortable with doing?  Does it still feel honest?\n\nIf yes, then I think you're just super open to things.  It still could be a good idea to try to talk about your other interests with a partner/friends to some extent--even if they don't want to engage in or share the interest, it's something worth knowing about you.\n\nIf no, then you might want to take a step back to try to (as /u/AnotherChameleon says) figure out who you are when you're alone.  Try things out on your own and not influence from those around you. Therapy might be helpful for you to achieve this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think an important point to consider is whether or not those personalities are actually contradictory to each other.  People do have different facets to them, and some people are more accepting of new things or like a wider variety of things than others.&lt;/p&gt;\n\n&lt;p&gt;A basic example might be music tastes--you mention one person that loved country and another that loved rock.  If you like both, there&amp;#39;s no reason to talk about country music with the rock-lover.  If it comes up you can say that you enjoy country music as well, it just might not come up.  Similarly, if you know that they&amp;#39;d hate to do a particular thing, it makes sense to not suggest it and to focus on things that you could enjoy together.  That&amp;#39;s just focusing on the facets of yourself that you share with the person (and it&amp;#39;s okay if you only just explored those facets upon meeting them).&lt;/p&gt;\n\n&lt;p&gt;But if he asked about your thoughts on country music and your response was to trash talk it, that&amp;#39;s a point of concern.  That indicates that you have this idea that it might be a bad thing to have different opinions/likes/interests from people close to you--which effectively means you aren&amp;#39;t allowing yourself to be your own person.&lt;/p&gt;\n\n&lt;p&gt;Something you could maybe experiment with is mentioning that variety of interests to people.  Maybe ask the rock-lover what his thought on country music is and mention that you like both that &lt;em&gt;and&lt;/em&gt; rock--that sort of thing.  Is that something that you&amp;#39;re comfortable with doing?  Does it still feel honest?&lt;/p&gt;\n\n&lt;p&gt;If yes, then I think you&amp;#39;re just super open to things.  It still could be a good idea to try to talk about your other interests with a partner/friends to some extent--even if they don&amp;#39;t want to engage in or share the interest, it&amp;#39;s something worth knowing about you.&lt;/p&gt;\n\n&lt;p&gt;If no, then you might want to take a step back to try to (as &lt;a href=\"/u/AnotherChameleon\"&gt;/u/AnotherChameleon&lt;/a&gt; says) figure out who you are when you&amp;#39;re alone.  Try things out on your own and not influence from those around you. Therapy might be helpful for you to achieve this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4to70", "score_hidden": false, "stickied": false, "created": 1491969487.0, "created_utc": 1491940687.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4u8q9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "draggingmyfeet", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There are a lot of great suggestions in here. I just wanted to add that I have felt this way, too, and you're not weird. It has a lot to do with learning about people, lifestyles, and pretty much everything. Some people are raised to think \"this is how life is,\" and they get a very narrow POV. I'd say you're smarter than that- you know there are lots of options in the world, none of which you have to stick to, and you're open to learning everything.\n\nTherapy helped me figure out who I am, who I want to be, and how to be strong in that sense of self. I still struggle with things like this...\n\n&gt;my boyfriend asked me what I want to do, or really when anyone asks me that, I find myself immediately going down a list of what THEY would want to do\n\n... and I can be flexible with other people, but I no longer change my entire being to cater to anyone else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a lot of great suggestions in here. I just wanted to add that I have felt this way, too, and you&amp;#39;re not weird. It has a lot to do with learning about people, lifestyles, and pretty much everything. Some people are raised to think &amp;quot;this is how life is,&amp;quot; and they get a very narrow POV. I&amp;#39;d say you&amp;#39;re smarter than that- you know there are lots of options in the world, none of which you have to stick to, and you&amp;#39;re open to learning everything.&lt;/p&gt;\n\n&lt;p&gt;Therapy helped me figure out who I am, who I want to be, and how to be strong in that sense of self. I still struggle with things like this...&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;my boyfriend asked me what I want to do, or really when anyone asks me that, I find myself immediately going down a list of what THEY would want to do&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;... and I can be flexible with other people, but I no longer change my entire being to cater to anyone else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4u8q9", "score_hidden": false, "stickied": false, "created": 1491970125.0, "created_utc": 1491941325.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4vvsc", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "sonyasaurus", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you're worried about \"mirroring\", which can be a symptom of various things, but is not necessarily an indicator by itself. Also, the Self is vast and complex. It is normal for different people to bring out different aspects or facets if your personality. If your enjoyment is real don't assume you're faking it just because your interests vary and change. Real people are seldom the kind of static, one dimensional characters we see in fiction. ::edited a typo.::", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re worried about &amp;quot;mirroring&amp;quot;, which can be a symptom of various things, but is not necessarily an indicator by itself. Also, the Self is vast and complex. It is normal for different people to bring out different aspects or facets if your personality. If your enjoyment is real don&amp;#39;t assume you&amp;#39;re faking it just because your interests vary and change. Real people are seldom the kind of static, one dimensional characters we see in fiction. ::edited a typo.::&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4vvsc", "score_hidden": false, "stickied": false, "created": 1491971961.0, "created_utc": 1491943161.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4w1zx", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jewelsinme", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you're just young and exploring the world and all it has to offer. I don't see it as sociopath but more open to new experiences. Over time, you'll probably find one area you like more than others and just sort of stick there. Or... you'll get married ha. But to me, you seem fine. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re just young and exploring the world and all it has to offer. I don&amp;#39;t see it as sociopath but more open to new experiences. Over time, you&amp;#39;ll probably find one area you like more than others and just sort of stick there. Or... you&amp;#39;ll get married ha. But to me, you seem fine. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4w1zx", "score_hidden": false, "stickied": false, "created": 1491972151.0, "created_utc": 1491943351.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4zmnu", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "AatroxIsBae", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well I definitely don't think you're a sociopath. I think you're just a mimic!\n\nI do the same thing. I have aspergers, or high functioning autism. I am very shy, and just normally kind of off putting to some people, so as I get comfortable with a space I adapt to it. I speak country with my southern family and gamer speak with my friends to fit in\n\nIt's normal, though youve taken it to a much higher extent. It's completely fine and nothing to worry about\n\nEdit: Though if you are worried about it, I second therapy. Therapy is always a good route", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I definitely don&amp;#39;t think you&amp;#39;re a sociopath. I think you&amp;#39;re just a mimic!&lt;/p&gt;\n\n&lt;p&gt;I do the same thing. I have aspergers, or high functioning autism. I am very shy, and just normally kind of off putting to some people, so as I get comfortable with a space I adapt to it. I speak country with my southern family and gamer speak with my friends to fit in&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s normal, though youve taken it to a much higher extent. It&amp;#39;s completely fine and nothing to worry about&lt;/p&gt;\n\n&lt;p&gt;Edit: Though if you are worried about it, I second therapy. Therapy is always a good route&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4zmnu", "score_hidden": false, "stickied": false, "created": 1491976380.0, "created_utc": 1491947580.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg53d5x", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "angel_munster", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I am just like you and have been my whole life.  What scares me even more is I can copy peoples emotions as well when I am around them.  I have nothing to give you but you are not alone.  Use this skill for good is the best thing you can do with it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am just like you and have been my whole life.  What scares me even more is I can copy peoples emotions as well when I am around them.  I have nothing to give you but you are not alone.  Use this skill for good is the best thing you can do with it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg53d5x", "score_hidden": false, "stickied": false, "created": 1491981203.0, "created_utc": 1491952403.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg55v0s", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "throwawayno123456789", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You don't mention how old you are...but to some extent \"trying on\" different lifestyles to see how they feel is just part of growing up.\n\nLearn to look for the little joy feeling and do more of that.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t mention how old you are...but to some extent &amp;quot;trying on&amp;quot; different lifestyles to see how they feel is just part of growing up.&lt;/p&gt;\n\n&lt;p&gt;Learn to look for the little joy feeling and do more of that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg55v0s", "score_hidden": false, "stickied": false, "created": 1491984573.0, "created_utc": 1491955773.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5k7hm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Sublimestylee817", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you might be crazy", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you might be crazy&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5k7hm", "score_hidden": false, "stickied": false, "created": 1492006734.0, "created_utc": 1491977934.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5lhda", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Endless__Throwaway", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're not a sociopath. I had a friend like you in college. She mirrored any boyfriend or other relationship she had. \n\nUnsurprisingly, you haven't mentioned anything about yourself. I'm not a therapist and I do think you should seek one out to get to the root issues but if I had to guess, I'd say that maybe you do this as a defense mechanism on some level. By mirroring them, they don't get to know who you truely are at the core or anything that could lead to real intimacy. \n\nThat's not to say that you never had any, maybe on some level you thought you were. But what you gotta do is take a time out and figure out who u/HiChamomileChameleon really is - outside of this ...'ability'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not a sociopath. I had a friend like you in college. She mirrored any boyfriend or other relationship she had. &lt;/p&gt;\n\n&lt;p&gt;Unsurprisingly, you haven&amp;#39;t mentioned anything about yourself. I&amp;#39;m not a therapist and I do think you should seek one out to get to the root issues but if I had to guess, I&amp;#39;d say that maybe you do this as a defense mechanism on some level. By mirroring them, they don&amp;#39;t get to know who you truely are at the core or anything that could lead to real intimacy. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s not to say that you never had any, maybe on some level you thought you were. But what you gotta do is take a time out and figure out who &lt;a href=\"/u/HiChamomileChameleon\"&gt;u/HiChamomileChameleon&lt;/a&gt; really is - outside of this ...&amp;#39;ability&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5lhda", "score_hidden": false, "stickied": false, "created": 1492009991.0, "created_utc": 1491981191.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5mwai", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "thesunshineband", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think everyone experiences/feels this to some extent...at least I've talked to many friends about it and they all agreed. I act very differently with different friends family members. I have some friends who see me as demure and academic and others who know my hard partying side. If you truly feel like you don't know who you are or like you HAVE to change to make people like you then therapy could be useful,  but I don't think there's anything wrong with letting your friends bring out different sides of your personality and exploring different interests. \"You\" are the sum of all of those different personalities. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think everyone experiences/feels this to some extent...at least I&amp;#39;ve talked to many friends about it and they all agreed. I act very differently with different friends family members. I have some friends who see me as demure and academic and others who know my hard partying side. If you truly feel like you don&amp;#39;t know who you are or like you HAVE to change to make people like you then therapy could be useful,  but I don&amp;#39;t think there&amp;#39;s anything wrong with letting your friends bring out different sides of your personality and exploring different interests. &amp;quot;You&amp;quot; are the sum of all of those different personalities. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5mwai", "score_hidden": false, "stickied": false, "created": 1492014103.0, "created_utc": 1491985303.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5oesj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "NovaKong", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OMG You're me! \n\nI don't think there's anything wrong with it. It means I have experience in a ridiculously huge range of hobbies, I have a stupid amount of general knowledge and can keep a conversation going on (almost) any topic, and I can get along well with almost anyone.\n\nSo long as you're aware of it, and so you can prevent people from thinking you're as ______ as you may appear (and then find out afterwards that you're not, and feel slightly misled), I think you're fine. \n\nI think the other commenters are speaking from a position where they have to fake it to fit in, and so they think it's unhealthy, but if you're like me, it's not even faking it. It's natural, we genuinely have fun, we ARE interested, and we enjoy ourselves. There's nothing unhealthy about that, at least not in my opinion. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OMG You&amp;#39;re me! &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think there&amp;#39;s anything wrong with it. It means I have experience in a ridiculously huge range of hobbies, I have a stupid amount of general knowledge and can keep a conversation going on (almost) any topic, and I can get along well with almost anyone.&lt;/p&gt;\n\n&lt;p&gt;So long as you&amp;#39;re aware of it, and so you can prevent people from thinking you&amp;#39;re as ______ as you may appear (and then find out afterwards that you&amp;#39;re not, and feel slightly misled), I think you&amp;#39;re fine. &lt;/p&gt;\n\n&lt;p&gt;I think the other commenters are speaking from a position where they have to fake it to fit in, and so they think it&amp;#39;s unhealthy, but if you&amp;#39;re like me, it&amp;#39;s not even faking it. It&amp;#39;s natural, we genuinely have fun, we ARE interested, and we enjoy ourselves. There&amp;#39;s nothing unhealthy about that, at least not in my opinion. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5oesj", "score_hidden": false, "stickied": false, "created": 1492018880.0, "created_utc": 1491990080.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5z7mv", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Battlepuppy", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Part of what you are describing is one of the types of emotional intelligence, and the name escapes me.\n\n\nIt's a type of empathy.  My husband has it too.  He finds himself taking on the accent of the person he is talking to, taking up attitude and cultural body language as well.\n\n( like a head bob upwards for a greeting instead of a hand shake,  or changing personal space distances. )", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Part of what you are describing is one of the types of emotional intelligence, and the name escapes me.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s a type of empathy.  My husband has it too.  He finds himself taking on the accent of the person he is talking to, taking up attitude and cultural body language as well.&lt;/p&gt;\n\n&lt;p&gt;( like a head bob upwards for a greeting instead of a hand shake,  or changing personal space distances. )&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5z7mv", "score_hidden": false, "stickied": false, "created": 1492038009.0, "created_utc": 1492009209.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg6h500", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chloetomorrow", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're adaptive, not a sociopath.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re adaptive, not a sociopath.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6h500", "score_hidden": false, "stickied": false, "created": 1492056678.0, "created_utc": 1492027878.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg488kl", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Cobraess", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think this is relatively common but you are just doing this to a greater extent than most. If I meet someone who's into rock, that brings forth things that I know and like about rock and will just walk about them, because it's out mutual interest and supplies us with a similarity. \n\nSame for farming, I'll bring whatever information I know and like about it forwards, leaving what I know and like about rock behind. \n\nIt's just acceptance and fitting in. Definitely not sociopathic tendencies! Take the best bits that you like the most of of all of these personas and make them you!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think this is relatively common but you are just doing this to a greater extent than most. If I meet someone who&amp;#39;s into rock, that brings forth things that I know and like about rock and will just walk about them, because it&amp;#39;s out mutual interest and supplies us with a similarity. &lt;/p&gt;\n\n&lt;p&gt;Same for farming, I&amp;#39;ll bring whatever information I know and like about it forwards, leaving what I know and like about rock behind. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s just acceptance and fitting in. Definitely not sociopathic tendencies! Take the best bits that you like the most of of all of these personas and make them you!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg488kl", "score_hidden": false, "stickied": false, "created": 1491945195.0, "created_utc": 1491916395.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4htg9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "deceasedhusband", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I am not an expert but it doesn't sound like you're a sociopath/psychopath to me. Only a trained medical professional could tell you that for sure but it doesn't sound like you have any of lack of empathy or remorse that defines hose conditions. It sounds like if anything you really want people to like you and that you really care about other people. How old are you? You don't say in your post but I get the impression that you're fairly young. It's pretty normal for people to go through various phases of \"finding themselves\" as they grow up. And we all adapt to the behaviors of the people we are around to some degree, that's normal too. What you describe sounds a little bit more extreme but it could just be a combination of being young, not really sure of yourself yet, actually having varied interests and being open to trying new things (that's a great thing!! being a stiff old stick in the mud who never leaves their comfort zone would be way worse!), and perhaps some low self esteem stemming from family of origin issues. A good therapist can help you parse through all of that stuff.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am not an expert but it doesn&amp;#39;t sound like you&amp;#39;re a sociopath/psychopath to me. Only a trained medical professional could tell you that for sure but it doesn&amp;#39;t sound like you have any of lack of empathy or remorse that defines hose conditions. It sounds like if anything you really want people to like you and that you really care about other people. How old are you? You don&amp;#39;t say in your post but I get the impression that you&amp;#39;re fairly young. It&amp;#39;s pretty normal for people to go through various phases of &amp;quot;finding themselves&amp;quot; as they grow up. And we all adapt to the behaviors of the people we are around to some degree, that&amp;#39;s normal too. What you describe sounds a little bit more extreme but it could just be a combination of being young, not really sure of yourself yet, actually having varied interests and being open to trying new things (that&amp;#39;s a great thing!! being a stiff old stick in the mud who never leaves their comfort zone would be way worse!), and perhaps some low self esteem stemming from family of origin issues. A good therapist can help you parse through all of that stuff.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4htg9", "score_hidden": false, "stickied": false, "created": 1491956628.0, "created_utc": 1491927828.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4o1fr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Yumil", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've had similar issues in my interactions up until several months ago when I started to really come into my own way of being who I really am and want to be.\n\nGo on some heavy trips on your own (with a sitter if you need ;P) - do some meditative soul gazing, relive yourself a bit, then be proud of what you find, even the flaws that might frustrate you about yourself. Maybe you will fall back into old hobbies of your own that you used to enjoy. Lose your sense of self and search for the opportunity to come back as your own person with an imagination and emotions of your own then show that off to your friends, be weird excited about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had similar issues in my interactions up until several months ago when I started to really come into my own way of being who I really am and want to be.&lt;/p&gt;\n\n&lt;p&gt;Go on some heavy trips on your own (with a sitter if you need ;P) - do some meditative soul gazing, relive yourself a bit, then be proud of what you find, even the flaws that might frustrate you about yourself. Maybe you will fall back into old hobbies of your own that you used to enjoy. Lose your sense of self and search for the opportunity to come back as your own person with an imagination and emotions of your own then show that off to your friends, be weird excited about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4o1fr", "score_hidden": false, "stickied": false, "created": 1491963438.0, "created_utc": 1491934638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4p1tb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "heart_of_blue", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think we all do this to a certain extent, and it can be healthy to expand your horizons by exploring new things with other people. There's nothing wrong with having a wide variety of hobbies and interests, or with being an open-minded and curious person. \n\nIt becomes unhealthy when you completely lose (or fail to develop) your sense of self and rely on other people for happiness and direction. For example, when you are single, what do you do for fun and *for yourself*? Is there anything that is just yours to enjoy? Do your boyfriends ever take interest in your hobbies, or is it always you catering to them? Do you have your own moral compass and spiritual/religious beliefs, or do you find yourself just going along with whatever your new boyfriend of friend says?\n\nYou're not a sociopath, but I do think your upbringing has affected the way you interact with others. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think we all do this to a certain extent, and it can be healthy to expand your horizons by exploring new things with other people. There&amp;#39;s nothing wrong with having a wide variety of hobbies and interests, or with being an open-minded and curious person. &lt;/p&gt;\n\n&lt;p&gt;It becomes unhealthy when you completely lose (or fail to develop) your sense of self and rely on other people for happiness and direction. For example, when you are single, what do you do for fun and &lt;em&gt;for yourself&lt;/em&gt;? Is there anything that is just yours to enjoy? Do your boyfriends ever take interest in your hobbies, or is it always you catering to them? Do you have your own moral compass and spiritual/religious beliefs, or do you find yourself just going along with whatever your new boyfriend of friend says?&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re not a sociopath, but I do think your upbringing has affected the way you interact with others. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4p1tb", "score_hidden": false, "stickied": false, "created": 1491964549.0, "created_utc": 1491935749.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4teje", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Imprettystrong", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think everyone can/does experience this to varying degrees, OP just sounds a lot more severe then most people. Like its normal for groups/couples to have their own mannerisms and jokes and quirks together and mesh together in unique ways but to me it sounds like you need to work yourself and your independence OP! Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think everyone can/does experience this to varying degrees, OP just sounds a lot more severe then most people. Like its normal for groups/couples to have their own mannerisms and jokes and quirks together and mesh together in unique ways but to me it sounds like you need to work yourself and your independence OP! Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4teje", "score_hidden": false, "stickied": false, "created": 1491969197.0, "created_utc": 1491940397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4xozj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "arrowsight", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hi! I do this a lot, too. So you're not alone. I would recommend talking to a counselor. It doesn't mean you're a sociopath at all. Maybe you're anxious and want to fit in. Or maybe you have Aspergers. But you shouldn't be really worried about it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I do this a lot, too. So you&amp;#39;re not alone. I would recommend talking to a counselor. It doesn&amp;#39;t mean you&amp;#39;re a sociopath at all. Maybe you&amp;#39;re anxious and want to fit in. Or maybe you have Aspergers. But you shouldn&amp;#39;t be really worried about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4xozj", "score_hidden": false, "stickied": false, "created": 1491974051.0, "created_utc": 1491945251.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4ylfq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Burcu1234", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Have you described me? I enjoy adapting my personality to the people around me. It makes me EXTREMELY adaptable and flexible - which are valuable skills.It gives me pleasure to manage different people. I cannot understand it when people say 'be yourself' because it makes me feel like I am fake all the time. However, I am very self critical and focus on why people may not like me.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you described me? I enjoy adapting my personality to the people around me. It makes me EXTREMELY adaptable and flexible - which are valuable skills.It gives me pleasure to manage different people. I cannot understand it when people say &amp;#39;be yourself&amp;#39; because it makes me feel like I am fake all the time. However, I am very self critical and focus on why people may not like me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4ylfq", "score_hidden": false, "stickied": false, "created": 1491975135.0, "created_utc": 1491946335.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4z63z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dryhuskofaman", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You should watch 'Zelig' by Woody Allen for a farcical take on your particular outlook.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should watch &amp;#39;Zelig&amp;#39; by Woody Allen for a farcical take on your particular outlook.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4z63z", "score_hidden": false, "stickied": false, "created": 1491975825.0, "created_utc": 1491947025.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg52qt4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Syq", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you have something called \"codependence\". I highly urge you to read a book about it. Codependent No More might be a good place to start.\n\nI'm also codependent and operate similarly. I'm working hard to break that though because it is from a traumatic childhood. And it's a bad defense mechanism as an adult. Good luck to you! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you have something called &amp;quot;codependence&amp;quot;. I highly urge you to read a book about it. Codependent No More might be a good place to start.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also codependent and operate similarly. I&amp;#39;m working hard to break that though because it is from a traumatic childhood. And it&amp;#39;s a bad defense mechanism as an adult. Good luck to you! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg52qt4", "score_hidden": false, "stickied": false, "created": 1491980361.0, "created_utc": 1491951561.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5eo3l", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "featheredfelon", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was thinking you were just a sociable person until it got to the lying. When you mentioned your mom, I've started to think that you might be subconsciously desperate for approval, so you're afraid to disagree with people or assert yourself, and want to appear agreeable all the time. \n\n&gt;And even if I don't like something they love, I can lie so easily about it and eventually I find myself enjoying that activity. \n\nDon't be afraid to be who you are. You repeatedly say none of it feels faked, but who are you trying to convince? You contradict that when you say that every time you're done with an interaction, you realize you had put on a mask. You have to get past this fear of being who you really are. Some social flexibility is normal and healthy, but it's important to be your own person.\n\nFinally, lying or being dishonest with yourself or others is terrible for polyamorous relationships...you need to be very open, honest and straightforward about addressing/expressing your own emotional needs and desires, or you will end up feeling used or unfulfilled. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was thinking you were just a sociable person until it got to the lying. When you mentioned your mom, I&amp;#39;ve started to think that you might be subconsciously desperate for approval, so you&amp;#39;re afraid to disagree with people or assert yourself, and want to appear agreeable all the time. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And even if I don&amp;#39;t like something they love, I can lie so easily about it and eventually I find myself enjoying that activity. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Don&amp;#39;t be afraid to be who you are. You repeatedly say none of it feels faked, but who are you trying to convince? You contradict that when you say that every time you&amp;#39;re done with an interaction, you realize you had put on a mask. You have to get past this fear of being who you really are. Some social flexibility is normal and healthy, but it&amp;#39;s important to be your own person.&lt;/p&gt;\n\n&lt;p&gt;Finally, lying or being dishonest with yourself or others is terrible for polyamorous relationships...you need to be very open, honest and straightforward about addressing/expressing your own emotional needs and desires, or you will end up feeling used or unfulfilled. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5eo3l", "score_hidden": false, "stickied": false, "created": 1491996464.0, "created_utc": 1491967664.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5i1w2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pandatweet", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You'd be a sociopath if you were using this to manipulate the people around you.  If you like them, and you're not mirroring their behavior in order to take something from them or hurt them,  I don't see a problem. You might just be really flexible and go with the flow. This isn't a bad thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;d be a sociopath if you were using this to manipulate the people around you.  If you like them, and you&amp;#39;re not mirroring their behavior in order to take something from them or hurt them,  I don&amp;#39;t see a problem. You might just be really flexible and go with the flow. This isn&amp;#39;t a bad thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5i1w2", "score_hidden": false, "stickied": false, "created": 1492002206.0, "created_utc": 1491973406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5jsk7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alyssinelysium", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is an interesting one because there's a bunch of different things or reason this could be, probably more harmless then you think. I'll take a gander for add. Part of my ADD that I think ties in with hyper focus is this habit of getting intensely involved and interested in things and then rolling into the next thing that comes along in similar fashion. For me and most people I think these are hobbies or fashions. But you seem to be experiencing this in all facets of your life. I've often wondered if some actors have ADD. Is it sort of thrilling for you when these changes happen? By this mean do you find that you chameleon because you it seems interesting and fun to experience what this person experiences or is it a dull feeling? Like a void you feel you need to fill with those around you to fit in? If it's the first I would look into ADD and see what you think of the symptoms. Could very well be a myriad of others but don't box yourself in just yet by assuming its something bad or debilitating to be like this. Society has a bad habit of pushing people to \"original\" if not your hipster or basic or whatever and I hate that its not healthy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is an interesting one because there&amp;#39;s a bunch of different things or reason this could be, probably more harmless then you think. I&amp;#39;ll take a gander for add. Part of my ADD that I think ties in with hyper focus is this habit of getting intensely involved and interested in things and then rolling into the next thing that comes along in similar fashion. For me and most people I think these are hobbies or fashions. But you seem to be experiencing this in all facets of your life. I&amp;#39;ve often wondered if some actors have ADD. Is it sort of thrilling for you when these changes happen? By this mean do you find that you chameleon because you it seems interesting and fun to experience what this person experiences or is it a dull feeling? Like a void you feel you need to fill with those around you to fit in? If it&amp;#39;s the first I would look into ADD and see what you think of the symptoms. Could very well be a myriad of others but don&amp;#39;t box yourself in just yet by assuming its something bad or debilitating to be like this. Society has a bad habit of pushing people to &amp;quot;original&amp;quot; if not your hipster or basic or whatever and I hate that its not healthy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jsk7", "score_hidden": false, "stickied": false, "created": 1492005751.0, "created_utc": 1491976951.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg5kq4o", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BonjonJovi", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't think there's anything wrong with you being highly socially adaptable.\n\nYou might want to look into cutting out the lying because for me it hurts my self-esteem and my ability to feel motivated (I need to feel the responsibility of \"being real\"), but that's it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think there&amp;#39;s anything wrong with you being highly socially adaptable.&lt;/p&gt;\n\n&lt;p&gt;You might want to look into cutting out the lying because for me it hurts my self-esteem and my ability to feel motivated (I need to feel the responsibility of &amp;quot;being real&amp;quot;), but that&amp;#39;s it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5kq4o", "score_hidden": false, "stickied": false, "created": 1492008010.0, "created_utc": 1491979210.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4h5a7", "gilded": 0, "archived": false, "score": -4, "report_reasons": null, "author": "CommonSenseCitizen", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are not a sociopath. Just a girl with low self esteem who doesn't know who she is and uses a constant stream of guys to distract herself from figuring it out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are not a sociopath. Just a girl with low self esteem who doesn&amp;#39;t know who she is and uses a constant stream of guys to distract herself from figuring it out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4h5a7", "score_hidden": false, "stickied": false, "created": 1491955903.0, "created_utc": 1491927103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg52sci", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "oogisan", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This might be off topic but are you a Gemini?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This might be off topic but are you a Gemini?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg52sci", "score_hidden": false, "stickied": false, "created": 1491980418.0, "created_utc": 1491951618.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64pz69", "likes": null, "replies": "", "user_reports": [], "id": "dg4g9q0", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "IceWaves", "parent_id": "t3_64pz69", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "A lot of attachment disorders have screwed up identities as one of their components. It doesn't mean you're a sociopath. Speak to a mental health professional.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of attachment disorders have screwed up identities as one of their components. It doesn&amp;#39;t mean you&amp;#39;re a sociopath. Speak to a mental health professional.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg4g9q0", "score_hidden": false, "stickied": false, "created": 1491954933.0, "created_utc": 1491926133.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]