[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll try to make a long story short. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m 19 and I still live at home while I go to community college. I&amp;#39;ve been struggling to find even a shitty retail job, so I have no money. I also have no car. &lt;/p&gt;\n\n&lt;p&gt;I understand no one is obligated to let me use their car, but it becomes a fight with my mom every time I need to go anywhere, including school. For no reason, other than it&amp;#39;s &amp;quot;not her problem&amp;quot;. I&amp;#39;m literally at home 24/7 with the exception of school. I live too far for anyone to want to pick me up to hang out, so I&amp;#39;m in the house all day. And if I ask to use the car for non school reasons? &amp;quot;The car isn&amp;#39;t a toy, you can&amp;#39;t just use it for no reason. Figure it out, its not my problem.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I have about $10,000 in savings for school, but it&amp;#39;s in my mom&amp;#39;s name. It&amp;#39;s not money from her, it&amp;#39;s money from my grandmother. &lt;/p&gt;\n\n&lt;p&gt;I feel like she&amp;#39;s holding being broke over my head because I literally can&amp;#39;t do anything about it. &lt;/p&gt;\n\n&lt;p&gt;Is it a bad idea to get her to put the money, that&amp;#39;s mine, into my name so I can just get a used car with some of it and she can stop using it against me? She also threatens to take the money out for things. If she spends too much at the grocery store &amp;quot;because of me&amp;quot; or something. I also don&amp;#39;t know what I&amp;#39;d do about insurance. &lt;/p&gt;\n\n&lt;p&gt;I know I need the money for school, but I hate being essentially trapped here. Even if I finally find a job, there&amp;#39;s no guarantee she&amp;#39;ll let me use the car to go to it and it would take forever to save for my own. There&amp;#39;s also no way I could walk because it would be 8+ hours altogether (there and back) and I&amp;#39;d still need to get to classes. &lt;/p&gt;\n\n&lt;p&gt;Idk if this would be better suited for /personalfinance but I just need some help. &lt;/p&gt;\n\n&lt;p&gt;I also don&amp;#39;t know what to do about transferring to a new school out of state, because I&amp;#39;m not allowed to do anything until she &amp;quot;looks at it&amp;quot; and I wouldn&amp;#39;t know where to begin. She&amp;#39;s also been saying she&amp;#39;ll &amp;quot;look at it&amp;quot; for weeks and if I try to push it she&amp;#39;ll tell me the world doesn&amp;#39;t revolve around me and it isn&amp;#39;t important right now. I feel like I&amp;#39;m going to be stuck here forever. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: Trapped in my house. There&amp;#39;s a fight every time I need to go somewhere, including school. Not sure what to do about mom holding money over my head. Not sure if I should take money out of school savings to get some independence. Also not allowed to transfer schools out of state. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Update:&lt;/strong&gt; I just want to make a quick little note here, because I&amp;#39;ve got an overwhelming amount of replies and support that I can&amp;#39;t individually reply to all of you but I&amp;#39;d like to thank all of you for being so kind and helpful. The biggest thing I want to address is the savings: a lot of people have said that this situation happens a lot and the money is usually gone. I snooped around her bedroom while she was at work (I know) and found a (recent) bank receipt for her savings. The money &lt;em&gt;is&lt;/em&gt; still there, now I&amp;#39;m just thinking of a way to get her to place it into my account. Also, some people were wondering &lt;em&gt;what&lt;/em&gt; exactly the money is. It was a CD that&amp;#39;s since been taken out and now is just money sitting in her savings. Grandma is still alive, lol. She lives with us. She doesn&amp;#39;t really have a say in what my mom does with the money and likely doesn&amp;#39;t really care or thinks I can&amp;#39;t handle the responsibility of it. They both still treat me as if I&amp;#39;m not &lt;em&gt;really&lt;/em&gt; an adult (and I&amp;#39;ve been told before that I&amp;#39;m not one so I don&amp;#39;t get a say). And yes, it&amp;#39;s specifically for school but at this point I don&amp;#39;t think it really matters. &lt;/p&gt;\n\n&lt;p&gt;Also: I know a lot of people are suggesting alternatives to me (military, dropping out of school, etc.) and I&amp;#39;d like to say that I want to continue on the path I&amp;#39;m already on. My program is already set up for me to transfer somewhere else, and that&amp;#39;s been the plan since before I even started college. I really just need to talk to an advisor about it when break is over so I can get to the next step of actually starting the process to transfer. The only thing about it is that I still need her tax information for FAFSA, so that&amp;#39;s really the one part that I can&amp;#39;t do without her. I&amp;#39;m sure I will get out eventually, but it&amp;#39;s probably just going to be a little slow going. Also, I &lt;em&gt;do&lt;/em&gt; get a lot of FAFSA because her income is only 20K a year. Still not sure what they&amp;#39;ll cover out of state, but that&amp;#39;s something I can cover with an advisor.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'll try to make a long story short. \n\nI'm 19 and I still live at home while I go to community college. I've been struggling to find even a shitty retail job, so I have no money. I also have no car. \n\nI understand no one is obligated to let me use their car, but it becomes a fight with my mom every time I need to go anywhere, including school. For no reason, other than it's \"not her problem\". I'm literally at home 24/7 with the exception of school. I live too far for anyone to want to pick me up to hang out, so I'm in the house all day. And if I ask to use the car for non school reasons? \"The car isn't a toy, you can't just use it for no reason. Figure it out, its not my problem.\" \n\nI have about $10,000 in savings for school, but it's in my mom's name. It's not money from her, it's money from my grandmother. \n\nI feel like she's holding being broke over my head because I literally can't do anything about it. \n\nIs it a bad idea to get her to put the money, that's mine, into my name so I can just get a used car with some of it and she can stop using it against me? She also threatens to take the money out for things. If she spends too much at the grocery store \"because of me\" or something. I also don't know what I'd do about insurance. \n\nI know I need the money for school, but I hate being essentially trapped here. Even if I finally find a job, there's no guarantee she'll let me use the car to go to it and it would take forever to save for my own. There's also no way I could walk because it would be 8+ hours altogether (there and back) and I'd still need to get to classes. \n\nIdk if this would be better suited for /personalfinance but I just need some help. \n\nI also don't know what to do about transferring to a new school out of state, because I'm not allowed to do anything until she \"looks at it\" and I wouldn't know where to begin. She's also been saying she'll \"look at it\" for weeks and if I try to push it she'll tell me the world doesn't revolve around me and it isn't important right now. I feel like I'm going to be stuck here forever. \n\nTL;DR: Trapped in my house. There's a fight every time I need to go somewhere, including school. Not sure what to do about mom holding money over my head. Not sure if I should take money out of school savings to get some independence. Also not allowed to transfer schools out of state. \n\n**Update:** I just want to make a quick little note here, because I've got an overwhelming amount of replies and support that I can't individually reply to all of you but I'd like to thank all of you for being so kind and helpful. The biggest thing I want to address is the savings: a lot of people have said that this situation happens a lot and the money is usually gone. I snooped around her bedroom while she was at work (I know) and found a (recent) bank receipt for her savings. The money *is* still there, now I'm just thinking of a way to get her to place it into my account. Also, some people were wondering *what* exactly the money is. It was a CD that's since been taken out and now is just money sitting in her savings. Grandma is still alive, lol. She lives with us. She doesn't really have a say in what my mom does with the money and likely doesn't really care or thinks I can't handle the responsibility of it. They both still treat me as if I'm not *really* an adult (and I've been told before that I'm not one so I don't get a say). And yes, it's specifically for school but at this point I don't think it really matters. \n\nAlso: I know a lot of people are suggesting alternatives to me (military, dropping out of school, etc.) and I'd like to say that I want to continue on the path I'm already on. My program is already set up for me to transfer somewhere else, and that's been the plan since before I even started college. I really just need to talk to an advisor about it when break is over so I can get to the next step of actually starting the process to transfer. The only thing about it is that I still need her tax information for FAFSA, so that's really the one part that I can't do without her. I'm sure I will get out eventually, but it's probably just going to be a little slow going. Also, I *do* get a lot of FAFSA because her income is only 20K a year. Still not sure what they'll cover out of state, but that's something I can cover with an advisor.\n\n\n", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Non-Romantic", "id": "64uqhg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 209, "report_reasons": null, "author": "savingssthrowaway", "saved": false, "mod_reports": [], "name": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": 1492035454.0, "link_flair_css_class": "m-gn misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/64uqhg/i_19_f_am_basically_trapped_at_home/", "num_reports": null, "locked": false, "stickied": false, "created": 1491984162.0, "url": "https://www.reddit.com/r/relationships/comments/64uqhg/i_19_f_am_basically_trapped_at_home/", "author_flair_text": null, "quarantine": false, "title": "I [19 F] am basically trapped at home", "created_utc": 1491955362.0, "distinguished": null, "media": null, "upvote_ratio": 0.93, "num_comments": 83, "visited": false, "subreddit_type": "public", "ups": 209}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5u569", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Pinsalinj", "parent_id": "t1_dg5deku", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, with the guilt tripping about groceries and all it kinda feel like she's paving the way to try to get away with having spent everything, blaming it all on OP...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, with the guilt tripping about groceries and all it kinda feel like she&amp;#39;s paving the way to try to get away with having spent everything, blaming it all on OP...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5u569", "score_hidden": false, "stickied": false, "created": 1492031613.0, "created_utc": 1492002813.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg6bytn", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "DirtyYogurt", "parent_id": "t1_dg5deku", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My parents did exactly this to my sister. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My parents did exactly this to my sister. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6bytn", "score_hidden": false, "stickied": false, "created": 1492051353.0, "created_utc": 1492022553.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5deku", "gilded": 0, "archived": false, "score": 346, "report_reasons": null, "author": "Stinkeye63", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You might want to have a look at the balance and see how much is there. She might be blowing you off about school because she did take the money.  Unless your grandmother specifically said that it's for school, you should be able to get a car.\nGood luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You might want to have a look at the balance and see how much is there. She might be blowing you off about school because she did take the money.  Unless your grandmother specifically said that it&amp;#39;s for school, you should be able to get a car.\nGood luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5deku", "score_hidden": false, "stickied": false, "created": 1491994614.0, "created_utc": 1491965814.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 346}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5rel8", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "hvh_19", "parent_id": "t1_dg5jfef", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Honestly, even if you had a car your set up sounds a bit miserable for young college life. I'd get an application in somewhere where you can move to, enjoy being young with your amenities and a job on your doorstep. And use the money for education as your grandmother desired!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, even if you had a car your set up sounds a bit miserable for young college life. I&amp;#39;d get an application in somewhere where you can move to, enjoy being young with your amenities and a job on your doorstep. And use the money for education as your grandmother desired!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5rel8", "score_hidden": false, "stickied": false, "created": 1492026848.0, "created_utc": 1491998048.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5s8qk", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "pstrocek", "parent_id": "t1_dg5jfef", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Do you have any friends that would let you crash at their place after an evening shift, so you won't have to bike to mom's place in the dark? Once you get enough money, you can become someone's roommate and ride your bike only around town.\n\nIt sucks roads around you aren't very safe for bikes. Do you have a good helmet? Try really hard to make yourself visible to drivers while you ride, get a lot of reflective bands, bright clothing, and stuff like that. Take care while on the road.\n\nAbsolutely continue looking for a job, what if your mom has spent the money and/or you'll have to argue with her for months and years to get it back? Then she can refuse to fund any of your plans and you'll be fucked. Check your credit to see if she didn't get a loan in your name. I know it sounds incredible, but there were a few posts in this sub with stories about shit like that. Make sure she has no access to your account.\n\nAs others have said, look into making money online if you can. Then there are \"emergency\" ways of making money, like selling some of your posessions, selling your hair if you wear it long, selling blood plasma. Look into what possibilities you have in town. Maybe you can land a gig as a tutor for a middle school or a high school kid if you have the patience for it, or as a babysitter. Your mom uses money to control you. You absolutely need an emergency fund in case she goes nuclear to \"show you.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you have any friends that would let you crash at their place after an evening shift, so you won&amp;#39;t have to bike to mom&amp;#39;s place in the dark? Once you get enough money, you can become someone&amp;#39;s roommate and ride your bike only around town.&lt;/p&gt;\n\n&lt;p&gt;It sucks roads around you aren&amp;#39;t very safe for bikes. Do you have a good helmet? Try really hard to make yourself visible to drivers while you ride, get a lot of reflective bands, bright clothing, and stuff like that. Take care while on the road.&lt;/p&gt;\n\n&lt;p&gt;Absolutely continue looking for a job, what if your mom has spent the money and/or you&amp;#39;ll have to argue with her for months and years to get it back? Then she can refuse to fund any of your plans and you&amp;#39;ll be fucked. Check your credit to see if she didn&amp;#39;t get a loan in your name. I know it sounds incredible, but there were a few posts in this sub with stories about shit like that. Make sure she has no access to your account.&lt;/p&gt;\n\n&lt;p&gt;As others have said, look into making money online if you can. Then there are &amp;quot;emergency&amp;quot; ways of making money, like selling some of your posessions, selling your hair if you wear it long, selling blood plasma. Look into what possibilities you have in town. Maybe you can land a gig as a tutor for a middle school or a high school kid if you have the patience for it, or as a babysitter. Your mom uses money to control you. You absolutely need an emergency fund in case she goes nuclear to &amp;quot;show you.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5s8qk", "score_hidden": false, "stickied": false, "created": 1492028490.0, "created_utc": 1491999690.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5y5c7", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "diphenhydrapeen", "parent_id": "t1_dg5jfef", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Can you lie about your class schedule? Find a part time job near campus and tell your mom that you're going early to study?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you lie about your class schedule? Find a part time job near campus and tell your mom that you&amp;#39;re going early to study?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5y5c7", "score_hidden": false, "stickied": false, "created": 1492036801.0, "created_utc": 1492008001.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg63j3l", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "kairisika", "parent_id": "t1_dg5mb6h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She can if she moves somewhere else for school in September.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She can if she moves somewhere else for school in September.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg63j3l", "score_hidden": false, "stickied": false, "created": 1492042736.0, "created_utc": 1492013936.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5xl0a", "gilded": 0, "archived": false, "score": -5, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg5mb6h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5xl0a", "score_hidden": false, "stickied": false, "created": 1492036136.0, "created_utc": 1492007336.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": -5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5mb6h", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "possessedrabbit", "parent_id": "t1_dg5m0xn", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP can't get a job to pay for all of this without a car. Getting a cheap car would go a long way, and the sooner she can get a job, the better. She has $10k saved if her mom hasn't spent it all. If she's willing to work some shitty jobs she won't have much issue getting one(it's keeping those that's the problem)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP can&amp;#39;t get a job to pay for all of this without a car. Getting a cheap car would go a long way, and the sooner she can get a job, the better. She has $10k saved if her mom hasn&amp;#39;t spent it all. If she&amp;#39;s willing to work some shitty jobs she won&amp;#39;t have much issue getting one(it&amp;#39;s keeping those that&amp;#39;s the problem)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5mb6h", "score_hidden": false, "stickied": false, "created": 1492012334.0, "created_utc": 1491983534.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg6pxhz", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "knightofdread", "parent_id": "t1_dg635ef", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree a small motorcycle would be great.\n\nThw problem is if she can ride and her parents letting her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree a small motorcycle would be great.&lt;/p&gt;\n\n&lt;p&gt;Thw problem is if she can ride and her parents letting her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6pxhz", "score_hidden": false, "stickied": false, "created": 1492066853.0, "created_utc": 1492038053.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg635ef", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "ktechmidas", "parent_id": "t1_dg5m0xn", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "A motorcycle sounds like a good investment here", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A motorcycle sounds like a good investment here&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg635ef", "score_hidden": false, "stickied": false, "created": 1492042332.0, "created_utc": 1492013532.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5m0xn", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "knightofdread", "parent_id": "t1_dg5jfef", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The thing is that a car you need insurance, gas, oil changes, any repairs, tires maybe parking., most of those are reoccurring costs that don't go away. Repairs aren't, but are generally more expensive then the other by themselves. So that 2000$ car quickly becomes 5000$ then 10", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is that a car you need insurance, gas, oil changes, any repairs, tires maybe parking., most of those are reoccurring costs that don&amp;#39;t go away. Repairs aren&amp;#39;t, but are generally more expensive then the other by themselves. So that 2000$ car quickly becomes 5000$ then 10&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5m0xn", "score_hidden": false, "stickied": false, "created": 1492011506.0, "created_utc": 1491982706.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg7op51", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "rhu9qg3qh589ygnae", "parent_id": "t1_dg5jfef", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'll repeat my advice from yesterday: look into scooters under 50cc. they are street legal most places, cost ~$200, goes 35 -45 mph, but because the engine is smaller than 50, you don't have to insure it AND you don't have to pay property insurance. literally just buy it and buy a helmet and pay for gas (literally pennies. mine was $4 to fill up, and it would go for ~300 miles)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll repeat my advice from yesterday: look into scooters under 50cc. they are street legal most places, cost ~$200, goes 35 -45 mph, but because the engine is smaller than 50, you don&amp;#39;t have to insure it AND you don&amp;#39;t have to pay property insurance. literally just buy it and buy a helmet and pay for gas (literally pennies. mine was $4 to fill up, and it would go for ~300 miles)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7op51", "score_hidden": false, "stickied": false, "created": 1492125337.0, "created_utc": 1492096537.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jfef", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "savingssthrowaway", "parent_id": "t1_dg5ii9d", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, that's why I was wondering if it was a good idea to throw school money towards a car while I don't really have any income. Especially if I'm aiming to get out of state *this* fall (apps open until May 1st, so running out of time but I still have some), it might be a little pointless to continue to hunt down a job? \n\nI could use my bike, but that would still be a crazy amount of time to the city and back. Especially since I'd have to work evening shifts. And people are always getting run down here because there aren't trails or sidewalks. Just highways because of the way it's set up here. I could try and bike to the city during my break as a test run, though. See how it goes. I hadn't even thought of it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, that&amp;#39;s why I was wondering if it was a good idea to throw school money towards a car while I don&amp;#39;t really have any income. Especially if I&amp;#39;m aiming to get out of state &lt;em&gt;this&lt;/em&gt; fall (apps open until May 1st, so running out of time but I still have some), it might be a little pointless to continue to hunt down a job? &lt;/p&gt;\n\n&lt;p&gt;I could use my bike, but that would still be a crazy amount of time to the city and back. Especially since I&amp;#39;d have to work evening shifts. And people are always getting run down here because there aren&amp;#39;t trails or sidewalks. Just highways because of the way it&amp;#39;s set up here. I could try and bike to the city during my break as a test run, though. See how it goes. I hadn&amp;#39;t even thought of it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jfef", "score_hidden": false, "stickied": false, "created": 1492004941.0, "created_utc": 1491976141.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg6297f", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "reapy54", "parent_id": "t1_dg5ii9d", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Motorcycle might also be an option. Some nice comfortable ones can be had for a lot less than a car, they get excellent gas mileage, and a lot can be worked on at home much easier than a car. \n\nObviously an issue in rough weather, and there is some up front investment in a good helmet and leathers to protect yourself, but a motorcycle will give you a less expensive range/freedom to get around sometimes. \n\nYour parents seem to have an odd sense of control / non control over you. Like your mom wants to look over your stuff to make sure you make a good choice, but doesn't have the energy to sit down and actually do it. \n\nYou are old enough to slowly start taking control of your life, brining in money, applying and achieving things on your own. A lot of us will have to figure out how to do things on our own, not being taught by our parents, lucky for you, you live in the age of information where every question you could have about everything is at your fingertips. \n\nEven at 37 I'm asked to do things I don't know how to do quite often, and I just google it and start reading, watch videos, read more, post on reddit with a question, whatever. The answers are there, you just need the courage and will to take your first steps at being an adult and controlling your own life. \n\nAnd the one parental jab at the end is here that as you do that, you will probably start to understand why your mom has little energy and frets about money. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Motorcycle might also be an option. Some nice comfortable ones can be had for a lot less than a car, they get excellent gas mileage, and a lot can be worked on at home much easier than a car. &lt;/p&gt;\n\n&lt;p&gt;Obviously an issue in rough weather, and there is some up front investment in a good helmet and leathers to protect yourself, but a motorcycle will give you a less expensive range/freedom to get around sometimes. &lt;/p&gt;\n\n&lt;p&gt;Your parents seem to have an odd sense of control / non control over you. Like your mom wants to look over your stuff to make sure you make a good choice, but doesn&amp;#39;t have the energy to sit down and actually do it. &lt;/p&gt;\n\n&lt;p&gt;You are old enough to slowly start taking control of your life, brining in money, applying and achieving things on your own. A lot of us will have to figure out how to do things on our own, not being taught by our parents, lucky for you, you live in the age of information where every question you could have about everything is at your fingertips. &lt;/p&gt;\n\n&lt;p&gt;Even at 37 I&amp;#39;m asked to do things I don&amp;#39;t know how to do quite often, and I just google it and start reading, watch videos, read more, post on reddit with a question, whatever. The answers are there, you just need the courage and will to take your first steps at being an adult and controlling your own life. &lt;/p&gt;\n\n&lt;p&gt;And the one parental jab at the end is here that as you do that, you will probably start to understand why your mom has little energy and frets about money. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6297f", "score_hidden": false, "stickied": false, "created": 1492041366.0, "created_utc": 1492012566.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5ii9d", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "hvh_19", "parent_id": "t1_dg57b6c", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Does it make sense to spend some of that money on the car? \n\nCars are expensive to maintain and run, OP needs to get a job first before getting the car with that money to help cover costs. And even then should only get a car with that money if she still has enough to cover school.\n\nIt sucks OP, but at the moment you're not earning and therefore it is bad financial decision to buy a car. Especially with your education fund.\n\nCan you get around on a bike?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Does it make sense to spend some of that money on the car? &lt;/p&gt;\n\n&lt;p&gt;Cars are expensive to maintain and run, OP needs to get a job first before getting the car with that money to help cover costs. And even then should only get a car with that money if she still has enough to cover school.&lt;/p&gt;\n\n&lt;p&gt;It sucks OP, but at the moment you&amp;#39;re not earning and therefore it is bad financial decision to buy a car. Especially with your education fund.&lt;/p&gt;\n\n&lt;p&gt;Can you get around on a bike?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5ii9d", "score_hidden": false, "stickied": false, "created": 1492003073.0, "created_utc": 1491974273.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 43}}], "after": null, "before": null}}, "user_reports": [], "id": "dg57b6c", "gilded": 0, "archived": false, "score": 96, "report_reasons": null, "author": "rejesterd", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think your mom is being controlling and impractical.  It certainly makes sense to use some of that $10k for a car, but I doubt you'll convince her to do it.  I would lean more on the side of being patient rather than being argumentative with her.  I know it feels like you'll be stuck forever, but you won't be.  You'll find a not-so-shitty job, you'll figure out transportation for it (maybe through a friend), and you'll get out eventually.  Just work on one thing at a time, and only work on things that you have control over.  That means, how often you're applying for jobs, how much you learn about finance, etc.  Things like that.  Things like your mom, you can't really influence.  Good luck.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think your mom is being controlling and impractical.  It certainly makes sense to use some of that $10k for a car, but I doubt you&amp;#39;ll convince her to do it.  I would lean more on the side of being patient rather than being argumentative with her.  I know it feels like you&amp;#39;ll be stuck forever, but you won&amp;#39;t be.  You&amp;#39;ll find a not-so-shitty job, you&amp;#39;ll figure out transportation for it (maybe through a friend), and you&amp;#39;ll get out eventually.  Just work on one thing at a time, and only work on things that you have control over.  That means, how often you&amp;#39;re applying for jobs, how much you learn about finance, etc.  Things like that.  Things like your mom, you can&amp;#39;t really influence.  Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg57b6c", "score_hidden": false, "stickied": false, "created": 1491986496.0, "created_utc": 1491957696.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 96}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5x75c", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "elfgirl1317", "parent_id": "t1_dg5jrg5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;an authorized user on a card so that my credit could build up\n\nFor the record - this means that your mom's usage of that card will also impact your credit. Companies generally don't track who's using the card, just that the card was used and you and your mom's names are on the card. This could be good or bad - if your mom has good credit via that card, you will too. If your mom is not paying off the card, it can give you bad credit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;an authorized user on a card so that my credit could build up&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For the record - this means that your mom&amp;#39;s usage of that card will also impact your credit. Companies generally don&amp;#39;t track who&amp;#39;s using the card, just that the card was used and you and your mom&amp;#39;s names are on the card. This could be good or bad - if your mom has good credit via that card, you will too. If your mom is not paying off the card, it can give you bad credit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5x75c", "score_hidden": false, "stickied": false, "created": 1492035679.0, "created_utc": 1492006879.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5u7cw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Pinsalinj", "parent_id": "t1_dg5jrg5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There are a lot of online jobs nowadays :) There are reddit subs for it, even! Can't remember the names but maybe someone here will.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a lot of online jobs nowadays :) There are reddit subs for it, even! Can&amp;#39;t remember the names but maybe someone here will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5u7cw", "score_hidden": false, "stickied": false, "created": 1492031702.0, "created_utc": 1492002902.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg63dmt", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "dcbrierton", "parent_id": "t1_dg5jrg5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Can you bike to the edge of the college city transit network and then use the bus/train the rest of the way in? Depending on the city, there may be commuter hubs (e.g. commuter train stations, park and rides) from which there is relatively fast transit farther into the city. Usually people are expected to drive there, but there might be bike parking as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you bike to the edge of the college city transit network and then use the bus/train the rest of the way in? Depending on the city, there may be commuter hubs (e.g. commuter train stations, park and rides) from which there is relatively fast transit farther into the city. Usually people are expected to drive there, but there might be bike parking as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg63dmt", "score_hidden": false, "stickied": false, "created": 1492042576.0, "created_utc": 1492013776.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5sr5c", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "tiffanydisasterxoxo", "parent_id": "t1_dg5jrg5", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Can you move into the campus dorms?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you move into the campus dorms?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5sr5c", "score_hidden": false, "stickied": false, "created": 1492029394.0, "created_utc": 1492000594.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jrg5", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "savingssthrowaway", "parent_id": "t1_dg58kab", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;However, OP, if you qualify for better financial aid, use that to your advantage. Transferring isn't a bad idea if you can afford it.\n\nMy plan from the beginning, even before things started getting out of control, was transferring either way. The program plan I'm in for my community college is the one that people take when they intend to transfer, so I know at least my credits transfer over. As far as loans go, I don't know a lot about it because I wasn't that involved while filling out FAFSA. I know my mom has really good credit, so she probably intends/ed to co-sign them when I applied to transfer? I also know she added me as an authorized user on a card so that my credit could build up, but I know that takes a while so I probably don't have anything established yet. \n\nAlso, our yearly income is only/below 20k so I know I get a lot out of grants alone. But, again, not sure if that applies to transferring? I know we have Financial Aid advisors at my college, so I think I'm going to talk to one of them about it. \n\n&gt;Look into your local transportation. \n\nI did. ): My village is in a different city to the one I go to school in, and there's nothing that runs between both cities except Uber or Lyft which, obviously, I can't afford. \n\n&gt;Look into online transcriptioning jobs to make money \n\nHoly shit, didn't know that was a thing. Definitely going to try it. Thanks for that! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;However, OP, if you qualify for better financial aid, use that to your advantage. Transferring isn&amp;#39;t a bad idea if you can afford it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;My plan from the beginning, even before things started getting out of control, was transferring either way. The program plan I&amp;#39;m in for my community college is the one that people take when they intend to transfer, so I know at least my credits transfer over. As far as loans go, I don&amp;#39;t know a lot about it because I wasn&amp;#39;t that involved while filling out FAFSA. I know my mom has really good credit, so she probably intends/ed to co-sign them when I applied to transfer? I also know she added me as an authorized user on a card so that my credit could build up, but I know that takes a while so I probably don&amp;#39;t have anything established yet. &lt;/p&gt;\n\n&lt;p&gt;Also, our yearly income is only/below 20k so I know I get a lot out of grants alone. But, again, not sure if that applies to transferring? I know we have Financial Aid advisors at my college, so I think I&amp;#39;m going to talk to one of them about it. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Look into your local transportation. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I did. ): My village is in a different city to the one I go to school in, and there&amp;#39;s nothing that runs between both cities except Uber or Lyft which, obviously, I can&amp;#39;t afford. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Look into online transcriptioning jobs to make money &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Holy shit, didn&amp;#39;t know that was a thing. Definitely going to try it. Thanks for that! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jrg5", "score_hidden": false, "stickied": false, "created": 1492005681.0, "created_utc": 1491976881.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg58kab", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "throwaway5868984930", "parent_id": "t1_dg56mco", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's not that easy to get loans that will cover an out of state school - especially for a 19 year old with what I can assume is non existent credit (assuming there is no consigner). Middle class kids usually max out at 5k on federal loans for the whole year. However, OP, if you qualify for better financial aid, use that to your advantage. Transferring isn't a bad idea if you can afford it. Look into your local transportation. My brothers lives decently far from the suburbs of the city he goes to community college in and there's really great public transit, considering how shjtty of a city it is. It's only $3.00 flat rate for a ride - even to other counties. \n\nLook into Amtrak. Look into online transcriptioning jobs to make money (Rev is popular). Once you have enough money, get the fuck out via Amtrak, Uber, or Lyft. Seriously research options for making money and transportation with the means available to you, because that's all you have at this point. You'll have to hustle, but it's clear you're willing to. Good on you for going to school and everything too. My community college has so many more opportunities than I knew, and it took me a couple years to take advantage of them. Look up your school's website and research these opportunities. ", "edited": 1491959545.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s not that easy to get loans that will cover an out of state school - especially for a 19 year old with what I can assume is non existent credit (assuming there is no consigner). Middle class kids usually max out at 5k on federal loans for the whole year. However, OP, if you qualify for better financial aid, use that to your advantage. Transferring isn&amp;#39;t a bad idea if you can afford it. Look into your local transportation. My brothers lives decently far from the suburbs of the city he goes to community college in and there&amp;#39;s really great public transit, considering how shjtty of a city it is. It&amp;#39;s only $3.00 flat rate for a ride - even to other counties. &lt;/p&gt;\n\n&lt;p&gt;Look into Amtrak. Look into online transcriptioning jobs to make money (Rev is popular). Once you have enough money, get the fuck out via Amtrak, Uber, or Lyft. Seriously research options for making money and transportation with the means available to you, because that&amp;#39;s all you have at this point. You&amp;#39;ll have to hustle, but it&amp;#39;s clear you&amp;#39;re willing to. Good on you for going to school and everything too. My community college has so many more opportunities than I knew, and it took me a couple years to take advantage of them. Look up your school&amp;#39;s website and research these opportunities. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg58kab", "score_hidden": false, "stickied": false, "created": 1491988137.0, "created_utc": 1491959337.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg56mco", "gilded": 0, "archived": false, "score": 93, "report_reasons": null, "author": "adhdcombinationokay", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Talk to an academic advisor at school. They can help you transfer. Transfer out of state to a school where you won't need a car. Take out loans to get there and when you do do work study or get a job. Just get out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Talk to an academic advisor at school. They can help you transfer. Transfer out of state to a school where you won&amp;#39;t need a car. Take out loans to get there and when you do do work study or get a job. Just get out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg56mco", "score_hidden": false, "stickied": false, "created": 1491985576.0, "created_utc": 1491956776.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 93}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5dwup", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "EverleighWay", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes. Post in personal finance or legal advice. You need a car, because with a car you can get a job and put more money away for school. You should also know more about this money, how it's set up and if she has unfettered access to it. Because if she does, she's probably spent it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes. Post in personal finance or legal advice. You need a car, because with a car you can get a job and put more money away for school. You should also know more about this money, how it&amp;#39;s set up and if she has unfettered access to it. Because if she does, she&amp;#39;s probably spent it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5dwup", "score_hidden": false, "stickied": false, "created": 1491995345.0, "created_utc": 1491966545.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg604ta", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "House_of_hornets", "parent_id": "t1_dg5jf3j", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah this bicycle solution is kind of ridiculous. Using a bike to get around is hilariously impractical in most places. I only live a 15 minutes car ride from school and i could never bike that distance where i live. The terrain is extremely mountainous, its freezing cold, theres no street lights, a lot of narrow roads, and manaic drivers. And this is coming from someone who walked everywhere when i lived in a more pedestrian friendly area. OP should just use that 10k to get a shitty car. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah this bicycle solution is kind of ridiculous. Using a bike to get around is hilariously impractical in most places. I only live a 15 minutes car ride from school and i could never bike that distance where i live. The terrain is extremely mountainous, its freezing cold, theres no street lights, a lot of narrow roads, and manaic drivers. And this is coming from someone who walked everywhere when i lived in a more pedestrian friendly area. OP should just use that 10k to get a shitty car. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg604ta", "score_hidden": false, "stickied": false, "created": 1492039039.0, "created_utc": 1492010239.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg62wat", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Altorrin", "parent_id": "t1_dg5s98o", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "A car which she would need to pay thousands more dollars to buy and then continually pay insurance for. Where do you think she is going to get this money? A bike is better than nothing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A car which she would need to pay thousands more dollars to buy and then continually pay insurance for. Where do you think she is going to get this money? A bike is better than nothing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg62wat", "score_hidden": false, "stickied": false, "created": 1492042058.0, "created_utc": 1492013258.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg802jo", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "the-mortyest-morty", "parent_id": "t1_dg5tvbw", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "True, true. I don't know what the answer is, I just was in OP's situation for a while and it's really easy to say \"just walk!\" but doing it is a whole 'nother story sometimes. He needs a bike for sure, and a good waterproof jacket. Getting stuck walking home in the rain/snow really sucks.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;True, true. I don&amp;#39;t know what the answer is, I just was in OP&amp;#39;s situation for a while and it&amp;#39;s really easy to say &amp;quot;just walk!&amp;quot; but doing it is a whole &amp;#39;nother story sometimes. He needs a bike for sure, and a good waterproof jacket. Getting stuck walking home in the rain/snow really sucks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg802jo", "score_hidden": false, "stickied": false, "created": 1492137444.0, "created_utc": 1492108644.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5tvbw", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "HamsterWheelz", "parent_id": "t1_dg5s98o", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "At a cost that is exponentially higher. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At a cost that is exponentially higher. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5tvbw", "score_hidden": false, "stickied": false, "created": 1492031193.0, "created_utc": 1492002393.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5s98o", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "the-mortyest-morty", "parent_id": "t1_dg5kn71", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "And a fraction of that with a car...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And a fraction of that with a car...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5s98o", "score_hidden": false, "stickied": false, "created": 1492028516.0, "created_utc": 1491999716.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5kn71", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "pm_me_ur_favposition", "parent_id": "t1_dg5jf3j", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes, a 4hr walk would become &lt;1hr on bike.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes, a 4hr walk would become &amp;lt;1hr on bike.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5kn71", "score_hidden": false, "stickied": false, "created": 1492007807.0, "created_utc": 1491979007.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jf3j", "gilded": 0, "archived": false, "score": 60, "report_reasons": null, "author": "tiny-nugget", "parent_id": "t1_dg5b81b", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Would an eight hour walking distance really be manageable on a bike? I'm not convinced this solves OP's problems.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would an eight hour walking distance really be manageable on a bike? I&amp;#39;m not convinced this solves OP&amp;#39;s problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jf3j", "score_hidden": false, "stickied": false, "created": 1492004924.0, "created_utc": 1491976124.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 60}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5kezx", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "binarygamer", "parent_id": "t1_dg5b81b", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's tough but doable. Hopefully the route is mostly flattish roads in good condition.\n\nTaking the average walking pace of 3mph and cycling at 15mph, 8hrs of walking becomes 1hr 40min of cycling per day.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s tough but doable. Hopefully the route is mostly flattish roads in good condition.&lt;/p&gt;\n\n&lt;p&gt;Taking the average walking pace of 3mph and cycling at 15mph, 8hrs of walking becomes 1hr 40min of cycling per day.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5kezx", "score_hidden": false, "stickied": false, "created": 1492007241.0, "created_utc": 1491978441.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5jkq8", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "JustARedditBrowser", "parent_id": "t1_dg5b81b", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I would second using your money for this if your school and potential workplace aren't super, super far away (probably less than 15 miles is reasonable. Might still take you over an hour to get there, though). Maybe your mom would be more open to this option because you can get a decent bike for a very small portion of the 10k. Then she doesn't have to complain about you requesting the car.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would second using your money for this if your school and potential workplace aren&amp;#39;t super, super far away (probably less than 15 miles is reasonable. Might still take you over an hour to get there, though). Maybe your mom would be more open to this option because you can get a decent bike for a very small portion of the 10k. Then she doesn&amp;#39;t have to complain about you requesting the car.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jkq8", "score_hidden": false, "stickied": false, "created": 1492005260.0, "created_utc": 1491976460.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5rjsr", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Iamwomper", "parent_id": "t1_dg5b81b", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Alternatively, look into getting a cheap 80cc scooter", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Alternatively, look into getting a cheap 80cc scooter&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5rjsr", "score_hidden": false, "stickied": false, "created": 1492027142.0, "created_utc": 1491998342.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5b81b", "gilded": 0, "archived": false, "score": 106, "report_reasons": null, "author": "Lanna29", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Get a bicycle, helmet, and bike lock.  You can get the first and last second hand for pretty good prices - don't skimp on the helmet.  You have your own transportation and the independence that comes with transportation and won't dip into your school money.  Bonus - you get your workout in commuting to school/events.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get a bicycle, helmet, and bike lock.  You can get the first and last second hand for pretty good prices - don&amp;#39;t skimp on the helmet.  You have your own transportation and the independence that comes with transportation and won&amp;#39;t dip into your school money.  Bonus - you get your workout in commuting to school/events.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5b81b", "score_hidden": false, "stickied": false, "created": 1491991596.0, "created_utc": 1491962796.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 106}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5lhx3", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "kelsygram", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "/r/beermoney has a lot of websites to make money online. Worth a peak. Not enough to make a sustainable income but enough to make a little here and there in the mean time until you find a better solution. Good luck! :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/r/beermoney\"&gt;/r/beermoney&lt;/a&gt; has a lot of websites to make money online. Worth a peak. Not enough to make a sustainable income but enough to make a little here and there in the mean time until you find a better solution. Good luck! :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5lhx3", "score_hidden": false, "stickied": false, "created": 1492010033.0, "created_utc": 1491981233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5mpmv", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You really need to get your hands on that money, assuming she hasn't pissed it away already. Sit her down and DEMAND access. \n\nIs Grandma still alive?\n\nBUT: Realistically, (a) she's never going to hand it over, or (b) she's spent it. I think you need to start living your life as if that money does not exist. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You really need to get your hands on that money, assuming she hasn&amp;#39;t pissed it away already. Sit her down and DEMAND access. &lt;/p&gt;\n\n&lt;p&gt;Is Grandma still alive?&lt;/p&gt;\n\n&lt;p&gt;BUT: Realistically, (a) she&amp;#39;s never going to hand it over, or (b) she&amp;#39;s spent it. I think you need to start living your life as if that money does not exist. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5mpmv", "score_hidden": false, "stickied": false, "created": 1492013526.0, "created_utc": 1491984726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5phws", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "mirrordonut", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you should get your money BUT I also have a horrible feeling your mother has either started spending it and/or will find some excuse not to give it to you. So talk to r/finance and r/legaladvice to see what they can tell you before you ask your mother about it. \n\nIt's possible you could find some online work, but it does sound like you really just need a car. Yes, cars are a total money suck, but I think it's worth it to have some independence, plus the cost will even out if you're working. And once you transfer you could maybe sell it again.\n\nAlso, be sure to delete this post from your internet history. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should get your money BUT I also have a horrible feeling your mother has either started spending it and/or will find some excuse not to give it to you. So talk to &lt;a href=\"/r/finance\"&gt;r/finance&lt;/a&gt; and &lt;a href=\"/r/legaladvice\"&gt;r/legaladvice&lt;/a&gt; to see what they can tell you before you ask your mother about it. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s possible you could find some online work, but it does sound like you really just need a car. Yes, cars are a total money suck, but I think it&amp;#39;s worth it to have some independence, plus the cost will even out if you&amp;#39;re working. And once you transfer you could maybe sell it again.&lt;/p&gt;\n\n&lt;p&gt;Also, be sure to delete this post from your internet history. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5phws", "score_hidden": false, "stickied": false, "created": 1492022197.0, "created_utc": 1491993397.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5zxva", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "houinator", "parent_id": "t1_dg5la3x", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "On the same note, don't assume that just because your job is intelligence/IT/admin whatever that you won't end up deployed to a combat zone kicking in doors.  If you can't mentally handle that possibility, then the military is probably not for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;On the same note, don&amp;#39;t assume that just because your job is intelligence/IT/admin whatever that you won&amp;#39;t end up deployed to a combat zone kicking in doors.  If you can&amp;#39;t mentally handle that possibility, then the military is probably not for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5zxva", "score_hidden": false, "stickied": false, "created": 1492038825.0, "created_utc": 1492010025.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5la3x", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Sapphire_Knuckle", "parent_id": "t1_dg5juqs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "EDIT: What I mean is, there a ton of different jobs in the Army, only a few are infantry related or \"scary\" like that and women don't usually make it to do that anyways. The Army needs a ton of administration, transportation, intelligence, IT, busy body work. Yeah the discipline is rough on some people but for a lot of people structure is good for them. If you do look into it though, don't trust anything a recruiter says, do a lot of independent research.", "edited": 1491989120.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;EDIT: What I mean is, there a ton of different jobs in the Army, only a few are infantry related or &amp;quot;scary&amp;quot; like that and women don&amp;#39;t usually make it to do that anyways. The Army needs a ton of administration, transportation, intelligence, IT, busy body work. Yeah the discipline is rough on some people but for a lot of people structure is good for them. If you do look into it though, don&amp;#39;t trust anything a recruiter says, do a lot of independent research.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5la3x", "score_hidden": false, "stickied": false, "created": 1492009449.0, "created_utc": 1491980649.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5juqs", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "savingssthrowaway", "parent_id": "t1_dg5h313", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;You should have your own bank account (or credit union preferably) and bank card/credit card.\n\nI do have an account and a card, but I don't know what exactly that 10k was or why it's still in her name. It might be a CD maybe? I'll definitely crosspost to /personalfinance once/if I find out what exactly the money is. \n\n&gt;If you really have no options then enlist in the military. \n\nThis has always been terrifying to me but if worst comes to worst, I might have to. \n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You should have your own bank account (or credit union preferably) and bank card/credit card.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I do have an account and a card, but I don&amp;#39;t know what exactly that 10k was or why it&amp;#39;s still in her name. It might be a CD maybe? I&amp;#39;ll definitely crosspost to /personalfinance once/if I find out what exactly the money is. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you really have no options then enlist in the military. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This has always been terrifying to me but if worst comes to worst, I might have to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5juqs", "score_hidden": false, "stickied": false, "created": 1492005897.0, "created_utc": 1491977097.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5h313", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "Sapphire_Knuckle", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You really need to figure out what's the deal with the 10k from your grandma. You may want to crosspost to /r/personalfinance subreddit. You're 18+ so you should legally be in control of that money. You should have your own bank account (or credit union preferably) and bank card/credit card. Look into a Discover student credit card.  \n  \nIf you really have no options then enlist in the military. Instant financial independence, plus GI bill when you get out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You really need to figure out what&amp;#39;s the deal with the 10k from your grandma. You may want to crosspost to &lt;a href=\"/r/personalfinance\"&gt;/r/personalfinance&lt;/a&gt; subreddit. You&amp;#39;re 18+ so you should legally be in control of that money. You should have your own bank account (or credit union preferably) and bank card/credit card. Look into a Discover student credit card.  &lt;/p&gt;\n\n&lt;p&gt;If you really have no options then enlist in the military. Instant financial independence, plus GI bill when you get out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5h313", "score_hidden": false, "stickied": false, "created": 1492000422.0, "created_utc": 1491971622.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5lybi", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "wannaseemytriforce", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP Im worried about you.   This is very very bad for your mental health.    Get a bike and ride it everywhere.   I dont give a damn about the cars on the road,  this is your freedom were talking about.   Put in your job applications and when you get the job and your mom wont give you the car to go to work,  threaten to cam or be a stripper.   If she doesnt give you options,  take them.    You are the only person making yourself prisoner.      Take your power back.   You cannot live like this.     Your freedom is worth it.    Bike it.   Get a job,  she does not get a say in what you do or where you go.   Contact your school for emergency options even though this isnt an emergency yet.     ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP Im worried about you.   This is very very bad for your mental health.    Get a bike and ride it everywhere.   I dont give a damn about the cars on the road,  this is your freedom were talking about.   Put in your job applications and when you get the job and your mom wont give you the car to go to work,  threaten to cam or be a stripper.   If she doesnt give you options,  take them.    You are the only person making yourself prisoner.      Take your power back.   You cannot live like this.     Your freedom is worth it.    Bike it.   Get a job,  she does not get a say in what you do or where you go.   Contact your school for emergency options even though this isnt an emergency yet.     &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5lybi", "score_hidden": false, "stickied": false, "created": 1492011304.0, "created_utc": 1491982504.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5rqmh", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "bnenene", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The heart of your problem isn't car or transport or job, it's your mother. Your mother sounds controlling and unreasonable. Most mothers support their kids to at least attend class and get a job. From what you've said, even if your mother still has the money from your grandmother, I'd expect she won't give it up because that would be giving up leverage over you. \n\nIf you can't break out of the current problem, you might need to prioritise solutions that get you out from your mother's roof and control first so you can sort out the other aspects. You might need to take a break from college for a bit while you sort out the rest. I hope it won't be that bad. Good luck to you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The heart of your problem isn&amp;#39;t car or transport or job, it&amp;#39;s your mother. Your mother sounds controlling and unreasonable. Most mothers support their kids to at least attend class and get a job. From what you&amp;#39;ve said, even if your mother still has the money from your grandmother, I&amp;#39;d expect she won&amp;#39;t give it up because that would be giving up leverage over you. &lt;/p&gt;\n\n&lt;p&gt;If you can&amp;#39;t break out of the current problem, you might need to prioritise solutions that get you out from your mother&amp;#39;s roof and control first so you can sort out the other aspects. You might need to take a break from college for a bit while you sort out the rest. I hope it won&amp;#39;t be that bad. Good luck to you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5rqmh", "score_hidden": false, "stickied": false, "created": 1492027530.0, "created_utc": 1491998730.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5rrsg", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "pro_newb", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You should look into going into an apartment with roommates that is walking distance to school. If you can't find a job, get student loans to pay for housing and groceries. You can probably find a job on campus, or use campus resources to find a job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should look into going into an apartment with roommates that is walking distance to school. If you can&amp;#39;t find a job, get student loans to pay for housing and groceries. You can probably find a job on campus, or use campus resources to find a job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5rrsg", "score_hidden": false, "stickied": false, "created": 1492027593.0, "created_utc": 1491998793.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5ey08", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "sowellfan", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you should consider backing away from school temporarily, until you can set yourself up with an independent life, closer to where school and jobs are.\n\nThe way I figure, where you're at now, jobs are really tough to get because of transport problems - plus your mom is trying to control you horribly. Who knows if the $10k is still there, or if she's spent some portion of it, or all of it - or if she'll even let you use some to get a car. Sounds to me that she really likes the leverage that it gives her, so I wouldn't count on being able to use it.\n\nSo, do whatever you have to do to get closer to the area where you could actually get to jobs - even if that means renting a room with someone for $300/month. Just get the hell out of there and try financially independent. Get a car, get your shit together - and then go back to school.\n\nOut of state school is pretty problematic because it's usually expensive as shit (so what might have been reasonable student loans for 'in-state' schooling would become crazy student loans for out of state). And your mom probably won't help with FAFSA either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you should consider backing away from school temporarily, until you can set yourself up with an independent life, closer to where school and jobs are.&lt;/p&gt;\n\n&lt;p&gt;The way I figure, where you&amp;#39;re at now, jobs are really tough to get because of transport problems - plus your mom is trying to control you horribly. Who knows if the $10k is still there, or if she&amp;#39;s spent some portion of it, or all of it - or if she&amp;#39;ll even let you use some to get a car. Sounds to me that she really likes the leverage that it gives her, so I wouldn&amp;#39;t count on being able to use it.&lt;/p&gt;\n\n&lt;p&gt;So, do whatever you have to do to get closer to the area where you could actually get to jobs - even if that means renting a room with someone for $300/month. Just get the hell out of there and try financially independent. Get a car, get your shit together - and then go back to school.&lt;/p&gt;\n\n&lt;p&gt;Out of state school is pretty problematic because it&amp;#39;s usually expensive as shit (so what might have been reasonable student loans for &amp;#39;in-state&amp;#39; schooling would become crazy student loans for out of state). And your mom probably won&amp;#39;t help with FAFSA either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5ey08", "score_hidden": false, "stickied": false, "created": 1491996885.0, "created_utc": 1491968085.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5kdjp", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "al_claire", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Girl. We have so much in common. After high school, my family moved to a bigger city nearby. I did community college to save money, but lived 45 min away from any friends that still lived in my old city. I had an unreliable vehicle that ended up being relatively unusable. Money was held over my head constantly. I was stuck at home, except for school, and most of my classes were online because I didn't have reliable transportation anyway. Super depressing. I eventually car searched for a few months and used college savings to purchase a reliable vehicle (but first calculated the cost of the rest of my degree and then some so I knew how much I could spend on a car, also factoring in that it would undoubtedly need some maintenance, too.) Then, I enrolled in more in-person courses and applied to a state college (enrolled in the transfer program at community college, just like you.) I job searched for awhile. Found a job in retail and I hate it. However, it gets me some cash to save and use for my car, occasional outings with friends, etc. \n\n I like the bike idea. Find something, anything, part-time nearby. Even offer tutoring, petsitting, housesitting, etc. around town. Make connections. Save up for awhile. Do a lot of research before purchasing a car. If you have family or friends who are good at this sort of thing, ask for their help. Make sure you'll be able to cover insurance, registration, etc. Do your absolute best in school. Most of all, figure out those finances. Try to get that money in your name, kiss ass, use good timing, but if you do get it then don't be stupid with it. One step at a time. Not gonna lie, I hate my job, dealing with school administration is frustrating, I have the itch to move out so badly, but I know that these things are adding up. I'm getting there. You will, too. Feel free to message me if you want to vent or want any more advice from someone who's dealing with the same things!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Girl. We have so much in common. After high school, my family moved to a bigger city nearby. I did community college to save money, but lived 45 min away from any friends that still lived in my old city. I had an unreliable vehicle that ended up being relatively unusable. Money was held over my head constantly. I was stuck at home, except for school, and most of my classes were online because I didn&amp;#39;t have reliable transportation anyway. Super depressing. I eventually car searched for a few months and used college savings to purchase a reliable vehicle (but first calculated the cost of the rest of my degree and then some so I knew how much I could spend on a car, also factoring in that it would undoubtedly need some maintenance, too.) Then, I enrolled in more in-person courses and applied to a state college (enrolled in the transfer program at community college, just like you.) I job searched for awhile. Found a job in retail and I hate it. However, it gets me some cash to save and use for my car, occasional outings with friends, etc. &lt;/p&gt;\n\n&lt;p&gt;I like the bike idea. Find something, anything, part-time nearby. Even offer tutoring, petsitting, housesitting, etc. around town. Make connections. Save up for awhile. Do a lot of research before purchasing a car. If you have family or friends who are good at this sort of thing, ask for their help. Make sure you&amp;#39;ll be able to cover insurance, registration, etc. Do your absolute best in school. Most of all, figure out those finances. Try to get that money in your name, kiss ass, use good timing, but if you do get it then don&amp;#39;t be stupid with it. One step at a time. Not gonna lie, I hate my job, dealing with school administration is frustrating, I have the itch to move out so badly, but I know that these things are adding up. I&amp;#39;m getting there. You will, too. Feel free to message me if you want to vent or want any more advice from someone who&amp;#39;s dealing with the same things!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5kdjp", "score_hidden": false, "stickied": false, "created": 1492007140.0, "created_utc": 1491978340.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg74v6h", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "JustARedditBrowser", "parent_id": "t1_dg5x4x6", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "The scooter suggestion is probably the best one ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The scooter suggestion is probably the best one &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg74v6h", "score_hidden": false, "stickied": false, "created": 1492086052.0, "created_utc": 1492057252.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5x4x6", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "rhu9qg3qh589ygnae", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There are a couple transportation options.\n  \n1. you live in a town with at least a community college? Is there no public transportation? \n  \n2. bicycle. I used to ride like ~15 miles a day on my bike to and from school. I don't how far you are though.\n  \n3. scooters are street legal in most states, ~$200, go around 35-45 miles an hour and don't require insurance if the engine is under 50cc. Since it's so tiny, you can literally pay for the gas in quarters and all you need is a helmet (a real one, none of those halvsies. A full on motorcycle helmet.)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There are a couple transportation options.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;you live in a town with at least a community college? Is there no public transportation? &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;bicycle. I used to ride like ~15 miles a day on my bike to and from school. I don&amp;#39;t how far you are though.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;scooters are street legal in most states, ~$200, go around 35-45 miles an hour and don&amp;#39;t require insurance if the engine is under 50cc. Since it&amp;#39;s so tiny, you can literally pay for the gas in quarters and all you need is a helmet (a real one, none of those halvsies. A full on motorcycle helmet.)&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5x4x6", "score_hidden": false, "stickied": false, "created": 1492035605.0, "created_utc": 1492006805.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg60ber", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "my2catsaregreat", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're 19, so although your mom has trained you to not do anything until she \"looks at it\", you don't have to obey this. You can do research into transferring all on your own. \n\nYour mom seems really invested in keeping you at home and under her thumb where she can control you. If you're going to get out, you need to keep things on the down low. Controlling people often escalate their control if they suspect their victims are working to break free.\n\nThere's a site called CoolWorks that is a job site for summer camp, resort, and national park jobs. A lot of these jobs are for the summer only, and also provide housing to their employees, in addition to paying them. You might want to check out something like that. Also, Hostelling International hostels will often have live-in jobs for people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re 19, so although your mom has trained you to not do anything until she &amp;quot;looks at it&amp;quot;, you don&amp;#39;t have to obey this. You can do research into transferring all on your own. &lt;/p&gt;\n\n&lt;p&gt;Your mom seems really invested in keeping you at home and under her thumb where she can control you. If you&amp;#39;re going to get out, you need to keep things on the down low. Controlling people often escalate their control if they suspect their victims are working to break free.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a site called CoolWorks that is a job site for summer camp, resort, and national park jobs. A lot of these jobs are for the summer only, and also provide housing to their employees, in addition to paying them. You might want to check out something like that. Also, Hostelling International hostels will often have live-in jobs for people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg60ber", "score_hidden": false, "stickied": false, "created": 1492039242.0, "created_utc": 1492010442.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5nh27", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "godrestsinreason", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She is definitely abusive, and she almost certainly blew your money. If that money was willed to you, instead of just given, you should take her to court for that money. You should also take out student loans, and transfer to a uni program with student housing. I know that really sucks to put yourself in a bunch of debt, but at least you can do something about it, rather than your nutty mother dangling the rest of your life in front of you like a carrot on a stick. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She is definitely abusive, and she almost certainly blew your money. If that money was willed to you, instead of just given, you should take her to court for that money. You should also take out student loans, and transfer to a uni program with student housing. I know that really sucks to put yourself in a bunch of debt, but at least you can do something about it, rather than your nutty mother dangling the rest of your life in front of you like a carrot on a stick. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5nh27", "score_hidden": false, "stickied": false, "created": 1492015895.0, "created_utc": 1491987095.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5zvnt", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "warpus", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I'm not allowed to do anything until she \"looks at it\"\n\nYou're an adult and can do whatever you want, assuming your finances don't get in the way.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m not allowed to do anything until she &amp;quot;looks at it&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re an adult and can do whatever you want, assuming your finances don&amp;#39;t get in the way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5zvnt", "score_hidden": false, "stickied": false, "created": 1492038758.0, "created_utc": 1492009958.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg640lm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "YouCantSaveEveryone", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Are you sure the money still exists ? Sounds like it's gone. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you sure the money still exists ? Sounds like it&amp;#39;s gone. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg640lm", "score_hidden": false, "stickied": false, "created": 1492043246.0, "created_utc": 1492014446.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5hfit", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DarthGregor", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Get that money in your name girl, then get a car", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get that money in your name girl, then get a car&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5hfit", "score_hidden": false, "stickied": false, "created": 1492001050.0, "created_utc": 1491972250.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5ks1g", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "_Z_E_R_O", "parent_id": "t1_dg5k8gt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Bikes don't need licenses as far as I know. The biggest concern would be your safety, which it sounds like is severely at risk biking along that road. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Bikes don&amp;#39;t need licenses as far as I know. The biggest concern would be your safety, which it sounds like is severely at risk biking along that road. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5ks1g", "score_hidden": false, "stickied": false, "created": 1492008143.0, "created_utc": 1491979343.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg7e4ss", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lac3ru5", "parent_id": "t1_dg5k8gt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hey dudes, I've cycled on a motorway before. BAD IDEA. The wind coming from cars going fast can knock you off your bike.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey dudes, I&amp;#39;ve cycled on a motorway before. BAD IDEA. The wind coming from cars going fast can knock you off your bike.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7e4ss", "score_hidden": false, "stickied": false, "created": 1492109112.0, "created_utc": 1492080312.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5k8gt", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "savingssthrowaway", "parent_id": "t1_dg5k00y", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Shit, good point. I should probably research the law here before I do that. I know cops like to hang out on that highway, too. And my bike isn't licensed or anything. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shit, good point. I should probably research the law here before I do that. I know cops like to hang out on that highway, too. And my bike isn&amp;#39;t licensed or anything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5k8gt", "score_hidden": false, "stickied": false, "created": 1492006796.0, "created_utc": 1491977996.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5k00y", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "_Z_E_R_O", "parent_id": "t1_dg5jwwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just a warning, biking on the side of a highway is illegal in many places. Bikes are considered vehicles, and those roads often have minimum speed limits. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just a warning, biking on the side of a highway is illegal in many places. Bikes are considered vehicles, and those roads often have minimum speed limits. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5k00y", "score_hidden": false, "stickied": false, "created": 1492006242.0, "created_utc": 1491977442.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5vpq2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Flownique", "parent_id": "t1_dg5jwwb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Can you take a bus? There's usually bus stops at community colleges.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you take a bus? There&amp;#39;s usually bus stops at community colleges.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5vpq2", "score_hidden": false, "stickied": false, "created": 1492033809.0, "created_utc": 1492005009.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jwwb", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "savingssthrowaway", "parent_id": "t1_dg5drb8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;Cities here are extremely spread out and roads are dangerous to bike on. They often don't have shoulders and it's illegal in most areas to bike on the sidewalk or the highway.\n\n*Yep*. The fastest way there would be this highway where everyone does *at least* 60, and there's only gravel on either side. Really don't want to get run down, especially at night. \n\nI'm going to try it when I don't have anywhere to be and see what happens, though. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Cities here are extremely spread out and roads are dangerous to bike on. They often don&amp;#39;t have shoulders and it&amp;#39;s illegal in most areas to bike on the sidewalk or the highway.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;em&gt;Yep&lt;/em&gt;. The fastest way there would be this highway where everyone does &lt;em&gt;at least&lt;/em&gt; 60, and there&amp;#39;s only gravel on either side. Really don&amp;#39;t want to get run down, especially at night. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to try it when I don&amp;#39;t have anywhere to be and see what happens, though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jwwb", "score_hidden": false, "stickied": false, "created": 1492006036.0, "created_utc": 1491977236.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5hqpe", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Lac3ru5", "parent_id": "t1_dg5drb8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wow that sucks, I had no idea.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow that sucks, I had no idea.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5hqpe", "score_hidden": false, "stickied": false, "created": 1492001618.0, "created_utc": 1491972818.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5drb8", "gilded": 0, "archived": false, "score": 28, "report_reasons": null, "author": "_Z_E_R_O", "parent_id": "t1_dg5c50k", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If she's in the US that might not be a practical solution. Cities here are extremely spread out and roads are dangerous to bike on. They often don't have shoulders and it's illegal in most areas to bike on the sidewalk or the highway. \n\nA bike is good if you're traveling 10 miles or less, but any further than that (as most distances are) and it's too much, or the roads are inaccessible. Plus US weather sucks - it's either stifling hot and humid in the summer or wet and freezing (literally) in the winter.\n\nTl;dr - Bikes are good, but most people use them recreationally here for a reason. US roads are designed for cars. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If she&amp;#39;s in the US that might not be a practical solution. Cities here are extremely spread out and roads are dangerous to bike on. They often don&amp;#39;t have shoulders and it&amp;#39;s illegal in most areas to bike on the sidewalk or the highway. &lt;/p&gt;\n\n&lt;p&gt;A bike is good if you&amp;#39;re traveling 10 miles or less, but any further than that (as most distances are) and it&amp;#39;s too much, or the roads are inaccessible. Plus US weather sucks - it&amp;#39;s either stifling hot and humid in the summer or wet and freezing (literally) in the winter.&lt;/p&gt;\n\n&lt;p&gt;Tl;dr - Bikes are good, but most people use them recreationally here for a reason. US roads are designed for cars. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5drb8", "score_hidden": false, "stickied": false, "created": 1491995123.0, "created_utc": 1491966323.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 28}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5mnqb", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "DioOdy", "parent_id": "t1_dg5jipi", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are right, 30 mph is basically impossible. 30mp/h are 48,28 km/h. The time trial champion of 2016, Tony Martin was at 53,671 km/h for 40 km. I guess that she is not in his range....", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are right, 30 mph is basically impossible. 30mp/h are 48,28 km/h. The time trial champion of 2016, Tony Martin was at 53,671 km/h for 40 km. I guess that she is not in his range....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5mnqb", "score_hidden": false, "stickied": false, "created": 1492013361.0, "created_utc": 1491984561.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5jipi", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "JustARedditBrowser", "parent_id": "t1_dg5c50k", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "30mph? That's unlikely. I'm in pretty darn good shape, and I'm lucky if I get 20 mph on a very flat road. Maybe she could get 30 km/h.\n\nRegardless, it might be in a good idea if school and a potential work place aren't more than 10-15 miles away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;30mph? That&amp;#39;s unlikely. I&amp;#39;m in pretty darn good shape, and I&amp;#39;m lucky if I get 20 mph on a very flat road. Maybe she could get 30 km/h.&lt;/p&gt;\n\n&lt;p&gt;Regardless, it might be in a good idea if school and a potential work place aren&amp;#39;t more than 10-15 miles away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5jipi", "score_hidden": false, "stickied": false, "created": 1492005139.0, "created_utc": 1491976339.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg7e3v7", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clairebones", "parent_id": "t1_dg7e14j", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm in the UK too (Northern Ireland), but I only got a loan (no bursary, they decided my parents earned too much even though i was one of 4 kids) - I needed the loan money plus the money I earned from my part-time job just to get books, pay for transport, lunch, etc - there's no way I could have afforded to spend hundreds of pounds on a bike. £400 was half of what I got for a semester.\n\nI also don't think (though like you I'm not sure) that many students in the US get a bursary either, just loans that cover their fees.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the UK too (Northern Ireland), but I only got a loan (no bursary, they decided my parents earned too much even though i was one of 4 kids) - I needed the loan money plus the money I earned from my part-time job just to get books, pay for transport, lunch, etc - there&amp;#39;s no way I could have afforded to spend hundreds of pounds on a bike. £400 was half of what I got for a semester.&lt;/p&gt;\n\n&lt;p&gt;I also don&amp;#39;t think (though like you I&amp;#39;m not sure) that many students in the US get a bursary either, just loans that cover their fees.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7e3v7", "score_hidden": false, "stickied": false, "created": 1492109037.0, "created_utc": 1492080237.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7e14j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Lac3ru5", "parent_id": "t1_dg7bx7a", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sorry for my ignorance as I have no idea how the American college system works, I thought you might get a loan / bursary to help you live while you study? You could spend some of this to help you commute right? \n\nAgain I have no idea how it works so I could be wrong. I was just chipping in with what I did while I studied.\n\nAs you were curious about my financial situation, I received loan and a bursary from uni as my mum is a single parent and doesn't make much. At the start of second year I bought a road bike and used that to commute everywhere. Saved me a tonne.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for my ignorance as I have no idea how the American college system works, I thought you might get a loan / bursary to help you live while you study? You could spend some of this to help you commute right? &lt;/p&gt;\n\n&lt;p&gt;Again I have no idea how it works so I could be wrong. I was just chipping in with what I did while I studied.&lt;/p&gt;\n\n&lt;p&gt;As you were curious about my financial situation, I received loan and a bursary from uni as my mum is a single parent and doesn&amp;#39;t make much. At the start of second year I bought a road bike and used that to commute everywhere. Saved me a tonne.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7e14j", "score_hidden": false, "stickied": false, "created": 1492108826.0, "created_utc": 1492080026.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7bx7a", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "clairebones", "parent_id": "t1_dg5c50k", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm really curious about the financial situation of people who suggest spending £400 on a bike for a kid with _literally_ no access to money. She has no job, some money her mum is keeping from her, and from the sounds of it no other savings or job. Like I would have to sit down and consider spending £400 on a bike and I have a full-time job.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really curious about the financial situation of people who suggest spending £400 on a bike for a kid with &lt;em&gt;literally&lt;/em&gt; no access to money. She has no job, some money her mum is keeping from her, and from the sounds of it no other savings or job. Like I would have to sit down and consider spending £400 on a bike and I have a full-time job.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7bx7a", "score_hidden": false, "stickied": false, "created": 1492102458.0, "created_utc": 1492073658.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg5c50k", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Lac3ru5", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Have you thought about getting a road bike? You can get a good one for around £400. You can easily click 30mph as long as you're in on shape.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have you thought about getting a road bike? You can get a good one for around £400. You can easily click 30mph as long as you&amp;#39;re in on shape.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5c50k", "score_hidden": false, "stickied": false, "created": 1491992852.0, "created_utc": 1491964052.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5kco6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PatSmiles17", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Apply in-state. It's cheaper. And see what loans you can get through Financial Aid. I was in that predicament a couple years ago since I live with my mother in the country and jobs aren't really easy to find in my area unless you have a car. I transferred to a school four hours across the state and have been fairly well since. When you transfer, definitely see if you qualify for work study on campus.  If not, a lot of campus towns have places within walking distance you can apply to. Also, definitely start looking into what career job you want when you graduate. A lot of schools have career counselors you can talk to and job fairs you can attend. Make an effort to be as independent as possible and work toward the goal of being able to stand on your own feet and take care of yourself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Apply in-state. It&amp;#39;s cheaper. And see what loans you can get through Financial Aid. I was in that predicament a couple years ago since I live with my mother in the country and jobs aren&amp;#39;t really easy to find in my area unless you have a car. I transferred to a school four hours across the state and have been fairly well since. When you transfer, definitely see if you qualify for work study on campus.  If not, a lot of campus towns have places within walking distance you can apply to. Also, definitely start looking into what career job you want when you graduate. A lot of schools have career counselors you can talk to and job fairs you can attend. Make an effort to be as independent as possible and work toward the goal of being able to stand on your own feet and take care of yourself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5kco6", "score_hidden": false, "stickied": false, "created": 1492007083.0, "created_utc": 1491978283.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5ro2m", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "w362", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Transfer to a school that is located in an urban center. In state, out of state, it doesn't matter.  Use your 10K to establish that beach head. Financial aid, loans and your 10K will get you established.\n\n  From there, you will have many more options.  Work will be a walk, bike or bus ride away.  You will not need a car for quite some time.  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Transfer to a school that is located in an urban center. In state, out of state, it doesn&amp;#39;t matter.  Use your 10K to establish that beach head. Financial aid, loans and your 10K will get you established.&lt;/p&gt;\n\n&lt;p&gt;From there, you will have many more options.  Work will be a walk, bike or bus ride away.  You will not need a car for quite some time.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5ro2m", "score_hidden": false, "stickied": false, "created": 1492027385.0, "created_utc": 1491998585.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5uhj9", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "nassauismydog", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think the problem is more your mom than anything else. I agree with people suggesting a bike and getting a local job and saving your own money but the reason I'm posting is because no one has mentioned public transportation!?! There's no bus, train, subway...!?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the problem is more your mom than anything else. I agree with people suggesting a bike and getting a local job and saving your own money but the reason I&amp;#39;m posting is because no one has mentioned public transportation!?! There&amp;#39;s no bus, train, subway...!?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5uhj9", "score_hidden": false, "stickied": false, "created": 1492032116.0, "created_utc": 1492003316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5va3j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "MadelineItMe", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I would second the suggestion of getting a bike FOR NOW. 90 minutes on a bike is OK in spring/summer but only for the most hardcore in winter, so if you stay at home/in this college you will probably need a car by, say, October/November, but for now a bike will get you around with minimal outlay. Since it's almost summer, you will be able to get around and find a job and help you get at least a little money together. \n\n\nI think you should look into colleges on your own. Why wouldn't you be allowed to? How could she stop you? You wouldn't know where to start - well, maybe think of a few places where you're interested in going, look at the Wikipedia page for that city and see what colleges are listed on it, then google them. \n\n\nAgree that there is something extremely fishy about your mom's attitude towards your money. I also would not be surprised if it was gone/extremely diminished. It sucks but I don't think you're going to get it. Make your plans without it. \n\n\nIf you do decide to stay in the college you're at, see if they have something called \"office of student life\" or something similar. If they do they will have a housing office which helps students who can't find housing. They may be able to hook you up with student housing or at least maintain a listing of people looking for roommates.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would second the suggestion of getting a bike FOR NOW. 90 minutes on a bike is OK in spring/summer but only for the most hardcore in winter, so if you stay at home/in this college you will probably need a car by, say, October/November, but for now a bike will get you around with minimal outlay. Since it&amp;#39;s almost summer, you will be able to get around and find a job and help you get at least a little money together. &lt;/p&gt;\n\n&lt;p&gt;I think you should look into colleges on your own. Why wouldn&amp;#39;t you be allowed to? How could she stop you? You wouldn&amp;#39;t know where to start - well, maybe think of a few places where you&amp;#39;re interested in going, look at the Wikipedia page for that city and see what colleges are listed on it, then google them. &lt;/p&gt;\n\n&lt;p&gt;Agree that there is something extremely fishy about your mom&amp;#39;s attitude towards your money. I also would not be surprised if it was gone/extremely diminished. It sucks but I don&amp;#39;t think you&amp;#39;re going to get it. Make your plans without it. &lt;/p&gt;\n\n&lt;p&gt;If you do decide to stay in the college you&amp;#39;re at, see if they have something called &amp;quot;office of student life&amp;quot; or something similar. If they do they will have a housing office which helps students who can&amp;#39;t find housing. They may be able to hook you up with student housing or at least maintain a listing of people looking for roommates.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5va3j", "score_hidden": false, "stickied": false, "created": 1492033228.0, "created_utc": 1492004428.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5x5p2", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "cmcg1227", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I would try to find a school that is a) an in-state public institution or b) and out-of-state public institution that has what is often referred to as \"reciprocity\" (for example - if you live in Illinois, some schools in Wisconsin will give you in-state tuition, and visa versa). Your community college should have counselors who specifically help with this. \n\nYour parents probably fill out the FASFA for your community college tuition anyways, so get that filled out, apply to schools, apply for loans and scholarships. You SHOULD be able to get enough loans/grants to pay for tuition/room and board at a reasonably priced college. Do all of this without informing your mother. Do not have anything mailed to your house. Get a PO Box and always use that as your mailing address (stop at the PO box on your way to/from school). \n\nYou're a legal adult. You are ALLOWED to do anything that's legal, including transferring to an out of state school. Just do it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would try to find a school that is a) an in-state public institution or b) and out-of-state public institution that has what is often referred to as &amp;quot;reciprocity&amp;quot; (for example - if you live in Illinois, some schools in Wisconsin will give you in-state tuition, and visa versa). Your community college should have counselors who specifically help with this. &lt;/p&gt;\n\n&lt;p&gt;Your parents probably fill out the FASFA for your community college tuition anyways, so get that filled out, apply to schools, apply for loans and scholarships. You SHOULD be able to get enough loans/grants to pay for tuition/room and board at a reasonably priced college. Do all of this without informing your mother. Do not have anything mailed to your house. Get a PO Box and always use that as your mailing address (stop at the PO box on your way to/from school). &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re a legal adult. You are ALLOWED to do anything that&amp;#39;s legal, including transferring to an out of state school. Just do it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5x5p2", "score_hidden": false, "stickied": false, "created": 1492035632.0, "created_utc": 1492006832.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg61ibb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sttteeellla", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Can you get a job or join a club on campus? See if you can work part time at the library, etc. You might be able to spend less time at home that way, and friends may be able to transport you around from your school to extracurricular activities (limiting the distance you need to ask people for help). That was basically my strategy in high school. \n\nBut if she's also being difficult with you using it for school, definitely use some of that cash to get yourself a car. You don't have to spend a lot of money to get a beater call. If you use that money, be super focused. Get a job, get good grades, get a better job, get out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Can you get a job or join a club on campus? See if you can work part time at the library, etc. You might be able to spend less time at home that way, and friends may be able to transport you around from your school to extracurricular activities (limiting the distance you need to ask people for help). That was basically my strategy in high school. &lt;/p&gt;\n\n&lt;p&gt;But if she&amp;#39;s also being difficult with you using it for school, definitely use some of that cash to get yourself a car. You don&amp;#39;t have to spend a lot of money to get a beater call. If you use that money, be super focused. Get a job, get good grades, get a better job, get out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg61ibb", "score_hidden": false, "stickied": false, "created": 1492040550.0, "created_utc": 1492011750.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg657n8", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "acekingqueenjack", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your mother is pushing you to move out. \n\nIn a way, that makes her a good mother for urging you to find your wings. Find a job near college and relocate to someplace near both. Perhaps you can walk, bike, take a bus, or even uber. Usually colleges have all sort of jobs available for students. See if you can even get paid to take notes for classes.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your mother is pushing you to move out. &lt;/p&gt;\n\n&lt;p&gt;In a way, that makes her a good mother for urging you to find your wings. Find a job near college and relocate to someplace near both. Perhaps you can walk, bike, take a bus, or even uber. Usually colleges have all sort of jobs available for students. See if you can even get paid to take notes for classes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg657n8", "score_hidden": false, "stickied": false, "created": 1492044489.0, "created_utc": 1492015689.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg6ebca", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "java-worth", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "OP, you *need to get that money in your name ASAP*. I have seen this scenario happen far too often - money in someone else's name ends up lost. Whether you get a car or not, you need these 10K.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;OP, you &lt;em&gt;need to get that money in your name ASAP&lt;/em&gt;. I have seen this scenario happen far too often - money in someone else&amp;#39;s name ends up lost. Whether you get a car or not, you need these 10K.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6ebca", "score_hidden": false, "stickied": false, "created": 1492053786.0, "created_utc": 1492024986.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg6k9u6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "kaliforniakitty", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Have your mom give you the money for a cheap car. Don't take the first one that \"looks nice,\" and is in your price range. Ask a close friend's parent or maybe a teacher, who knows cars, to help you and look at cars before you buy one. Most people are willing and eager to help in situations like this. After, apply everywhere, but focus on restaurants in your area so you can make tips. A lot of people are able to support themselves off of the tips they make as servers. If you can't get a serving job, start as a hostess, and you will be able to move up to server, and can make tips depending on the restaurant. Try to keep $1,000 in your savings for repairs. Hope this helps! :)", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Have your mom give you the money for a cheap car. Don&amp;#39;t take the first one that &amp;quot;looks nice,&amp;quot; and is in your price range. Ask a close friend&amp;#39;s parent or maybe a teacher, who knows cars, to help you and look at cars before you buy one. Most people are willing and eager to help in situations like this. After, apply everywhere, but focus on restaurants in your area so you can make tips. A lot of people are able to support themselves off of the tips they make as servers. If you can&amp;#39;t get a serving job, start as a hostess, and you will be able to move up to server, and can make tips depending on the restaurant. Try to keep $1,000 in your savings for repairs. Hope this helps! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6k9u6", "score_hidden": false, "stickied": false, "created": 1492059996.0, "created_utc": 1492031196.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg6kpnv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "myyusernameismeta", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree that your mom might have spent the money, and she definitely won't want to give up whatever control she has over you. Your best bet is to go to technical school, since that actually gives you practical training that prepares you for work. \n\nSince your mom isn't supportive, you have to think long-term and be your own safety net. That's why technical school is such a good option for you. If you absolutely have your heart set on getting a bachelor's degree, seriously consider majoring in nursing, engineering, nutrition (nutritionists make like $60k), education (teaching is a steady job), or a language (so you can work as a translator). Most other associate's and bachelor's degrees won't actually help you find work.\n\nFinally, you probably qualify for a number of government programs like food stamps and Medicaid, possibly even unemployment (if you live in the US). Those resources exist for people like you - people who want to work and just need some help to get by on their own. You can often find out about resources available to you by calling 211, and I'm sure r/legaladvice would be a huge help.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that your mom might have spent the money, and she definitely won&amp;#39;t want to give up whatever control she has over you. Your best bet is to go to technical school, since that actually gives you practical training that prepares you for work. &lt;/p&gt;\n\n&lt;p&gt;Since your mom isn&amp;#39;t supportive, you have to think long-term and be your own safety net. That&amp;#39;s why technical school is such a good option for you. If you absolutely have your heart set on getting a bachelor&amp;#39;s degree, seriously consider majoring in nursing, engineering, nutrition (nutritionists make like $60k), education (teaching is a steady job), or a language (so you can work as a translator). Most other associate&amp;#39;s and bachelor&amp;#39;s degrees won&amp;#39;t actually help you find work.&lt;/p&gt;\n\n&lt;p&gt;Finally, you probably qualify for a number of government programs like food stamps and Medicaid, possibly even unemployment (if you live in the US). Those resources exist for people like you - people who want to work and just need some help to get by on their own. You can often find out about resources available to you by calling 211, and I&amp;#39;m sure &lt;a href=\"/r/legaladvice\"&gt;r/legaladvice&lt;/a&gt; would be a huge help.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6kpnv", "score_hidden": false, "stickied": false, "created": 1492060501.0, "created_utc": 1492031701.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64uqhg", "likes": null, "replies": "", "user_reports": [], "id": "dg5k6js", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "thatboyfromthehood", "parent_id": "t3_64uqhg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Make some friends and try to get a ride. Get anther job and save quick. Acquire a useful skill and try to get a higher paying job. \\\n\nSince you're living with your mom, she can do whatever she wants. That's the truth. If you don't like it, talk to her about it and if nothing happens you just have to save up and move out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Make some friends and try to get a ride. Get anther job and save quick. Acquire a useful skill and try to get a higher paying job. \\&lt;/p&gt;\n\n&lt;p&gt;Since you&amp;#39;re living with your mom, she can do whatever she wants. That&amp;#39;s the truth. If you don&amp;#39;t like it, talk to her about it and if nothing happens you just have to save up and move out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg5k6js", "score_hidden": false, "stickied": false, "created": 1492006672.0, "created_utc": 1491977872.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}]