[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife and I have been together for 12 years and are parents to two wonderful young boys. We both originate from different countries and have made the choice to live in my country of origin. We live about two hours away from my parents. &lt;/p&gt;\n\n&lt;p&gt;My father is the eldest of four. He never got along with his own father who he claims never loved him (the reasons were never really clear to me). His own father left his wife (my grand-mother) when my father and his siblings were in their teenage years. My father gave himself the responsibility to oversee his mother and siblings and still does to this day. He is also a doctor and manages a relatively large clinic. All of his life he has been used to being in charge of others. This also includes my sister, my mother, as well as me and my own family.&lt;/p&gt;\n\n&lt;p&gt;Sadly my father&amp;#39;s relationship with my mother has been rocky as he has had several extra-marital relationships. I became aware of these relationships in my teen years and they have had a profound effect on the whole family. My mother has stuck with him putting what she calls &amp;quot;family&amp;quot; first. &lt;/p&gt;\n\n&lt;p&gt;My father has a very overwhelming personality: he is quite sensitive (cries very easily in emotional situations), he is manipulative (guilt trips if we don&amp;#39;t see him and my mom when it suits him), he has a very short attention span (won&amp;#39;t hold a conversation more than a minute without changing subject), he gets angry very easily (often feels attacked), he makes references about his own death (whether hinting suicide or that we will abandon him during his final years, etc). He is also a functioning alcoholic: he drinks a lot during evenings before going to bed. He will deny having any sorts of problems with alcohol. It is very difficult to communicate with him. In general we all avoid contradicting him for fear of triggering unnecessary conflict.&lt;/p&gt;\n\n&lt;p&gt;Although everyone in his life realize all of the above he is still very much appreciated. He is generous with his time and money and will go about and beyond to help you in any situation.&lt;/p&gt;\n\n&lt;p&gt;My wife has had to witness the anguish that I live through dealing with him for all the years she has known me. For example he messages me during evenings where he will claim that I don&amp;#39;t love him or give me unwarranted life advice (e.g. you and your family would be happier living in the same city we live in). But she refuses his way of imposing his life choices on us. Unlike most people she has had the balls to respond to him earlier this year. Her response was very neutral and respectful but he still managed to make a huge deal out of it claiming that &amp;quot;she had destroyed him&amp;quot;. My wife and I rarely argue except when it comes to my parents. She rightfully feels that I should take a stronger stance to show how I place her and our family first. Indeed I will sometimes put myself in a situation where I privilege my parents&amp;#39; wishes at the expense of own family. My wife believes that my parents do not provide as much value in our children&amp;#39;s lives as they could on top of all the negativity my father brings along. &lt;/p&gt;\n\n&lt;p&gt;I believe that I have been conditioned this way throughout my younger days. Witnessing infidelity, the lack of communication, his over sensitiveness, alcoholic non-sense, and sense of entitlement have turned me into someone that will avoid conflict with my father at all cost. I have seen a psychologist, read books, discussed at length with my wife, my mother, and sister as well as my father&amp;#39;s siblings, to no avail. When it comes to my dad&amp;#39;s requests I have a hard time saying no. &lt;/p&gt;\n\n&lt;p&gt;What can I do to establish a normal relationship with my father without having to cut ties with him completely? Is that even possible? Where should I seek help?&lt;/p&gt;\n\n&lt;p&gt;TL;DR: My [38m] father [67m] is ruining my relationship with my wife [35f]. He plays several negative roles (manipulator, tormentor, victim) to gain what he wants. I choose to avoid conflict with him at all costs. This is creating tension with my wife who doesn&amp;#39;t want to play his game. How do I establish a normal relationship with my father without having to cut ties with him completely?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My wife and I have been together for 12 years and are parents to two wonderful young boys. We both originate from different countries and have made the choice to live in my country of origin. We live about two hours away from my parents. \n\n\nMy father is the eldest of four. He never got along with his own father who he claims never loved him (the reasons were never really clear to me). His own father left his wife (my grand-mother) when my father and his siblings were in their teenage years. My father gave himself the responsibility to oversee his mother and siblings and still does to this day. He is also a doctor and manages a relatively large clinic. All of his life he has been used to being in charge of others. This also includes my sister, my mother, as well as me and my own family.\n\n\nSadly my father's relationship with my mother has been rocky as he has had several extra-marital relationships. I became aware of these relationships in my teen years and they have had a profound effect on the whole family. My mother has stuck with him putting what she calls \"family\" first. \n\n\nMy father has a very overwhelming personality: he is quite sensitive (cries very easily in emotional situations), he is manipulative (guilt trips if we don't see him and my mom when it suits him), he has a very short attention span (won't hold a conversation more than a minute without changing subject), he gets angry very easily (often feels attacked), he makes references about his own death (whether hinting suicide or that we will abandon him during his final years, etc). He is also a functioning alcoholic: he drinks a lot during evenings before going to bed. He will deny having any sorts of problems with alcohol. It is very difficult to communicate with him. In general we all avoid contradicting him for fear of triggering unnecessary conflict.\n\n\nAlthough everyone in his life realize all of the above he is still very much appreciated. He is generous with his time and money and will go about and beyond to help you in any situation.\n\n\nMy wife has had to witness the anguish that I live through dealing with him for all the years she has known me. For example he messages me during evenings where he will claim that I don't love him or give me unwarranted life advice (e.g. you and your family would be happier living in the same city we live in). But she refuses his way of imposing his life choices on us. Unlike most people she has had the balls to respond to him earlier this year. Her response was very neutral and respectful but he still managed to make a huge deal out of it claiming that \"she had destroyed him\". My wife and I rarely argue except when it comes to my parents. She rightfully feels that I should take a stronger stance to show how I place her and our family first. Indeed I will sometimes put myself in a situation where I privilege my parents' wishes at the expense of own family. My wife believes that my parents do not provide as much value in our children's lives as they could on top of all the negativity my father brings along. \n\n\nI believe that I have been conditioned this way throughout my younger days. Witnessing infidelity, the lack of communication, his over sensitiveness, alcoholic non-sense, and sense of entitlement have turned me into someone that will avoid conflict with my father at all cost. I have seen a psychologist, read books, discussed at length with my wife, my mother, and sister as well as my father's siblings, to no avail. When it comes to my dad's requests I have a hard time saying no. \n\n\nWhat can I do to establish a normal relationship with my father without having to cut ties with him completely? Is that even possible? Where should I seek help?\n\n\nTL;DR: My [38m] father [67m] is ruining my relationship with my wife [35f]. He plays several negative roles (manipulator, tormentor, victim) to gain what he wants. I choose to avoid conflict with him at all costs. This is creating tension with my wife who doesn't want to play his game. How do I establish a normal relationship with my father without having to cut ties with him completely?", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Non-Romantic", "id": "64ztdj", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 150, "report_reasons": null, "author": "_johnnyC", "saved": false, "mod_reports": [], "name": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-gn misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/64ztdj/my_38m_father_67m_is_ruining_my_relationship_with/", "num_reports": null, "locked": false, "stickied": false, "created": 1492048714.0, "url": "https://www.reddit.com/r/relationships/comments/64ztdj/my_38m_father_67m_is_ruining_my_relationship_with/", "author_flair_text": null, "quarantine": false, "title": "My [38m] father [67m] is ruining my relationship with my wife [35f] of 12 years", "created_utc": 1492019914.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 42, "visited": false, "subreddit_type": "public", "ups": 150}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg79xe9", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg78zri", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Very much so, I agree", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very much so, I agree&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg79xe9", "score_hidden": false, "stickied": false, "created": 1492096635.0, "created_utc": 1492067835.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 11}}], "after": null, "before": null}}, "user_reports": [], "id": "dg78zri", "gilded": 0, "archived": false, "score": 52, "report_reasons": null, "author": "bleuscreenofdeath", "parent_id": "t1_dg69h5j", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "3. Get therapy. It will help make 1 &amp; 2 easier to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;Get therapy. It will help make 1 &amp;amp; 2 easier to do.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg78zri", "score_hidden": false, "stickied": false, "created": 1492094178.0, "created_utc": 1492065378.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 52}}], "after": null, "before": null}}, "user_reports": [], "id": "dg69h5j", "gilded": 0, "archived": false, "score": 494, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "1. Listen to your wife and follow her advice, because it is excellent advice.\n\n2. Since nothing seems to make you cope with him, since this is damaging your life, your only solution is to cut him out of your life\n\nTLDR: Do what your wife says, and not what your father says.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Listen to your wife and follow her advice, because it is excellent advice.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Since nothing seems to make you cope with him, since this is damaging your life, your only solution is to cut him out of your life&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;TLDR: Do what your wife says, and not what your father says.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg69h5j", "score_hidden": false, "stickied": false, "created": 1492048801.0, "created_utc": 1492020001.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 494}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6lf95", "gilded": 0, "archived": false, "score": 124, "report_reasons": null, "author": "brainstrain91", "parent_id": "t1_dg6cg58", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; **your father isn't causing a rift in your relationship...you are.**\n\nYuuuuuuup.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;your father isn&amp;#39;t causing a rift in your relationship...you are.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yuuuuuuup.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6lf95", "score_hidden": false, "stickied": false, "created": 1492061329.0, "created_utc": 1492032529.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 124}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6cg58", "gilded": 0, "archived": false, "score": 198, "report_reasons": null, "author": "KatCole7", "parent_id": "t1_dg6a5ix", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Definitely agree. OP, your father isn't causing a rift in your relationship...you are. Even though it's not easy, you have to put your foot down.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Definitely agree. OP, your father isn&amp;#39;t causing a rift in your relationship...you are. Even though it&amp;#39;s not easy, you have to put your foot down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6cg58", "score_hidden": false, "stickied": false, "created": 1492051848.0, "created_utc": 1492023048.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 198}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6rekd", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "HyperComa", "parent_id": "t1_dg6a5ix", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This all over the place. Far too often, people try to avoid conflict to protect the other person from feeling a negative emotion. This was how my was-husband treated me. He tried to protect me from my own feelings at the expense of honest communication. OP's father is a grown man who has lived through feeling angry or sad or ignored his whole life. He has also likely lived through joy, wonder, and boredom. For OP (or anyone) to tread on eggshells because the person who grates on them *might* get angry or sad or etc... is self-patronizing and fails to see the other person as a whole person. \n\nOP needs to condition/retrain himself because there's obviously no retraining his father. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This all over the place. Far too often, people try to avoid conflict to protect the other person from feeling a negative emotion. This was how my was-husband treated me. He tried to protect me from my own feelings at the expense of honest communication. OP&amp;#39;s father is a grown man who has lived through feeling angry or sad or ignored his whole life. He has also likely lived through joy, wonder, and boredom. For OP (or anyone) to tread on eggshells because the person who grates on them &lt;em&gt;might&lt;/em&gt; get angry or sad or etc... is self-patronizing and fails to see the other person as a whole person. &lt;/p&gt;\n\n&lt;p&gt;OP needs to condition/retrain himself because there&amp;#39;s obviously no retraining his father. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6rekd", "score_hidden": false, "stickied": false, "created": 1492068683.0, "created_utc": 1492039883.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 39}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6a5ix", "gilded": 0, "archived": false, "score": 367, "report_reasons": null, "author": "Population-Tire", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If your wife were the one writing this post from her perspective, the top comment would begin with the words, \"You don't have a father-in-law problem, you have a husband problem.\" Yes, you need to stand up for yourself, your wife, and your family (meaning your wife and children). They always come first, always. When the choice is between your dad and your family, you always pick your family. \n\nYou have been conditioned through his behavior to try to avoid conflicts with him, so I don't blame you for having trouble standing up to him or risking an outburst. But at the end of the day, you don't have an obligation or a responsibility to manage the emotions of an unreasonable person. \n\nJust remember that you always have the right to disengage. You can hang up the phone or walk out the door whenever he starts to get into one of his moods. Just work on keeping calm and being firm. \"If you speak to me like that, I am hanging up.\" \"I've told you our decision, please stop pushing this.\" \"I'm not going to talk to you if you continue to act this way.\" And more than anything, never console him if he starts crying, just leave. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your wife were the one writing this post from her perspective, the top comment would begin with the words, &amp;quot;You don&amp;#39;t have a father-in-law problem, you have a husband problem.&amp;quot; Yes, you need to stand up for yourself, your wife, and your family (meaning your wife and children). They always come first, always. When the choice is between your dad and your family, you always pick your family. &lt;/p&gt;\n\n&lt;p&gt;You have been conditioned through his behavior to try to avoid conflicts with him, so I don&amp;#39;t blame you for having trouble standing up to him or risking an outburst. But at the end of the day, you don&amp;#39;t have an obligation or a responsibility to manage the emotions of an unreasonable person. &lt;/p&gt;\n\n&lt;p&gt;Just remember that you always have the right to disengage. You can hang up the phone or walk out the door whenever he starts to get into one of his moods. Just work on keeping calm and being firm. &amp;quot;If you speak to me like that, I am hanging up.&amp;quot; &amp;quot;I&amp;#39;ve told you our decision, please stop pushing this.&amp;quot; &amp;quot;I&amp;#39;m not going to talk to you if you continue to act this way.&amp;quot; And more than anything, never console him if he starts crying, just leave. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6a5ix", "score_hidden": false, "stickied": false, "created": 1492049502.0, "created_utc": 1492020702.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 367}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6a0jx", "gilded": 0, "archived": false, "score": 105, "report_reasons": null, "author": "runningblack", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; How do I establish a normal relationship with my father without having to cut ties with him completely?\n\nThere's no guarantee that you can.\n\nWhat I can say is that if you don't establish boundaries, and you don't enforce them, and you don't cut off contact if said boundaries are not adhered to, then do not be surprised ifyour wife gets tired of your shit and leaves.\n\nIt's your job to enforce boundaries with your parents. **It is your job to put your family first.**", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How do I establish a normal relationship with my father without having to cut ties with him completely?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There&amp;#39;s no guarantee that you can.&lt;/p&gt;\n\n&lt;p&gt;What I can say is that if you don&amp;#39;t establish boundaries, and you don&amp;#39;t enforce them, and you don&amp;#39;t cut off contact if said boundaries are not adhered to, then do not be surprised ifyour wife gets tired of your shit and leaves.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s your job to enforce boundaries with your parents. &lt;strong&gt;It is your job to put your family first.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6a0jx", "score_hidden": false, "stickied": false, "created": 1492049361.0, "created_utc": 1492020561.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 105}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg72ij2", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "vermillionskies", "parent_id": "t1_dg6pljc", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is exactly how I see it. \n\nOP can only control himself; he needs to decide if his family (wife and kids) matter enough to him to cut out the dead (and toxic) wood. He is not responsible for his father’s happiness and no amount of towing the line will “fix” his dad.\n\nIt seems heartless but is it better to destroy your relationship with kids and wife just because they are not narcissistic alcoholics? I would say no.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is exactly how I see it. &lt;/p&gt;\n\n&lt;p&gt;OP can only control himself; he needs to decide if his family (wife and kids) matter enough to him to cut out the dead (and toxic) wood. He is not responsible for his father’s happiness and no amount of towing the line will “fix” his dad.&lt;/p&gt;\n\n&lt;p&gt;It seems heartless but is it better to destroy your relationship with kids and wife just because they are not narcissistic alcoholics? I would say no.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg72ij2", "score_hidden": false, "stickied": false, "created": 1492082567.0, "created_utc": 1492053767.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 15}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6pljc", "gilded": 0, "archived": false, "score": 84, "report_reasons": null, "author": "ShelfLifeInc", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; Indeed I will sometimes put myself in a situation where I privilege my parents' wishes **at the expense of own family**. \n\nShit dude. \n\nYour grandfather destroyed his family by leaving your grandmother, and has a very troubled relationship with his son (your father). \n\nReeling from his chaotic childhood, your father destroyed his family by cheating on his wife multiple times, and has a very troubled relationship with his son (you). \n\nReeling from *your* chaotic childhood, you are at risk of destroying *your* family by always putting your father first. \n\nYou need to be strong enough to break the chain of dysfunction. Look at what brought your father to where he is now. Observe what makes you two similar. And go back to therapy. \n\nDon't let your family, and your children, be the next stage in the same story of broken families and dysfunctional relationships. ", "edited": 1492049326.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Indeed I will sometimes put myself in a situation where I privilege my parents&amp;#39; wishes &lt;strong&gt;at the expense of own family&lt;/strong&gt;. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Shit dude. &lt;/p&gt;\n\n&lt;p&gt;Your grandfather destroyed his family by leaving your grandmother, and has a very troubled relationship with his son (your father). &lt;/p&gt;\n\n&lt;p&gt;Reeling from his chaotic childhood, your father destroyed his family by cheating on his wife multiple times, and has a very troubled relationship with his son (you). &lt;/p&gt;\n\n&lt;p&gt;Reeling from &lt;em&gt;your&lt;/em&gt; chaotic childhood, you are at risk of destroying &lt;em&gt;your&lt;/em&gt; family by always putting your father first. &lt;/p&gt;\n\n&lt;p&gt;You need to be strong enough to break the chain of dysfunction. Look at what brought your father to where he is now. Observe what makes you two similar. And go back to therapy. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t let your family, and your children, be the next stage in the same story of broken families and dysfunctional relationships. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6pljc", "score_hidden": false, "stickied": false, "created": 1492066438.0, "created_utc": 1492037638.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 84}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6dr3t", "gilded": 0, "archived": false, "score": 165, "report_reasons": null, "author": "autografty", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your father isn't ruining your relationship with your wife. Your father isn't jeopardizing your family life. \n\nYou are. You are allowing this. Take responsibility for that at least. And do what ever you can to protect your mental health and your family stability.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your father isn&amp;#39;t ruining your relationship with your wife. Your father isn&amp;#39;t jeopardizing your family life. &lt;/p&gt;\n\n&lt;p&gt;You are. You are allowing this. Take responsibility for that at least. And do what ever you can to protect your mental health and your family stability.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6dr3t", "score_hidden": false, "stickied": false, "created": 1492053206.0, "created_utc": 1492024406.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 165}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg7067t", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "avrenak", "parent_id": "t1_dg6af8b", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; You mention that you've read books. I encourage you to check out In Sheep's Clothing: Understanding and Dealing with Manipulative People by George K Simon.\n\nYou should also look at Toxic Parents by Susan Forward. The book has practical advice for setting boundaries and protecting your immediate family.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You mention that you&amp;#39;ve read books. I encourage you to check out In Sheep&amp;#39;s Clothing: Understanding and Dealing with Manipulative People by George K Simon.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You should also look at Toxic Parents by Susan Forward. The book has practical advice for setting boundaries and protecting your immediate family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7067t", "score_hidden": false, "stickied": false, "created": 1492079455.0, "created_utc": 1492050655.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6af8b", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "PurplePlurple", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You can't have a normal relationship with your father. He does not want to change - so you have to change the relationship and dynamic with him, if you want to make a difference. He is a troubled, negative, and manipulative man. He's not a good model for your children. You are lucky that your wife is not a pushover - you need to stop falling on your habits, stop submitting to your father's techniques, and put your family ahead of him at all times. (I empathize and understand your avoidance of conflict - it's difficult, you lack the tools to do so successfully, and your father has had your whole life to mold you and understand you.) Let your wife guide you here, listen to her.\n\nYou mention that you've read books. I encourage you to check out *In Sheep's Clothing: Understanding and Dealing with Manipulative People* by George K Simon. He is a professional, the book is written for laypeople and clinical psychologists alike. It offers a perspective on manipulative personalities, talks about the many strategies they employ to get what they want, and what you can do to work against that tide of dysfunction they use to try and take control. \n\n**I encourage you to read that book and combine it's advice with your wife's determination and insight.** You want to make changes, and unfortunately your father is going to be the one who benefits the least - he is going to reisst and he is going to prey on your emotions and try to make you feel guilty for standing up for yourself. You have a family of your own now,  it is time to take a stand.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can&amp;#39;t have a normal relationship with your father. He does not want to change - so you have to change the relationship and dynamic with him, if you want to make a difference. He is a troubled, negative, and manipulative man. He&amp;#39;s not a good model for your children. You are lucky that your wife is not a pushover - you need to stop falling on your habits, stop submitting to your father&amp;#39;s techniques, and put your family ahead of him at all times. (I empathize and understand your avoidance of conflict - it&amp;#39;s difficult, you lack the tools to do so successfully, and your father has had your whole life to mold you and understand you.) Let your wife guide you here, listen to her.&lt;/p&gt;\n\n&lt;p&gt;You mention that you&amp;#39;ve read books. I encourage you to check out &lt;em&gt;In Sheep&amp;#39;s Clothing: Understanding and Dealing with Manipulative People&lt;/em&gt; by George K Simon. He is a professional, the book is written for laypeople and clinical psychologists alike. It offers a perspective on manipulative personalities, talks about the many strategies they employ to get what they want, and what you can do to work against that tide of dysfunction they use to try and take control. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I encourage you to read that book and combine it&amp;#39;s advice with your wife&amp;#39;s determination and insight.&lt;/strong&gt; You want to make changes, and unfortunately your father is going to be the one who benefits the least - he is going to reisst and he is going to prey on your emotions and try to make you feel guilty for standing up for yourself. You have a family of your own now,  it is time to take a stand.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6af8b", "score_hidden": false, "stickied": false, "created": 1492049781.0, "created_utc": 1492020981.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6e62n", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "_sharkattack", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I choose to avoid conflict with him at all costs. \n\nYou've been doing this your whole life and where has it gotten you? Nowhere. Father's behavior has never improved in all the years you've been playing along with his game. At some point, you have to realize that things will never change and this is how he will be until the day he dies.\n\nYour wife and your children are your primary family now, not your mother/father/sister. It's time to set some boundaries with your father and stop letting his toxic behavior destroy your family. \n\n&gt; My wife believes that my parents do not provide as much value in our children's lives as they could on top of all the negativity my father brings along.\n\nYour wife is a wise woman. The benefit of having grandparents is not worth the poison your dad brings to the relationship. It's better to have no grandparents, no family, than toxic ones. \n\nYou should try going low-contact (or even no-contact) with your father for a few months and see how it feels. You don't have to worry about saying no or walking on eggshells if you just don't talk to him at all.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I choose to avoid conflict with him at all costs. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;ve been doing this your whole life and where has it gotten you? Nowhere. Father&amp;#39;s behavior has never improved in all the years you&amp;#39;ve been playing along with his game. At some point, you have to realize that things will never change and this is how he will be until the day he dies.&lt;/p&gt;\n\n&lt;p&gt;Your wife and your children are your primary family now, not your mother/father/sister. It&amp;#39;s time to set some boundaries with your father and stop letting his toxic behavior destroy your family. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;My wife believes that my parents do not provide as much value in our children&amp;#39;s lives as they could on top of all the negativity my father brings along.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your wife is a wise woman. The benefit of having grandparents is not worth the poison your dad brings to the relationship. It&amp;#39;s better to have no grandparents, no family, than toxic ones. &lt;/p&gt;\n\n&lt;p&gt;You should try going low-contact (or even no-contact) with your father for a few months and see how it feels. You don&amp;#39;t have to worry about saying no or walking on eggshells if you just don&amp;#39;t talk to him at all.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6e62n", "score_hidden": false, "stickied": false, "created": 1492053637.0, "created_utc": 1492024837.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6k24n", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "SharkWeekJunkie", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What are you clinging to? \n\n&gt;He is generous with his time and money and will go about and beyond to help you in any situation.\n\nIs that it? Is he really that generous if it comes with his negative shit? Or do you think he knows he has to be generous to get an audience? \n\nMan up, set some boundaries, and apologize for your wife for taking so long to realize how toxic your father's behavior is. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are you clinging to? &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He is generous with his time and money and will go about and beyond to help you in any situation.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is that it? Is he really that generous if it comes with his negative shit? Or do you think he knows he has to be generous to get an audience? &lt;/p&gt;\n\n&lt;p&gt;Man up, set some boundaries, and apologize for your wife for taking so long to realize how toxic your father&amp;#39;s behavior is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6k24n", "score_hidden": false, "stickied": false, "created": 1492059753.0, "created_utc": 1492030953.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6cjtq", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "braddis85", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Worry about your own family first, and your father 2nd. Otherwise you will be left without your own family pretty quickly. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Worry about your own family first, and your father 2nd. Otherwise you will be left without your own family pretty quickly. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6cjtq", "score_hidden": false, "stickied": false, "created": 1492051958.0, "created_utc": 1492023158.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6bdio", "gilded": 0, "archived": false, "score": 34, "report_reasons": null, "author": "Questions2pm", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are unfortunately ruining this relationship. Your wife's advice is frankly perfect advice for the situation. You need to stand up for her and to your father, who sounds terrible.\n\nDon't make the same mistake your mother made, in thinking that putting up with his behaviour is putting family first. He has clearly made your mother's life less happy, your life less happy, your wife's life less happy, if you split up over this, would your children be less happy? It's not family first, it's him first. Your father has always been this way. I'm sorry to tell you this.\n\nYou need to stand by and protect your family.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are unfortunately ruining this relationship. Your wife&amp;#39;s advice is frankly perfect advice for the situation. You need to stand up for her and to your father, who sounds terrible.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t make the same mistake your mother made, in thinking that putting up with his behaviour is putting family first. He has clearly made your mother&amp;#39;s life less happy, your life less happy, your wife&amp;#39;s life less happy, if you split up over this, would your children be less happy? It&amp;#39;s not family first, it&amp;#39;s him first. Your father has always been this way. I&amp;#39;m sorry to tell you this.&lt;/p&gt;\n\n&lt;p&gt;You need to stand by and protect your family.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6bdio", "score_hidden": false, "stickied": false, "created": 1492050749.0, "created_utc": 1492021949.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 34}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6c3c9", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "onekate", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Unfortunately you cannot decide to establish a \"normal\" relationship him, as relationships involve (at least) two people, and he is one of the people in this relationship. So as long as he is who he is, you won't be able to have a normal relationship with him. And old men with the spate of issues and history that he has simply do not change that dramatically. You can try to set boundaries that are radically different than the ones you have now, but I suspect that he will not accept those boundaries and that in order for you to have a healthy life, you will be best served by cutting him out of it. Your mother is choosing to stay with him because she puts \"family first\" and you seem to know that she is misguided in doing so, yet here you are making the same choice. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately you cannot decide to establish a &amp;quot;normal&amp;quot; relationship him, as relationships involve (at least) two people, and he is one of the people in this relationship. So as long as he is who he is, you won&amp;#39;t be able to have a normal relationship with him. And old men with the spate of issues and history that he has simply do not change that dramatically. You can try to set boundaries that are radically different than the ones you have now, but I suspect that he will not accept those boundaries and that in order for you to have a healthy life, you will be best served by cutting him out of it. Your mother is choosing to stay with him because she puts &amp;quot;family first&amp;quot; and you seem to know that she is misguided in doing so, yet here you are making the same choice. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6c3c9", "score_hidden": false, "stickied": false, "created": 1492051480.0, "created_utc": 1492022680.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6ui0q", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "SimpleSyrup87", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dear OPs wife,\nPlease divorce this spineless man. This is never going to get better because your husband is refusing to set boundaries. If you stay, you and your children will live a life of coming in second place to a jerk who can abuse your boundaries and your husband will still kiss his feet. \nSincerely,\nA concerned stranger ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dear OPs wife,\nPlease divorce this spineless man. This is never going to get better because your husband is refusing to set boundaries. If you stay, you and your children will live a life of coming in second place to a jerk who can abuse your boundaries and your husband will still kiss his feet. \nSincerely,\nA concerned stranger &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6ui0q", "score_hidden": false, "stickied": false, "created": 1492072492.0, "created_utc": 1492043692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6qr9r", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "justhewayouare", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're the problem in your marriage not your dad. Your dad is manipulative and he isn't going to change and doesn't care about changing. Cut ties and stand up for your family because right now you're just a doormat for a man with a twisted sense of priority and importance.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re the problem in your marriage not your dad. Your dad is manipulative and he isn&amp;#39;t going to change and doesn&amp;#39;t care about changing. Cut ties and stand up for your family because right now you&amp;#39;re just a doormat for a man with a twisted sense of priority and importance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6qr9r", "score_hidden": false, "stickied": false, "created": 1492067892.0, "created_utc": 1492039092.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6p32t", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "-susan-", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sounds like if you don't start fully backing your wife, you might end up losing her.  You need to pick a side and not waffle in the middle.  Is your relationship with your parents more important than your marriage?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sounds like if you don&amp;#39;t start fully backing your wife, you might end up losing her.  You need to pick a side and not waffle in the middle.  Is your relationship with your parents more important than your marriage?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6p32t", "score_hidden": false, "stickied": false, "created": 1492065810.0, "created_utc": 1492037010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6rkrg", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "cromulent_weasel", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; How do I establish a normal relationship with my father without having to cut ties with him completely?\n\nIf your father is making you choose between him and your wife, you need to choose your wife every time.  100% of the time.  And he needs to know that.  Maybe even say it to his face.\n\n\"Dad, are you really asking me to choose between you and [wife]?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;How do I establish a normal relationship with my father without having to cut ties with him completely?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If your father is making you choose between him and your wife, you need to choose your wife every time.  100% of the time.  And he needs to know that.  Maybe even say it to his face.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Dad, are you really asking me to choose between you and [wife]?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6rkrg", "score_hidden": false, "stickied": false, "created": 1492068890.0, "created_utc": 1492040090.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6cw3n", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "Miralinds", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your father is acting like a spoiled toddler. The solution is to treat him like one. He gets a time out when he can't behave, which means no responding to the behavior other than to tell him what he's done that's unacceptable and that you'll speak to him again in x days. That time gets lengthened each time he repeats a behavior. \n\nHe's spent his lifetime developing these ridiculous habits and traits. They'll either need to be trained out of him (via clear and consistent consequences), or avoided completely by stopping contact with him. You're under no obligation to maintain a relationship with an emotionally manipulative man who acts like a huge baby when he doesn't get his way, even if he is your dad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your father is acting like a spoiled toddler. The solution is to treat him like one. He gets a time out when he can&amp;#39;t behave, which means no responding to the behavior other than to tell him what he&amp;#39;s done that&amp;#39;s unacceptable and that you&amp;#39;ll speak to him again in x days. That time gets lengthened each time he repeats a behavior. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s spent his lifetime developing these ridiculous habits and traits. They&amp;#39;ll either need to be trained out of him (via clear and consistent consequences), or avoided completely by stopping contact with him. You&amp;#39;re under no obligation to maintain a relationship with an emotionally manipulative man who acts like a huge baby when he doesn&amp;#39;t get his way, even if he is your dad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6cw3n", "score_hidden": false, "stickied": false, "created": 1492052310.0, "created_utc": 1492023510.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6r02l", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "eccentricgiraffe", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Check out the Captain Awkward blog. She has *lots* of advice for setting boundaries with parents and family members.\n\nIt won't be easy, and he will make a lot of drama before he accepts the boundaries. Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Check out the Captain Awkward blog. She has &lt;em&gt;lots&lt;/em&gt; of advice for setting boundaries with parents and family members.&lt;/p&gt;\n\n&lt;p&gt;It won&amp;#39;t be easy, and he will make a lot of drama before he accepts the boundaries. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6r02l", "score_hidden": false, "stickied": false, "created": 1492068194.0, "created_utc": 1492039394.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6mqdr", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "eightiesladies", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If you have trouble saying \"no\" to your father, it's time to limit your interaction with him. He sounds like a Narcissist, and you're not obligated to have a relationship with such people. Good on your wife for standing up to him. Stop worrying about offending him, since he can get offended at respectful discourse anyhow. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you have trouble saying &amp;quot;no&amp;quot; to your father, it&amp;#39;s time to limit your interaction with him. He sounds like a Narcissist, and you&amp;#39;re not obligated to have a relationship with such people. Good on your wife for standing up to him. Stop worrying about offending him, since he can get offended at respectful discourse anyhow. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6mqdr", "score_hidden": false, "stickied": false, "created": 1492062897.0, "created_utc": 1492034097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg69o03", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg69o03", "score_hidden": false, "stickied": false, "created": 1492048998.0, "created_utc": 1492020198.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg714y5", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "RUNNING_IN_CIRCLES1", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "No, YOU are ruining your relationship. The sooner you can take responsibility and figure out how to stand up for your new family, the better your relationship with your wife will begin.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No, YOU are ruining your relationship. The sooner you can take responsibility and figure out how to stand up for your new family, the better your relationship with your wife will begin.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg714y5", "score_hidden": false, "stickied": false, "created": 1492080703.0, "created_utc": 1492051903.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6bsab", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "charlzebub", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Practise makes perfect. \nThis isn't something that you can change in a single day. Start small, like with the text messages. \"Sorry, can't talk now, its bath and bed time for the kids, chat tomorrow.\" - baby steps.\n\nAlso, get a counsellor and have a look at r/raisedbynarcissists cuz man, your dad fits the bill.\n\nAnd thank your wife for putting up with this so far. She's a good woman, you should keep her!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Practise makes perfect. \nThis isn&amp;#39;t something that you can change in a single day. Start small, like with the text messages. &amp;quot;Sorry, can&amp;#39;t talk now, its bath and bed time for the kids, chat tomorrow.&amp;quot; - baby steps.&lt;/p&gt;\n\n&lt;p&gt;Also, get a counsellor and have a look at &lt;a href=\"/r/raisedbynarcissists\"&gt;r/raisedbynarcissists&lt;/a&gt; cuz man, your dad fits the bill.&lt;/p&gt;\n\n&lt;p&gt;And thank your wife for putting up with this so far. She&amp;#39;s a good woman, you should keep her!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6bsab", "score_hidden": false, "stickied": false, "created": 1492051167.0, "created_utc": 1492022367.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6anyb", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "mrhlkb", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You should take a stronger stance with your father.  If he wants a relationship, he will make it on your terms or he won't.  You need to first come to an agreement with your wife on appropriate boundaries with him.  For example, when you are visiting and for how long.   Stick to those boundaries.  \n\nIf you fear that communication with him, then you need therapy.  I don't mean this flippantly.  You grew up in a home where you could not healthily express your needs and wants with your father.  He is an addict. You are at risk of becoming and addict or repeating these same patterns.  Get therapy to understand what is going on with you when you want to avoid conflict.  Normal relationships have conflict.  It's not healthy for anyone if you are constantly seeking to avoid conflict with the other person in the relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should take a stronger stance with your father.  If he wants a relationship, he will make it on your terms or he won&amp;#39;t.  You need to first come to an agreement with your wife on appropriate boundaries with him.  For example, when you are visiting and for how long.   Stick to those boundaries.  &lt;/p&gt;\n\n&lt;p&gt;If you fear that communication with him, then you need therapy.  I don&amp;#39;t mean this flippantly.  You grew up in a home where you could not healthily express your needs and wants with your father.  He is an addict. You are at risk of becoming and addict or repeating these same patterns.  Get therapy to understand what is going on with you when you want to avoid conflict.  Normal relationships have conflict.  It&amp;#39;s not healthy for anyone if you are constantly seeking to avoid conflict with the other person in the relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6anyb", "score_hidden": false, "stickied": false, "created": 1492050033.0, "created_utc": 1492021233.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6mult", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Self-Aware", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Think how dealing with your father makes you feel, the influence those feelings have had on your life. Then ask yourself- do you want your children to experience those feelings and their consequence? Because if you and your wife capitulate to your father without boundaries and in the way that you have before, that is what will happen. Your children will be scared of their grandfather. \n\nThis behaviour is clear to a child and any negative atmosphere created they WILL pick up on, before they are old enough to understand the justifications you've made for your own refusal to defy him. All they will know is that there is someone in their lives who is allowed to treat them badly and ignore their wishes, and that their father will not protect them from that. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Think how dealing with your father makes you feel, the influence those feelings have had on your life. Then ask yourself- do you want your children to experience those feelings and their consequence? Because if you and your wife capitulate to your father without boundaries and in the way that you have before, that is what will happen. Your children will be scared of their grandfather. &lt;/p&gt;\n\n&lt;p&gt;This behaviour is clear to a child and any negative atmosphere created they WILL pick up on, before they are old enough to understand the justifications you&amp;#39;ve made for your own refusal to defy him. All they will know is that there is someone in their lives who is allowed to treat them badly and ignore their wishes, and that their father will not protect them from that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6mult", "score_hidden": false, "stickied": false, "created": 1492063038.0, "created_utc": 1492034238.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6xm8f", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "sicera", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "See a psychologist again.\n\nWhat a lot of people do in these situations is create scripts in the case of possible conflict. So, let's say your father wants your family to visit on Easter, but you already have plans with your wife's family. So you practice saying \"We're actually spending the holiday with the in-laws, but we'll see you next week,\" and \"We're not changing our plans.\"\n\nSaying no is difficult, so make it easier on yourself by having a script. Put off saying yes until you're in a less stressful situation. Practice saying \"I'll have to think about it, I'll get back to you.\" If the conflict is too much for you, you're free to leave the situation! Say \"This is getting heated, let's discuss it another time.\" Then hang up or leave.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See a psychologist again.&lt;/p&gt;\n\n&lt;p&gt;What a lot of people do in these situations is create scripts in the case of possible conflict. So, let&amp;#39;s say your father wants your family to visit on Easter, but you already have plans with your wife&amp;#39;s family. So you practice saying &amp;quot;We&amp;#39;re actually spending the holiday with the in-laws, but we&amp;#39;ll see you next week,&amp;quot; and &amp;quot;We&amp;#39;re not changing our plans.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Saying no is difficult, so make it easier on yourself by having a script. Put off saying yes until you&amp;#39;re in a less stressful situation. Practice saying &amp;quot;I&amp;#39;ll have to think about it, I&amp;#39;ll get back to you.&amp;quot; If the conflict is too much for you, you&amp;#39;re free to leave the situation! Say &amp;quot;This is getting heated, let&amp;#39;s discuss it another time.&amp;quot; Then hang up or leave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6xm8f", "score_hidden": false, "stickied": false, "created": 1492076277.0, "created_utc": 1492047477.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg70r1w", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "macimom", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What can I do to establish a normal relationship with my father\n\nYou cant have a healthy relationship with someone who is toxic.\n\n without having to cut ties with him completely? Is that even possible? \n\nNo, its not going to b possible\n\nWhere should I seek help? Continue your therapy until you can clearly see how manipulative your father is and how everything is always all about him.  Then ask your therapist to help you come up with effective ways of forcing your boundaries.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What can I do to establish a normal relationship with my father&lt;/p&gt;\n\n&lt;p&gt;You cant have a healthy relationship with someone who is toxic.&lt;/p&gt;\n\n&lt;p&gt;without having to cut ties with him completely? Is that even possible? &lt;/p&gt;\n\n&lt;p&gt;No, its not going to b possible&lt;/p&gt;\n\n&lt;p&gt;Where should I seek help? Continue your therapy until you can clearly see how manipulative your father is and how everything is always all about him.  Then ask your therapist to help you come up with effective ways of forcing your boundaries.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg70r1w", "score_hidden": false, "stickied": false, "created": 1492080196.0, "created_utc": 1492051396.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg7111j", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NDaveT", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You can't have a normal relationship with this guy. \n\nYou might not have to cut ties completely but you are going to have to severely limit contact. That means not answering the phone when he calls. That means resisting the urge to look at your phone when he sends you a few hundred text messages. \n\nPut your wife first. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can&amp;#39;t have a normal relationship with this guy. &lt;/p&gt;\n\n&lt;p&gt;You might not have to cut ties completely but you are going to have to severely limit contact. That means not answering the phone when he calls. That means resisting the urge to look at your phone when he sends you a few hundred text messages. &lt;/p&gt;\n\n&lt;p&gt;Put your wife first. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7111j", "score_hidden": false, "stickied": false, "created": 1492080559.0, "created_utc": 1492051759.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg783ys", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "TMNT4ME", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your Father is not ruining the relationship between you and your wife. YOU are because you let someone else dictate your life and by extension your wife's and kids lives. You acknowledge that what you are doing is wrong but still can't seem to say NO when this man lives 2 hours away from you. Say NO and turn off your phone if you have to until his petty childish tantrums stop.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your Father is not ruining the relationship between you and your wife. YOU are because you let someone else dictate your life and by extension your wife&amp;#39;s and kids lives. You acknowledge that what you are doing is wrong but still can&amp;#39;t seem to say NO when this man lives 2 hours away from you. Say NO and turn off your phone if you have to until his petty childish tantrums stop.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg783ys", "score_hidden": false, "stickied": false, "created": 1492092067.0, "created_utc": 1492063267.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg7dtpq", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "WelshBluebird1", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This may sound harsh, but it is not your father who is ruining your relationship with your wife. You are. You need to take responsibility for actions like \"I privilege my parents' wishes at the expense of own family\" and \"I choose to avoid conflict with him at all costs\". \n\n&gt;What can I do to establish a normal relationship with my father without having to cut ties with him completely?\n\nYou can't.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This may sound harsh, but it is not your father who is ruining your relationship with your wife. You are. You need to take responsibility for actions like &amp;quot;I privilege my parents&amp;#39; wishes at the expense of own family&amp;quot; and &amp;quot;I choose to avoid conflict with him at all costs&amp;quot;. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What can I do to establish a normal relationship with my father without having to cut ties with him completely?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You can&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7dtpq", "score_hidden": false, "stickied": false, "created": 1492108240.0, "created_utc": 1492079440.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6pqgj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "chloerocks", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hey, so my husband had to go through something similar. He chose to protect his family (me and our children), which was painful. You need to get in to therapy to deal with this and for an outside prospective. But, do you really want your kids to be servants  to your father's manipulation? If for no other reason, try to save them. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, so my husband had to go through something similar. He chose to protect his family (me and our children), which was painful. You need to get in to therapy to deal with this and for an outside prospective. But, do you really want your kids to be servants  to your father&amp;#39;s manipulation? If for no other reason, try to save them. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6pqgj", "score_hidden": false, "stickied": false, "created": 1492066606.0, "created_utc": 1492037806.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg6yek2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "javanator999", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You need to look inside and find some iron in your soul, because you have to tell you dad to shut up and go away. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You need to look inside and find some iron in your soul, because you have to tell you dad to shut up and go away. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6yek2", "score_hidden": false, "stickied": false, "created": 1492077253.0, "created_utc": 1492048453.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg75elb", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "waterproof13", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I really don't want to be an armchair psychologist, but the first thing I thought when I reads that was \" BPD\". I don't even mean that in a pejorative way, just the emotional lability, the anger, fear of abandonment, hints at suicide\n\nThere are some books out there for people dealing with people with BPD, stop walking on eggshells comes to mind. You don't have to sever the relationship, but you do have to learn how to set boundaries. No one can do that for you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really don&amp;#39;t want to be an armchair psychologist, but the first thing I thought when I reads that was &amp;quot; BPD&amp;quot;. I don&amp;#39;t even mean that in a pejorative way, just the emotional lability, the anger, fear of abandonment, hints at suicide&lt;/p&gt;\n\n&lt;p&gt;There are some books out there for people dealing with people with BPD, stop walking on eggshells comes to mind. You don&amp;#39;t have to sever the relationship, but you do have to learn how to set boundaries. No one can do that for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg75elb", "score_hidden": false, "stickied": false, "created": 1492086927.0, "created_utc": 1492058127.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg7dzl5", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Stray_Cat_Strut_Away", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He sounds like a covert/shy type narcissist. Stop feeding into his bullshit. He throws his tantrums to get what he wants and control everyone in his life with his \"poor me! I am a victim!\" act when is extremely selfish.\n\nYou said he is generous and helpful? With a narcissist that's generally to create a sense of obligation. It's just another form of manipulation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He sounds like a covert/shy type narcissist. Stop feeding into his bullshit. He throws his tantrums to get what he wants and control everyone in his life with his &amp;quot;poor me! I am a victim!&amp;quot; act when is extremely selfish.&lt;/p&gt;\n\n&lt;p&gt;You said he is generous and helpful? With a narcissist that&amp;#39;s generally to create a sense of obligation. It&amp;#39;s just another form of manipulation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7dzl5", "score_hidden": false, "stickied": false, "created": 1492108706.0, "created_utc": 1492079906.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_64ztdj", "likes": null, "replies": "", "user_reports": [], "id": "dg7dsbc", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "sadomac", "parent_id": "t3_64ztdj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "A normal relationship require normal people. Your father isn't normal. Get CBT and keep him out of your life until you've learned enough to have a restricted relationship with him (unless you decide on going total NC in the process).", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A normal relationship require normal people. Your father isn&amp;#39;t normal. Get CBT and keep him out of your life until you&amp;#39;ve learned enough to have a restricted relationship with him (unless you decide on going total NC in the process).&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7dsbc", "score_hidden": false, "stickied": false, "created": 1492108126.0, "created_utc": 1492079326.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]