[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Things have been rough in my relationship lately. Financial problems, housing problems, job problems. I&amp;#39;m trying to get through it with my boyfriend of three years, but we have had our fair share of arguments. It seems we do pretty well to move on after these arguments and work together to fix the problems we can fix and live with the ones we can&amp;#39;t. &lt;/p&gt;\n\n&lt;p&gt;I have a laptop that my boyfriend uses frequently. Quite often, I have seen in the internet history that he has gone on Facebook and looked up girls that he has had relationships with in the past. The times that he does this, the dates always match up with times that we have been arguing. This really bothers me, as it makes me feel he is not happy with our relationship and is looking at these other girls because he misses them or would rather be in a relationship with them. He has done this before over the years and I have asked him about it. His answer has always been that he is &amp;quot;curious&amp;quot;. On the one hand, I can kind of get that. People come and go in your life and sometimes you wonder what they&amp;#39;re up to these days. On the other hand, I don&amp;#39;t personally care what my exes are up to so I don&amp;#39;t see the point in looking them up. &lt;/p&gt;\n\n&lt;p&gt;I guess this is particularly bothering me because of how strained things have been lately. I know it sounds petty, jealous, and immature to get upset over him looking at people on Facebook but I just can&amp;#39;t shake the feeling, like I said, that he does this because he is unhappy with us or that he is not over his exes. We hit a bump in the road a couple of years ago and separated briefly. He told me before that, when we were separated, he contacted the girl he had dated prior to me and told her that, when they were together, he felt like they were family and missed that feeling, etc. He still looks that girl up, and it&amp;#39;s hard for me to believe that he is not over her. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think he tries to contact them in any way now, or at least, I haven&amp;#39;t seen any evidence that he does. &lt;/p&gt;\n\n&lt;p&gt;Am I overreacting or am I justified feeling this way?  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Whenever we argue, my boyfriend looks up his exes on Facebook. It makes me feel that he is not happy with us and/or he&amp;#39;s not over these girls. I&amp;#39;ve confronted him about it before and he says he is &amp;quot;curious&amp;quot;, but I just can&amp;#39;t believe that is it.&lt;/p&gt;\n\n&lt;p&gt;Edit: I think I should mention that it is him looking at this one girl in particular that makes me so insecure. About four months into our relationship, he called me and was in tears talking about this girl and how he felt like her and her kids were family and didn&amp;#39;t think I could ever make him feel that way. He said he didn&amp;#39;t think I cared about him and essentially ended the relationship. I spent the entire next day talking to him, trying to show him that I did care about him. In the end, he apologized and said he was having a bad day, that he could see I did care for him. I have tried to &amp;quot;forgive and forget&amp;quot; that incident, but this is the girl I mentioned above, the one he contacted after we actually did split for a couple of months. So now, after he wanted to end our relationship with me because he was thinking about his time with this girl, and him contacting her again, I find it really hard to believe that he is &amp;quot;just curious&amp;quot; about what she is up to when he looks her up.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Things have been rough in my relationship lately. Financial problems, housing problems, job problems. I'm trying to get through it with my boyfriend of three years, but we have had our fair share of arguments. It seems we do pretty well to move on after these arguments and work together to fix the problems we can fix and live with the ones we can't. \n\nI have a laptop that my boyfriend uses frequently. Quite often, I have seen in the internet history that he has gone on Facebook and looked up girls that he has had relationships with in the past. The times that he does this, the dates always match up with times that we have been arguing. This really bothers me, as it makes me feel he is not happy with our relationship and is looking at these other girls because he misses them or would rather be in a relationship with them. He has done this before over the years and I have asked him about it. His answer has always been that he is \"curious\". On the one hand, I can kind of get that. People come and go in your life and sometimes you wonder what they're up to these days. On the other hand, I don't personally care what my exes are up to so I don't see the point in looking them up. \n\nI guess this is particularly bothering me because of how strained things have been lately. I know it sounds petty, jealous, and immature to get upset over him looking at people on Facebook but I just can't shake the feeling, like I said, that he does this because he is unhappy with us or that he is not over his exes. We hit a bump in the road a couple of years ago and separated briefly. He told me before that, when we were separated, he contacted the girl he had dated prior to me and told her that, when they were together, he felt like they were family and missed that feeling, etc. He still looks that girl up, and it's hard for me to believe that he is not over her. \n\nI don't think he tries to contact them in any way now, or at least, I haven't seen any evidence that he does. \n\nAm I overreacting or am I justified feeling this way?  \n  \n  ---   \n  **tl;dr**: Whenever we argue, my boyfriend looks up his exes on Facebook. It makes me feel that he is not happy with us and/or he's not over these girls. I've confronted him about it before and he says he is \"curious\", but I just can't believe that is it.\n\n\nEdit: I think I should mention that it is him looking at this one girl in particular that makes me so insecure. About four months into our relationship, he called me and was in tears talking about this girl and how he felt like her and her kids were family and didn't think I could ever make him feel that way. He said he didn't think I cared about him and essentially ended the relationship. I spent the entire next day talking to him, trying to show him that I did care about him. In the end, he apologized and said he was having a bad day, that he could see I did care for him. I have tried to \"forgive and forget\" that incident, but this is the girl I mentioned above, the one he contacted after we actually did split for a couple of months. So now, after he wanted to end our relationship with me because he was thinking about his time with this girl, and him contacting her again, I find it really hard to believe that he is \"just curious\" about what she is up to when he looks her up.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "6502uo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 73, "report_reasons": null, "author": "altternativeALTacct", "saved": false, "mod_reports": [], "name": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": 1492027030.0, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/6502uo/my_27f_boyfriend_33m_of_three_years_looks_up_his/", "num_reports": null, "locked": false, "stickied": false, "created": 1492051140.0, "url": "https://www.reddit.com/r/relationships/comments/6502uo/my_27f_boyfriend_33m_of_three_years_looks_up_his/", "author_flair_text": null, "quarantine": false, "title": "My [27F] boyfriend [33M] of three years looks up his exes on Facebook when we argue and it makes me feel insecure", "created_utc": 1492022340.0, "distinguished": null, "media": null, "upvote_ratio": 0.87, "num_comments": 26, "visited": false, "subreddit_type": "public", "ups": 73}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg7dkfv", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "lydocia", "parent_id": "t1_dg6by6a", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I understand the curiosity but that curiosity only comes up when I'm bored or when someone I know has mentioned someone I used to know or an ex and I think \"huh, he has a girlfriend?\" or \"what, she has kids now?\"\n\nNot in reaction to having a fight with my SO.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I understand the curiosity but that curiosity only comes up when I&amp;#39;m bored or when someone I know has mentioned someone I used to know or an ex and I think &amp;quot;huh, he has a girlfriend?&amp;quot; or &amp;quot;what, she has kids now?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Not in reaction to having a fight with my SO.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7dkfv", "score_hidden": false, "stickied": false, "created": 1492107473.0, "created_utc": 1492078673.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6by6a", "gilded": 0, "archived": false, "score": 107, "report_reasons": null, "author": "bringbackDiogenes", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What a horrible habit of him to have.  Also the arguing is increasing?\n\n&gt;On the other hand, I don't personally care what my exes are up to so I don't see the point in looking them up.\n\nMe either.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a horrible habit of him to have.  Also the arguing is increasing?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;On the other hand, I don&amp;#39;t personally care what my exes are up to so I don&amp;#39;t see the point in looking them up.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Me either.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6by6a", "score_hidden": false, "stickied": false, "created": 1492051336.0, "created_utc": 1492022536.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 107}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6et37", "gilded": 0, "archived": false, "score": 91, "report_reasons": null, "author": "cyunt", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It sounds like he's trying to keep you on your toes. Like \"See, if you push me, I have all these other options to choose from.\" Not a good look.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like he&amp;#39;s trying to keep you on your toes. Like &amp;quot;See, if you push me, I have all these other options to choose from.&amp;quot; Not a good look.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6et37", "score_hidden": false, "stickied": false, "created": 1492054298.0, "created_utc": 1492025498.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 91}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6bvyz", "gilded": 0, "archived": false, "score": 47, "report_reasons": null, "author": "TheKingOfKolo", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He is not stable guy to be in relationship with. If he is looking at his exes then that just means that he is just looking for an excuse to argue with you so he can \"update\" his life by knowing what is going on with girls that he has already been with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He is not stable guy to be in relationship with. If he is looking at his exes then that just means that he is just looking for an excuse to argue with you so he can &amp;quot;update&amp;quot; his life by knowing what is going on with girls that he has already been with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6bvyz", "score_hidden": false, "stickied": false, "created": 1492051274.0, "created_utc": 1492022474.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 47}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6fmlu", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "NekoNina", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'd buy \"just curious\" if he were looking them up at random times. But the fact that he looks them up at times when you guys are arguing is pretty disturbing. It's like he already has one foot out the door.\n\nAssuming you are deeply committed to keeping this relationship going, it's time for a come to Jesus session with your SO. Sit down, point out the persistent pattern in when he's looking these people up, and tell him how it makes you feel. Make it clear that the \"just curious\" BS isn't going to cut it with you anymore. You two also might want to look into couples counseling to help you develop better tools for communication and stress management as a partnership. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d buy &amp;quot;just curious&amp;quot; if he were looking them up at random times. But the fact that he looks them up at times when you guys are arguing is pretty disturbing. It&amp;#39;s like he already has one foot out the door.&lt;/p&gt;\n\n&lt;p&gt;Assuming you are deeply committed to keeping this relationship going, it&amp;#39;s time for a come to Jesus session with your SO. Sit down, point out the persistent pattern in when he&amp;#39;s looking these people up, and tell him how it makes you feel. Make it clear that the &amp;quot;just curious&amp;quot; BS isn&amp;#39;t going to cut it with you anymore. You two also might want to look into couples counseling to help you develop better tools for communication and stress management as a partnership. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6fmlu", "score_hidden": false, "stickied": false, "created": 1492055134.0, "created_utc": 1492026334.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6eyem", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "squeak93", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He's looking up back up plans during times of stress so that he doesn't have to waste any time should yalls relationship tank. Trust me, if one of your arguments escalates to a breakup he'll be in the first bed that invites him. These aren't the actions of a guy committed to you and a future with you. I feel like you know that. So why accept it? He's a one foot out the door kind of guy. That leads to an unstable, insecure relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s looking up back up plans during times of stress so that he doesn&amp;#39;t have to waste any time should yalls relationship tank. Trust me, if one of your arguments escalates to a breakup he&amp;#39;ll be in the first bed that invites him. These aren&amp;#39;t the actions of a guy committed to you and a future with you. I feel like you know that. So why accept it? He&amp;#39;s a one foot out the door kind of guy. That leads to an unstable, insecure relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6eyem", "score_hidden": false, "stickied": false, "created": 1492054445.0, "created_utc": 1492025645.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 26}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6pjan", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "unsaferaisin", "parent_id": "t1_dg6p1p8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You never know with people.  There was a thread here today by someone who broke up with a long-term partner five years ago, and just cried about it for the first time out of fear they would never find someone as good as her.  So I guess if he never sat down for a little navel-gaze, or if he's been hopping from one relationship to the next without any real breaks to think things over, it's possible.  Only one way to know what's up for sure, though, and that's for them to talk it out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You never know with people.  There was a thread here today by someone who broke up with a long-term partner five years ago, and just cried about it for the first time out of fear they would never find someone as good as her.  So I guess if he never sat down for a little navel-gaze, or if he&amp;#39;s been hopping from one relationship to the next without any real breaks to think things over, it&amp;#39;s possible.  Only one way to know what&amp;#39;s up for sure, though, and that&amp;#39;s for them to talk it out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6pjan", "score_hidden": false, "stickied": false, "created": 1492066362.0, "created_utc": 1492037562.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6p1p8", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "IvainFirelord", "parent_id": "t1_dg6osey", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That's certainly true. If I have the timeline right, that was a little over 2.5 years ago, though....one would hope that he has made some progress since then, but perhaps not. Either way, they need to have a chat and figure some stuff out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s certainly true. If I have the timeline right, that was a little over 2.5 years ago, though....one would hope that he has made some progress since then, but perhaps not. Either way, they need to have a chat and figure some stuff out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6p1p8", "score_hidden": false, "stickied": false, "created": 1492065763.0, "created_utc": 1492036963.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6osey", "gilded": 0, "archived": false, "score": 26, "report_reasons": null, "author": "unsaferaisin", "parent_id": "t1_dg6ff2j", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Also, the way that he called her up, bawling, about how some ex made him feel like family and he didn't think OP could?  That does not go well with the pattern of looking them up, visibly, after arguments.  He seems, in the most benign possible interpretation, not to be ready to be dating.  This just doesn't strike me as the behavior of someone who has moved on, and who has really thought about what he wants in a relationship.  Seems like he could use a good long stretch of being single and going to therapy before he tries to be with anyone again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, the way that he called her up, bawling, about how some ex made him feel like family and he didn&amp;#39;t think OP could?  That does not go well with the pattern of looking them up, visibly, after arguments.  He seems, in the most benign possible interpretation, not to be ready to be dating.  This just doesn&amp;#39;t strike me as the behavior of someone who has moved on, and who has really thought about what he wants in a relationship.  Seems like he could use a good long stretch of being single and going to therapy before he tries to be with anyone again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6osey", "score_hidden": false, "stickied": false, "created": 1492065454.0, "created_utc": 1492036654.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 26}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6ff2j", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "IvainFirelord", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "As jarring and unsettling as it is to have witnessed as his girlfriend, I don't think looking up exes on Facebook after arguments is prima facie terrible behavior, though it could definitely indicate that he's a little unsatisfied in the relationship and passively wondering if he would have had it better with someone else. *But*, if he's deliberately doing it on your computer *so that you'll see it*, that's completely different and really bad.\n\nPersonally, I would just say \"Hey OP's boyfriend, I was looking in my internet history to find x and saw that you'd spent a lot of time looking up your exes on Facebook around the time that we argued last. Are you feeling uncomfortable with our relationship?\" and see how he responds. The less accusatory it is, the better, because you're more likely to get a real answer. I would make clear that you're concerned that he's unhappy in the relationship and not that he's actually intending to go back to these girls, which I kinda doubt he is.\n\nIf you end up understanding that he's doing it so that you'll see it in order to manipulate you, run far, far away and never look back.\n\nAside from that, assuming the best case, your boyfriend should be concerned with making you feel loved and wanted, which (shocker) likely doesn't go well with putting his exes in your browsing history. Even if these things are understandable as private thoughts, once they reach the world of expressed and recorded ideas (even as browsing history), they become something more disturbing for you than just idle, unexpressed thoughts. Your boyfriend should be made to understand that it is not acceptable for him to bring his exes into your current relationship in any form unless they are actually topically relevant.\n\ntl;dr--this may be a tell of some kind of relational issue, but not necessarily what you fear. If he was actually thinking of cheating, he likely wouldn't be so obvious about it, for one.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As jarring and unsettling as it is to have witnessed as his girlfriend, I don&amp;#39;t think looking up exes on Facebook after arguments is prima facie terrible behavior, though it could definitely indicate that he&amp;#39;s a little unsatisfied in the relationship and passively wondering if he would have had it better with someone else. &lt;em&gt;But&lt;/em&gt;, if he&amp;#39;s deliberately doing it on your computer &lt;em&gt;so that you&amp;#39;ll see it&lt;/em&gt;, that&amp;#39;s completely different and really bad.&lt;/p&gt;\n\n&lt;p&gt;Personally, I would just say &amp;quot;Hey OP&amp;#39;s boyfriend, I was looking in my internet history to find x and saw that you&amp;#39;d spent a lot of time looking up your exes on Facebook around the time that we argued last. Are you feeling uncomfortable with our relationship?&amp;quot; and see how he responds. The less accusatory it is, the better, because you&amp;#39;re more likely to get a real answer. I would make clear that you&amp;#39;re concerned that he&amp;#39;s unhappy in the relationship and not that he&amp;#39;s actually intending to go back to these girls, which I kinda doubt he is.&lt;/p&gt;\n\n&lt;p&gt;If you end up understanding that he&amp;#39;s doing it so that you&amp;#39;ll see it in order to manipulate you, run far, far away and never look back.&lt;/p&gt;\n\n&lt;p&gt;Aside from that, assuming the best case, your boyfriend should be concerned with making you feel loved and wanted, which (shocker) likely doesn&amp;#39;t go well with putting his exes in your browsing history. Even if these things are understandable as private thoughts, once they reach the world of expressed and recorded ideas (even as browsing history), they become something more disturbing for you than just idle, unexpressed thoughts. Your boyfriend should be made to understand that it is not acceptable for him to bring his exes into your current relationship in any form unless they are actually topically relevant.&lt;/p&gt;\n\n&lt;p&gt;tl;dr--this may be a tell of some kind of relational issue, but not necessarily what you fear. If he was actually thinking of cheating, he likely wouldn&amp;#39;t be so obvious about it, for one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6ff2j", "score_hidden": false, "stickied": false, "created": 1492054920.0, "created_utc": 1492026120.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg79n4i", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "frotterdammerung", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I sometimes read job ads when my job annoys me. Not really intending to follow through. But I don't do it on my boss's laptop! \n\nHe's either inconsiderate and self-centred (if he doesn't care if you see it), childish and manipulative (if he wants you to see it), or actively planning his exit from the relationship and too much of an asshole to hide it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sometimes read job ads when my job annoys me. Not really intending to follow through. But I don&amp;#39;t do it on my boss&amp;#39;s laptop! &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s either inconsiderate and self-centred (if he doesn&amp;#39;t care if you see it), childish and manipulative (if he wants you to see it), or actively planning his exit from the relationship and too much of an asshole to hide it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg79n4i", "score_hidden": false, "stickied": false, "created": 1492095870.0, "created_utc": 1492067070.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6fo25", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "lick_me_where_I_fart", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It might not mean that he's not over them, however it is weird.  I think it's normal to check and see what your ex's are up to once in a while, but there's definitely a line there where it becomes something else.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might not mean that he&amp;#39;s not over them, however it is weird.  I think it&amp;#39;s normal to check and see what your ex&amp;#39;s are up to once in a while, but there&amp;#39;s definitely a line there where it becomes something else.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6fo25", "score_hidden": false, "stickied": false, "created": 1492055175.0, "created_utc": 1492026375.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg7d0ax", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "gobluecar", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It sounds like the fights stem from your own insecurities and anxiety (just an observation; I have no idea). I dealt with this from the first few weeks of my past relationship up until the end (almost 3 years). The first time she went through my history, she acted like it was a normal thing to do. No, it's not normal and it made me feel violated. Did she find me looking up exes? Yes. A couple google searches sandwiched between ESPN and music websites. What's scary is that thoughts can become traceable events. Idk if he would ever act upon those (I never did nor wanted to) but social media drove us apart. It's so dumb how something so trivial is effectively ending relationships. It breeds jealousy, hatred, insecurity and above all, there was a time when it didn't exist! \n\nPerhaps try deleting your accounts together. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like the fights stem from your own insecurities and anxiety (just an observation; I have no idea). I dealt with this from the first few weeks of my past relationship up until the end (almost 3 years). The first time she went through my history, she acted like it was a normal thing to do. No, it&amp;#39;s not normal and it made me feel violated. Did she find me looking up exes? Yes. A couple google searches sandwiched between ESPN and music websites. What&amp;#39;s scary is that thoughts can become traceable events. Idk if he would ever act upon those (I never did nor wanted to) but social media drove us apart. It&amp;#39;s so dumb how something so trivial is effectively ending relationships. It breeds jealousy, hatred, insecurity and above all, there was a time when it didn&amp;#39;t exist! &lt;/p&gt;\n\n&lt;p&gt;Perhaps try deleting your accounts together. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7d0ax", "score_hidden": false, "stickied": false, "created": 1492105798.0, "created_utc": 1492076998.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6h124", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "i_shall_remain_inviz", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "As to your edit. This is the same what if pattern of thought that can be detrimental. Its fair to ask him about her in a non accusatory way, however don't make assumptions and connect dots that you have no way of knowing. \n\nPeople can and often do care abt multiple people at once. Trust that he is with you becuase he cares about you. You can never change the way he feels about her or you in any way. You can only make yourself better by refusing to live insecurely and with anxiety. \n\nI PROMISE if you are confident in your relationship with him, subconsciously it will draw him closer to you. So what if he may or may not care abt her. He's with you and as long as he's not pursuing anything with her, or doing strange obsessive things (idk what even, but not this) then he's just a human like you with feelings he is working through. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As to your edit. This is the same what if pattern of thought that can be detrimental. Its fair to ask him about her in a non accusatory way, however don&amp;#39;t make assumptions and connect dots that you have no way of knowing. &lt;/p&gt;\n\n&lt;p&gt;People can and often do care abt multiple people at once. Trust that he is with you becuase he cares about you. You can never change the way he feels about her or you in any way. You can only make yourself better by refusing to live insecurely and with anxiety. &lt;/p&gt;\n\n&lt;p&gt;I PROMISE if you are confident in your relationship with him, subconsciously it will draw him closer to you. So what if he may or may not care abt her. He&amp;#39;s with you and as long as he&amp;#39;s not pursuing anything with her, or doing strange obsessive things (idk what even, but not this) then he&amp;#39;s just a human like you with feelings he is working through. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6h124", "score_hidden": false, "stickied": false, "created": 1492056565.0, "created_utc": 1492027765.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg7f264", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "pstrocek", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If he's just looking, that would be fine. But. Do you think he's looking them up on your laptop and leaves it in the browser history to make you insecure so you start \"trying to show you care about him\"? That would be a big deal, because that would be manipulative behaviour. I know it's hard to look, but could you make a habit of deleting all browser history without looking at it everytime you use the laptop? It's quite possible that seeing that girl's facebook on the history is making you to unknowingly behave in a certain way and your boyfriend is somehow trying to provoke this reaction after each argument. If you stop looking, he won't get what he wants anymore  and you'll see what it does with him. If he's normal, then he simply looks at her facebook just for himself, which is his problem as long as he doesn't cheat on you. I'd test this out for at least a few weeks and see what he does. If he starts claiming you don't love him anymore or starts talking about his ex(es), then bring the whole browser history thing up and ask him if he did it on purpose to make you jealous.\n\nAlternative explanation is that he doesn't miss (just) the ex. You say she has kids. If he was with her for a long time, I think he's gotten attached to them and still feels some fatherly love. This can kinda suck, because if you get attached to kids you are unrelated to and then break up with their parent, there is usually no way in hell to stay in contact with them, especially if they are very young. Parental feelings are some strong stuff. I can totally see him looking at her facebook to see how much has little Timmy grown and to check if he still likes dinosaurs.\n\nOtherwise, focus on the relationship you have with him instead of worrying about the relationship he no longer has with his ex. I get it's hard, but being jealous takes joy from the things you have and may destroy good things.\n\nIt seems like you are going through a tough part of your lives. It's hard to make time for relaxation and mental hygiene, but try to do something that helps you calm down for a few minutes every day. Like meditating, going for a walk, listening to your favorite songs. Maybe plan a little inexpensive reward for the weekend, so you have something nice to look forward during work week. It won't make the problems you have easier, but it will give you a bit more resilience while you deal with them. Don't let these difficult times to defeat you.\n\nGood luck and take care.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If he&amp;#39;s just looking, that would be fine. But. Do you think he&amp;#39;s looking them up on your laptop and leaves it in the browser history to make you insecure so you start &amp;quot;trying to show you care about him&amp;quot;? That would be a big deal, because that would be manipulative behaviour. I know it&amp;#39;s hard to look, but could you make a habit of deleting all browser history without looking at it everytime you use the laptop? It&amp;#39;s quite possible that seeing that girl&amp;#39;s facebook on the history is making you to unknowingly behave in a certain way and your boyfriend is somehow trying to provoke this reaction after each argument. If you stop looking, he won&amp;#39;t get what he wants anymore  and you&amp;#39;ll see what it does with him. If he&amp;#39;s normal, then he simply looks at her facebook just for himself, which is his problem as long as he doesn&amp;#39;t cheat on you. I&amp;#39;d test this out for at least a few weeks and see what he does. If he starts claiming you don&amp;#39;t love him anymore or starts talking about his ex(es), then bring the whole browser history thing up and ask him if he did it on purpose to make you jealous.&lt;/p&gt;\n\n&lt;p&gt;Alternative explanation is that he doesn&amp;#39;t miss (just) the ex. You say she has kids. If he was with her for a long time, I think he&amp;#39;s gotten attached to them and still feels some fatherly love. This can kinda suck, because if you get attached to kids you are unrelated to and then break up with their parent, there is usually no way in hell to stay in contact with them, especially if they are very young. Parental feelings are some strong stuff. I can totally see him looking at her facebook to see how much has little Timmy grown and to check if he still likes dinosaurs.&lt;/p&gt;\n\n&lt;p&gt;Otherwise, focus on the relationship you have with him instead of worrying about the relationship he no longer has with his ex. I get it&amp;#39;s hard, but being jealous takes joy from the things you have and may destroy good things.&lt;/p&gt;\n\n&lt;p&gt;It seems like you are going through a tough part of your lives. It&amp;#39;s hard to make time for relaxation and mental hygiene, but try to do something that helps you calm down for a few minutes every day. Like meditating, going for a walk, listening to your favorite songs. Maybe plan a little inexpensive reward for the weekend, so you have something nice to look forward during work week. It won&amp;#39;t make the problems you have easier, but it will give you a bit more resilience while you deal with them. Don&amp;#39;t let these difficult times to defeat you.&lt;/p&gt;\n\n&lt;p&gt;Good luck and take care.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7f264", "score_hidden": false, "stickied": false, "created": 1492111478.0, "created_utc": 1492082678.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6gb2z", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "i_shall_remain_inviz", "parent_id": "t1_dg6e8us", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I actually was the guy in this exact scenario. I literally did it occasionally and mindlessly and it happened to coincide with tension and or fights. It was not wise, but also there need to be barriers, because things can be totally misconstrued and cause an alarming amount of unwarranted stress and strain on a relationship. These things are more often than not harmless and nothing was ever meant by them. \n\nTo give you insight. I likely did this because of some feeling of doubt after a fight or stress. However it was absolutely never with an intention of seeking them out. Relationships wain and swing in different directions. Rely on the love you have for him to get you through any insecurities you have. Its IMO the most powerful emotion in the world and can get you through the toughest times if you let it. If you exhibit loving behavior consistently with yourself and your relationship. Those fights will happen less and less and viola! now there isnt even an issue. \n\nDo what you can to alleviate your own insecurities and you will be a better person for it. You cannot change him. You can only change yourself.\n\nI would suggest not allowing yourself to go there. resist the urge to snoop or wonder, what if scenarios. I made these mistakes and it lead to more problems rather than solving any. \n\nHope this helps some. Advice is tricky. Its much easier said than followed. take the parts that most apply and use them accordingly", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually was the guy in this exact scenario. I literally did it occasionally and mindlessly and it happened to coincide with tension and or fights. It was not wise, but also there need to be barriers, because things can be totally misconstrued and cause an alarming amount of unwarranted stress and strain on a relationship. These things are more often than not harmless and nothing was ever meant by them. &lt;/p&gt;\n\n&lt;p&gt;To give you insight. I likely did this because of some feeling of doubt after a fight or stress. However it was absolutely never with an intention of seeking them out. Relationships wain and swing in different directions. Rely on the love you have for him to get you through any insecurities you have. Its IMO the most powerful emotion in the world and can get you through the toughest times if you let it. If you exhibit loving behavior consistently with yourself and your relationship. Those fights will happen less and less and viola! now there isnt even an issue. &lt;/p&gt;\n\n&lt;p&gt;Do what you can to alleviate your own insecurities and you will be a better person for it. You cannot change him. You can only change yourself.&lt;/p&gt;\n\n&lt;p&gt;I would suggest not allowing yourself to go there. resist the urge to snoop or wonder, what if scenarios. I made these mistakes and it lead to more problems rather than solving any. &lt;/p&gt;\n\n&lt;p&gt;Hope this helps some. Advice is tricky. Its much easier said than followed. take the parts that most apply and use them accordingly&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6gb2z", "score_hidden": false, "stickied": false, "created": 1492055822.0, "created_utc": 1492027022.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg6jfm2", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "RuDeeCantFail", "parent_id": "t1_dg6hbj1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ahh.  I am a painfully curious person.  Even ex BFs who sucked I want to look up and then find things that are wrong with their life.  And if they seem to be happy in a relationship I'm like 95% \"oh good I'm glad that they seem to have worked through their issues\" and like 5% \"wow at least his hair looks really terrible my BF is so much hotter.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ahh.  I am a painfully curious person.  Even ex BFs who sucked I want to look up and then find things that are wrong with their life.  And if they seem to be happy in a relationship I&amp;#39;m like 95% &amp;quot;oh good I&amp;#39;m glad that they seem to have worked through their issues&amp;quot; and like 5% &amp;quot;wow at least his hair looks really terrible my BF is so much hotter.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6jfm2", "score_hidden": false, "stickied": false, "created": 1492059064.0, "created_utc": 1492030264.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6hbj1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "altternativeALTacct", "parent_id": "t1_dg6fkas", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks for the different point of view. I suppose I have trouble understanding why he would bother. In my own experience, the men I've dated have turned out to be rather unpleasant (hence the reason I didn't stick around), so I'd rather just pretend they don't exist.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the different point of view. I suppose I have trouble understanding why he would bother. In my own experience, the men I&amp;#39;ve dated have turned out to be rather unpleasant (hence the reason I didn&amp;#39;t stick around), so I&amp;#39;d rather just pretend they don&amp;#39;t exist.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6hbj1", "score_hidden": false, "stickied": false, "created": 1492056866.0, "created_utc": 1492028066.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6fkas", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "RuDeeCantFail", "parent_id": "t1_dg6e8us", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I guess, but logically speaking it seems pretty unlikely that he's hung up on a bunch of exes but only thinks about that fact when you argue.  Seems a lot more likely that tense times with you remind him of tense times with them so they're on his mind.\n\nJust ask him to use incognito mode so you don't have to see it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess, but logically speaking it seems pretty unlikely that he&amp;#39;s hung up on a bunch of exes but only thinks about that fact when you argue.  Seems a lot more likely that tense times with you remind him of tense times with them so they&amp;#39;re on his mind.&lt;/p&gt;\n\n&lt;p&gt;Just ask him to use incognito mode so you don&amp;#39;t have to see it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6fkas", "score_hidden": false, "stickied": false, "created": 1492055068.0, "created_utc": 1492026268.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6e8us", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "altternativeALTacct", "parent_id": "t1_dg6dj1e", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Right, but I'm not asking about you and your personal hobbies. I'm talking about someone who does this during times when our relationship is strained. If it was just randomly looking people up, it wouldn't raise any concerns, but when it's like \"argue with girlfriend, well, guess I'll go look up my exes\", that seems like a bit of a different scenario.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Right, but I&amp;#39;m not asking about you and your personal hobbies. I&amp;#39;m talking about someone who does this during times when our relationship is strained. If it was just randomly looking people up, it wouldn&amp;#39;t raise any concerns, but when it&amp;#39;s like &amp;quot;argue with girlfriend, well, guess I&amp;#39;ll go look up my exes&amp;quot;, that seems like a bit of a different scenario.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6e8us", "score_hidden": false, "stickied": false, "created": 1492053715.0, "created_utc": 1492024915.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dj1e", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "RuDeeCantFail", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Uhhh I look up my exes on facebook all the time.  I don't miss them.  There isn't a single one of them who I would consider dating again even if I were single.  I'm just fascinated by the lives of people with whom I was once very close who I now don't hear about unless I go looking.\n\nI also look up former close friends and housemates who I don't see anymore for the same reason.\n\nAlso a very petty part of me wants to discover that the exes who were kinda jerks to me by the end were just dumped or got terrible haircuts or something dumb like that.  I dunno, it's just a strong impulse to know what they're up to.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Uhhh I look up my exes on facebook all the time.  I don&amp;#39;t miss them.  There isn&amp;#39;t a single one of them who I would consider dating again even if I were single.  I&amp;#39;m just fascinated by the lives of people with whom I was once very close who I now don&amp;#39;t hear about unless I go looking.&lt;/p&gt;\n\n&lt;p&gt;I also look up former close friends and housemates who I don&amp;#39;t see anymore for the same reason.&lt;/p&gt;\n\n&lt;p&gt;Also a very petty part of me wants to discover that the exes who were kinda jerks to me by the end were just dumped or got terrible haircuts or something dumb like that.  I dunno, it&amp;#39;s just a strong impulse to know what they&amp;#39;re up to.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6dj1e", "score_hidden": false, "stickied": false, "created": 1492052979.0, "created_utc": 1492024179.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_6502uo", "likes": null, "replies": "", "user_reports": [], "id": "dg7eph1", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "Brontosaurus_Bukkake", "parent_id": "t1_dg6h1hr", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He might just not care if you see because to him it wasn't doing anything of significance and you're the one making it a bigger deal by assuming bad motives on his part. It also seems that most of the replies to you that try to give alternative explanations are met with hostility and defensiveness from you that is pretty unwarranted in context. That says a lot more than anything you've described him doing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He might just not care if you see because to him it wasn&amp;#39;t doing anything of significance and you&amp;#39;re the one making it a bigger deal by assuming bad motives on his part. It also seems that most of the replies to you that try to give alternative explanations are met with hostility and defensiveness from you that is pretty unwarranted in context. That says a lot more than anything you&amp;#39;ve described him doing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7eph1", "score_hidden": false, "stickied": false, "created": 1492110641.0, "created_utc": 1492081841.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 0}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6h1hr", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "altternativeALTacct", "parent_id": "t1_dg6gmun", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm not saying he does it every time we fight. I'm saying the times I have noticed it, the dates match up with times when things have been tense. \n\nRegardless, I have every right to look at browsing history on my own computer. If he's looking at things he doesn't want me to see, he can clear the history, go incognito, or use the desktop.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not saying he does it every time we fight. I&amp;#39;m saying the times I have noticed it, the dates match up with times when things have been tense. &lt;/p&gt;\n\n&lt;p&gt;Regardless, I have every right to look at browsing history on my own computer. If he&amp;#39;s looking at things he doesn&amp;#39;t want me to see, he can clear the history, go incognito, or use the desktop.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6h1hr", "score_hidden": false, "stickied": false, "created": 1492056578.0, "created_utc": 1492027778.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6gmun", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Eagpt", "parent_id": "t1_dg6dqhl", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "But if you're tracking it to everytime you have a fight he does this, then it's more than you looking to see where you found a great price on shoes", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But if you&amp;#39;re tracking it to everytime you have a fight he does this, then it&amp;#39;s more than you looking to see where you found a great price on shoes&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6gmun", "score_hidden": false, "stickied": false, "created": 1492056160.0, "created_utc": 1492027360.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dqhl", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "altternativeALTacct", "parent_id": "t1_dg6dd6h", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He uses my computer. I frequently go through my own history to find things I want to revisit. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He uses my computer. I frequently go through my own history to find things I want to revisit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6dqhl", "score_hidden": false, "stickied": false, "created": 1492053189.0, "created_utc": 1492024389.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg6dd6h", "gilded": 0, "archived": false, "score": -2, "report_reasons": null, "author": "Eagpt", "parent_id": "t3_6502uo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Of course that's hurtful but it would never occur to me to study my SO internet history.  That screams intrusive to me.  If he says he's curious, why isn't that enough? My SO and I have actually looked up exes together.  It wasn't a big deal and lead to sharing some interesting stories.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course that&amp;#39;s hurtful but it would never occur to me to study my SO internet history.  That screams intrusive to me.  If he says he&amp;#39;s curious, why isn&amp;#39;t that enough? My SO and I have actually looked up exes together.  It wasn&amp;#39;t a big deal and lead to sharing some interesting stories.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg6dd6h", "score_hidden": false, "stickied": false, "created": 1492052810.0, "created_utc": 1492024010.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -2}}], "after": null, "before": null}}]