[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Me - Luca\nFiance - John\nFiance&amp;#39;s friend - Vicky\nFiance&amp;#39;s friend&amp;#39;s husband - Ralph&lt;/p&gt;\n\n&lt;p&gt;So now that that&amp;#39;s out of the way. let me elaborate on the situation. I met John in college and we were friends for a bit. I was a transfer student so I didn&amp;#39;t have many friends, and John introduced me to his friends which included Vicky and Ralph. Everyone was really nice to me at first and we all became a really close-knit group. &lt;/p&gt;\n\n&lt;p&gt;At this point John was considering himself straight, and in a sense he still does. But for whatever reason he found himself attracted to me and I liked him back, so we started dating. Vicky was really enthusiastic about our relationship and kept calling us &amp;quot;the cute gay couple&amp;quot; etc, which was nice at first but it soon got slightly offensive. It felt like she was somehow fetishizing our relationship by constantly calling it &amp;quot;cute,&amp;quot; making comments about how &amp;quot;cute guys dating is hot,&amp;quot; and asking very intimate and personal questions about our sex life. One day I had enough and very politely asked if she could tone it down, and she immediately became enraged and left. She hasn&amp;#39;t talked to me since then, and I was honestly fine with it.&lt;/p&gt;\n\n&lt;p&gt;She was still friends with John, and I was okay with this as well because they&amp;#39;d been friends for far longer than I&amp;#39;ve known John. But John started complaining about how whenever Vicky talked to him, she would always trash talk me even when he told her to stop. He showed me her messages and she said some really disgusting stuff like &amp;quot;you used to be such a nice guy, but Luca is turning you into just another obnoxious f&lt;em&gt;g,&amp;quot; &amp;quot;Luca is such a b&lt;/em&gt;tch, he&amp;#39;s so girly and weak, he might as just get a sex change and be a normal girl,&amp;quot; &amp;quot;can&amp;#39;t you see that Luca is just using you because gays like corrupting straight guys? he&amp;#39;s so manipulative and abusive&amp;quot; etc etc. Every time John shut her down, she&amp;#39;d just apologize and say she was &amp;quot;drunk&amp;quot; or &amp;quot;just frustrated&amp;quot; because they used to be really close but suddenly John was only hanging out with me and not with her. &lt;/p&gt;\n\n&lt;p&gt;I was understandably really upset and asked John to stop talking to her. I know that this might have been extreme, but I was just incredibly offended and felt disgusted that she&amp;#39;d say these things about me for no other reason than me very gently telling her to tone it down. John just kept saying &amp;quot;oh she has borderline personality disorder, she&amp;#39;s just having a bad day, I don&amp;#39;t even read her messages anymore and she just vents in my inbox&amp;quot; and stuff, and even though I was very upset I just stopped talking about it. Eventually when Vicky got married to Ralph and said she would only invite John if he didn&amp;#39;t bring me, John got fed up and blocked her. &lt;/p&gt;\n\n&lt;p&gt;This didn&amp;#39;t really do much because Vicky simply started making fake email accounts and kept sending John horrible emails. There was the usual &amp;quot;Luca is shit&amp;quot; emails, but there were also some really creepy and obsessive ones like &amp;quot;you&amp;#39;re supposed to be MY soulmate not his,&amp;quot; &amp;quot;Ralph is just a little boy compared to you, a REAL MAN,&amp;quot; &amp;quot;one day you&amp;#39;ll understand that I&amp;#39;M the only one who truly understands you and wants the best for you&amp;quot; etc. She even photoshopped my face onto some pretty extreme gay porn and sent it to him (we got a good nervous laugh out of those) with captions like &amp;quot;have fun with your f&lt;em&gt;g sl&lt;/em&gt;t&amp;quot;. I got some really bad horror-movie vibes from these and asked John if he had anything to tell me. &lt;/p&gt;\n\n&lt;p&gt;He confessed that before we met, Vicky had gotten drunk one night and came to his apartment barely able to stand. When he let her in and was about to call Ralph, she said that she and Ralph had broken up and begged him to hook up with her &amp;quot;to ease the pain.&amp;quot; They fooled around for a bit but it just didn&amp;#39;t feel right to John, so he shut it down and slept on the couch while she passed out on his bed. The next morning Vicky left his apartment and he found out that she and Ralph hadn&amp;#39;t broken up, he was just out of town. He had contemplated telling Ralph what had happened, but didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;So now John is getting these horrible emails on a near daily basis. When he blocks one email address, another one comes up. He says he doesn&amp;#39;t want to call the police because Vicky is erratic and unpredictable, and he doesn&amp;#39;t trust the police to handle her nonviolently (he says with certain conviction that he wouldn&amp;#39;t put it past her to bum rush a cop and get shot). I&amp;#39;ve suggested contacting Ralph and asking him to tell Vicky to stop, but obviously this would probably destroy their relationship. What do we do?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Fiance messed around with a female friend a long time ago, now she&amp;#39;s obsessed with him and keeps trying to ruin our relationship. She&amp;#39;s too unpredictable to call the cops, and alerting her husband would ruin their marriage. I have no idea what to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Me - Luca\nFiance - John\nFiance's friend - Vicky\nFiance's friend's husband - Ralph\n\nSo now that that's out of the way. let me elaborate on the situation. I met John in college and we were friends for a bit. I was a transfer student so I didn't have many friends, and John introduced me to his friends which included Vicky and Ralph. Everyone was really nice to me at first and we all became a really close-knit group. \n\nAt this point John was considering himself straight, and in a sense he still does. But for whatever reason he found himself attracted to me and I liked him back, so we started dating. Vicky was really enthusiastic about our relationship and kept calling us \"the cute gay couple\" etc, which was nice at first but it soon got slightly offensive. It felt like she was somehow fetishizing our relationship by constantly calling it \"cute,\" making comments about how \"cute guys dating is hot,\" and asking very intimate and personal questions about our sex life. One day I had enough and very politely asked if she could tone it down, and she immediately became enraged and left. She hasn't talked to me since then, and I was honestly fine with it.\n\nShe was still friends with John, and I was okay with this as well because they'd been friends for far longer than I've known John. But John started complaining about how whenever Vicky talked to him, she would always trash talk me even when he told her to stop. He showed me her messages and she said some really disgusting stuff like \"you used to be such a nice guy, but Luca is turning you into just another obnoxious f*g,\" \"Luca is such a b*tch, he's so girly and weak, he might as just get a sex change and be a normal girl,\" \"can't you see that Luca is just using you because gays like corrupting straight guys? he's so manipulative and abusive\" etc etc. Every time John shut her down, she'd just apologize and say she was \"drunk\" or \"just frustrated\" because they used to be really close but suddenly John was only hanging out with me and not with her. \n\nI was understandably really upset and asked John to stop talking to her. I know that this might have been extreme, but I was just incredibly offended and felt disgusted that she'd say these things about me for no other reason than me very gently telling her to tone it down. John just kept saying \"oh she has borderline personality disorder, she's just having a bad day, I don't even read her messages anymore and she just vents in my inbox\" and stuff, and even though I was very upset I just stopped talking about it. Eventually when Vicky got married to Ralph and said she would only invite John if he didn't bring me, John got fed up and blocked her. \n\nThis didn't really do much because Vicky simply started making fake email accounts and kept sending John horrible emails. There was the usual \"Luca is shit\" emails, but there were also some really creepy and obsessive ones like \"you're supposed to be MY soulmate not his,\" \"Ralph is just a little boy compared to you, a REAL MAN,\" \"one day you'll understand that I'M the only one who truly understands you and wants the best for you\" etc. She even photoshopped my face onto some pretty extreme gay porn and sent it to him (we got a good nervous laugh out of those) with captions like \"have fun with your f*g sl*t\". I got some really bad horror-movie vibes from these and asked John if he had anything to tell me. \n\nHe confessed that before we met, Vicky had gotten drunk one night and came to his apartment barely able to stand. When he let her in and was about to call Ralph, she said that she and Ralph had broken up and begged him to hook up with her \"to ease the pain.\" They fooled around for a bit but it just didn't feel right to John, so he shut it down and slept on the couch while she passed out on his bed. The next morning Vicky left his apartment and he found out that she and Ralph hadn't broken up, he was just out of town. He had contemplated telling Ralph what had happened, but didn't.\n\nSo now John is getting these horrible emails on a near daily basis. When he blocks one email address, another one comes up. He says he doesn't want to call the police because Vicky is erratic and unpredictable, and he doesn't trust the police to handle her nonviolently (he says with certain conviction that he wouldn't put it past her to bum rush a cop and get shot). I've suggested contacting Ralph and asking him to tell Vicky to stop, but obviously this would probably destroy their relationship. What do we do?\n  \n  ---   \n  **tl;dr**: Fiance messed around with a female friend a long time ago, now she's obsessed with him and keeps trying to ruin our relationship. She's too unpredictable to call the cops, and alerting her husband would ruin their marriage. I have no idea what to do.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Non-Romantic", "id": "656qlx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 79, "report_reasons": null, "author": "annoyed_gay_guy", "saved": false, "mod_reports": [], "name": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-gn misc", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/656qlx/me_25_m_with_my_fiance_25_m_4_years_his_friend/", "num_reports": null, "locked": false, "stickied": false, "created": 1492131495.0, "url": "https://www.reddit.com/r/relationships/comments/656qlx/me_25_m_with_my_fiance_25_m_4_years_his_friend/", "author_flair_text": null, "quarantine": false, "title": "Me [25 M] with my fiance [25 M] 4 years, his friend keeps trying to destroy our relationship", "created_utc": 1492102695.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 26, "visited": false, "subreddit_type": "public", "ups": 79}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg7wmer", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "bugsdoingthings", "parent_id": "t1_dg7vzjs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I can't vouch for this from personal experience, but you might try contacting RAINN. Stalking falls under the umbrella of things they offer help with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t vouch for this from personal experience, but you might try contacting RAINN. Stalking falls under the umbrella of things they offer help with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7wmer", "score_hidden": false, "stickied": false, "created": 1492133781.0, "created_utc": 1492104981.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg80f07", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "dorothy_zbornak_esq", "parent_id": "t1_dg7vzjs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "An attorney specializing in domestic violence or a rape crisis center. You may also be able to get help or referrals from organizations focused on queer health. Unfortunately stalking and discriminatory violence are common problems for LGBTQIA people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;An attorney specializing in domestic violence or a rape crisis center. You may also be able to get help or referrals from organizations focused on queer health. Unfortunately stalking and discriminatory violence are common problems for LGBTQIA people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg80f07", "score_hidden": false, "stickied": false, "created": 1492137818.0, "created_utc": 1492109018.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg8hq5v", "gilded": 0, "archived": false, "score": 30, "report_reasons": null, "author": "Massiveshaqtack", "parent_id": "t1_dg7vzjs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Please do not use police brutality as an excuse to simply 'avoid causing drama' - if that is why you're worried. Not all law enforcement will act out in violence and unprofessionalism. This is for your safety as well as your partner's.\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please do not use police brutality as an excuse to simply &amp;#39;avoid causing drama&amp;#39; - if that is why you&amp;#39;re worried. Not all law enforcement will act out in violence and unprofessionalism. This is for your safety as well as your partner&amp;#39;s.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8hq5v", "score_hidden": false, "stickied": false, "created": 1492158877.0, "created_utc": 1492130077.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 30}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7vzjs", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "annoyed_gay_guy", "parent_id": "t1_dg7uog3", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Other than the police, who else can I call? If things really go south I'm not above calling the cops on her, but I'd really like to keep things safe considering the track record of police brutality.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Other than the police, who else can I call? If things really go south I&amp;#39;m not above calling the cops on her, but I&amp;#39;d really like to keep things safe considering the track record of police brutality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7vzjs", "score_hidden": false, "stickied": false, "created": 1492133104.0, "created_utc": 1492104304.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7uog3", "gilded": 0, "archived": false, "score": 177, "report_reasons": null, "author": "Waitingforadragon", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think you need to seek help from an expert who deals with stalkers and probably some legal help from the police or a lawyer. This has already gone deeply into very worrying territory and is a matter for professionals. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you need to seek help from an expert who deals with stalkers and probably some legal help from the police or a lawyer. This has already gone deeply into very worrying territory and is a matter for professionals. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7uog3", "score_hidden": false, "stickied": false, "created": 1492131710.0, "created_utc": 1492102910.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 177}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg84u8l", "gilded": 0, "archived": false, "score": 38, "report_reasons": null, "author": "perplexedjj", "parent_id": "t1_dg7w4og", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Call them now and start the paper trail. \n\nThey may not be as serious about the issue if they think it's just some friends' drama, which they will if she's stalking you and you have made no previous attempts to report her. Please, show them the documentation so that if things get bad, they'll take it seriously and know the situation better! This will also protect you if she tries to get legal revenge or use the police against you down the road. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Call them now and start the paper trail. &lt;/p&gt;\n\n&lt;p&gt;They may not be as serious about the issue if they think it&amp;#39;s just some friends&amp;#39; drama, which they will if she&amp;#39;s stalking you and you have made no previous attempts to report her. Please, show them the documentation so that if things get bad, they&amp;#39;ll take it seriously and know the situation better! This will also protect you if she tries to get legal revenge or use the police against you down the road. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg84u8l", "score_hidden": false, "stickied": false, "created": 1492142619.0, "created_utc": 1492113819.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 38}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg9rpwj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "andrewtater", "parent_id": "t1_dg7w4og", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Beyond calling the cops, it might be time to send an anonymous note to Ralph. His GF lied to a mutual friend, cheated on him (even if it wasn't full sex), and is now obsessed with your BF. And THEN they got married, likely without Ralph ever knowing.\n\nJohn is her \"one that got away\", except he is still in her life. You aren't responsible for her mental health, but you can help yours and John's by cutting her out of your lives.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Beyond calling the cops, it might be time to send an anonymous note to Ralph. His GF lied to a mutual friend, cheated on him (even if it wasn&amp;#39;t full sex), and is now obsessed with your BF. And THEN they got married, likely without Ralph ever knowing.&lt;/p&gt;\n\n&lt;p&gt;John is her &amp;quot;one that got away&amp;quot;, except he is still in her life. You aren&amp;#39;t responsible for her mental health, but you can help yours and John&amp;#39;s by cutting her out of your lives.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9rpwj", "score_hidden": false, "stickied": false, "created": 1492233516.0, "created_utc": 1492204716.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7w4og", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "annoyed_gay_guy", "parent_id": "t1_dg7vbxn", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've already saved all her emails and messages on Facebook. I guess if there's no other option I'd have to cal the cops.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve already saved all her emails and messages on Facebook. I guess if there&amp;#39;s no other option I&amp;#39;d have to cal the cops.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7w4og", "score_hidden": false, "stickied": false, "created": 1492133254.0, "created_utc": 1492104454.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7vbxn", "gilded": 0, "archived": false, "score": 87, "report_reasons": null, "author": "Cityofooo", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Whether she's unpredictable or not, you're definitely at the point of involving authorities. Save all of the emails and threats, bring them to the police. I can not understate how dangerous she sounds and how often people think they don't have to involve police then really regret it as it gets worse.\n\nHonestly if you're friendly with her partner it would not hurt to alert him to what is going on first-hand too - hell, that's his wife acting so insane. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Whether she&amp;#39;s unpredictable or not, you&amp;#39;re definitely at the point of involving authorities. Save all of the emails and threats, bring them to the police. I can not understate how dangerous she sounds and how often people think they don&amp;#39;t have to involve police then really regret it as it gets worse.&lt;/p&gt;\n\n&lt;p&gt;Honestly if you&amp;#39;re friendly with her partner it would not hurt to alert him to what is going on first-hand too - hell, that&amp;#39;s his wife acting so insane. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7vbxn", "score_hidden": false, "stickied": false, "created": 1492132404.0, "created_utc": 1492103604.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 87}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg7w7cu", "gilded": 0, "archived": false, "score": 46, "report_reasons": null, "author": "rejesterd", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He needs to get over his fear of the police and call them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He needs to get over his fear of the police and call them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7w7cu", "score_hidden": false, "stickied": false, "created": 1492133335.0, "created_utc": 1492104535.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 46}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg80tq2", "gilded": 0, "archived": false, "score": 42, "report_reasons": null, "author": "Strangeandweird", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This pointless kindness is going to get someone killed. It might be Vicky or either of you. Let the professionals handle this situation because you guys are not equipped to deal with this. Forward Ralph the messages at least and tell him the next time she contacts you guys will be going to the police. Next start collecting the data instead of deleting and go to the police. Chances of them doing nothing is more probable rather than getting in a gun fight with her so you might need a lawyer to push for a case. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This pointless kindness is going to get someone killed. It might be Vicky or either of you. Let the professionals handle this situation because you guys are not equipped to deal with this. Forward Ralph the messages at least and tell him the next time she contacts you guys will be going to the police. Next start collecting the data instead of deleting and go to the police. Chances of them doing nothing is more probable rather than getting in a gun fight with her so you might need a lawyer to push for a case. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg80tq2", "score_hidden": false, "stickied": false, "created": 1492138254.0, "created_utc": 1492109454.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 42}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg8as5i", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "ShelfLifeInc", "parent_id": "t1_dg7y1fj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "And both John and OP should up their personal security. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And both John and OP should up their personal security. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8as5i", "score_hidden": false, "stickied": false, "created": 1492149581.0, "created_utc": 1492120781.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 14}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7y1fj", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "bluepy67", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "John should see a lawyer, the police, and he should get a restraining order.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;John should see a lawyer, the police, and he should get a restraining order.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7y1fj", "score_hidden": false, "stickied": false, "created": 1492135282.0, "created_utc": 1492106482.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg86qmy", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "littleorangemonkeys", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I mean, if Vicky knows Johns email, she's going to be able to send him this stuff. Can he gat a new email address?  All that crap will still go to the old address (which you should save for evidence), but he won't have to see it when he does any other communications.   Also, I would encourage him to talk to Ralph.  Vicky is crazy, and could be a danger to her own husband if/when she is told to stop contacting you guys.   At the very least he should get a heads up if you're going to take legal action against her, if for no other reason than to protect himself. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, if Vicky knows Johns email, she&amp;#39;s going to be able to send him this stuff. Can he gat a new email address?  All that crap will still go to the old address (which you should save for evidence), but he won&amp;#39;t have to see it when he does any other communications.   Also, I would encourage him to talk to Ralph.  Vicky is crazy, and could be a danger to her own husband if/when she is told to stop contacting you guys.   At the very least he should get a heads up if you&amp;#39;re going to take legal action against her, if for no other reason than to protect himself. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg86qmy", "score_hidden": false, "stickied": false, "created": 1492144734.0, "created_utc": 1492115934.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg8o1yi", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "Miyukia", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I mean your fiancé never told Ralph that he was marrying a cheater but it is what it is. Now he is married to a homophobic cheater, out of control deluded stalker that doesn't love him because she's fixated on someone else so his problems now are even bigger and he doesn't even know it. Tell your fiancé their marriage is already ruined because it was a sham since the beginning. Ralph wouldn't be married if he knew she never loved him and she has always been trying to get your fiancé. Nobody deserves living in a lie. John can't also say it's something that will go away because it's been YEARS, her obsession isn't diminishing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean your fiancé never told Ralph that he was marrying a cheater but it is what it is. Now he is married to a homophobic cheater, out of control deluded stalker that doesn&amp;#39;t love him because she&amp;#39;s fixated on someone else so his problems now are even bigger and he doesn&amp;#39;t even know it. Tell your fiancé their marriage is already ruined because it was a sham since the beginning. Ralph wouldn&amp;#39;t be married if he knew she never loved him and she has always been trying to get your fiancé. Nobody deserves living in a lie. John can&amp;#39;t also say it&amp;#39;s something that will go away because it&amp;#39;s been YEARS, her obsession isn&amp;#39;t diminishing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8o1yi", "score_hidden": false, "stickied": false, "created": 1492167742.0, "created_utc": 1492138942.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg85m2t", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "saturnspoops", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You have a fiance problem because he is still enabling her behavior by being more concerned for her safety than yours or his own. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have a fiance problem because he is still enabling her behavior by being more concerned for her safety than yours or his own. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg85m2t", "score_hidden": false, "stickied": false, "created": 1492143474.0, "created_utc": 1492114674.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg8hgwk", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "Massiveshaqtack", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You absolutely put your foot down and insist your SO stops enabling this woman or you're out. SHE IS STALKING AND HARASSING BOTH OF YOU AND THIS COULD BECOME VERY DANGEROUS IF SOMETHING IS NOT DONE ABOUT IT.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You absolutely put your foot down and insist your SO stops enabling this woman or you&amp;#39;re out. SHE IS STALKING AND HARASSING BOTH OF YOU AND THIS COULD BECOME VERY DANGEROUS IF SOMETHING IS NOT DONE ABOUT IT.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8hgwk", "score_hidden": false, "stickied": false, "created": 1492158526.0, "created_utc": 1492129726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg8moqo", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "YouCantSaveEveryone", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You know that police involvement is inevitable. Just get it over with. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know that police involvement is inevitable. Just get it over with. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8moqo", "score_hidden": false, "stickied": false, "created": 1492165737.0, "created_utc": 1492136937.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg8526u", "gilded": 0, "archived": false, "score": 29, "report_reasons": null, "author": "bkr4f", "parent_id": "t1_dg836ki", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My moms have been together over 20 years and neither one identifies as lesbian/gay. They just love each other has always been their explanation.   \n\nI can see where they're coming from, it was the first same sex relationship for both and they associate the label more with the media stereotypes so it makes sense that it doesn't feel like their identity. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My moms have been together over 20 years and neither one identifies as lesbian/gay. They just love each other has always been their explanation.   &lt;/p&gt;\n\n&lt;p&gt;I can see where they&amp;#39;re coming from, it was the first same sex relationship for both and they associate the label more with the media stereotypes so it makes sense that it doesn&amp;#39;t feel like their identity. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8526u", "score_hidden": false, "stickied": false, "created": 1492142863.0, "created_utc": 1492114063.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 29}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dg8m4p7", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "yourmothersdaughter", "parent_id": "t1_dg836ki", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Human sexuality is weird and complicated, and the labels we have available don't work for everybody.", "edited": 1492273824.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Human sexuality is weird and complicated, and the labels we have available don&amp;#39;t work for everybody.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8m4p7", "score_hidden": false, "stickied": false, "created": 1492164952.0, "created_utc": 1492136152.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg836ki", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "OverEasyGoing", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "&gt; At this point John was considering himself straight, and in a sense he still does.\n\nWTF does this mean? Why are you getting married? Stalker aside, maybe don't get married yet until he can sort that out. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;At this point John was considering himself straight, and in a sense he still does.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;WTF does this mean? Why are you getting married? Stalker aside, maybe don&amp;#39;t get married yet until he can sort that out. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg836ki", "score_hidden": false, "stickied": false, "created": 1492140816.0, "created_utc": 1492112016.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656qlx", "likes": null, "replies": "", "user_reports": [], "id": "dgdjxpf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "LAXAsh", "parent_id": "t3_656qlx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Gift of Fear is a great book, and it has a section on stalkers and how to handle them.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Gift of Fear is a great book, and it has a section on stalkers and how to handle them.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgdjxpf", "score_hidden": true, "stickied": false, "created": 1492468652.0, "created_utc": 1492439852.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}]