[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We can cut to the chase, I am not a very attractive girl. I&amp;#39;m also quite reserved, so it&amp;#39;s hard for me to get close to people, and I am often quite insecure. The girlfriends I do have are wonderful and supportive, but girls (strangers mostly) have always treated me pretty poorly. I&amp;#39;m trying to be more confident because I think it help, but I&amp;#39;m tired of other girls turning and giggling and laughing. I&amp;#39;m tired of going to a makeup counter and having the artist outright ignore me to talk to someone else, or put a ton of blue eyeliner on me and send me on my way. Friends always have me take pictures for them, and I am generally kept out of photos. Some people say that girls are intimidated by pretty girls, but I don&amp;#39;t believe that is my problem.&lt;/p&gt;\n\n&lt;p&gt;My boyfriend is model-hot. He did some sports modeling in college and was sponsored by a top label company. He always comments about how ugly he is and how he hates how he looks and doesn&amp;#39;t understand the attention he gets.&lt;/p&gt;\n\n&lt;p&gt;We have such a good relationship and I am so happy he is in my life, his family and friends are amazing and my parents and friends love him. It feels like he would move the world for me.&lt;/p&gt;\n\n&lt;p&gt;But it doesn&amp;#39;t help that whenever we go out in public women will go out of their way to flirt with him, one even touched his arm once and commented on his muscles. They all act like they are almost entitled to his attention, and often just give me smug looks or looks of disbelief. One girl even had the nerve to approach me at a bar while BF was in the bathroom and ask if we were siblings. When I said no, she stared at me and said &amp;quot;what a shame, he must have low self esteem.&amp;quot; She and her girlfriends spent the rest of the night pushing between us at the bar until he asked them what their f&amp;#39;ing problem was. &amp;quot;Oh I assumed you two weren&amp;#39;t together&amp;quot; with a smug look towards me. He reassured her that we were, and pulled my chair closer to him and put his arm around me the rest of the night. It felt great to have him do that, and he raged about it in the car, commenting that &amp;quot;just because they think they&amp;#39;re hot they feel entitled to my time it&amp;#39;s bullshit&amp;quot; ... but on the other hand he has definitely checked out other women before and sort of put me on ignore (or at least sort of gone out of his way to not be near me). I am just... I don&amp;#39;t know, exhausted by it I guess.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure how to bring it up to him just how upset I am whenever girls stare at me and make faces at me. I don&amp;#39;t know. It makes me feel so awful and sometimes makes me not want to go out in public with him. I know it&amp;#39;s an issue I have to solve myself, but I feel I should bring it up to him as well. I just don&amp;#39;t know how.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: my boyfriend is really attractive and other women treat me poorly because of it and try to get between us. I&amp;#39;m struggling with my already low self esteem issues and I&amp;#39;m not sure what to do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "We can cut to the chase, I am not a very attractive girl. I'm also quite reserved, so it's hard for me to get close to people, and I am often quite insecure. The girlfriends I do have are wonderful and supportive, but girls (strangers mostly) have always treated me pretty poorly. I'm trying to be more confident because I think it help, but I'm tired of other girls turning and giggling and laughing. I'm tired of going to a makeup counter and having the artist outright ignore me to talk to someone else, or put a ton of blue eyeliner on me and send me on my way. Friends always have me take pictures for them, and I am generally kept out of photos. Some people say that girls are intimidated by pretty girls, but I don't believe that is my problem.\n\nMy boyfriend is model-hot. He did some sports modeling in college and was sponsored by a top label company. He always comments about how ugly he is and how he hates how he looks and doesn't understand the attention he gets.\n\nWe have such a good relationship and I am so happy he is in my life, his family and friends are amazing and my parents and friends love him. It feels like he would move the world for me.\n\nBut it doesn't help that whenever we go out in public women will go out of their way to flirt with him, one even touched his arm once and commented on his muscles. They all act like they are almost entitled to his attention, and often just give me smug looks or looks of disbelief. One girl even had the nerve to approach me at a bar while BF was in the bathroom and ask if we were siblings. When I said no, she stared at me and said \"what a shame, he must have low self esteem.\" She and her girlfriends spent the rest of the night pushing between us at the bar until he asked them what their f'ing problem was. \"Oh I assumed you two weren't together\" with a smug look towards me. He reassured her that we were, and pulled my chair closer to him and put his arm around me the rest of the night. It felt great to have him do that, and he raged about it in the car, commenting that \"just because they think they're hot they feel entitled to my time it's bullshit\" ... but on the other hand he has definitely checked out other women before and sort of put me on ignore (or at least sort of gone out of his way to not be near me). I am just... I don't know, exhausted by it I guess.\n\nI'm not sure how to bring it up to him just how upset I am whenever girls stare at me and make faces at me. I don't know. It makes me feel so awful and sometimes makes me not want to go out in public with him. I know it's an issue I have to solve myself, but I feel I should bring it up to him as well. I just don't know how.\n\nTL;DR: my boyfriend is really attractive and other women treat me poorly because of it and try to get between us. I'm struggling with my already low self esteem issues and I'm not sure what to do.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Personal issues", "id": "656vj2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 83, "report_reasons": null, "author": "Tacos44556", "saved": false, "mod_reports": [], "name": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-io personal", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/656vj2/i_26f_am_quite_upset_at_the_attention_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492132764.0, "url": "https://www.reddit.com/r/relationships/comments/656vj2/i_26f_am_quite_upset_at_the_attention_my/", "author_flair_text": null, "quarantine": false, "title": "I (26f) am quite upset at the attention my boyfriend (28m) gets from other women. Not sure how to bring it up.", "created_utc": 1492103964.0, "distinguished": null, "media": null, "upvote_ratio": 0.9, "num_comments": 30, "visited": false, "subreddit_type": "public", "ups": 83}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8sxr9", "gilded": 0, "archived": false, "score": 45, "report_reasons": null, "author": "toomanyrougneds", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm going to go off on a tangent here. \n\nBoth of you are openly complaining about how ugly you are. STOP IT. STOP IT NOW. STOP IT FOREVER.\n\nNot only is it toxic and self-defeating, not only are you boring the fuck out of everyone around you, not only could you be destroying your kids' self-esteem if you ever have them and haven't knocked it off by then (seriously, what's more deflating than Mom or Dad going \"I'm ugly, I'm ugly, I'm so ugly\" then the next day coming up with \"you look so much like meeeee\"), you're also turning appearance into basically the only virtue a human being can have. You're blowing its importance so far out of proportion that I have to wonder if you even see yourselves as people and not just reflections in a mirror.\n\nCan you not see how shallow, superficial, and downright dangerous that is? Can you not see how destructive that is to how you see other people, and how other people see you?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to go off on a tangent here. &lt;/p&gt;\n\n&lt;p&gt;Both of you are openly complaining about how ugly you are. STOP IT. STOP IT NOW. STOP IT FOREVER.&lt;/p&gt;\n\n&lt;p&gt;Not only is it toxic and self-defeating, not only are you boring the fuck out of everyone around you, not only could you be destroying your kids&amp;#39; self-esteem if you ever have them and haven&amp;#39;t knocked it off by then (seriously, what&amp;#39;s more deflating than Mom or Dad going &amp;quot;I&amp;#39;m ugly, I&amp;#39;m ugly, I&amp;#39;m so ugly&amp;quot; then the next day coming up with &amp;quot;you look so much like meeeee&amp;quot;), you&amp;#39;re also turning appearance into basically the only virtue a human being can have. You&amp;#39;re blowing its importance so far out of proportion that I have to wonder if you even see yourselves as people and not just reflections in a mirror.&lt;/p&gt;\n\n&lt;p&gt;Can you not see how shallow, superficial, and downright dangerous that is? Can you not see how destructive that is to how you see other people, and how other people see you?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8sxr9", "score_hidden": false, "stickied": false, "created": 1492175957.0, "created_utc": 1492147157.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 45}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg7y4xc", "gilded": 0, "archived": false, "score": 36, "report_reasons": null, "author": "Plopwieldingmonkey", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My girlfriend feels the same way unfortunately. We live in a country with a lot of problem with racism. She´s black, I´m white. I think she´s beautiful, but because she´s black people (especially girls) will somewhat frequently come up and ask if she´s my translator, what are we doing together, or even saying stuff like ´wow you´re really black huh´ as if to say I´m surprised how someone so black could get a white guy. It´s awful. \n\nLike you, I really struggle to understand what would motivate someone to walk up to two strangers to announce their unwanted opinion on our relationship. But that´s because you´re not a shitty person (hopefully!). You´re never going to understand their mentality because you´re not like them. There´s nothing you can do to stop them thinking that way, or doing those things. The fact that some people are nasty is just a fact of life. \n\nThe only thing you should be trying to work on is realising that these people only say/do those things because they´re jealous of you. I personally think their train of thought goes something like this: They look at you and think she´s below me, then look at who you´re with and think oh he´s better than anyone I´ve ever managed to attract, does that mean she´s better than me...but that means I´m below someone that I consider to be lower status, I´m not lower status! Quick lets go over there so I can show him that he doesn´t have to be with that lower grade person, that girls of MY quality are available and interested! Because there´s no way she´s better than me.... Either that or they just want to ´put you in your place´incase you were delusional enough to think that a person who had chosen to be with you actually wanted you. Which obviously speaks volumes of the intelligence of these people. \n\nThey´re jealous! Plain and simple. Nothing you can do about it. Hopefully once you realise these people are doing nasty things because they want what you have you´ll feel less intimidated. Just remember, they´re only lashing out because they think they´re better than you, and you´re proving to them they´re not. Ignore them and try to live a happy life, it´s the best revenge! Good luck.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My girlfriend feels the same way unfortunately. We live in a country with a lot of problem with racism. She´s black, I´m white. I think she´s beautiful, but because she´s black people (especially girls) will somewhat frequently come up and ask if she´s my translator, what are we doing together, or even saying stuff like ´wow you´re really black huh´ as if to say I´m surprised how someone so black could get a white guy. It´s awful. &lt;/p&gt;\n\n&lt;p&gt;Like you, I really struggle to understand what would motivate someone to walk up to two strangers to announce their unwanted opinion on our relationship. But that´s because you´re not a shitty person (hopefully!). You´re never going to understand their mentality because you´re not like them. There´s nothing you can do to stop them thinking that way, or doing those things. The fact that some people are nasty is just a fact of life. &lt;/p&gt;\n\n&lt;p&gt;The only thing you should be trying to work on is realising that these people only say/do those things because they´re jealous of you. I personally think their train of thought goes something like this: They look at you and think she´s below me, then look at who you´re with and think oh he´s better than anyone I´ve ever managed to attract, does that mean she´s better than me...but that means I´m below someone that I consider to be lower status, I´m not lower status! Quick lets go over there so I can show him that he doesn´t have to be with that lower grade person, that girls of MY quality are available and interested! Because there´s no way she´s better than me.... Either that or they just want to ´put you in your place´incase you were delusional enough to think that a person who had chosen to be with you actually wanted you. Which obviously speaks volumes of the intelligence of these people. &lt;/p&gt;\n\n&lt;p&gt;They´re jealous! Plain and simple. Nothing you can do about it. Hopefully once you realise these people are doing nasty things because they want what you have you´ll feel less intimidated. Just remember, they´re only lashing out because they think they´re better than you, and you´re proving to them they´re not. Ignore them and try to live a happy life, it´s the best revenge! Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7y4xc", "score_hidden": false, "stickied": false, "created": 1492135385.0, "created_utc": 1492106585.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 36}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg84znb", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "DTBB13", "parent_id": "t1_dg820ou", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;sometimes you'll see what you \"want\" to see\n\nAgreed on this count. My SO is ridiculously more conventionally attractive than I am, and if it stressed me out any time someone \"touched their arm\" or \"tried to get their attention\" I'd lose my mind. It took awhile and some therapy, but eventually you have to realize that no amount of insecurity on your part will\nmake your SO less attractive to other people. That, in and of itself, is not correctable. \n\nEventually you have to just accept that your SO likes and wants to be with you, other people be damned. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;sometimes you&amp;#39;ll see what you &amp;quot;want&amp;quot; to see&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Agreed on this count. My SO is ridiculously more conventionally attractive than I am, and if it stressed me out any time someone &amp;quot;touched their arm&amp;quot; or &amp;quot;tried to get their attention&amp;quot; I&amp;#39;d lose my mind. It took awhile and some therapy, but eventually you have to realize that no amount of insecurity on your part will\nmake your SO less attractive to other people. That, in and of itself, is not correctable. &lt;/p&gt;\n\n&lt;p&gt;Eventually you have to just accept that your SO likes and wants to be with you, other people be damned. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg84znb", "score_hidden": false, "stickied": false, "created": 1492142787.0, "created_utc": 1492113987.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg820ou", "gilded": 0, "archived": false, "score": 69, "report_reasons": null, "author": "YungPootieTang", "parent_id": "t1_dg7z70o", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; it's hard to believe that you feel ignored because of something he's persistently doing \n\nIt's most likely insecurities on the part of OP (sometimes you'll see what you \"want\" to see). I agree though. Considering how openly hostile the guy is to those women (even to the point of raging about them in the car), I doubt he's doing much beyond the occasional innocent glance, which literally everyone does.\n\n\nWe all struggle with different things, and for some reason, OP feels she isn't good enough for her boyfriend, even though he clearly thinks she is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;it&amp;#39;s hard to believe that you feel ignored because of something he&amp;#39;s persistently doing &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It&amp;#39;s most likely insecurities on the part of OP (sometimes you&amp;#39;ll see what you &amp;quot;want&amp;quot; to see). I agree though. Considering how openly hostile the guy is to those women (even to the point of raging about them in the car), I doubt he&amp;#39;s doing much beyond the occasional innocent glance, which literally everyone does.&lt;/p&gt;\n\n&lt;p&gt;We all struggle with different things, and for some reason, OP feels she isn&amp;#39;t good enough for her boyfriend, even though he clearly thinks she is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg820ou", "score_hidden": false, "stickied": false, "created": 1492139554.0, "created_utc": 1492110754.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 69}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7z70o", "gilded": 0, "archived": false, "score": 139, "report_reasons": null, "author": "rejesterd", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; he has definitely checked out other women before and sort of put me on ignore (or at least sort of gone out of his way to not be near me)\n\nTalk about one of these times in detail.  Considering how he shooed the other girls away from you and him at the bar, it's hard to believe that you feel ignored because of something he's persistently doing (and not mainly due to your own insecurities).\n\nSounds to me like a typical grass-is-greener-on-the-other-side thing.  You have a great relationship going with this guy, but it's not quite good enough because he doesn't free you from all your insecure thoughts (which is not his job to do).  \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;he has definitely checked out other women before and sort of put me on ignore (or at least sort of gone out of his way to not be near me)&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Talk about one of these times in detail.  Considering how he shooed the other girls away from you and him at the bar, it&amp;#39;s hard to believe that you feel ignored because of something he&amp;#39;s persistently doing (and not mainly due to your own insecurities).&lt;/p&gt;\n\n&lt;p&gt;Sounds to me like a typical grass-is-greener-on-the-other-side thing.  You have a great relationship going with this guy, but it&amp;#39;s not quite good enough because he doesn&amp;#39;t free you from all your insecure thoughts (which is not his job to do).  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7z70o", "score_hidden": false, "stickied": false, "created": 1492136515.0, "created_utc": 1492107715.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 139}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8gvr6", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "pewpewwwlazers", "parent_id": "t1_dg7w5ek", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah therapy might really help OP process these feelings and eventually build confidence. I don't think it's her boyfriends job to constantly assuage these fears and boost her self esteem.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah therapy might really help OP process these feelings and eventually build confidence. I don&amp;#39;t think it&amp;#39;s her boyfriends job to constantly assuage these fears and boost her self esteem.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8gvr6", "score_hidden": false, "stickied": false, "created": 1492157706.0, "created_utc": 1492128906.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7w5ek", "gilded": 0, "archived": false, "score": 72, "report_reasons": null, "author": "memecitydreams", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Kudos to your boyfriend to trying to help here. Honestly, I'd consider therapy if this is weighing on you so much. Fuck those people, yeesh!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kudos to your boyfriend to trying to help here. Honestly, I&amp;#39;d consider therapy if this is weighing on you so much. Fuck those people, yeesh!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7w5ek", "score_hidden": false, "stickied": false, "created": 1492133276.0, "created_utc": 1492104476.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 72}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg823mb", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "snug_dealer", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm kind of the reverse here, being the \"more attractive\" partner in my relationships. People do the whole \"she's too cute for you\"/\"oh, I didn't know you were together\" thing. A useful phrase I've learned towards compliments is \"My boyfriend thinks I'm cute, too!\" then a smooch for him. Any comments towards him being unattractive will be met with \"Wow, how rude\". These girls aren't going to listen to you, so it would be nice for your boyfriend to shut them down. They are interfering with a good night out thinking they have a shot. They don't. They won't believe it from your mouth, but they will from his. It shows disrespect to both of you, so it is perfectly fine to be bothered by it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m kind of the reverse here, being the &amp;quot;more attractive&amp;quot; partner in my relationships. People do the whole &amp;quot;she&amp;#39;s too cute for you&amp;quot;/&amp;quot;oh, I didn&amp;#39;t know you were together&amp;quot; thing. A useful phrase I&amp;#39;ve learned towards compliments is &amp;quot;My boyfriend thinks I&amp;#39;m cute, too!&amp;quot; then a smooch for him. Any comments towards him being unattractive will be met with &amp;quot;Wow, how rude&amp;quot;. These girls aren&amp;#39;t going to listen to you, so it would be nice for your boyfriend to shut them down. They are interfering with a good night out thinking they have a shot. They don&amp;#39;t. They won&amp;#39;t believe it from your mouth, but they will from his. It shows disrespect to both of you, so it is perfectly fine to be bothered by it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg823mb", "score_hidden": false, "stickied": false, "created": 1492139641.0, "created_utc": 1492110841.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dgat06d", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Chxrliefxckingshxxn", "parent_id": "t1_dg992dj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;He's with me, ladies, eat your heart out\n\nI laughed out loud. I LOVED THAT ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;He&amp;#39;s with me, ladies, eat your heart out&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I laughed out loud. I LOVED THAT &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dgat06d", "score_hidden": false, "stickied": false, "created": 1492300969.0, "created_utc": 1492272169.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg992dj", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Thrumpledenoozitty", "parent_id": "t1_dg8lfjq", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is what I do!!! I'm the less attractive partner in my relationship and my bf is also model-hot who gets loads of attention from girls (and guys). Not that I'm ugly or anything, but I'm average whereas he's WAY above average.\n\nSometimes I'll stand aside and watch women fall over themselves trying to flirt and talk to him, and then I'll just walk up and take his arm and smile at them in a friendly way. Letting them know I don't find them a threat at all. It's an amazing feeling. He's with me, ladies, eat your hearts out!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what I do!!! I&amp;#39;m the less attractive partner in my relationship and my bf is also model-hot who gets loads of attention from girls (and guys). Not that I&amp;#39;m ugly or anything, but I&amp;#39;m average whereas he&amp;#39;s WAY above average.&lt;/p&gt;\n\n&lt;p&gt;Sometimes I&amp;#39;ll stand aside and watch women fall over themselves trying to flirt and talk to him, and then I&amp;#39;ll just walk up and take his arm and smile at them in a friendly way. Letting them know I don&amp;#39;t find them a threat at all. It&amp;#39;s an amazing feeling. He&amp;#39;s with me, ladies, eat your hearts out!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg992dj", "score_hidden": false, "stickied": false, "created": 1492211527.0, "created_utc": 1492182727.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8lfjq", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "ThatGuyFromOhio", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My wife and I are in the mirror opposite situation.  She is stunningly gorgeous.  When we walk in public together, I will see men look at her, then look at me, then back at her, then back at me with a quizzical look like, \"Why are you with him?\"\n\nAnd I just give them the look that says, \"Yup, she's with me.  Back off.\"  A proud, confident look.  And I enjoy the look of confusion on their faces.  \n\nIt's fun.  Try it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My wife and I are in the mirror opposite situation.  She is stunningly gorgeous.  When we walk in public together, I will see men look at her, then look at me, then back at her, then back at me with a quizzical look like, &amp;quot;Why are you with him?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;And I just give them the look that says, &amp;quot;Yup, she&amp;#39;s with me.  Back off.&amp;quot;  A proud, confident look.  And I enjoy the look of confusion on their faces.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s fun.  Try it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8lfjq", "score_hidden": false, "stickied": false, "created": 1492163967.0, "created_utc": 1492135167.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg87a0w", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "DEITRICH_KINGS", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You don't have to bring it up to him. The problem is your attitude honey bunny. Are you srsly going to let these nobodies push you around? Maybe you're insecure, but so were those skankatrons. A person who is secure with themselves doesn't need validation, much less make the people around them feel shitty. They made themselves look foolish. Can't you see how needy they were being? \n\nYou have to learn to own the room. I have seen the \"ugliest\" people own the most beautiful. How are people going to enjoy you, if you don't enjoy you. Ok fine, you're not pretty, be fiery, be charismatic. Your BF saw something in you, enhance THOSE features. It won't be done one day to the next, but honestly, fake it till you make it. Who cares if he looks next door sometimes? He's with YOU, no one else. Own that. We lie to ourselves everyday, that we're not good enough, attractive enough, wtv. And we believe these lies. \"Lie\" to yourself the opposite, that you're adored, that you're a pearl. You'll tell yourself this so much and so often, eventually you'll believe it. I promise it works.\n\nSounds to me you have to grow some confidence. Confidence is the sexiest thing on this planet. Way sexier than a needy fool like those girls at the bar. If you have confidence, you'll know how to deal with low class people like that in the future. And don't ever think otherwise, people like that are low class, and have nothing on you darling.", "edited": 1492116780.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You don&amp;#39;t have to bring it up to him. The problem is your attitude honey bunny. Are you srsly going to let these nobodies push you around? Maybe you&amp;#39;re insecure, but so were those skankatrons. A person who is secure with themselves doesn&amp;#39;t need validation, much less make the people around them feel shitty. They made themselves look foolish. Can&amp;#39;t you see how needy they were being? &lt;/p&gt;\n\n&lt;p&gt;You have to learn to own the room. I have seen the &amp;quot;ugliest&amp;quot; people own the most beautiful. How are people going to enjoy you, if you don&amp;#39;t enjoy you. Ok fine, you&amp;#39;re not pretty, be fiery, be charismatic. Your BF saw something in you, enhance THOSE features. It won&amp;#39;t be done one day to the next, but honestly, fake it till you make it. Who cares if he looks next door sometimes? He&amp;#39;s with YOU, no one else. Own that. We lie to ourselves everyday, that we&amp;#39;re not good enough, attractive enough, wtv. And we believe these lies. &amp;quot;Lie&amp;quot; to yourself the opposite, that you&amp;#39;re adored, that you&amp;#39;re a pearl. You&amp;#39;ll tell yourself this so much and so often, eventually you&amp;#39;ll believe it. I promise it works.&lt;/p&gt;\n\n&lt;p&gt;Sounds to me you have to grow some confidence. Confidence is the sexiest thing on this planet. Way sexier than a needy fool like those girls at the bar. If you have confidence, you&amp;#39;ll know how to deal with low class people like that in the future. And don&amp;#39;t ever think otherwise, people like that are low class, and have nothing on you darling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg87a0w", "score_hidden": false, "stickied": false, "created": 1492145348.0, "created_utc": 1492116548.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8frnw", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "AgentKittyfeets", "parent_id": "t1_dg7yf31", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; THEN we got into the mode where a guy would offer to buy her a drink, she'd ask for two, and then hand me one right in front of him. Fucking classic, and that's what you get for intentionally hitting on a taken person.\n\nThis is so slick *and* gets the point across!! :D", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;THEN we got into the mode where a guy would offer to buy her a drink, she&amp;#39;d ask for two, and then hand me one right in front of him. Fucking classic, and that&amp;#39;s what you get for intentionally hitting on a taken person.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is so slick &lt;em&gt;and&lt;/em&gt; gets the point across!! :D&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8frnw", "score_hidden": false, "stickied": false, "created": 1492156173.0, "created_utc": 1492127373.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7yf31", "gilded": 0, "archived": false, "score": 32, "report_reasons": null, "author": "YungPootieTang", "parent_id": "t1_dg7wezs", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; People, not just females, can be rude.\n&gt; This is not your bf's fault.\n&gt; It is not your fault.\n&gt; People can be rude.\n\n\ndefinitely correct. OP, my suggestion is handle it with more sass. Let them know exactly who he's with (if he's okay with that, that is).\n\nMy SO (I'm male) is legitimately, objectively, more attractive than me. I won't front. We've been dating for a long, long time and are now set to be married, but back in the day I'd always ask myself \"what is she doing...? When will she realize I'm not the highest she should reach for?\" and other bullshit like that. Finally, I realized *she's actually as wonderful as I thought she was and loves me for me.* I started approaching our relationship with much more confidence.\n\n\nI had your type of experience at bars all the time, albeit with other guys. I talked with her about what she was comfortable with me doing. She just said \"Don't fight anyone. Other than that, it's your call.\" Her *personal favorite* thing that I'd do would be, when a guy expressed disbelief/disgust/contempt/whatever that she was with me and continued to try to hit on her, she'd turn away from him, towards me, and have me reach around and grab a full cheek, one-handed, look at the guy, and say \"I don't think you heard me\"\n\n\nShe always thought it was hysterical. THEN we got into the mode where a guy would offer to buy her a drink, she'd ask for two, and then hand me one right in front of him. Fucking classic, and that's what you get for intentionally hitting on a taken person.\n\n\n\nlong story short- don't be afraid to be confident in the fact that you have a model boyfriend who gets *shitty* when other women treat you poorly. Own that shit.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;People, not just females, can be rude.\nThis is not your bf&amp;#39;s fault.\nIt is not your fault.\nPeople can be rude.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;definitely correct. OP, my suggestion is handle it with more sass. Let them know exactly who he&amp;#39;s with (if he&amp;#39;s okay with that, that is).&lt;/p&gt;\n\n&lt;p&gt;My SO (I&amp;#39;m male) is legitimately, objectively, more attractive than me. I won&amp;#39;t front. We&amp;#39;ve been dating for a long, long time and are now set to be married, but back in the day I&amp;#39;d always ask myself &amp;quot;what is she doing...? When will she realize I&amp;#39;m not the highest she should reach for?&amp;quot; and other bullshit like that. Finally, I realized &lt;em&gt;she&amp;#39;s actually as wonderful as I thought she was and loves me for me.&lt;/em&gt; I started approaching our relationship with much more confidence.&lt;/p&gt;\n\n&lt;p&gt;I had your type of experience at bars all the time, albeit with other guys. I talked with her about what she was comfortable with me doing. She just said &amp;quot;Don&amp;#39;t fight anyone. Other than that, it&amp;#39;s your call.&amp;quot; Her &lt;em&gt;personal favorite&lt;/em&gt; thing that I&amp;#39;d do would be, when a guy expressed disbelief/disgust/contempt/whatever that she was with me and continued to try to hit on her, she&amp;#39;d turn away from him, towards me, and have me reach around and grab a full cheek, one-handed, look at the guy, and say &amp;quot;I don&amp;#39;t think you heard me&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;She always thought it was hysterical. THEN we got into the mode where a guy would offer to buy her a drink, she&amp;#39;d ask for two, and then hand me one right in front of him. Fucking classic, and that&amp;#39;s what you get for intentionally hitting on a taken person.&lt;/p&gt;\n\n&lt;p&gt;long story short- don&amp;#39;t be afraid to be confident in the fact that you have a model boyfriend who gets &lt;em&gt;shitty&lt;/em&gt; when other women treat you poorly. Own that shit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7yf31", "score_hidden": false, "stickied": false, "created": 1492135686.0, "created_utc": 1492106886.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 32}}], "after": null, "before": null}}, "user_reports": [], "id": "dg7wezs", "gilded": 0, "archived": false, "score": 22, "report_reasons": null, "author": "niobiumnnul", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "People, not just females, can be rude.  \nThis is not your bf's fault.  \nIt is not your fault.  \nPeople can be rude.  \n\nWhat you do have control over is how you respond to it and how you let it affect you and your relationship.  \n\nIf your bf is putting you on ignore at times, that is a problem to address immediately when it happens.   \n\nA simple \"You do not treat me like that\" will suffice.  \nEither he will modify his behavior, or he will not.  \nAnd you will do what you need to do in response.    \n\nSet your boundaries, lady. If you allow people to treat you poorly, they will.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;People, not just females, can be rude.&lt;br/&gt;\nThis is not your bf&amp;#39;s fault.&lt;br/&gt;\nIt is not your fault.&lt;br/&gt;\nPeople can be rude.  &lt;/p&gt;\n\n&lt;p&gt;What you do have control over is how you respond to it and how you let it affect you and your relationship.  &lt;/p&gt;\n\n&lt;p&gt;If your bf is putting you on ignore at times, that is a problem to address immediately when it happens.   &lt;/p&gt;\n\n&lt;p&gt;A simple &amp;quot;You do not treat me like that&amp;quot; will suffice.&lt;br/&gt;\nEither he will modify his behavior, or he will not.&lt;br/&gt;\nAnd you will do what you need to do in response.    &lt;/p&gt;\n\n&lt;p&gt;Set your boundaries, lady. If you allow people to treat you poorly, they will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7wezs", "score_hidden": false, "stickied": false, "created": 1492133561.0, "created_utc": 1492104761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 22}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg7yvuo", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "applegranite", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;He always comments about how ugly he is and how he hates how he looks and doesn't understand the attention he gets.\n\nMaybe he thinks the same about you that you do about him.\n\n&gt; but on the other hand he has definitely checked out other women before and sort of put me on ignore (or at least sort of gone out of his way to not be near me). \n\nYour boyfriend comes off well, except for here. Checking out other women is pretty normal, but going out of his way to not be near you is not. \n\nDoes he compliment you? Make you feel beautiful? Or does he make you feel like you're right about not being hot?\n\nMy husband is better looking than me (mostly because I'm overweight and he's not). I never have the issues you describe because I am confident both in myself and in our relationship. Working on your confidence independent of your looks will help. Practice walking taller and making more eye contact. Even if you don't believe it at first, others will.", "edited": 1492107806.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;He always comments about how ugly he is and how he hates how he looks and doesn&amp;#39;t understand the attention he gets.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Maybe he thinks the same about you that you do about him.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;but on the other hand he has definitely checked out other women before and sort of put me on ignore (or at least sort of gone out of his way to not be near me). &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your boyfriend comes off well, except for here. Checking out other women is pretty normal, but going out of his way to not be near you is not. &lt;/p&gt;\n\n&lt;p&gt;Does he compliment you? Make you feel beautiful? Or does he make you feel like you&amp;#39;re right about not being hot?&lt;/p&gt;\n\n&lt;p&gt;My husband is better looking than me (mostly because I&amp;#39;m overweight and he&amp;#39;s not). I never have the issues you describe because I am confident both in myself and in our relationship. Working on your confidence independent of your looks will help. Practice walking taller and making more eye contact. Even if you don&amp;#39;t believe it at first, others will.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg7yvuo", "score_hidden": false, "stickied": false, "created": 1492136184.0, "created_utc": 1492107384.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8bst9", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "socalidreamer005", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Some People are dicks. I get where you're coming from. The guys I date are usually better looking than me. Not intentionally, I'm just not a very pretty girl. I look alright if I put 45 mins into it but I'm pretty lazy and low maintenance so I don't bother usually. You know those before and after pictures of girls with and without makeup and the difference is shocking? That's my face. I've accepted it and I'm better off for it. I'm not the prettiest girl but I am funny, smart, and kind. You just have to focus on that. Girls can be horribly cruel. The type of girls that do this are usually horrible people that have nothing going for them. It sounds like your boyfriend is doing the best he can to shoo away the attention. It's true all guys check out other girls but given how you're feeling right now I would suggest talking to him and asking him to try to tone it down until you two work through this. He sounds like a good guy that loves you. You both sound like you struggle with self esteem issues so maybe counseling would help with that. This may sound silly but sometimes little things like new clothes, makeup, new hair, etc will do wonders for your self esteem. If you're insecure about something specific (weight, acne, stained teeth, etc) try to fix it. You'll feel so much better for it afterwards, it's the little things that can boost your confidence. A $30 drugstore teeth whitening kit made me feel like a million bucks for a week straight. Don't be so hard on yourself, not everyone is a model and that's OK. I'm sure you're prettier than you think you are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some People are dicks. I get where you&amp;#39;re coming from. The guys I date are usually better looking than me. Not intentionally, I&amp;#39;m just not a very pretty girl. I look alright if I put 45 mins into it but I&amp;#39;m pretty lazy and low maintenance so I don&amp;#39;t bother usually. You know those before and after pictures of girls with and without makeup and the difference is shocking? That&amp;#39;s my face. I&amp;#39;ve accepted it and I&amp;#39;m better off for it. I&amp;#39;m not the prettiest girl but I am funny, smart, and kind. You just have to focus on that. Girls can be horribly cruel. The type of girls that do this are usually horrible people that have nothing going for them. It sounds like your boyfriend is doing the best he can to shoo away the attention. It&amp;#39;s true all guys check out other girls but given how you&amp;#39;re feeling right now I would suggest talking to him and asking him to try to tone it down until you two work through this. He sounds like a good guy that loves you. You both sound like you struggle with self esteem issues so maybe counseling would help with that. This may sound silly but sometimes little things like new clothes, makeup, new hair, etc will do wonders for your self esteem. If you&amp;#39;re insecure about something specific (weight, acne, stained teeth, etc) try to fix it. You&amp;#39;ll feel so much better for it afterwards, it&amp;#39;s the little things that can boost your confidence. A $30 drugstore teeth whitening kit made me feel like a million bucks for a week straight. Don&amp;#39;t be so hard on yourself, not everyone is a model and that&amp;#39;s OK. I&amp;#39;m sure you&amp;#39;re prettier than you think you are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8bst9", "score_hidden": false, "stickied": false, "created": 1492150903.0, "created_utc": 1492122103.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8fy0z", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "crochet_away", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think there's a solution to your problem right in your post. It makes you feel better when your BF pays attention to you and acknowledges you as his girlfriend in the face of other women hitting on him.\n\nNow it's time for a conversation. Here's a sample script:\n\n\"BF, when we go out together, you get hit on. As part of that, other girls are mean to me. I'd really appreciate it if you could show we were together. Please [put your arm around me/hold my hand/kiss my cheek/sit next to me/whatever]. It's really reassuring. Is this something you're willing to try?\"\n\nYou'll notice that nothing in this script compares your attractiveness or relative desirability. It's just talking about a problem and presenting a solution. Mostly, your BF comes across as a good guy in this post. One thing I'll say: he might respond more warmly than you'd like to other women because he has low self-esteem too. That's something to address in a different conversation, though.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think there&amp;#39;s a solution to your problem right in your post. It makes you feel better when your BF pays attention to you and acknowledges you as his girlfriend in the face of other women hitting on him.&lt;/p&gt;\n\n&lt;p&gt;Now it&amp;#39;s time for a conversation. Here&amp;#39;s a sample script:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;BF, when we go out together, you get hit on. As part of that, other girls are mean to me. I&amp;#39;d really appreciate it if you could show we were together. Please [put your arm around me/hold my hand/kiss my cheek/sit next to me/whatever]. It&amp;#39;s really reassuring. Is this something you&amp;#39;re willing to try?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ll notice that nothing in this script compares your attractiveness or relative desirability. It&amp;#39;s just talking about a problem and presenting a solution. Mostly, your BF comes across as a good guy in this post. One thing I&amp;#39;ll say: he might respond more warmly than you&amp;#39;d like to other women because he has low self-esteem too. That&amp;#39;s something to address in a different conversation, though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8fy0z", "score_hidden": false, "stickied": false, "created": 1492156421.0, "created_utc": 1492127621.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg98hpa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "alliandoalice", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Start making out with him when girls start hitting on him just to see their faces, have fun with it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Start making out with him when girls start hitting on him just to see their faces, have fun with it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98hpa", "score_hidden": false, "stickied": false, "created": 1492210818.0, "created_utc": 1492182018.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8i79z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "marydaenerys", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thats so sad! But gives me hope hehe. What matters is that he finds YOU beautiful!!!!!!!!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thats so sad! But gives me hope hehe. What matters is that he finds YOU beautiful!!!!!!!!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8i79z", "score_hidden": false, "stickied": false, "created": 1492159526.0, "created_utc": 1492130726.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8mdvx", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "euhok", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I am sorry that you are going through this. I believe firmly that a relationship should always make people feel better about themselves. Regardless of WHY this relationship is making you feel bad about yourself, you should acknowledge how you are feeling and look at the situation as objectively as possible and decide if it's worth working on. \n\nThere's nothing wrong with having a large difference in physical attractiveness, intelligence, social status or financial stability, but some incompatibilities can be deal breakers depending on the individual. It's important to recognize when to cut your loss so you can spend time on relationships that make you feel GOOD about yourself.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry that you are going through this. I believe firmly that a relationship should always make people feel better about themselves. Regardless of WHY this relationship is making you feel bad about yourself, you should acknowledge how you are feeling and look at the situation as objectively as possible and decide if it&amp;#39;s worth working on. &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s nothing wrong with having a large difference in physical attractiveness, intelligence, social status or financial stability, but some incompatibilities can be deal breakers depending on the individual. It&amp;#39;s important to recognize when to cut your loss so you can spend time on relationships that make you feel GOOD about yourself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8mdvx", "score_hidden": false, "stickied": false, "created": 1492165300.0, "created_utc": 1492136500.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8zcq4", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Burtonish", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You know, you could be the prettiest woman on this planet and other women would still treat you the same way just because they're jealous of you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You know, you could be the prettiest woman on this planet and other women would still treat you the same way just because they&amp;#39;re jealous of you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8zcq4", "score_hidden": false, "stickied": false, "created": 1492193592.0, "created_utc": 1492164792.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg92y3k", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Sisko-ire", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Don't beat yourself up so much. Take a step back and really examine the behaviour of these types of women. Is this the type of behaviour a good person with empathy and completey free of insecurities would partake in? No its not.\n\nThis is a huge window into their own self image and personality and it's ugly and pathetic. Can you ever imagine yourself being single  - seeing a guy you find attractive at a bar - seeing the guys GF and deeming yourself better looking than the GF and thus approach the couple and say nasty things like that about the girl thinking you'd win the guy???\n\nI mean really? Think about the level of toxicity and insucurity and narrisism that would produce such thinking. Pathetic right?\n\nExactly, you are genuinely better than these women if this is how they behave and think. \n\nWhen this type of thing happens, you need not allow it make YOU feel insecure, becuase you realise how sad and pathetic this type of behaviour is and how it's something you'd never do. Instantly you have the power , you are superior and they are the pathetic insecure ones because this is the actual reality.\n\nThese situations should not make you feel insecure, they should do the opposite as you witness this primitive behaviour from insecure women who's only sense of self worth is their physical appearance. \n\nSure these women would currently have no issues getting one night stands, but a fulling successful relationship? Ha, they have a lot more growing up to do before they'd get anywhere close to the type of relationship you enjoy.\n\nPity them, be amused by them, be disappointed in how simple their thinking is but don't let these situations make you feel less about yourself, because the opposite should be happening​. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t beat yourself up so much. Take a step back and really examine the behaviour of these types of women. Is this the type of behaviour a good person with empathy and completey free of insecurities would partake in? No its not.&lt;/p&gt;\n\n&lt;p&gt;This is a huge window into their own self image and personality and it&amp;#39;s ugly and pathetic. Can you ever imagine yourself being single  - seeing a guy you find attractive at a bar - seeing the guys GF and deeming yourself better looking than the GF and thus approach the couple and say nasty things like that about the girl thinking you&amp;#39;d win the guy???&lt;/p&gt;\n\n&lt;p&gt;I mean really? Think about the level of toxicity and insucurity and narrisism that would produce such thinking. Pathetic right?&lt;/p&gt;\n\n&lt;p&gt;Exactly, you are genuinely better than these women if this is how they behave and think. &lt;/p&gt;\n\n&lt;p&gt;When this type of thing happens, you need not allow it make YOU feel insecure, becuase you realise how sad and pathetic this type of behaviour is and how it&amp;#39;s something you&amp;#39;d never do. Instantly you have the power , you are superior and they are the pathetic insecure ones because this is the actual reality.&lt;/p&gt;\n\n&lt;p&gt;These situations should not make you feel insecure, they should do the opposite as you witness this primitive behaviour from insecure women who&amp;#39;s only sense of self worth is their physical appearance. &lt;/p&gt;\n\n&lt;p&gt;Sure these women would currently have no issues getting one night stands, but a fulling successful relationship? Ha, they have a lot more growing up to do before they&amp;#39;d get anywhere close to the type of relationship you enjoy.&lt;/p&gt;\n\n&lt;p&gt;Pity them, be amused by them, be disappointed in how simple their thinking is but don&amp;#39;t let these situations make you feel less about yourself, because the opposite should be happening​. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg92y3k", "score_hidden": false, "stickied": false, "created": 1492202662.0, "created_utc": 1492173862.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg94ynq", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "frodofalafel", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "There's not a lot you can do about this. But it's important to remember, he chose you, not one of these other girls. You have to trust him and thr fact that he obviously cares very little about how others look. Just be greatful and proud that you have a good boyfriend that makes you happy.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s not a lot you can do about this. But it&amp;#39;s important to remember, he chose you, not one of these other girls. You have to trust him and thr fact that he obviously cares very little about how others look. Just be greatful and proud that you have a good boyfriend that makes you happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg94ynq", "score_hidden": false, "stickied": false, "created": 1492206037.0, "created_utc": 1492177237.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg95ajw", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "vivvienne", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Just own it.  Why do those women approach him?  It's not because you're ugly, it's because they think you're a pushover.  I'd bet you come off as timid and it's written all over your body language.  I'm bit of an unapologetic snarky person though I would've said something like 'what, not enough men out there in the world for you or are you just that desperate because no single guy wants you?'\n\nSomething like that.  I don't care I'm never going to see them again nor do I want to be associated with people like that.  The fact of the matter is that he's with you, not anyone else so clearly you rock in your own way.", "edited": 1492178252.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just own it.  Why do those women approach him?  It&amp;#39;s not because you&amp;#39;re ugly, it&amp;#39;s because they think you&amp;#39;re a pushover.  I&amp;#39;d bet you come off as timid and it&amp;#39;s written all over your body language.  I&amp;#39;m bit of an unapologetic snarky person though I would&amp;#39;ve said something like &amp;#39;what, not enough men out there in the world for you or are you just that desperate because no single guy wants you?&amp;#39;&lt;/p&gt;\n\n&lt;p&gt;Something like that.  I don&amp;#39;t care I&amp;#39;m never going to see them again nor do I want to be associated with people like that.  The fact of the matter is that he&amp;#39;s with you, not anyone else so clearly you rock in your own way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg95ajw", "score_hidden": false, "stickied": false, "created": 1492206525.0, "created_utc": 1492177725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg99hw1", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Thrumpledenoozitty", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Stand up for yourself for a change. It doesn't matter how attractive you are or how attractive other people find you. It's to do with the way you carry yourself and how much respect you have for yourself. It's obvious you have low self-esteem and no self-respect, and so you let people push you around and walk all over you, let them say astonishingly rude things to/about you, and even try to physically push you aside. Yes, it's up to your bf to shut down any advances other people make on him, but there's a point where you also have to speak up and not let people treat you this way.\n\nWhere's your self-respect, girl? Don't stand for this shit. It's not about your boyfriend, it's about *you*. When you hear people talking shit about you, call them out on it. Look them in the eye and say, \"Oh, that's such a rude thing to say,\" or, \"You obviously weren't raised with any manners,\" or whatever. When people push you physically out of the way, look them in the eye again and say, \"EXCUSE YOU!\"\n\nDon't shy away, shrink back, cower, or ignore when people treat you like crap. Hold your head high, make lots of eye contact, and show them they are messing with the wrong person. Carry yourself with dignity and don't be afraid to speak back to people. I know that's hard to do at first, but the more practice you get, the easier it is. Just know the value and worth you have as a person is NOT dependent on your boyfriend, neither is it dependent on how physically attractive you are. It's dependent on how much you feed it. You rock. Get in touch with that part of you that is amazing, feed it, nurture it, and don't let people put you down!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stand up for yourself for a change. It doesn&amp;#39;t matter how attractive you are or how attractive other people find you. It&amp;#39;s to do with the way you carry yourself and how much respect you have for yourself. It&amp;#39;s obvious you have low self-esteem and no self-respect, and so you let people push you around and walk all over you, let them say astonishingly rude things to/about you, and even try to physically push you aside. Yes, it&amp;#39;s up to your bf to shut down any advances other people make on him, but there&amp;#39;s a point where you also have to speak up and not let people treat you this way.&lt;/p&gt;\n\n&lt;p&gt;Where&amp;#39;s your self-respect, girl? Don&amp;#39;t stand for this shit. It&amp;#39;s not about your boyfriend, it&amp;#39;s about &lt;em&gt;you&lt;/em&gt;. When you hear people talking shit about you, call them out on it. Look them in the eye and say, &amp;quot;Oh, that&amp;#39;s such a rude thing to say,&amp;quot; or, &amp;quot;You obviously weren&amp;#39;t raised with any manners,&amp;quot; or whatever. When people push you physically out of the way, look them in the eye again and say, &amp;quot;EXCUSE YOU!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t shy away, shrink back, cower, or ignore when people treat you like crap. Hold your head high, make lots of eye contact, and show them they are messing with the wrong person. Carry yourself with dignity and don&amp;#39;t be afraid to speak back to people. I know that&amp;#39;s hard to do at first, but the more practice you get, the easier it is. Just know the value and worth you have as a person is NOT dependent on your boyfriend, neither is it dependent on how physically attractive you are. It&amp;#39;s dependent on how much you feed it. You rock. Get in touch with that part of you that is amazing, feed it, nurture it, and don&amp;#39;t let people put you down!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg99hw1", "score_hidden": false, "stickied": false, "created": 1492212048.0, "created_utc": 1492183248.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg97k4h", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "redditispoison12345", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If your boyfriend is model hot, you probably are too.  That's the way it works", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If your boyfriend is model hot, you probably are too.  That&amp;#39;s the way it works&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg97k4h", "score_hidden": false, "stickied": false, "created": 1492209632.0, "created_utc": 1492180832.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_656vj2", "likes": null, "replies": "", "user_reports": [], "id": "dg8syz9", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "StealthyGunnar", "parent_id": "t1_dg8r1hi", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Kind of unfair to pin all of OP's insecurities on her boyfriend, don't you think?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Kind of unfair to pin all of OP&amp;#39;s insecurities on her boyfriend, don&amp;#39;t you think?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8syz9", "score_hidden": false, "stickied": false, "created": 1492176026.0, "created_utc": 1492147226.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8r1hi", "gilded": 0, "archived": false, "score": -3, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_656vj2", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[deleted]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8r1hi", "score_hidden": false, "stickied": false, "created": 1492172469.0, "created_utc": 1492143669.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -3}}], "after": null, "before": null}}]