[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve typed and re-typed this about 20 times. Throwaway, of course... Although some things are so specific, if he reads this, he&amp;#39;d know. But honestly, I don&amp;#39;t care anymore. I&amp;#39;d apologize for the novel of text but well, this is believe it or not, a Cliff&amp;#39;s Notes version. &lt;/p&gt;\n\n&lt;p&gt;I am so so desperate to talk to someone that may have or is going through this, that is not in my group of friends or immediate family, as the advice I seem to constantly get it, &amp;quot;stay in the marriage. You&amp;#39;ll be sorry.&amp;quot; or &amp;quot;I know xxx who left her husband, and she is miserable, and wished she tried to work it out.&amp;quot;\n The reason I hear?  &amp;quot;you think it&amp;#39;s difficult now? Just wait until you&amp;#39;re single with 2 kids.&amp;quot; And of course I stay for any possible damage this may have on my daughter (this will make sense why just my daughter further down). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve spoken to a therapist, our pastor at church (I&amp;#39;m not heavily involved with my church, but they&amp;#39;ve been a great support when needed)..We&amp;#39;ve gone to a therapist as a couple... really everyone and anyone who will listen, to the point that I&amp;#39;m sick of hearing myself.\n (Even if one person reads this and has sound advice... win. And thanks in advance)&lt;/p&gt;\n\n&lt;p&gt;When we met, we instantly hit it off. We had all the same interests, beliefs, hobbies, you name it. We really were a perfect couple in many ways. Looking back though, it was more of a &amp;quot;perfection on paper&amp;quot; coupling, and not down to the fundamentals of who were really are, and what in the long run, we want out of life - If that makes any sense. &lt;/p&gt;\n\n&lt;p&gt;Anyway, we quickly fell in love, and were engaged in record time. We had a small intimate wedding, that was very inexpensive (will make sense why I mention this later), and basically became pregnant on the honeymoon. We were surprised, but also were thrilled. I gave birth to a beautiful, healthy baby girl, that we both fell head-over-heals in love with, and so we settled into life as a little family of 3. &lt;/p&gt;\n\n&lt;p&gt;We both worked full-time, and this seemed to work just fine. I had always worked, and didn&amp;#39;t think any different after we had our daughter, so back to work I went. Of course it was a challenging adjustment to be a working mom, but I settled into the new routine. I was her primary care-taker; meaning, it was a little like pulling teeth to get him to be a hands on dad while she was little. I didn&amp;#39;t mind, because I can honestly say, I was meant to be a mom. I was good at it, and absolutely loved every minute. &lt;/p&gt;\n\n&lt;p&gt;But as the marriage continued, I was getting very frustrated with the financial set up he insisted on. He refused (REFUSED) to combine our finances (details I should have gotten before the wedding, yes, but I just assumed. Yes, ass out of you and me, I get it). I recommended every possible arrangement: All in one pot for everything, each contributing a % of our paychecks, just an account for family expenses; keeping our own accounts for any extra spending, on and on and on. But none of these options &amp;#39;worked for him.&amp;#39; But the problem with this little arrangement, he makes almost 3 times the money I made, but I was still expected to split our expenses 50/50. But there seemed nothing could be done, as I would bring it up time and again, with being in the same place as before, and in a nasty fight. So I just left it as is. So the resentment began.  &lt;/p&gt;\n\n&lt;p&gt;It felt like I had just put up my maternity clothes when we found out I was again, pregnant. We were very surprised (I was on birth control that since has been shown not to work as effectively as others), but excited to add to our little family. &lt;/p&gt;\n\n&lt;p&gt;I found out my son wouldn&amp;#39;t be born healthy toward the end of my pregnancy. If you are a parent, you know... Well, let&amp;#39;s just say, there are no words to how I felt. The fact he was born with even more life-threatening complications than what doctors previously thought, sent me into a tailspin. &lt;/p&gt;\n\n&lt;p&gt;After he was born, I put my job as an executive manager at a busy marketing firm on hold through his numerous surgeries following his birth, throwing myself into the role of caretaker more than wife and mother. My husband did the best he knew how with our daughter - But I can&amp;#39;t lie now: That was the easiest end of the stick. Having help with her from family and friends, while he basically continued with his life: job, hobbies, working in the yard, etc. Of course, this coupled with the financial arrangement is where the resentment began to fester. &lt;/p&gt;\n\n&lt;p&gt;I was very lucky to have my support of my older sister, who after my father&amp;#39;s death when I was very young, stepped in as my care-taker when my mother, left broken-hearted, went into a deep depression. &lt;/p&gt;\n\n&lt;p&gt;For lack of better words, my sister basically stepped in as my &amp;quot;spouse&amp;quot;- My partner. As in she was the one there from all my appointments with my obgyn during a complicated pregnancy, to all of his specialists appointments, hospitalizations, etc.; Traveling around the country with me to find answers for many mysterious conditions that popped up, running any errand I needed, and even as his nanny when I had to go back to work full-time, when he was just 3 months old. [she luckily can stay home as her husband earns enough to support her as a stay-at-home-mom] &lt;/p&gt;\n\n&lt;p&gt;During this time, it became very apparent that we were on totally different pages. The sicker my son became, and the more time away from the house I was, my husband became angry, distant, short, uncooperative. &lt;/p&gt;\n\n&lt;p&gt;He was 100% not involved with his care. I was basically left to be his care-taker 100% of the time, unless he was with my sister while I was at work. This was day and night, while he basically kept to his regular routine, and I was floundering making it all work. Icing on the cake: He was critical of me from housekeeping, to lack of cooking, or laundry, or, you name in. DESPITE the fact I too was working full-time, as much as he worked, PLUS being the primary care-taker of both of our small children: One of which was extremely medically involved. Adding this to an already festering grudge about the finances. But, I trudged on. &lt;/p&gt;\n\n&lt;p&gt;And before moving on, I will sadly say, it isn&amp;#39;t what most may think: A father having a difficult time facing the fact his son wasn&amp;#39;t healthy and not knowing how to coupe. Unfortunately, I know from the bottom of my heart, it was more about it taking away from his (my husband&amp;#39;s) needs and it being inconvenient for him. I&amp;#39;m not trying to be ugly - It just is what it is.  &lt;/p&gt;\n\n&lt;p&gt;Back to the financial issues: So here we are, &amp;quot;splitting expenses 50/50&amp;quot;. But the problem was, I was the one to take care of every birthday gift for other children&amp;#39;s parties, their own birthday parties, Christmas gifts for BOTH kids...any after school activities, like ballet, for our daughter. In a nutshell I was paying all utilities, my own car payment, and any child related expenses, while he took care of the mortgage, and his personal bills (car, plus he had a lot of debt I wasn&amp;#39;t really aware of before marriage. Yes, I know. Hindsight).&lt;/p&gt;\n\n&lt;p&gt;I became extremely depressed shortly after returning to work, as lack of sleep, lack of support from my husband, being criticized, and my son&amp;#39;s declining health, absolutely consumed me. When I say lack of sleep, I&amp;#39;m not talking typical new baby lack of sleep. I&amp;#39;m talking maybe averaging a hand-full of hours of sleep between 3-4 days. Where I wondered at what point could a person die from lack of sleep. &lt;/p&gt;\n\n&lt;p&gt;But I kept going. I became stronger. I kicked ass at it. I became a machine between working full-time, dealing with all 10 specialists, 9 different daily meds, therapy appointments, insurance navigation, even becoming involved with helping other parents of children with special needs, volunteering at the hospital, being asked to speak at different events telling my son&amp;#39;s story, all while being a mom to another child that had just turned two. Yep, you may be thinking, &amp;quot;but when were you a wife?&amp;quot; I will admit. I wasn&amp;#39;t a good wife. But how could I be? When every ounce of my soul was devoted to caring for our two very little kids, with no real financial or emotional support from him. I had nothing left to give to him. Most of my time was spent in hospitals, or researching possible treatments to help our son. I&amp;#39;ve said this so many times to him: &amp;quot;You left me alone to deal with our sick son, and then wonder why I don&amp;#39;t have any want to be a good wife. If you had just hung in there and supported me while I did this for our family, I would be a good wife now. But you didn&amp;#39;t. And I have nothing left for you.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;This all took a toll on me over time. Looking back, I think I had a small mental break when my son was about 3. I still kept it together for my kids, but I spontaneously resigned from my job, and without consulting with him, chose to stay home. I know how that sounds in itself, but we were already financially separate, and I never asked for anything to change. I had some money I had saved over the years, and financial support if needed from my sister, so I continued to contribute as I had before. &lt;/p&gt;\n\n&lt;p&gt;The strange thing was, his resentment boiled over, because now, &amp;quot;I didn&amp;#39;t work, and just stayed home all day.&amp;quot; Despite my son not being able to be in a typical school environment, and before me staying home, had been relying on sub-par care-takers, supplied by the state that just simply made my life harder. So I decided to do what in my heart was best for my son, and that was to be his mom. His care-taker. &lt;/p&gt;\n\n&lt;p&gt;I continue to this day (he&amp;#39;s only 5) to stay home with him, and will probably look into part-time work once he&amp;#39;s in a kindergarten program. This, I have zero regrets. My house may not be imaculate at all times, but my children are well adjusted, happy, and loved, because I spend time with them when I can, instead of obsessively cleaning. I&amp;#39;m here for both of my children, and it was the best decision I could have made. To him though, I now &amp;quot;contribute nothing to the marriage.&amp;quot; His actual words to me. &lt;/p&gt;\n\n&lt;p&gt;Today at age 5, my son&amp;#39;s health has stabilized for the most part. He will have life-long issues, but he began to be hospitalized less, and through work with his therapist, became stronger. &lt;/p&gt;\n\n&lt;p&gt;I need to say this. My husband has always been a good father to our daughter... I say &amp;#39;good&amp;#39; rather than great, or wonderful, because, well, I think that&amp;#39;s the best rating I could give him. Don&amp;#39;t get me wrong, he loves our little girl more than life, and he does the best as he is capable of. But time and time again, he chooses the path that is most convenient and comfortable for him. He wasn&amp;#39;t given tools growing up, as he was raised by a mentally unstable mom, and ran away from home very young. He has always been used to being independent, looking out for himself. I knew this going into the marriage, but thought with time, and with a family, this would change that. It has not. &lt;/p&gt;\n\n&lt;p&gt;As for me. I can be a hot mess at times, and have never denied that. I am disorganized (unless it has to do with my children) and a little all over the place. I have a pretty severe case of ADHD, which doesn&amp;#39;t help being a good housekeeper all the time, and even had a pretty serious learning disability throughout school, but was able to graduate with honors from a university. I am not seeking sympathy, because I am extremely fortunate in SO many ways. I have an extremely large support system from family and friends, have never experienced the feeling of being &amp;quot;hungry&amp;quot;, have never been physically abused, do not live in a worn-torn country (ok fine, this may sound like white girl problems.) I simply do not know what I should do with the situation I find myself in. &lt;/p&gt;\n\n&lt;p&gt;&amp;#39;What I want&amp;#39; is something I think about a lot. An equal partner in life. One I can take care of, and who wants and enjoys, taking care of me and enjoys being a co-parent to 2 amazing little beings. Respects me and appreciates me for who I am, faults and all. I just don&amp;#39;t think that person is the person I&amp;#39;m married to, and I have no clue what to do. &lt;/p&gt;\n\n&lt;p&gt;I have already asked him to move out, to which he has refused. The strange thing is, he wants to stayed married, says he loves me/is crazy about me, and doesn&amp;#39;t want to split. We will have huge fall outs to which he promises to work on things, but it just falls back to before. &lt;/p&gt;\n\n&lt;p&gt;Even though I can&amp;#39;t seem to do anything right and really make him happy, he wants this marriage. I&amp;#39;ve agreed time and again to try to make this work, but I&amp;#39;m at the end of my rope. This has been going on for 5 years, and I just want this to be done. Thanks for listening.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Married to a pretty selfish man, 2 kids, one very medically involved, and I think I&amp;#39;m done after realizing I can never make him happy. But no idea what to do next, because he is adamant we stay together.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've typed and re-typed this about 20 times. Throwaway, of course... Although some things are so specific, if he reads this, he'd know. But honestly, I don't care anymore. I'd apologize for the novel of text but well, this is believe it or not, a Cliff's Notes version. \n\nI am so so desperate to talk to someone that may have or is going through this, that is not in my group of friends or immediate family, as the advice I seem to constantly get it, \"stay in the marriage. You'll be sorry.\" or \"I know xxx who left her husband, and she is miserable, and wished she tried to work it out.\"\n The reason I hear?  \"you think it's difficult now? Just wait until you're single with 2 kids.\" And of course I stay for any possible damage this may have on my daughter (this will make sense why just my daughter further down). \n\nI've spoken to a therapist, our pastor at church (I'm not heavily involved with my church, but they've been a great support when needed)..We've gone to a therapist as a couple... really everyone and anyone who will listen, to the point that I'm sick of hearing myself.\n (Even if one person reads this and has sound advice... win. And thanks in advance)\n\nWhen we met, we instantly hit it off. We had all the same interests, beliefs, hobbies, you name it. We really were a perfect couple in many ways. Looking back though, it was more of a \"perfection on paper\" coupling, and not down to the fundamentals of who were really are, and what in the long run, we want out of life - If that makes any sense. \n\nAnyway, we quickly fell in love, and were engaged in record time. We had a small intimate wedding, that was very inexpensive (will make sense why I mention this later), and basically became pregnant on the honeymoon. We were surprised, but also were thrilled. I gave birth to a beautiful, healthy baby girl, that we both fell head-over-heals in love with, and so we settled into life as a little family of 3. \n\nWe both worked full-time, and this seemed to work just fine. I had always worked, and didn't think any different after we had our daughter, so back to work I went. Of course it was a challenging adjustment to be a working mom, but I settled into the new routine. I was her primary care-taker; meaning, it was a little like pulling teeth to get him to be a hands on dad while she was little. I didn't mind, because I can honestly say, I was meant to be a mom. I was good at it, and absolutely loved every minute. \n\nBut as the marriage continued, I was getting very frustrated with the financial set up he insisted on. He refused (REFUSED) to combine our finances (details I should have gotten before the wedding, yes, but I just assumed. Yes, ass out of you and me, I get it). I recommended every possible arrangement: All in one pot for everything, each contributing a % of our paychecks, just an account for family expenses; keeping our own accounts for any extra spending, on and on and on. But none of these options 'worked for him.' But the problem with this little arrangement, he makes almost 3 times the money I made, but I was still expected to split our expenses 50/50. But there seemed nothing could be done, as I would bring it up time and again, with being in the same place as before, and in a nasty fight. So I just left it as is. So the resentment began.  \n\nIt felt like I had just put up my maternity clothes when we found out I was again, pregnant. We were very surprised (I was on birth control that since has been shown not to work as effectively as others), but excited to add to our little family. \n\nI found out my son wouldn't be born healthy toward the end of my pregnancy. If you are a parent, you know... Well, let's just say, there are no words to how I felt. The fact he was born with even more life-threatening complications than what doctors previously thought, sent me into a tailspin. \n\nAfter he was born, I put my job as an executive manager at a busy marketing firm on hold through his numerous surgeries following his birth, throwing myself into the role of caretaker more than wife and mother. My husband did the best he knew how with our daughter - But I can't lie now: That was the easiest end of the stick. Having help with her from family and friends, while he basically continued with his life: job, hobbies, working in the yard, etc. Of course, this coupled with the financial arrangement is where the resentment began to fester. \n\nI was very lucky to have my support of my older sister, who after my father's death when I was very young, stepped in as my care-taker when my mother, left broken-hearted, went into a deep depression. \n\nFor lack of better words, my sister basically stepped in as my \"spouse\"- My partner. As in she was the one there from all my appointments with my obgyn during a complicated pregnancy, to all of his specialists appointments, hospitalizations, etc.; Traveling around the country with me to find answers for many mysterious conditions that popped up, running any errand I needed, and even as his nanny when I had to go back to work full-time, when he was just 3 months old. [she luckily can stay home as her husband earns enough to support her as a stay-at-home-mom] \n\nDuring this time, it became very apparent that we were on totally different pages. The sicker my son became, and the more time away from the house I was, my husband became angry, distant, short, uncooperative. \n\nHe was 100% not involved with his care. I was basically left to be his care-taker 100% of the time, unless he was with my sister while I was at work. This was day and night, while he basically kept to his regular routine, and I was floundering making it all work. Icing on the cake: He was critical of me from housekeeping, to lack of cooking, or laundry, or, you name in. DESPITE the fact I too was working full-time, as much as he worked, PLUS being the primary care-taker of both of our small children: One of which was extremely medically involved. Adding this to an already festering grudge about the finances. But, I trudged on. \n\nAnd before moving on, I will sadly say, it isn't what most may think: A father having a difficult time facing the fact his son wasn't healthy and not knowing how to coupe. Unfortunately, I know from the bottom of my heart, it was more about it taking away from his (my husband's) needs and it being inconvenient for him. I'm not trying to be ugly - It just is what it is.  \n\nBack to the financial issues: So here we are, \"splitting expenses 50/50\". But the problem was, I was the one to take care of every birthday gift for other children's parties, their own birthday parties, Christmas gifts for BOTH kids...any after school activities, like ballet, for our daughter. In a nutshell I was paying all utilities, my own car payment, and any child related expenses, while he took care of the mortgage, and his personal bills (car, plus he had a lot of debt I wasn't really aware of before marriage. Yes, I know. Hindsight).\n\nI became extremely depressed shortly after returning to work, as lack of sleep, lack of support from my husband, being criticized, and my son's declining health, absolutely consumed me. When I say lack of sleep, I'm not talking typical new baby lack of sleep. I'm talking maybe averaging a hand-full of hours of sleep between 3-4 days. Where I wondered at what point could a person die from lack of sleep. \n\nBut I kept going. I became stronger. I kicked ass at it. I became a machine between working full-time, dealing with all 10 specialists, 9 different daily meds, therapy appointments, insurance navigation, even becoming involved with helping other parents of children with special needs, volunteering at the hospital, being asked to speak at different events telling my son's story, all while being a mom to another child that had just turned two. Yep, you may be thinking, \"but when were you a wife?\" I will admit. I wasn't a good wife. But how could I be? When every ounce of my soul was devoted to caring for our two very little kids, with no real financial or emotional support from him. I had nothing left to give to him. Most of my time was spent in hospitals, or researching possible treatments to help our son. I've said this so many times to him: \"You left me alone to deal with our sick son, and then wonder why I don't have any want to be a good wife. If you had just hung in there and supported me while I did this for our family, I would be a good wife now. But you didn't. And I have nothing left for you.\" \n\nThis all took a toll on me over time. Looking back, I think I had a small mental break when my son was about 3. I still kept it together for my kids, but I spontaneously resigned from my job, and without consulting with him, chose to stay home. I know how that sounds in itself, but we were already financially separate, and I never asked for anything to change. I had some money I had saved over the years, and financial support if needed from my sister, so I continued to contribute as I had before. \n\nThe strange thing was, his resentment boiled over, because now, \"I didn't work, and just stayed home all day.\" Despite my son not being able to be in a typical school environment, and before me staying home, had been relying on sub-par care-takers, supplied by the state that just simply made my life harder. So I decided to do what in my heart was best for my son, and that was to be his mom. His care-taker. \n\nI continue to this day (he's only 5) to stay home with him, and will probably look into part-time work once he's in a kindergarten program. This, I have zero regrets. My house may not be imaculate at all times, but my children are well adjusted, happy, and loved, because I spend time with them when I can, instead of obsessively cleaning. I'm here for both of my children, and it was the best decision I could have made. To him though, I now \"contribute nothing to the marriage.\" His actual words to me. \n\nToday at age 5, my son's health has stabilized for the most part. He will have life-long issues, but he began to be hospitalized less, and through work with his therapist, became stronger. \n\nI need to say this. My husband has always been a good father to our daughter... I say 'good' rather than great, or wonderful, because, well, I think that's the best rating I could give him. Don't get me wrong, he loves our little girl more than life, and he does the best as he is capable of. But time and time again, he chooses the path that is most convenient and comfortable for him. He wasn't given tools growing up, as he was raised by a mentally unstable mom, and ran away from home very young. He has always been used to being independent, looking out for himself. I knew this going into the marriage, but thought with time, and with a family, this would change that. It has not. \n\nAs for me. I can be a hot mess at times, and have never denied that. I am disorganized (unless it has to do with my children) and a little all over the place. I have a pretty severe case of ADHD, which doesn't help being a good housekeeper all the time, and even had a pretty serious learning disability throughout school, but was able to graduate with honors from a university. I am not seeking sympathy, because I am extremely fortunate in SO many ways. I have an extremely large support system from family and friends, have never experienced the feeling of being \"hungry\", have never been physically abused, do not live in a worn-torn country (ok fine, this may sound like white girl problems.) I simply do not know what I should do with the situation I find myself in. \n\n'What I want' is something I think about a lot. An equal partner in life. One I can take care of, and who wants and enjoys, taking care of me and enjoys being a co-parent to 2 amazing little beings. Respects me and appreciates me for who I am, faults and all. I just don't think that person is the person I'm married to, and I have no clue what to do. \n\nI have already asked him to move out, to which he has refused. The strange thing is, he wants to stayed married, says he loves me/is crazy about me, and doesn't want to split. We will have huge fall outs to which he promises to work on things, but it just falls back to before. \n\nEven though I can't seem to do anything right and really make him happy, he wants this marriage. I've agreed time and again to try to make this work, but I'm at the end of my rope. This has been going on for 5 years, and I just want this to be done. Thanks for listening.\n  \n  ---   \n  **tl;dr**: Married to a pretty selfish man, 2 kids, one very medically involved, and I think I'm done after realizing I can never make him happy. But no idea what to do next, because he is adamant we stay together.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "657fwg", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 88, "report_reasons": null, "author": "heartbroken_12345", "saved": false, "mod_reports": [], "name": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/657fwg/i_35f_feel_stuck_in_my_marriage_9_years_with_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492137997.0, "url": "https://www.reddit.com/r/relationships/comments/657fwg/i_35f_feel_stuck_in_my_marriage_9_years_with_my/", "author_flair_text": null, "quarantine": false, "title": "I [35/F] feel stuck in my marriage [9 years] with my [36/M] husband.", "created_utc": 1492109197.0, "distinguished": null, "media": null, "upvote_ratio": 0.91, "num_comments": 85, "visited": false, "subreddit_type": "public", "ups": 88}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg959by", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "walk_through_this", "parent_id": "t1_dg931zo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "For what it's worth, I have had to leave a bad marriage myself. It's scary, but after a week in your new apartment, everything is easier.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For what it&amp;#39;s worth, I have had to leave a bad marriage myself. It&amp;#39;s scary, but after a week in your new apartment, everything is easier.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg959by", "score_hidden": false, "stickied": false, "created": 1492206475.0, "created_utc": 1492177675.0, "depth": 6, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg931zo", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8sv4l", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks. I think you are very right!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. I think you are very right!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg931zo", "score_hidden": false, "stickied": false, "created": 1492202867.0, "created_utc": 1492174067.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8sv4l", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "walk_through_this", "parent_id": "t1_dg86sqi", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This. You'll get more support out of him after divorcing him than you do now. Take the kids and go. \n\nThe whole idea of 'we split everything 50/50 and by 'everything' I just mean the things I want to split costs on, everything else is on you' is ridiculous. You're raising his children. He has a duty to support you in that. \n\nSeriously, he's not invested in this relationship in any meaningful way. Take the kids, leave and talk to a lawyer. In a year you will find yourself in a much, much better place. If nothing else, he'll likely be on the hook for daycare at a rate proportional to his income. So if he makes 3x what you make, he'll be saddled with 75% of daycare costs. \n\nLike I said, you'll get more support from him by divorcing him than you do now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This. You&amp;#39;ll get more support out of him after divorcing him than you do now. Take the kids and go. &lt;/p&gt;\n\n&lt;p&gt;The whole idea of &amp;#39;we split everything 50/50 and by &amp;#39;everything&amp;#39; I just mean the things I want to split costs on, everything else is on you&amp;#39; is ridiculous. You&amp;#39;re raising his children. He has a duty to support you in that. &lt;/p&gt;\n\n&lt;p&gt;Seriously, he&amp;#39;s not invested in this relationship in any meaningful way. Take the kids, leave and talk to a lawyer. In a year you will find yourself in a much, much better place. If nothing else, he&amp;#39;ll likely be on the hook for daycare at a rate proportional to his income. So if he makes 3x what you make, he&amp;#39;ll be saddled with 75% of daycare costs. &lt;/p&gt;\n\n&lt;p&gt;Like I said, you&amp;#39;ll get more support from him by divorcing him than you do now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8sv4l", "score_hidden": false, "stickied": false, "created": 1492175809.0, "created_utc": 1492147009.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 58}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86sqi", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg820gn", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you so much. I hope so too :) ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. I hope so too :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg86sqi", "score_hidden": false, "stickied": false, "created": 1492144800.0, "created_utc": 1492116000.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 24}}], "after": null, "before": null}}, "user_reports": [], "id": "dg820gn", "gilded": 0, "archived": false, "score": 111, "report_reasons": null, "author": "DRHdez", "parent_id": "t1_dg81pag", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Take the next step, consult with a divorce lawyer, your husband doesn't get to decide to stay married and continue his philosophy of \"what's yours is mine and what's mine is mine\". He will have to start actually providing financial support for his children.\n\nI wish you the best, honestly, you deserve to find a partner, I hope you do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take the next step, consult with a divorce lawyer, your husband doesn&amp;#39;t get to decide to stay married and continue his philosophy of &amp;quot;what&amp;#39;s yours is mine and what&amp;#39;s mine is mine&amp;quot;. He will have to start actually providing financial support for his children.&lt;/p&gt;\n\n&lt;p&gt;I wish you the best, honestly, you deserve to find a partner, I hope you do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg820gn", "score_hidden": false, "stickied": false, "created": 1492139547.0, "created_utc": 1492110747.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 111}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8zlfu", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8u817", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This was so nice to hear thank you! Glad thing are going well for you now. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This was so nice to hear thank you! Glad thing are going well for you now. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8zlfu", "score_hidden": false, "stickied": false, "created": 1492194377.0, "created_utc": 1492165577.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 10}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8u817", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Dada2fish", "parent_id": "t1_dg81pag", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "We have a lot in common. My situation is very similar to yours. Although my \"baby daddy\" and I weren't married, we did live together. I was overwhelmed, not supported and had festering resentment. I had a small mental break due to years of too much on my plate, loneliness and feeling trapped. He refused to leave. Long story short. We are now apart, I am a single mom doing 99% of the parenting while he is more of the \"fun uncle\". But I am much happier now. I want to give you a hug too because you sound like an amazing person. You husband has it too good. No wonder he wants to stay married to you. Forget your family/ friends opinion. Being a single mom can be a nice life. Better than feeling lonely, overwhelmed and unsupported. You deserve better. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We have a lot in common. My situation is very similar to yours. Although my &amp;quot;baby daddy&amp;quot; and I weren&amp;#39;t married, we did live together. I was overwhelmed, not supported and had festering resentment. I had a small mental break due to years of too much on my plate, loneliness and feeling trapped. He refused to leave. Long story short. We are now apart, I am a single mom doing 99% of the parenting while he is more of the &amp;quot;fun uncle&amp;quot;. But I am much happier now. I want to give you a hug too because you sound like an amazing person. You husband has it too good. No wonder he wants to stay married to you. Forget your family/ friends opinion. Being a single mom can be a nice life. Better than feeling lonely, overwhelmed and unsupported. You deserve better. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8u817", "score_hidden": false, "stickied": false, "created": 1492178623.0, "created_utc": 1492149823.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81pag", "gilded": 0, "archived": false, "score": 61, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg818yb", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Wow. You just wrapped my novel of a post into a few sentences. You are spot on. Thank you for making what I said make sense. You are so very right. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. You just wrapped my novel of a post into a few sentences. You are spot on. Thank you for making what I said make sense. You are so very right. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg81pag", "score_hidden": false, "stickied": false, "created": 1492139208.0, "created_utc": 1492110408.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 61}}], "after": null, "before": null}}, "user_reports": [], "id": "dg818yb", "gilded": 0, "archived": false, "score": 209, "report_reasons": null, "author": "DRHdez", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I just want to send you a hug. \n\nHonestly, I don't know how you have lasted this long. You have tried, you did everything in your power to make it work. You are basically a single parent who sometimes gets help from baby-daddy. You are not a couple anymore, if you ever were. I'm sorry.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want to send you a hug. &lt;/p&gt;\n\n&lt;p&gt;Honestly, I don&amp;#39;t know how you have lasted this long. You have tried, you did everything in your power to make it work. You are basically a single parent who sometimes gets help from baby-daddy. You are not a couple anymore, if you ever were. I&amp;#39;m sorry.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg818yb", "score_hidden": false, "stickied": false, "created": 1492138707.0, "created_utc": 1492109907.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 209}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8zmgw", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8wspe", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This brought tears to my eyes! Thank you so much ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This brought tears to my eyes! Thank you so much &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8zmgw", "score_hidden": false, "stickied": false, "created": 1492194467.0, "created_utc": 1492165667.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dga6fq5", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "BigOldCar", "parent_id": "t1_dg8wspe", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; The courts will make sure he financially takes responsibility for his children at the very least.\n\nThat's true!  They'll make him do what he refuses to while actually *in* the relationship.  \n\nIn that regard, divorce presents a much better situation.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The courts will make sure he financially takes responsibility for his children at the very least.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s true!  They&amp;#39;ll make him do what he refuses to while actually &lt;em&gt;in&lt;/em&gt; the relationship.  &lt;/p&gt;\n\n&lt;p&gt;In that regard, divorce presents a much better situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dga6fq5", "score_hidden": false, "stickied": false, "created": 1492253380.0, "created_utc": 1492224580.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wspe", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Helpmesupporthim", "parent_id": "t1_dg86xbz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;There is life after divorce and I'm not going to be alone forever.\n\nYou are already alone. He's not your partner. So already are alone.\n\nYou divorce him and be free to be happy. Free from his expectations of you as a wife. Free from his criticisms. Free from resentment. Free from pretending in front of your kids that you're in a happy family. And when you're ready, free to meet someone who can be a partner to you.\n\nYour sister has been phenomenal and you are incredibly fortunate to have a social support system. Don't let fear hold you back.\n\nYou have been a fantastic mother and a role model juggling work, children including one with special needs and a flailing marriage. You are a very capable person. You've shown yourself that time and time again. You'll keep kicking ass being a stay at home single mum. You are powerful beyond measure. Look how far you've come. Follow your instincts and the future will take care of itself.\n\nThe courts will make sure he financially takes responsibility for his children at the very least.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There is life after divorce and I&amp;#39;m not going to be alone forever.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are already alone. He&amp;#39;s not your partner. So already are alone.&lt;/p&gt;\n\n&lt;p&gt;You divorce him and be free to be happy. Free from his expectations of you as a wife. Free from his criticisms. Free from resentment. Free from pretending in front of your kids that you&amp;#39;re in a happy family. And when you&amp;#39;re ready, free to meet someone who can be a partner to you.&lt;/p&gt;\n\n&lt;p&gt;Your sister has been phenomenal and you are incredibly fortunate to have a social support system. Don&amp;#39;t let fear hold you back.&lt;/p&gt;\n\n&lt;p&gt;You have been a fantastic mother and a role model juggling work, children including one with special needs and a flailing marriage. You are a very capable person. You&amp;#39;ve shown yourself that time and time again. You&amp;#39;ll keep kicking ass being a stay at home single mum. You are powerful beyond measure. Look how far you&amp;#39;ve come. Follow your instincts and the future will take care of itself.&lt;/p&gt;\n\n&lt;p&gt;The courts will make sure he financially takes responsibility for his children at the very least.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8wspe", "score_hidden": false, "stickied": false, "created": 1492185339.0, "created_utc": 1492156539.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8qdka", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "ZaneLoss", "parent_id": "t1_dg86xbz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Also, leaving my partner to be a single parent was terrifying. But the freedom i felt without having the burden of unmet expectations... Was amazing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, leaving my partner to be a single parent was terrifying. But the freedom i felt without having the burden of unmet expectations... Was amazing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8qdka", "score_hidden": false, "stickied": false, "created": 1492171377.0, "created_utc": 1492142577.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8wspm", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "Helpmesupporthim", "parent_id": "t1_dg86xbz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;There is life after divorce and I'm not going to be alone forever.\n\nYou are already alone. He's not your partner. So already are alone.\n\nYou divorce him and be free to be happy. Free from his expectations of you as a wife. Free from his criticisms. Free from resentment. Free from pretending in front of your kids that you're in a happy family. And when you're ready, free to meet someone who can be a partner to you.\n\nYour sister has been phenomenal and you are incredibly fortunate to have a social support system. Don't let fear hold you back.\n\nYou have been a fantastic mother and a role model juggling work, children including one with special needs and a flailing marriage. You are a very capable person. You've shown yourself that time and time again. You'll keep kicking ass being a stay at home single mum. You are powerful beyond measure. Look how far you've come. Follow your instincts and the future will take care of itself.\n\nThe courts will make sure he financially takes responsibility for his children at the very least.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;There is life after divorce and I&amp;#39;m not going to be alone forever.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are already alone. He&amp;#39;s not your partner. So already are alone.&lt;/p&gt;\n\n&lt;p&gt;You divorce him and be free to be happy. Free from his expectations of you as a wife. Free from his criticisms. Free from resentment. Free from pretending in front of your kids that you&amp;#39;re in a happy family. And when you&amp;#39;re ready, free to meet someone who can be a partner to you.&lt;/p&gt;\n\n&lt;p&gt;Your sister has been phenomenal and you are incredibly fortunate to have a social support system. Don&amp;#39;t let fear hold you back.&lt;/p&gt;\n\n&lt;p&gt;You have been a fantastic mother and a role model juggling work, children including one with special needs and a flailing marriage. You are a very capable person. You&amp;#39;ve shown yourself that time and time again. You&amp;#39;ll keep kicking ass being a stay at home single mum. You are powerful beyond measure. Look how far you&amp;#39;ve come. Follow your instincts and the future will take care of itself.&lt;/p&gt;\n\n&lt;p&gt;The courts will make sure he financially takes responsibility for his children at the very least.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8wspm", "score_hidden": false, "stickied": false, "created": 1492185340.0, "created_utc": 1492156540.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg86xbz", "gilded": 0, "archived": false, "score": 43, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg82ig9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is the kind of thing I need to hear, thank you. There is life after divorce and I'm not going to be alone forever. Right now, I want to focus on my kids, and just being able to breathe for a moment. Glad to hear it turned out well for you. It gives me hope. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the kind of thing I need to hear, thank you. There is life after divorce and I&amp;#39;m not going to be alone forever. Right now, I want to focus on my kids, and just being able to breathe for a moment. Glad to hear it turned out well for you. It gives me hope. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg86xbz", "score_hidden": false, "stickied": false, "created": 1492144945.0, "created_utc": 1492116145.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 43}}], "after": null, "before": null}}, "user_reports": [], "id": "dg82ig9", "gilded": 0, "archived": false, "score": 107, "report_reasons": null, "author": "Oneforthegold", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Are you looking for permission to leave?  If you are you have it. \n\nSome people think you need to earn your way out of a marriage (and in some cases I agree it's the right thing to do)  and if that's the standard you're going by consider it earned. \n\nThat said, for me, being left out to dry emotionally and financially like that for years would have been a breaking of trust akin to infidelity.  He proved you can't count on him.  That when the chips are down he is *not* your partner.  You've talked to him about it. You've tried marriage counseling.  You can be done. \n\nHe doesn't want to separate.  Fortunately for you divorce can be a unilateral decision. \n\nOh a personal note, less trauma aside because thankfully my children are both very healthy, I left my  ex when my boys were one (infidelity on his part).  I was scared out of my mind about being a single parent etc.  It is hard. But not as hard as being with someone you can't count on. (Issues outside infidelity too - more similar to those you've had with your husband).\n\nAnd.... 7 years post divorce I'm in an great relationship with someone who really is my partner in all thing.  Don't settle for less.  ", "edited": 1492113794.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Are you looking for permission to leave?  If you are you have it. &lt;/p&gt;\n\n&lt;p&gt;Some people think you need to earn your way out of a marriage (and in some cases I agree it&amp;#39;s the right thing to do)  and if that&amp;#39;s the standard you&amp;#39;re going by consider it earned. &lt;/p&gt;\n\n&lt;p&gt;That said, for me, being left out to dry emotionally and financially like that for years would have been a breaking of trust akin to infidelity.  He proved you can&amp;#39;t count on him.  That when the chips are down he is &lt;em&gt;not&lt;/em&gt; your partner.  You&amp;#39;ve talked to him about it. You&amp;#39;ve tried marriage counseling.  You can be done. &lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t want to separate.  Fortunately for you divorce can be a unilateral decision. &lt;/p&gt;\n\n&lt;p&gt;Oh a personal note, less trauma aside because thankfully my children are both very healthy, I left my  ex when my boys were one (infidelity on his part).  I was scared out of my mind about being a single parent etc.  It is hard. But not as hard as being with someone you can&amp;#39;t count on. (Issues outside infidelity too - more similar to those you&amp;#39;ve had with your husband).&lt;/p&gt;\n\n&lt;p&gt;And.... 7 years post divorce I&amp;#39;m in an great relationship with someone who really is my partner in all thing.  Don&amp;#39;t settle for less.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg82ig9", "score_hidden": false, "stickied": false, "created": 1492140088.0, "created_utc": 1492111288.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 107}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg9339w", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8bp1u", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Years. Five years. I'm so so tired. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Years. Five years. I&amp;#39;m so so tired. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9339w", "score_hidden": false, "stickied": false, "created": 1492202932.0, "created_utc": 1492174132.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8bp1u", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "Lucynj1990", "parent_id": "t1_dg8blwt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "From what you've posted, it seems like you've tried. And tried for years. He seems callous and selfish to a fault. You deserve a partner. A good partner.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From what you&amp;#39;ve posted, it seems like you&amp;#39;ve tried. And tried for years. He seems callous and selfish to a fault. You deserve a partner. A good partner.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8bp1u", "score_hidden": false, "stickied": false, "created": 1492150766.0, "created_utc": 1492121966.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg9d9kg", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "AgentKittyfeets", "parent_id": "t1_dg8zn28", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm sure he'd be happier that you're not miserable than with someone who treats you the way your current husband does!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure he&amp;#39;d be happier that you&amp;#39;re not miserable than with someone who treats you the way your current husband does!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9d9kg", "score_hidden": false, "stickied": false, "created": 1492216339.0, "created_utc": 1492187539.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zn28", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8uqiu", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "She is amazing. Lol! Not sure her husband would like that! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;She is amazing. Lol! Not sure her husband would like that! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8zn28", "score_hidden": false, "stickied": false, "created": 1492194517.0, "created_utc": 1492165717.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8uqiu", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "AgentKittyfeets", "parent_id": "t1_dg8blwt", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Also, you have an awesome sister. I'm sure she'll be there for you to help guide you. Maybe you can get a place near her? :3", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Also, you have an awesome sister. I&amp;#39;m sure she&amp;#39;ll be there for you to help guide you. Maybe you can get a place near her? :3&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8uqiu", "score_hidden": false, "stickied": false, "created": 1492179824.0, "created_utc": 1492151024.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8blwt", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg81ng0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I do too. And basically yes. That's pretty much the case ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do too. And basically yes. That&amp;#39;s pretty much the case &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8blwt", "score_hidden": false, "stickied": false, "created": 1492150649.0, "created_utc": 1492121849.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg95fxs", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "zebegebe", "parent_id": "t1_dg81ng0", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I agree, from the sounds of it, a lot of your stress stems from your husband.  You're tired from it, worried about it and already 100% caretake of your children.  Seems life would be easier without him in the picture..", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree, from the sounds of it, a lot of your stress stems from your husband.  You&amp;#39;re tired from it, worried about it and already 100% caretake of your children.  Seems life would be easier without him in the picture..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg95fxs", "score_hidden": false, "stickied": false, "created": 1492206738.0, "created_utc": 1492177938.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81ng0", "gilded": 0, "archived": false, "score": 39, "report_reasons": null, "author": "Lucynj1990", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I feel like you would be so much happier as a legally single mother. It seems to me, you already are except for on paper.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel like you would be so much happier as a legally single mother. It seems to me, you already are except for on paper.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg81ng0", "score_hidden": false, "stickied": false, "created": 1492139152.0, "created_utc": 1492110352.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 39}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8pe63", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "parker1307", "parent_id": "t1_dg8bl9k", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I was exactly the same. \nMy parents only spilt when I was 23 (about 3ish years ago) and mum said that to me. That the only reason she stayed with my dad, who was incredibly emotionally abusive and manipulative, was for us girls. That she thought we were better off. We weren't. It broke me to hear that she stayed in a shitty marriage and life, because of me. Your kids are better off with a happy mum, in whatever way that life looks. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was exactly the same. \nMy parents only spilt when I was 23 (about 3ish years ago) and mum said that to me. That the only reason she stayed with my dad, who was incredibly emotionally abusive and manipulative, was for us girls. That she thought we were better off. We weren&amp;#39;t. It broke me to hear that she stayed in a shitty marriage and life, because of me. Your kids are better off with a happy mum, in whatever way that life looks. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8pe63", "score_hidden": false, "stickied": false, "created": 1492169799.0, "created_utc": 1492140999.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8c6sx", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "alter_ego77", "parent_id": "t1_dg8bl9k", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I mean look. Parenting is hard, and no matter what, you're going to make the \"wrong\" choice occasionally. My mom and I have a great relationship, and other than typical teenage bullshit, we pretty much always have. But there are still things I can point to and say \"I wish she'd done that differently\". She's a human, of course she did what she thought was best, and wasn't always right. And who knows, maybe I'd be worse off if she had changed the things I think she did wrong. But I've never once doubted her love, and I've never once regreted her divorce. We can't tell you what's right, or that it will work out with 100% certainty. But it sounds like your marriage is over every way but legally, and I've never met a kid who said \"I'm happy my parents stayed together, unhappy and hating each other, for my sake\". ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean look. Parenting is hard, and no matter what, you&amp;#39;re going to make the &amp;quot;wrong&amp;quot; choice occasionally. My mom and I have a great relationship, and other than typical teenage bullshit, we pretty much always have. But there are still things I can point to and say &amp;quot;I wish she&amp;#39;d done that differently&amp;quot;. She&amp;#39;s a human, of course she did what she thought was best, and wasn&amp;#39;t always right. And who knows, maybe I&amp;#39;d be worse off if she had changed the things I think she did wrong. But I&amp;#39;ve never once doubted her love, and I&amp;#39;ve never once regreted her divorce. We can&amp;#39;t tell you what&amp;#39;s right, or that it will work out with 100% certainty. But it sounds like your marriage is over every way but legally, and I&amp;#39;ve never met a kid who said &amp;quot;I&amp;#39;m happy my parents stayed together, unhappy and hating each other, for my sake&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8c6sx", "score_hidden": false, "stickied": false, "created": 1492151422.0, "created_utc": 1492122622.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8v5q9", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "hesnottheone", "parent_id": "t1_dg8bl9k", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You also want to model healthy relationships for your daughter. Do you want her to grow up and think that her spouse should treat her the way your husband treats you?\n\nI too am a child of divorce. I remember when my parents told me they were getting divorced - I was 10 - and I was secretly happy because they were so unhappy with each other, and I wanted them to be happy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You also want to model healthy relationships for your daughter. Do you want her to grow up and think that her spouse should treat her the way your husband treats you?&lt;/p&gt;\n\n&lt;p&gt;I too am a child of divorce. I remember when my parents told me they were getting divorced - I was 10 - and I was secretly happy because they were so unhappy with each other, and I wanted them to be happy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8v5q9", "score_hidden": false, "stickied": false, "created": 1492180856.0, "created_utc": 1492152056.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8bl9k", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8b13e", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you so much. I imagine my daughter saying this and I never want her to have regrets over what I've done. I'm happy to hear it was the right decision for your mom and you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. I imagine my daughter saying this and I never want her to have regrets over what I&amp;#39;ve done. I&amp;#39;m happy to hear it was the right decision for your mom and you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8bl9k", "score_hidden": false, "stickied": false, "created": 1492150624.0, "created_utc": 1492121824.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8b13e", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "alter_ego77", "parent_id": "t1_dg87g25", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm the daughter of divorced parents. Her and my dad divorcing was the best thing that could have happened to me. He was and continued to be, as you say, a good, but not exceptional dad. He was a terrible terrible husband though. As an adult, my mom told me she stayed with him as long as she could, for my sake, which makes me so angry and sad. I'd *never* want to think I was the reason she was miserable. Our lives were so happy when she was single. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m the daughter of divorced parents. Her and my dad divorcing was the best thing that could have happened to me. He was and continued to be, as you say, a good, but not exceptional dad. He was a terrible terrible husband though. As an adult, my mom told me she stayed with him as long as she could, for my sake, which makes me so angry and sad. I&amp;#39;d &lt;em&gt;never&lt;/em&gt; want to think I was the reason she was miserable. Our lives were so happy when she was single. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8b13e", "score_hidden": false, "stickied": false, "created": 1492149897.0, "created_utc": 1492121097.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg935qa", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8zyi8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I actually have to remind myself of this often. I would never hold him back from seeing her as often as he'd like, and she him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I actually have to remind myself of this often. I would never hold him back from seeing her as often as he&amp;#39;d like, and she him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg935qa", "score_hidden": false, "stickied": false, "created": 1492203055.0, "created_utc": 1492174255.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8zyi8", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "gyaradostwister", "parent_id": "t1_dg87g25", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He won't be dead, they can still have a great relationship.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He won&amp;#39;t be dead, they can still have a great relationship.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8zyi8", "score_hidden": false, "stickied": false, "created": 1492195503.0, "created_utc": 1492166703.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg888k5", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Cherpyderp", "parent_id": "t1_dg87g25", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I know people think it's best for the kids if the parents are together, but I think that only holds true if you're modeling a healthy and loving relationship.  What you experience from your husband is what she'll expect a relationship to be.  It will be much better for her to see a strong and independent mother than to see an unhappy marriage.  Kids are perceptive.  Model for her what you want for her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know people think it&amp;#39;s best for the kids if the parents are together, but I think that only holds true if you&amp;#39;re modeling a healthy and loving relationship.  What you experience from your husband is what she&amp;#39;ll expect a relationship to be.  It will be much better for her to see a strong and independent mother than to see an unhappy marriage.  Kids are perceptive.  Model for her what you want for her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg888k5", "score_hidden": false, "stickied": false, "created": 1492146449.0, "created_utc": 1492117649.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg98hd6", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "alter_ego77", "parent_id": "t1_dg97umh", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Not the person you replied to, but my parents separated at 5, divorced at 7. I don't remember the exact conversation, but I know they told me repeatedly that it was nothing to do with me, and that their love for me was as strong as ever. They also got me this, of all things, American girl doll book about divorce, written sort of advice column style. I read that thing a lot. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not the person you replied to, but my parents separated at 5, divorced at 7. I don&amp;#39;t remember the exact conversation, but I know they told me repeatedly that it was nothing to do with me, and that their love for me was as strong as ever. They also got me this, of all things, American girl doll book about divorce, written sort of advice column style. I read that thing a lot. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98hd6", "score_hidden": false, "stickied": false, "created": 1492210804.0, "created_utc": 1492182004.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg99h3j", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Flamburghur", "parent_id": "t1_dg97umh", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I don't mind at all! But I don't know how helpful I can be. Like I said I was REALLY young, around 1 when they separated. (No idea when they technically divorced but the legalities didn't matter to me as an toddler.)\n\nGrowing up my mom always focused on his cheating and the over the top criticism when she talked about why she kicked him out. (I never asked, it was always spontaneous). She said she just didn't want to live with someone that treated her that way and felt that she didn't need that in her or my life. She pointed out his good traits to prevent me from hating him since she didn't want to make him seem completely like 'the bad guy', but she didn't hide her reasons for leaving. It taught me nuance from a young age and more importantly taught me not to settle for a bad relationship.\n\nMy dad never had anything to say about it until I became an adult. I got the impression that he felt guilty for being a jackass to my mom (not that it ever stopped him being hyper critical) but he held up his half of the agreement just fine. He was generous with child support/helping my mom out on top of what he had to owe. Even now he makes sure that I still talk to her.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t mind at all! But I don&amp;#39;t know how helpful I can be. Like I said I was REALLY young, around 1 when they separated. (No idea when they technically divorced but the legalities didn&amp;#39;t matter to me as an toddler.)&lt;/p&gt;\n\n&lt;p&gt;Growing up my mom always focused on his cheating and the over the top criticism when she talked about why she kicked him out. (I never asked, it was always spontaneous). She said she just didn&amp;#39;t want to live with someone that treated her that way and felt that she didn&amp;#39;t need that in her or my life. She pointed out his good traits to prevent me from hating him since she didn&amp;#39;t want to make him seem completely like &amp;#39;the bad guy&amp;#39;, but she didn&amp;#39;t hide her reasons for leaving. It taught me nuance from a young age and more importantly taught me not to settle for a bad relationship.&lt;/p&gt;\n\n&lt;p&gt;My dad never had anything to say about it until I became an adult. I got the impression that he felt guilty for being a jackass to my mom (not that it ever stopped him being hyper critical) but he held up his half of the agreement just fine. He was generous with child support/helping my mom out on top of what he had to owe. Even now he makes sure that I still talk to her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg99h3j", "score_hidden": false, "stickied": false, "created": 1492212022.0, "created_utc": 1492183222.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg97umh", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg975ni", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What a great response, thank you.. Really, great advice. If you don't mind me asking, how old were you when your parents divorced? Do you remember how they explained what was happening at the time?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What a great response, thank you.. Really, great advice. If you don&amp;#39;t mind me asking, how old were you when your parents divorced? Do you remember how they explained what was happening at the time?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg97umh", "score_hidden": false, "stickied": false, "created": 1492210005.0, "created_utc": 1492181205.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg975ni", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Flamburghur", "parent_id": "t1_dg87g25", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Another daughter of divorced parents here. They divorced when I was very young so I don't even remember them being together. Growing up, it was great for me to see that my mother could be on her own, managing her own stuff and be independent. If she had stayed with my father in an unhappy marriage that would have given me the message 'it is better to be unhappy than to be alone'. \n\nMy dad was/is always in my life with weekend custody when I was younger. Like /u/alter_ego77 said about her dad, my dad was a good but not exceptional dad, and he was a shitty husband. But he and my mother were better people divorced and he gave me plenty of good life lessons (including how NOT to be, which is a conclusion I came to on my own.)\n\nWHEN you do get divorced OP, the best advice I can give is to not tear your husband down in front of the kids and be firm about your own boundaries. Your kids will come to their own conclusions about how to conduct themselves in relationships. But don't stay in a bad marriage 'for the kids'. Instead fight for fair child support 'for the kids'.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Another daughter of divorced parents here. They divorced when I was very young so I don&amp;#39;t even remember them being together. Growing up, it was great for me to see that my mother could be on her own, managing her own stuff and be independent. If she had stayed with my father in an unhappy marriage that would have given me the message &amp;#39;it is better to be unhappy than to be alone&amp;#39;. &lt;/p&gt;\n\n&lt;p&gt;My dad was/is always in my life with weekend custody when I was younger. Like &lt;a href=\"/u/alter_ego77\"&gt;/u/alter_ego77&lt;/a&gt; said about her dad, my dad was a good but not exceptional dad, and he was a shitty husband. But he and my mother were better people divorced and he gave me plenty of good life lessons (including how NOT to be, which is a conclusion I came to on my own.)&lt;/p&gt;\n\n&lt;p&gt;WHEN you do get divorced OP, the best advice I can give is to not tear your husband down in front of the kids and be firm about your own boundaries. Your kids will come to their own conclusions about how to conduct themselves in relationships. But don&amp;#39;t stay in a bad marriage &amp;#39;for the kids&amp;#39;. Instead fight for fair child support &amp;#39;for the kids&amp;#39;.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg975ni", "score_hidden": false, "stickied": false, "created": 1492209104.0, "created_utc": 1492180304.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87g25", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg839sp", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you so much. Really, I mean it. I guess the only thing keeping me here is the children. I'm so afraid how it will impact them- My daughter in particular. My son although is very aware, isn't really attached to him. My daughter is. I've stayed this long for her. I made the decision to suck it up, be miserable and stay in an unhappy marriage bc I wanted the family as a whole. But I also said if it affected me as a person where she noticed- That would be the straw. I think we are there. There is only so much a person can take. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you so much. Really, I mean it. I guess the only thing keeping me here is the children. I&amp;#39;m so afraid how it will impact them- My daughter in particular. My son although is very aware, isn&amp;#39;t really attached to him. My daughter is. I&amp;#39;ve stayed this long for her. I made the decision to suck it up, be miserable and stay in an unhappy marriage bc I wanted the family as a whole. But I also said if it affected me as a person where she noticed- That would be the straw. I think we are there. There is only so much a person can take. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg87g25", "score_hidden": false, "stickied": false, "created": 1492145541.0, "created_utc": 1492116741.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg839sp", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "Cherpyderp", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; The strange thing is, he wants to stayed married, says he loves me/is crazy about me, and doesn't want to split. \n\nThis isn't even close to accurate.  He told you that you contribute nothing to the marriage.  He's not happy with you either.  If anything, he's complacent.  That's not your problem.  At this point, who cares what he wants?  He hasn't thought about anyone but himself in 5 years.  He has himself set as his top priority -- there is no need for you to worry about him.\n\n&gt; I just want this to be done\n\nThen be done.  You've said it yourself -- you're an ass kicker.  Go be free.  You have enough going on in your world...you don't need to make it worse by having an unsupportive, unfeeling, and unloving husband.  He has done nothing but weighed you down.  \n\nAdditionally, I don't know anyone that has left an unhappy marriage and regretted it.  This split doesn't have to be mutual.  Ending a relationship can absolutely be unilateral.  You've made numerous decisions on your own up to this point -- go ahead and make this one last decision unilaterally.  If he wanted to be in this marriage then he probably should have *been in this marriage*.  You deserve much better.  I hope you find it!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The strange thing is, he wants to stayed married, says he loves me/is crazy about me, and doesn&amp;#39;t want to split. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This isn&amp;#39;t even close to accurate.  He told you that you contribute nothing to the marriage.  He&amp;#39;s not happy with you either.  If anything, he&amp;#39;s complacent.  That&amp;#39;s not your problem.  At this point, who cares what he wants?  He hasn&amp;#39;t thought about anyone but himself in 5 years.  He has himself set as his top priority -- there is no need for you to worry about him.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I just want this to be done&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Then be done.  You&amp;#39;ve said it yourself -- you&amp;#39;re an ass kicker.  Go be free.  You have enough going on in your world...you don&amp;#39;t need to make it worse by having an unsupportive, unfeeling, and unloving husband.  He has done nothing but weighed you down.  &lt;/p&gt;\n\n&lt;p&gt;Additionally, I don&amp;#39;t know anyone that has left an unhappy marriage and regretted it.  This split doesn&amp;#39;t have to be mutual.  Ending a relationship can absolutely be unilateral.  You&amp;#39;ve made numerous decisions on your own up to this point -- go ahead and make this one last decision unilaterally.  If he wanted to be in this marriage then he probably should have &lt;em&gt;been in this marriage&lt;/em&gt;.  You deserve much better.  I hope you find it!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg839sp", "score_hidden": false, "stickied": false, "created": 1492140914.0, "created_utc": 1492112114.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg82y6q", "gilded": 0, "archived": false, "score": 27, "report_reasons": null, "author": "BigOldCar", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm sorry, but this guy just sounds *awful*.  \"Selfish\" doesn't even go far enough.\n\nHoney, you haven't got a husband, you've got a roommate.  At least, that's the last time I had a relationship where we each put in 50% of bills from separate accounts despite different financial situations.  That's not how a marriage is supposed to work, and well, yours certainly isn't working.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry, but this guy just sounds &lt;em&gt;awful&lt;/em&gt;.  &amp;quot;Selfish&amp;quot; doesn&amp;#39;t even go far enough.&lt;/p&gt;\n\n&lt;p&gt;Honey, you haven&amp;#39;t got a husband, you&amp;#39;ve got a roommate.  At least, that&amp;#39;s the last time I had a relationship where we each put in 50% of bills from separate accounts despite different financial situations.  That&amp;#39;s not how a marriage is supposed to work, and well, yours certainly isn&amp;#39;t working.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg82y6q", "score_hidden": false, "stickied": false, "created": 1492140561.0, "created_utc": 1492111761.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 27}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg88f9p", "gilded": 0, "archived": false, "score": 24, "report_reasons": null, "author": "myshittylist", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "lol. He doesn't want to divorce you because then your finances will finally be as mixed as it can get. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol. He doesn&amp;#39;t want to divorce you because then your finances will finally be as mixed as it can get. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg88f9p", "score_hidden": false, "stickied": false, "created": 1492146674.0, "created_utc": 1492117874.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 24}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg890vp", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "renster82", "parent_id": "t1_dg87pwk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; The issue is he is incapable of appropriately being in a relationship. \n\nYes.  This is the truth of the matter.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The issue is he is incapable of appropriately being in a relationship. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes.  This is the truth of the matter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg890vp", "score_hidden": false, "stickied": false, "created": 1492147397.0, "created_utc": 1492118597.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg9382v", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8sxib", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're so right. Before when I was desperate to make this work, I'd fantasize about him having to do this alone, and then realize how much I do for this family. He is living the dream, and doesn't know it. Yet. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re so right. Before when I was desperate to make this work, I&amp;#39;d fantasize about him having to do this alone, and then realize how much I do for this family. He is living the dream, and doesn&amp;#39;t know it. Yet. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9382v", "score_hidden": false, "stickied": false, "created": 1492203175.0, "created_utc": 1492174375.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8sxib", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "walk_through_this", "parent_id": "t1_dg87pwk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I really do think he wants this marriage,\n\nI think more accurately, *he wants you to stay married to him.* Right now he has everything he wants. Divorce will change that. If he wanted to be married, he'd be acting like a husband. But he's not. He likes having a wife and a mother for his kids, but he doesn't want to be a husband and a father. That isn't a marriage.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I really do think he wants this marriage,&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think more accurately, &lt;em&gt;he wants you to stay married to him.&lt;/em&gt; Right now he has everything he wants. Divorce will change that. If he wanted to be married, he&amp;#39;d be acting like a husband. But he&amp;#39;s not. He likes having a wife and a mother for his kids, but he doesn&amp;#39;t want to be a husband and a father. That isn&amp;#39;t a marriage.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8sxib", "score_hidden": false, "stickied": false, "created": 1492175944.0, "created_utc": 1492147144.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8a2rp", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "dca_user", "parent_id": "t1_dg87pwk", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "And it's not YOUR job to help him get relationship skills on top of caring for you and your two kids.  And even if he wants to, it could take YEARS. Your kids can't wait.\n\n\nBut on a separate note, the fact that he doesn't financially contribute to yours and the kids' expenses tells me this is *not* just an emotional issue.  \n\n\nStart moving to a divorce.  Let him work with a therapist and learn how to be a more engaged father (ie, pay their bills, etc).  And then you start moving on with your life. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And it&amp;#39;s not YOUR job to help him get relationship skills on top of caring for you and your two kids.  And even if he wants to, it could take YEARS. Your kids can&amp;#39;t wait.&lt;/p&gt;\n\n&lt;p&gt;But on a separate note, the fact that he doesn&amp;#39;t financially contribute to yours and the kids&amp;#39; expenses tells me this is &lt;em&gt;not&lt;/em&gt; just an emotional issue.  &lt;/p&gt;\n\n&lt;p&gt;Start moving to a divorce.  Let him work with a therapist and learn how to be a more engaged father (ie, pay their bills, etc).  And then you start moving on with your life. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8a2rp", "score_hidden": false, "stickied": false, "created": 1492148700.0, "created_utc": 1492119900.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 13}}], "after": null, "before": null}}, "user_reports": [], "id": "dg87pwk", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg83kyq", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks so much. That thought has passed through my mind numerous times about him staying to avoid paying me anything. Although the odd thing is- I really do think he wants this marriage, and I do think he really loves me. He really can never verbalized any coherent reason he thinks I'm at fault too. Bc to be honest there isn't any! The issue is he is incapable of appropriately being in a relationship. He doesn't seem to have any normal amount of compassion or sympathy for others and doesn't see the error of his ways. I just got tired of being the one to point this out. I can't make him suddenly have the skills needed to be in a healthy relationship. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks so much. That thought has passed through my mind numerous times about him staying to avoid paying me anything. Although the odd thing is- I really do think he wants this marriage, and I do think he really loves me. He really can never verbalized any coherent reason he thinks I&amp;#39;m at fault too. Bc to be honest there isn&amp;#39;t any! The issue is he is incapable of appropriately being in a relationship. He doesn&amp;#39;t seem to have any normal amount of compassion or sympathy for others and doesn&amp;#39;t see the error of his ways. I just got tired of being the one to point this out. I can&amp;#39;t make him suddenly have the skills needed to be in a healthy relationship. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg87pwk", "score_hidden": false, "stickied": false, "created": 1492145846.0, "created_utc": 1492117046.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 23}}], "after": null, "before": null}}, "user_reports": [], "id": "dg83kyq", "gilded": 0, "archived": false, "score": 44, "report_reasons": null, "author": "dca_user", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Hugs, OP.  Google Captain Awkward and 506.  I think that webpage will help verbalize how you feel to your husband and everyone else who thinks you should stay in this marriage. \n\n\nHe doesn't want to be in a marriage. He doesn't want to be a father.  I bet the real reason he doesn't want a divorce is because he doesn't want to pay for support. \n\n\nPlease go secretly see a divorce lawyer and see if you qualify for child and spousal support.  And do get spousal support.  You may never be able to return to full-time work due to your son's health issues. \n\n\nHang in there OP.  Good luck, you'll get through this.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hugs, OP.  Google Captain Awkward and 506.  I think that webpage will help verbalize how you feel to your husband and everyone else who thinks you should stay in this marriage. &lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t want to be in a marriage. He doesn&amp;#39;t want to be a father.  I bet the real reason he doesn&amp;#39;t want a divorce is because he doesn&amp;#39;t want to pay for support. &lt;/p&gt;\n\n&lt;p&gt;Please go secretly see a divorce lawyer and see if you qualify for child and spousal support.  And do get spousal support.  You may never be able to return to full-time work due to your son&amp;#39;s health issues. &lt;/p&gt;\n\n&lt;p&gt;Hang in there OP.  Good luck, you&amp;#39;ll get through this.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg83kyq", "score_hidden": false, "stickied": false, "created": 1492141251.0, "created_utc": 1492112451.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 44}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8jacr", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "Morrowinded", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;The reason I hear? \"you think it's difficult now? Just wait until you're single with 2 kids.\" \n\nYou are already basically single with 2 kids, anyone who says this to you clearly doesn't understand the extent of your husband's neglect towards his family. This guy abandoned you with your sick son, at a time where he was needed the most. Your husband killed the relationship when he unveiled exactly how selfish and uncaring he is. Sometimes people do things that are unforgivable, and I don't think any marriage counsellor will be able to heal this marriage.\n\nI will also add that I think it is crucial you get a lawyer when you divorce. This guy is very protective of his money and I would not be surprised if he tries to screw you over in the divorce.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The reason I hear? &amp;quot;you think it&amp;#39;s difficult now? Just wait until you&amp;#39;re single with 2 kids.&amp;quot; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You are already basically single with 2 kids, anyone who says this to you clearly doesn&amp;#39;t understand the extent of your husband&amp;#39;s neglect towards his family. This guy abandoned you with your sick son, at a time where he was needed the most. Your husband killed the relationship when he unveiled exactly how selfish and uncaring he is. Sometimes people do things that are unforgivable, and I don&amp;#39;t think any marriage counsellor will be able to heal this marriage.&lt;/p&gt;\n\n&lt;p&gt;I will also add that I think it is crucial you get a lawyer when you divorce. This guy is very protective of his money and I would not be surprised if he tries to screw you over in the divorce.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8jacr", "score_hidden": false, "stickied": false, "created": 1492161002.0, "created_utc": 1492132202.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 21}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8ykm1", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "sharkbabygirl", "parent_id": "t1_dg81n1l", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm wondering if he wants to stay together for financial reasons. In this dysfunctional set up, it seems like he has to pay very little and can use his money however he pleases. If she leaves him, he's going to be responsible for child support and whatever he owes her for the divorce (I can't remember what that's called, I'm tired sorry haha). Any good lawyer she hires will be able to show how he's sort of... abused her financially? (And any good judge could see it too) He did that by saying he'll split everything  50/50 but totally not doing that. I can't see any other reasoning he'd like to stay together, because he seems to prefer to not be a dad and husband. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m wondering if he wants to stay together for financial reasons. In this dysfunctional set up, it seems like he has to pay very little and can use his money however he pleases. If she leaves him, he&amp;#39;s going to be responsible for child support and whatever he owes her for the divorce (I can&amp;#39;t remember what that&amp;#39;s called, I&amp;#39;m tired sorry haha). Any good lawyer she hires will be able to show how he&amp;#39;s sort of... abused her financially? (And any good judge could see it too) He did that by saying he&amp;#39;ll split everything  50/50 but totally not doing that. I can&amp;#39;t see any other reasoning he&amp;#39;d like to stay together, because he seems to prefer to not be a dad and husband. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8ykm1", "score_hidden": false, "stickied": false, "created": 1492191013.0, "created_utc": 1492162213.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81n1l", "gilded": 0, "archived": false, "score": 14, "report_reasons": null, "author": "TessDevin", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; he is adamant we stay together.\n\nIt takes two to tango. He *can't* say no if you are not in this relationship anymore. As soon as one partner bows out, the other doesn't get the *choice* of saying \"no\". He is not the boss of you.\n\nYou want to leave, and I am telling you that it's *ok* for you to leave him - so do what *you know* is best for you and your children. Get your ducks in a row quietly, and then step out the door.\n\nObviously, you should seek personal counselling as well.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;he is adamant we stay together.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It takes two to tango. He &lt;em&gt;can&amp;#39;t&lt;/em&gt; say no if you are not in this relationship anymore. As soon as one partner bows out, the other doesn&amp;#39;t get the &lt;em&gt;choice&lt;/em&gt; of saying &amp;quot;no&amp;quot;. He is not the boss of you.&lt;/p&gt;\n\n&lt;p&gt;You want to leave, and I am telling you that it&amp;#39;s &lt;em&gt;ok&lt;/em&gt; for you to leave him - so do what &lt;em&gt;you know&lt;/em&gt; is best for you and your children. Get your ducks in a row quietly, and then step out the door.&lt;/p&gt;\n\n&lt;p&gt;Obviously, you should seek personal counselling as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg81n1l", "score_hidden": false, "stickied": false, "created": 1492139139.0, "created_utc": 1492110339.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 14}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg97zy3", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8vwzy", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Not harsh, I think very real. I don't want to get to a place of anger and hatred, where I go after him for \"all he's worth\" bc I do want him to be a successful father for our children, and have the appropriate means to do so. I just wanted fair financial support and that's what I'm going after. It's still so strange he thinks he more than supports the family. Like he cannot seem to grasp reality.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not harsh, I think very real. I don&amp;#39;t want to get to a place of anger and hatred, where I go after him for &amp;quot;all he&amp;#39;s worth&amp;quot; bc I do want him to be a successful father for our children, and have the appropriate means to do so. I just wanted fair financial support and that&amp;#39;s what I&amp;#39;m going after. It&amp;#39;s still so strange he thinks he more than supports the family. Like he cannot seem to grasp reality.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg97zy3", "score_hidden": false, "stickied": false, "created": 1492210195.0, "created_utc": 1492181395.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8vwzy", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "badwolfgoddess", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": " This will be a harsh comment but hun, *divorce him and take him for all he's worth*. He's financially abused you and left you to swing in the wind for years. He deserves to be drained the way he drained you. Honestly, that's exactly what a man like him deserves, to pay you out the ass in alimony and child support. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This will be a harsh comment but hun, &lt;em&gt;divorce him and take him for all he&amp;#39;s worth&lt;/em&gt;. He&amp;#39;s financially abused you and left you to swing in the wind for years. He deserves to be drained the way he drained you. Honestly, that&amp;#39;s exactly what a man like him deserves, to pay you out the ass in alimony and child support. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8vwzy", "score_hidden": false, "stickied": false, "created": 1492182835.0, "created_utc": 1492154035.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg960yb", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8pp5u", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thanks. I know I made it sound miserable, which it can be hard. But I love my life and really am thankful for the cards I've been dealt. I have learned so much and am so much a better person for it. I just hate he can't see it too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks. I know I made it sound miserable, which it can be hard. But I love my life and really am thankful for the cards I&amp;#39;ve been dealt. I have learned so much and am so much a better person for it. I just hate he can&amp;#39;t see it too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg960yb", "score_hidden": false, "stickied": false, "created": 1492207570.0, "created_utc": 1492178770.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8pp5u", "gilded": 0, "archived": false, "score": 11, "report_reasons": null, "author": "beverlypenn", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You must be SO EXHAUSTED.  I can feel it seeping through the screen. I think your husband exploited you in terms of financial and emotional labor -- your family is set up in a particularly ugly variation of the patriarchal family model, pushed to the outlier by your son's health condition -- and it has drained you, and no wonder!  It sounds awful.  Your life sounds miserable, and your marriage sounds awful.  \n\nYou yourself say your sister stepped in as your spouse...I fail to see how you would be worse off as a single mom.  If/when you divorce, you will actually gain some free time since he will presumably have at least 20% custody -- and that sounds like more time than you have now, AND he will be forced to contribute through child support and probably alimony, so you will actually be better off financially.  I don't see the upside to staying in this marriage, and I honestly don't see the downside in leaving. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You must be SO EXHAUSTED.  I can feel it seeping through the screen. I think your husband exploited you in terms of financial and emotional labor -- your family is set up in a particularly ugly variation of the patriarchal family model, pushed to the outlier by your son&amp;#39;s health condition -- and it has drained you, and no wonder!  It sounds awful.  Your life sounds miserable, and your marriage sounds awful.  &lt;/p&gt;\n\n&lt;p&gt;You yourself say your sister stepped in as your spouse...I fail to see how you would be worse off as a single mom.  If/when you divorce, you will actually gain some free time since he will presumably have at least 20% custody -- and that sounds like more time than you have now, AND he will be forced to contribute through child support and probably alimony, so you will actually be better off financially.  I don&amp;#39;t see the upside to staying in this marriage, and I honestly don&amp;#39;t see the downside in leaving. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8pp5u", "score_hidden": false, "stickied": false, "created": 1492170284.0, "created_utc": 1492141484.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg98166", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8avwv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I've already spoken to a law firm that also does mediation. I have no idea how to even get started, or who to talk to, but have to start somewhere.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve already spoken to a law firm that also does mediation. I have no idea how to even get started, or who to talk to, but have to start somewhere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98166", "score_hidden": false, "stickied": false, "created": 1492210238.0, "created_utc": 1492181438.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8avwv", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "alter_ego77", "parent_id": "t1_dg81lit", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You *need* to consult with a lawyer. You don't have to hire them, but holy crap do you need to at least find out what you're in for. You saying you don't want to go after each other in court, and I believe that you don't, but so so so many couple say that until one of them hears what they're going to be paying in child support, and then it's balls to the wall bulldog lawyer mowing over the other person. Especially since it doesn't sound like ending the relationship will be mutual. Please please please talk to a lawyer. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You &lt;em&gt;need&lt;/em&gt; to consult with a lawyer. You don&amp;#39;t have to hire them, but holy crap do you need to at least find out what you&amp;#39;re in for. You saying you don&amp;#39;t want to go after each other in court, and I believe that you don&amp;#39;t, but so so so many couple say that until one of them hears what they&amp;#39;re going to be paying in child support, and then it&amp;#39;s balls to the wall bulldog lawyer mowing over the other person. Especially since it doesn&amp;#39;t sound like ending the relationship will be mutual. Please please please talk to a lawyer. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8avwv", "score_hidden": false, "stickied": false, "created": 1492149712.0, "created_utc": 1492120912.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8to69", "gilded": 0, "archived": false, "score": 19, "report_reasons": null, "author": "Meayow", "parent_id": "t1_dg8759s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He wants a bang-maid, not a partner. Ick. Gross. Ick!!!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He wants a bang-maid, not a partner. Ick. Gross. Ick!!!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8to69", "score_hidden": false, "stickied": false, "created": 1492177420.0, "created_utc": 1492148620.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 19}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8zquf", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8uea9", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "\"Who's face you want to punch\". Lol! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;Who&amp;#39;s face you want to punch&amp;quot;. Lol! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8zquf", "score_hidden": false, "stickied": false, "created": 1492194843.0, "created_utc": 1492166043.0, "depth": 5, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8uea9", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Dada2fish", "parent_id": "t1_dg8759s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "If you harbor resentment for a long time that's what happens. Women especially can't feel sexual and desire for someone who's face you wanna punch. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you harbor resentment for a long time that&amp;#39;s what happens. Women especially can&amp;#39;t feel sexual and desire for someone who&amp;#39;s face you wanna punch. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8uea9", "score_hidden": false, "stickied": false, "created": 1492179027.0, "created_utc": 1492150227.0, "depth": 4, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8759s", "gilded": 0, "archived": false, "score": 21, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg81oru", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Exactly. The odd thing is, he just keeps saying \"you blame this all on me but aren't willing to take any blame\". To which I ask, \"ok, I'm listening, what do I need to change?\"  His response is always the same: to not be so carefree (he thinks I don't plan ahead enough and do things too spontaneously), to keep the house clean, to cook, and be more physical with him. But I can't stomach it anymore. I can barely look at him, let alone be intimate. Ugh. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly. The odd thing is, he just keeps saying &amp;quot;you blame this all on me but aren&amp;#39;t willing to take any blame&amp;quot;. To which I ask, &amp;quot;ok, I&amp;#39;m listening, what do I need to change?&amp;quot;  His response is always the same: to not be so carefree (he thinks I don&amp;#39;t plan ahead enough and do things too spontaneously), to keep the house clean, to cook, and be more physical with him. But I can&amp;#39;t stomach it anymore. I can barely look at him, let alone be intimate. Ugh. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8759s", "score_hidden": false, "stickied": false, "created": 1492145197.0, "created_utc": 1492116397.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 21}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81oru", "gilded": 0, "archived": false, "score": 16, "report_reasons": null, "author": "6931", "parent_id": "t1_dg81lit", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It sounds like he isn't putting any weight or value on what you're saying re \"This must change.\" So he's learned that he says he'll change, doesn't change, and life continues as normal. I hope mediation of some sort helps break this habit.\n\nEdit: I see in another of your comments that you paid for marital counselling previously and couldn't afford to continue. I think if he's saying he wants to stay together, it's time for him to pay for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It sounds like he isn&amp;#39;t putting any weight or value on what you&amp;#39;re saying re &amp;quot;This must change.&amp;quot; So he&amp;#39;s learned that he says he&amp;#39;ll change, doesn&amp;#39;t change, and life continues as normal. I hope mediation of some sort helps break this habit.&lt;/p&gt;\n\n&lt;p&gt;Edit: I see in another of your comments that you paid for marital counselling previously and couldn&amp;#39;t afford to continue. I think if he&amp;#39;s saying he wants to stay together, it&amp;#39;s time for him to pay for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg81oru", "score_hidden": false, "stickied": false, "created": 1492139192.0, "created_utc": 1492110392.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 16}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81lit", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg817ih", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you. I am currently looking into a mediator. I think that's the best option. Bc it's not like we want to go \"after each other\" in court.. I just want this resolved in a manner that is cohesive and best for the kids. No, he does not listen to what I say. He tries, but it doesn't get through. It's the strangest thing. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I am currently looking into a mediator. I think that&amp;#39;s the best option. Bc it&amp;#39;s not like we want to go &amp;quot;after each other&amp;quot; in court.. I just want this resolved in a manner that is cohesive and best for the kids. No, he does not listen to what I say. He tries, but it doesn&amp;#39;t get through. It&amp;#39;s the strangest thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg81lit", "score_hidden": false, "stickied": false, "created": 1492139091.0, "created_utc": 1492110291.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg817ih", "gilded": 0, "archived": false, "score": 17, "report_reasons": null, "author": "6931", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Splitting up is definitely an option, even if he says \"No,\" because it's not just his decision. You do have that power and you've demonstrated you have that strength. So you aren't stuck, and please don't feel you are. I understand how awful that can feel.\n\nI do wonder if a mediator would help. A counsellor or someone else trained to assist communication, because clearly things need to change or the relationship can't continue. This needs to be made clear to him, and he is not listening to what you're trying to say.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Splitting up is definitely an option, even if he says &amp;quot;No,&amp;quot; because it&amp;#39;s not just his decision. You do have that power and you&amp;#39;ve demonstrated you have that strength. So you aren&amp;#39;t stuck, and please don&amp;#39;t feel you are. I understand how awful that can feel.&lt;/p&gt;\n\n&lt;p&gt;I do wonder if a mediator would help. A counsellor or someone else trained to assist communication, because clearly things need to change or the relationship can&amp;#39;t continue. This needs to be made clear to him, and he is not listening to what you&amp;#39;re trying to say.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg817ih", "score_hidden": false, "stickied": false, "created": 1492138665.0, "created_utc": 1492109865.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 17}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg9880e", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8qc0n", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I think that's it. He loves doing the fun things, on his terms with her, and thinks, he really does believe, that it equals good parenting. Nope. Good parenting is being there through the good, bad and ugly. I will always want her to be close with him, and I do honestly think he will work hard to have a good relationship. My daughter is so wise beyond her years. She is very intuitive, which gives me hope she'll be able to keep this in perspective and know it isn't about her. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s it. He loves doing the fun things, on his terms with her, and thinks, he really does believe, that it equals good parenting. Nope. Good parenting is being there through the good, bad and ugly. I will always want her to be close with him, and I do honestly think he will work hard to have a good relationship. My daughter is so wise beyond her years. She is very intuitive, which gives me hope she&amp;#39;ll be able to keep this in perspective and know it isn&amp;#39;t about her. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9880e", "score_hidden": false, "stickied": false, "created": 1492210482.0, "created_utc": 1492181682.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8qc0n", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "devongarv", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "My dad is very similar to your husband in terms of parenting. \n\nHe was thrilled to have me and happy to do the fun parts of parenting, but left my mom to do the real work. Every once in a while he would step in and try to punish me, which didn't go over very well because I basically stopped viewing him as a parental figure. The result? Today we have a very distant relationship. We live in the same house and talk maybe once a week. \n\nSeparating is the best thing for your kids at this point. Eventually they will start to realize that their dad isn't really a parent and they will begin to resent him. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dad is very similar to your husband in terms of parenting. &lt;/p&gt;\n\n&lt;p&gt;He was thrilled to have me and happy to do the fun parts of parenting, but left my mom to do the real work. Every once in a while he would step in and try to punish me, which didn&amp;#39;t go over very well because I basically stopped viewing him as a parental figure. The result? Today we have a very distant relationship. We live in the same house and talk maybe once a week. &lt;/p&gt;\n\n&lt;p&gt;Separating is the best thing for your kids at this point. Eventually they will start to realize that their dad isn&amp;#39;t really a parent and they will begin to resent him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8qc0n", "score_hidden": false, "stickied": false, "created": 1492171312.0, "created_utc": 1492142512.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8tj2q", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "Meayow", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He has to understand that you are on the precipice of leaving. You have to tell him that clearly. He has to know that in order to be a family, he has to combine finances, start being an adult and father, and stop putting whatever the fuck he wants over what's good for you and the children you have together. \n\nHe will probably balk. I think that's a good time to show him the divorce papers. This man is stubborn to a fault, but considering how separate you are emotionally and financially, he isn't really a part of the family. He's hanging on to a freewheeling independence that is daunting. But he says he is crazy about you, well, let him prove it. Full access joint bank account, specific time he spends taking care of the kids so you can have off time, consistent involvement in both kids extracurriculars and activities. You name it. Give him a real understanding of what reality and your relationship needs to look like TODAY. Not tomorrow, not next week. Banks are open tomorrow, he can fix it then. \n\n\nIf you go this route, let's be realistic, he probably won't even consider doing any of the above until you change the locks and hand him divorce papers. So do it. Your only chance for this relationship to not be an abyss of unhappiness is for him to grow up, be an adult, and start being a husband and partner. And, my guess is the only chance of him even considering a change is when he's actually looking at his future without you enabling his selfish and callous treatment of you and your kids. Make him move out. See what he does when his life stops including a supportive partner. He has you supporting him every step of the way. You have your sister. You don't lose nearly as much as he will in a divorce. If you want to maybe have things work out with him, it's high time you forced him to understand the life you've been living, an actually independent one without a partner. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He has to understand that you are on the precipice of leaving. You have to tell him that clearly. He has to know that in order to be a family, he has to combine finances, start being an adult and father, and stop putting whatever the fuck he wants over what&amp;#39;s good for you and the children you have together. &lt;/p&gt;\n\n&lt;p&gt;He will probably balk. I think that&amp;#39;s a good time to show him the divorce papers. This man is stubborn to a fault, but considering how separate you are emotionally and financially, he isn&amp;#39;t really a part of the family. He&amp;#39;s hanging on to a freewheeling independence that is daunting. But he says he is crazy about you, well, let him prove it. Full access joint bank account, specific time he spends taking care of the kids so you can have off time, consistent involvement in both kids extracurriculars and activities. You name it. Give him a real understanding of what reality and your relationship needs to look like TODAY. Not tomorrow, not next week. Banks are open tomorrow, he can fix it then. &lt;/p&gt;\n\n&lt;p&gt;If you go this route, let&amp;#39;s be realistic, he probably won&amp;#39;t even consider doing any of the above until you change the locks and hand him divorce papers. So do it. Your only chance for this relationship to not be an abyss of unhappiness is for him to grow up, be an adult, and start being a husband and partner. And, my guess is the only chance of him even considering a change is when he&amp;#39;s actually looking at his future without you enabling his selfish and callous treatment of you and your kids. Make him move out. See what he does when his life stops including a supportive partner. He has you supporting him every step of the way. You have your sister. You don&amp;#39;t lose nearly as much as he will in a divorce. If you want to maybe have things work out with him, it&amp;#39;s high time you forced him to understand the life you&amp;#39;ve been living, an actually independent one without a partner. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8tj2q", "score_hidden": false, "stickied": false, "created": 1492177123.0, "created_utc": 1492148323.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8ztii", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8ygkf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That is so kind, thank you for taking a moment to say this. Helps me more than you'll ever know. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is so kind, thank you for taking a moment to say this. Helps me more than you&amp;#39;ll ever know. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8ztii", "score_hidden": false, "stickied": false, "created": 1492195076.0, "created_utc": 1492166276.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8ygkf", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "sharkbabygirl", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I just want to thank you for sharing your story. As someone who is an adult with a debilitating illness, with a mom who kicked as much ass as you: thank you. Your kids are so lucky to have you. I don't know, your story just struck a chord with me and I want to give you a big hug. \n\nI don't have any advice but really wanted to say that I'm wishing for nothing but happiness, security, and balance for you. I know it'll come before you know it. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just want to thank you for sharing your story. As someone who is an adult with a debilitating illness, with a mom who kicked as much ass as you: thank you. Your kids are so lucky to have you. I don&amp;#39;t know, your story just struck a chord with me and I want to give you a big hug. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t have any advice but really wanted to say that I&amp;#39;m wishing for nothing but happiness, security, and balance for you. I know it&amp;#39;ll come before you know it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8ygkf", "score_hidden": false, "stickied": false, "created": 1492190649.0, "created_utc": 1492161849.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg98bot", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg8z2tw", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Thank you for this. Great advice. I've already contacted a mediator, but I have no idea what I'm doing. Hoping they can kind of guide me, but I have a feeling I'll need to consult an atty too. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. Great advice. I&amp;#39;ve already contacted a mediator, but I have no idea what I&amp;#39;m doing. Hoping they can kind of guide me, but I have a feeling I&amp;#39;ll need to consult an atty too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98bot", "score_hidden": false, "stickied": false, "created": 1492210611.0, "created_utc": 1492181811.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8z2tw", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "cassinator", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "It's been said, but you have done all you can do. Marriage is supposed to be equal, and this one is not. I know others have mentioned a lawyer, which you should definitely consult, but please consult secretly. This way you can gather important information and have a set plan before your husband possibly destroys possessions, or becomes incredibly upset. I used to work in a transition home for women fleeing abuse, and you would be surprised what men can do out of spite. I've seen men sell their vehicles to their friends for $10, so that the assets were worth less meaning his wife got less in the divorce - just for him to buy the vehicle back later on. Men who had no interest in raising their children all of a sudden file for custody before the mother (putting her in the defensive which is MUCH harder) just to spite and hurt their partner. I've also seen things turn ugly, and often physical, when people refuse to believe their partner is leaving them. \n\nMost people associate abuse with physical or mental...however often times there is financial abuse and it can be crippling, especially for mothers who feel they do not have the finances to make it on their own. Besides what seems to be emotional and verbal abuse by the way he talks down to you and treats you, he is most definitely financially abusing you. Most people are unaware of the services offered to women in situations like these - where they help to get you funding, provide free legal aid, etc. I strongly advocate that you reach out to a local womens shelter (not necessarily to live there although that is always a great option for transitioning) but just to talk to them as they have an abundance of information and programs they can pass on to you. Or they can just provide a listening ear to get you through this.\n\nYou seem like an incredibly strong woman and amazing mother. The world needs more people like you. Im so sorry you are going through this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s been said, but you have done all you can do. Marriage is supposed to be equal, and this one is not. I know others have mentioned a lawyer, which you should definitely consult, but please consult secretly. This way you can gather important information and have a set plan before your husband possibly destroys possessions, or becomes incredibly upset. I used to work in a transition home for women fleeing abuse, and you would be surprised what men can do out of spite. I&amp;#39;ve seen men sell their vehicles to their friends for $10, so that the assets were worth less meaning his wife got less in the divorce - just for him to buy the vehicle back later on. Men who had no interest in raising their children all of a sudden file for custody before the mother (putting her in the defensive which is MUCH harder) just to spite and hurt their partner. I&amp;#39;ve also seen things turn ugly, and often physical, when people refuse to believe their partner is leaving them. &lt;/p&gt;\n\n&lt;p&gt;Most people associate abuse with physical or mental...however often times there is financial abuse and it can be crippling, especially for mothers who feel they do not have the finances to make it on their own. Besides what seems to be emotional and verbal abuse by the way he talks down to you and treats you, he is most definitely financially abusing you. Most people are unaware of the services offered to women in situations like these - where they help to get you funding, provide free legal aid, etc. I strongly advocate that you reach out to a local womens shelter (not necessarily to live there although that is always a great option for transitioning) but just to talk to them as they have an abundance of information and programs they can pass on to you. Or they can just provide a listening ear to get you through this.&lt;/p&gt;\n\n&lt;p&gt;You seem like an incredibly strong woman and amazing mother. The world needs more people like you. Im so sorry you are going through this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8z2tw", "score_hidden": false, "stickied": false, "created": 1492192669.0, "created_utc": 1492163869.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8kom5", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "NikkitheChocoholic", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You should show this post to any friends/family that are telling you to just try to work things out.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should show this post to any friends/family that are telling you to just try to work things out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8kom5", "score_hidden": false, "stickied": false, "created": 1492162930.0, "created_utc": 1492134130.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8tztz", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "serefina", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He doesn't want to seem to be either a husband or father. You have been on your own so far you may as well make it official.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He doesn&amp;#39;t want to seem to be either a husband or father. You have been on your own so far you may as well make it official.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8tztz", "score_hidden": false, "stickied": false, "created": 1492178116.0, "created_utc": 1492149316.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg98fm2", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg91z3s", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "lol I have. I think I've given him every ultimatum under the sun. He just within the last few days asked me to meet him at the bank to open a joint account. This of course was after another one of his rants how I don't \"pull my weight\" and after 9 years of me asking him to do it. I had no desire to do it, bc I think I know deep down, it's too late.  ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;lol I have. I think I&amp;#39;ve given him every ultimatum under the sun. He just within the last few days asked me to meet him at the bank to open a joint account. This of course was after another one of his rants how I don&amp;#39;t &amp;quot;pull my weight&amp;quot; and after 9 years of me asking him to do it. I had no desire to do it, bc I think I know deep down, it&amp;#39;s too late.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98fm2", "score_hidden": false, "stickied": false, "created": 1492210745.0, "created_utc": 1492181945.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg91z3s", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Whallywhaler", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'm so sorry. \n\nHe doesn't get to tell you that the status quo will continue, with him contributing the bare minimum, and chastising you for \"not doing enough\" when you do most of it. \n\nHe's selfish. This won't change. Time for an ultimatum; he either goes to decent counselling with you and agrees to try to see what your life's been like; or this is over and you divorce. \n\nHe does not get to tell you that you are trapped. You aren't. You have given and given. So write it out. All the things you've paid for while making less $. All the things you do in a day vs his workload. He's very clearly being unfair and selfish but there's very little chance he will be aware of this. \n\nGive him the choice. Either he makes a real effort and you start to feel love again; or this awful, unbalanced life ends and you both get divorced. And when people say how hard it would be for you to be a single parent? Yeah sounds like you've had lots of practice ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so sorry. &lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t get to tell you that the status quo will continue, with him contributing the bare minimum, and chastising you for &amp;quot;not doing enough&amp;quot; when you do most of it. &lt;/p&gt;\n\n&lt;p&gt;He&amp;#39;s selfish. This won&amp;#39;t change. Time for an ultimatum; he either goes to decent counselling with you and agrees to try to see what your life&amp;#39;s been like; or this is over and you divorce. &lt;/p&gt;\n\n&lt;p&gt;He does not get to tell you that you are trapped. You aren&amp;#39;t. You have given and given. So write it out. All the things you&amp;#39;ve paid for while making less $. All the things you do in a day vs his workload. He&amp;#39;s very clearly being unfair and selfish but there&amp;#39;s very little chance he will be aware of this. &lt;/p&gt;\n\n&lt;p&gt;Give him the choice. Either he makes a real effort and you start to feel love again; or this awful, unbalanced life ends and you both get divorced. And when people say how hard it would be for you to be a single parent? Yeah sounds like you&amp;#39;ve had lots of practice &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg91z3s", "score_hidden": false, "stickied": false, "created": 1492200716.0, "created_utc": 1492171916.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg9ybwa", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg9q54z", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "well it would be difficult for him to live comfortably, since I paid for the lights to be on, the heat and/or ac to come on, and for the water to run... So really, I wouldn't have felt as bad. But again, it wasn't when we were living there that I asked for him to leave. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;well it would be difficult for him to live comfortably, since I paid for the lights to be on, the heat and/or ac to come on, and for the water to run... So really, I wouldn&amp;#39;t have felt as bad. But again, it wasn&amp;#39;t when we were living there that I asked for him to leave. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9ybwa", "score_hidden": false, "stickied": false, "created": 1492242217.0, "created_utc": 1492213417.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9q54z", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Realloveintexas", "parent_id": "t1_dg9m1s1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Ok thanks for the information.\n\n\"And FYI- just bc someone pays the mortgage doesn't necessarily mean they have total ownership of the house.\"\nBut hypothetically it would be morally wrong for you to ask someone to move out of a house when they are 100% paying for it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ok thanks for the information.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;And FYI- just bc someone pays the mortgage doesn&amp;#39;t necessarily mean they have total ownership of the house.&amp;quot;\nBut hypothetically it would be morally wrong for you to ask someone to move out of a house when they are 100% paying for it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9q54z", "score_hidden": false, "stickied": false, "created": 1492231555.0, "created_utc": 1492202755.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9m1s1", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg9f3jf", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Sorry, we've moved very recently to a house that is owned by my family. I was originally going to take the kids here, but agreed to work on it. We moved as a family - and that's when I asked him to stay at \"his\" house. And FYI- just bc someone pays the mortgage doesn't necessarily mean they have total ownership of the house. We are both on the title. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, we&amp;#39;ve moved very recently to a house that is owned by my family. I was originally going to take the kids here, but agreed to work on it. We moved as a family - and that&amp;#39;s when I asked him to stay at &amp;quot;his&amp;quot; house. And FYI- just bc someone pays the mortgage doesn&amp;#39;t necessarily mean they have total ownership of the house. We are both on the title. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9m1s1", "score_hidden": false, "stickied": false, "created": 1492226638.0, "created_utc": 1492197838.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg9f3jf", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Realloveintexas", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I sympathize with you, but what do you mean by \n\"I have already asked him to move out, to which he has refused.\"\n\nWhat kind of question is that? How can you ask someone to move out of their own house that they are paying 100% of the mortgage for?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I sympathize with you, but what do you mean by \n&amp;quot;I have already asked him to move out, to which he has refused.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;What kind of question is that? How can you ask someone to move out of their own house that they are paying 100% of the mortgage for?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9f3jf", "score_hidden": false, "stickied": false, "created": 1492218408.0, "created_utc": 1492189608.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg98om0", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "miserylovescomputers", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your life is going to get a lot easier once you leave. You won't have to deal with his judgment of your imperfect execution of what ought to be your shared chores. You'll get child support. You will get breaks from being the parent on duty, if he chooses to exercise his visitation rights. You'll have the opportunity to meet someone new. Right now you have a 0% chance of finding happiness. Leaving will improve those odds drastically.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your life is going to get a lot easier once you leave. You won&amp;#39;t have to deal with his judgment of your imperfect execution of what ought to be your shared chores. You&amp;#39;ll get child support. You will get breaks from being the parent on duty, if he chooses to exercise his visitation rights. You&amp;#39;ll have the opportunity to meet someone new. Right now you have a 0% chance of finding happiness. Leaving will improve those odds drastically.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98om0", "score_hidden": false, "stickied": false, "created": 1492211057.0, "created_utc": 1492182257.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg8bo3m", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg81n5k", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "No I can't imagine it. I can barely get through each day as is now :-/", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No I can&amp;#39;t imagine it. I can barely get through each day as is now :-/&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8bo3m", "score_hidden": false, "stickied": false, "created": 1492150732.0, "created_utc": 1492121932.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81n5k", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "GiantASian01", "parent_id": "t1_dg81gu8", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Then there is nothing left to do. It has to be a two way street, if he isn't' willing to put in work to fix your marriage, there's nothing you can do.\n\nCan you imagine the rest of your life like this? You're still young, can you imagine the next 40-50 years together with this man?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Then there is nothing left to do. It has to be a two way street, if he isn&amp;#39;t&amp;#39; willing to put in work to fix your marriage, there&amp;#39;s nothing you can do.&lt;/p&gt;\n\n&lt;p&gt;Can you imagine the rest of your life like this? You&amp;#39;re still young, can you imagine the next 40-50 years together with this man?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg81n5k", "score_hidden": false, "stickied": false, "created": 1492139142.0, "created_utc": 1492110342.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81gu8", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg811rv", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "We tried marriage counseling. I made the arrangements and paid for it. But couldn't afford to continue. Nothing came from it.. It's like he is very afraid to be vulnerable. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We tried marriage counseling. I made the arrangements and paid for it. But couldn&amp;#39;t afford to continue. Nothing came from it.. It&amp;#39;s like he is very afraid to be vulnerable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg81gu8", "score_hidden": false, "stickied": false, "created": 1492138946.0, "created_utc": 1492110146.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg811rv", "gilded": 0, "archived": false, "score": 0, "report_reasons": null, "author": "GiantASian01", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "Highly recommend you guys get a marriage counselor if you want this marriage to work out...", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Highly recommend you guys get a marriage counselor if you want this marriage to work out...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg811rv", "score_hidden": false, "stickied": false, "created": 1492138492.0, "created_utc": 1492109692.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 0}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_657fwg", "likes": null, "replies": "", "user_reports": [], "id": "dg87vkd", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "heartbroken_12345", "parent_id": "t1_dg81axz", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah we've been to a few counsellors that I paid for and couldn't continue doing so. It didn't do anything bc one has to admit they have faults. This literally is the last place I'm turning as I think I've literally tried every possible thing. We don't really have money problems as in we struggle to make ends meet- more it's total dysfunction with how it is set up. So so dysfunctional. I can't even explain. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah we&amp;#39;ve been to a few counsellors that I paid for and couldn&amp;#39;t continue doing so. It didn&amp;#39;t do anything bc one has to admit they have faults. This literally is the last place I&amp;#39;m turning as I think I&amp;#39;ve literally tried every possible thing. We don&amp;#39;t really have money problems as in we struggle to make ends meet- more it&amp;#39;s total dysfunction with how it is set up. So so dysfunctional. I can&amp;#39;t even explain. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg87vkd", "score_hidden": false, "stickied": false, "created": 1492146023.0, "created_utc": 1492117223.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg81axz", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "turingtested", "parent_id": "t3_657fwg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Marital counseling.  There are way too many issues here to sort on on reddit.  I'm not a big fan of ultimatums, but I think it's time to say something like \"If you want us to stay together, we must go to counseling.\"\n\nNot to be an asshole, but you all have money problems, communication problems, and co parenting problems.  All need to be sorted out.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Marital counseling.  There are way too many issues here to sort on on reddit.  I&amp;#39;m not a big fan of ultimatums, but I think it&amp;#39;s time to say something like &amp;quot;If you want us to stay together, we must go to counseling.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Not to be an asshole, but you all have money problems, communication problems, and co parenting problems.  All need to be sorted out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg81axz", "score_hidden": false, "stickied": false, "created": 1492138768.0, "created_utc": 1492109968.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}]