[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"contest_mode": false, "banned_by": null, "media_embed": {}, "subreddit": "relationships", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is an unprecedented situation for me, and I don&amp;#39;t know how to deal.&lt;/p&gt;\n\n&lt;p&gt;The whole thing started around lunchtime today. In between class I had originally planned to meet my boyfriend (&amp;quot;C&amp;quot;) and grab something to eat, but one of my other friends was having car trouble and needed a ride, so I texted C that I wouldn&amp;#39;t make it to lunch and I was really sorry. &lt;/p&gt;\n\n&lt;p&gt;Didn&amp;#39;t hear a response from him for a little bit, went to class. By the time I got out of class and looked at my phone again, though, I had 12 missed calls from him and 22 texts. The messages made it clear that he was extremely angry over something, so I called to get clarification. On the phone, he accused me of cheating on him over lunch and demanded to know what I had been doing and who I had been with. I told him that I had just been helping a (female) friend with a ride and it was no big deal, and I was really sorry about missing our lunch date. He was still mad and hung up, I figured it would just blow over by the end of the day.&lt;/p&gt;\n\n&lt;p&gt;I should probably add, C does sometimes have jealousy/anger issues. He has been working on it and he has never gotten violent, and I think we all have issues of one kind of another. I probably should have foreseen agrravating those issues when I cancelled on lunch, but I just didn&amp;#39;t think. &lt;/p&gt;\n\n&lt;p&gt;Anyway, right as it was about time for class to be over, I got another text from C telling me that he was coming over to my apartment so we could &amp;quot;talk&amp;quot;. He was still mad, and I really didn&amp;#39;t want to get yelled at anymore, so I told him I wasn&amp;#39;t going to be there, and I went and chilled at another friend&amp;#39;s place for a while. Again, I figured C would burn out sooner or later and everything would be fine.&lt;/p&gt;\n\n&lt;p&gt;Then, a couple hours ago roughly, I got a text from C telling me that he was outside my apartment. I just reiterated that I was not home and we could talk later. I put my phone on silent because I was kind of getting peeved at him messaging me while he was still mad.&lt;/p&gt;\n\n&lt;p&gt;Like five minutes later I happen to look at my phone again. I have three missed calls and a message from my roommate (K). Her message says something like &amp;quot;C is slamming on the front door!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I tried to call her, no answer. I message her back &amp;quot;Tell him I&amp;#39;m not there.&amp;quot; No answer. Now I&amp;#39;m a little concerned, so I decide to head home and see wtf is going on.&lt;/p&gt;\n\n&lt;p&gt;When I get home, K and her boyfriend (W) are there. She&amp;#39;s crying, and he looks &lt;em&gt;furious&lt;/em&gt;. I asked him what the hell happened.&lt;/p&gt;\n\n&lt;p&gt;(Note: this is all info I got from W, I didn&amp;#39;t see it personally, and am unable to verify details)&lt;/p&gt;\n\n&lt;p&gt;He said that K had opened the door and tried to tell C that I wasn&amp;#39;t home, but he didn&amp;#39;t believe her and pushed his way into the apartment. I guess he was yelling and cussing at K a lot in anger, and she panicked and went and locked herself in her bedroom and called W to ask what she should do. W told her to call the police and he was coming over to wait with her until the cops got there (he lives like two buildings away from us).&lt;/p&gt;\n\n&lt;p&gt;Details get a little sketchy at this part, but what is obvious is that W and C got into some kind of physical confrontation when W got to the apartment. W has some bruises and a busted lip, I don&amp;#39;t know what the damage to C is. K had called the cops immediately after getting off the phone with W, and they arrived at this point.&lt;/p&gt;\n\n&lt;p&gt;Both of the boys were initially detained by police, but I guess after talking with everyone, the police decided C had started it all and released W. C was taken to the police station, probably until morning.&lt;/p&gt;\n\n&lt;p&gt;W and K left just a few minutes ago, K telling me she is probably not coming back for &amp;quot;a while&amp;quot; and may even pursue a restraining order against C. She and W both seem very mad about the situation. I have no idea where C is other than &amp;quot;in custody&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;So now I am home, alone. My roommate is ignoring my texts trying to apologize and I have no idea when or if she is coming back. If she does get the restraining order, C won&amp;#39;t be able to come over anymore.&lt;/p&gt;\n\n&lt;p&gt;And I know C fucked up, and K has every right to bar him from the apartment. But I think jail is only going to aggravate his issues and he may wind up getting in more trouble. So now I am alone, sad, and I feel like the whole world hates me over this shit.&lt;/p&gt;\n\n&lt;p&gt;What do I need to do to make it right?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: My boyfriend got mad, and frightened my roommate. Her boyfriend and mine got in a fight. Cops got called, my boyfriend arrested, and everyone is mad at me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "This is an unprecedented situation for me, and I don't know how to deal.\n  \nThe whole thing started around lunchtime today. In between class I had originally planned to meet my boyfriend (\"C\") and grab something to eat, but one of my other friends was having car trouble and needed a ride, so I texted C that I wouldn't make it to lunch and I was really sorry. \n\nDidn't hear a response from him for a little bit, went to class. By the time I got out of class and looked at my phone again, though, I had 12 missed calls from him and 22 texts. The messages made it clear that he was extremely angry over something, so I called to get clarification. On the phone, he accused me of cheating on him over lunch and demanded to know what I had been doing and who I had been with. I told him that I had just been helping a (female) friend with a ride and it was no big deal, and I was really sorry about missing our lunch date. He was still mad and hung up, I figured it would just blow over by the end of the day.\n\nI should probably add, C does sometimes have jealousy/anger issues. He has been working on it and he has never gotten violent, and I think we all have issues of one kind of another. I probably should have foreseen agrravating those issues when I cancelled on lunch, but I just didn't think. \n\nAnyway, right as it was about time for class to be over, I got another text from C telling me that he was coming over to my apartment so we could \"talk\". He was still mad, and I really didn't want to get yelled at anymore, so I told him I wasn't going to be there, and I went and chilled at another friend's place for a while. Again, I figured C would burn out sooner or later and everything would be fine.\n\nThen, a couple hours ago roughly, I got a text from C telling me that he was outside my apartment. I just reiterated that I was not home and we could talk later. I put my phone on silent because I was kind of getting peeved at him messaging me while he was still mad.\n\nLike five minutes later I happen to look at my phone again. I have three missed calls and a message from my roommate (K). Her message says something like \"C is slamming on the front door!\"\n\nI tried to call her, no answer. I message her back \"Tell him I'm not there.\" No answer. Now I'm a little concerned, so I decide to head home and see wtf is going on.\n\nWhen I get home, K and her boyfriend (W) are there. She's crying, and he looks *furious*. I asked him what the hell happened.\n\n(Note: this is all info I got from W, I didn't see it personally, and am unable to verify details)\n\nHe said that K had opened the door and tried to tell C that I wasn't home, but he didn't believe her and pushed his way into the apartment. I guess he was yelling and cussing at K a lot in anger, and she panicked and went and locked herself in her bedroom and called W to ask what she should do. W told her to call the police and he was coming over to wait with her until the cops got there (he lives like two buildings away from us).\n\nDetails get a little sketchy at this part, but what is obvious is that W and C got into some kind of physical confrontation when W got to the apartment. W has some bruises and a busted lip, I don't know what the damage to C is. K had called the cops immediately after getting off the phone with W, and they arrived at this point.\n\nBoth of the boys were initially detained by police, but I guess after talking with everyone, the police decided C had started it all and released W. C was taken to the police station, probably until morning.\n\nW and K left just a few minutes ago, K telling me she is probably not coming back for \"a while\" and may even pursue a restraining order against C. She and W both seem very mad about the situation. I have no idea where C is other than \"in custody\".\n\nSo now I am home, alone. My roommate is ignoring my texts trying to apologize and I have no idea when or if she is coming back. If she does get the restraining order, C won't be able to come over anymore.\n\nAnd I know C fucked up, and K has every right to bar him from the apartment. But I think jail is only going to aggravate his issues and he may wind up getting in more trouble. So now I am alone, sad, and I feel like the whole world hates me over this shit.\n\nWhat do I need to do to make it right?\n\n\n\n\n  ---   \n  **tl;dr**: My boyfriend got mad, and frightened my roommate. Her boyfriend and mine got in a fight. Cops got called, my boyfriend arrested, and everyone is mad at me.", "likes": null, "suggested_sort": "confidence", "user_reports": [], "secure_media": null, "link_flair_text": "Relationships", "id": "659zxo", "gilded": 0, "secure_media_embed": {}, "clicked": false, "score": 118, "report_reasons": null, "author": "needhelpthrow6579", "saved": false, "mod_reports": [], "name": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "approved_by": null, "over_18": false, "domain": "self.relationships", "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qjvn", "edited": false, "link_flair_css_class": "m-vt relationships", "author_flair_css_class": null, "downs": 0, "brand_safe": true, "archived": false, "removal_reason": null, "is_self": true, "hide_score": false, "spoiler": false, "permalink": "/r/relationships/comments/659zxo/my_21f_boyfriend_26m_got_into_a_fight_with_my/", "num_reports": null, "locked": false, "stickied": false, "created": 1492165538.0, "url": "https://www.reddit.com/r/relationships/comments/659zxo/my_21f_boyfriend_26m_got_into_a_fight_with_my/", "author_flair_text": null, "quarantine": false, "title": "My [21F] boyfriend [26M] got into a fight with my roommate's [20F] boyfriend [23M] and I think I am at fault. What should I do?", "created_utc": 1492136738.0, "distinguished": null, "media": null, "upvote_ratio": 0.77, "num_comments": 75, "visited": false, "subreddit_type": "public", "ups": 118}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8wd04", "gilded": 0, "archived": false, "score": 120, "report_reasons": null, "author": "lydocia", "parent_id": "t1_dg8tv4b", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "To two  UNINVOLVED people. \n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To two  UNINVOLVED people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8wd04", "score_hidden": false, "stickied": false, "created": 1492184075.0, "created_utc": 1492155275.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 120}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8xin9", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "Mochafrap512", "parent_id": "t1_dg8tv4b", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This, op! He hasn't been violent with YOU, YET. He will. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This, op! He hasn&amp;#39;t been violent with YOU, YET. He will. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8xin9", "score_hidden": false, "stickied": false, "created": 1492187567.0, "created_utc": 1492158767.0, "depth": 3, "mod_reports": [], "subreddit_type": "public", "ups": 55}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8tv4b", "gilded": 0, "archived": false, "score": 246, "report_reasons": null, "author": "OGKjarBjar", "parent_id": "t1_dg8s9w6", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He probably would have hurt her! \n\nOP, you say \"he's never been violent,\" yet he physically pushed your female roommate out of the way to gain access to your apartment after *violently* beating/slamming on the door. Then he busted up her boyfriend's lip and visibly bruised him. Hate to break it to you, but that's violence. To TWO people. \n\nHe *is* violent.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He probably would have hurt her! &lt;/p&gt;\n\n&lt;p&gt;OP, you say &amp;quot;he&amp;#39;s never been violent,&amp;quot; yet he physically pushed your female roommate out of the way to gain access to your apartment after &lt;em&gt;violently&lt;/em&gt; beating/slamming on the door. Then he busted up her boyfriend&amp;#39;s lip and visibly bruised him. Hate to break it to you, but that&amp;#39;s violence. To TWO people. &lt;/p&gt;\n\n&lt;p&gt;He &lt;em&gt;is&lt;/em&gt; violent.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8tv4b", "score_hidden": false, "stickied": false, "created": 1492177833.0, "created_utc": 1492149033.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 246}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8s9w6", "gilded": 0, "archived": false, "score": 221, "report_reasons": null, "author": "maedocc", "parent_id": "t1_dg8mvlj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I know. The OP says she needs to know what to do to make everything right, but in reality, she should be glad she wasn't home when C. showed up at her place. He could have seriously hurt OP, and then C. would have been arrested anyway. \n\nWhat you need to do is break up with C. immediately, tell your roommate that you're done with him and help her get a restraining order against him. I'm warning you though, he will try to fight this every step of the way. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know. The OP says she needs to know what to do to make everything right, but in reality, she should be glad she wasn&amp;#39;t home when C. showed up at her place. He could have seriously hurt OP, and then C. would have been arrested anyway. &lt;/p&gt;\n\n&lt;p&gt;What you need to do is break up with C. immediately, tell your roommate that you&amp;#39;re done with him and help her get a restraining order against him. I&amp;#39;m warning you though, he will try to fight this every step of the way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8s9w6", "score_hidden": false, "stickied": false, "created": 1492174667.0, "created_utc": 1492145867.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 221}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8w7lg", "gilded": 0, "archived": false, "score": 98, "report_reasons": null, "author": "Omgjenny", "parent_id": "t1_dg8mvlj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Don't forget all this started because she missed lunch!! Having him around not only endangers yourself OP, but also the people around you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t forget all this started because she missed lunch!! Having him around not only endangers yourself OP, but also the people around you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8w7lg", "score_hidden": false, "stickied": false, "created": 1492183645.0, "created_utc": 1492154845.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 98}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8wcgh", "gilded": 0, "archived": false, "score": 91, "report_reasons": null, "author": "lydocia", "parent_id": "t1_dg8mvlj", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "He was arrested because of his violent reaction to you *helping a friend*.\n\nIf that isn't obviously abusive, I don't know what is. Just think about *you* having been at the receiving end of his anger had you been home.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He was arrested because of his violent reaction to you &lt;em&gt;helping a friend&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;If that isn&amp;#39;t obviously abusive, I don&amp;#39;t know what is. Just think about &lt;em&gt;you&lt;/em&gt; having been at the receiving end of his anger had you been home.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8wcgh", "score_hidden": false, "stickied": false, "created": 1492184028.0, "created_utc": 1492155228.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 91}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8mvlj", "gilded": 0, "archived": false, "score": 629, "report_reasons": null, "author": "kitten712", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Good god leave this man asap. He has anger issues and sounds terrifying to deal with! Hell, you avoided him because you didn't want to deal with it so now your roommate and her boyfriend had to and look what happened to them. Do everyone a favour including yourself and leave this guy. I don't blame your roommate for ignoring you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Good god leave this man asap. He has anger issues and sounds terrifying to deal with! Hell, you avoided him because you didn&amp;#39;t want to deal with it so now your roommate and her boyfriend had to and look what happened to them. Do everyone a favour including yourself and leave this guy. I don&amp;#39;t blame your roommate for ignoring you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8mvlj", "score_hidden": false, "stickied": false, "created": 1492166019.0, "created_utc": 1492137219.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 629}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8n8z8", "gilded": 0, "archived": false, "score": 247, "report_reasons": null, "author": "sezese", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Holy fucking shit your boyfriend is terrifying. If the best thing you can say about him is that he hasn't gotten violent with you *yet*, run. If he demonstrably does violence against your friends because he thinks you *might* be cheating on him without evidence, burn the bridge behind you. One day, he will turn that violence on you.\n\nIt isn't your fault that he acted this way. Ignoring the theatrics of morbid jealousy is often the best way to deal with it. You had no way of knowing that he'd escalate to that level of violence. The only way you can make it up to your roommate is by leaving this man and supporting her and her boyfriend 100% against the restraining order. Hell, consider getting one yourself. \n\nEdit: Even then, they may  not want to talk to you. But you will be able to be confident that you did what was right.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy fucking shit your boyfriend is terrifying. If the best thing you can say about him is that he hasn&amp;#39;t gotten violent with you &lt;em&gt;yet&lt;/em&gt;, run. If he demonstrably does violence against your friends because he thinks you &lt;em&gt;might&lt;/em&gt; be cheating on him without evidence, burn the bridge behind you. One day, he will turn that violence on you.&lt;/p&gt;\n\n&lt;p&gt;It isn&amp;#39;t your fault that he acted this way. Ignoring the theatrics of morbid jealousy is often the best way to deal with it. You had no way of knowing that he&amp;#39;d escalate to that level of violence. The only way you can make it up to your roommate is by leaving this man and supporting her and her boyfriend 100% against the restraining order. Hell, consider getting one yourself. &lt;/p&gt;\n\n&lt;p&gt;Edit: Even then, they may  not want to talk to you. But you will be able to be confident that you did what was right.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8n8z8", "score_hidden": false, "stickied": false, "created": 1492166556.0, "created_utc": 1492137756.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 247}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg976jz", "gilded": 0, "archived": false, "score": 58, "report_reasons": null, "author": "wistfulLDRplans", "parent_id": "t1_dg8suew", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; She and W both seem very mad about the situation\n\nYeah, no shit. I wonder why? Unbelievable. I hope they help her see what she needs to do if this thread doesn't convince her.", "edited": 1492180635.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;She and W both seem very mad about the situation&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yeah, no shit. I wonder why? Unbelievable. I hope they help her see what she needs to do if this thread doesn&amp;#39;t convince her.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg976jz", "score_hidden": false, "stickied": false, "created": 1492209137.0, "created_utc": 1492180337.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 58}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8vspl", "gilded": 0, "archived": false, "score": 116, "report_reasons": null, "author": "Orac1971", "parent_id": "t1_dg8suew", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This, op your head is up your arse.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This, op your head is up your arse.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8vspl", "score_hidden": false, "stickied": false, "created": 1492182510.0, "created_utc": 1492153710.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 116}}, {"kind": "t1", "data": {"author_cakeday": true, "subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9jlfg", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "ashikkins", "parent_id": "t1_dg8suew", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "And what if her roommate HADN'T locked herself in her room? This is horrible. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And what if her roommate HADN&amp;#39;T locked herself in her room? This is horrible. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9jlfg", "score_hidden": false, "stickied": false, "created": 1492223676.0, "created_utc": 1492194876.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 12}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8suew", "gilded": 0, "archived": false, "score": 369, "report_reasons": null, "author": "harkandhush", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; If she does get the restraining order, C won't be able to come over anymore.\n\nAre you fucking kidding me?  This is where you concern is?  You need to fix your priorities.  C treated you like shit over a completely irrational thing, then proceeded to harass  and scare the shit out of your roommate and force his way into her living space when you weren't there and he was angry and could do anything to her.  He then got into a physical fight with her boyfriend who was then detained by the fucking police because he wanted to defend his girlfriend from an angry and potentially dangerous man.\n\nC fucked up.  He fucked up really badly and he needs a ton of fucking help and is obviously an abuser, but if you ever think about bringing him anywhere near your roommate or into her living space again, then you are unfathomably selfish.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;If she does get the restraining order, C won&amp;#39;t be able to come over anymore.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Are you fucking kidding me?  This is where you concern is?  You need to fix your priorities.  C treated you like shit over a completely irrational thing, then proceeded to harass  and scare the shit out of your roommate and force his way into her living space when you weren&amp;#39;t there and he was angry and could do anything to her.  He then got into a physical fight with her boyfriend who was then detained by the fucking police because he wanted to defend his girlfriend from an angry and potentially dangerous man.&lt;/p&gt;\n\n&lt;p&gt;C fucked up.  He fucked up really badly and he needs a ton of fucking help and is obviously an abuser, but if you ever think about bringing him anywhere near your roommate or into her living space again, then you are unfathomably selfish.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8suew", "score_hidden": false, "stickied": false, "created": 1492175773.0, "created_utc": 1492146973.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 369}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg98tsq", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "Orac1971", "parent_id": "t1_dg8qpdg", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is what i got from it, it is depressing but never mind when she has had a few beatings she may come around.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is what i got from it, it is depressing but never mind when she has had a few beatings she may come around.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98tsq", "score_hidden": false, "stickied": false, "created": 1492211234.0, "created_utc": 1492182434.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 9}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8qpdg", "gilded": 0, "archived": false, "score": 161, "report_reasons": null, "author": "throwx333", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Reading this makes me so sad because there is this unstated belief in here that you have to stay with this terrible person. \n\nYour boyfriend is a terrible person. I know you don't want to see it but what you are describing is not normal. You shouldn't have to hide at a friends house. You shouldn't have to wait for him to cool down. \n\nWhat future do you see here? Are you always planning to have somewhere to hide when he gets violent? He is going to hurt you physically sooner rather than later. \n\nI don't know,. This makes me so sad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Reading this makes me so sad because there is this unstated belief in here that you have to stay with this terrible person. &lt;/p&gt;\n\n&lt;p&gt;Your boyfriend is a terrible person. I know you don&amp;#39;t want to see it but what you are describing is not normal. You shouldn&amp;#39;t have to hide at a friends house. You shouldn&amp;#39;t have to wait for him to cool down. &lt;/p&gt;\n\n&lt;p&gt;What future do you see here? Are you always planning to have somewhere to hide when he gets violent? He is going to hurt you physically sooner rather than later. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know,. This makes me so sad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8qpdg", "score_hidden": false, "stickied": false, "created": 1492171917.0, "created_utc": 1492143117.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 161}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8nv3b", "gilded": 0, "archived": false, "score": 149, "report_reasons": null, "author": "Crash662244", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Maybe you should go with K and get your own restraining order. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe you should go with K and get your own restraining order. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8nv3b", "score_hidden": false, "stickied": false, "created": 1492167455.0, "created_utc": 1492138655.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 149}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg992ez", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "thumb_of_justice", "parent_id": "t1_dg983lx", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "And I'd hate her if she put me back into that situation. First time, she didn't know. Now she does know.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;And I&amp;#39;d hate her if she put me back into that situation. First time, she didn&amp;#39;t know. Now she does know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg992ez", "score_hidden": false, "stickied": false, "created": 1492211529.0, "created_utc": 1492182729.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, "user_reports": [], "id": "dg983lx", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "Bonobosaurus", "parent_id": "t1_dg8rm71", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; no one reasonable would hate you over this! \n\nMaybe not hate her but if I were her roommate I'd be ROYALLY pissed off that she put me in that kind of danger.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;no one reasonable would hate you over this! &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Maybe not hate her but if I were her roommate I&amp;#39;d be ROYALLY pissed off that she put me in that kind of danger.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg983lx", "score_hidden": false, "stickied": false, "created": 1492210326.0, "created_utc": 1492181526.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 40}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rm71", "gilded": 0, "archived": false, "score": 119, "report_reasons": null, "author": "Kiefinater", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I rarely ever reply here but I am so worried about you right now. Aw Op please don't go straight to self loathing and shame, no one reasonable would hate you over this! \n\nThat being said, you fucked up in many ways so I think it would be helpful to point them out for future reference \n\n1- When someone is being aggressive, like say angrily calling 12 and texting 22 times because of an imaginary fear, you HAVE to react. Don't ever just wait for them to \"burn out\" because the alternative isn't pretty. \n\n2- You should have warned K immediately that an angry person was waiting outside of her apartment. This is the worst part, your nonchalance put her in danger. (She probably is shaken and just needs some space, I would stop texting for the night) \n\n3- WTF, OP. Your concern is that he can't come over anymore? Girl, c'mon. I mean, he forced his way into your home to confront you in a rage, easily could have been you or K with bloody lips or much much worse! Don't think twice about cutting him off completely. If I were her it would be disturbing to me that you continued seeing him after this. You mentioned wanting to make it up to K. If you really do, start by get a restraining order ASAP. \n\n4- Your concern that everyone is mad at/hates you. K and her boyfriend just dealt with your problem, they get to be upset. It doesn't mean they hate You, your only error was not taking it seriously enough (its not easy to tell what's drama and what's serious shit, it's okay!). I sense mental health or self esteem issues on your part. It'd be great if you took advantage of the therapy services on campus, talking to a professional will help you understand what and how went wrong and how to take care of yourself! \n\nAlso I instantly didn't like a man who is closer to 30 and dating a college student. Age differences can mean very little but it seems like he's not mature or stable enough to be with someone his own age? Obviously I know very very little about you two but it's just a feeling...red flags, so many red flags. \n\nDo you have a friend to stay with?I wouldn't be anywhere near home for the next few days. He might somehow have gotten released, etc. \n\nTake care OP. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I rarely ever reply here but I am so worried about you right now. Aw Op please don&amp;#39;t go straight to self loathing and shame, no one reasonable would hate you over this! &lt;/p&gt;\n\n&lt;p&gt;That being said, you fucked up in many ways so I think it would be helpful to point them out for future reference &lt;/p&gt;\n\n&lt;p&gt;1- When someone is being aggressive, like say angrily calling 12 and texting 22 times because of an imaginary fear, you HAVE to react. Don&amp;#39;t ever just wait for them to &amp;quot;burn out&amp;quot; because the alternative isn&amp;#39;t pretty. &lt;/p&gt;\n\n&lt;p&gt;2- You should have warned K immediately that an angry person was waiting outside of her apartment. This is the worst part, your nonchalance put her in danger. (She probably is shaken and just needs some space, I would stop texting for the night) &lt;/p&gt;\n\n&lt;p&gt;3- WTF, OP. Your concern is that he can&amp;#39;t come over anymore? Girl, c&amp;#39;mon. I mean, he forced his way into your home to confront you in a rage, easily could have been you or K with bloody lips or much much worse! Don&amp;#39;t think twice about cutting him off completely. If I were her it would be disturbing to me that you continued seeing him after this. You mentioned wanting to make it up to K. If you really do, start by get a restraining order ASAP. &lt;/p&gt;\n\n&lt;p&gt;4- Your concern that everyone is mad at/hates you. K and her boyfriend just dealt with your problem, they get to be upset. It doesn&amp;#39;t mean they hate You, your only error was not taking it seriously enough (its not easy to tell what&amp;#39;s drama and what&amp;#39;s serious shit, it&amp;#39;s okay!). I sense mental health or self esteem issues on your part. It&amp;#39;d be great if you took advantage of the therapy services on campus, talking to a professional will help you understand what and how went wrong and how to take care of yourself! &lt;/p&gt;\n\n&lt;p&gt;Also I instantly didn&amp;#39;t like a man who is closer to 30 and dating a college student. Age differences can mean very little but it seems like he&amp;#39;s not mature or stable enough to be with someone his own age? Obviously I know very very little about you two but it&amp;#39;s just a feeling...red flags, so many red flags. &lt;/p&gt;\n\n&lt;p&gt;Do you have a friend to stay with?I wouldn&amp;#39;t be anywhere near home for the next few days. He might somehow have gotten released, etc. &lt;/p&gt;\n\n&lt;p&gt;Take care OP. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8rm71", "score_hidden": false, "stickied": false, "created": 1492173466.0, "created_utc": 1492144666.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 119}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8ouyf", "gilded": 0, "archived": false, "score": 73, "report_reasons": null, "author": "browneyesandlashes", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Do you understand the gravity of what happened? You need to get somewhere safe and NEVER speak to him again. He's shown you what he's capable of and you need to take this seriously. Talk to your parents and alert the school. I'd also suggest moving. Block his number. This was NOT your fault fault op this is all on him. The way he's behaving is not ok. He's dangerous. Who knows what else would have happened had you been there. Be safe Op and please talk to your parents!", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Do you understand the gravity of what happened? You need to get somewhere safe and NEVER speak to him again. He&amp;#39;s shown you what he&amp;#39;s capable of and you need to take this seriously. Talk to your parents and alert the school. I&amp;#39;d also suggest moving. Block his number. This was NOT your fault fault op this is all on him. The way he&amp;#39;s behaving is not ok. He&amp;#39;s dangerous. Who knows what else would have happened had you been there. Be safe Op and please talk to your parents!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8ouyf", "score_hidden": false, "stickied": false, "created": 1492168960.0, "created_utc": 1492140160.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 73}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8ndd3", "gilded": 0, "archived": false, "score": 138, "report_reasons": null, "author": "lalalaurrenn", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well the first thing you do is break up with your INSANE and DANGEROUS boyfriend! I would have suggested that when he accused you of cheating on him out of nowhere, but then he goes to your house and physically attacks someone?? Are you kidding me? Then you should consider getting a restraining order yourself, because God only knows what he's going to do when you try to leave him. Your room mate will hopefully move past this once you assure he that your ex will never be allowed at the house again. You owe her boyfriend a batch of cookies or something probably.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well the first thing you do is break up with your INSANE and DANGEROUS boyfriend! I would have suggested that when he accused you of cheating on him out of nowhere, but then he goes to your house and physically attacks someone?? Are you kidding me? Then you should consider getting a restraining order yourself, because God only knows what he&amp;#39;s going to do when you try to leave him. Your room mate will hopefully move past this once you assure he that your ex will never be allowed at the house again. You owe her boyfriend a batch of cookies or something probably.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8ndd3", "score_hidden": false, "stickied": false, "created": 1492166732.0, "created_utc": 1492137932.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 138}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8ruw8", "gilded": 0, "archived": false, "score": 55, "report_reasons": null, "author": "sicera", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You had no way of knowing that he would terrorize your roommate and assault her boyfriend. But now you do, and you're worried that he won't be able to come over anymore? Of course he can't come over any more! Even if you choose to stay with someone who is clearly dangerous, what makes you think you have the right to bring him around your roommate after what he did?\n\nDid you ever think what might have happened to your roommate if she'd been alone? Or what might have happened to *you* if you'd been there?\n\nWhat happened wasn't your fault, and reasonable people wouldn't be angry at you for it, unless you forgive him. By continuing to date him, you're condoning his behavior, and showing massive disrespect for K and W, who took a beating for you.\n\nStop worrying about jail \"aggravating\" C's issues. C has never wanted help for his issues. If anything, jail will at least make him aware of the consequences of his actions.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You had no way of knowing that he would terrorize your roommate and assault her boyfriend. But now you do, and you&amp;#39;re worried that he won&amp;#39;t be able to come over anymore? Of course he can&amp;#39;t come over any more! Even if you choose to stay with someone who is clearly dangerous, what makes you think you have the right to bring him around your roommate after what he did?&lt;/p&gt;\n\n&lt;p&gt;Did you ever think what might have happened to your roommate if she&amp;#39;d been alone? Or what might have happened to &lt;em&gt;you&lt;/em&gt; if you&amp;#39;d been there?&lt;/p&gt;\n\n&lt;p&gt;What happened wasn&amp;#39;t your fault, and reasonable people wouldn&amp;#39;t be angry at you for it, unless you forgive him. By continuing to date him, you&amp;#39;re condoning his behavior, and showing massive disrespect for K and W, who took a beating for you.&lt;/p&gt;\n\n&lt;p&gt;Stop worrying about jail &amp;quot;aggravating&amp;quot; C&amp;#39;s issues. C has never wanted help for his issues. If anything, jail will at least make him aware of the consequences of his actions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8ruw8", "score_hidden": false, "stickied": false, "created": 1492173897.0, "created_utc": 1492145097.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 55}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8rzxt", "gilded": 0, "archived": false, "score": 53, "report_reasons": null, "author": "walk_through_this", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; What do I need to do to make it right?\n\nUh, never ever speak to C again.\n\nSo many red flags in this story. But barging into your apartment and getting into a fistfight with somebody else is not something you cause by turning off your phone. \n\nYou stayed away from him, admit it, because you were afraid of what he was going to do. And he did something terrible, just not to you directly.\n\nHow could you *possibly* trust him to be reasonable after seeing this sort of thing?\n\nNothing you could say or text or message would ever, ever justify this kind of violent behavior. \n\nPlease, put a restraining order in place and stay away from this dangerous jerk. You need to understand that you did nothing to deserve this shithead and you are better off far away from him. \n\nJail is where he belongs.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What do I need to do to make it right?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Uh, never ever speak to C again.&lt;/p&gt;\n\n&lt;p&gt;So many red flags in this story. But barging into your apartment and getting into a fistfight with somebody else is not something you cause by turning off your phone. &lt;/p&gt;\n\n&lt;p&gt;You stayed away from him, admit it, because you were afraid of what he was going to do. And he did something terrible, just not to you directly.&lt;/p&gt;\n\n&lt;p&gt;How could you &lt;em&gt;possibly&lt;/em&gt; trust him to be reasonable after seeing this sort of thing?&lt;/p&gt;\n\n&lt;p&gt;Nothing you could say or text or message would ever, ever justify this kind of violent behavior. &lt;/p&gt;\n\n&lt;p&gt;Please, put a restraining order in place and stay away from this dangerous jerk. You need to understand that you did nothing to deserve this shithead and you are better off far away from him. &lt;/p&gt;\n\n&lt;p&gt;Jail is where he belongs.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8rzxt", "score_hidden": false, "stickied": false, "created": 1492174156.0, "created_utc": 1492145356.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 53}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8ndop", "gilded": 0, "archived": false, "score": 74, "report_reasons": null, "author": "tassle7", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Everyone does have issues. Absolutely. However just because they have issues doesn't mean we have to accept behavior like this. \n\nYou gloss over him accusing you of CHEATING for not making lunch. Wtf. That's insane. \n\nThe number of texts/calls are also over the top. \n\nImagine a secure relationship (or hell! yourself!) when someone doesn't call back/text back immediately and we know NORMALLY they are \"in class\" at this time, or maybe at work, we don't continue to call and text. A secure person knows their person is busy and their person is dependable and will contact back when available. They do not call/text extraordinary amounts hoping to force a response. That's not healthy. \n\nBut you know what else healthy people don't do? FORCE their way into a HOME uninvited because they believe they have a right to, simply because they know someone who lives there. \n\nNow think about this honestly. How many residences have you felt entitled to enter? How many places have you bodily forced your way into? DO NOT think about his anger. Or what reason he might have to believe he belongs there. Have you ever felt you can do these things?\n\nMost likely the answer is no. Because you understand OTHER people's boundaries. Boundaries are important to establish a safe relationship. They guard you. They also guard the other person. \n\nPeople who do not recognize or care for other people's boundaries are disrespectful at the least but on the dangerous side they can be abusive and hurtful. \n\nYour job is not to rationalize and come up with reasons your bf might have for his behavior. That doesn't make you \"sensitive\" and \"more aware\" of other's perspectives. It means you are eroding your own boundaries in lieu of another person overstepping them. \n\nYour bf's behavior was absolutely not okay under any circumstances for any reason. \n\nPerhaps your roommate is ignoring you because she thinks you are making excuses for him by blaming yourself (which is scary). Like she was so scared she CALLED THE COPS. She isn't a drama queen overreacting to your trespassing, enraged bf. \n\nI think you need to seriously consider if this type of behavior is acceptable FOR YOU. Not, do you love him. But would you truly be happy being with someone who responds this way to a missed lunch? Is this healthy? Is this how I want future interactions to go? If the answer is no to any of those, then honey please LOVE YOURSELF enough to move on. Give your friend space. And I guarantee they will come back once they see you aren't bedding unhealthy rage monster\n\n(This advice given by someone married to a \"rage aholic\" for ten years - oh btw, he was actually abusive I just thought he had anger issues)\n\nEdit: a word", "edited": 1492172985.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Everyone does have issues. Absolutely. However just because they have issues doesn&amp;#39;t mean we have to accept behavior like this. &lt;/p&gt;\n\n&lt;p&gt;You gloss over him accusing you of CHEATING for not making lunch. Wtf. That&amp;#39;s insane. &lt;/p&gt;\n\n&lt;p&gt;The number of texts/calls are also over the top. &lt;/p&gt;\n\n&lt;p&gt;Imagine a secure relationship (or hell! yourself!) when someone doesn&amp;#39;t call back/text back immediately and we know NORMALLY they are &amp;quot;in class&amp;quot; at this time, or maybe at work, we don&amp;#39;t continue to call and text. A secure person knows their person is busy and their person is dependable and will contact back when available. They do not call/text extraordinary amounts hoping to force a response. That&amp;#39;s not healthy. &lt;/p&gt;\n\n&lt;p&gt;But you know what else healthy people don&amp;#39;t do? FORCE their way into a HOME uninvited because they believe they have a right to, simply because they know someone who lives there. &lt;/p&gt;\n\n&lt;p&gt;Now think about this honestly. How many residences have you felt entitled to enter? How many places have you bodily forced your way into? DO NOT think about his anger. Or what reason he might have to believe he belongs there. Have you ever felt you can do these things?&lt;/p&gt;\n\n&lt;p&gt;Most likely the answer is no. Because you understand OTHER people&amp;#39;s boundaries. Boundaries are important to establish a safe relationship. They guard you. They also guard the other person. &lt;/p&gt;\n\n&lt;p&gt;People who do not recognize or care for other people&amp;#39;s boundaries are disrespectful at the least but on the dangerous side they can be abusive and hurtful. &lt;/p&gt;\n\n&lt;p&gt;Your job is not to rationalize and come up with reasons your bf might have for his behavior. That doesn&amp;#39;t make you &amp;quot;sensitive&amp;quot; and &amp;quot;more aware&amp;quot; of other&amp;#39;s perspectives. It means you are eroding your own boundaries in lieu of another person overstepping them. &lt;/p&gt;\n\n&lt;p&gt;Your bf&amp;#39;s behavior was absolutely not okay under any circumstances for any reason. &lt;/p&gt;\n\n&lt;p&gt;Perhaps your roommate is ignoring you because she thinks you are making excuses for him by blaming yourself (which is scary). Like she was so scared she CALLED THE COPS. She isn&amp;#39;t a drama queen overreacting to your trespassing, enraged bf. &lt;/p&gt;\n\n&lt;p&gt;I think you need to seriously consider if this type of behavior is acceptable FOR YOU. Not, do you love him. But would you truly be happy being with someone who responds this way to a missed lunch? Is this healthy? Is this how I want future interactions to go? If the answer is no to any of those, then honey please LOVE YOURSELF enough to move on. Give your friend space. And I guarantee they will come back once they see you aren&amp;#39;t bedding unhealthy rage monster&lt;/p&gt;\n\n&lt;p&gt;(This advice given by someone married to a &amp;quot;rage aholic&amp;quot; for ten years - oh btw, he was actually abusive I just thought he had anger issues)&lt;/p&gt;\n\n&lt;p&gt;Edit: a word&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8ndop", "score_hidden": false, "stickied": false, "created": 1492166745.0, "created_utc": 1492137945.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 74}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8t7lm", "gilded": 0, "archived": false, "score": 31, "report_reasons": null, "author": "LouveMonstre", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "That \"I can help fix him\" attitude needs to stop right now. You're in the cycle of abuse, and don't try to say otherwise because just from this snippet of a story I can tell you this dude is wildly abusive. You can't even cancel a date without him trying to break your door down and getting arrested! I bet you haven't even seen the tip of the iceberg when it comes to his anger. \n\n\nIt's not your job to fix or help fix a grown ass man's abusive behaviors. Yes, everyone has baggage, but baggage means things like quirks, bad habits, maybe mild mental illness, etc.. not abuse. This guy is bad news and you need to get out right now. Have some confidence in yourself and realize you deserve better than an abusive asshole you have to make excuses for every other sentence. I've been married for 11 years and this is NOT a healthy relationship no matter if he can be sweet sometimes or \"our relationship is perfect besides this!\" Get👏🏻out👏🏻now👏🏻!!! ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That &amp;quot;I can help fix him&amp;quot; attitude needs to stop right now. You&amp;#39;re in the cycle of abuse, and don&amp;#39;t try to say otherwise because just from this snippet of a story I can tell you this dude is wildly abusive. You can&amp;#39;t even cancel a date without him trying to break your door down and getting arrested! I bet you haven&amp;#39;t even seen the tip of the iceberg when it comes to his anger. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not your job to fix or help fix a grown ass man&amp;#39;s abusive behaviors. Yes, everyone has baggage, but baggage means things like quirks, bad habits, maybe mild mental illness, etc.. not abuse. This guy is bad news and you need to get out right now. Have some confidence in yourself and realize you deserve better than an abusive asshole you have to make excuses for every other sentence. I&amp;#39;ve been married for 11 years and this is NOT a healthy relationship no matter if he can be sweet sometimes or &amp;quot;our relationship is perfect besides this!&amp;quot; Get👏🏻out👏🏻now👏🏻!!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8t7lm", "score_hidden": false, "stickied": false, "created": 1492176497.0, "created_utc": 1492147697.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 31}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8nq8n", "gilded": 0, "archived": false, "score": 25, "report_reasons": null, "author": "RoamingAmber", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What you need to do is make sure you're taking care of your personal safety and the safety of your home moving forward. What happened wasn't your fault, although K and W have every reason to be mad at C and at the situation (and frankly, that fear and anger may get taken out on you for awhile).\n\nMake it clear to C (through the courts, preferably) that he's no longer welcome around you or your apartment. When you go out, go with a friend or at least make sure a friend knows where you are and when you're supposed to be coming back. Support K and W's efforts to get a restraining order if that's the route they go. Install a WiFi security camera, and make sure your neighbors know what happened as well.\n\nTake care of yourself, OP, that's some scary behavior on your ex's part (I say ex because I hope you know you need to be ought of this). ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What you need to do is make sure you&amp;#39;re taking care of your personal safety and the safety of your home moving forward. What happened wasn&amp;#39;t your fault, although K and W have every reason to be mad at C and at the situation (and frankly, that fear and anger may get taken out on you for awhile).&lt;/p&gt;\n\n&lt;p&gt;Make it clear to C (through the courts, preferably) that he&amp;#39;s no longer welcome around you or your apartment. When you go out, go with a friend or at least make sure a friend knows where you are and when you&amp;#39;re supposed to be coming back. Support K and W&amp;#39;s efforts to get a restraining order if that&amp;#39;s the route they go. Install a WiFi security camera, and make sure your neighbors know what happened as well.&lt;/p&gt;\n\n&lt;p&gt;Take care of yourself, OP, that&amp;#39;s some scary behavior on your ex&amp;#39;s part (I say ex because I hope you know you need to be ought of this). &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8nq8n", "score_hidden": false, "stickied": false, "created": 1492167251.0, "created_utc": 1492138451.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8tf0c", "gilded": 0, "archived": false, "score": 23, "report_reasons": null, "author": "oliverjbrown", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "dump him. he could have beat your face in tonight", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;dump him. he could have beat your face in tonight&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8tf0c", "score_hidden": false, "stickied": false, "created": 1492176891.0, "created_utc": 1492148091.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 23}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8xrcr", "gilded": 0, "archived": false, "score": 20, "report_reasons": null, "author": "EX_CALIBUR45", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This post only needs two words: LEAVE HIM. \n\nWhy? Well the facts are: \n\nYou wanted to avoid him because he has anger issues, are you scared of him hurting you? That's what it sounds like if you actively wanted to avoid him. \n\nHe SLAMMED on your apartment door, your roommate was SCARED for her safety, she TRIED to tell him you weren't home and once she opened the door he PUSHED passed her and she LOCKED herself in her room or of fear. \n\nYour roommate called her boyfriend, who upon your return had BRUISES and a BUSTED LIP, the POLICE arrived and took them both into CUSTODY and let your roommate's boyfriend leave, but KEPT him overnight. Now your roommate is AFRAID to stay in her own place and seeking a RESTRAINING ORDER against your boyfriend. Which personally you should as well! \n\nLeave him, tell your roommate you have, tell her that you will seek out a restraining order as well, this guy is violent and if you stay with him you'll end up either getting beaten up or he will control your entire life, you won't even have friends to see if you do stay with him as he will get jealous of anything as he has clearly proven. All you need to do is read some of the posts here from women in a controlling relationship and unstated the gravity of staying with a person like this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post only needs two words: LEAVE HIM. &lt;/p&gt;\n\n&lt;p&gt;Why? Well the facts are: &lt;/p&gt;\n\n&lt;p&gt;You wanted to avoid him because he has anger issues, are you scared of him hurting you? That&amp;#39;s what it sounds like if you actively wanted to avoid him. &lt;/p&gt;\n\n&lt;p&gt;He SLAMMED on your apartment door, your roommate was SCARED for her safety, she TRIED to tell him you weren&amp;#39;t home and once she opened the door he PUSHED passed her and she LOCKED herself in her room or of fear. &lt;/p&gt;\n\n&lt;p&gt;Your roommate called her boyfriend, who upon your return had BRUISES and a BUSTED LIP, the POLICE arrived and took them both into CUSTODY and let your roommate&amp;#39;s boyfriend leave, but KEPT him overnight. Now your roommate is AFRAID to stay in her own place and seeking a RESTRAINING ORDER against your boyfriend. Which personally you should as well! &lt;/p&gt;\n\n&lt;p&gt;Leave him, tell your roommate you have, tell her that you will seek out a restraining order as well, this guy is violent and if you stay with him you&amp;#39;ll end up either getting beaten up or he will control your entire life, you won&amp;#39;t even have friends to see if you do stay with him as he will get jealous of anything as he has clearly proven. All you need to do is read some of the posts here from women in a controlling relationship and unstated the gravity of staying with a person like this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8xrcr", "score_hidden": false, "stickied": false, "created": 1492188352.0, "created_utc": 1492159552.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 20}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9032d", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "stentuff", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;he has never gotten violent \n\nUntil now you mean? Because he forced his way into your apartment, scared your roommate to the point where she had to **lock herself in her room**, and then punched her boyfriend. Your bf **is violent**. \n\nIf I were your roommate I'd move out unless you dumped your bf. I wouldn't risk my own and my partner's safety like that. \n\nIt's up to you what to do, but your bf is angry and violent. If you stay, he will hit you. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;he has never gotten violent &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Until now you mean? Because he forced his way into your apartment, scared your roommate to the point where she had to &lt;strong&gt;lock herself in her room&lt;/strong&gt;, and then punched her boyfriend. Your bf &lt;strong&gt;is violent&lt;/strong&gt;. &lt;/p&gt;\n\n&lt;p&gt;If I were your roommate I&amp;#39;d move out unless you dumped your bf. I wouldn&amp;#39;t risk my own and my partner&amp;#39;s safety like that. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s up to you what to do, but your bf is angry and violent. If you stay, he will hit you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9032d", "score_hidden": false, "stickied": false, "created": 1492195882.0, "created_utc": 1492167082.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8qyj0", "gilded": 0, "archived": false, "score": 40, "report_reasons": null, "author": "codeverity", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dump your abusive, controlling, possessive, jealous, violent jerk of a boyfriend. Send one final text to your roommate telling her this and apologizing again, and give her some space. \n\nSeriously, OP - your boyfriend is ridiculous, scarily jealous and controlling when it comes to you. He accused you of cheating even though you gave a completely rational explanation. Then he scared your roommate enough that she hid in her room, and then got into a fight with her boyfriend. If he goes to jail, so be it, he's not going to learn anything if he just gets off without any punishment. And either way it shouldn't be your issue, because you shouldn't be wasting any more time with this guy. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dump your abusive, controlling, possessive, jealous, violent jerk of a boyfriend. Send one final text to your roommate telling her this and apologizing again, and give her some space. &lt;/p&gt;\n\n&lt;p&gt;Seriously, OP - your boyfriend is ridiculous, scarily jealous and controlling when it comes to you. He accused you of cheating even though you gave a completely rational explanation. Then he scared your roommate enough that she hid in her room, and then got into a fight with her boyfriend. If he goes to jail, so be it, he&amp;#39;s not going to learn anything if he just gets off without any punishment. And either way it shouldn&amp;#39;t be your issue, because you shouldn&amp;#39;t be wasting any more time with this guy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8qyj0", "score_hidden": false, "stickied": false, "created": 1492172333.0, "created_utc": 1492143533.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 40}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8xjtt", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "cman_yall", "parent_id": "t1_dg8x9y1", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well, she's not wrong. In fantasy land all problems would be solved by legal intervention... in reality, it's seldom the case.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, she&amp;#39;s not wrong. In fantasy land all problems would be solved by legal intervention... in reality, it&amp;#39;s seldom the case.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8xjtt", "score_hidden": false, "stickied": false, "created": 1492187673.0, "created_utc": 1492158873.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8x9y1", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "UltimaStone", "parent_id": "t1_dg8wluw", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah and OP is worried gaol will aggravate him. So sad. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah and OP is worried gaol will aggravate him. So sad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8x9y1", "score_hidden": false, "stickied": false, "created": 1492186790.0, "created_utc": 1492157990.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 8}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8wluw", "gilded": 0, "archived": false, "score": 18, "report_reasons": null, "author": "cman_yall", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're not at fault, your violent jackass of a boyfriend is at fault. Good news though, looks like he's being dealt with.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re not at fault, your violent jackass of a boyfriend is at fault. Good news though, looks like he&amp;#39;s being dealt with.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8wluw", "score_hidden": false, "stickied": false, "created": 1492184785.0, "created_utc": 1492155985.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 18}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8xgb4", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "dingalingalong", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; and I think I am at fault.\n\nNo.  C is at fault.  100% completely and totally.\n\n&gt; What do I need to do to make it right?\n\nYou need to DTMFA.  Jail seems like the appropriate place for him.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;and I think I am at fault.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No.  C is at fault.  100% completely and totally.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;What do I need to do to make it right?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You need to DTMFA.  Jail seems like the appropriate place for him.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8xgb4", "score_hidden": false, "stickied": false, "created": 1492187357.0, "created_utc": 1492158557.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8xn4x", "gilded": 0, "archived": false, "score": 13, "report_reasons": null, "author": "mrbetter", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "why the absolute fuck are you downplaying and justifying his issues? it is NOT normal or healthy to have a boyfriend so fucking insecure that if you go unaccounted for during a specific time that he spam calls and texts you. why the fuck are you tolerating any of this?\n\ndo you realize you're turning into that typical roommate with an abusive controlling boyfriend who your roommate probably is afraid of and doesn't want any part of? i 100% do not blame your roommate for ignoring you, you honestly have her living in an unsafe environment because you continue to tolerate an insecure abusive boyfriend who GETS INTO PHYSICAL FIGHTS AFTER FORCING HIS WAY INTO YOUR APARTMENT AND GETTING ARRESTED BECAUSE YOU WERENT HOME\n\nhe's never been violent? so what was him physically pushing his way into your apartment, and him getting into a physical fight with her boyfriend? what was him getting arrested for being violent?\n\ndear god this should be a wake up call for you to dump this idiot and get a restraining order like your roommate. here's a tip for future relationships: when someone spams your phone because you are out doing things in your life instead of giving them your undivided attention, that's a person with problems you don't want to be in a relationship with. when someone is so insecure and constantly accuses you of cheating, that is not a person you want to be in a relationship with. when a person is so insecure that they get violent and arrested because you aren't home, that is not a person you want to be in a relationship with.\n\n&gt; And I know C fucked up, and K has every right to bar him from the apartment. But I think jail is only going to aggravate his issues and he may wind up getting in more trouble.\n\nwho gives a damn if it aggravates his issues? ya it might, but you know what? that isn't a person you want to be in a relationship with. jesus christ girl, stop. YOU should be wanting to bar him from your apartment. YOU should be wanting to dump him. no one is mad at you, they are mad at your boyfriend. if you stay with him, ya they're going to be mad at you too because you are now enabling him and causing your roommate and her boyfriend to be in a dangerous, violent situation all because you want to stay with an abusive controlling asshole. or, you join your roommate and realize that this is a violent scary dude and you get a restraining order with her and guess what no one is mad at you", "edited": 1492159952.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;why the absolute fuck are you downplaying and justifying his issues? it is NOT normal or healthy to have a boyfriend so fucking insecure that if you go unaccounted for during a specific time that he spam calls and texts you. why the fuck are you tolerating any of this?&lt;/p&gt;\n\n&lt;p&gt;do you realize you&amp;#39;re turning into that typical roommate with an abusive controlling boyfriend who your roommate probably is afraid of and doesn&amp;#39;t want any part of? i 100% do not blame your roommate for ignoring you, you honestly have her living in an unsafe environment because you continue to tolerate an insecure abusive boyfriend who GETS INTO PHYSICAL FIGHTS AFTER FORCING HIS WAY INTO YOUR APARTMENT AND GETTING ARRESTED BECAUSE YOU WERENT HOME&lt;/p&gt;\n\n&lt;p&gt;he&amp;#39;s never been violent? so what was him physically pushing his way into your apartment, and him getting into a physical fight with her boyfriend? what was him getting arrested for being violent?&lt;/p&gt;\n\n&lt;p&gt;dear god this should be a wake up call for you to dump this idiot and get a restraining order like your roommate. here&amp;#39;s a tip for future relationships: when someone spams your phone because you are out doing things in your life instead of giving them your undivided attention, that&amp;#39;s a person with problems you don&amp;#39;t want to be in a relationship with. when someone is so insecure and constantly accuses you of cheating, that is not a person you want to be in a relationship with. when a person is so insecure that they get violent and arrested because you aren&amp;#39;t home, that is not a person you want to be in a relationship with.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And I know C fucked up, and K has every right to bar him from the apartment. But I think jail is only going to aggravate his issues and he may wind up getting in more trouble.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;who gives a damn if it aggravates his issues? ya it might, but you know what? that isn&amp;#39;t a person you want to be in a relationship with. jesus christ girl, stop. YOU should be wanting to bar him from your apartment. YOU should be wanting to dump him. no one is mad at you, they are mad at your boyfriend. if you stay with him, ya they&amp;#39;re going to be mad at you too because you are now enabling him and causing your roommate and her boyfriend to be in a dangerous, violent situation all because you want to stay with an abusive controlling asshole. or, you join your roommate and realize that this is a violent scary dude and you get a restraining order with her and guess what no one is mad at you&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8xn4x", "score_hidden": false, "stickied": false, "created": 1492187975.0, "created_utc": 1492159175.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8vrj6", "gilded": 0, "archived": false, "score": 12, "report_reasons": null, "author": "Orac1971", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Dump this Pratt, apologise to your roommate and her boyfriend, take this as a big warning in life, don't date loony tunes. \n\nYour roommate relationship may be over, frankly i wouldn't blame her, if she goes for a restraining order then accept that.\n\nYou have a serious boyfriend problem, he has given you the perfect excuse to dump him FFS do it.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dump this Pratt, apologise to your roommate and her boyfriend, take this as a big warning in life, don&amp;#39;t date loony tunes. &lt;/p&gt;\n\n&lt;p&gt;Your roommate relationship may be over, frankly i wouldn&amp;#39;t blame her, if she goes for a restraining order then accept that.&lt;/p&gt;\n\n&lt;p&gt;You have a serious boyfriend problem, he has given you the perfect excuse to dump him FFS do it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8vrj6", "score_hidden": false, "stickied": false, "created": 1492182425.0, "created_utc": 1492153625.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 12}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8wrww", "gilded": 0, "archived": false, "score": 15, "report_reasons": null, "author": "darkamist", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your more concerned about this man that has anger issue???\n\nAre you that desperate for a relationship that you would put your safety not to mention your friends/family/roommate security at risk?\n\nSeriously get your priorities straight. What else does this guy need to do?\n\nTime to take off those rose colored glasses and see him for what he really is.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your more concerned about this man that has anger issue???&lt;/p&gt;\n\n&lt;p&gt;Are you that desperate for a relationship that you would put your safety not to mention your friends/family/roommate security at risk?&lt;/p&gt;\n\n&lt;p&gt;Seriously get your priorities straight. What else does this guy need to do?&lt;/p&gt;\n\n&lt;p&gt;Time to take off those rose colored glasses and see him for what he really is.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8wrww", "score_hidden": false, "stickied": false, "created": 1492185273.0, "created_utc": 1492156473.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 15}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg960yj", "gilded": 0, "archived": false, "score": 9, "report_reasons": null, "author": "anumati", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This is none of your doing, except for maybe the part where you haven't dumped that pyscho fuck already.\n\nThis is not an issue he's \"working on\" this is him escalating his abusive, controlling behavior. He **physically attacked** someone. Because he couldn't deal with you missing a lunch date. This is utterly unacceptable and he has just shown you that he will hurt people.\n\n**GET THIS ASSHOLE OUT OF YOUR LIFE RIGHT NOW. BEFORE HE HURTS OR KILLS YOU. IT IS NOT YOUR JOB TO HELP HIM, \"HELPING\" HIM IS A LIE HE TELLS YOU TO MAKE YOU PUT UP WITH HIS SHIT.**", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is none of your doing, except for maybe the part where you haven&amp;#39;t dumped that pyscho fuck already.&lt;/p&gt;\n\n&lt;p&gt;This is not an issue he&amp;#39;s &amp;quot;working on&amp;quot; this is him escalating his abusive, controlling behavior. He &lt;strong&gt;physically attacked&lt;/strong&gt; someone. Because he couldn&amp;#39;t deal with you missing a lunch date. This is utterly unacceptable and he has just shown you that he will hurt people.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;GET THIS ASSHOLE OUT OF YOUR LIFE RIGHT NOW. BEFORE HE HURTS OR KILLS YOU. IT IS NOT YOUR JOB TO HELP HIM, &amp;quot;HELPING&amp;quot; HIM IS A LIE HE TELLS YOU TO MAKE YOU PUT UP WITH HIS SHIT.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg960yj", "score_hidden": false, "stickied": false, "created": 1492207570.0, "created_utc": 1492178770.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg97256", "gilded": 0, "archived": false, "score": 7, "report_reasons": null, "author": "nassauismydog", "parent_id": "t1_dg965ar", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yes! I wanted to point this part out too. This is how it starts. He's already got you thinking his anger is your fault. It's not. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yes! I wanted to point this part out too. This is how it starts. He&amp;#39;s already got you thinking his anger is your fault. It&amp;#39;s not. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg97256", "score_hidden": false, "stickied": false, "created": 1492208978.0, "created_utc": 1492180178.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 7}}], "after": null, "before": null}}, "user_reports": [], "id": "dg965ar", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "IncredibleBulk2", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; I probably should have foreseen agrravating those issues when I cancelled on lunch, but I just didn't think.\n\nNo. Just no. It is not on you to temper your absolutely reasonable behavior and choices because he is likely to have an unreasonable reaction. Lose this mindset immediately.\n\nDump him and consider joining your rommmate in a restraining order. This guy is unhinged and violent. All of this because you gave a friend a ride. Seriously, please take better care of yourself and stop making excuses for the assholes in your life.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I probably should have foreseen agrravating those issues when I cancelled on lunch, but I just didn&amp;#39;t think.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No. Just no. It is not on you to temper your absolutely reasonable behavior and choices because he is likely to have an unreasonable reaction. Lose this mindset immediately.&lt;/p&gt;\n\n&lt;p&gt;Dump him and consider joining your rommmate in a restraining order. This guy is unhinged and violent. All of this because you gave a friend a ride. Seriously, please take better care of yourself and stop making excuses for the assholes in your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg965ar", "score_hidden": false, "stickied": false, "created": 1492207741.0, "created_utc": 1492178941.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg900tr", "gilded": 0, "archived": false, "score": 10, "report_reasons": null, "author": "Rebelo86", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "YOU need to get a restraining order. Your BF is far too old to be behaving like that, and you're making far too many excuses for his behavior. He's going to be charged for assaulting W, and justifiably so. What if you'd been there? He could have beaten YOU instead. Stop apologizing to K. She'll hear you when she's ready, but you can do everyone a favor by getting that restraining order in the morning. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;YOU need to get a restraining order. Your BF is far too old to be behaving like that, and you&amp;#39;re making far too many excuses for his behavior. He&amp;#39;s going to be charged for assaulting W, and justifiably so. What if you&amp;#39;d been there? He could have beaten YOU instead. Stop apologizing to K. She&amp;#39;ll hear you when she&amp;#39;s ready, but you can do everyone a favor by getting that restraining order in the morning. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg900tr", "score_hidden": false, "stickied": false, "created": 1492195699.0, "created_utc": 1492166899.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 10}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8s7s4", "gilded": 0, "archived": false, "score": 33, "report_reasons": null, "author": "walk_through_this", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; The whole thing started around lunchtime today. In between class I had originally planned to meet my boyfriend (\"C\") and grab something to eat, but one of my other friends was having car trouble and needed a ride, so I texted C that I wouldn't make it to lunch and I was really sorry.\n\n**there is nothing at all unreasonable about this. Things come up, you're allowed to have a life.**\n\nI wanted to run through the rest of your story and highlight everything wrong, but seriously, it's just... everything. Accusing you of cheating. Blowing up your phone. Storming over to your apartment. *None of this is normal*.\n\nYour 'boyfriend' is a dangerously abusive jerk.\n\nWhat I'm worried about is the stories you're not telling. How often does he 'blow up'? What do his 'anger issues' look like? How often has he threatened you? Screamed at you? Told you you were worthless/dishonest/untrustworthy? The fact that you avoided him because you knew he was angry speaks volumes. You weren't wrong to avoid him - let me be clear on that point. His freak out does not entitle him to an audience *at all*. But the fact that you knew to avoid him, suggests to me that this sort of behavior is not entirely foreign to him. When I read your story I worry about all the things that have gone wrong that you haven't written about. \n\nPlease, talk to the police about the best way to keep this dangerous man out of your life.\n\n", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;The whole thing started around lunchtime today. In between class I had originally planned to meet my boyfriend (&amp;quot;C&amp;quot;) and grab something to eat, but one of my other friends was having car trouble and needed a ride, so I texted C that I wouldn&amp;#39;t make it to lunch and I was really sorry.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;there is nothing at all unreasonable about this. Things come up, you&amp;#39;re allowed to have a life.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I wanted to run through the rest of your story and highlight everything wrong, but seriously, it&amp;#39;s just... everything. Accusing you of cheating. Blowing up your phone. Storming over to your apartment. &lt;em&gt;None of this is normal&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Your &amp;#39;boyfriend&amp;#39; is a dangerously abusive jerk.&lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m worried about is the stories you&amp;#39;re not telling. How often does he &amp;#39;blow up&amp;#39;? What do his &amp;#39;anger issues&amp;#39; look like? How often has he threatened you? Screamed at you? Told you you were worthless/dishonest/untrustworthy? The fact that you avoided him because you knew he was angry speaks volumes. You weren&amp;#39;t wrong to avoid him - let me be clear on that point. His freak out does not entitle him to an audience &lt;em&gt;at all&lt;/em&gt;. But the fact that you knew to avoid him, suggests to me that this sort of behavior is not entirely foreign to him. When I read your story I worry about all the things that have gone wrong that you haven&amp;#39;t written about. &lt;/p&gt;\n\n&lt;p&gt;Please, talk to the police about the best way to keep this dangerous man out of your life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8s7s4", "score_hidden": false, "stickied": false, "created": 1492174560.0, "created_utc": 1492145760.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 33}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg981sc", "gilded": 0, "archived": false, "score": 8, "report_reasons": null, "author": "Bonobosaurus", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What the hell is wrong with you that you think this guy is an OK person to date?  What you need to do is break up with your BF, go with C to get a restraining order against him and block him on everything everywhere. Why aren't giant Klaxon bells of alarm going off for you here?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What the hell is wrong with you that you think this guy is an OK person to date?  What you need to do is break up with your BF, go with C to get a restraining order against him and block him on everything everywhere. Why aren&amp;#39;t giant Klaxon bells of alarm going off for you here?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg981sc", "score_hidden": false, "stickied": false, "created": 1492210260.0, "created_utc": 1492181460.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg98y19", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "thumb_of_justice", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "First, you need to break up with him. He is out of control with jealousy and anger, and he is unsafe to be around.\n\nAnd I have to say I would not forgive you either with this attitude:  \n\n&gt; If she does get the restraining order, C won't be able to come over anymore.\n\nOP, WTF??? Your crazyass boyfriend terrorized your roommate; she was hiding and frightened, and then he assaulted her boyfriend who was coming to rescue her, and you are bothered that he won't be able to come over to the apt any more? How on earth would you think it would be okay to invite him back over after he did this?? Your roommate is traumatized, and you're worried you won't get to hang out with your precious abusive boyfriend?? \n\nBreak up with him. Your friendship may or may not be able to be repaired, but if you don't break up with him, he's going to continue to wreak destruction in your life and probably eventually kill you.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First, you need to break up with him. He is out of control with jealousy and anger, and he is unsafe to be around.&lt;/p&gt;\n\n&lt;p&gt;And I have to say I would not forgive you either with this attitude:  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If she does get the restraining order, C won&amp;#39;t be able to come over anymore.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;OP, WTF??? Your crazyass boyfriend terrorized your roommate; she was hiding and frightened, and then he assaulted her boyfriend who was coming to rescue her, and you are bothered that he won&amp;#39;t be able to come over to the apt any more? How on earth would you think it would be okay to invite him back over after he did this?? Your roommate is traumatized, and you&amp;#39;re worried you won&amp;#39;t get to hang out with your precious abusive boyfriend?? &lt;/p&gt;\n\n&lt;p&gt;Break up with him. Your friendship may or may not be able to be repaired, but if you don&amp;#39;t break up with him, he&amp;#39;s going to continue to wreak destruction in your life and probably eventually kill you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98y19", "score_hidden": false, "stickied": false, "created": 1492211378.0, "created_utc": 1492182578.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg91bi8", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Lfalias", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Who cares if your horrible, horrible SO has his issues aggravated by going to jail or whatever. \n\nWhy would you want to be with a lout like that?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Who cares if your horrible, horrible SO has his issues aggravated by going to jail or whatever. &lt;/p&gt;\n\n&lt;p&gt;Why would you want to be with a lout like that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg91bi8", "score_hidden": false, "stickied": false, "created": 1492199222.0, "created_utc": 1492170422.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg97yqx", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Claude_Shea", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Oh my god your boyfriend is bad news. \n\nYour roommate should ABSOLUTELY pursue a restraining order. \n\nYour boyfriend ABSOLUTELY deserved to spend time in jail. \n\nWhat do you do to make it right? Break up with the boyfriend, never speak to him again, and support K in pursuing the RO. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh my god your boyfriend is bad news. &lt;/p&gt;\n\n&lt;p&gt;Your roommate should ABSOLUTELY pursue a restraining order. &lt;/p&gt;\n\n&lt;p&gt;Your boyfriend ABSOLUTELY deserved to spend time in jail. &lt;/p&gt;\n\n&lt;p&gt;What do you do to make it right? Break up with the boyfriend, never speak to him again, and support K in pursuing the RO. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg97yqx", "score_hidden": false, "stickied": false, "created": 1492210153.0, "created_utc": 1492181353.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9357m", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "SkullBearer", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I'd break up with the boyfriend, and take your roommate and bf out for dinner or something. It's not your fault your bf's a psycho, but your actions, however accidentally, put them in danger. Apologizing to them and treating them will do a lot to keep the peace.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d break up with the boyfriend, and take your roommate and bf out for dinner or something. It&amp;#39;s not your fault your bf&amp;#39;s a psycho, but your actions, however accidentally, put them in danger. Apologizing to them and treating them will do a lot to keep the peace.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9357m", "score_hidden": false, "stickied": false, "created": 1492203028.0, "created_utc": 1492174228.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg97x4n", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Aladdin_Caine", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You are so far from being okay that the light from Planet Okay may not reach you for several years, assuming this dude doesn't kill you before then.\n\nWho taught you that it was acceptable for a boyfriend to call/text 20+ times on the space of an hour? Who taught you that it was your responsibility to anticipate this dude's outsized response to a normal situation  (not being able to make it to lunch and being unreachable for an hour)?\n\nYou basically hid from/avoided your boyfriend because you did not want to deal with his reactions anymore. Some part of you knows that this is fucked. Find that part. Embrace that part.\n\nYour boyfriend is going to destroy your life until he's the only thing in it. That's his idea of heaven and it's going to be your hell if you don't wake the fuck up and realise that the call is coming from inside the house.\n\nBreak up with this dude. Get a restraining order along with your flatmate. Apologise to yout flatmate about not being immediately on her side with horror at your boyfriend's actions because you are in the fog of an abusive relationship (YES YOU FUCKING ARE). Tell your friends and family about him. Be super fucking vigilant about your safety. Do not see him in person for any reason. Do not see him alone for any reason. If you see him coming, run for your fucking life. Get some goddamn therapy so you can have some help sorting through all of this crap. \n\nIf you do all of this, you just might end up okay. This needs to be the turning point where you walk away from this man, otherwise it's the turning point where you lose the support of your flatmate and maybe your home. It's the turning point where he starts hitting you, because that's where this is headed. \n\nYour being okay with his actions, and making excuses, and blaming yourself for not acting in a way that prevented him from getting violent? That shit is the primer. What you've been primed for is to stay and make excuses and accept apologies the first time he hits you. Based on this post I'd say you've been pretty exquisitely primed.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are so far from being okay that the light from Planet Okay may not reach you for several years, assuming this dude doesn&amp;#39;t kill you before then.&lt;/p&gt;\n\n&lt;p&gt;Who taught you that it was acceptable for a boyfriend to call/text 20+ times on the space of an hour? Who taught you that it was your responsibility to anticipate this dude&amp;#39;s outsized response to a normal situation  (not being able to make it to lunch and being unreachable for an hour)?&lt;/p&gt;\n\n&lt;p&gt;You basically hid from/avoided your boyfriend because you did not want to deal with his reactions anymore. Some part of you knows that this is fucked. Find that part. Embrace that part.&lt;/p&gt;\n\n&lt;p&gt;Your boyfriend is going to destroy your life until he&amp;#39;s the only thing in it. That&amp;#39;s his idea of heaven and it&amp;#39;s going to be your hell if you don&amp;#39;t wake the fuck up and realise that the call is coming from inside the house.&lt;/p&gt;\n\n&lt;p&gt;Break up with this dude. Get a restraining order along with your flatmate. Apologise to yout flatmate about not being immediately on her side with horror at your boyfriend&amp;#39;s actions because you are in the fog of an abusive relationship (YES YOU FUCKING ARE). Tell your friends and family about him. Be super fucking vigilant about your safety. Do not see him in person for any reason. Do not see him alone for any reason. If you see him coming, run for your fucking life. Get some goddamn therapy so you can have some help sorting through all of this crap. &lt;/p&gt;\n\n&lt;p&gt;If you do all of this, you just might end up okay. This needs to be the turning point where you walk away from this man, otherwise it&amp;#39;s the turning point where you lose the support of your flatmate and maybe your home. It&amp;#39;s the turning point where he starts hitting you, because that&amp;#39;s where this is headed. &lt;/p&gt;\n\n&lt;p&gt;Your being okay with his actions, and making excuses, and blaming yourself for not acting in a way that prevented him from getting violent? That shit is the primer. What you&amp;#39;ve been primed for is to stay and make excuses and accept apologies the first time he hits you. Based on this post I&amp;#39;d say you&amp;#39;ve been pretty exquisitely primed.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg97x4n", "score_hidden": false, "stickied": false, "created": 1492210096.0, "created_utc": 1492181296.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg99dhn", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "keight07", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "So, I was in an insanely abusive relationship for five years. When he got caught, finally, he got arrested for assault, assault with a deadly weapon, forcible confinement and *attempted murder*. I lived in a battered women's shelter for 21 days. To look at me, you'd never guess. It doesn't matter. It never matters.\n\n\n\nWhat matters is that this is exactly how it started. The isolation due to incidents like this. Me explaining away jealousy and other incidents. \n\n\nYou obviously don't want to hear it, but your ex (because that's what he needs to be) is abusive already, he has you convinced you are somehow at fault without even talking to you!\n\n\nGirl. Run. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So, I was in an insanely abusive relationship for five years. When he got caught, finally, he got arrested for assault, assault with a deadly weapon, forcible confinement and &lt;em&gt;attempted murder&lt;/em&gt;. I lived in a battered women&amp;#39;s shelter for 21 days. To look at me, you&amp;#39;d never guess. It doesn&amp;#39;t matter. It never matters.&lt;/p&gt;\n\n&lt;p&gt;What matters is that this is exactly how it started. The isolation due to incidents like this. Me explaining away jealousy and other incidents. &lt;/p&gt;\n\n&lt;p&gt;You obviously don&amp;#39;t want to hear it, but your ex (because that&amp;#39;s what he needs to be) is abusive already, he has you convinced you are somehow at fault without even talking to you!&lt;/p&gt;\n\n&lt;p&gt;Girl. Run. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg99dhn", "score_hidden": false, "stickied": false, "created": 1492211899.0, "created_utc": 1492183099.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg92rf7", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "EE_108", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "This isn't your fault and isn't your place to make right. \n\nYour boyfriend is fucking nuts and resorted to breaking and entering and then assault rather than just taking you at your word. \n\nWhat you should do is leave him before he kills you or goes to jail over another misunderstanding.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This isn&amp;#39;t your fault and isn&amp;#39;t your place to make right. &lt;/p&gt;\n\n&lt;p&gt;Your boyfriend is fucking nuts and resorted to breaking and entering and then assault rather than just taking you at your word. &lt;/p&gt;\n\n&lt;p&gt;What you should do is leave him before he kills you or goes to jail over another misunderstanding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg92rf7", "score_hidden": false, "stickied": false, "created": 1492202318.0, "created_utc": 1492173518.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg95zto", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "ttlens", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Break up with him immediately and pursue a restraining order. This man is dangerous, do not EVER be alone with him again.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Break up with him immediately and pursue a restraining order. This man is dangerous, do not EVER be alone with him again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg95zto", "score_hidden": false, "stickied": false, "created": 1492207525.0, "created_utc": 1492178725.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg97xes", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "DarthGregor", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your bf needs to be in jail to keep him away from other people. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your bf needs to be in jail to keep him away from other people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg97xes", "score_hidden": false, "stickied": false, "created": 1492210106.0, "created_utc": 1492181306.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg98233", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "Leogirly", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Support your roommate but give her space. You will need to build up trust with her again. She needs to feel safe in her own home too and this dangerous person had a relationship with you. I suggest distancing yourself from danger.  \n\nDitch this guy. You know he has anger issues and is violent, look into having a friend or two present for the break up. Get a restraining order if needed. You obviously don't want to deal with this s**t, so dont do it anymore. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Support your roommate but give her space. You will need to build up trust with her again. She needs to feel safe in her own home too and this dangerous person had a relationship with you. I suggest distancing yourself from danger.  &lt;/p&gt;\n\n&lt;p&gt;Ditch this guy. You know he has anger issues and is violent, look into having a friend or two present for the break up. Get a restraining order if needed. You obviously don&amp;#39;t want to deal with this s**t, so dont do it anymore. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98233", "score_hidden": false, "stickied": false, "created": 1492210272.0, "created_utc": 1492181472.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg99wnn", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "unsaferaisin", "parent_id": "t1_dg98fcq", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah, honestly, K would be well within her rights to kick OP out of the apartment, or move and leave OP with the lease.  This fucking lunatic abuser *assaulted and battered her, and her partner,* in her home.  There's no coming back from that, not really.  If I were K, I'd be all over that restraining order, and it's likely that my friendship with OP would not survive- definitely not if she stayed with that abusive monster.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, honestly, K would be well within her rights to kick OP out of the apartment, or move and leave OP with the lease.  This fucking lunatic abuser &lt;em&gt;assaulted and battered her, and her partner,&lt;/em&gt; in her home.  There&amp;#39;s no coming back from that, not really.  If I were K, I&amp;#39;d be all over that restraining order, and it&amp;#39;s likely that my friendship with OP would not survive- definitely not if she stayed with that abusive monster.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg99wnn", "score_hidden": false, "stickied": false, "created": 1492212535.0, "created_utc": 1492183735.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "id": "dg98fcq", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "suckzbuttz69420bro", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Your boyfriend is an abusive sack of shit. And if you were my roommate, I would want you to give me space and if you ever tried to bring your abusive POS boyfriend over to my house, we would have issues. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Your boyfriend is an abusive sack of shit. And if you were my roommate, I would want you to give me space and if you ever tried to bring your abusive POS boyfriend over to my house, we would have issues. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98fcq", "score_hidden": false, "stickied": false, "created": 1492210736.0, "created_utc": 1492181936.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9afsh", "gilded": 0, "archived": false, "score": 4, "report_reasons": null, "author": "moghediene", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "First you need to dump your boyfriend, he's a loose canon.\n\nSecond, you need to learn to communicate better, you're actions/inactions put your roommate in very real danger.  You basically allowed your rabid dog to go to your apartment and left your roommate to deal with it.\n\nThe fact that you're worried he's going to get into trouble for acting like a violent thug tells me you have a lot of growing up to do.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;First you need to dump your boyfriend, he&amp;#39;s a loose canon.&lt;/p&gt;\n\n&lt;p&gt;Second, you need to learn to communicate better, you&amp;#39;re actions/inactions put your roommate in very real danger.  You basically allowed your rabid dog to go to your apartment and left your roommate to deal with it.&lt;/p&gt;\n\n&lt;p&gt;The fact that you&amp;#39;re worried he&amp;#39;s going to get into trouble for acting like a violent thug tells me you have a lot of growing up to do.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9afsh", "score_hidden": false, "stickied": false, "created": 1492213165.0, "created_utc": 1492184365.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8z6ho", "gilded": 0, "archived": false, "score": 6, "report_reasons": null, "author": "Strangeandweird", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Well, you want to stay with a violent guy. It's understandable people who've been victimised by him will want to stay away from you. By supporting him you're definitely saying you're okay with his behaviour and will let him victimise them again. No one is going to feel safe around you either. That's going to suck but supporting him will not leave many people happy with you withdrawing support from their concerns. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, you want to stay with a violent guy. It&amp;#39;s understandable people who&amp;#39;ve been victimised by him will want to stay away from you. By supporting him you&amp;#39;re definitely saying you&amp;#39;re okay with his behaviour and will let him victimise them again. No one is going to feel safe around you either. That&amp;#39;s going to suck but supporting him will not leave many people happy with you withdrawing support from their concerns. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8z6ho", "score_hidden": false, "stickied": false, "created": 1492193014.0, "created_utc": 1492164214.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg91idl", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "salt_and_linen", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What exactly do you think your boyfriend would have done to you if you were home?", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What exactly do you think your boyfriend would have done to you if you were home?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg91idl", "score_hidden": false, "stickied": false, "created": 1492199667.0, "created_utc": 1492170867.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg98ekt", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "PsiRedEye22", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I cant believe this isnt a troll post.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I cant believe this isnt a troll post.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg98ekt", "score_hidden": false, "stickied": false, "created": 1492210709.0, "created_utc": 1492181909.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9k9kj", "gilded": 0, "archived": false, "score": 3, "report_reasons": null, "author": "Mobile_pasta", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Yeah you literally put your friend in danger by continuing to be in a relationship with a crazy jealous angry psychopath. If you're really that masochistic that's fine but get a decent person to role play with instead of putting your roommates friends and family at the mercy of a psycho who you can conveniently ignore while he rages on your roommate instead", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah you literally put your friend in danger by continuing to be in a relationship with a crazy jealous angry psychopath. If you&amp;#39;re really that masochistic that&amp;#39;s fine but get a decent person to role play with instead of putting your roommates friends and family at the mercy of a psycho who you can conveniently ignore while he rages on your roommate instead&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9k9kj", "score_hidden": false, "stickied": false, "created": 1492224475.0, "created_utc": 1492195675.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9a4ve", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "CaptainJamie", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "I can't stand when people on Reddit post obvious situations where they know 100% they're in the right but act like they think they are wrong. \"A guy stabbed me 100 times but I think it was my fault because I rejected him, should I apologise?\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t stand when people on Reddit post obvious situations where they know 100% they&amp;#39;re in the right but act like they think they are wrong. &amp;quot;A guy stabbed me 100 times but I think it was my fault because I rejected him, should I apologise?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9a4ve", "score_hidden": false, "stickied": false, "created": 1492212809.0, "created_utc": 1492184009.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9aebj", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "jarroz61", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "What do you need to do make it right?? Uhhhh.... you need to LEAVE C. He is an absolute nutcase. Seriously. He has serious issues that you can't fix. Jail is EXACTLY where he should be right now. Not only should K get a restraining order, but so should you!!!! You and K's safety and well-being  should be way higher on your priority list over your poor boyfriend's \"feelings.\"", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you need to do make it right?? Uhhhh.... you need to LEAVE C. He is an absolute nutcase. Seriously. He has serious issues that you can&amp;#39;t fix. Jail is EXACTLY where he should be right now. Not only should K get a restraining order, but so should you!!!! You and K&amp;#39;s safety and well-being  should be way higher on your priority list over your poor boyfriend&amp;#39;s &amp;quot;feelings.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9aebj", "score_hidden": false, "stickied": false, "created": 1492213118.0, "created_utc": 1492184318.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9dwqr", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "DankJemo", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "C is a real piece of shit. You may have been a bit evasive about it, but given his personality, that's understandable. His ass belongs in jail. Not only does he have anger problemsvit sounds like he actively looks for reasons to be pissed off. Your boyfriend is asking to have his ass kicked, acting like this and after reading through this, i hope W rang his bell a few times in the off chance it knocked some sense into him. You're already exhibiting signs of psychological abuse. You're blaming youself for actions he committed, despite being perfectly clear that you're not home. You avoid him when he wants to \"talk\" because you know he is just going to yell. Girl, what the fuck are you doing with this loser? Yeah, we've all got problrms we need to work through, but when you're taking this problems out on the people around you, then you are using your problems to justify hurting others. Get out of this toxic relationship and take your time to find a man that's not going to be a complete fucking piece of shit. ", "edited": 1492189009.0, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;C is a real piece of shit. You may have been a bit evasive about it, but given his personality, that&amp;#39;s understandable. His ass belongs in jail. Not only does he have anger problemsvit sounds like he actively looks for reasons to be pissed off. Your boyfriend is asking to have his ass kicked, acting like this and after reading through this, i hope W rang his bell a few times in the off chance it knocked some sense into him. You&amp;#39;re already exhibiting signs of psychological abuse. You&amp;#39;re blaming youself for actions he committed, despite being perfectly clear that you&amp;#39;re not home. You avoid him when he wants to &amp;quot;talk&amp;quot; because you know he is just going to yell. Girl, what the fuck are you doing with this loser? Yeah, we&amp;#39;ve all got problrms we need to work through, but when you&amp;#39;re taking this problems out on the people around you, then you are using your problems to justify hurting others. Get out of this toxic relationship and take your time to find a man that&amp;#39;s not going to be a complete fucking piece of shit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9dwqr", "score_hidden": false, "stickied": false, "created": 1492217066.0, "created_utc": 1492188266.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9lb3p", "gilded": 0, "archived": false, "score": 2, "report_reasons": null, "author": "MondoDongo", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "Goddamn all this talk about you \"aggravating his issues\" is bullshit. Dude is a violent, jealous nut bag and nothing you have done is wrong or has anything to do with him being this way. This is all him, and he's a fucking jack ass, and you need to bail.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Goddamn all this talk about you &amp;quot;aggravating his issues&amp;quot; is bullshit. Dude is a violent, jealous nut bag and nothing you have done is wrong or has anything to do with him being this way. This is all him, and he&amp;#39;s a fucking jack ass, and you need to bail.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9lb3p", "score_hidden": false, "stickied": false, "created": 1492225740.0, "created_utc": 1492196940.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9fqsr", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "postwarmutant", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "K should be getting a restraining order, and you're absolutely right about C not coming over anymore - because he will be in prison, which is where he belongs after all this. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;K should be getting a restraining order, and you&amp;#39;re absolutely right about C not coming over anymore - because he will be in prison, which is where he belongs after all this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9fqsr", "score_hidden": false, "stickied": false, "created": 1492219151.0, "created_utc": 1492190351.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9p4nv", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "Upallnight88", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt;I should probably add, C does sometimes have jealousy/anger issues.\n\nThat's an understatement.  You can't do anything to make it right because that's C's job.  Wait for your room mate to cool off and then apologize and dump C.  He has anger and jealousy problems.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I should probably add, C does sometimes have jealousy/anger issues.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s an understatement.  You can&amp;#39;t do anything to make it right because that&amp;#39;s C&amp;#39;s job.  Wait for your room mate to cool off and then apologize and dump C.  He has anger and jealousy problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9p4nv", "score_hidden": false, "stickied": false, "created": 1492230334.0, "created_utc": 1492201534.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9rysp", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "PigeonGuillemot", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You're getting a lot of responses from people who seem to never have been in an abusive relationship and don't know how warped your perspective becomes. You seem unaware that you are in a relationship with an abusive man, yourself. Some abusers are just that insidiously good at what they do. It's like some of them got an advanced degree.\n\nYou don't understand that C is *inherently* violent and *inherently* controlling. You think he's angry in response to your behaviors; you think his angry persona is your fault. He told you it is -- that if you did things differently, he wouldn't be an angry person -- and you believe him. You didn't think that your roommate was at risk because she's not the one who had to cancel lunch with him. \n\nBut abusers' anger is a fungible thing. If an abuser's primary target isn't available, he'll abuse whoever is in his orbit to bring her back in line. A favorite punching-bag of abusers is their target's pets, for example. This especially comes in handy later in the relationship, when the target stops valuing herself at all. The abuser has to find something to hurt that will produce a reaction in her, because the target herself has gone numb.\n\nYes, your decisions led to him coming to your apartment. But that does not make you in any way responsible for his actions. C is in jail because he deserves to be in jail. He's out of control and needs to be locked up for his own good. \n\nThe way you make this right, to repeat what everyone else has said, is to not side with C against your roommate and her boyfriend. It's to ally with K and W against C. It's to tell C that he isn't welcome in your apartment or your life anymore.\n\n*If you are afraid to break up with C, that is yet another sign you are in an abusive relationship.*\n\nI'm sorry this happened to you, and to your roommate, and to her partner. I promise that after you break up with C, you will gradually regain your perspective. You'll be able to see him for who and what he really is. But if you stay, it will get worse and worse. All the light will go out of your eyes and your body will suffer. I can promise you that too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re getting a lot of responses from people who seem to never have been in an abusive relationship and don&amp;#39;t know how warped your perspective becomes. You seem unaware that you are in a relationship with an abusive man, yourself. Some abusers are just that insidiously good at what they do. It&amp;#39;s like some of them got an advanced degree.&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t understand that C is &lt;em&gt;inherently&lt;/em&gt; violent and &lt;em&gt;inherently&lt;/em&gt; controlling. You think he&amp;#39;s angry in response to your behaviors; you think his angry persona is your fault. He told you it is -- that if you did things differently, he wouldn&amp;#39;t be an angry person -- and you believe him. You didn&amp;#39;t think that your roommate was at risk because she&amp;#39;s not the one who had to cancel lunch with him. &lt;/p&gt;\n\n&lt;p&gt;But abusers&amp;#39; anger is a fungible thing. If an abuser&amp;#39;s primary target isn&amp;#39;t available, he&amp;#39;ll abuse whoever is in his orbit to bring her back in line. A favorite punching-bag of abusers is their target&amp;#39;s pets, for example. This especially comes in handy later in the relationship, when the target stops valuing herself at all. The abuser has to find something to hurt that will produce a reaction in her, because the target herself has gone numb.&lt;/p&gt;\n\n&lt;p&gt;Yes, your decisions led to him coming to your apartment. But that does not make you in any way responsible for his actions. C is in jail because he deserves to be in jail. He&amp;#39;s out of control and needs to be locked up for his own good. &lt;/p&gt;\n\n&lt;p&gt;The way you make this right, to repeat what everyone else has said, is to not side with C against your roommate and her boyfriend. It&amp;#39;s to ally with K and W against C. It&amp;#39;s to tell C that he isn&amp;#39;t welcome in your apartment or your life anymore.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;If you are afraid to break up with C, that is yet another sign you are in an abusive relationship.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry this happened to you, and to your roommate, and to her partner. I promise that after you break up with C, you will gradually regain your perspective. You&amp;#39;ll be able to see him for who and what he really is. But if you stay, it will get worse and worse. All the light will go out of your eyes and your body will suffer. I can promise you that too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9rysp", "score_hidden": false, "stickied": false, "created": 1492233833.0, "created_utc": 1492205033.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9w9cj", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "ATaleOf2Kitties", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "You should be the one getting a restraining order too. This is just sad. Your bf is dangerous and deserves to be in jail. If he hasn't been violent yet, he will. Look at how desensitized to his behavior you already are. ", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You should be the one getting a restraining order too. This is just sad. Your bf is dangerous and deserves to be in jail. If he hasn&amp;#39;t been violent yet, he will. Look at how desensitized to his behavior you already are. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9w9cj", "score_hidden": false, "stickied": false, "created": 1492239483.0, "created_utc": 1492210683.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg9wvjf", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "NastySpitGobbler", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "&gt; He has been working on it and he has never gotten violent, \n\nNow he HAS gotten violent. He got violent because you canceled a lunch date to help a friend. Decent people don't do that. \n\nIf you don't break up with him NOW, it will only get worse because he will have gotten away with his shitty behavior. You should also tell the police that you are breaking up with him, because he may  become even more violent towards you. Please be careful. You are NOT SAFE.\n\nYou fix this by breaking up with him, apologizing to your roommate and her boyfriend, and helping her get a restraining order. Please think seriously about getting a restraining order for yourself, too.", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;He has been working on it and he has never gotten violent, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Now he HAS gotten violent. He got violent because you canceled a lunch date to help a friend. Decent people don&amp;#39;t do that. &lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t break up with him NOW, it will only get worse because he will have gotten away with his shitty behavior. You should also tell the police that you are breaking up with him, because he may  become even more violent towards you. Please be careful. You are NOT SAFE.&lt;/p&gt;\n\n&lt;p&gt;You fix this by breaking up with him, apologizing to your roommate and her boyfriend, and helping her get a restraining order. Please think seriously about getting a restraining order for yourself, too.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg9wvjf", "score_hidden": false, "stickied": false, "created": 1492240306.0, "created_utc": 1492211506.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qjvn", "removal_reason": null, "link_id": "t3_659zxo", "likes": null, "replies": "", "user_reports": [], "id": "dg8s8sq", "gilded": 0, "archived": false, "score": -1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8s0an", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8s8sq", "score_hidden": false, "stickied": false, "created": 1492174612.0, "created_utc": 1492145812.0, "depth": 2, "mod_reports": [], "subreddit_type": "public", "ups": -1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8s0an", "gilded": 0, "archived": false, "score": 1, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_dg8rr75", "subreddit_name_prefixed": "r/relationships", "controversiality": 0, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8s0an", "score_hidden": false, "stickied": false, "created": 1492174175.0, "created_utc": 1492145375.0, "depth": 1, "mod_reports": [], "subreddit_type": "public", "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "id": "dg8rr75", "gilded": 0, "archived": false, "score": 5, "report_reasons": null, "author": "[deleted]", "parent_id": "t3_659zxo", "subreddit_name_prefixed": "r/relationships", "controversiality": 1, "body": "[removed]", "edited": false, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "relationships", "name": "t1_dg8rr75", "score_hidden": false, "stickied": false, "created": 1492173716.0, "created_utc": 1492144916.0, "depth": 0, "mod_reports": [], "subreddit_type": "public", "ups": 5}}], "after": null, "before": null}}]